Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_3d_scenes/import_configuration.po
Languages: de, zh_cn, zh_tw

source: **Embedded Texture Handling:** Controls how textures embedded within glTF scenes should be handled. **Discard All Textures** will not import any textures, which is useful if you wish to manually set up materials in Godot instead. **Extract Textures** extracts textures to external images, resulting in smaller file sizes and more control over import options. **Embed as Basis Universal** and **Embed as Uncompressed** keeps the textures embedded in the imported scene, with and without VRAM compression respectively.
de: **Behandlung eingebetteter Texturen:** Steuert, wie in glTF-Szenen eingebettete Texturen behandelt werden sollen. **Alle Texturen verwerfen** importiert keine Texturen, was nützlich ist, wenn Sie stattdessen Materialien manuell in Godot einrichten möchten. **Texturen extrahieren** extrahiert Texturen in externe Bilder, was zu kleineren Dateigrößen und mehr Kontrolle über die Importoptionen führt. **Einbetten als Basis Universal** und **Einbetten als Unkomprimiert** lässt die Texturen in der importierten Szene eingebettet, mit bzw. ohne VRAM-Kompression.
zh_cn: **嵌入图像处理：** 控制如何处理嵌入 glTF 场景中的纹理。 **Discard All Textures** （忽略所有纹理）不会导入任何纹理，如果你想在 Godot 中手动设置材质，该选项将非常有用。 **Extract Textures** （提取纹理）将纹理提取到外部图像中，从而减小文件大小，并对导入选项进行更多控制。 **Embed as Basis Universal** （嵌入为基础通用）和 **Embed as Uncompressed** （嵌入为未压缩）分别将纹理嵌入已导入的场景中，并对 VRAM 进行压缩和不压缩。
zh_tw: **嵌入紋理處理：** 控制如何處理嵌入到 glTF 場景中的紋理。 **放棄所有紋理**不會匯入任何紋理，如果您希望在 Godot 中手動設定材質，這會很有用。 **提取紋理** 將紋理提取到外部圖像，從而縮小檔案大小並更好地控制匯入選項。 **嵌入為基礎通用**和**嵌入為未壓縮**將紋理嵌入到匯入的場景中，分別使用和不使用 VRAM 壓縮。

source: Using the Advanced Import Settings dialog
de: Verwendung des Dialogs Erweiterte Importeinstellungen
zh_cn: 使用高级导入设置对话框
zh_tw: 使用高級匯入設定對話方塊

source: The first tab you'll see is the **Scene** tab. The options available in the panel on the right are identical to the Import dock, but you have access to a 3D preview. The 3D preview can be rotated by holding down the left mouse button then dragging the mouse. Zoom can be adjusted using the mouse wheel.
de: Der erste Tab, den Sie sehen werden, ist der **Szenen**-Tab. Die Optionen auf der rechten Seite sind identisch mit denen des Import-Docks, aber Sie haben Zugriff auf eine 3D-Vorschau. Die 3D-Vorschau kann rotiert werden, indem Sie die linke Maustaste gedrückt halten und die Maus ziehen. Der Zoom kann mit dem Mausrad eingestellt werden.
zh_cn: 你看到的第一个选项卡是\ **场景**\ 选项卡。右侧面板中的选项与“导入”面板相同，但是你还可以看到 3D 预览。按住鼠标左键并拖动鼠标就能够旋转 3D 预览。缩放可以通过鼠标滚轮调整。
zh_tw: 你看到的第一個分頁是**場景**分頁。右側面板中的選項與“匯入”面板相同，但是你還可以看到 3D 預覽。按住滑鼠左鍵並拖動滑鼠就能夠旋轉 3D 預覽。縮放可以通過滑鼠滾輪調整。

source: Advanced Import Settings dialog (Scene tab)
de: Dialogfeld Erweiterte Importeinstellungen (Szenen-Tab)
zh_cn: 高级导入设置对话框（场景选项卡）
zh_tw: 高級匯入設定對話方塊（場景分頁）

source: Advanced Import Settings dialog (Scene tab). Credit: `Modern Arm Chair 01 - Poly Haven <https://polyhaven.com/a/modern_arm_chair_01>`__
de: Dialogfeld Erweiterte Importeinstellungen (Szenen-Tab). Quelle: `Modern Arm Chair 01 - Poly Haven <https://polyhaven.com/a/modern_arm_chair_01>`__
zh_cn: 高级导入设置对话框（场景选项卡）。作者：\ `Modern Arm Chair 01 - Poly Haven <https://polyhaven.com/a/modern_arm_chair_01>`__
zh_tw: 高級匯入設定對話方塊（場景分頁）。作者：`Modern Arm Chair 01 - Poly Haven <https://polyhaven.com/a/modern_arm_chair_01>`__

source: **Configuring node import options**
de: **Konfiguration der Node-Importoptionen**
zh_cn: **配置节点导入选项**
zh_tw: 訊號與屬性

source: You can select individual nodes that compose the scene while in the **Scene** tab using the tree view at the left:
de: Sie können einzelne Nodes, aus denen die Szene besteht, im **Szene**-Tab auswählen, indem Sie die Baumansicht auf der linken Seite verwenden:
zh_cn: 在\ **场景**\ 选项卡中，可以在左侧的树状视图中单独选中构成场景的节点：
zh_tw: 在**場景**分頁中，可以在左側的樹狀視圖中單獨選中構成場景的節點：

source: Selecting a node in the Advanced Import Settings dialog (Scene tab)
de: Auswahl eines Nodes im Dialogfeld Erweiterte Importeinstellungen (Szenentab)
zh_cn: 在高级导入设置对话框（场景选项卡）中选中节点
zh_tw: 在高級匯入設定對話方塊（場景分頁）中選中節點

source: Selecting a node in the Advanced Import Settings dialog (Materials tab)
de: Auswählen eines Nodes im Dialogfeld Erweiterte Importeinstellungen (Materialien-Tab)
zh_cn: 在高级导入设置对话框（材质选项卡）中选中节点
zh_tw: 在高級匯入設定對話方塊（材質分頁）中選中節點

source: This exposes several per-node import options:
de: Dadurch werden mehrere Importoptionen für jeden einzelnen Node verfügbar:
zh_cn: 这样就会出现针对节点的导入选项：
zh_tw: 這樣就會出現針對節點的匯入選項：

source: **Skip Import:** If checked, the node will not be present in the final imported scene. Enabling this disables all other options.
de: **Import überspringen:** Wenn diese Option aktiviert ist, wird der Node in der endgültigen importierten Szene nicht vorhanden sein. Durch die Aktivierung dieser Option werden alle anderen Optionen deaktiviert.
zh_cn: **跳过导入：**\ 勾选后，该节点不会出现在最终导入的场景中。启用这个选项会禁用其他所有选项。
zh_tw: **跳過匯入：**勾選後，該節點不會出現在最終匯入的場景中。啟用這個選項會禁用其他所有選項。

source: **Generate > Physics:** If checked, generates a PhysicsBody3D *parent* node with collision shapes that are *siblings* to the MeshInstance3D node.
de: **Generieren > Physik:** Wenn diese Option aktiviert ist, wird ein PhysicsBody3D *Parent*-Node mit Collision Shapes erzeugt, die *Nachbarn* des MeshInstance3D-Node sind.
zh_cn: **生成 > 物理：**\ 勾选后，会生成一个 PhysicsBody3D *父节点*\ ，碰撞形状会作为该 MeshInstance3D 节点的\ *兄弟节点*\ 。
zh_tw: **生成 > 物理：**勾選後，會生成一個 PhysicsBody3D *父節點*，碰撞形狀會作為該 MeshInstance3D 節點的*兄弟節點*。

source: **Generate > NavMesh:** If checked, generates a NavigationRegion3D *child* node for :ref:`navigation <doc_navigation_overview_3d>`. **Mesh + NavMesh** will keep the original mesh visible, while **NavMesh Only** will only import the navigation mesh (without a visual representation). **NavMesh Only** is meant to be used when you've manually authored a simplified mesh for navigation.
de: **Generieren > NavMesh:** Wenn diese Option aktiviert ist, wird ein NavigationRegion3D *Child*-Node für :ref:`Navigation <doc_navigation_overview_3d>` erzeugt. Mit **Mesh + NavMesh** bleibt das ursprüngliche Mesh sichtbar, während **Nur NavMesh** nur das Navigations-Mesh importiert (ohne visuelle Darstellung). **Nur NavMesh** sollte verwendet werden, wenn Sie manuell ein vereinfachtes Mesh für die Navigation erstellt haben.
zh_cn: **生成 > 导航网格：**\ 勾选后，会生成一个 NavigationRegion3D *子节点*\ 用于进行\ :ref:`导航 <doc_navigation_overview_3d>`\ 。\ **Mesh + NavMesh** 会保持原有网格可见，而 **NavMesh Only** 则只会导入导航网格（不带可视化表示）。\ **NavMesh Only** 应该在手动制作了用于导航的简化网格时使用。
zh_tw: **生成 > 導覽網格：**勾選後，會生成一個 NavigationRegion3D *子節點*用於進行:ref:`導覽 <doc_navigation_overview_3d>`。**Mesh + NavMesh** 會保持原有網格可見，而 **NavMesh Only** 則只會匯入導覽網格（不帶視覺化表示）。**NavMesh Only** 應該在手動製作了用於導覽的簡化網格時使用。

source: **Generate > Occluder:** If checked, generates an OccluderInstance3D *sibling* node for :ref:`occlusion culling <doc_occlusion_culling>` using the mesh's geometry as a basis for the occluder's shape. **Mesh + Occluder** will keep the original mesh visible, while **Occluder Only** will only import the occluder (without a visual representation). **Occluder Only** is meant to be used when you've manually authored a simplified mesh for occlusion culling.
de: **Generieren > Occluder:** Wenn diese Option aktiviert ist, wird ein OccluderInstance3D *Nachbar*-Node für :ref:`Occlusion Culling <doc_occlusion_culling>` erzeugt, wobei die Geometrie des Meshes als Basis für die Form des Occluders verwendet wird. Mit **Mesh + Occluder** bleibt das ursprüngliche Netz sichtbar, während mit **Nur Occluder** nur der Occluder (ohne visuelle Darstellung) importiert wird. **Nur Occluder** ist für den Fall gedacht, dass Sie manuell ein vereinfachtes Mesh für das Occlusion Culling erstellt haben.
zh_cn: **生成 > 遮挡器：**\ 勾选后，会生成一个 OccluderInstance3D *兄弟节点*\ 用于进行\ :ref:`遮挡剔除 <doc_occlusion_culling>`\ ，会使用网格的几何体作为遮挡器形状的基础。\ **Mesh + Occluder** 会保持原有网格可见，而 **Occluder Only** 则只会导入遮挡器（不带可视化表示）。\ **Occluder Only** 应该在手动制作了用于遮挡剔除的简化网格时使用。
zh_tw: **生成 > 遮擋器：**勾選後，會生成一個 OccluderInstance3D *兄弟節點*用於進行:ref:`遮擋剔除 <doc_occlusion_culling>`，會使用網格的幾何體作為遮擋器形狀的基礎。**Mesh + Occluder** 會保持原有網格可見，而 **Occluder Only** 則只會匯入遮擋器（不帶視覺化表示）。**Occluder Only** 應該在手動製作了用於遮擋剔除的簡化網格時使用。

source: These options are only visible if some of the above options are enabled:
de: Diese Optionen sind nur sichtbar, wenn einige der oben genannten Optionen aktiviert sind:
zh_cn: 仅当启用上述某些选项时，这些选项才可见：
zh_tw: 僅當啟用上述某些選項時，這些選項才可見：

source: **Physics > Body Type:** Only visible if **Generate > Physics** is enabled. Controls the PhysicsBody3D that should be created. **Static** creates a StaticBody3D, **Dynamic** creates a RigidBody3D, **Area** creates an Area3D.
de: **Physik > Body-Typ:** Nur sichtbar, wenn **Generieren > Physik** aktiviert ist. Steuert den PhysicsBody3D, der erstellt werden soll. **Statisch** erzeugt einen StaticBody3D, **Dynamisch** erzeugt einen RigidBody3D, **Fläche** erzeugt einen Area3D.
zh_cn: **物理 > 实体类型：** 仅在启用 **生成 > 物理** 后可见。控制创建的PhysicsBody3D： **Static** 即创建 StaticBody3D， **Dynamic** 创建 RigidBody3D ， **Area** 创建 Area3D。
zh_tw: **物理 > 身體型別：** 僅當啟用 **生成 > 物理** 時才可見。控制應建立的PhysicsBody3D。 **Static** 建立 StaticBody3D，**Dynamic** 建立 RigidBody3D，**Area** 建立 Area3D。

source: **Physics > Shape Type:** Only visible if **Generate > Physics** is enabled. **Trimesh** allows for precise per-triangle collision, but it can only be used with a **Static** body type. Other types are less precise and may require manual configuration, but can be used with any body type. For static level geometry, use **Trimesh**. For dynamic geometry, use primitive shapes if possible for better performance, or use one of the convex decomposition modes if the shape is large and complex.
de: **Physik > Shape-Typ:** Nur sichtbar, wenn **Generieren > Physik** aktiviert ist. **Trimesh** ermöglicht präzise Kollisionen pro Dreieck, kann aber nur mit einem **Statisch**-Body-Typ verwendet werden. Andere Typen sind weniger präzise und erfordern möglicherweise eine manuelle Konfiguration, können aber mit jedem Body-Typ verwendet werden. Für statische Level-Geometrie verwenden Sie **Trimesh**. Für dynamische Geometrie verwenden Sie nach Möglichkeit primitive Shapes, um die Performance zu verbessern, oder verwenden Sie einen der konvexen Zerlegungsmodi, wenn die Form groß und komplex ist.
zh_cn: **物理 > 形状类型：** 仅在 **生成 > 物理** 启用时可见。 **Trimesh** （三角网格）可实现精确的三角形碰撞，但是它只能与 **Static** 主体类别一起使用。其他类型精度较低，可能需要手动配置，但可以用于任何实体类型。对于静态几何体，请使用 **Trimesh** 。 对于动态几何体， 尽可能使用图元，以获得更好的性能， 如果形状较大且复杂，则可以使用其中一种凸分解模式。
zh_tw: **物理 > 形狀型別：** 僅在啟用 **生成 > 物理** 時才可見。 **修剪網格**允許精確的每個三角形碰撞，但它只能與**靜態**主體型別一起使用。其他型別不太精確，可能需要手動配置，但可以用於任何體型。對於靜態關卡幾何體，請使用 **Trimesh**。對於動態幾何體，如果可能的話使用原始形狀以獲得更好的性能，或者如果形狀較大且複雜，則使用凸分解模式之一。

source: **Decomposition > Advanced:** Only visible if **Physics > Shape Type** is **Decompose Convex**. If checked, allows adjusting advanced decomposition options. If disabled, only a preset **Precision** can be adjusted (which is usually sufficient).
de: **Dekomposition > Erweitert:** Nur sichtbar, wenn **Physik > Shape-Typ** auf **Konvex zerlegen** steht. Wenn diese Option aktiviert ist, können Sie die erweiterten Dekompositionsoptionen einstellen. Wenn sie deaktiviert ist, kann nur eine voreingestellte **Präzision** angepasst werden (was in der Regel ausreichend ist).
zh_cn: **拆分 > 高级：** 仅当 **物理 > 形状类型** 为 **Decompose Convex** （凸面分解）时可见。如果选中，则可以调整高级拆分选项。如果禁用，则只能调整预设的 **精度** （通常就足够了）。
zh_tw: **分解 > 進階：** 僅當 **物理 > 形狀型別** 為 **分解凸面** 時才可見。如果選中，則允許調整高級分解選項。如果停用，則只能調整預設的**精度**（通常就足夠了）。

source: **Decomposition > Precision:** Only visible if **Physics > Shape Type** is **Decompose Convex**. Controls the precision to use for convex decomposition. Higher values result in more detailed collision, at the cost of slower generation and increased CPU usage during physics simulation. To improve performance, it's recommended to keep this value as low as possible for your use cases.
de: **Dekomposition > Präzision:** Nur sichtbar, wenn **Physik > Shape-Typ** **Konvex-Dekomposition** ist. Steuert die Präzision, die für die Konvex-Dekomposition verwendet wird. Höhere Werte führen zu detaillierteren Kollisionen, allerdings zum Preis einer langsameren Generierung und einer höheren CPU-Auslastung während der Physiksimulation. Um die Performance zu verbessern, wird empfohlen, diesen Wert für Ihre Anwendungsfälle so niedrig wie möglich zu halten.
zh_cn: **拆分 > 精度：** 仅当 **物理 > 形状类型** 为 **Decompose Convex** 时可见。控制用于凸面分解的精度。数值越高，碰撞的细节越多，但生成速度会变慢，物理模拟时的 CPU 占用率也会增加，为提高性能，建议在使用时尽可能降低该值。
zh_tw: **分解>精確度：**僅當**物理>形狀型別**為**分解凸**時才可見。控制用於凸分解的精度。較高的值會導致更詳細的碰撞，但代價是產生速度較慢，且物理模擬期間 CPU 使用率增加。為了提高效能，建議在您的用例中保持該值盡可能低。

source: **Occluder > Simplification Distance:** Only visible if **Generate > Occluder** is set to **Mesh + Occluder** or **Occluder Only**. Higher values result in a occluder mesh with fewer vertices (resulting in decreased CPU utilization), at the cost of more occlusion culling issues (such as false positives or false negatives). If you run into objects disappearing when they shouldn't when the camera is near a certain mesh, try decreasing this value.
de: **Occluder > Vereinfachungs-Distanz:** Nur sichtbar, wenn **Generieren > Occluder** auf **Mesh + Occluder** oder **Nur Occluder** eingestellt ist. Höhere Werte führen zu einem Occluder-Mesh mit weniger Vertices (was zu einer geringeren CPU-Auslastung führt), allerdings zum Preis von mehr Occlusion-Culling-Problemen (z. B. falsch positive oder falsch negative Ergebnisse). Wenn Ihnen auffällt, dass Objekte verschwinden, wenn sie nicht verschwinden sollten, sobald sich die Kamera in der Nähe eines bestimmten Meshes befindet, versuchen Sie, diesen Wert zu verringern.
zh_cn: **遮挡器 > 化简距离：** 仅当 **生成 > 遮挡器** 设置为 **Mesh + Occluder** 或 **Occluder Only** 时可见。数值越大，遮挡网格的顶点越少（从而降低 CPU 利用率），但代价是会出现更多遮挡剔除问题（如误报或漏报）。如果你发现当摄像机靠近某个网格时，物体在不该消失的时候消失了，请尝试减小该值。
zh_tw: **遮擋器 > 簡化距離：** 僅當 **產生 > 遮擋器** 設定為 **網格 + 遮擋器** 或 **僅遮擋器** 時才可見。較高的值會導致遮蔽網格的頂點數較少（導致 CPU 使用率降低），但代價是更多的遮蔽剔除問題（例如誤報或漏報）。如果相機靠近某個網格時遇到不該消失的物體，請嘗試減少該值。

source: **Configuring mesh and material import options**
de: **Konfigurieren von Mesh- und Material-Importoptionen**
zh_cn: **配置网格和材质导入选项**
zh_tw: 設定外部編輯器

source: In the Advanced Import Settings dialog, there are 2 ways to select individual meshes or materials:
de: Im Dialog Erweiterte Importeinstellungen gibt es 2 Möglichkeiten, einzelne Meshes oder Materialien auszuwählen:
zh_cn: 在 "高级导入设置 "对话框中，有两种方法可以选择单个网格或材质：
zh_tw: 在「進階匯入設定」對話方塊中，有兩種方法可以選擇單一網格或材質：

source: Switch to the **Meshes** or **Materials** tab in the top-left corner of the dialog.
de: Wechseln Sie zum **Meshes**- oder **Materialien**-Tab in der oberen linken Ecke des Dialogs.
zh_cn: 切换到对话框左上角的 **网格** 或 **材质** 选项卡。
zh_tw: Logo 會顯示在螢幕的最上方。

source: Stay in the **Scene** tab, but unfold the options on the tree view on the left. After choosing a mesh or material, this presents the same information as the **Meshes** and **Materials** tabs, but in a tree view instead of a list.
de: Bleiben Sie im **Szene**-Tab, aber klappen Sie die Optionen in der Baumansicht auf der linken Seite aus. Nach der Auswahl eines Meshes oder Materials werden hier dieselben Informationen wie in den **Meshes**- und **Materialien**-Tabs angezeigt, allerdings in einer Baumansicht anstelle einer Liste.
zh_cn: 保留在 **场景** 选项卡中，但展开左侧树状视图中的选项。选择网格或材质后，会显示与 **网格** 和 **材质** 选项卡相同的信息，但显示的是树状视图而不是列表。
zh_tw: 留在**場景**標籤中，但展開左側樹狀視圖上的選項。選擇網格或材質後，這會顯示與 **網格** 和 **材質** 分頁相同的信息，但以樹視圖而不是列表的形式顯示。

source: If you select a mesh, different options will appear in the panel on the right:
de: Wenn Sie ein Mesh auswählen, erscheinen verschiedene Optionen in der Leiste auf der rechten Seite:
zh_cn: 如果你选择了一个网格，右侧面板上将会出现不同的选项：
zh_tw: 如果選擇網格，右側面板中會出現不同的選項：

source: Advanced Import Settings dialog (Meshes tab)
de: Dialogfeld Erweiterte Importeinstellungen (Meshes-Tab)
zh_cn: 高级导入设置对话框（网格选项卡）
zh_tw: 進階匯入設定對話框（網格分頁）

source: The options are as follows:
de: Die Optionen sind wie folgt:
zh_cn: 最常见的用例如下:
zh_tw: 常見的使用情景如下：

source: **Save to File:** Saves the :ref:`class_Mesh` *resource* to an external file (this isn't a scene file). You generally don't need to use this for placing the mesh in a 3D scene – instead, you should instance the 3D scene directly. However, having direct access to the Mesh resource is useful for specific nodes, such as :ref:`class_MeshInstance3D`, :ref:`class_MultiMeshInstance3D`, :ref:`class_GPUParticles3D` or :ref:`class_CPUParticles3D`. - You will also need to specify an output file path using the option that appears after enabling **Save to File**. It's recommended to use the ``.res`` output file extension for smaller file sizes and faster loading speeds, as ``.tres`` is inefficient for writing large amounts of data.
de: **Speichern in Datei:** Speichert die :ref:`class_Mesh`-*Ressource* in einer externen Datei (dies ist keine Szenendatei). Im Allgemeinen brauchen Sie dies nicht zu verwenden, um das Mesh in einer 3D-Szene zu platzieren - stattdessen sollten Sie die 3D-Szene direkt instanziieren. Der direkte Zugriff auf die Mesh-Ressource ist jedoch für bestimmte Nodes nützlich, wie :ref:`class_MeshInstance3D`, :ref:`class_MultiMeshInstance3D`, :ref:`class_GPUParticles3D` oder :ref:`class_CPUParticles3D`. - Sie müssen auch einen Pfad für die Ausgabedatei angeben, indem Sie die Option verwenden, die nach dem Aktivieren von **Speichern in Datei** erscheint. Es wird empfohlen, die Ausgabedatei-Erweiterung ``.res`` zu verwenden, um kleinere Dateigrößen und schnellere Ladezeiten zu erreichen, da ``.tres`` für das Schreiben großer Datenmengen ineffizient ist.
zh_cn: **保存到文件：** 将 :ref:`class_Mesh` *资源* 保存到一个外部文件中（这不是一个场景文件）。通常，你不需要使用这个功能来将网格放置在一个3D场景中——相反地，你应该直接实例化 3D 场景。然而，直接访问 Mesh 资源对于特定节点很有用，例如 :ref:`class_MeshInstance3D`、 :ref:`class_MultiMeshInstance3D` 、 :ref:`class_GPUParticles3D` 或 :ref:`class_CPUParticles3D`。启用 **保存到文件** 后，你还需要使用出现的选项来指定一个输出文件路径。建议使用 ``.res`` 输出文件扩展名，因为它具有较小的文件大小和更快的加载速度，而 ``.tres`` 用于写入大量数据时效率不高。
zh_tw: **儲存到檔案：** 將:ref:`class_Mesh` *資源*儲存到外部檔案（這不是場景檔案）。您通常不需要使用它來將網格放置在 3D 場景中 - 相反，您應該直接實例化 3D 場景。但是，直接存取網格資源對於特定節點非常有用，例如 class_MeshInstance3D、class_MultiMeshInstance3D、class_GPUParticles3D 或 class_CPUParticles3D。 - 您還需要使用啟用**儲存到檔案**後出現的選項指定輸出檔案路徑。建議使用“.res”輸出檔案副檔名以獲得更小的檔案大小和更快的載入速度，因為“.tres”對於寫入大量資料效率低下。

source: **Generate > Shadow Meshes:** Per-mesh override for the **Meshes > Create Shadow Meshes** scene-wide import option described in :ref:`doc_importing_3d_scenes_using_the_import_dock`. **Default** will use the scene-wide import option, while **Enable** or **Disable** can forcibly enable or disable this behavior on a specific mesh.
de: **Generieren > Schattenmeshes:** Überschreiben der szenenweiten Importoption **Meshes > Schattenmeshes erstellen**, für jedes Mesh separat, beschrieben in :ref:`doc_importing_3d_scenes_using_the_import_dock`. **Default** verwendet die szenenweite Importoption, während **Aktivieren** oder **Deaktivieren** dieses Verhalten zwangsweise für ein bestimmtes Mesh aktivieren oder deaktivieren kann.
zh_cn: **生成 > 阴影网格：** 针对 :ref:`doc_importing_3d_scenes_using_the_import_dock` 中描述的场景范围导入选项 **网格 > 创建阴影网格** 的每个网格进行覆盖。 **Default** （默认）将使用场景范围的导入选项，而 **Enable** （启用）或 **Disable** （禁用）可以在特定网格上强制启用或禁用此行为。
zh_tw: **產生 > 陰影網格：** **網格 > 建立陰影網格**場景範圍匯入選項的每個網格覆蓋，如 :ref:`doc_importing_3d_scenes_using_the_import_dock` 中所述。 **預設**將使用場景範圍的匯入選項，而**啟用**或**停用**可以在特定網格上強制啟用或停用此行為。

source: **Generate > Lightmap UV:** Per-mesh override for the **Meshes > Light Baking** scene-wide import option described in :ref:`doc_importing_3d_scenes_using_the_import_dock`. **Default** will use the scene-wide import option, while **Enable** or **Disable** can forcibly enable or disable this behavior on a specific mesh. - Setting this to **Enable** on a scene with the **Static** light baking mode is equivalent to configuring this mesh to use **Static Lightmaps**. Setting this to **Disable** on a scene with the **Static Lightmaps** light baking mode is equivalent to configuring this mesh to use **Static** instead.
de: **Generieren > Lightmap UV:** Überschreiben der szenenweiten Importoption **Meshes > Licht-Backen**, für jedes Mesh separat, die in :ref:`doc_importing_3d_scenes_using_the_import_dock` beschrieben wird. **Default** verwendet die szenenweite Importoption, während **Aktivieren** oder **Deaktivieren** dieses Verhalten zwangsweise für ein bestimmtes Mesh aktivieren oder deaktivieren kann. - Die Einstellung **Aktivieren** in einer Szene mit dem Modus **Statisch** ist gleichbedeutend mit der Konfiguration des Meshes für die Verwendung von **Statischen Lightmaps**. Die Einstellung **Deaktivieren** in einer Szene mit dem Licht-Backmodus **Statische Lightmaps** entspricht, das Mesh so zu konfigurieren, dass stattdessen **Statisch** verwendet wird.
zh_cn: **生成 > 光照贴图 UV：** 针对 :ref:`doc_importing_3d_scenes_using_the_import_dock` 中描述的场景范围导入选项 **网格> 光照烘焙** 的每个网格覆盖。 **Default** （默认）将使用场景范围的导入选项，而 **Enable** （启用）或 **Disable** （禁用）可以在特定网格上强制启用或禁用此行为。在具有 **Static** 光烘焙模式的场景中将此设置为 **Enable** 相当于配置该网格使用 **Static Lightmaps** （静态光照贴图）。在具有 **Static Lightmaps** 光烘焙模式的场景中将此设置为 **Disable** 相当于配置该网格使用 **Disable** 。
zh_tw: **產生 > 光照貼圖 UV：** **網格 > 光照烘焙 ** 場景範圍匯入選項的每個網格覆蓋，如 :ref:`doc_importing_3d_scenes_using_the_import_dock` 所述。 **預設**將使用場景範圍的匯入選項，而**啟用**或**停用**可以在特定網格上強制啟用或停用此行為。 - 在具有 **靜態** 光照烘焙模式的場景中將其設定為 **啟用** 相當於配置此網格以使用 **靜態光照貼圖**。在具有 **靜態光照貼圖** 光照烘焙模式的場景上將其設定為 **停用** 相當於配置此網格以使用 **靜態**。

source: **Generate > LODs:** Per-mesh override for the **Meshes > Generate LODs** scene-wide import option described in :ref:`doc_importing_3d_scenes_using_the_import_dock`. **Default** will use the scene-wide import option, while **Enable** or **Disable** can forcibly enable or disable this behavior on a specific mesh.
de: **Generieren > LODs:** Überschreiben der szenenweiten Importoption **Meshes > LODs generieren**, für jedes Mesh separat, die in :ref:`doc_importing_3d_scenes_using_the_import_dock` beschrieben ist. **Default** verwendet die szenenweite Importoption, während **Aktiveren** oder **Deaktivieren** dieses Verhalten zwangsweise für ein bestimmtes Mesh aktivieren oder deaktivieren kann.
zh_cn: **生成 > LOD：** 针对 :ref:`doc_importing_3d_scenes_using_the_import_dock` 中描述的场景范围导入选项 **网格> 生成 LOD** 的每个网格进行覆盖。 **Default** 将使用场景范围的导入选项，而 **Enable** 或 **Disable** 可以在特定网格上强制启用或禁用此行为。
zh_tw: **產生 > LOD：** 網格 > 產生 LOD** 場景範圍匯入選項的每個網格覆蓋，如 :ref:`doc_importing_3d_scenes_using_the_import_dock` 中所述。 **預設**將使用場景範圍的匯入選項，而**啟用**或**停用**可以在特定網格上強制啟用或停用此行為。

source: **LODs > Normal Split Angle:** The minimum angle difference between two vertices required to preserve a geometry edge in mesh LOD generation. If running into visual issues with LOD generation, decreasing this value may help (at the cost of less efficient LOD generation).
de: **LODs > Normalen-Trennungswinkel:** Der minimale Winkelunterschied zwischen zwei Vertices, der erforderlich ist, um eine Geometriekante bei der LOD-Generierung des Meshes zu erhalten. Bei visuellen Problemen mit der LOD-Generierung kann eine Verringerung dieses Wertes helfen (zum Preis einer weniger effizienten LOD-Generierung).
zh_cn: **LOD > 法线拆分角度：** 在生成网格 LOD 中保留几何边缘所需要的两个顶点之间的最小角度差异。如果在 LOD 生成中遇到视觉问题，减小此值可能会有所帮助（但会以更低效的 LOD 生成为代价）。
zh_tw: **LOD > 法線分割角度：** 在網格 LOD 產生中保留幾何邊緣所需的兩個頂點之間的最小角度差。如果在產生 LOD 時遇到視覺問題，降低該值可能會有所幫助（但代價是 LOD 生成效率較低）。
