Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_3d_scenes/import_configuration.po
Languages: de, zh_cn, zh_tw

source: Dialog when opening an imported 3D scene in the editor
de: Dialog beim Öffnen einer importierten 3D-Szene im Editor
zh_cn: 在编辑器中打开导入的 3D 场景时的对话框
zh_tw: 在編輯器中開啟匯入的 3D 場景時的對話框

source: In inherited scenes, the only limitations for modification are:
de: Bei geerbten Szenen sind die einzigen Einschränkungen für Modifikationen:
zh_cn: 在继承场景中，修改的唯一限制是：
zh_tw: 繼承場景中，修改只有下列限制：

source: Nodes from the base scene can't be removed, but additional nodes can be added anywhere.
de: Nodes aus der Basisszene können nicht entfernt werden, aber zusätzliche Nodes können überall hinzugefügt werden.
zh_cn: 无法删除基础场景中的节点，但可以在任何地方添加其他节点。
zh_tw: 節點無法移除 (但可以在任何地方新增節點)。

source: Subresources can't be edited. Instead, you need to save them externally as described above.
de: Subresourcen können nicht bearbeitet werden. Stattdessen müssen Sie sie, wie oben beschrieben, extern speichern.
zh_cn: 子资源无法被编辑（如上所述它们将保存在外部）。
zh_tw: 子資源無法編輯 (可以使用上面說明的方法將子資源保存在外部)

source: Other than that, everything is allowed.
de: Ansonsten ist alles erlaubt.
zh_cn: 除此之外，一切都是允许的。
zh_tw: 除此之外，可以任何事。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
