Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_3d_scenes/import_configuration.po
Languages: de, zh_cn, zh_tw

source: **LODs > Normal Merge Angle:** The minimum angle difference between two vertices required to preserve a geometry edge in mesh LOD generation. If running into visual issues with LOD generation, decreasing this value may help (at the cost of less efficient LOD generation).
de: **LODs > Normalen-Zusammenführungswinkel:** Der minimale Winkelunterschied zwischen zwei Vertices, der erforderlich ist, um eine Geometriekante bei der LOD-Generierung des Meshes zu erhalten. Bei visuellen Problemen mit der LOD-Generierung kann eine Verringerung dieses Wertes helfen (zum Preis einer weniger effizienten LOD-Generierung).
zh_cn: **LOD > 法线合并角度：** 在生成网格 LOD 中保留几何边缘所需要的两个顶点之间的最小角度差异。如果在 LOD 生成中遇到视觉问题，减小此值可能会有所帮助（但会以更低效的 LOD 生成为代价）。
zh_tw: **LOD > 法線合併角度：** 在網格 LOD 產生中保留幾何邊緣所需的兩個頂點之間的最小角度差。如果在產生 LOD 時遇到視覺問題，降低該值可能會有所幫助（但代價是 LOD 生成效率較低）。

source: If you select a material, only one option will appear in the panel on the right:
de: Wenn Sie ein Material auswählen, erscheint nur eine Option in der Leiste auf der rechten Seite:
zh_cn: 如果你选择一种材质，在右侧面板中只会出现一个选项：
zh_tw: 如果選擇一種材質，右側面板中只會出現一個選項：

source: Advanced Import Settings dialog (Materials tab)
de: Dialogfeld Erweiterte Importeinstellungen (Materialien-Tab)
zh_cn: “高级导入设置”对话框（“材质”选项卡）
zh_tw: “進階匯入設定”對話方塊（“材質”標籤）

source: When **Use External** is checked and an output path is specified, this lets you use an external material instead of the material that is included in the original 3D scene file; see the section below.
de: Wenn **Extern verwenden** aktiviert ist und ein Ausgabepfad angegeben ist, können Sie ein externes Material anstelle des in der ursprünglichen 3D-Szenendatei enthaltenen Materials verwenden; siehe den folgenden Abschnitt.
zh_cn: 当选中 **使用外部** 并指定输出路径时，可以使用外部材质而不是原始 3D 场景文件中所包含的材质。请参阅下面的部分。
zh_tw: 當選取 **使用外部** 並指定輸出路徑時，您可以使用外部材質而不是原始 3D 場景檔案中包含的材質；請參閱下面的部分。

source: Extracting materials to separate files
de: Extrahieren von Materialien in separate Dateien
zh_cn: 将材质提取到单独文件中
zh_tw: 匯入紋理

source: While Godot can import materials authored in 3D modeling software, the default configuration may not be suitable for your needs. For example:
de: Godot kann zwar Materialien importieren, die in einer 3D-Modellierungssoftware erstellt wurden, aber die Default-Konfiguration ist möglicherweise nicht für Ihre Bedürfnisse geeignet. Zum Beispiel:
zh_cn: 虽然 Godot 可以导入在 3D 建模软件中编辑过的材质，但默认配置可能不适合你的需求。例如：
zh_tw: 雖然 Godot 可以匯入在 3D 建模軟體中編寫的材質，但預設配置可能不適合您的需求。例如：

source: You want to configure material features not supported by your 3D application.
de: Sie möchten Material-Features konfigurieren, die von Ihrer 3D-Anwendung nicht unterstützt werden.
zh_cn: 你想要配置你所使用的 3D 应用程序不支持的材质特性。
zh_tw: 您想要配置 3D 應用程式不支援的材質功能。

source: You want to use a different texture filtering mode, as this option is configured in the material since Godot 4.0 (and not in the image).
de: Sie möchten einen anderen Texturfiltermodus verwenden, da diese Option seit Godot 4.0 im Material konfiguriert ist (und nicht im Bild).
zh_cn: 你想要使用不同的纹理过滤模式，因为从 Godot 4.0 开始此选项是在材质中配置的（而不是在图像中）。
zh_tw: 您想要使用不同的紋理篩選模式，因為此選項是在 Godot 4.0 以來的材質中配置的（而不是在圖像中）。

source: You want to replace one of the materials with an entirely different material, such as a custom shader.
de: Sie möchten eines der Materialien durch ein völlig anderes Material ersetzen, z. B. durch einen benutzerdefinierten Shader.
zh_cn: 你想要将其中一种材质替换为完全不同的材质，例如一个自定义着色器。
zh_tw: 您想要將其中一種材質替換為完全不同的材質，例如自訂著色器。

source: To be able to modify the 3D scene's materials in the Godot editor, you need to use *external* material resources.
de: Um die Materialien der 3D-Szene im Godot-Editor ändern zu können, müssen Sie *externe* Materialressourcen verwenden.
zh_cn: 为了能够在 Godot 编辑器中修改 3D 场景的材质，需要使用 *外部* 材质资源。
zh_tw: 為了能夠在 Godot 編輯器中修改 3D 場景的材質，您需要使用*外部*材質。

source: In the top-left corner of the Advanced Import Settings dialog, choose **Actions… > Extract Materials**:
de: Wählen Sie in der oberen linken Ecke des Dialogfelds Erweiterte Importeinstellungen die Option **Aktionen... > Materialien extrahieren**:
zh_cn: 在“高级导入设置”对话框的左上角，选择 **动作... > 提取材质** ：
zh_tw: 在「進階匯入設定」對話方塊的左上角，選擇「**操作...> 提取材質**：

source: Extracting all built-in materials to external resources in the Advanced Import Settings dialog
de: Extrahieren aller Built-in-Materialien in externe Ressourcen im Dialogfeld Erweiterte Importeinstellungen
zh_cn: 在“高级导入设置”对话框中将所有内置材质提取到外部资源
zh_tw: 在「進階匯入設定」對話方塊中將所有內建材料提取到外部資源

source: After choosing this option, select a folder to extract material ``.tres`` files to, then confirm the extraction:
de: Nachdem Sie diese Option gewählt haben, wählen Sie einen Ordner aus, in den die ``.tres``-Dateien extrahiert werden sollen, und bestätigen Sie dann die Extraktion:
zh_cn: 选择此选项后，选择一个文件夹来提取素材 ``.tres`` 文件，然后确认提取：
zh_tw: 選擇此選項後，選擇一個資料夾來擷取素材``.tres``檔案，然後確認擷取：

source: Confirming material extraction in the Advanced Import Settings subdialog
de: Bestätigen der Materialextraktion im Unterdialog Erweiterte Importeinstellungen
zh_cn: 在“高级导入设置”的子对话框中确认提取材质
zh_tw: 在「進階匯入設定」子對話方塊中確認材料提取

source: After extracting materials, the 3D scene will automatically be configured to use external material references. As a result, you don't need to manually enable **Use External** on every material to make the external ``.tres`` material effective.
de: Nach dem Extrahieren von Materialien wird die 3D-Szene automatisch so konfiguriert, dass externe Materialreferenzen verwendet werden. Daher müssen Sie nicht bei jedem Material manuell **Extern verwenden** aktivieren, damit das externe ``.tres``-Material wirksam wird.
zh_cn: 提取材质后，3D 场景将自动配置为使用外部材质引用。因此，无需再在每种材质上手动启用 **使用外部** 来使外部 ``.tres`` 材质生效。
zh_tw: 萃取材質後，3D 場景將自動配置為使用外部材質參考。因此，您無需在每種材質上手動啟用**使用外部**來使外部``.tres``材質生效。

source: When **Use External** is enabled, remember that the Advanced Import Settings dialog will keep displaying the mesh's original materials (the ones designed in the 3D modeling software). This means your customizations to the materials won't be visible within this dialog. To preview your modified materials, you need to place the imported 3D scene in another scene using the editor.
de: Wenn **Extern verwenden** aktiviert ist, denken Sie daran, dass im Dialogfeld Erweiterte Importeinstellungen weiterhin die Originalmaterialien des Meshes angezeigt werden (die Materialien, die in der 3D-Modellierungssoftware entworfen wurden). Das bedeutet, dass Ihre Anpassungen an den Materialien in diesem Dialogfeld nicht sichtbar sind. Um Ihre geänderten Materialien in der Vorschau zu sehen, müssen Sie die importierte 3D-Szene mit dem Editor in einer anderen Szene platzieren.
zh_cn: 启用 **使用外部** 时，请注意，“高级导入设置”对话框将继续显示网格的原始材质（在 3D 建模软件中设计的材质）。这意味着你对材质进行的自定义在此对话框中不可见。为了预览修改后的材质，需要使用编辑器将导入的 3D 场景放置在另一个场景中。
zh_tw: 啟用「使用外部」時，請記住「進階匯入設定」對話方塊將繼續顯示網格的原始材質（在 3D 建模軟體中設計的材質）。這意味著您對材質的自訂在此對話方塊中不可見。若要預覽修改後的材質，您需要使用編輯器將匯入的 3D 場景放置在另一個場景中。

source: Godot will not overwrite changes made to extracted materials when the source 3D scene is reimported. However, if the material name is changed in the source 3D file, the link between the original material and the extracted material will be lost. As a result, you'll need to use the Advanced Import Settings dialog to associate the renamed material to the existing extracted material.
de: Godot überschreibt keine Änderungen, die an extrahierten Materialien vorgenommen wurden, wenn die 3D-Quellszene erneut importiert wird. Wenn jedoch der Materialname in der 3D-Quelldatei geändert wird, geht die Verbindung zwischen dem Originalmaterial und dem extrahierten Material verloren. Daher müssen Sie den Dialog Erweiterte Importeinstellungen verwenden, um das umbenannte Material mit dem vorhandenen extrahierten Material zu verknüpfen.
zh_cn: 重新导入源 3D 场景时，Godot 不会覆盖对提取材质所做的更改。然而，如果源 3D 文件中的材质名称发生更改，则原始材质和提取的材质之间的链接将会丢失。为此，你需要使用“高级导入设置”对话框，将重命名后的材质与现有提取的材质相关联。
zh_tw: 重新匯入來源 3D 場景時，Godot 不會覆寫對萃取材質所做的變更。但是，如果來源 3D 檔案中的材質名稱發生更改，則原始材質和提取的材質之間的連結將會遺失。因此，您需要使用「進階匯入設定」對話方塊將重新命名的材質與現有擷取的材質相關聯。

source: The above can be done in the dialog's **Materials** tab by selecting the material, enabling **Save to File**, then specifying the save path using the **Path** option that appears after enabling **Save to File**.
de: Dies kann im der **Materialien**-Tab des Dialogs geschehen, indem Sie das Material auswählen, **In Datei speichern** aktivieren und dann den Speicherpfad mit der Option **Pfad** angeben, die nach der Aktivierung von **In Datei speichern** erscheint.
zh_cn: 上述操作可以在对话框的 **材质** 选项卡中完成。操作方法是，首先选择材质，启用 **保存为文件** ，然后使用启用 **保存为文件** 后出现的 **路径** 选项指定保存路径。
zh_tw: 上述操作可以在對話方塊的“材料”標籤中完成，方法是選擇材料，啟用“儲存到檔案”，然後使用啟用“儲存到檔案”後出現的“路徑”選項指定儲存路徑**。

source: Using import scripts for automation
de: Verwendung von Importskripten für die Automatisierung
zh_cn: 使用导入脚本实现自动化
zh_tw: 使用匯入腳本實作自動化

source: A special script to process the whole scene after import can be provided. This is great for post-processing, changing materials, doing funny stuff with the geometry, and more.
de: Ein spezielles Skript zur Verarbeitung der gesamten Szene nach dem Import kann bereitgestellt werden. Dies eignet sich hervorragend für die Nachbearbeitung, das Ändern von Materialien, lustige Sachen mit der Geometrie und vieles mehr.
zh_cn: 可以提供一个特殊脚本来处理导入后的整个场景。这非常适合后期处理、更换材质和用几何图形做有趣的事情等等。
zh_tw: 此處可提供一個腳本來在匯入後處理整個場景。該腳本適合拿來做後處理、用來更改材質、或是對幾何做有趣的處理等等。

source: Create a script that is not attached to any node by right-clicking in the FileSystem dock and choosing **New > Script…**. In the script editor, write the following:
de: Erstellen Sie ein Skript, das keinem Knoten zugeordnet ist, indem Sie mit der rechten Maustaste in das Dateisystem-Dock klicken und **Neu > Skript...** wählen. Schreiben Sie Folgendes in den Skript-Editor:
zh_cn: 通过右键单击文件系统面板并选择 **新建脚本…** ，创建一个不附加到任何节点的脚本。在脚本编辑器中，编写以下内容：
zh_tw: 透過右鍵點選檔案系統停靠欄並選擇 **新建 > 腳本…**，建立不附加到任何節點的腳本。在腳本編輯器中，編寫以下內容：

source: The ``_post_import(scene: Node)`` function takes the imported scene as argument (the parameter is actually the root node of the scene). The scene that will finally be used **must** be returned (even if the scene can be entirely different).
de: Die Funktion ``_post_import(scene: Node)`` nimmt die importierte Szene als Argument (der Parameter ist eigentlich der Root-Node der Szene). Die Szene, die letztendlich verwendet wird, **muss** zurückgegeben werden (auch wenn die Szene völlig anders sein kann).
zh_cn: ``_post_import(scene: Node)`` 函数以导入的场景为参数（参数实际上是场景的根节点），必须返回最终使用的场景，可以是完全不同的另一个场景。
zh_tw: ``post_import`` 函式會將匯入的場景作為參數 (該參數實際上就是場景的根節點)。必須回傳最終要被使用的場景。回傳的可以是不同場景。

source: Using animation libraries
de: Verwendung von Animationsbibliotheken
zh_cn: 使用动画库
zh_tw: 動畫樹

source: As of Godot 4.0, you can choose to import **only** animations from a glTF file and nothing else. This is used in some asset pipelines to distribute animations separately from models. For example, this allows you to use one set of animations for several characters, without having to duplicate animation data in every character.
de: Ab Godot 4.0 können Sie wählen, ob Sie **nur** Animationen aus einer glTF-Datei importieren wollen und nichts anderes. Dies wird in einigen Asset-Pipelines verwendet, um Animationen getrennt von Modellen zu verteilen. So können Sie beispielsweise einen Satz von Animationen für mehrere Charaktere verwenden, ohne die Animationsdaten in jedem Charakter duplizieren zu müssen.
zh_cn: 从 Godot 4.0 开始，可以选择从 glTF 文件导入 **仅** 动画，而不导入其他信息。这在某些资产管线中用于将动画与模型分开分发。比如，给多个角色使用一套动画，而每个角色不必有重复的动画数据。
zh_tw: 從 Godot 4.0 開始，可以選擇僅從 glTF 檔中匯入動畫。在某些素材管道中，使用動畫和模型分開的方式，比如，給多個角色使用一套動畫，而每個角色不必有重複的動畫資料。

source: To do so, select the glTF file in the FileSystem dock, then change the import mode to Animation Library in the Import dock:
de: Wählen Sie dazu die glTF-Datei im Dateisystem-Dock aus und ändern Sie dann den Importmodus im Import-Dock auf Animationsbibliothek:
zh_cn: 那么，请在文件系统栏目中选择 glTF 文件，然后在导入栏中更改导入模式为动画库：
zh_tw: 那麼，請在檔案系統欄目中選擇 glTF 檔，然後在匯入欄中更改匯入模式為動畫庫：

source: Changing the import type to Animation Library in the Import dock
de: Ändern des Importtyps in Animationsbibliothek im Importdock
zh_cn: 在导入栏目中将导入类型更改为动画库
zh_tw: 在匯入欄目中將匯入型別更改為動畫庫

source: Click **Reimport** and restart the editor when prompted. After restarting, the glTF file will be imported as an :ref:`class_AnimationLibrary` instead of a :ref:`class_PackedScene`. This animation library can then be referenced in an :ref:`class_AnimationPlayer` node.
de: Klicken Sie auf **Neuimport** und starten Sie den Editor neu, wenn Sie dazu aufgefordert werden. Nach dem Neustart wird die glTF-Datei als :ref:`class_AnimationLibrary` anstelle einer :ref:`class_PackedScene` importiert. Diese Animationsbibliothek kann dann in einem :ref:`class_AnimationPlayer`-Node referenziert werden.
zh_cn: 单击 **重新导入** ，并根据提示重启编辑器。重启后， glTF 文件将作为 :ref:`class_AnimationLibrary` 导入，而不是 :ref:`class_PackedScene` 。然后，可以使用 :ref:`class_AnimationPlayer` 节点引用此动画库。
zh_tw: 按一下 **重新匯入** ，並根據提示重啟編輯器。重啟後， glTF 檔將作為 :ref:`class_AnimationLibrary` 匯入，而不是 :ref:`class_PackedScene` 。然後，可以使用 :ref:`class_AnimationPlayer` 節點引用此動畫庫。

source: The import options that are visible after changing the import mode to Animation Library act the same as when using the Scene import mode. See :ref:`doc_importing_3d_scenes_using_the_import_dock` for more information.
de: Die Importoptionen, die nach dem Ändern des Importmodus in der Animationsbibliothek sichtbar sind, verhalten sich genauso wie bei der Verwendung des Importmodus "Szene". Siehe :ref:`doc_importing_3d_scenes_using_the_import_dock` für weitere Informationen.
zh_cn: 更改导入模式为动画库后，可见的导入选项与使用场景导入模式时相同。有关更多信息，请参阅 :ref:`doc_importing_3d_scenes_using_the_import_dock` 。
zh_tw: 更改匯入模式為動畫庫後，可見的匯入選項與使用場景匯入模式時相同。有關更多資訊，請參閱 :ref:`doc_importing_3d_scenes_using_the_import_dock` 。

source: Filter script
de: Filter-Skript
zh_cn: 过滤脚本
zh_tw: 篩選腳本

source: It is possible to specify a filter script in a special syntax to decide which tracks from which animations should be kept.
de: Es ist möglich, ein Filterskript in einer speziellen Syntax anzugeben, um zu entscheiden, welche Tracks von welchen Animationen behalten werden sollen.
zh_cn: 可以使用特殊语法指定过滤器脚本, 以决定应保留哪些动画的哪些轨道.
zh_tw: 也可以指定一個特殊格式的篩選腳本，用來判斷哪些動畫中的哪些軌道要保留。

source: The filter script is executed against each imported animation. The syntax consists of two types of statements, the first for choosing which animations to filter, and the second for filtering individual tracks within the matched animation. All name patterns are performed using a case-insensitive expression match, with support for ``?`` and ``*`` wildcards (using :ref:`String.matchn() <class_String_method_matchn>` under the hood).
de: Das Filterskript wird für jede importierte Animation ausgeführt. Die Syntax besteht aus zwei Arten von Anweisungen, die erste für die Auswahl der zu filternden Animationen, die zweite für die Filterung einzelner Tracks innerhalb der übereinstimmenden Animation. Alle Namensmuster werden mit einer Groß-/Kleinschreibung-unabhängigen Ausdrucksvergleichs ausgeführt, mit Unterstützung für ``?``- und ``*``-Wildcards (unter der Haube wird :ref:`String.matchn() <class_String_method_matchn>` verwendet).
zh_cn: 过滤脚本对每个导入的动画执行。语法由两种类型的语句组成，第一种用于选择要过滤的动画，第二种用于过滤匹配动画中的单个轨道。所有名称模式都使用不区分大小写的表达式匹配，并支持 ``?`` 和 ``*`` 通配符（底层使用 :ref:`String.matchn() <class_String_method_matchn>` ）。
zh_tw: 篩選腳本會依據每個匯入的動畫上執行。腳本的格式由兩種陳述式組成，第一種陳述式是用來選擇要篩選哪些動畫，第二種則是用在符合的動畫上篩選個別軌道。名稱的模式使用不區分大小寫的表示式來配對，使用 ``?`` 與 ``*`` 字元作為萬用字元 (內部使用 ``String.matchn()`` )。

source: The script must start with an animation filter statement (as denoted by the line beginning with an ``@``). For example, if we would like to apply filters to all imported animations which have a name ending in ``"_Loop"``::
de: Das Skript muss mit einer Animationsfilteranweisung beginnen (wie durch die mit einem ``@`` beginnende Zeile angegeben). Zum Beispiel, wenn wir Filter auf alle importierten Animationen anwenden möchten, deren Name auf ``"_Loop"`` endet::
zh_cn: 脚本必须以动画过滤器语句开头（如以 ``@`` 开头的行表示）。例如，如果我们想要将过滤器应用在所有以 ``"_Loop"`` 结尾的导入动画上： ::
zh_tw: 腳本必須以動畫篩選陳述式來開頭 (表示為以 ``@`` 為首的行)。舉例來說，若要套用篩選到所有名稱以 ``"_Loop"`` 結尾的匯入動畫：

source: Similarly, additional patterns can be added to the same line, separated by commas. Here is a modified example to additionally *include* all animations with names that begin with ``"Arm_Left"``, but also *exclude* all animations which have names ending in ``"Attack"``::
de: In ähnlicher Weise können weitere Muster durch Kommas getrennt in derselben Zeile hinzugefügt werden. Hier ist ein geändertes Beispiel, das zusätzlich alle Animationen *miteinbezieht*, deren Namen mit ``"Arm_Left"`` beginnen, aber auch alle Animationen *ausschließt*, deren Namen mit ``"Attack"`` enden::
zh_cn: 类似地，还可以在同一行中添加其他模式，以逗号分隔。下面是一个修改后的例子，它额外\ *包含*\ 所有名称以 ``"Arm_Left"`` 开头的动画，同时\ *排除*\ 所有名称以 ``"Attack"`` 结尾的动画： ::
zh_tw: 同樣地，也可以在同一行中加上其他模式，並以逗號來分隔。下列修改後的範例也會 **包含** 所有以 ``"Arm_Left"`` 開頭的動畫，但同時 **排除** 所有名稱以 ``"Attach"`` 結尾的動畫：

source: Following the animation selection filter statement, we add track filtering patterns to indicate which animation tracks should be kept or discarded. If no track filter patterns are specified, then all tracks within the matched animations will be discarded!
de: Im Anschluss an die Erklärung zum Animationsauswahlfilter fügen wir Track-Filter-Muster hinzu, um anzugeben, welche Animations-Tracks beibehalten oder verworfen werden sollen. Wenn keine Track-Filter-Muster angegeben wurden, werden alle Tracks innerhalb der übereinstimmenden Animationen verworfen!
zh_cn: 在动画选择过滤器语句之后, 我们添加轨道过滤模式来指示保留或丢弃哪些动画轨道. 如果未指定轨道过滤器模式, 则匹配动画中的所有轨道都会被丢弃！
zh_tw: 緊接著用來選擇動畫的篩選陳述式之後，要寫的便是用來判斷哪些軌道要保留，哪些要放棄的篩選模式。若沒有指定篩選模式，則相符動畫中的所有軌道都會被放棄！

source: It's important to note that track filter statements are applied in order for each track within the animation, this means that one line may include a track, a later rule can still discard it. Similarly, a track excluded by an early rule may then be re-included once again by a filter rule further down in the filter script.
de: Es ist wichtig zu beachten, dass die Anweisungen des Track-Filters für jeden Track innerhalb der Animation der Reihe nach angewendet werden, d.h. eine Zeile kann einen Track enthalten, eine spätere Regel kann ihn immer noch verwerfen. In ähnlicher Weise kann ein durch eine frühe Regel ausgeschlossener Track dann durch eine Filterregel weiter unten im Filterskript wieder aufgenommen werden.
zh_cn: 需要注意的是, 轨道过滤器表达式是按顺序作用于动画中的每条轨道, 这意味着, 一行表达式可能包含某个轨道, 但后续的规则仍然可以忽略它. 同样, 一个被之前规则排除的轨道, 可能被过滤器脚本后续的规则重新包含进来.
zh_tw: 有一點需要注意的是軌道篩選陳述式會依據動畫中各個軌道的順序來套用，這表示一行選擇了保留軌道的陳述式之後可能出現另一個規則來放棄保留軌道。同樣地，若先前的規律條件排除了一個軌道，篩選腳本後方的規則仍然可以將該軌道重新包含進來。

source: For example: include all tracks in animations with names ending in ``"_Loop"``, but discard any tracks affecting a ``"Skeleton"`` which end in ``"Control"``, unless they have ``"Arm"`` in their name::
de: Nehmen Sie zum Beispiel alle Tracks in Animationen mit Namen, die auf ``"_Loop"`` enden, aber verwerfen Sie alle Tracks, die ein ``"Skelett"`` betreffen, das auf ``"Control"`` endet, es sei denn, sie haben ``"Arm"`` in ihrem Namen::
zh_cn: 例如：包含动画中所有名字以 ``"_Loop"`` 结尾的轨道，但忽略任何以 ``"Control"`` 结尾的 ``"Skeleton"`` 轨道，除非它们的名字中有 ``"Arm"``\ ： ::
zh_tw: 舉例來說：包含動畫中所有名稱以 ``"_Loop"`` 結尾的動畫，但放棄所有以 ``"Control"`` 結尾且會對 ``"Skeleton"`` 造成效果的動畫，除非名稱中有 ``"Arm"`` ：

source: In the above example, tracks like ``"Skeleton:Leg_Control"`` would be discarded, while tracks such as ``"Skeleton:Head"`` or ``"Skeleton:Arm_Left_Control"`` would be retained.
de: Im obigen Beispiel würden Tracks wie ``"Skeleton:Leg_Control"`` verworfen, während Tracks wie ``"Skeleton:Head"`` oder ``"Skeleton:Arm_Left_Control"`` beibehalten würden.
zh_cn: 在上面的示例中，像 ``"Skeleton:Leg_Control"`` 这样的轨道会被丢弃，而像 ``"Skeleton:Head"`` 或 ``"Skeleton:Arm_Left_Control"`` 这样的轨道会被保留。
zh_tw: 在上述例子中，如 ``”Skeleton:Leg_Control"`` 軌道會被放棄，而如 ``"Skeleton:Head"`` 或 ``"Skeleton:Arm_Left_Control"`` 軌道則會被保留。

source: Any track filter lines that do not begin with a ``+`` or ``-`` are ignored.
de: Alle Track-Filter-Linien, die nicht mit einem ``+`` oder ``-`` beginnen, werden ignoriert.
zh_cn: 任何不是以 ``+`` 或 ``-`` 开头的轨道过滤器行将会被忽略.
zh_tw: 不以 ``+`` 或 ``-`` 開頭的軌道篩選規則會被忽略。

source: Storage
de: Speicher
zh_cn: 存储
zh_tw: 儲存

source: By default, animations are saved as built-in. It is possible to save them to a file instead. This allows adding custom tracks to the animations and keeping them after a reimport.
de: Standardmäßig werden Animationen als Built-in gespeichert. Es ist möglich, sie stattdessen in einer Datei zu speichern. Dies erlaubt es, den Animationen benutzerdefinierte Tracks hinzuzufügen und sie nach einem Neuimport beizubehalten.
zh_cn: 默认情况下, 动画保存为内置. 可以将它们保存到一个文件中. 这允许向动画添加自定义轨道并在重新导入后保留它们.
zh_tw: 預設情況下，動畫會以內建形式保存。也可以將動畫儲存於檔案中。這樣即使重新匯入後，在動畫中新增的自定軌道也能被保留。

source: Optimizer
de: Optimierer
zh_cn: 优化
zh_tw: 最佳化器

source: When animations are imported, an optimizer is run, which reduces the size of the animation considerably. In general, this should always be turned on unless you suspect that an animation might be broken due to it being enabled.
de: Wenn Animationen importiert werden, wird ein Optimierer ausgeführt, der die Größe der Animation erheblich reduziert. Im Allgemeinen sollte dieser immer eingeschaltet sein, es sei denn, Sie vermuten, dass eine Animation aufgrund seiner Aktivierung beschädigt werden könnte.
zh_cn: 导入动画时, 会运行优化程序, 从而大大减少动画的大小. 一般情况下, 除非你怀疑动画可能因启用而被破坏, 否则应始终启用此功能.
zh_tw: 動畫匯入後會執行最佳化工具。最佳化工具能有效降低動畫的大小。一般來說，應該維持開啟最佳化工具，除非遇到動畫疑似因為最佳化而損壞的情況。

source: Clips
de: Animations-Clips
zh_cn: 剪辑
zh_tw: 動畫片段

source: It is possible to specify multiple animations from a single timeline as clips. For this to work, the model must have only one animation that is named ``default``. To create clips, change the clip amount to something greater than zero. You can then name a clip, specify which frames it starts and stops on, and choose whether the animation loops or not.
de: Es ist möglich, mehrere Animationen aus einer einzigen Zeitleiste als Clips anzugeben. Damit dies funktioniert, muss das Model nur eine einzige Animation haben, die als ``default`` bezeichnet wird. Um Clips zu erstellen, ändern Sie die Clipmenge auf etwas größer als Null. Sie können dann einen Clip benennen, angeben, auf welchen Frames er startet und stoppt, und wählen, ob die Animation eine Schleife bildet oder nicht.
zh_cn: 可以指定单个时间轴中的多个动画作为剪辑. 这样做的话, 模型必须只有一个命名为 ``default`` 的动画. 为了创建剪辑, 把剪辑数量改成比0大的数. 然后可以修改剪辑名字, 指定开始和结束帧, 选择动画是否循环.
zh_tw: 可以指定來自單一時間軸中的多個動畫作為剪輯。模型必須只能有一個命名為 ``default`` 的動畫才能建立剪輯。要建立剪輯，請將剪輯數量調整為大於零的任意數。接著便能為剪輯命名、選擇開始與結尾的影格、以及選擇動畫是否要循環。

source: Scene inheritance
de: Szenenvererbung
zh_cn: 场景继承
zh_tw: 場景繼承

source: In many cases, it may be desired to make manual modifications to the imported scene. By default, this is not possible because if the source 3D asset changes, Godot will re-import the *whole* scene.
de: In vielen Fällen kann es erwünscht sein, manuelle Änderungen an der importierten Szene vorzunehmen. Standardmäßig ist dies nicht möglich, da Godot bei einer Änderung des Quell-3D-Assets immer die *gesamte* Szene neu importiert.
zh_cn: 在许多情况下，可能需要手动修改导入的场景。默认情况下，不太可能，因为如果源 3D 资产更改， Godot 将重新导入整个场景。
zh_tw: 許多情況下我們會希望能更改匯入的場景。但在預設情況下無法更改，因為若修改了原始素材 (重新從 3D 模型程式中匯出的原始 ``.dae``, ``.gltf``, ``.obj`` 檔案)，Godot 會重新匯入整個場景。

source: However, it is possible to make local modifications by using *scene inheritance*. If you try to open the imported scene using **Scene > Open Scene…** or **Scene > Quick Open Scene…**, the following dialog will appear:
de: Es ist jedoch möglich, lokale Änderungen mit Hilfe der *Szenenvererbung* vorzunehmen. Wenn Sie versuchen, die importierte Szene mit **Szene > Szene öffnen...** oder **Szene > Szene schnell öffnen...** zu öffnen, wird der folgende Dialog angezeigt:
zh_cn: 然而，可以使用 *场景继承* 来创建本地修改。如果你尝试使用 **场景 > 打开场景...** 或 **场景 > 快速打开场景...**来打开已导入的场景，以下对话框将会出现：
zh_tw: 但，我們可以通過 **場景繼承** 來建立區域修改。試著打開匯入場景，會顯示下列視窗：
