Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_3d_scenes/import_configuration.po
Languages: de, zh_cn, zh_tw

source: Import configuration
de: Import-Konfiguration
zh_cn: 导入配置

source: Godot provides several ways to customize the imported data, such as the import dock, the advanced import setting dialog, and inherited scenes. This can be used to make further changes to the imported scene, such as adjusting meshes, adding physics information, and adding new nodes. You can also write a script that runs code at the end of the import process to perform arbitrary customization.
de: Godot bietet mehrere Möglichkeiten zur Anpassung der importierten Daten, wie z.B. das Import-Dock, den erweiterten Import-Einstellungsdialog und geerbte Szenen. Auf diese Weise können Sie weitere Änderungen an der importierten Szene vornehmen, z.B. Meshes anpassen, Physikinformationen hinzufügen und neue Nodes hinzufügen. Sie können auch ein Skript schreiben, das am Ende des Importvorgangs Code ausführt, um beliebige Anpassungen vorzunehmen.
zh_cn: Godot提供了多种自定义导入数据的方法，比如导入停靠面板、高级导入设置对话框和继承场景。这可以用来对导入的场景进行进一步的更改，比如调整网格、添加物理信息和添加新节点。你还可以编写一个脚本，在导入过程结束时运行代码，以执行任意的自定义操作。

source: Note that, when applicable, modifying the original data should be preferred to configuring the scene after import. This helps minimize the differences between the 3D modeling application and the imported scene. See the :ref:`doc_importing_3d_scenes_model_export_considerations` and :ref:`doc_importing_3d_scenes_node_type_customization` articles for more information.
de: Beachten Sie, wenn möglich, dass es besser ist, die Originaldaten zu ändern, als die Szene nach dem Import zu konfigurieren. Dies hilft, die Unterschiede zwischen der 3D-Modellierungs-Software und der importierten Szene zu minimieren. Siehe die Artikel :ref:`doc_importing_3d_scenes_model_export_considerations` und :ref:`doc_importing_3d_scenes_node_type_customization` für weitere Informationen.
zh_cn: 请尽可能在导入前修改初始数据，而不是导入后再配置场景。这有助于最大程度降低场景在 3D 建模软件中与实际导入场景之间的差异。可参考 :ref:`doc_importing_3d_scenes_model_export_considerations` 及 :ref:`doc_importing_3d_scenes_node_type_customization`来获取更多信息。

source: Import workflows
zh_cn: 导入工作流程
zh_tw: 匯入工作流程

source: Since Godot can only save its own scene format (``.tscn``/``.scn``), Godot cannot save over the original 3D scene file (which uses a different format). This is also a safer approach as it avoids making accidental changes to the source file.
de: Da Godot nur sein eigenes Szenenformat (``.tscn``/``.scn``) speichern kann, kann Godot nicht über die ursprüngliche 3D-Szenendatei (die ein anderes Format verwendet) speichern. Dies ist auch ein sichererer Ansatz, da er versehentliche Änderungen an der Quelldatei vermeidet.
zh_cn: 由于 Godot 只能保存自己的场景格式（\ ``.tscn``/``.scn``\ ），Godot 无法保存原始 3D 场景文件（使用不同的格式）。由于可以避免对源文件进行意外更改，这也是一种更安全的做法。
zh_tw: 由於 Godot 只能儲存自己的場景格式（``.tscn``/``.scn``），Godot 無法儲存原始 3D 場景檔案（使用不同的格式）。這也是一種更安全的方法，因為它可以避免對原始檔案進行意外更改。

source: To allow customizing the scene and its materials, Godot's scene importer allows for different workflows regarding how data is imported.
de: Damit die Szene und ihre Materialien individuell angepasst werden können, ermöglicht der Godot-Szenenimporter verschiedene Workflows für den Datenimport.
zh_cn: 为了允许自定义场景及其材质，Godot 的场景导入器允许不同的工作流程，视数据的导入方式而定。
zh_tw: 為了允許自訂場景及其材質，Godot 的場景匯入器允許關於資料匯入方式的不同工作流程。

source: Import dock after selecting a 3D scene in the FileSystem dock
de: Import-Dock nach Auswahl einer 3D-Szene im Dateisystem-Dock
zh_cn: 在文件系统面板中选择 3D 场景后的导入面板
zh_tw: 在檔案系統 Dock 中找到腳本。

source: This import process is customizable using 3 separate interfaces, depending on your needs:
de: Dieser Importprozess kann je nach Bedarf über 3 verschiedene Schnittstellen angepasst werden:
zh_cn: 这个导入过程可以通过3个不同的界面进行自定义，具体取决于你的需求：
zh_tw: 此匯入過程可根據您的需求使用 3 個獨立的介面進行自訂：

source: The **Import** dock, after selecting the 3D scene by clicking it once in the FileSystem dock.
de: Das **Import**-Dock, nachdem Sie die 3D-Szene durch einmaliges Anklicken im Dateisystem-Dock ausgewählt haben.
zh_cn: 在文件系统面板中单击一次 3D 场景后，可以在 **导入** 面板进行操作。
zh_tw: **匯入** 塢站，在檔案系統塢站中點選一次選擇 3D 場景後。

source: The **Advanced Import Settings** dialog, which can be accessed by double-clicking the 3D scene in the FileSystem dock or by clicking the **Advanced…** button in the Import dock. This allows you to customize per-object options in Godot.
de: Das Dialogfeld **Erweiterte Importeinstellungen**, das durch Doppelklicken auf die 3D-Szene im Dateisystem-Dock oder durch Klicken auf den **Erweitert...**-Button im Import-Dock aufgerufen werden kann. Hier können Sie die Optionen für jedes einzelne Objekt in Godot anpassen.
zh_cn: 在文件系统面板中双击 3D 场景，或者在带入面板中点击**高级**按钮，就可以打开**高级导入设置**对话框。在这里你可以直接在 Godot 中对每个物体进行定制。
zh_tw: **進階匯入設定**對話框，可以透過雙擊檔案系統擴充座中的 3D 場景或按一下匯入擴充座中的 **進階...** 按鈕來存取該對話框。這允許您在 Godot 中自訂每個物件的選項。

source: :ref:`Import hints <doc_importing_3d_scenes_import_hints>`, which are special suffixes added to object names in the 3D modeling software. This allows you to customize per-object options in the 3D modeling software.
de: :ref:`Import-Hints <doc_importing_3d_scenes_import_hints>` sind spezielle Suffixe, die den Objektnamen in der 3D-Modellierungssoftware hinzugefügt werden. Damit können Sie die Optionen in der 3D-Modellierungssoftware objektspezifisch anpassen.
zh_cn: :ref:`导入提示 <doc_importing_3d_scenes_import_hints>`是添加到 3D 建模软件中的对象名称的特殊后缀，它可以允许你在 3D 建模软件中自定义每个对象的选项。
zh_tw: :ref:`匯入提示 <doc_importing_3d_scenes_import_hints>`，這是新增到 3D 建模軟體中的物件名稱的特殊後綴。這允許您在 3D 建模軟體中自訂每個物件的選項。

source: For basic customization, using the Import dock suffices. However, for more complex operations such as defining material overrides on a per-material basis, you'll need to use the Advanced Import Settings dialog, import hints, or possibly both.
de: Für grundlegende Anpassungen reicht die Verwendung des Importdocks aus. Für komplexere Vorgänge, wie z.B. das Definieren von Materialüberschreibungen für jedes einzelne Material, müssen Sie jedoch das Dialogfeld Erweiterte Importeinstellungen, Import-Hints oder möglicherweise beides verwenden.
zh_cn: 对于基本自定义，使用导入面板的配置就足够了。但是对于更复杂的操作（例如基于每种材质定义材质覆盖），你需要使用“高级导入设置”对话框或导入提示，亦或者同时使用两者。
zh_tw: 對於基本自訂，使用匯入底座就足夠了。但是，對於更複雜的操作（例如基於每種材質定義材質覆蓋），您需要使用「進階匯入設定」對話方塊、匯入提示或可能同時使用兩者。

source: Using the Import dock
de: Verwenden des Importdocks
zh_cn: 使用导入面板
zh_tw: 使用模組

source: The following options can be adjusted in the Import dock after selecting a 3D scene in the FileSystem dock:
de: Die folgenden Optionen können im Import-Dock eingestellt werden, nachdem eine 3D-Szene im Dateisystem-Dock ausgewählt wurde:
zh_cn: 在文件系统面板选中一个 3D 场景之后，可以在导入面板中调整以下选项：
zh_tw: 在檔案系統擴充座中選擇 3D 場景後，可以在匯入擴充座中調整下列選項：

source: **Root Type:** The node type to use as a root node. Using node types that inherit from Node3D is recommended. Otherwise, you'll lose the ability to position the node directly in the 3D editor.
de: **Root-Typ:** Der Node-Typ, der als Root-Node verwendet werden soll. Es wird empfohlen, Node-Typen zu verwenden, die von Node3D erben. Andernfalls verlieren Sie die Möglichkeit, den Node direkt im 3D-Editor zu positionieren.
zh_cn: **根类型：** 被用作为根节点的节点类型。建议使用一个继承自 Node3D 的节点。否则你可能会无法直接在 3D 编辑器里面设置节点的位置。
zh_tw: **根型別：** 用作根節點的節點型別。建議使用從 Node3D 繼承的節點型別。否則，您將無法直接在 3D 編輯器中定位節點。

source: **Root Name:** The name of the root node in the imported scene. This is generally not noticeable when instancing the scene in the editor (or drag-and-dropping from the FileSystem dock), as the root node is renamed to match the filename in this case.
de: **Root-Name:** Der Name des Root-Nodes in der importierten Szene. Dies ist im Allgemeinen nicht bemerkbar, wenn die Szene im Editor instanziiert wird (oder per Drag-and-Drop aus dem Dateisystem-Dock), da der Root-Node in diesem Fall umbenannt wird, um dem Dateinamen zu entsprechen.
zh_cn: **根名称：** （Root Name）导入场景中根节点的名称。在编辑器中实例化场景（或从文件系统面板拖放）时，这通常不太明显，因为在这种情况下，根节点会被重命名以匹配文件名。
zh_tw: **根名稱：**匯入場景中根節點的名稱。在編輯器中實例化場景（或從檔案系統停靠欄拖放）時，這通常不明顯，因為在這種情況下根節點被重新命名以配對檔案名稱。

source: **Apply Root Scale:** If enabled, **Root Scale** will be *applied* on the meshes and animations directly, while keeping the root node's scale to the default `(1, 1, 1)`. This means that if you add a child node later on within the imported scene, it won't be scaled. If disabled, **Root Scale** will multiply the scale of the root node instead.
de: **Root-Skalierung anwenden:** Wenn diese Option aktiviert ist, wird die **Root-Skalierung** direkt auf die Meshes und Animationen angewendet, während die Skalierung des Root-Nodes auf dem Default-Wert `(1, 1, 1)` bleibt. Das bedeutet, dass wenn Sie später einen Child-Node in der importierten Szene hinzufügen, dieser nicht skaliert wird. Wenn es deaktiviert ist, wird **Root-Skalierung** stattdessen die Skalierung des Root-Nodes multiplizieren.
zh_cn: **应用根缩放：** （Apply Root Scale）如果启用， **根缩放** 将直接 *应用* 于网格和动画，同时保持根节点的缩放为默认值 `(1, 1, 1)` 。这意味着如果你稍后在导入的场景中添加一个子节点，它不会被缩放。如果禁用， **根缩放** 将乘以根节点的缩放。
zh_tw: **套用根比例：**如果啟用，**根比例**將直接「套用」在網格和動畫上，同時將根節點的比例保持為預設「(1, 1, 1)」。這意味著如果您稍後在匯入的場景中新增子節點，它將不會縮放。如果停用，**根比例**將乘以根節點的比例。

source: **Meshes**
zh_cn: **网格**
zh_tw: 網格

source: **Ensure Tangents:** If checked, generate vertex tangents using `Mikktspace <http://www.mikktspace.com/>`__ if the input meshes don't have tangent data. When possible, it's recommended to let the 3D modeling software generate tangents on export instead on relying on this option. Tangents are required for correct display of normal and height maps, along with any material/shader features that require tangents. If you don't need material features that require tangents, disabling this can reduce output file size and speed up importing if the source 3D file doesn't contain tangents.
de: **Tangenten gewährleisten:** Wenn diese Option aktiviert ist, werden Vertex-Tangenten mit `Mikktspace <http://www.mikktspace.com/>`__ erzeugt, wenn die Eingabemeshes keine Tangentendaten haben. Wenn möglich, wird empfohlen, die 3D-Modellierungssoftware beim Export die Tangenten erzeugen zu lassen, anstatt sich auf diese Option zu verlassen. Tangenten sind für die korrekte Anzeige von Normalen- und Höhenkarten sowie für alle Material-/Shader-Features erforderlich, die Tangenten benötigen. Wenn Sie keine Materialfunktionen benötigen, die Tangenten benötigen, kann die Deaktivierung dieser Option die Größe der Ausgabedatei verringern und den Import beschleunigen, wenn die 3D-Quelldatei keine Tangenten enthält.
zh_cn: **确保切线：** （Ensure Tangents）如果勾选，在导入的网格没有提供切线数据时，将会使用 `Mikktspace <http://www.mikktspace.com/>`__ 生成顶点的切线。但更推荐使用 3D 建模软件在导出的时候生成切线图像，而不是依赖这个选项。正确显示法线和高度贴图以及需要切线的任何材质/着色器功能都需要切线。如果你不使用需要切线的材质特性，关闭这个选项可以减少导出文件的大小，并且能更快地导入没有存储切线的 3D 文件。
zh_tw: **確保切線：** 如果選中，如果輸入網格沒有切線資料，則使用「Mikktspace <http://www.mikktspace.com/>`__ 產生頂點切線。如果可能，建議讓 3D 建模軟體在匯出時產生切線，而不是依賴此選項。正確顯示法線和高度貼圖以及需要切線的任何材質/著色器功能都需要切線。如果您不需要需要切線的材質特徵，則停用此功能可減少輸出檔案大小，並在來源 3D 檔案不包含切線的情況下加快匯入速度。

source: **Generate LODs:** If checked, generates lower detail variants of the mesh which will be displayed in the distance to improve rendering performance. Not all meshes benefit from LOD, especially if they are never rendered from far away. Disabling this can reduce output file size and speed up importing. See :ref:`doc_mesh_lod` for more information.
de: **LODs erzeugen:** Wenn diese Option aktiviert ist, werden Varianten des Meshes mit geringeren Details erzeugt, die in der Ferne angezeigt werden, um die Performance des Renderings zu verbessern. Nicht alle Meshes profitieren von LOD, insbesondere wenn sie nie aus der Ferne gerendert werden. Die Deaktivierung dieser Option kann die Größe der Ausgabedatei verringern und den Import beschleunigen. Siehe :ref:`doc_mesh_lod` für weitere Informationen.
zh_cn: **生成 LOD：** 如果勾选，则会生成网格的低细节的变体，这些变体将显示在远处以提高渲染性能。并非所有网格体都会受益于 LOD，特别是如果它们从未从远处渲染。禁用此功能可以减少输出文件大小并加快导入速度。请参阅 :ref:`doc_mesh_lod` 了解更多信息。
zh_tw: **產生 LOD：** 如果選中，則會產生網格的較低細節變體，這些變體將顯示在遠處以提高算繪效能。並非所有網格體都受益於 LOD，特別是如果它們從未從遠處算繪。停用此功能可以減少輸出檔案大小並加快匯入速度。請參閱 doc_mesh_lod 以了解更多資訊。

source: **Create Shadow Meshes:** If checked, enables the generation of shadow meshes on import. This optimizes shadow rendering without reducing quality by welding vertices together when possible. This in turn reduces the memory bandwidth required to render shadows. Shadow mesh generation currently doesn't support using a lower detail level than the source mesh (but shadow rendering will make use of LODs when relevant).
de: **Schattenmeshes erstellen:** Wenn diese Option aktiviert ist, werden beim Import Schattenmeshes erstellt. Dies optimiert das Rendering von Schatten, ohne die Qualität zu beeinträchtigen, indem Vertices wenn möglich zusammengeschweißt werden. Dies wiederum reduziert die für das Rendern von Schatten erforderliche Speicherbandbreite. Die Erzeugung von Schattenmeshes unterstützt derzeit nicht die Verwendung einer niedrigeren Detailstufe als die des Quellmeshes (beim Schattenrendering werden jedoch LODs verwendet, wenn dies relevant ist).
zh_cn: **创建阴影网格：** 如果勾选，则可以在导入时生成阴影网格。这可以通过在可能的情况下将顶点接在一起来优化阴影渲染，而不会降低质量。这反过来又减少了渲染阴影所需的内存带宽。阴影网格生成当前不支持使用比源网格更低的细节级别（但阴影渲染将在相关时使用 LOD）。
zh_tw: **建立陰影網格：** 如果選中，則可以在匯入時產生陰影網格。這可以透過在可能的情況下將頂點焊接在一起來優化陰影算繪，而不會降低品質。這反過來又減少了算繪陰影所需的記憶體頻寬。陰影網格產生目前不支援使用比來源網格更低的細節等級（但陰影算繪將在相關時使用 LOD）。

source: **Light Baking:** Configures the meshes' :ref:`global illumination mode <class_GeometryInstance3D_property_gi_mode>` in the 3D scene. If set to **Static Lightmaps**, sets the meshes' GI mode to **Static** and generates UV2 on import for :ref:`lightmap baking <doc_using_lightmap_gi>`.
de: **Licht-Backen:** Konfiguriert den :ref:`Global Illumination-Modus <class_GeometryInstance3D_property_gi_mode>` der Meshes in der 3D-Szene. Wenn er auf **Statische Lightmaps** gesetzt ist, setzt er den GI-Modus der Meshes auf **Statisch** und generiert UV2 beim Import für :ref:`Lightmap-Backen <doc_using_lightmap_gi>`.
zh_cn: **光照烘焙：** 在 3D 场景中配置网格的 :ref:`全局光照模式 <class_GeometryInstance3D_property_gi_mode>`。如果设置为 **Static Lightmaps** （静态光照贴图），则将网格的 GI 模式设置为 **Static** （静态），并在导入时生成 UV2，用于光照贴图烘焙。
zh_tw: 在 3D 場景中配置網格體的全域照明模式<class_GeometryInstance3D_property_gi_mode>`。如果設定為 **靜態光照貼圖**，則將網格體的 GI 模式設為 **靜態** 並在匯入時產生 UV2 以進行光照貼圖烘焙 <doc_using_lightmap_gi>`。

source: **Lightmap Texel Size:** Only visible if **Light Baking** is set to **Static Lightmaps**. Controls the size of each texel on the baked lightmap. A smaller value results in more precise lightmaps, at the cost of larger lightmap sizes and longer bake times.
de: **Lightmap-Texelgröße:** Nur sichtbar, wenn **Licht-Backen** auf **Statische Lightmaps** eingestellt ist. Steuert die Größe der einzelnen Texel auf der gebackenen Lightmap. Ein kleinerer Wert führt zu präziseren Lightmaps, zum Preis von größeren Lightmap-Größen und längeren Backzeiten.
zh_cn: **光照贴图纹素大小：** （Lightmap Texel Size）仅当 **光照烘焙** 设置为 **Static Lightmaps** 时可见。用来控制烘焙光照贴图上每个纹素的大小。较小的值会产生更精确的光照贴图，但代价是更大的光照贴图大小和更长的烘焙时间。
zh_tw: **光照貼圖紋理像素大小：** 僅當 **光照烘焙** 設定為 **靜態光照貼圖** 時才可見。控制烘焙光照貼圖上每個紋素的大小。較小的值會產生更精確的光照貼圖，但代價是更大的光照貼圖尺寸和更長的烘焙時間。

source: **Skins**
zh_cn: **蒙皮**
zh_tw: **天空:**

source: **Use Named Skins:** If checked, use named :ref:`Skins <class_Skin>` for animation. The :ref:`class_MeshInstance3D` node contains 3 properties of relevance here: a skeleton NodePath pointing to the Skeleton3D node (usually ``..``), a mesh, and a skin:
de: **Benannte Skins verwenden:** Wenn diese Option aktiviert ist, werden benannte :ref:`Skins <class_Skin>` für die Animation verwendet. Der :ref:`class_MeshInstance3D`-Node enthält 3 hier relevante Propertys: einen Skelett-NodePath, der auf den Skeleton3D-Node zeigt (normalerweise ``..``), ein Mesh und eine Skin:
zh_cn: **使用具名蒙皮：** 如果勾选，则为动画使用命名的 :ref:`Skins <class_Skin>`。:ref:`class_MeshInstance3D` 节点包含 3 个相关属性：指向 Skeleton3D 节点的骨架 NodePath（通常为 ``..`` ）、一个网格、和一个蒙皮：
zh_tw: **使用命名皮膚：** 如果選中，則使用命名:ref:`Skins <class_Skin>` 進行動畫。 class_MeshInstance3D 節點包含 3 個相關屬性：指向 Skeleton3D 節點的骨架 NodePath（通常為``..``）、網格和皮膚：

source: The :ref:`class_Skeleton3D` node contains a list of bones with names, their pose and rest, a name and a parent bone.
de: Der :ref:`class_Skeleton3D`-Node enthält eine Liste von Knochen mit Namen, deren Pose und Standardpose, einen Namen und einen Parent-Knochen.
zh_cn: :ref:`class_Skeleton3D` 节点包含一个骨骼列表，其中包括骨骼的名称、它们的姿势和休息状态、一个名称和一个父骨骼。
zh_tw: class_Skeleton3D 節點包含骨骼列表，其中包含名稱、姿勢和休息、名稱和父骨骼。

source: The mesh is all of the raw vertex data needed to display a mesh. In terms of the mesh, it knows how vertices are weight-painted and uses some internal numbering often imported from 3D modeling software.
de: Das Mesh ist die Gesamtheit der rohen Vertex-Daten, die zur Darstellung eines Meshes benötigt werden. Das Mesh weiß, wie Vertices gewichtet werden und verwendet eine interne Nummerierung, die oft aus 3D-Modellierungssoftware importiert wird.
zh_cn: 网格是显示网格所需的所有原始顶点数据。就网格而言，它知道如何对顶点进行加权绘制，并使用一些通常从 3D 建模软件导入的内部编号。
zh_tw: 網格是顯示網格所需的所有原始頂點資料。就網格而言，它知道如何對頂點進行權重繪製，並使用通常從 3D 建模軟體匯入的一些內部編號。

source: The skin contains the information necessary to bind this mesh onto this Skeleton3D. For every one of the internal bone IDs chosen by the 3D modeling software, it contains two things. Firstly, a Matrix known as the Bind Pose Matrix, Inverse Bind Matrix, or IBM for short. Secondly, the Skin contains each bone's name (if **Use Named Skins** is enabled), or the bone's index within the Skeleton3D list (if **Use Named Skins** is disabled).
de: Die Skin enthält die Informationen, die erforderlich sind, um dieses Mesh an dieses Skeleton3D zu binden. Für jede der internen Knochen-IDs, die von der 3D-Modellierungssoftware ausgewählt wurden, enthält sie zwei Dinge. Erstens, eine Matrix, die Bind Pose Matrix, Inverse Bind Matrix oder kurz IBM genannt wird. Zweitens enthält die Skin den Namen des jeweiligen Knochens (wenn **Benannte Skins verwenden** aktiviert ist) bzw. den Index des Knochens innerhalb der Skeleton3D-Liste (wenn **Benannte Skins verwenden** deaktiviert ist).
zh_cn: 蒙皮包含将此网格物体绑定到此 Skeleton3D 上所需的信息。对于 3D 建模软件选择的每一个内部骨骼 ID，它都包含两个内容。首先，一个矩阵，称为绑定姿势矩阵（Bind Pose Matrix）、逆绑定矩阵（ Inverse Bind Matrix），或者简称 IBM。其次，蒙皮包含每个骨骼的名称（如果启用 **使用具名蒙皮** 选项），或者骨骼在 Skeleton3D 列表中的索引（如果禁用了 **使用具名蒙皮** 选项）。
zh_tw: 皮膚包含將此網格物件綁定到此 Skeleton3D 上所需的資訊。對於 3D 建模軟體選擇的每一個內部骨骼 ID，它都包含兩件事。首先，一個矩陣，稱為綁定姿勢矩陣、逆綁定矩陣，簡稱 IBM。其次，皮膚包含每個骨骼的名稱（如果啟用了**使用命名皮膚**），或者骨骼在 Skeleton3D 列表中的索引（如果禁用了**使用命名皮膚**）。

source: Together, this information is enough to tell Godot how to use the bone poses in the Skeleton3D node to render the mesh from each MeshInstance3D. Note that each MeshInstance3D may share binds, as is common in models exported from Blender, or each MeshInstance3D may use a separate Skin object, as is common in models exported from other tools such as Maya.
de: Zusammen reichen diese Informationen aus, um Godot mitzuteilen, wie die Knochenposen im Skeleton3D-Node verwendet werden sollen, um das Mesh von jedem MeshInstance3D zu rendern. Beachte, dass jedes MeshInstance3D Binds teilen kann, wie es in aus Blender exportierten Modellen üblich ist, oder jedes MeshInstance3D kann ein separates Skin-Objekt verwenden, wie es in aus anderen Tools wie Maya exportierten Modellen üblich ist.
zh_cn: 这些信息加在一起，足以告诉 Godot 如何使用骨骼 3D 节点中的骨骼姿势来渲染每个 MeshInstance3D 中的网格。请注意，每个 MeshInstance3D 都可以共享绑定，这在从 Blender 导出的模型中很常见；或者每个 MeshInstance3D 都可以使用单独的蒙皮对象，这在从其他工具（如 Maya）导出的模型中很常见。
zh_tw: 總而言之，這些資訊足以告訴 Godot 如何使用 Skeleton3D 節點中的骨骼姿勢來算繪每個 MeshInstance3D 的網格。請注意，每個 MeshInstance3D 可以共享綁定，這在從 Blender 匯出的模型中很常見，或者每個 MeshInstance3D 可以使用單獨的 Skin 對象，這在從其他工具（例如 Maya）匯出的模型中很常見。

source: **Animation**
zh_cn: **动画**
zh_tw: 動畫

source: **Import:** If checked, import animations from the 3D scene.
de: **Importieren:** Wenn diese Option aktiviert ist, werden Animationen aus der 3D-Szene importiert.
zh_cn: **导入：** 如果选中，则从 3D 场景导入动画。
zh_tw: **匯入：** 如果選中，則從 3D 場景匯入動畫。

source: **FPS:** The number of frames per second to use for baking animation curves to a series of points with linear interpolation. It's recommended to configure this value to match the value you're using as a baseline in your 3D modeling software. Higher values result in more precise animation with fast movement changes, at the cost of higher file sizes and memory usage. Thanks to interpolation, there is usually not much benefit in going above 30 FPS (as the animation will still appear smooth at higher rendering framerates).
de: **FPS:** Die Anzahl der Bilder pro Sekunde, die für das Backen von Animationskurven zu einer Reihe von Punkten mit linearer Interpolation verwendet wird. Es wird empfohlen, diesen Wert so zu konfigurieren, dass er mit dem Wert übereinstimmt, den Sie als Grundlinie in Ihrer 3D-Modellierungssoftware verwenden. Höhere Werte führen zu präziseren Animationen mit schnellen Bewegungsänderungen, allerdings zum Preis höherer Dateigrößen und des Speicherbedarfs. Dank der Interpolation bringt es in der Regel nicht viel, über 30 FPS zu gehen (da die Animation auch bei höheren Rendering-Framerates noch flüssig erscheint).
zh_cn: **FPS：** 用线性插值将动画曲线烘焙为一系列点时使用的每秒帧数。建议将此值设置为与 3D 建模软件中的基准值相匹配。数值越大，动画越精确，动作变化越快，但文件大小和内存使用量也越大。由于采用了插值技术，超过 30 FPS 通常不会有太大的好处（因为动画在更高的渲染帧频下仍会显得流畅）。
zh_tw: **FPS：** 用於透過線性內插將動畫曲線烘焙為一系列點的每秒影格數。建議配置此值以符合您在 3D 建模軟體中用作基線的值。較高的值會導致更精確的動畫和快速的運動變化，但代價是檔案大小和記憶體使用量更大。由於插值，超過 30 FPS 通常不會有太大好處（因為動畫在更高的算繪影格速率下仍然會顯得平滑）。

source: **Trimming:** Trim the beginning and end of animations if there are no keyframe changes. This can reduce output file size and memory usage with certain 3D scenes, depending on the contents of their animation tracks.
de: **Beschneiden:** Schneiden Sie den Anfang und das Ende von Animationen ab, wenn es keine Keyframe-Änderungen gibt. Dies kann die Größe der Ausgabedatei und die Speichernutzung bei bestimmten 3D-Szenen reduzieren, je nach Inhalt der Animations-Tracks.
zh_cn: **修剪：** 如果没有关键帧变化，则修剪动画的开头和结尾。这可以减少某些 3D 场景的输出文件大小和内存使用量，具体取决于其动画轨道的内容。
zh_tw: **修剪：** 如果沒有關鍵影格更改，則修剪動畫的開頭和結尾。這可以減少某些 3D 場景的輸出檔案大小和記憶體使用量，具體取決於其動畫軌道的內容。

source: **Remove Immutable Tracks:** Remove animation tracks that only contain default values. This can reduce output file size and memory usage with certain 3D scenes, depending on the contents of their animation tracks.
de: **Unveränderliche Tracks entfernen:** Entfernt Animationstracks, die nur Default-Werte enthalten. Dies kann die Größe der Ausgabedatei und die Speichernutzung bei bestimmten 3D-Szenen reduzieren, je nach Inhalt der Animations-Tracks.
zh_cn: **移除不可修改的轨道：** 移除只包含默认值的动画轨道。这可以减少某些 3D 场景的输出文件大小和内存使用量，具体取决于其动画轨道的内容。
zh_tw: **刪除不可變軌道：**刪除僅包含預設值的動畫軌道。這可以減少某些 3D 場景的輸出檔案大小和記憶體使用量，具體取決於其動畫軌道的內容。

source: **Import Script**
de: **Import-Skript**
zh_cn: **导入脚本**

source: **Path:** Path to an import script, which can run code *after* the import process has completed for custom processing. See :ref:`doc_importing_3d_scenes_import_script` for more information.
de: **Pfad:** Pfad zu einem Import-Skript, das Code *nach* Abschluss des Importvorgangs für die benutzerdefinierte Verarbeitung ausführen kann. Siehe :ref:`doc_importing_3d_scenes_import_script` für weitere Informationen.
zh_cn: **路径：** 导入脚本的路径，该脚本可在导入过程完成后运行代码，进行自定义处理。更多信息请参阅 :ref:`doc_importing_3d_scenes_import_script`。
zh_tw: **路徑：** 匯入腳本的路徑，可以在匯入過程完成後執行程式碼以進行自訂處理。請參閱 doc_importing_3d_scenes_import_script` 以了解更多資訊。
