Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/ios/ios_plugin.po
Languages: de, zh_tw

source: Creating iOS plugins
de: Erstellen von IOS-Plugins
zh_tw: 建立內容

source: This page explains what iOS plugins can do for you, how to use an existing plugin, and the steps to code a new one.
de: Auf dieser Seite wird erklärt, was iOS-Plugins für Sie tun können, wie Sie ein vorhandenes Plugin verwenden und wie Sie ein neues programmieren können.
zh_tw: 本頁說明 iOS 外掛程式可以為你做什麼、如何使用現有的外掛程式、以及編寫新外掛程式的步驟。

source: iOS plugins allow you to use third-party libraries and support iOS-specific features like In-App Purchases, GameCenter integration, ARKit support, and more.
de: iOS Plugins erlauben die Nutzung von Drittanbieterbibliotheken, sowie iOS spezifische Features wie In-App Einkäufe, GameCenter-Integration, ARKit Unterstützung und mehr.
zh_tw: iOS 外掛程式允許你使用協力廠商庫，並支援 iOS 特定功能，如應用內購買、GameCenter 集成、ARKit 支援等。

source: Loading and using an existing plugin
de: Laden und Verwenden eines vorhandenen Plugins
zh_tw: 建立內容

source: An iOS plugin requires a ``.gdip`` configuration file, a binary file which can be either ``.a`` static library or ``.xcframework`` containing ``.a`` static libraries, and possibly other dependencies. To use it, you need to:
de: Ein iOS-Plugin benötigt eine ``.gdip``-Konfigurationsdatei, eine Binärdatei, die entweder eine statische ``.a``-Bibliothek oder eine ``.xcframework`` mit statischen ``.a``-Bibliotheken sein kann, und möglicherweise weitere Abhängigkeiten. Um sie zu benutzen, müssen Sie:
zh_tw: 一個iOS外掛程式需要一個 ``.gdip`` 設定檔, 一個二進位檔案, 它可以是 ``.a`` 靜態程式庫, 也可以是 ``.xcframework`` 包含 ``.a`` 靜態程式庫, 可能還有其他依賴關係. 要使用它, 你需要:

source: Copy the plugin's files to your Godot project's ``res://ios/plugins`` directory. You can also group files in a sub-directory, like ``res://ios/plugins/my_plugin``.
de: Die Dateien des Plugins in das Verzeichnis ``res://ios/plugins`` Ihres Godot-Projekts kopieren. Sie können die Dateien auch in einem Unterverzeichnis gruppieren, z. B. ``res://ios/plugins/my_plugin``.
zh_tw: 將外掛程式的檔複製到Godot專案的 ``res://ios/plugins`` 目錄中. 你也可以將檔群組在一個子目錄中, 比如 ``res://ios/plugins/my_plugin`` .

source: The Godot editor automatically detects and imports ``.gdip`` files inside ``res://ios/plugins`` and its subdirectories.
de: Der Godot-Editor erkennt und importiert automatisch die ``.gdip``-Dateien in ``res://ios/plugins`` und seinen Unterverzeichnissen.
zh_tw: Godot編輯器自動偵測並匯入 ``res://ios/plugins`` 及其子目錄中的 ``.gdip`` 檔案.

source: You can find and activate detected plugins by going to Project -> Export... -> iOS and in the Options tab, scrolling to the Plugins section.
de: Sie können erkannte Plugins finden und aktivieren, indem Sie zu Projekt -> Exportieren... -> iOS gehen und auf dem Optionen-Tab zum Abschnitt Plugins scrollen.
zh_tw: 你可以通過進入專案->匯出... ->iOS, 在分頁中, 滾動到外掛程式部分, 找到並啟動偵測到的外掛程式.

source: When a plugin is active, you can access it in your using ``Engine.get_singleton()``::
de: Wenn ein Plugin aktiv ist, können Sie mit ``Engine.get_singleton()`` darauf zugreifen::
zh_tw: 當外掛程式處於活動狀態時，您可以使用 ``Engine.get_singleton()`` 存取外掛程式： ::

source: The plugin's files have to be in the ``res://ios/plugins/`` directory or a subdirectory, otherwise the Godot editor will not automatically detect them.
de: Die Dateien des Plugins müssen sich im Verzeichnis ``res://ios/plugins/`` oder einem Unterverzeichnis befinden, da der Godot-Editor sie sonst nicht automatisch erkennt.
zh_tw: 插件的檔案必須位於「res://ios/plugins/」目錄或子目錄中，否則Godot編輯器將不會自動偵測到它們。

source: Creating an iOS plugin
de: Erstellen eines iOS-Plugins
zh_tw: 建立內容

source: At its core, a Godot iOS plugin is an iOS library (*.a* archive file or *.xcframework* containing static libraries) with the following requirements:
de: Im Kern ist ein Godot-iOS-Plugin eine iOS-Bibliothek (*.a*-Archivdatei oder *.xcframework* mit statischen Bibliotheken) mit den folgenden Anforderungen:
zh_tw: Godot iOS外掛程式的核心是一個iOS庫( *.a* 檔檔案或 *.xcframework* 包含靜態程式庫), 其要求如下:

source: The library must have a dependency on the Godot engine headers.
de: Die Bibliothek muss eine Abhängigkeit von den Headern der Godot-Engine haben.
zh_tw: 該庫必須依賴Godot引擎標頭檔.

source: The library must come with a ``.gdip`` configuration file.
de: Die Bibliothek muss eine ``.gdip``-Konfigurationsdatei enthalten.
zh_tw: 該庫必須附帶一個 ``.gdip`` 設定檔.

source: An iOS plugin can have the same functionality as a Godot module but provides more flexibility and doesn't require to rebuild the engine.
de: Ein iOS-Plugin kann die gleiche Funktionalität wie ein Godot-Modul haben, bietet aber mehr Flexibilität und erfordert keinen Rebuild der Engine.
zh_tw: 一個iOS外掛程式可以擁有與Godot模組相同的功能, 但提供了更多的靈活性, 並且不需要重新建構引擎.

source: Here are the steps to get a plugin's development started. We recommend using `Xcode <https://developer.apple.com/develop/>`_ as your development environment.
de: Hier sind die Schritte, um mit der Entwicklung eines Plugins zu beginnen. Wir empfehlen die Verwendung der Entwicklungsumgebung `Xcode <https://developer.apple.com/develop/>`_.
zh_tw: 下面是開始開發外掛程式的步驟. 我們建議使用 `Xcode <https://developer.apple.com/develop/>`_ 作為你的開發環境.

source: The `Godot iOS Plugins <https://github.com/godotengine/godot-ios-plugins>`_.
de: Die `Godot iOS Plugins <https://github.com/godotengine/godot-ios-plugins>`_.
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: The `Godot iOS plugin template <https://github.com/naithar/godot_ios_plugin>`_ gives you all the boilerplate you need to get your iOS plugin started.
de: Die `Godot iOS Plugin-Vorlage <https://github.com/naithar/godot_ios_plugin>`_ bietet Ihnen alle notwendigen Grundlagen, um Ihr iOS-Plugin zu starten.
zh_tw: `Godot iOS 外掛程式範本 <https://github.com/naithar/godot_ios_plugin>`_ 為您提供了啟動iOS外掛程式所需的所有樣板.

source: To build an iOS plugin:
de: Um ein iOS-Plugin zu erstellen:
zh_tw: 建立內容

source: Create an Objective-C static library for your plugin inside Xcode.
de: Erstellen Sie eine statische Objective-C-Bibliothek für Ihr Plugin in Xcode.
zh_tw: 在Xcode中為您的外掛程式建立一個Objective-C靜態程式庫.

source: Add the Godot engine header files as a dependency for your plugin library in ``HEADER_SEARCH_PATHS``. You can find the setting inside the ``Build Settings`` tab:
de: Fügen Sie die Godot-Engine-Header-Dateien als Abhängigkeit für Ihre Plugin-Bibliothek in ``HEADER_SEARCH_PATHS`` hinzu. Sie finden diese Einstellung auf der Registerkarte ``Build Settings``:
zh_tw: 在 ``HEADER_SEARCH_PATHS`` 中新增Godot引擎標頭檔作為外掛程式庫的依賴. 你可以在 ``Build Settings`` 分頁中找到這個設定:

source: Download the Godot engine source from the `Godot GitHub page <https://github.com/godotengine/godot>`_.
de: Laden Sie den Quellcode der Godot-Engine von der `Godot GitHub-Seite <https://github.com/godotengine/godot>`_ herunter.
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: Run SCons to generate headers. You can learn the process by reading :ref:`doc_compiling_for_ios`. You don't have to wait for compilation to complete to move forward as headers are generated before the engine starts to compile.
de: Starten Sie SCons, um Header zu erzeugen. Sie können den Prozess lernen, indem Sie :ref:`doc_compiling_for_ios` lesen. Sie müssen nicht warten, bis die Kompilierung abgeschlossen ist, um weiterzumachen, da die Header generiert werden, bevor die Engine mit der Kompilierung beginnt.
zh_tw: 運作SCons來生成標頭檔. 通過閱讀 :ref:`doc_compiling_for_ios` 來瞭解這個過程. 不需要等待編譯完成就可以繼續, 因為在引擎開始編譯之前就會生成標頭檔.

source: You should use the same header files for iOS plugins and for the iOS export template.
de: Sie sollten die gleichen Header-Dateien für iOS-Plugins und für die iOS-Exportvorlage verwenden.
zh_tw: 你應該為iOS外掛程式和iOS匯出範本使用相同的標頭檔.

source: In the ``Build Settings`` tab, specify the compilation flags for your static library in ``OTHER_CFLAGS``. The most important ones are ``-fcxx-modules``, ``-fmodules``, and ``-DDEBUG`` if you need debug support. Other flags should be the same you use to compile Godot. For instance:
de: Geben Sie auf dem ``Build Settings``-Tab unter ``OTHER_CFLAGS`` die Kompilierungsflags für Ihre statische Bibliothek an. Die wichtigsten sind ``-fcxx-modules``, ``-fmodules``, und ``-DDEBUG``, wenn Sie Debug-Unterstützung benötigen. Andere Flags sollten die gleichen sein, die Sie zum Kompilieren von Godot verwenden. Zum Beispiel:
zh_tw: 在 ``Build Settings`` 分頁的 ``OTHER_CFLAGS`` 中指定靜態程式庫的編譯選項。最重要的是 ``-fcxx-modules`` 和 ``-fmodules``，如果你需要支援除錯就還有 ``-DDEBUG``。其他選項應該和你編譯 Godot 時使用的一樣。例如：

source: Add the required logic for your plugin and build your library to generate a ``.a`` file. You will probably need to build both ``debug`` and ``release`` target ``.a`` files. Depending on your needs, pick either or both. If you need both debug and release ``.a`` files, their name should match following pattern: ``[PluginName].[TargetType].a``. You can also build the static library with your SCons configuration.
de: Fügen Sie die erforderliche Logik für Ihr Plugin hinzu und erstellen Sie Ihre Bibliothek, um eine ``.a``-Datei zu erzeugen. Wahrscheinlich müssen Sie ``.a`` Dateien für das ``debug`` und ``release``-Target erstellen. Abhängig von Ihren Bedürfnissen, wählen Sie eine oder beide. Wenn Sie sowohl Debug- als auch Release-``.a`` Dateien benötigen, sollte ihr Name folgendem Muster entsprechen: ``[PluginName].[TargetType].a``. Sie können die statische Bibliothek auch mit Ihrer SCons-Konfiguration erstellen.
zh_tw: 為你的外掛程式新增所需的邏輯, 並建立你的庫以生成一個 ``.a`` 檔案. 你可能需要同時建立 ``debug`` 和 ``release`` 目標 ``.a`` 檔案. 根據你的需要, 選擇其中一個或兩個. 如果你同時需要除錯和發行 ``.a`` 檔, 它們的名字應該符合以下模式: ``[PluginName].[TargetType].a`` . 你也可以用SCons配置來建構靜態程式庫.

source: The iOS plugin system also supports ``.xcframework`` files. To generate one, you can use a command such as:
de: Das iOS-Plugin-System unterstützt auch ``.xcframework``-Dateien. Um eine solche zu erzeugen, können Sie einen Befehl wie den folgenden verwenden:
zh_tw: iOS 外掛程式系統也支援 ``.xcframework`` 檔案。你可以用類似這樣的命令來生成它：

source: Create a Godot iOS Plugin configuration file to help the system detect and load your plugin:
de: Erstellen Sie eine Godot iOS Plugin-Konfigurationsdatei, damit das System Ihr Plugin erkennen und laden kann:
zh_tw: 建立一個Godot iOS外掛程式設定檔, 以説明系統偵測和載入你的外掛程式:

source: The configuration file extension must be ``gdip`` (e.g.: ``MyPlugin.gdip``).
de: Die Erweiterung der Konfigurationsdatei muss ``gdip`` lauten (z.B.: ``MyPlugin.gdip``).
zh_tw: 設定檔的副檔名必須是 ``gdip`` (e.g.: ``MyPlugin.gdip`` ).

source: The configuration file format is as follow::
de: Das Konfigurationsdateiformat lautet wie folgt::
zh_tw: 設定檔格式如下： ::

source: The ``config`` section and fields are required and defined as follow:
de: Der Abschnitt ``config`` und dessen Felder sind erforderlich und wie folgt definiert:
zh_tw: ``config`` 部分和欄位是必須的, 定義如下:

source: **name**: name of the plugin
de: **name**: Name des Plugins
zh_tw: **name**：外掛程式的名稱

source: **binary**: this should be the filepath of the plugin library (``a`` or ``xcframework``) file.
de: **binary**: dies sollte der Dateipfad der Plugin-Bibliothek (``a`` oder ``xcframework``) sein.
zh_tw: **binary** : 這應該是外掛程式庫( ``a`` 或 ``xcframework`` )檔的路徑.

source: The filepath can be relative (e.g.: ``MyPlugin.a``, ``MyPlugin.xcframework``) in which case it's relative to the directory where the ``gdip`` file is located.
de: Der Dateipfad kann relativ sein (z.B.: ``MyPlugin.a``, ``MyPlugin.xcframework``). In diesem Fall ist er relativ zu dem Verzeichnis, in dem sich die ``gdip``-Datei befindet.
zh_tw: 檔路徑可以是相對的(例如: ``MyPlugin.a`` , ``MyPlugin.xcframework`` ), 在這種情況下, 它是相對於 ``gdip`` 檔所在的目錄.

source: The filepath can be absolute: ``res://some_path/MyPlugin.a`` or ``res://some_path/MyPlugin.xcframework``.
de: Der Dateipfad kann absolut sein: ``res://some_path/MyPlugin.a`` oder ``res://some_path/MyPlugin.xcframework``.
zh_tw: 檔路徑可以是絕對的: ``res://some_path/MyPlugin.a`` 或 ``res://some_path/MyPlugin.xcframework`` .

source: In case you need multitarget library usage, the filename should be ``MyPlugin.a`` and ``.a`` files should be named as ``MyPlugin.release.a`` and ``MyPlugin.debug.a``.
de: Falls Sie eine Multitarget-Bibliothek benötigen, sollte der Dateiname ``MyPlugin.a`` lauten und die ``.a``-Dateien sollten als ``MyPlugin.release.a`` und ``MyPlugin.debug.a`` benannt werden.
zh_tw: 如果你需要多目標庫使用, 檔案名應該是 ``MyPlugin.a`` , ``.a`` 檔應該命名為 ``MyPlugin.release.a`` 和 ``MyPlugin.debug.a`` .

source: In case you use multitarget ``xcframework`` libraries, their filename in the configuration should be ``MyPlugin.xcframework``. The ``.xcframework`` files should be named as ``MyPlugin.release.xcframework`` and ``MyPlugin.debug.xcframework``.
de: Falls Sie Multitarget-``xcframework``-Bibliotheken verwenden, sollte deren Dateiname in der Konfiguration ``MyPlugin.xcframework`` lauten. Die ``.xcframework`` Dateien sollten als ``MyPlugin.release.xcframework`` und ``MyPlugin.debug.xcframework`` benannt werden.
zh_tw: 如果你使用多目標庫 ``xcframework`` , 它們在配置中的檔案名應該是 ``MyPlugin.xcframework``. ``.xcframework`` 檔應該被命名為 ``MyPlugin.release.xcframework`` 和 ``MyPlugin.debug.xcframework`` .

source: The ``dependencies`` and ``plist`` sections are optional and defined as follow:
de: Die Abschnitte ``dependencies`` und ``plist`` sind optional und wie folgt definiert:
zh_tw: ``dependencies`` 和 ``plist`` 部分是可選的, 定義如下:

source: **dependencies**:
de: **Abhängigkeiten**:
zh_tw: **依賴** :

source: **linked**: contains a list of iOS frameworks that the iOS application should be linked with.
de: **linked**: enthält eine Liste von iOS-Frameworks, mit denen die iOS-Anwendung verknüpft werden soll.
zh_tw: **linked(連結)** : 包含iOS應用應該包含的iOS框架列表.

source: **embedded**: contains a list of iOS frameworks or libraries that should be both linked and embedded into the resulting iOS application.
de: **embedded**: enthält eine Liste von iOS-Frameworks oder -Bibliotheken, die sowohl gelinkt als auch in die resultierende iOS-Anwendung eingebettet werden sollen.
zh_tw: **embedded** : 嵌入包含一個iOS框架或庫的列表, 這些框架或庫將被連結並嵌入到最終的iOS應用程式中.

source: **system**: contains a list of iOS system frameworks that are required for plugin.
de: **system**: enthält eine Liste der iOS-System-Frameworks, die für das Plugin erforderlich sind.
zh_tw: **system** : 包含外掛程式所需的iOS系統框架的列表.

source: **capabilities**: contains a list of iOS capabilities that is required for plugin. A list of available capabilities can be found at `Apple UIRequiredDeviceCapabilities documentation page <https://developer.apple.com/documentation/bundleresources/information_property_list/uirequireddevicecapabilities>`_.
de: **capabilities**: enthält eine Liste von iOS-Fähigkeiten, die für das Plugin erforderlich sind. Eine Liste der verfügbaren Fähigkeiten finden Sie auf der Dokumentationsseite `Apple UIRequiredDeviceCapabilities <https://developer.apple.com/documentation/bundleresources/information_property_list/uirequireddevicecapabilities>`_.
zh_tw: **capabilities(功能)** : 包含外掛程式所需的iOS功能列表, 可用功能列表可以在 `Apple UIRequiredDeviceCapabilities documentation page <https://developer.apple.com/documentation/bundleresources/information_property_list/uirequireddevicecapabilities>`_ 找到.

source: **files**: contains a list of files that should be copied on export. This is useful for data files or images.
de: **Dateien**: enthält eine Liste von Dateien, die beim Export kopiert werden sollen. Dies ist nützlich für Datendateien oder Bilder.
zh_tw: **files(檔案)** : 包含匯出時應複製的檔列表. 這對資料檔案或圖像很有用.

source: **linker_flags**: contains a list of linker flags to add to the Xcode project when exporting the plugin.
de: **linker_flags**: enthält eine Liste von Linker-Flags, die beim Exportieren des Plugins zum Xcode-Projekt hinzugefügt werden.
zh_tw: **linker_flags** : 包含一個連結器旗標的列表, 在匯出外掛程式時新增到Xcode專案中.

source: **plist**: should have keys and values that should be present in ``Info.plist`` file.
de: **plist**: sollte Keys und Values haben, die in der Datei ``Info.plist`` vorhanden sein sollten.
zh_tw: **plist**: 應該有鍵和值，應該存在於 ``Info.plist`` 檔案中。

source: Each line should follow pattern: ``KeyName:KeyType=KeyValue``
de: Jede Zeile sollte folgendem Muster folgen: ``KeyName:KeyType=KeyValue``
zh_tw: 每行應遵循模式: ``KeyName:KeyType=KeyValue``

source: Supported values for ``KeyType`` are ``string``, ``integer``, ``boolean``, ``raw``, ``string_input``
de: Unterstützte Values für ``KeyType`` sind ``string``, ``integer``, ``boolean``, ``raw``, ``string_input``
zh_tw: ``KeyType`` 支援的值是 ``string``, ``integer``, ``boolean``, ``raw``, ``string_input``

source: If no type is used (e.g.: ``KeyName="KeyValue"``) ``string`` type will be used.
de: Wenn kein Typ verwendet wird (z.B.: ``KeyName="KeyValue"``), wird der Typ ``string`` verwendet.
zh_tw: 如果沒有使用型別，例如: ``KeyName="KeyValue"`` ，將使用 ``string`` 型別。

source: If ``raw`` type is used value for corresponding key will be stored in ``Info.plist`` as is.
de: Wenn der ``raw``-Typ verwendet wird, wird der Wert für den entsprechenden Key in der ``Info.plist`` gespeichert, wie er ist.
zh_tw: 如果使用 ``raw`` 型別，對應鍵的值將按原樣儲存在 ``Info.plist`` 中。

source: If ``string_input`` type is used you will be able to modify value in Export window.
de: Wenn der Typ ``string_input`` verwendet wird, können Sie den Wert im Exportfenster ändern.
zh_tw: 如果使用 ``string_input`` 型別，你將能夠在匯出視窗中修改值。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
