Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/ios/plugins_for_ios.po
Languages: de, zh_tw

source: Plugins for iOS
de: Plugins für iOS
zh_tw: 為 iOS 進行編譯

source: Godot provides StoreKit, GameCenter, iCloud services and other plugins. They are using same model of asynchronous calls explained below.
de: Godot bietet StoreKit, GameCenter, iCloud-Dienste und andere Plugins. Sie verwenden dasselbe Modell asynchroner Aufrufe, das weiter unten erläutert wird.
zh_tw: Godot 提供了 StoreKit、GameCenter、iCloud 服務等外掛程式。它們使用下面解釋的相同非同步呼叫模型。

source: ARKit and Camera access are also provided as plugins.
de: ARKit und Kamerazugriff werden auch als Plugins bereitgestellt.
zh_tw: ARKit和Camera存取也作為外掛程式提供.

source: Latest updates, documentation and source code can be found at `Godot iOS plugins repository <https://github.com/godotengine/godot-ios-plugins>`_
de: Aktuelle Updates, Dokumentation und Quellcode finden Sie im `Godot iOS plugins repository <https://github.com/godotengine/godot-ios-plugins>`_
zh_tw: 若想參與貢獻說明文件，則可在 `此處 <https://github.com/godotengine/godot-docs>`_ 找到其儲存庫。

source: Accessing plugin singletons
de: Zugriff auf Plugin-Singletons
zh_tw: 存取場景節點

source: To access plugin functionality, you first need to check that the plugin is exported and available by calling the `Engine.has_singleton()` function, which returns a registered singleton.
de: Um auf die Plugin-Funktionen zugreifen zu können, müssen Sie zunächst überprüfen, ob das Plugin exportiert wurde und verfügbar ist, indem Sie die Funktion `Engine.has_singleton()` aufrufen, die ein registriertes Singleton zurückgibt.
zh_tw: 要存取外掛程式功能, 首先需要通過呼叫 `Engine.has_singleton()` 函式來檢查外掛程式是否匯出並可用, 該函式會返回一個註冊的單例.

source: Here's an example of how to do this in GDScript:
de: Hier ist ein Beispiel dafür, wie Sie dies in GDScript tun können:
zh_tw: 下列為有兩個骨頭的骨骼節點範例：

source: Asynchronous methods
de: Asynchrone Methoden
zh_tw: 非同步方法

source: When requesting an asynchronous operation, the method will look like this:
de: Wenn Sie eine asynchrone Operation anfordern, sieht die Methode folgendermaßen aus:
zh_tw: 請求非同步作業時, 方法如下所示:

source: The parameter will usually be a Dictionary, with the information necessary to make the request, and the call will have two phases. First, the method will immediately return an Error value. If the Error is not 'OK', the call operation is completed, with an error probably caused locally (no internet connection, API incorrectly configured, etc). If the error value is 'OK', a response event will be produced and added to the 'pending events' queue. Example:
de: Der Parameter ist in der Regel ein Dictionary mit den für die Anfrage erforderlichen Informationen, und der Aufruf erfolgt in zwei Phasen. Zunächst gibt die Methode sofort einen Fehlerwert zurück. Ist der Fehlerwert nicht "OK", wird der Aufrufvorgang abgeschlossen, wobei der Fehler wahrscheinlich lokal verursacht wurde (keine Internetverbindung, API falsch konfiguriert usw.). Ist der Fehlerwert "OK", wird ein Antwort-Ereignis erzeugt und in die Warteschlange "ausstehende Ereignisse" aufgenommen. Beispiel:
zh_tw: 參數通常是一個字典，包含發出請求所需的資訊，並且呼叫將有兩個階段。首先，該方法將立即返回 Error 值。如果這個 Error 不是“OK”，則呼叫操作完成，可能在本地引起錯誤（沒有網路連接、API 配置不正確等）。如果錯誤值是“OK”，則會生成回應事件並將其新增到“掛起事件”佇列中。例如：

source: Remember that when a call returns OK, the API will *always* produce an event through the pending_event interface, even if it's an error, or a network timeout, etc. You should be able to, for example, safely block the interface waiting for a reply from the server. If any of the APIs don't behave this way it should be treated as a bug.
de: Denken Sie daran, dass die API, wenn ein Aufruf mit OK beantwortet wird, *immer* ein Ereignis über die Schnittstelle pending_event erzeugt, auch wenn es sich um einen Fehler, eine Zeitüberschreitung im Netzwerk usw. handelt. Sie sollten in der Lage sein, die Schnittstelle sicher zu blockieren und auf eine Antwort vom Server zu warten. Wenn eine der APIs sich nicht auf diese Weise verhält, sollte dies als Fehler behandelt werden.
zh_tw: 請記住，當一個呼叫返回 OK 時，API 將*始終*通過 pending_event 介面產生一個事件，即使它是一個錯誤，或網路超時等。您應該能夠，例如，安全地阻止等待的介面來自伺服器的回復。如果任何 API 不以這種方式運作，則應將其視為錯誤。

source: The pending event interface consists of two methods:
de: Die Schnittstelle für ausstehende Ereignisse besteht aus zwei Methoden:
zh_tw: 掛起事件介面包含兩個方法：

source: ``get_pending_event_count()`` Returns the number of pending events on the queue.
de: ``get_pending_event_count()`` gibt die Anzahl der ausstehenden Ereignisse in der Warteschlange zurück.
zh_tw: ``get_pending_event_count()`` 返回佇列中掛起事件的數量。

source: ``Variant pop_pending_event()`` Pops the first event from the queue and returns it.
de: ``Variant pop_pending_event()`` entfernt das erste Ereignis aus der Warteschlange und gibt es zurück.
zh_tw: ``Variant pop_pending_event()`` 彈出佇列中的第一個事件並返回它。

source: The Store Kit API is accessible through the ``InAppStore`` singleton. It is initialized automatically.
de: Die Store Kit-API ist über das Singleton ``InAppStore`` zugänglich. Es wird automatisch initialisiert.
zh_tw: Store Kit API 可通過 ``InAppStore`` 單例存取。它是自動初始化的。

source: The following methods are available and documented below:
de: Folgende Methoden sind unten verfügbar und dokumentiert:
zh_tw: 提供了以下方法，文件如下：

source: Purchases a product ID through the Store Kit API. You have to call ``finish_transaction(product_id)`` once you receive a successful response or call ``set_auto_finish_transaction(true)`` prior to calling ``purchase()``. These two methods ensure the transaction is completed.
de: Kauft eine Produkt-ID über die Store Kit API. Sie müssen ``finish_transaction(product_id)`` aufrufen, sobald Sie eine erfolgreiche Antwort erhalten haben oder ``set_auto_finish_transaction(true)`` aufrufen, bevor Sie ``purchase()`` aufrufen. Diese beiden Methoden stellen sicher, dass die Transaktion abgeschlossen wird.
zh_tw: 通過 Store Kit API 購買一個產品 ID。你需要在收到成功回應後呼叫 ``finish_transaction(product_id)``，或者在呼叫 ``purchase()`` 之前呼叫 ``set_auto_finish_transaction(true)``。這兩個方法確保事務完成。

source: Parameters
de: Parameter
zh_tw: 參數

source: Takes a dictionary as a parameter, with one field, ``product_id``, a string with your product ID. Example:
de: Nimmt ein Dictionary als Parameter, mit einem Feld ``product_id``: Einem String mit Ihrer Produkt-ID. Beispiel:
zh_tw: 參數是一個字典，包含一個 ``product_id`` 欄位，是你的商品的字串 ID。例子：

source: Response event
de: Antwortereignis
zh_tw: 回應事件

source: The response event will be a dictionary with the following fields:
de: Das Antwortereignis ist ein Dictionary mit den folgenden Feldern:
zh_tw: 回應事件將是包含以下欄位的字典：

source: On error:
de: bei Fehler:
zh_tw: 出錯時：

source: On success:
de: bei Erfolg:
zh_tw: 成功時：

source: Requests the product info on a list of product IDs.
de: Fordert die Produktinfo aus einer Liste von Produkt-IDs an.
zh_tw: 在產品ID列表中請求產品資訊.

source: Takes a dictionary as a parameter, with a single ``product_ids`` key to which a string array of product IDs is assigned. Example:
de: Nimmt ein Dictionary als Parameter, mit einem einzelnen ``product_ids``-Key, dem ein String-Array von Produkt-IDs zugewiesen wird. Beispiel:
zh_tw: 參數為字典，只有一個欄位 ``product_ids``，是產品 ID 字串的陣列。例如：

source: Restores previously made purchases on user's account. This will create response events for each previously purchased product ID.
de: Stellt zuvor getätigte Käufe auf dem Konto des Benutzers wieder her. Dadurch werden Antwortereignisse für jede zuvor gekaufte Produkt-ID erstellt.
zh_tw: 恢復使用者帳戶之前完成的購買。會為每一個之前購買過的產品 ID 建立響應事件。

source: The response events will be dictionaries with the following fields:
de: Bei den Antwortereignissen geht es um Dictionarys mit den folgenden Feldern:
zh_tw: 回應事件將是包含以下欄位的字典：

source: If set to ``true``, once a purchase is successful, your purchase will be finalized automatically. Call this method prior to calling ``purchase()``.
de: Wenn diese Methode auf ``true`` gesetzt ist, wird der Kauf automatisch abgeschlossen, sobald er erfolgreich war. Rufen Sie diese Methode vor dem Aufruf von ``Purchase()`` auf.
zh_tw: 設為 ``true`` 時，一旦購買成功，就會自動結束購買。請在呼叫 ``purchase()`` 前呼叫本方法。

source: Takes a boolean as a parameter which specifies if purchases should be automatically finalized. Example:
de: Nimmt einen booleschen Wert als Parameter an, der angibt, ob die Einkäufe automatisch abgeschlossen werden sollen. Beispiel:
zh_tw: 參數為布林值，表示購買是否應該自動結束。例如：

source: If you don't want transactions to be automatically finalized, call this method after you receive a successful purchase response.
de: Wenn Sie nicht wollen, dass Transaktionen automatisch abgeschlossen werden, rufen Sie diese Methode auf, nachdem Sie eine erfolgreiche Kaufantwort erhalten haben.
zh_tw: 如果你不希望自動結束交易事務，請在接收到成功購買回應後呼叫本方法。

source: Takes a string ``product_id`` as an argument. ``product_id`` specifies what product to finalize the purchase on. Example:
de: Nimmt einen String ``product_id`` als Argument. Die ``Produkt_ID`` gibt an, für welches Produkt der Kauf abgeschlossen werden soll. Beispiel:
zh_tw: 參數 ``product_id`` 是一個字串。``product_id`` 表示需要結束購買的產品。例如：

source: Game Center
zh_tw: 遊戲中心

source: The Game Center API is available through the ``GameCenter`` singleton. It has the following methods:
de: Die Game Center-API ist über das ``GameCenter``-Singleton verfügbar. Es hat die folgenden Methoden:
zh_tw: Game Center API 可以通過“GameCenter”單例使用。它有以下方法：

source: and the pending events interface:
de: und die Schnittstelle für anstehende Ereignisse:
zh_tw: 以及未決事件介面：

source: ``authenticate``
zh_tw: ``x.attribute``

source: Authenticates a user in Game Center.
de: Authentifiziert einen Benutzer im Game Center.
zh_tw: 在遊戲中心對使用者進行身份驗證.

source: Posts a score to a Game Center leaderboard.
de: Veröffentlicht eine Punktzahl auf einer Game Center-Bestenliste.
zh_tw: 將分數發行到遊戲中心排行榜.

source: Takes a dictionary as a parameter, with two fields:
de: Nimmt ein Dictionary als Parameter mit zwei Feldern:
zh_tw: 參數為一個字典，有兩個欄位：

source: ``score`` a float number
de: ``score`` eine Float-Zahl
zh_tw: ``score`` 浮點數

source: ``category`` a string with the category name
de: ``category`` ein String mit dem Kategorienamen
zh_tw: ``category`` 表示類別名稱的字串

source: Example:
de: Beispiel:
zh_tw: 範例：

source: Modifies the progress of a Game Center achievement.
de: Ändert den Fortschritt eines Game Center-Achievements.
zh_tw: 修改遊戲中心成就的進度.

source: Takes a Dictionary as a parameter, with 3 fields:
de: Nimmt ein Dictionary als Parameter mit 3 Feldern:
zh_tw: 將Dictionary作為參數, 包含3個欄位:

source: ``name`` (string) the achievement name
de: ``name`` (String) den Namen des Achievements
zh_tw: ``name``（字串）成就名稱

source: ``progress`` (float) the achievement progress from 0.0 to 100.0 (passed to ``GKAchievement::percentComplete``)
de: ``progress`` (Float) der Achievements-Fortschritt von 0.0 bis 100.0 (übergeben an ``GKAchievement::percentComplete``)
zh_tw: ``progress``（float）成就進度從 0.0 到 100.0（傳遞給 ``GKAchievement :: percentComplete``）

source: ``show_completion_banner`` (bool) whether Game Center should display an achievement banner at the top of the screen
de: ``show_completion_banner`` (bool) ob Game Center ein Banner am oberen Rand des Bildschirms anzeigen soll
zh_tw: ``show_completion_banner``（bool）遊戲中心是否應該在螢幕頂部顯示成就橫幅

source: Clears all Game Center achievements. The function takes no parameters.
de: Löscht alle Game Center-Achievements. Die Funktion benötigt keine Parameter.
zh_tw: 清除所有 Game Center 成就。該函式不帶參數。

source: Request all the Game Center achievements the player has made progress on. The function takes no parameters.
de: Fordert alle Game Center-Achievements an, bei denen der Spieler Fortschritte gemacht hat. Die Funktion benötigt keine Parameter.
zh_tw: 請求遊戲角色取得進步的所有遊戲中心成就. 該函式不帶參數.

source: Request the descriptions of all existing Game Center achievements regardless of progress. The function takes no parameters.
de: Fordert die Beschreibungen aller vorhandenen Game Center-Achievements unabhängig vom Fortschritt an. Die Funktion benötigt keine Parameter.
zh_tw: 無論進度如何, 都要求描述所有現有的Game Center成就. 該函式不帶參數.

source: ``show_game_center``
zh_tw: ``center()``

source: Displays the built in Game Center overlay showing leaderboards, achievements, and challenges.
de: Zeigt das integrierte Game Center-Overlay mit Bestenlisten, Achievements und Herausforderungen an.
zh_tw: 顯示內建的遊戲中心疊加層, 顯示排行榜, 成就和挑戰.

source: Takes a Dictionary as a parameter, with two fields:
de: Nimmt ein Dictionary als Parameter mit zwei Feldern:
zh_tw: 將Dictionary作為參數, 包含兩個欄位:

source: ``view`` (string) (optional) the name of the view to present. Accepts "default", "leaderboards", "achievements", or "challenges". Defaults to "default".
de: ``view`` (String) (optional) der Name der zu präsentierenden Ansicht. Akzeptiert "default", "leaderboards", "achievements", oder "challenges". Standardmäßig wird "default" verwendet.
zh_tw: ``view``（字串）（可選）要呈現的視圖的名稱。接受“default”（預設）“leaderboards”（排行榜）“achievements”（成就）“challenges”（挑戰）。預設為“default”。

source: ``leaderboard_name`` (string) (optional) the name of the leaderboard to present. Only used when "view" is "leaderboards" (or "default" is configured to show leaderboards). If not specified, Game Center will display the aggregate leaderboard.
de: ``leaderboard_name`` (String) (optional) der Name des Leaderboards, das angezeigt werden soll. Wird nur verwendet, wenn "view" gleich "leaderboards" ist (oder "default" so konfiguriert ist, dass Leaderboards angezeigt werden). Wenn nicht angegeben, zeigt Game Center die Gesamtrangliste an.
zh_tw: ``leaderboard_name``（字串）（可選）要顯示的排行榜的名稱。僅在“view”為“leaderboards”（或“default”被配置為顯示排行榜）時使用。如果未指定，Game Center 將顯示聚合排行榜。

source: Examples:
de: Beispiele:
zh_tw: 範例：

source: On close:
de: beim Beenden:
zh_tw: 關閉時：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Implemented in `Godot iOS InAppStore plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/inappstore/in_app_store.mm>`_.
de: Implementiert in `Godot iOS InAppStore plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/inappstore/in_app_store.mm>`_.

source: Implemented in `Godot iOS GameCenter plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/gamecenter/game_center.mm>`_.
de: Implementiert in `Godot iOS GameCenter Plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/gamecenter/game_center.mm>`_.
