Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/3d_gizmos.po
Languages: de, zh_tw

source: Introduction
de: Einführung
zh_tw: 前言

source: 3D gizmo plugins are used by the editor and custom plugins to define the gizmos attached to any kind of Node3D node.
de: 3D-Gizmo-Plugins werden vom Editor und von benutzerdefinierten Plugins verwendet, um die Gizmos zu definieren, die mit jeder Art von Node3D-Node verbunden sind.
zh_tw: 3D 小工具外掛程式是由編輯器和自訂外掛程式來定義附加到任何型別的 Node3D 節點的小工具。

source: This tutorial shows the two main approaches to defining your own custom gizmos. The first option works well for simple gizmos and creates less clutter in your plugin structure, and the second one will let you store some per-gizmo data.
de: Dieses Tutorial zeigt die beiden Hauptansätze für die Definition Ihrer eigenen benutzerdefinierten Gizmos. Die erste Option eignet sich gut für einfache Gizmos und schafft weniger Unordnung in Ihrer Plugin-Struktur, und die zweite ermöglicht es Ihnen, einige Daten pro Gizmo zu speichern.
zh_tw: 本教學將向您展示定義您自己的自訂小工具的兩種主要方法。第一種方法對於簡單的小工具來說效果很好，並且在你的外掛程式結構中較少的混亂，而第二種方法將讓你儲存每個小工具的一些資料。

source: This tutorial assumes you already know how to make generic plugins. If in doubt, refer to the :ref:`doc_making_plugins` page.
de: Dieses Tutorial setzt voraus, dass Sie bereits wissen, wie man generische Plugins erstellt. Im Zweifelsfall lesen Sie bitte die Seite :ref:`doc_making_plugins`.
zh_tw: 本教學假設您已經知道如何製作通用外掛程式。如有疑問，請參閱 :ref:`doc_making_plugins` 頁面。

source: The EditorNode3DGizmoPlugin
de: Das EditorNode3DGizmoPlugin
zh_tw: EditorNode3DGizmoPlugin

source: Regardless of the approach we choose, we will need to create a new :ref:`EditorNode3DGizmoPlugin <class_EditorNode3DGizmoPlugin>`. This will allow us to set a name for the new gizmo type and define other behaviors such as whether the gizmo can be hidden or not.
de: Unabhängig davon, welchen Ansatz wir wählen, müssen wir ein neues :ref:`EditorNode3DGizmoPlugin <class_EditorNode3DGizmoPlugin>` erstellen. Damit können wir einen Namen für den neuen Gizmo-Typ festlegen und andere Verhaltensweisen definieren, z. B. ob das Gizmo ausgeblendet werden kann oder nicht.
zh_tw: 不管我們選擇什麼方式，都需要建立一個新的 :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>`。我們可以為新建的小工具型別設定名稱並定義其他行為，比如是否可以隱藏。

source: This would be a basic setup:
de: Dies wäre ein einfaches Setup:
zh_tw: 這是一個基本設定:

source: For simple gizmos, inheriting :ref:`EditorNode3DGizmoPlugin <class_EditorNode3DGizmoPlugin>` is enough. If you want to store some per-gizmo data or you are porting a Godot 3.0 gizmo to 3.1+, you should go with the second approach.
de: Für einfache Gizmos reicht es aus, :ref:`EditorNode3DGizmoPlugin <class_EditorNode3DGizmoPlugin>` zu erben. Wenn Sie einige Daten pro Gizmo speichern wollen oder ein Godot 3.0-Gizmo auf 3.1+ portieren, sollten Sie den zweiten Ansatz wählen.
zh_tw: 簡單的小工具只要繼承 :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` 就足夠了。如果你想儲存每個小工具的一些資料，或者你要把 Godot 3.0 的小工具移植到 3.1+，你應該選擇第二種方法。

source: Simple approach
de: Ein einfacher Ansatz
zh_tw: 簡單方法

source: The first step is to, in our custom gizmo plugin, override the :ref:`_has_gizmo()<class_EditorNode3DGizmoPlugin_private_method__has_gizmo>` method so that it returns ``true`` when the node parameter is of our target type.
de: Der erste Schritt besteht darin, in unserem benutzerdefinierten Gizmo-Plugin die Methode :ref:`_has_gizmo()<class_EditorNode3DGizmoPlugin_private_method__has_gizmo>` zu überschreiben, so dass sie ``true`` zurückgibt, wenn der Node-Parameter unserem Zieltyp entspricht.

source: Then we can override methods like :ref:`_redraw()<class_EditorNode3DGizmoPlugin_private_method__redraw>` or all the handle related ones.
de: Dann können wir Methoden wie :ref:`_redraw()<class_EditorNode3DGizmoPlugin_private_method__redraw>` oder alle Handle-bezogenen Methoden außer Kraft setzen.

source: Note that we created a material in the `_init` method, and retrieved it in the `_redraw` method using :ref:`get_material()<class_EditorNode3DGizmoPlugin_method_get_material>`. This method retrieves one of the material's variants depending on the state of the gizmo (selected and/or editable).
de: Beachten Sie, dass wir in der Methode `_init` ein Material erstellt und es in der Methode `_redraw` mit :ref:`get_material()<class_EditorNode3DGizmoPlugin_method_get_material>` abgerufen haben. Diese Methode ruft je nach Zustand des Gizmo (ausgewählt und/oder bearbeitbar) eine der Materialvarianten ab.
zh_tw: 請注意，我們在 `_init` 方法中建立了一個材質，並在 `redraw` 方法中使用 :ref:`get_material()<class_EditorSpatialGizmoPlugin_method_get_material>` 取得它。該方法根據小工具的狀態（選擇中和/或可編輯）來獲取材質的變體。

source: So the final plugin would look somewhat like this:
de: Das fertige Plugin sollte ungefähr so aussehen:
zh_tw: 您最後的場景應該是這樣的:

source: Note that we just added some handles in the `_redraw` method, but we still need to implement the rest of handle-related callbacks in :ref:`EditorNode3DGizmoPlugin <class_EditorNode3DGizmoPlugin>` to get properly working handles.
de: Beachten Sie, dass wir nur einige Handles in der `_redraw` Methode hinzugefügt haben, aber wir müssen noch den Rest der Handle-bezogenen Callbacks in :ref:`EditorNode3DGizmoPlugin <class_EditorNode3DGizmoPlugin>` implementieren, um richtig funktionierende Handles zu bekommen.
zh_tw: 注意，我們只是在重繪方法中新增了一些控制碼，但是我們仍然需要在 :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` 中實作其他與控制碼相關的回呼函式，以獲得正確的工作控制碼。

source: Alternative approach
de: Ein alternativer Ansatz
zh_tw: 替代方法

source: In some cases we want to provide our own implementation of :ref:`EditorNode3DGizmo<class_EditorNode3DGizmo>`, maybe because we want to have some state stored in each gizmo or because we are porting an old gizmo plugin and we don't want to go through the rewriting process.
de: In einigen Fällen wollen wir unsere eigene Implementierung von :ref:`EditorNode3DGizmo<class_EditorNode3DGizmo>` bereitstellen, vielleicht weil wir einen gewissen Zustand in jedem Gizmo gespeichert haben wollen oder weil wir ein altes Gizmo-Plugin portieren und nicht durch den Neuschreibungsprozess gehen wollen.
zh_tw: 在某些情況下，我們希望提供自己的 :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>` 實作，也許是因為我們想要在每個小工具中儲存一些狀態，或者正在移植一個舊的小工具外掛程式，而不想經歷重寫過程。

source: In these cases all we need to do is, in our new gizmo plugin, override :ref:`_create_gizmo()<class_EditorNode3DGizmoPlugin_private_method__create_gizmo>`, so it returns our custom gizmo implementation for the Node3D nodes we want to target.
de: In diesen Fällen müssen wir in unserem neuen Gizmo-Plugin nur :ref:`_create_gizmo()<class_EditorNode3DGizmoPlugin_private_method__create_gizmo>` überschreiben, damit es unsere benutzerdefinierte Gizmo-Implementierung für die Node3D-Node zurückgibt, auf die wir abzielen wollen.

source: This way all the gizmo logic and drawing methods can be implemented in a new class extending :ref:`EditorNode3DGizmo<class_EditorNode3DGizmo>`, like so:
de: Auf diese Weise kann die gesamte Gizmo-Logik und die Zeichenmethoden in einer neuen Klasse implementiert werden, von der die Klasse :ref:`EditorNode3DGizmo<class_EditorNode3DGizmo>` erweitert wird, etwa so:
zh_tw: 這樣，所有的小工具邏輯和繪圖方法都可以在一個新的類中實作，這個類擴充自 :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>`，像這樣：

source: Note that we just added some handles in the `_redraw` method, but we still need to implement the rest of handle-related callbacks in :ref:`EditorNode3DGizmo<class_EditorNode3DGizmo>` to get properly working handles.
de: Beachten Sie, dass wir gerade einige Handles in der `_redraw` Methode hinzugefügt haben, aber wir müssen noch den Rest der Handle-bezogenen Callbacks in :ref:`EditorNode3DGizmo<class_EditorNode3DGizmo>` implementieren, um richtig funktionierende Handles zu bekommen.
zh_tw: 請注意，我們剛剛在重繪方法中新增了一些控制碼，但我們仍然需要在 :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>` 中實作其餘的與控制碼相關的回呼函式，以獲得正確工作的控制碼。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: 3D gizmo plugins
zh_tw: 3D小工具外掛
