Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/inspector_plugins.po
Languages: de, zh_tw

source: Inspector plugins
de: Inspektor-Plugins
zh_tw: 屬性面板外掛程式

source: The inspector dock allows you to create custom widgets to edit properties through plugins. This can be beneficial when working with custom datatypes and resources, although you can use the feature to change the inspector widgets for built-in types. You can design custom controls for specific properties, entire objects, and even separate controls associated with particular datatypes.
de: Das Inspektor-Dock ermöglicht es Ihnen, benutzerdefinierte Widgets zu erstellen, um Propertys über Plugins zu bearbeiten. Dies kann bei der Arbeit mit benutzerdefinierten Datentypen und Ressourcen von Vorteil sein, obwohl Sie die Funktion auch verwenden können, um die Inspektor-Widgets für Built-in-Typen zu ändern. Sie können benutzerdefinierte Steuerelemente für bestimmte Eigenschaften, ganze Objekte und sogar separate Controls in Verbindung mit bestimmten Datentypen erstellen.
zh_tw: 屬性面板面板支援以外掛程式的形式來建立自訂小工具編輯屬性。儘管可以用它來修改內建型別的屬性面板小工具，但它在需要處理自訂資料型別和資源時尤其有用。你不但可以為特定的屬性或者整個物件設計自訂控制項，還可以為特定資料型別設計單獨的控制項。

source: This guide explains how to use the :ref:`class_EditorInspectorPlugin` and :ref:`class_EditorProperty` classes to create a custom interface for integers, replacing the default behavior with a button that generates random values between 0 and 99.
de: Diese Anleitung erklärt, wie man die Klassen :ref:`class_EditorInspectorPlugin` und :ref:`class_EditorProperty` verwendet, um eine benutzerdefinierte Schnittstelle für Integer-Zahlen zu erstellen, die das Default-Verhalten durch einen Button ersetzt, die zufällige Werte zwischen 0 und 99 erzeugt.
zh_tw: 這份指南會介紹如何使用 :ref:`class_EditorInspectorPlugin` 和 :ref:`class_EditorProperty` 類來為整數型別建立自訂的介面，將預設的行為替換為一個按了以後就會生成 0 到 99 之間亂數的按鈕。

source: The default behavior on the left and the end result on the right.
de: Das Default-Verhalten auf der linken Seite und das Endergebnis auf der rechten Seite.
zh_tw: 左圖為預設行為，右圖為最終結果。

source: Setting up your plugin
de: Einrichten Ihres Plugins
zh_tw: 設定 Python

source: Create a new empty plugin to get started.
de: Erstellen Sie ein neues leeres Plugin, um loszulegen.
zh_tw: 從建立新的空外掛程式開始。

source: See :ref:`doc_making_plugins` guide to set up your new plugin.
de: Siehe die :ref:`doc_making_plugins`-Anleitung, um Ihr neues Plugin einzurichten.
zh_tw: 如何建立新外掛程式請參閱 :ref:`doc_making_plugins`。

source: Let's assume you've called your plugin folder ``my_inspector_plugin``. If so, you should end up with a new ``addons/my_inspector_plugin`` folder that contains two files: ``plugin.cfg`` and ``plugin.gd``.
de: Nehmen wir an, Sie haben Ihren Plugin-Ordner ``my_inspector_plugin`` genannt. Wenn dies der Fall ist, sollten Sie einen neuen Ordner ``addons/my_inspector_plugin`` haben, der zwei Dateien enthält: ``plugin.cfg`` und ``plugin.gd``.
zh_tw: 讓我們假設你的外掛程式資料夾叫做 ``my_inspector_plugin``。那麼此時你新建的 ``addons/my_inspector_plugin`` 資料夾中就有兩個檔案：``plugin.cfg`` 和 ``plugin.gd``。

source: As before, ``plugin.gd`` is a script extending :ref:`class_EditorPlugin` and you need to introduce new code for its ``_enter_tree`` and ``_exit_tree`` methods. To set up your inspector plugin, you must load its script, then create and add the instance by calling ``add_inspector_plugin()``. If the plugin is disabled, you should remove the instance you have added by calling ``remove_inspector_plugin()``.
de: Wie zuvor ist ``plugin.gd`` ein Skript, das :ref:`class_EditorPlugin` erweitert, und Sie müssen neuen Code für seine Methoden ``_enter_tree`` und ``_exit_tree`` einführen. Um Ihr Inspektor-Plugin einzurichten, müssen Sie sein Skript laden, dann die Instanz erzeugen und hinzufügen, indem Sie ``add_inspector_plugin()`` aufrufen. Wenn das Plugin deaktiviert ist, sollten Sie die hinzugefügte Instanz durch den Aufruf von ``remove_inspector_plugin()`` entfernen.
zh_tw: 和之前一樣，``plugin.gd`` 是一個擴充了 :ref:`class_EditorPlugin` 的腳本，你需要在 ``_enter_tree`` 和 ``_exit_tree`` 方法中加入新的程式碼。要建立自己的屬性面板外掛程式，你必須載入對應的腳本，然後建立並呼叫 ``add_inspector_plugin()`` 來新增實例。禁用外掛程式時，你應該呼叫 ``remove_inspector_plugin()`` 將該實例移除。

source: Here, you are loading a script and not a packed scene. Therefore you should use ``new()`` instead of ``instance()``.
de: Hier laden Sie ein Skript und nicht eine gepackte Szene. Daher sollten Sie ``new()`` anstelle von ``instance()`` verwenden.
zh_tw: 因為你在這裡讀取的是腳本而不是場景包，所以應該使用 ``new()`` 而不是 ``instance()``。

source: Interacting with the inspector
de: Interaktion mit dem Inspektor
zh_tw: 產生金鑰儲存區

source: To interact with the inspector dock, your ``my_inspector_plugin.gd`` script must extend the :ref:`class_EditorInspectorPlugin` class. This class provides several virtual methods that affect how the inspector handles properties.
de: Um mit dem Inspektor-Dock zu interagieren, muss Ihr Skript ``my_inspector_plugin.gd`` die Klasse :ref:`class_EditorInspectorPlugin` erweitern. Diese Klasse bietet mehrere virtuelle Methoden, die beeinflussen, wie der Inspektor mit Propertys umgeht.
zh_tw: 要和屬性面板面板互動，你的 ``my_inspector_plugin.gd`` 腳本必須繼承自 :ref:`class_EditorInspectorPlugin` 類。這個類提供了不少虛方法，可以用來控制屬性面板對屬性的處理。

source: To have any effect at all, the script must implement the ``_can_handle()`` method. This function is called for each edited :ref:`class_Object` and must return ``true`` if this plugin should handle the object or its properties.
de: Um überhaupt einen Effekt zu haben, muss das Skript die Methode ``_can_handle()`` implementieren. Diese Funktion wird für jedes bearbeitete :ref:`class_Object` aufgerufen und muss ``true`` zurückgeben, wenn dieses Plugin das Objekt oder seine Propertys behandeln soll.
zh_tw: 腳本必須實作 ``can_handle()`` 方法才能生效。這個函式會針對每個被編輯的 :ref:`class_Object` 物件呼叫，外掛程式想要處理該物件或其屬性的話，就必須返回 ``true``。

source: This includes any :ref:`class_Resource` attached to the object.
de: Dies schließt jede :ref:`class_Resource` ein, die mit dem Objekt verbunden ist.
zh_tw: 要處理附加在該物件上的 :ref:`class_Resource` 也同樣如此。

source: You can implement four other methods to add controls to the inspector at specific positions. The ``parse_begin()`` and ``parse_end()`` methods are called only once at the beginning and the end of parsing for each object, respectively. They can add controls at the top or bottom of the inspector layout by calling ``add_custom_control()``.
de: Sie können vier weitere Methoden implementieren, um dem Inspektor an bestimmten Positionen Controls hinzuzufügen. Die Methoden ``parse_begin()`` und ``parse_end()`` werden nur einmal am Anfang bzw. am Ende des Parsens für jedes Objekt aufgerufen. Sie können Controls am oberen oder unteren Rand des Inspektor-Layouts hinzufügen, indem sie ``add_custom_control()`` aufrufen.
zh_tw: 另外還有四個方法可以實作，用來往屬性面板的特定位置新增空間。``parse_begin()`` 和 ``parse_end()`` 方法顧名思義，只會在每個物件開始解析和結束解析的時候呼叫一次。在其中呼叫 ``add_custom_control()`` 就可以在屬性面板佈局的頂部或底部新增控制項。

source: As the editor parses the object, it calls the ``parse_category()`` and ``_parse_property()`` methods. There, in addition to ``add_custom_control()``, you can call both ``add_property_editor()`` and ``add_property_editor_for_multiple_properties()``. Use these last two methods to specifically add :ref:`class_EditorProperty`-based controls.
de: Wenn der Editor das Objekt analysiert, ruft er die Methoden ``parse_category()`` und ``_parse_property()`` auf. Dort können Sie, zusätzlich zu ``add_custom_control()``, sowohl ``add_property_editor()`` als auch ``add_property_editor_for_multiple_properties()`` aufrufen. Benutzen Sie diese letzten beiden Methoden, um speziell :ref:`class_EditorProperty`-basierte Controls hinzuzufügen.
zh_tw: 編輯器解析物件時，會呼叫 ``parse_category()`` 和 ``_parse_property()`` 方法。在這兩個函式中，除了 ``add_custom_control()`` 以外，你還可以呼叫 ``add_property_editor()`` 和 ``add_property_editor_for_multiple_properties()``，這兩個函式是專門用來新增基於 :ref:`class_EditorProperty` 的控制項的。

source: Adding an interface to edit properties
de: Hinzufügen einer Schnittstelle zum Bearbeiten von Propertys
zh_tw: 新增檔案至專案

source: The :ref:`class_EditorProperty` class is a special type of :ref:`class_Control` that can interact with the inspector dock's edited objects. It doesn't display anything but can house any other control nodes, including complex scenes.
de: Die Klasse :ref:`class_EditorProperty` ist ein spezieller Typ von :ref:`class_Control`, der mit den bearbeiteten Objekten des Inspektor-Docks interagieren kann. Sie zeigt nichts an, kann aber alle anderen Nodes beherbergen, einschließlich komplexer Szenen.
zh_tw: :ref:`class_EditorProperty` 是一種特殊的 :ref:`class_Control`，可以與屬性面板面板所編輯的物件進行互動。它本身不顯示任何內容，但可以放入其他控制項節點，甚至是複雜的場景。

source: There are three essential parts to the script extending :ref:`class_EditorProperty`:
de: Das Skript besteht aus drei wesentlichen Teilen, die :ref:`class_EditorProperty` erweitern:
zh_tw: 擴充 :ref:`class_EditorProperty` 的腳本有三個必不可少的部分：

source: You must define the ``_init()`` method to set up the control nodes' structure.
de: Sie müssen die Methode ``_init()`` definieren, um die Struktur der Control-Nodes einzurichten.
zh_tw: 必須定義 ``_init()`` 方法，設定控制項節點的結構。

source: You should implement the ``_update_property()`` to handle changes to the data from the outside.
de: Sie sollten die Funktion ``_update_property()`` implementieren, um Änderungen an den Daten von außen zu behandeln.
zh_tw: 應該實作 ``_update_property()``，處理外部對資料的更改。

source: A signal must be emitted at some point to inform the inspector that the control has changed the property using ``emit_changed``.
de: Irgendwann muss ein Signal ausgegeben werden, um den Inspektor darüber zu informieren, daß das Control die Property mit ``emit_changed`` geändert hat.
zh_tw: 必須在某處使用 ``emit_changed`` 觸發訊號，告知屬性面板本控制項對屬性進行了修改。

source: You can display your custom widget in two ways. Use just the default ``add_child()`` method to display it to the right of the property name, and use ``add_child()`` followed by ``set_bottom_editor()`` to position it below the name.
de: Sie können Ihr eigenes Widget auf zwei Arten darstellen. Verwenden Sie einfach die Default-Methode ``add_child()``, um es rechts vom Namen der Property anzuzeigen, oder verwenden Sie ``add_child()`` gefolgt von ``set_bottom_editor()``, um es unterhalb des Namens zu positionieren.
zh_tw: 顯示自訂小工具的方法有兩種。可以只用預設的 ``add_child()`` 方法可以把它顯示到屬性名稱的右邊，在 ``add_child()`` 之後再呼叫 ``set_bottom_editor()`` 就可以把它顯示到名稱的下邊。

source: Using the example code above you should be able to make a custom widget that replaces the default :ref:`class_SpinBox` control for integers with a :ref:`class_Button` that generates random values.
de: Mit dem obigen Beispielcode sollten Sie in der Lage sein, ein benutzerdefiniertes Widget zu erstellen, um das Default-Control :ref:`class_SpinBox` für Integer-Zahlen durch einen :ref:`class_Button` zu ersetzen, der Zufallswerte generiert.
zh_tw: 使用上面的範例程式碼，可以實作用自訂的小工具替代整數預設的 :ref:`class_SpinBox` 控制項，點擊 :ref:`class_Button` 後生成隨機值。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
