Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/installing_plugins.po
Languages: de, zh_tw

source: Installing plugins
de: Plugins installieren
zh_tw: 安裝外掛

source: Godot features an editor plugin system with numerous plugins developed by the community. Plugins can extend the editor's functionality with new nodes, additional docks, convenience features, and more.
de: Godot verfügt über ein Editor-Plugin-System mit zahlreichen Plugins, die von der Community entwickelt wurden. Plugins können die Funktionalität des Editors um neue Nodes, zusätzliche Docks, Komfortfunktionen und mehr erweitern.
zh_tw: Godot提供了一個編輯器外掛程式系統, 其中包含了社區開發的眾多外掛程式. 外掛程式可以外掛程式可以通過新的節點, 額外附加腳本, 更多便捷的功能等來擴充編輯器的功能.

source: Finding plugins
de: Plugins finden
zh_tw: 尋找外掛

source: The preferred way to find Godot plugins is to use the `Asset Library <https://godotengine.org/asset-library/>`_. While it can be browsed online, it's more convenient to use it directly from the editor. To do so, click the **AssetLib** tab at the top of the editor:
de: Der bevorzugte Weg, um Godot-Plugins zu finden, ist die Verwendung der `Asset-Bibliothek <https://godotengine.org/asset-library/>` _. Sie kann zwar online durchsucht werden, jedoch ist es bequemer, sie direkt im Editor zu verwenden. Klicken Sie dazu oben im Editor auf den **AssetLib**-Tab:
zh_tw: 尋找 Godot 外掛程式的首選方法是使用 `Asset Library 素材庫 <https://godotengine.org/asset-library/>`_。雖然它可以線上瀏覽，但直接在編輯器中使用更方便，點擊編輯器頂部的 **AssetLib** 分頁：

source: You can also find assets on code hosting websites such as GitHub.
de: Sie finden Assets auch auf Code-Hosting-Webseiten, wie GitHub.
zh_tw: 您還可以在 GitHub 等程式碼託管網站上找到素材。

source: Some repositories describe themselves as "plugins" but may not actually be *editor* plugins. This is especially the case for scripts that are intended to be used in a running project. You don't need to enable such plugins to use them. Download them and extract the files in your project folder.
de: Einige Repositorys bezeichnen sich selbst als "Plugins", sind aber nicht unbedingt *Editor*-Plugins. Dies ist insbesondere bei Skripten der Fall, die in einem laufenden Projekt verwendet werden sollen. Sie brauchen solche Plugins nicht zu aktivieren, um sie zu verwenden. Laden Sie sie herunter und entpacken Sie die Dateien in Ihren Projektordner.
zh_tw: 有些倉庫將自己描述為“外掛程式”，但實際上可能不是*編輯器*外掛程式。對於那些打算在運作中的專案中使用的腳本來說尤其如此。你不需要啟用這些外掛程式來使用它們。下載它們並將檔解壓到你的專案檔案夾中。

source: One way to distinguish editor plugins from non-editor plugins is to look for a ``plugin.cfg`` file in the repository that hosts the plugin. If the repository contains a ``plugin.cfg`` file in a folder placed in the ``addons/`` folder, then it is an editor plugin.
de: Eine Möglichkeit, Editor-Plugins von Nicht-Editor-Plugins zu unterscheiden, ist die Suche nach einer ``plugin.cfg``-Datei in dem Repository, in dem das Plugin liegt. Wenn das Repository eine ``plugin.cfg`` Datei in einem Ordner im ``addons/`` Ordner enthält, dann ist es ein Editor-Plugin.
zh_tw: 一種區分編輯器外掛程式和非編輯器外掛程式的方法是在存放外掛程式的倉庫中搜尋 ``plugin.cfg`` 檔案。如果倉庫的 ``addons/`` 中包含 ``plugin.cfg`` 檔，那麼它就是編輯器外掛程式。

source: Installing a plugin
de: Installieren eines Plugins
zh_tw: 安裝外掛

source: To install a plugin, download it as a ZIP archive. On the Asset Library, this can be done using the **Download** button, either from the editor or using the Web interface.
de: Um ein Plugin zu installieren, laden Sie es als ZIP-Archiv herunter. In der Asset-Bibliothek kann dies über den **Herunterladen**-Button entweder im Editor oder über die Web-Oberfläche erfolgen.
zh_tw: 要安裝外掛程式，請將其下載為 ZIP 存檔。在素材資源庫中，可以使用**下載**按鈕（通過編輯器或使用 Web 介面）來完成此操作。

source: On GitHub, if a plugin has *tags* (versions) declared, go to the **Releases** tab to download a stable release. This ensures you download a version that was declared to be stable by its author.
de: Wenn ein Plugin auf GitHub mit *Tags* (Versionen) deklariert ist, gehen Sie zum Tab **Releases**, um eine stable Version herunterzuladen. Dadurch wird sichergestellt, dass Sie eine Version herunterladen, die vom Autor als stable deklariert wurde.
zh_tw: 在 GitHub 上，如果外掛程式已打 *Tag*（標籤、版本），請轉到 **Releases** 分頁下載穩定的版本。這樣就能確保你下載到的是作者發行的穩定版本。

source: On GitHub, if the plugin doesn't have any *tags* declared, use the **Download ZIP** button to download a ZIP of the latest revision:
de: Wenn auf Github beim Plugin keine * Tags * deklariert sind, verwenden Sie den **ZIP herunterladen**-Button, um die neuste Version als ZIP herunterzuladen:
zh_tw: 在 GitHub 上，如果外掛程式沒有宣告任何 *Tag*，請使用 **Download ZIP** 按鈕下載最新版本的 ZIP：

source: Extract the ZIP archive and move the ``addons/`` folder it contains into your project folder. If your project already contains an ``addons/`` folder, move the plugin's ``addons/`` folder into your project folder to merge the new folder contents with the existing one. Your file manager may ask you whether to write into the folder; answer **Yes**. No files will be overwritten in the process.
de: Entpacken Sie das ZIP-Archiv und verschieben Sie den darin enthaltenen Ordner ``addons/`` in Ihren Projektordner. Wenn Ihr Projekt bereits einen ``addons/``-Ordner enthält, verschieben Sie den ``addons/``-Ordner des Plugins in Ihren Projektordner, um den Inhalt des neuen Ordners mit dem bestehenden zusammenzuführen. Ihr Dateimanager fragt Sie möglicherweise, ob Sie in den Ordner schreiben wollen; antworten Sie mit **Ja**. Bei diesem Vorgang werden keine Dateien überschrieben.
zh_tw: 解壓 ZIP 壓縮包，並將其包含的 ``addons/`` 資料夾移動到你的專案檔案夾中。如果您的專案已經包含了一個 ``addons/`` 資料夾，請將外掛程式的 ``addons/`` 資料夾移到您的專案檔案夾中，將新的資料夾內容與現有的資料夾合併。你的檔案管理員可能會問你是否要寫入該資料夾，回答**是**。在這個過程中，不會有任何檔被覆蓋。

source: Enabling a plugin
de: Aktivieren eines Plugins
zh_tw: 啟用外掛程式

source: To enable the freshly installed plugin, open **Project > Project Settings** at the top of the editor then go the **Plugins** tab. If the plugin was packaged correctly, you should see it in the list of plugins. Click on the **Enable** checkbox to enable the plugin.
de: Um das frisch installierte Plugin zu aktivieren, öffnen Sie **Projekt > Projekteinstellungen** am oberen Rand des Editors und gehen Sie dann auf das **Plugins**-Tab. Wenn das Plugin korrekt gepackt wurde, sollten Sie es in der Liste der Plugins sehen. Klicken Sie auf die Checkbox **Aktivieren**, um das Plugin zu aktivieren.
zh_tw: 要啟用新安裝的外掛程式，請打開編輯器頂部的**專案 > 專案設定**，然後進入**外掛程式**標籤。如果外掛程式被正確安裝，你應該在外掛程式列表中看到它。點擊灰色的**未啟用**文字，選擇**啟用**來啟用該外掛程式。**啟用**字樣將顯示為綠色，以確認該外掛程式已啟用。

source: You can use the plugin immediately after enabling it; there's no need to restart the editor. Likewise, disabling a plugin can be done without having to restart the editor.
de: Sie können das Plugin sofort nach der Aktivierung verwenden; ein Neustart des Editors ist nicht erforderlich. Ebenso kann ein Plugin deaktiviert werden, ohne dass der Editor neu gestartet werden muss.
zh_tw: 啟用外掛程式後，你可以立即使用它，不需要重新開機編輯器。同樣，禁用一個外掛程式也可以不用重新啟動編輯器。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
