Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/making_main_screen_plugins.po
Languages: de, zh_tw

source: Making main screen plugins
de: Erstellen von Plugins für den Hauptbildschirm
zh_tw: 制作主螢幕外掛程式

source: What this tutorial covers
de: Was dieses Tutorial abdeckt
zh_tw: 本教學涵蓋的內容

source: Main screen plugins allow you to create new UIs in the central part of the editor, which appear next to the "2D", "3D", "Script", and "AssetLib" buttons. Such editor plugins are referred as "Main screen plugins".
de: Mit Hauptbildschirm-Plugins können Sie neue Benutzeroberflächen im zentralen Teil des Editors erstellen, die neben den Buttons "2D", "3D", "Skript" und "AssetLib" erscheinen. Solche Editor-Plugins werden als "Hauptbildschirm-Plugins" bezeichnet.
zh_tw: 正如在 :ref:`doc_making_plugins` 頁面中所看到的, 製作一個擴充編輯器的基本外掛程式是相當容易的. 主螢幕外掛程式允許你在編輯器的中心部分建立新的使用者介面, 它們出現在 "2D" , "3D" , "腳本" 和 "AssetLib" 按鈕旁邊. 這種編輯器外掛程式被稱為 "主場景外掛程式".

source: This tutorial leads you through the creation of a basic main screen plugin. For the sake of simplicity, our main screen plugin will contain a single button that prints text to the console.
de: Dieses Tutorial führt Sie durch die Erstellung eines grundlegenden Plugins für den Hauptbildschirm. Der Einfachheit halber enthält unser Hauptbildschirm-Plugin eine einzige Schaltfläche, mit der Text auf die Konsole gedruckt wird.
zh_tw: 本教學將帶領你建立一個基本的主場景外掛程式. 為了簡單起見, 主場景外掛程式將包含一個列印文字到控制台的單個按鈕.

source: Initializing the plugin
de: Initialisierung des Plugins
zh_tw: 初始化外掛程式

source: First create a new plugin from the Plugins menu. For this tutorial, we'll put it in a folder called ``main_screen``, but you can use any name you'd like.
de: Erstellen Sie zunächst ein neues Plugin aus dem Menü Plugins. Für dieses Tutorial legen wir es in einem Ordner mit dem Namen ``main_screen`` ab, aber Sie können jeden beliebigen Namen verwenden, den Sie möchten.
zh_tw: 首先從Plugins功能表中建立一個新外掛程式. 在本教學中, 我們將把它放在一個名為 ``main_screen`` 的資料夾中, 但你可以使用任何你喜歡的名字.

source: The plugin script will come with ``_enter_tree()`` and ``_exit_tree()`` methods, but for a main screen plugin we need to add a few extra methods. Add five extra methods such that the script looks like this:
de: Das Plugin-Skript wird mit den Methoden ``_enter_tree()`` und ``_exit_tree()`` bereitgestellt, aber für ein Hauptbildschirm-Plugin müssen wir ein paar zusätzliche Methoden hinzufügen. Fügen Sie fünf zusätzliche Methoden hinzu, so dass das Skript wie folgt aussieht:
zh_tw: 外掛程式腳本會自帶 ``_enter_tree()`` 和 ``_exit_tree()`` 方法, 但對於主場景外掛程式來說, 我們需要新增一些額外的方法. 增加五個額外的方法, 腳本就像這樣:

source: The important part in this script is the ``_has_main_screen()`` function, which is overloaded so it returns ``true``. This function is automatically called by the editor on plugin activation, to tell it that this plugin adds a new center view to the editor. For now, we'll leave this script as-is and we'll come back to it later.
de: Der wichtigste Teil in diesem Skript ist die Funktion ``_has_main_screen()``, die überladen ist, so dass sie ``true`` zurückgibt. Diese Funktion wird automatisch vom Editor bei der Aktivierung des Plugins aufgerufen, um ihm mitzuteilen, dass dieses Plugin eine neue zentrale Ansicht zum Editor hinzufügt. Für den Moment belassen wir dieses Skript so wie es ist und kommen später darauf zurück.
zh_tw: 這個腳本中重要的部分是 ``has_main_screen()`` 函式, 這個函式是重載的, 所以它返回 ``true`` . 這個函式會在外掛程式啟動時被編輯器自動呼叫, 告訴它這個外掛程式給編輯器增加了一個新的中心視圖. 現在, 我們暫且把這個腳本保持原樣, 以後再來討論它.

source: Main screen scene
de: Hauptbildschirm-Szene
zh_tw: 主畫面場景

source: Create a new scene with a root node derived from ``Control`` (for this example plugin, we'll make the root node a ``CenterContainer``). Select this root node, and in the viewport, click the ``Layout`` menu and select ``Full Rect``. You also need to enable the ``Expand`` vertical size flag in the inspector. The panel now uses all the space available in the main viewport.
de: Erstellen Sie eine neue Szene mit einem Root Node, das von ``Control`` abgeleitet ist (für dieses Beispiel-Plugin werden wir den Root-Node zu einem ``CenterContainer`` machen). Wählen Sie diesen Root-Node aus, klicken Sie im Viewport auf das Menü ``Layout`` und wählen Sie ``Full Rect``. Man muss auch das ``Expand``-Flag für die vertikale Größe im Inspektor aktivieren. Das Panel nutzt nun den gesamten verfügbaren Platz im Hauptfenster.
zh_tw: 建立一個新的場景，其根節點由 ``Control`` 衍生而來（在這個範例外掛程式中，我們將使根節點為 ``CenterContainer``）。選擇這個根節點，在視口中，點擊 ``佈局`` 功能表，選擇 ``整個矩形``。你還需要在屬性面板中啟用 ``Expand`` 垂直尺寸旗標。面板現在使用主視口中的所有可用空間。

source: Next, let's add a button to our example main screen plugin. Add a ``Button`` node, and set the text to "Print Hello" or similar. Add a script to the button like this:
de: Als nächstes fügen wir einen Button zu unserem Beispiel-Hauptbildschirm-Plugin hinzu. Fügen Sie einen ``Button``-Node hinzu, und setzen Sie den Text auf "Print Hello" oder ähnlich. Fügen Sie dem Button ein Skript wie dieses hinzu:
zh_tw: 接下來, 讓我們為我們的主螢幕外掛程式範例新增一個按鈕. 新增一個 ``Button`` 節點, 並將文字設定為 "Print Hello "或類似的內容. 給按鈕新增一個腳本, 像這樣:

source: Then connect the "pressed" signal to itself. If you need help with signals, see the :ref:`doc_signals` article.
de: Verbinden Sie dann das "pressed"-Signal mit sich selbst. Wenn Sie Hilfe zu Signalen benötigen, lesen Sie den Artikel :ref:`doc_signals`.
zh_tw: 然後將 "按下" 訊號連接到自身. 如果你需要訊號方面的説明, 請參考 :ref:`doc_signals` 一文.

source: We are done with the main screen panel. Save the scene as ``main_panel.tscn``.
de: Wir sind mit dem Hauptbildschirm fertig. Speichern Sie die Szene als ``main_panel.tscn``.
zh_tw: 我們完成了主螢幕面板. 將場景保存為 ``main_panel.tscn``.

source: Update the plugin script
de: Aktualisieren des Plugin-Skripts
zh_tw: 更新外掛程式腳本

source: We need to update the ``main_screen_plugin.gd`` script so the plugin instances our main panel scene and places it where it needs to be. Here is the full plugin script:
de: Wir müssen das Skript ``main_screen_plugin.gd`` aktualisieren, damit das Plugin unsere Hauptpanel-Szene instanziiert und dort platziert, wo sie sein soll. Hier ist das vollständige Plugin-Skript:
zh_tw: 我們需要更新 ``main_screen_plugin.gd`` 腳本，讓外掛程式產生實體我們的主面板場景，並將其放置在需要的位置。這是完整的外掛程式腳本：

source: A couple of specific lines were added. ``MainPanel`` is a constant that holds a reference to the scene, and we instance it into `main_panel_instance`.
de: Ein paar spezielle Zeilen wurden hinzugefügt. ``MainPanel`` ist eine Konstante, die eine Referenz auf die Szene hält, und wir instanzieren sie in `main_panel_instance`.
zh_tw: 增加了幾行具體的內容. ``MainPanel`` 是一個常數, 持有對場景的引用, 我們將其產生實體為 `main_panel_instance`.

source: The ``_enter_tree()`` function is called before ``_ready()``. This is where we instance the main panel scene, and add them as children of specific parts of the editor. We use ``EditorInterface.get_editor_main_screen()`` to obtain the main editor screen and add our main panel instance as a child to it. We call the ``_make_visible(false)`` function to hide the main panel so it doesn't compete for space when first activating the plugin.
de: Die Funktion ``_enter_tree()`` wird vor ``_ready()`` aufgerufen. Dies ist der Ort, an dem wir die Hauptpanel-Szene instanziieren und sie als Child-Elementen von bestimmten Teilen des Editors hinzufügen. Wir benutzen ``EditorInterface.get_editor_main_screen()``, um den Hauptbildschirm des Editors zu erhalten und fügen unsere Hauptpanel-Instanz als Child zu diesem hinzu. Wir rufen die Funktion ``_make_visible(false)`` auf, um das Hauptpanel auszublenden, damit es nicht um den Platz konkurriert, wenn das Plugin zum ersten Mal aktiviert wird.

source: The ``_exit_tree()`` function is called when the plugin is deactivated. If the main screen still exists, we call ``queue_free()`` to free the instance and remove it from memory.
de: Die Funktion ``_exit_tree()`` wird aufgerufen, wenn das Plugin deaktiviert wird. Wenn der Hauptbildschirm noch existiert, rufen wir ``queue_free()`` auf, um die Instanz freizugeben und aus dem Speicher zu entfernen.
zh_tw: 當外掛程式停用時, 呼叫 ``_exit_tree()`` 函式. 如果主螢幕仍然存在, 我們呼叫 ``queue_free()`` 來釋放實例, 並將其從記憶體中移除.

source: The ``_make_visible()`` function is overridden to hide or show the main panel as needed. This function is automatically called by the editor when the user clicks on the main viewport buttons at the top of the editor.
de: Die Funktion ``_make_visible()`` wird überschrieben, um das Hauptfenster je nach Bedarf ein- oder auszublenden. Diese Funktion wird automatisch vom Editor aufgerufen, wenn der Benutzer auf den Button des Hauptfensters am oberen Rand des Editors klickt.
zh_tw: ``make_visible()`` 函式被重寫, 以根據需要隱藏或顯示主面板. 當使用者點擊編輯器頂部的主視口按鈕時, 編輯器會自動呼叫該函式.

source: The ``_get_plugin_name()`` and ``_get_plugin_icon()`` functions control the displayed name and icon for the plugin's main viewport button.
de: Die Funktionen ``_get_plugin_name()`` und ``_get_plugin_icon()`` steuern den angezeigten Namen und das Icon für den Haupt-Viewport-Button des Plugins.
zh_tw: ``get_plugin_name()`` 和 ``get_plugin_icon()`` 函式控制外掛程式主視口按鈕的顯示名稱和圖示.

source: Another function you can add is the ``handles()`` function, which allows you to handle a node type, automatically focusing the main screen when the type is selected. This is similar to how clicking on a 3D node will automatically switch to the 3D viewport.
de: Eine weitere Funktion, die Sie hinzufügen können, ist die Funktion ``handles()``, die es Ihnen ermöglicht, einen Nodetyp zu behandeln, indem automatisch der Hauptbildschirm fokussiert wird, wenn der Typ ausgewählt wird. Dies ist ähnlich wie beim Anklicken eines 3D-Nodes automatisch in das 3D-Ansichtsfenster gewechselt wird.
zh_tw: 另一個你可以新增的函式是 ``handles()`` 函式, 它允許你處理一個節點型別, 當選擇該型別時自動聚焦主螢幕. 這類似於點擊一個3D節點會自動切換到3D視口.

source: Try the plugin
de: Testen des Plugins
zh_tw: 試試這個外掛程式

source: Activate the plugin in the Project Settings. You'll observe a new button next to 2D, 3D, Script above the main viewport. Clicking it will take you to your new main screen plugin, and the button in the middle will print text.
de: Aktivieren Sie das Plugin in den Projekteinstellungen. Sie werden einen neuen Button neben 2D, 3D, Skript oberhalb des Hauptfensters sehen. Wenn Sie darauf klicken, gelangen Sie zu Ihrem neuen Hauptbildschirm-Plugin, und mit dem Button in der Mitte können Sie Text ausgeben.
zh_tw: 在專案設定中啟動外掛程式. 你會觀察到主視口上方的2D, 3D, 腳本旁邊有一個新的按鈕. 點擊它將帶你進入新的主螢幕外掛程式, 中間的按鈕將列印文字.

source: If you would like to try a finished version of this plugin, check out the plugin demos here: https://github.com/godotengine/godot-demo-projects/tree/master/plugins
de: Wenn Sie eine fertige Version dieses Plugins ausprobieren möchten, sehen Sie sich die Plugin-Demos hier an: https://github.com/godotengine/godot-demo-projects/tree/master/plugins
zh_tw: 如果你想試試這個外掛程式的完成版, 請在這裡查看外掛程式演示:https://github.com/godotengine/godot-demo-projects/tree/master/plugins

source: If you would like to see a more complete example of what main screen plugins are capable of, check out the 2.5D demo projects here: https://github.com/godotengine/godot-demo-projects/tree/master/misc/2.5d
de: Wenn Sie ein vollständigeres Beispiel für die Funktionen von Hauptbildschirm-Plugins sehen möchten, sehen Sie sich die 2.5D Demo-Projekte hier an: https://github.com/godotengine/godot-demo-projects/tree/master/misc/ 2.5d
zh_tw: 如果你想看一個更完整的例子, 瞭解主螢幕外掛程式的能力, 請看這裡的2.5D演示專案:https://github.com/godotengine/godot-demo-projects/tree/master/misc/2.5d

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
