Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/visual_shader_plugins.po
Languages: de, zh_tw

source: Visual Shader plugins
zh_tw: 視覺化著色器外掛程式

source: Visual Shader plugins are used to create custom :ref:`class_VisualShader` nodes in GDScript.
de: Visual Shader-Plugins werden verwendet, um benutzerdefinierte :ref:`class_VisualShader`-Nodes in GDScript zu erstellen.
zh_tw: Visual Shader外掛程式用於在GDScript中建立自訂的 :ref:`class_VisualShader` 節點.

source: The creation process is different from usual editor plugins. You do not need to create a ``plugin.cfg`` file to register it; instead, create and save a script file and it will be ready to use, provided the custom node is registered with ``class_name``.
de: Der Erstellungsprozess ist anders als bei den üblichen Editor-Plugins. Sie brauchen keine ``plugin.cfg``-Datei zu erstellen, um es zu registrieren; stattdessen erstellen und speichern Sie eine Skriptdatei und es ist bereit zur Verwendung, vorausgesetzt der benutzerdefinierte Node ist mit ``class_name`` registriert.
zh_tw: 建立過程與一般的編輯器外掛程式不同. 你不需要建立一個 ``plugin.cfg`` 檔來註冊, 而是建立並保存一個指令檔, 只要用 ``class_name`` 註冊了自訂節點, 就可以使用了.

source: This short tutorial will explain how to make a Perlin-3D noise node (original code from this `GPU noise shaders plugin <https://github.com/curly-brace/Godot-3.0-Noise-Shaders/blob/master/assets/gpu_noise_shaders/classic_perlin3d.tres>`_.
de: In diesem kurzen Tutorial wird erklärt, wie man einen Perlin-3D-Noise-Node erstellt (Originalcode aus diesem `GPU Noise Shaders-Plugin <https://github.com/curly-brace/Godot-3.0-Noise-Shaders/blob/master/assets/gpu_noise_shaders/classic_perlin3d.tres>`_.
zh_tw: 本篇短教學將講解如何製作 Perlin-3D 雜訊節點（原程式碼來自這個 `GPU 雜訊著色器外掛程式 <https://github.com/curly-brace/Godot-3.0-Noise-Shaders/blob/master/assets/gpu_noise_shaders/classic_perlin3d.tres>`_。

source: Create a Sprite2D and assign a :ref:`class_ShaderMaterial` to its material slot:
de: Erstellen Sie ein Sprite2D und weisen Sie seinem Material-Slot ein :ref:`class_ShaderMaterial` zu:
zh_tw: 建立一個 Sprite2D 並為其材質插槽分配一個 :ref:`class_ShaderMaterial`：

source: Assign :ref:`class_VisualShader` to the shader slot of the material:
de: Weisen Sie :ref:`class_VisualShader` dem Shader-Slot des Materials zu:
zh_tw: 將 :ref:`class_VisualShader` 給著色器材質的插槽：

source: Don't forget to change its mode to "CanvasItem" (if you are using a Sprite2D):
de: Vergessen Sie nicht, den Modus auf "CanvasItem" zu ändern (wenn Sie ein Sprite2D verwenden):
zh_tw: 不要忘記將其模式改為“CanvasItem”（如果你使用的是 Sprite2D）：

source: Create a script which derives from :ref:`class_VisualShaderNodeCustom`. This is all you need to initialize your plugin.
de: Erstellen Sie ein Skript, das sich von :ref:`class_VisualShaderNodeCustom` ableitet. Dies ist alles, was Sie brauchen, um Ihr Plugin zu initialisieren.
zh_tw: 建立一個從 :ref:`class_VisualShaderNodeCustom` 衍生的腳本. 這是你初始化你的外掛程式所需要的全部內容.

source: Save it and open the Visual Shader. You should see your new node type within the member's dialog under the Addons category (if you can't see your new node, try restarting the editor):
de: Speichern Sie ihn und öffnen Sie den Visual Shader. Sie sollten Ihren neuen Node-Typ im Member-Dialog unter der Kategorie Addons sehen (wenn Sie Ihren neuen Node nicht sehen können, versuchen Sie, den Editor neu zu starten):
zh_tw: 保存它並打開Visual Shader. 你應該可以在成員對話方塊中看到你的新節點型別(如果你看不到你的新節點, 請嘗試重新啟動編輯器):

source: Place it on a graph and connect the required ports:
de: Platzieren Sie ihn in einem Diagramm und verbinden Sie die erforderlichen Anschlüsse:
zh_tw: 放到一個圖並連接所需的埠:

source: That is everything you need to do, as you can see it is easy to create your own custom VisualShader nodes!
de: Das ist alles, was Sie tun müssen. Wie Sie sehen können, ist es einfach, Ihre eigenen VisualShader-Nodes zu erstellen!
zh_tw: 這就是你需要做的所有事情, 正如你所看到的那樣, 建立你自己的自訂VisualShader節點很容易!

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
