Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/controllers_gamepads_joysticks.po
Languages: de, pt_br, zh_tw

source: Controllers, gamepads, and joysticks
de: Controller, Gamepads und Joysticks
pt_br: Controles, gamepads e joysticks
zh_tw: 控制器、手柄和搖桿

source: Godot supports hundreds of controller models thanks to the community-sourced `SDL game controller database <https://github.com/gabomdq/SDL_GameControllerDB>`__.
de: Godot unterstützt Hunderte von Controller-Modellen dank der von der Community bereitgestellten `SDL Game Controller Database <https://github.com/gabomdq/SDL_GameControllerDB>`__.
pt_br: Godot suporta centenas de modelos de controles graças ao `banco de dados de controladores de jogos SDL de origem comunitária <https://github.com/gabomdq/SDL_GameControllerDB>`__.
zh_tw: Godot支援數百種控制器模型，這要歸功於社區提供的 `SDL遊戲控制器資料庫 <https://github.com/gabomdq/SDL_GameControllerDB>`__ 。

source: Controllers are supported on Windows, macOS, Linux, Android, iOS, and HTML5.
de: Controller werden auf Windows, macOS, Linux, Android, iOS und HTML5 unterstützt.
pt_br: Os controles são compatíveis com Windows, macOS, Linux, Android, iOS e HTML5.
zh_tw: 控制器支援Windows、macOS、Linux、Android、iOS和HTML5。

source: Note that more specialized devices such as steering wheels, rudder pedals and `HOTAS <https://en.wikipedia.org/wiki/HOTAS>`__ are less tested and may not always work as expected. Overriding force feedback for those devices is also not implemented yet. If you have access to one of those devices, don't hesitate to `report bugs on GitHub <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#reporting-bugs>`__.
de: Beachten Sie, dass speziellere Geräte wie Lenkräder, Ruderpedale und `HOTAS <https://en.wikipedia.org/wiki/HOTAS>`__ weniger getestet sind und möglicherweise nicht immer wie erwartet funktionieren. Das Aufheben des Force-Feedbacks für diese Geräte ist ebenfalls noch nicht implementiert. Wenn Sie Zugang zu einem dieser Geräte haben, zögern Sie nicht, `Bugs auf GitHub <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#reporting-bugs>`__ zu melden.
pt_br: Observe que dispositivos mais especializados, como volantes, pedais de leme e `HOTAS <https://en.wikipedia.org/wiki/HOTAS>`__ são menos testados e nem sempre funcionam como esperado. Substituir o feedback de força para esses dispositivos também não foi implementado ainda. Se você tiver acesso a um desses dispositivos, não hesite em `reportar bugs no GitHub <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#reporting-bugs>`__.
zh_tw: 請注意，諸如方向盤、方向盤踏板和 `HOTAS <https://en.wikipedia.org/wiki/HOTAS>`__ 等更專業的裝置測試較少，可能並不總是按照預期工作。目前尚未實作在這些裝置上的力回饋覆蓋。如果你有機會使用這些裝置，請不要猶豫，`在 GitHub <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#reporting-bugs>`__ 上報告錯誤。

source: In this guide, you will learn:
de: In dieser Anleitung lernen Sie:
pt_br: Neste guia, você aprenderá:
zh_tw: 在本指南中，我們將學到：

source: **How to write your input logic to support both keyboard and controller inputs.**
de: **Wie Sie Ihre Eingabelogik schreiben, um sowohl Tastatur- als auch Controllereingaben zu unterstützen.**
pt_br: **Como escrever sua lógica de entrada para suportar as entradas de teclado e de controles.**
zh_tw: **如何編寫你的輸入邏輯，從而支援鍵盤和控制器輸入。**

source: **How controllers can behave differently from keyboard/mouse input.**
de: **Wie sich Controller anders verhalten können als Tastatur/Maus-Eingaben**
pt_br: **Como os controles podem se comportar de maneira diferente da entrada do teclado/mouse.**
zh_tw: **控制器的行為如何與鍵盤/滑鼠輸入不同。**

source: **Troubleshooting issues with controllers in Godot.**
de: **Probleme mit Controllern in Godot beheben.**
pt_br: **Solução de problemas com controles no Godot.**
zh_tw: **解決 Godot 中控制器的問題。**

source: Supporting universal input
de: Unterstützung der Universaleingabe
pt_br: Suportando entrada universal
zh_tw: 為通用 Windows 平台(UWP) 匯出

source: Thanks to Godot's input action system, Godot makes it possible to support both keyboard and controller input without having to write separate code paths. Instead of hardcoding keys or controller buttons in your scripts, you should create *input actions* in the Project Settings which will then refer to specified key and controller inputs.
de: Dank des Godot-Eingabeaktionssystems ist es möglich, sowohl Tastatur- als auch Controllereingaben zu unterstützen, ohne separate Codepfade schreiben zu müssen. Anstatt Tasten oder Controllertasten in Ihren Skripten fest zu kodieren, sollten Sie in den Projekteinstellungen *Eingabeaktionen* erstellen, die sich dann auf bestimmte Tasten- und Controllereingaben beziehen.
pt_br: Graças ao sistema de ação de entrada do Godot, o Godot torna possível suportar a entrada do teclado e do controlador sem ter que escrever caminhos de código separados. Em vez de codificar teclas ou botões do controlador em seus scripts, você deve criar *ações de entrada* nas configurações do projeto, que se referirão às entradas de chave e controle especificadas.
zh_tw: 得益於 Godot 的輸入動作系統，Godot 可以同時支援鍵盤和控制器輸入，而不需要編寫單獨的程式碼路徑。你不應該在腳本中對控制器的按鍵進行硬編碼，應該在專案設定中建立*輸入動作*，這些動作引用按鍵和控制器輸入。

source: Input actions are explained in detail on the :ref:`doc_inputevent` page.
de: Eingabeaktionen werden auf der Seite :ref:`doc_inputevent` ausführlich erklärt.
pt_br: As ações de entrada são explicadas em detalhes na página :ref:`doc_inputevent`.
zh_tw: 輸入動作在 :ref:`doc_inputevent` 頁面上有詳細解釋。

source: Unlike keyboard input, supporting both mouse and controller input for an action (such as looking around in a first-person game) will require different code paths since these have to be handled separately.
de: Im Gegensatz zur Tastatureingabe erfordert die Unterstützung von Maus- und Controllereingaben für eine Aktion (z. B. das Umsehen in einem Ego-Spiel) unterschiedliche Codepfade, da diese getrennt behandelt werden müssen.
pt_br: Ao contrário da entrada do teclado, o suporte à entrada do mouse e do controle para uma ação (como olhar ao redor em um jogo em primeira pessoa) exigirá caminhos de código diferentes, pois devem ser tratados separadamente.
zh_tw: 與鍵盤輸入不同，支援滑鼠和控制器輸入的動作將需要不同的程式碼路徑，例如在第一人稱遊戲中四處查看，因為這些必須被分開處理。

source: Which Input singleton method should I use?
de: Welche Input-Singleton-Methode sollte ich verwenden?
pt_br: Qual método singleton de entrada devo usar?
zh_tw: GDScript是什麼？為什麼我要用它？

source: There are 3 ways to get input in an analog-aware way:
de: Es gibt 3 Möglichkeiten, analoge Eingaben zu erhalten:
pt_br: Existem 3 maneiras de obter entrada com reconhecimento analógico:
zh_tw: 有3種方式可以以類比感知的方式獲得輸入:

source: When you have two axes (such as joystick or WASD movement) and want both axes to behave as a single input, use ``Input.get_vector()``:
de: Wenn Sie zwei Achsen haben (z.B. Joystick- oder WASD-Bewegung) und beide Achsen sich wie eine einzige Eingabe verhalten sollen, verwenden Sie ``Input.get_vector()``:
pt_br: Quando você tem dois eixos (como joystick ou movimento WASD) e deseja que ambos os eixos se comportem como uma única entrada, use ``Input.get_vector()``:
zh_tw: 當你有兩個軸，如操縱桿或WASD運動，並希望兩個軸都表現為單一輸入時，使用 ``Input.get_vector()`` :

source: When you have one axis that can go both ways (such as a throttle on a flight stick), or when you want to handle separate axes individually, use ``Input.get_axis()``:
de: Wenn Sie eine Achse haben, die in beide Richtungen gehen kann (wie z.B. ein Gashebel an einem Steuerknüppel), oder wenn Sie separate Achsen einzeln behandeln wollen, verwenden Sie ``Input.get_axis()``:
pt_br: Quando você tem um eixo que pode funcionar em ambos os sentidos (como um acelerador em um stick de vôo), ou quando você deseja manipular eixos separados individualmente, use ``Input.get_axis()``:
zh_tw: 當你有一個軸可以雙向移動時，比如飛行操縱桿上的油門，或者你想單獨處理不同的軸時，使用 ``Input.get_axis()`` :

source: For other types of analog input, such as handling a trigger or handling one direction at a time, use ``Input.get_action_strength()``:
de: Für andere Arten von analogen Eingängen, wie z.B. die Verarbeitung eines Triggers oder die gleichzeitige Verarbeitung einer Richtung, verwenden Sie ``Input.get_action_strength()``:
pt_br: Para outros tipos de entrada analógica, como manipulação de um gatilho ou manipulação de uma direção por vez, use ``Input.get_action_strength()``:
zh_tw: 對於其他型別的模擬輸入，例如處理一個觸發器或一次處理一個方向，使用 ``Input.get_action_strength()`` :

source: For non-analog digital/boolean input (only "pressed" or "not pressed" values), such as controller buttons, mouse buttons or keyboard keys, use ``Input.is_action_pressed()``:
de: Für nicht-analoge digitale/boolean Eingaben (nur "gedrückt" oder "nicht gedrückt"-Werte), wie z.B. Controller-Buttons, Maustasten oder Tastaturtasten, verwenden Sie ``Input.is_action_pressed()``:
pt_br: Para entrada digital/booleana não analógica (apenas valores "pressionado" ou "não pressionado"), como botões do controle, botões do mouse ou teclas do teclado, use ``Input.is_action_pressed()``:
zh_tw: 對於非類比數位/布林輸入（只有 "按下 " 或 "未按下 " 的值），如控制器按鈕、滑鼠按鈕或鍵盤按鍵，使用 ``Input.is_action_pressed()`` :

source: If you need to know whether an input was *just* pressed in the previous frame, use ``Input.is_action_just_pressed()`` instead of ``Input.is_action_pressed()``. Unlike ``Input.is_action_pressed()`` which returns ``true`` as long as the input is held, ``Input.is_action_just_pressed()`` will only return ``true`` for one frame after the button has been pressed.
de: Wenn Sie wissen wollen, ob eine Eingabe im vorherigen Frame *gerade eben* gedrückt wurde, benutzen Sie ``Input.is_action_just_pressed()`` anstelle von ``Input.is_action_pressed()``. Im Gegensatz zu ``Input.is_action_pressed()``, das ``true`` zurückgibt, solange die Eingabe gehalten wird, gibt ``Input.is_action_just_pressed()`` nur ``true`` für einen Frame zurück, nachdem die Taste gedrückt wurde.
zh_tw: 如果您需要知道某個輸入是否在前一影格中「剛剛」被按下，請使用「Input.is_action_just_pressed()」而不是「Input.is_action_pressed()」。與只要保持輸入就回傳 true 的「Input.is_action_pressed()」不同，「Input.is_action_just_pressed()」只會在按鈕按下後一影格返回「true」按下。

source: In Godot versions before 3.4, such as 3.3, ``Input.get_vector()`` and ``Input.get_axis()`` aren't available. Only ``Input.get_action_strength()`` and ``Input.is_action_pressed()`` are available in Godot 3.3.
de: In Godot-Versionen vor 3.4, wie 3.3, sind ``Input.get_vector()`` und ``Input.get_axis()`` nicht verfügbar. Nur ``Input.get_action_strength()`` und ``Input.is_action_pressed()`` sind in Godot 3.3 verfügbar.
pt_br: Nas versões do Godot anteriores a 3.4, como 3.3, ``Input.get_vector()`` e ``Input.get_axis()`` não estão disponíveis. Somente ``Input.get_action_strength()`` e ``Input.is_action_pressed()`` estão disponíveis no Godot 3.3.
zh_tw: 在3.4之前的Godot版本，如3.3， ``Input.get_vector()`` 和 ``Input.get_axis()`` 不可用。只有 ``Input.get_action_strength()`` 和 ``Input.is_action_pressed()`` 在Godot 3.3中可用。

source: Vibration
de: Vibrationen
zh_tw: 減法

source: Vibration (also called *haptic feedback*) can be used to enhance the feel of a game. For instance, in a racing game, you can convey the surface the car is currently driving on through vibration, or create a sudden vibration on a crash.
de: Vibrationen (auch *haptisches Feedback* genannt) können verwendet werden, um das Gefühl eines Spiels zu verbessern. In einem Rennspiel können Sie zum Beispiel die Art der Oberfläche, auf der das Auto gerade fährt, durch Vibration vermitteln oder bei einem Unfall eine plötzliche Vibration erzeugen.
zh_tw: 振動（也稱為*觸覺回饋*）可用於增強遊戲的感覺。例如，在賽車遊戲中，您可以透過振動傳達汽車目前行駛的表面，或在碰撞時產生突然的振動。

source: Use the Input singleton's :ref:`start_joy_vibration<class_Input_method_start_joy_vibration>` method to start vibrating a gamepad. Use :ref:`stop_joy_vibration<class_Input_method_stop_joy_vibration>` to stop vibration early (useful if no duration was specified when starting).
de: Verwenden Sie die Methode :ref:`start_joy_vibration<class_Input_method_start_joy_vibration>` des Input-Singletons, um die Vibration eines Gamepads zu starten. Verwenden Sie :ref:`stop_joy_vibration<class_Input_method_stop_joy_vibration>`, um die Vibration vorzeitig zu beenden (nützlich, wenn beim Start keine Dauer angegeben wurde).
zh_tw: 使用輸入單例的 start_joy_vibration<class_Input_method_start_joy_vibration>` 方法開始振動遊戲手把。使用 stop_joy_vibration<class_Input_method_stop_joy_vibration>` 提前停止振動（如果啟動時未指定持續時間，則很有用）。

source: On mobile devices, you can also use :ref:`vibrate_handheld<class_Input_method_vibrate_handheld>` to vibrate the device itself (independently from the gamepad). On Android, this requires the ``VIBRATE`` permission to be enabled in the Android export preset before exporting the project.
de: Auf mobilen Geräten können Sie auch :ref:`vibrate_handheld<class_Input_method_vibrate_handheld>` verwenden, um das Gerät selbst vibrieren zu lassen (unabhängig vom Gamepad). Unter Android muss dazu die Berechtigung ``VIBRATE`` in der Android-Exportvoreinstellung aktiviert werden, bevor das Projekt exportiert wird.
zh_tw: 在行動裝置上，您也可以使用 vibrate_handheld<class_Input_method_vibrate_handheld> 來振動裝置本身（獨立於遊戲手把）。在 Android 上，這需要在匯出專案之前在 Android 匯出預設中啟用「VIBRATE」權限。

source: Vibration can be uncomfortable for certain players. Make sure to provide an in-game slider to disable vibration or reduce its intensity.
de: Vibrationen können für manche Spieler unangenehm sein. Stellen Sie sicher, dass es einen Schieberegler im Spiel gibt, um die Vibration zu deaktivieren oder ihre Intensität zu verringern.
zh_tw: 振動可能會讓某些玩家感到不舒服。確保提供遊戲內滑桿來停用振動或降低其強度。

source: Differences between keyboard/mouse and controller input
de: Unterschiede zwischen Tastatur/Maus und Controller-Eingabe
pt_br: Diferenças entre teclado/mouse e entrada do controle
zh_tw: 鍵盤/滑鼠和控制器輸入之間的差異

source: If you're used to handling keyboard and mouse input, you may be surprised by how controllers handle specific situations.
de: Wenn Sie es gewohnt sind, mit Tastatur- und Mauseingaben umzugehen, werden Sie vielleicht überrascht sein, wie Controller mit bestimmten Situationen umgehen.
pt_br: Se você está acostumado a lidar com entrada de teclado e mouse, pode se surpreender com a forma como os controles lidam com situações específicas.
zh_tw: 如果您習慣於處理鍵盤和滑鼠輸入，可能會對控制器處理特定情況的方式感到驚訝。

source: Dead zone
de: Totzone
pt_br: Zona morta
zh_tw: 死區

source: Unlike keyboards and mice, controllers offer axes with *analog* inputs. The upside of analog inputs is that they offer additional flexibility for actions. Unlike digital inputs which can only provide strengths of ``0.0`` and ``1.0``, an analog input can provide *any* strength between ``0.0`` and ``1.0``. The downside is that without a deadzone system, an analog axis' strength will never be equal to ``0.0`` due to how the controller is physically built. Instead, it will linger at a low value such as ``0.062``. This phenomenon is known as *drifting* and can be more noticeable on old or faulty controllers.
de: Im Gegensatz zu Tastaturen und Mäusen verfügen Controller über Achsen mit *analogem* Eingang. Der Vorteil von Analogeingängen ist, dass sie zusätzliche Flexibilität für Aktionen bieten. Im Gegensatz zu digitalen Eingängen, die nur die Stärken ``0.0`` und ``1.0`` liefern können, kann ein analoger Eingang *jede* Stärke zwischen ``0.0`` und ``1.0`` liefern. Der Nachteil ist, dass ohne ein Totzonen-System die Stärke einer analogen Achse niemals gleich ``0.0`` sein wird, aufgrund der Art, wie der Controller physikalisch aufgebaut ist. Stattdessen wird sie bei einem niedrigen Wert wie ``0.062`` verweilen. Dieses Phänomen ist als *Drifting* bekannt und kann bei alten oder defekten Controllern stärker auffallen.
pt_br: Ao contrário dos teclados e mouses, os controles oferecem eixos com entradas *analógicas*. A vantagem das entradas analógicas é que elas oferecem flexibilidade adicional para ações. Ao contrário das entradas digitais que só podem fornecer intensidades de ``0.0`` e ``1.0``, uma entrada analógica pode fornecer *qualquer* intensidade entre ``0.0`` e ``1.0``. A desvantagem é que sem um sistema de zona morta, a força de um eixo analógico nunca será igual a ``0.0`` devido à forma como o controle é construído fisicamente. Em vez disso, ele permanecerá em um valor baixo, como ``0.062``. Esse fenômeno é conhecido como *drifting* e pode ser mais perceptível em controles antigos ou com defeito.
zh_tw: 與鍵盤和滑鼠不同，控制器提供帶有*模擬*輸入的軸。模擬輸入的好處是它們為動作提供了額外的靈活性。不像數位輸入只能提供 ``0.0`` 和 ``1.0`` 的強度，模擬輸入可以提供 ``0.0`` 和 ``1.0`` 之間的*任何*強度。缺點是沒有死區系統，由於控制器的物理結構，類比軸的強度永遠不會等於 ``0.0``。相反，它將徘徊在一個低值，如 ``0.062``。這種現象被稱為*漂移*，在舊的或有問題的控制器上會更加明顯。

source: Let's take a racing game as a real-world example. Thanks to analog inputs, we can steer the car slowly in one direction or another. However, without a deadzone system, the car would slowly steer by itself even if the player isn't touching the joystick. This is because the directional axis strength won't be equal to ``0.0`` when we expect it to. Since we don't want our car to steer by itself in this case, we define a "dead zone" value of ``0.2`` which will ignore all input whose strength is lower than ``0.2``. An ideal dead zone value is high enough to ignore the input caused by joystick drifting, but is low enough to not ignore actual input from the player.
de: Nehmen wir ein Rennspiel als Beispiel aus der Praxis. Dank der analogen Eingaben können wir das Auto langsam in die eine oder andere Richtung lenken. Ohne ein Totzonen-System würde das Auto jedoch von selbst langsam lenken, auch wenn der Spieler den Joystick nicht berührt. Das liegt daran, dass die Stärke der Richtungsachse nicht gleich ``0.0`` ist, wenn wir es erwarten. Da wir nicht wollen, dass unser Auto in diesem Fall von selbst lenkt, definieren wir einen "Totzonen"-Wert von ``0.2``, der alle Eingaben ignoriert, deren Stärke kleiner als ``0.2`` ist. Ein idealer Wert für die Totzone ist hoch genug, um die Eingaben zu ignorieren, die durch das Abdriften des Joysticks verursacht werden, aber niedrig genug, um die tatsächlichen Eingaben des Spielers nicht zu ignorieren.
pt_br: Vamos pegar um jogo de corrida como um exemplo do mundo real. Graças às entradas analógicas, podemos dirigir o carro lentamente em uma direção ou outra. No entanto, sem um sistema de zona morta, o carro giraria lentamente sozinho, mesmo que o jogador não estivesse tocando o joystick. Isso ocorre porque a força do eixo direcional não será igual a ``0.0`` quando esperamos. Como não queremos que nosso carro gire sozinho neste caso, definimos um valor de "zona morta" de ``0.2`` que irá ignorar todas as entradas cuja força seja inferior a ``0.2``. Um valor de zona morta ideal é alto o suficiente para ignorar a entrada causada pelo desvio do joystick, mas é baixo o suficiente para não ignorar a entrada real do jogador.
zh_tw: 讓我們把賽車遊戲作為一個現實世界的例子。由於有了模擬輸入，我們可以將汽車慢慢地轉向一個或另一個方向。然而，如果沒有死區系統，即使玩家不接觸操縱桿，汽車也會自己慢慢轉向。這是因為方向軸的強度在我們期望的時候不會等於 ``0.0``。因為我們不希望我們的車在這種情況下自動轉向，我們定義了一個“死區”值 ``0.2``，它將忽略所有強度低於 ``0.2`` 的輸入。一個理想的死區值是足夠高的，可以忽略操縱桿漂移引起的輸入，但又足夠低，不會忽略玩家的實際輸入。

source: Godot features a built-in deadzone system to tackle this problem. The default value is ``0.5``, but you can adjust it on a per-action basis in the Project Settings' Input Map tab. For ``Input.get_vector()``, the deadzone can be specified as an optional 5th parameter. If not specified, it will calculate the average deadzone value from all of the actions in the vector.
de: Godot verfügt über ein eingebautes Totzonen-System, um dieses Problem zu lösen. Der Standardwert ist ``0.5``, aber Sie können ihn für jede Aktion auf der Input Map-Tab der Projekteinstellungen anpassen. Für ``Input.get_vector()`` kann die Totzone als optionaler fünfter Parameter angegeben werden. Wenn er nicht angegeben wird, wird der durchschnittliche Wert der Totzone aus allen Aktionen im Vektor berechnet.
zh_tw: Godot 有一個內建的死區系統來解決這個問題。預設值是 ``0.2``，但你可以在“專案設定”的“按鍵對應”分頁中根據每個動作增加或減少它。對於 ``Input.get_vector()``，可以指定死區，否則它將從向量中的所有動作計算出平均死區值。

source: "Echo" events
pt_br: Eventos de "Eco"
zh_tw: “回聲”事件

source: Unlike keyboard input, holding down a controller button such as a D-pad direction will **not** generate repeated input events at fixed intervals (also known as "echo" events). This is because the operating system never sends "echo" events for controller input in the first place.
de: Im Gegensatz zur Tastatureingabe erzeugt das Drücken einer Controllertaste, z.B. des D-Pads, **keine** wiederholten Eingabe-Events in festen Intervallen (auch als "Echo"-Ereignisse bekannt). Das liegt daran, dass das Betriebssystem niemals "Echo"-Events für Controllereingaben sendet.
pt_br: Ao contrário da entrada do teclado, manter pressionado um botão do controle, como uma direção do D-pad, **não** gerará eventos de entrada repetidos em intervalos fixos (também conhecidos como eventos de "eco"). Isso ocorre porque o sistema operacional nunca envia eventos de "eco" para a entrada do controle em primeiro lugar.
zh_tw: 與鍵盤輸入不同，按住一個控制器按鈕，如十字方向鍵，**不會**產生固定間隔的重複輸入事件（也被稱為“回聲”事件）。這是因為作業系統首先不會為控制器輸入發送“回聲”事件。

source: If you want controller buttons to send echo events, you will have to generate :ref:`class_InputEvent` objects by code and parse them using :ref:`Input.parse_input_event() <class_Input_method_parse_input_event>` at regular intervals. This can be accomplished with the help of a :ref:`class_Timer` node.
de: Wenn Sie möchten, dass Controller-Buttons Echo-Events senden, müssen Sie :ref:`class_InputEvent`-Objekte per Code generieren und sie mit :ref:`Input.parse_input_event() <class_Input_method_parse_input_event>` in regelmäßigen Abständen auslesen. Dies kann mit Hilfe eines :ref:`class_Timer`-Nodes erreicht werden.
pt_br: Se você quiser que os botões do controlador enviem eventos de eco, você terá que gerar objetos :ref:`class_InputEvent` por código e analisá-los usando :ref:`Input.parse_input_event() <class_Input_method_parse_input_event>` em intervalos regulares. Isso pode ser feito com a ajuda de um nó :ref:`class_Timer`.
zh_tw: 如果你想讓控制器按鈕發送回聲事件，你將不得不通過程式碼生成 :ref:`class_InputEvent` 物件，並使用 :ref:`Input.parse_input_event() <class_Input_method_parse_input_event>` 定期解析它們。這可以在 :ref:`class_Timer` 節點的幫助下完成。

source: Window focus
de: Fenster-Fokus
zh_tw: Windows

source: Unlike keyboard input, controller inputs can be seen by **all** windows on the operating system, including unfocused windows.
de: Im Gegensatz zu Tastatureingaben können Controllereingaben von **allen** Fenstern des Betriebssystems gesehen werden, auch von nicht fokussierten Fenstern.
zh_tw: 與鍵盤輸入不同，作業系統上的**所有**視窗都可以看到控制器輸入，包括未聚焦的視窗。

source: While this is useful for `third-party split screen functionality <https://nucleus-coop.github.io/>`__, it can also have adverse effects. Players may accidentally send controller inputs to the running project while interacting with another window.
de: Dies ist zwar für die `Split-Screen-Funktionalität von Drittanbietern <https://nucleus-coop.github.io/>`__ nützlich, kann aber auch nachteilige Auswirkungen haben. Spieler können versehentlich Controller-Eingaben an das laufende Projekt senden, während sie mit einem anderen Fenster interagieren.
zh_tw: 雖然這對於「第三方分割畫面功能 <https://nucleus-coop.github.io/>`__ 很有用，但它也可能產生不利影響。玩家在與另一個視窗互動時可能會意外地將控制器輸入傳送到正在執行的專案。

source: If you wish to ignore events when the project window isn't focused, you will need to create an :ref:`autoload <doc_singletons_autoload>` called ``Focus`` with the following script and use it to check all your inputs:
de: Falls Sie Events ignorieren wollen, wenn das Projektfenster nicht fokussiert ist, müssen Sie einen :ref:`autoload <doc_singletons_autoload>` mit dem Namen ``Focus`` mit folgendem Skript erstellen und es benutzen, um alle Ihre Inputs zu überprüfen:
zh_tw: 如果您希望在專案視窗未聚焦時忽略事件，則需要使用以下腳本建立名為「Focus」的自動載入 <doc_singletons_autoload>` 並使用它來檢查所有輸入：
