Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/controllers_gamepads_joysticks.po
Languages: de, pt_br, zh_tw

source: Then, instead of using ``Input.is_action_pressed(action)``, use ``Focus.input_is_action_pressed(action)`` where ``action`` is the name of the input action. Also, instead of using ``event.is_action_pressed(action)``, use ``Focus.event_is_action_pressed(event, action)`` where ``event`` is an InputEvent reference and ``action`` is the name of the input action.
de: Dann verwenden Sie statt ``Input.is_action_pressed(action)`` die Funktion ``Focus.input_is_action_pressed(action)``, wobei ``action`` der Name der Eingabeaktion ist. Anstelle von ``event.is_action_pressed(action)`` verwenden Sie ``Focus.event_is_action_pressed(event, action)``, wobei ``event`` eine InputEvent-Referenz und ``action`` der Name der Eingabeaktion ist.
zh_tw: 然後，不要使用“Input.is_action_pressed(action)”，而是使用“Focus.input_is_action_pressed(action)”，其中“action”是輸入操作的名稱。另外，不要使用“event.is_action_pressed(action)”，而是使用“Focus.event_is_action_pressed(event, action)”，其中“event”是InputEvent引用，“action”是事件的名稱。輸入動作。

source: Power saving prevention
de: Verhindern des Energiesparmodus
zh_tw: 防止省電模式

source: Unlike keyboard and mouse input, controller inputs do **not** inhibit sleep and power saving measures (such as turning off the screen after a certain amount of time has passed).
de: Im Gegensatz zu Tastatur- und Mauseingaben verhindern Controller-Eingaben **nicht** den Ruhezustand und Energiesparmodi (z. B. das Ausschalten des Bildschirms nach einer bestimmten Zeitspanne).
zh_tw: 與鍵盤和滑鼠輸入不同，控制器輸入**不會**抑制睡眠和省電措施（例如在經過一定時間後關閉螢幕）。

source: To combat this, Godot enables power saving prevention by default when a project is running. If you notice the system is turning off its display when playing with a gamepad, check the value of **Display > Window > Energy Saving > Keep Screen On** in the Project Settings.
de: Um dem entgegenzuwirken, aktiviert Godot standardmäßig die Energiesparvermeidung, wenn ein Projekt ausgeführt wird. Wenn Sie feststellen, dass das System seinen Bildschirm ausschaltet, wenn Sie mit einem Gamepad spielen, überprüfen Sie den Wert von **Anzeige > Fenster > Energiesparen > Bildschirm eingeschaltet lassen** in den Projekteinstellungen.
zh_tw: 為了解決這個問題，Godot 在專案運作時預設啟用節能預防。如果您注意到系統在玩遊戲手把時關閉了顯示屏，請檢查專案設定中的 **顯示 > 視窗 > 節能 > 保持螢幕開啟** 的值。

source: On Linux, power saving prevention requires the engine to be able to use D-Bus. Check whether D-Bus is installed and reachable if running the project within a Flatpak, as sandboxing restrictions may make this impossible by default.
de: Unter Linux setzt die Energiesparvermeidung voraus, dass die Engine in der Lage ist, D-Bus zu verwenden. Prüfen Sie, ob D-Bus installiert und erreichbar ist, wenn Sie das Projekt in einem Flatpak ausführen, da Sandboxing-Einschränkungen dies standardmäßig unmöglich machen können.
zh_tw: 在 Linux 上，節能預防要求引擎能夠使用 D-Bus。如果在 Flatpak 中運作專案，請檢查 D-Bus 是否已安裝且可存取，因為沙盒限制可能會導致預設無法實作此操作。

source: Troubleshooting
de: Fehlersuche
pt_br: Solução de problemas
zh_tw: 疑難排解

source: You can view a list of `known issues with controller support <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Ainput+gamepad>`__ on GitHub.
de: Sie können eine Liste der `bekannten Issues mit der Controller-Unterstützung <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Ainput+gamepad>`__ auf GitHub einsehen.
pt_br: Você pode ver uma lista de `problemas conhecidos com suporte de controladores <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Ainput+gamepad>`__ no GitHub.
zh_tw: 請瀏覽 `GitHub 上的 HTML5 問題列表 <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__ 以瞭解您有興趣的功能目前是否有問題。若列表上沒有，可以開啟 Issue 來與大家交流。

source: My controller isn't recognized by Godot.
de: Mein Controller wird von Godot nicht erkannt.
pt_br: Meu controle não é reconhecido pelo Godot.
zh_tw: Godot 無法識別我的控制器。

source: First, check that your controller is recognized by other applications. You can use the `Gamepad Tester <https://gamepad-tester.com/>`__ website to confirm that your controller is recognized.
de: Überprüfen Sie zunächst, ob Ihr Controller von anderen Anwendungen erkannt wird. Sie können die Website `Gamepad Tester <https://gamepad-tester.com/>`__ verwenden, um zu überprüfen, ob Ihr Controller erkannt wird.
pt_br: Primeiro, verifique se seu controlador é reconhecido por outros aplicativos. Você pode usar o site `Gamepad Tester <https://gamepad-tester.com/>`__ para confirmar que seu controle é reconhecido.
zh_tw: 首先，檢查你的控制器是否被其他應用程式識別。你可以使用 `Gamepad Tester <https://gamepad-tester.com/>`__ 網站來確認你的控制器被識別。

source: My controller has incorrectly mapped buttons or axes.
de: Mein Controller hat falsch zugewiesene Tasten oder Achsen.
pt_br: Meu controle tem botões ou eixos atribuidos incorretamente.
zh_tw: 我的控制器的按鈕或軸對應不正確。

source: First, if your controller provides some kind of firmware update utility, make sure to run it to get the latest fixes from the manufacturer. For instance, Xbox One and Xbox Series controllers can have their firmware updated using the `Xbox Accessories app <https://www.microsoft.com/en-us/p/xbox-accessories/9nblggh30xj3>`__. (This application only runs on Windows, so you have to use a Windows machine or a Windows virtual machine with USB support to update the controller's firmware.) After updating the controller's firmware, unpair the controller and pair it again with your PC if you are using the controller in wireless mode.
de: Wenn Ihr Controller über ein Dienstprogramm zur Firmware-Aktualisierung verfügt, sollten Sie es zunächst ausführen, um die neuesten Fixes vom Hersteller zu erhalten. Die Firmware von Xbox One- und Xbox Series-Controllern kann beispielsweise mit der `Xbox Accessories-App <https://www.microsoft.com/en-us/p/xbox-accessories/9nblggh30xj3>`__ aktualisiert werden. (Diese Anwendung läuft nur unter Windows, Sie müssen also einen Windows-Rechner oder eine virtuelle Windows-Maschine mit USB-Unterstützung verwenden, um die Firmware des Controllers zu aktualisieren.) Nachdem Sie die Firmware des Controllers aktualisiert haben, trennen Sie das Pairing des Controllers und verbinden Sie ihn erneut mit Ihrem PC, wenn Sie den Controller im drahtlosen Modus verwenden.
zh_tw: 首先，如果您的控制器提供某種韌體更新實用程式，請確保運作它以從製造商處獲取最新修復程式。例如，Xbox One 和 Xbox Series 控制器可以使用「Xbox Accessories 應用程式 <https://www.microsoft.com/en-us/p/xbox-accessories/9nblggh30xj3>」更新其韌體。 （此應用程式僅在Windows 上執行，因此您必須使用Windows 電腦或支援USB 的Windows 虛擬機器來更新控制器的韌體。）更新控制器的韌體後，請取消控制器配對，然後再次將其與PC配對（如果您是這樣）在無線模式下使用控制器。

source: If buttons are incorrectly mapped, this may be due to an erroneous mapping from the `SDL game controller database <https://github.com/gabomdq/SDL_GameControllerDB>`__. You can contribute an updated mapping to be included in the next Godot version by opening a pull request on the linked repository.
de: Wenn Tasten falsch zugeordnet sind, kann dies an einer fehlerhaften Zuordnung aus der `SDL Game Controller Database <https://github.com/gabomdq/SDL_GameControllerDB>`__ liegen. Sie können ein aktualisiertes Mapping beisteuern, das in die nächste Godot-Version aufgenommen wird, indem Sie einen Pull-Request im verlinkten Repository öffnen.
pt_br: Se os botões estiverem atribuidos incorretamente, isso pode ser devido a um mapeamento incorreto do banco de dados do controlador de jogos SDL <https://github.com/gabomdq/SDL_GameControllerDB>`__. Você pode contribuir com um mapeamento atualizado para ser incluído na próxima versão do Godot abrindo uma solicitação pull no repositório vinculado.
zh_tw: 如果按鈕存在對應錯誤，可能是由於來自 `SDL 遊戲控制器資料庫 <https://github.com/gabomdq/SDL_GameControllerDB>`__的錯誤的對應。你可以在連結的倉庫中提交拉取請求，為下一個 Godot 版本提供對應更新。

source: There are many ways to create mappings. One option is to use the mapping wizard in the `official Joypads demo <https://godotengine.org/asset-library/asset/140>`__. Once you have a working mapping for your controller, you can test it by defining the ``SDL_GAMECONTROLLERCONFIG`` environment variable before running Godot:
de: Es gibt viele Möglichkeiten, Mappings zu erstellen. Eine Möglichkeit ist die Verwendung des Mapping-Assistenten in der `offiziellen Joypads-Demo <https://godotengine.org/asset-library/asset/140>`__. Sobald Sie ein funktionierendes Mapping für Ihren Controller haben, können Sie es testen, indem Sie die Umgebungsvariable ``SDL_GAMECONTROLLERCONFIG`` definieren, bevor Sie Godot starten:
pt_br: Há muitas maneiras de criar mapeamentos. Uma opção é usar o assistente de mapeamento na `demonstração oficial dos Joypads <https://godotengine.org/asset-library/asset/140>`__. Depois de ter um mapeamento funcional para o seu controlador, você pode testá-lo definindo a variável de ambiente ``SDL_GAMECONTROLLERCONFIG`` antes de executar o Godot:
zh_tw: 有很多方法來建立對應。一個選擇是使用 `官方Joypads演示 <https://godotengine.org/asset-library/asset/140>`__ 中的對應嚮導。一旦你有了控制器可工作的對應，你可以在運作Godot之前通過定義 ``SDL_GAMECONTROLLERCONFIG`` 環境變數來測試它:

source: To test mappings on non-desktop platforms or to distribute your project with additional controller mappings, you can add them by calling :ref:`Input.add_joy_mapping() <class_Input_method_add_joy_mapping>` as early as possible in a script's ``_ready()`` function.
de: Um Mappings auf Nicht-Desktop-Plattformen zu testen oder um Ihr Projekt mit zusätzlichen Controller-Mappings zu verteilen, können Sie diese durch den Aufruf von :ref:`Input.add_joy_mapping() <class_Input_method_add_joy_mapping>` so früh wie möglich in der ``_ready()`` Funktion eines Skripts hinzufügen.
pt_br: Para testar mapeamentos em plataformas não desktop ou para distribuir seu projeto com mapeamentos de controladores adicionais, você pode adicioná-los chamando :ref:`Input.add_joy_mapping() <class_Input_method_add_joy_mapping>` o mais cedo possível em uma função ``_ready()`` no script.
zh_tw: 要在非桌面平臺上測試對應，或者用額外的控制器對應來分發你的專案，你可以通過呼叫 :ref:`Input.add_joy_mapping() <class_Input_method_add_joy_mapping>` 儘早在腳本的 ``_ready()`` 函式中新增它們。

source: My controller works on a given platform, but not on another platform.
de: Mein Controller funktioniert auf einer bestimmten Plattform, aber nicht auf einer anderen Plattform.
pt_br: Meu controle funciona em uma determinada plataforma, mas não em outra plataforma.
zh_tw: 我的控制器在特定的平臺上工作，但在另一個平臺上卻不能。

source: If you're using a self-compiled engine binary, make sure it was compiled with udev support. This is enabled by default, but it is possible to disable udev support by specifying ``udev=no`` on the SCons command line. If you're using an engine binary supplied by a Linux distribution, double-check whether it was compiled with udev support.
de: Wenn Sie eine selbst kompilierte Engine-Binärdatei verwenden, stellen Sie sicher, dass sie mit udev-Unterstützung kompiliert wurde. Diese ist standardmäßig aktiviert, aber es ist möglich, die udev-Unterstützung zu deaktivieren, indem man ``udev=no`` auf der SCons-Kommandozeile angibt. Wenn Sie eine Engine-Binärdatei verwenden, die von einer Linux-Distribution geliefert wird, überprüfen Sie, ob sie mit udev-Unterstützung kompiliert wurde.
zh_tw: 如果您使用自編譯引擎二進位檔案，請確保它是使用 udev 支援進行編譯的。預設啟用此功能，但可以透過在 SCons 命令列上指定「udev=no」來停用 udev 支援。如果您使用的是 Linux 發行版提供的引擎二進位檔案，請仔細檢查它是否是使用 udev 支援進行編譯的。

source: Controllers can still work without udev support, but it is less reliable as regular polling must be used to check for controllers being connected or disconnected during gameplay (hotplugging).
de: Controller können auch ohne udev-Unterstützung funktionieren, aber es ist weniger zuverlässig, da regelmäßiges Polling verwendet werden muss, um zu überprüfen, ob die Controller während des Spiels angeschlossen oder getrennt werden (Hotplugging).
zh_tw: 控制器在沒有 udev 支援的情況下仍然可以工作，但可靠性較低，因為必須使用定期輪詢來檢查遊戲期間控制器的連接或斷開連接（熱插拔）。

source: HTML5 controller support is often less reliable compared to "native" platforms. The quality of controller support tends to vary wildly across browsers. As a result, you may have to instruct your players to use a different browser if they can't get their controller to work.
de: Die Unterstützung für Controller bei HTML5-Spielen ist im Vergleich zu "nativen" Plattformen oft weniger zuverlässig. Die Qualität der Controller-Unterstützung ist von Browser zu Browser sehr unterschiedlich. Daher müssen Sie Ihre Spieler möglicherweise anweisen, einen anderen Browser zu verwenden, wenn sie ihren Controller nicht zum Laufen bringen können.
zh_tw: 與 "本地" 平臺相比，HTML5 控制器的支援通常不太可靠。各個瀏覽器對控制器的支援品質往往相差甚遠。因此，如果玩家無法使用他們的控制器，你可能不得不指示他們使用不同的瀏覽器。

source: Translation status
de: Übersetzungsstatus
pt_br: Progresso da Tradução
zh_tw: 翻譯狀態
