Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/custom_mouse_cursor.po
Languages: de, zh_tw

source: Customizing the mouse cursor
de: Anpassen des Mauszeigers
zh_tw: 自訂滑鼠游標

source: You might want to change the appearance of the mouse cursor in your game in order to suit the overall design. There are two ways to customize the mouse cursor:
de: Möglicherweise möchten Sie das Erscheinungsbild des Mauszeigers in Ihrem Spiel ändern, um es an das Gesamtdesign anzupassen. Es gibt zwei Möglichkeiten, den Mauszeiger anzupassen:
zh_tw: 您可能希望更改遊戲中滑鼠游標的外觀，以便適應總體設計。自訂滑鼠游標有兩種方法：

source: Using project settings
de: Verwenden der Projekteinstellungen
zh_tw: 使用專案設定

source: Using a script
de: Verwenden eines Skripts
zh_tw: 使用腳本

source: Using project settings is a simpler (but more limited) way to customize the mouse cursor. The second way is more customizable, but involves scripting:
de: Die Verwendung von Projekteinstellungen ist eine einfachere (aber eingeschränktere) Möglichkeit, den Mauszeiger anzupassen. Die zweite Möglichkeit ist anpassungsfähiger, erfordert aber Skripting:
zh_tw: 使用專案設定來自訂滑鼠游標更簡單（但也更受限）。第二種方法更方便定制，但涉及到腳本：

source: You could display a "software" mouse cursor by hiding the mouse cursor and moving a Sprite2D to the cursor position in a ``_process()`` method, but this will add at least one frame of latency compared to an "hardware" mouse cursor. Therefore, it's recommended to use the approach described here whenever possible.
de: Sie könnten einen "Software"-Mauszeiger anzeigen, indem Sie den Mauszeiger ausblenden und ein Sprite2D in einer ``_process()``-Methode an die Position des Mauszeigers bewegen, aber dies führt zu einer zusätzlichen Latenz von mindestens einem Frame im Vergleich zu einem "Hardware"-Mauszeiger. Daher ist es empfehlenswert, wann immer möglich, den hier beschriebenen Ansatz zu verwenden.
zh_tw: 您可以通過隱藏滑鼠游標，並在 ``_process`` 方法中將 Sprite 移動到的游標位置來顯示“軟體”滑鼠游標，但與“硬體”滑鼠游標相比，這至少會增加一影格延遲。因此，建議盡可能使用此處描述的方法。

source: If you have to use the "software" approach, consider adding an extrapolation step to better display the actual mouse input.
de: Wenn Sie den "Software"-Ansatz verwenden müssen, sollten Sie einen Extrapolationsschritt hinzufügen, um die tatsächliche Mauseingabe besser anzuzeigen.
zh_tw: 如果您必須使用“軟體”的做法，可以考慮新增一個外推步驟，以便更好地顯示實際的滑鼠輸入。

source: Open project settings, go to Display>Mouse Cursor. You will see Custom Image, Custom Image Hotspot and Tooltip Position Offset.
de: Öffnen Sie die Projekteinstellungen und gehen Sie zu Anzeige>Mauszeiger. Sie sehen Benutzerdefiniertes Bild, Benutzerdefinierter Bild-Hotspot und Tooltip-Positionsversatz.
zh_tw: 打開專案設定，轉到 Display>Mouse Cursor（顯示 > 滑鼠游標）。您將看到 Custom Image（自訂圖像）和 Custom Image Hotspot（自訂圖像熱點）。

source: Custom Image is the desired image that you would like to set as the mouse cursor. Custom Hotspot is the point in the image that you would like to use as the cursor's detection point.
de: Benutzerdefiniertes Bild ist das gewünschte Bild, das Sie als Mauszeiger festlegen möchten. Benutzerdefinierter Hotspot ist der Punkt im Bild, den Sie als Erkennungspunkt für den Cursor verwenden möchten.
zh_tw: 自訂圖像是希望設定為滑鼠游標的圖像. 自訂熱點是圖像中的點, 您希望將其用作游標的偵測點.

source: The custom image **must** be 256×256 pixels at most. To avoid rendering issues, sizes lower than or equal to 128×128 are recommended.
de: Das benutzerdefinierte Bild **muss** höchstens 256×256 Pixel groß sein. Um Rendering-Probleme zu vermeiden, werden Größen kleiner oder gleich 128×128 empfohlen.
zh_tw: 自訂影像**必須**最大為256×256像素。為了避免算繪問題，建議尺寸小於或等於128×128。

source: On the web platform, the maximum allowed cursor image size is 128×128.
de: Auf der Web-Plattform beträgt die maximal zulässige Größe des Mauszeiger-Bildes 128×128.
zh_tw: 在網頁平台上，允許的最大遊標影像尺寸為128×128。

source: Create a Node and attach the following script.
de: Erstellen Sie einen Node und hängen Sie das folgende Skript an.
zh_tw: 建立一個 Node 節點並附加下面的腳本。

source: Check :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>`'s documentation for more information on usage and platform-specific caveats.
de: Lesen Sie die :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>` Dokumentation für weitere Informationen über die Verwendung und plattformspezifische Hinweise.
zh_tw: 檢查 :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>`.

source: Cursor list
de: Mauszeigerliste
zh_tw: 游標列表

source: As documented in the :ref:`Input <class_Input>` class (see the **CursorShape** enum), there are multiple mouse cursors you can define. Which ones you want to use depends on your use case.
de: Wie in der Klasse :ref:`Input <class_Input>` dokumentiert (siehe das Enum **CursorShape**), gibt es mehrere Mauszeiger, die Sie definieren können. Welche Sie verwenden möchten, hängt von Ihrem Anwendungsfall ab.
zh_tw: 正如 :ref:`Input <class_Input>` 類中所述（請參閱 **CursorShape** 列舉），你可以定義多個滑鼠游標。您想要使用哪一個取決於您的用例。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
