Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/handling_quit_requests.po
Languages: de, zh_tw

source: Handling quit requests
de: Beendigungsanfragen bearbeiten
zh_tw: 處理退出請求

source: Quitting
de: Beenden
zh_tw: 退出

source: Most platforms have the option to request the application to quit. On desktops, this is usually done with the "x" icon on the window title bar. On Android, the back button is used to quit when on the main screen (and to go back otherwise).
de: Die meisten Plattformen haben die Möglichkeit, die Anwendung zum Beenden aufzufordern. Auf Desktops erfolgt dies normalerweise mit dem "x" Symbol in der Titelleiste des Fensters. Unter Android wird die Zurück-Taste zum Beenden verwendet, wenn man auf dem Hauptbildschirm ist (ansonsten geht man zurück).
zh_tw: 大多數平臺都有要求應用程式退出的選項。在桌面系統中，這通常是通過視窗標題列上的“x”圖示來實作的。在 Android 系統上，當在主螢幕上時，後退按鈕被用來退出（否則就返回）。

source: Handling the notification
de: Bearbeitung der Benachrichtigung
zh_tw: 處理通知

source: On desktop and web platforms, :ref:`Node <class_Node>` receives a special ``NOTIFICATION_WM_CLOSE_REQUEST`` notification when quitting is requested from the window manager.
de: Auf Desktop- und Web-Plattformen erhält :ref:`Node <class_Node>` eine spezielle ``NOTIFICATION_WM_CLOSE_REQUEST``-Benachrichtigung, wenn das Beenden vom Window-Manager angefordert wird.
zh_tw: 在桌面平臺上, :ref:`MainLoop <class_MainLoop>` 有一個特殊的 ``MainLoop.NOTIFICATION_WM_QUIT_REQUEST`` 通知, 當請求退出時, 會向所有節點發送.

source: On Android, ``NOTIFICATION_WM_GO_BACK_REQUEST`` is sent instead. Pressing the Back button will exit the application if **Application > Config > Quit On Go Back** is checked in the Project Settings (which is the default).
de: Unter Android wird stattdessen ``NOTIFICATION_WM_GO_BACK_REQUEST`` gesendet. Durch Drücken des "Zurück"-Buttons wird die Anwendung beendet, wenn **Anwendung > Konfiguration > Beenden bei Zurückgehen** in den Projekteinstellungen aktiviert ist (dies ist der Default).
zh_tw: 在Android系統中, 會發送 ``MainLoop.NOTIFICATION_WM_GO_BACK_REQUEST`` 代替. 如果在專案設定中勾選了 **Application > Config > Quit On Go Back** (預設), 按Back按鈕將退出應用程式.

source: ``NOTIFICATION_WM_GO_BACK_REQUEST`` isn't supported on iOS, as iOS devices don't have a physical Back button.
de: Die Funktion ``NOTIFICATION_WM_GO_BACK_REQUEST`` wird unter iOS nicht unterstützt, da iOS-Geräte keinen physischen Zurück-Button haben.
zh_tw: ``MainLoop.NOTIFICATION_WM_GO_BACK_REQUEST`` 在iOS上不支援, 因為iOS裝置沒有實體的Back按鈕.

source: Handling the notification is done as follows (on any node):
de: Die Benachrichtigung wird wie folgt gehandhabt (auf jedem Node):
zh_tw: 處理通知的方法如下(在任何節點上):

source: When developing mobile apps, quitting is not desired unless the user is on the main screen, so the behavior can be changed.
de: Bei der Entwicklung mobiler Apps ist das Beenden nur dann erwünscht, wenn sich der Benutzer auf dem Hauptbildschirm befindet, sodass das Verhalten geändert werden kann.
zh_tw: 在開發移動應用程式時, 除非使用者在主螢幕上, 否則不需要退出, 因此處理方式有變化.

source: It is important to note that by default, Godot apps have the built-in behavior to quit when quit is requested from the window manager. This can be changed, so that the user can take care of the complete quitting procedure:
de: Es ist wichtig zu beachten, dass Godot-Anwendungen standardmäßig so eingestellt sind, dass sie beendet werden, wenn der Fenstermanager das Beenden anfordert. Dies kann geändert werden, so dass der Benutzer den gesamten Beendigungsvorgang selbst durchführen kann:
zh_tw: 值得注意的是, 預設情況下, 在請求退出時,Godot應用程式具有退出的內建行為, 可以更改為:

source: Sending your own quit notification
de: Senden einer eigenen Beenden-Benachrichtigung
zh_tw: Godot 通知

source: While forcing the application to close can be done by calling :ref:`SceneTree.quit <class_SceneTree_method_quit>`, doing so will not send the ``NOTIFICATION_WM_CLOSE_REQUEST`` to the nodes in the scene tree. Quitting by calling :ref:`SceneTree.quit <class_SceneTree_method_quit>` will not allow custom actions to complete (such as saving, confirming the quit, or debugging), even if you try to delay the line that forces the quit.
de: Während das Beenden der Anwendung durch den Aufruf von :ref:`SceneTree.quit <class_SceneTree_method_quit>` erzwungen werden kann, wird dadurch die ``NOTIFICATION_WM_CLOSE_REQUEST`` nicht an die Nodes im Szenenbaum gesendet. Das Beenden durch den Aufruf von :ref:`SceneTree.quit <class_SceneTree_method_quit>` lässt keine benutzerdefinierten Aktionen zu (wie z.B. Speichern, Bestätigen des Beendens oder Debuggen), selbst wenn Sie versuchen, die Zeile, die das Beenden erzwingt, zu verzögern.
zh_tw: 雖然強迫應用程式關閉可以通過呼叫 :ref:`SceneTree.quit <class_SceneTree_method_quit>` 來完成，但這樣做不會發送退出的*通知*。這意味著上面描述的函式不會被呼叫。通過呼叫 :ref:`SceneTree.quit <class_SceneTree_method_quit>` 來退出，將不允許自訂動作的完成（比如保存、確認退出或除錯），即使你試圖延遲強制退出的行。

source: Instead, if you want to notify the nodes in the scene tree about the upcoming program termination, you should send the notification yourself:
de: Wenn Sie stattdessen die Nodes im Szenenbaum über den bevorstehenden Programmabbruch benachrichtigen wollen, sollten Sie die Benachrichtigung selbst senden:
zh_tw: 相反，如果您想通知場景樹中的節點即將到來的程式終止，您應該自己發送通知：

source: Sending this notification will inform all nodes about the program termination, but will not terminate the program itself *unlike in 3.X*. In order to achieve the previous behavior, :ref:`SceneTree.quit <class_SceneTree_method_quit>` should be called after the notification.
de: Das Senden dieser Benachrichtigung informiert alle Nodes über die Beendigung des Programms, beendet aber nicht das Programm selbst, *anders als in 3.X*. Um das vorherige Verhalten zu erreichen, sollte :ref:`SceneTree.quit <class_SceneTree_method_quit>` nach der Benachrichtigung aufgerufen werden.
zh_tw: 發送此通知將通知所有節點有關程式終止的信息，但不會終止程式本身*與 3.X 中不同*。為了實作前面的行為，應該在通知後呼叫 SceneTree.quit <class_SceneTree_method_quit>` 。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
