Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/input_examples.po
Languages: de, zh_tw

source: Input examples
de: Eingabe-Beispiele
zh_tw: 輸入範例

source: Introduction
de: Einführung
zh_tw: 前言

source: In this tutorial, you'll learn how to use Godot's :ref:`InputEvent <class_InputEvent>` system to capture player input. There are many different types of input your game may use - keyboard, gamepad, mouse, etc. - and many different ways to turn those inputs into actions in your game. This document will show you some of the most common scenarios, which you can use as starting points for your own projects.
de: In diesem Tutorial lernen Sie, wie Sie das :ref:`InputEvent <class_InputEvent>`-System von Godot verwenden, um Spielereingaben zu erfassen. Es gibt viele verschiedene Arten von Eingaben, die Ihr Spiel verwenden kann - Tastatur, Gamepad, Maus, etc. - und viele verschiedene Möglichkeiten, diese Eingaben in Aktionen in Ihrem Spiel umzusetzen. Dieses Dokument zeigt Ihnen einige der häufigsten Szenarien, die Sie als Ausgangspunkt für Ihre eigenen Projekte verwenden können.
zh_tw: 在本教學中, 您將學習如何使用Godot的 :ref:`輸入事件 <class_InputEvent>` 系統捕獲玩家輸入. 您的遊戲可以使用多種不同型別的輸入——鍵盤, 遊戲手柄, 滑鼠等等. 還有許多不同的方法, 將這些輸入轉化為遊戲中的動作. 本文將向您展示一些最常見的場景, 您可以將其作為您自己專案的起點.

source: For a detailed overview of how Godot's input event system works, see :ref:`doc_inputevent`.
de: Einen detaillierten Überblick über die Funktionsweise von Godots Eingabe-Event-System finden Sie unter :ref:`doc_inputevent`.
zh_tw: 要詳細瞭解 Godot 的輸入事件系統是如何工作的，請參閱 :ref:`doc_inputevent`。

source: Events versus polling
de: Events vs. Polling
zh_tw: 事件和輪詢

source: Sometimes you want your game to respond to a certain input event - pressing the "jump" button, for example. For other situations, you might want something to happen as long as a key is pressed, such as movement. In the first case, you can use the ``_input()`` function, which will be called whenever an input event occurs. In the second case, Godot provides the :ref:`Input <class_Input>` singleton, which you can use to query the state of an input.
de: Manchmal möchten Sie, dass Ihr Spiel auf ein bestimmtes Eingabe-Event reagiert, z.B. auf das Drücken des "Sprung"-Buttons. In anderen Situationen möchten Sie vielleicht, dass etwas passiert, solange eine Taste gedrückt wird, wie zum Beispiel eine Bewegung. Im ersten Fall können Sie die Funktion ``_input()`` verwenden, die immer dann aufgerufen wird, wenn ein Eingabe-Event auftritt. Im zweiten Fall bietet Godot das Singleton :ref:`Input <class_Input>`, mit dem Sie den Zustand einer Eingabe abfragen können.
zh_tw: 有時你想讓你的遊戲對某一輸入事件作出反應--例如按下 "跳躍" 按鈕. 在其他情況下, 你可能希望只要有一個鍵被按下就會發生一些事情, 比如移動. 在第一種情況下, 你可以使用 ``_input()`` 函式, 只要有輸入事件發生就會呼叫該函式. 在第二種情況下,Godot提供了 :ref:`Input <class_Input>` 單例, 你可以用它來查詢一個輸入的狀態.

source: Examples:
de: Beispiele:
zh_tw: 範例：

source: This gives you the flexibility to mix-and-match the type of input processing you do.
de: Dies gibt Ihnen die Flexibilität, die Art der durchführenden Eingabeverarbeitung zu kombinieren.
zh_tw: 這使您能夠靈活地混合和配對所執行輸入的處理型別.

source: For the remainder of this tutorial, we'll focus on capturing individual events in ``_input()``.
de: Im weiteren Verlauf dieses Tutorials konzentrieren wir uns auf die Erfassung einzelner Ereignisse in ``_input ()``.
zh_tw: 對於本教學的其餘部分, 我們將專注於使用 ``_input ()`` 捕捉單個事件.

source: Input events
de: Eingabe-Events
zh_tw: 輸入事件

source: Input events are objects that inherit from :ref:`InputEvent <class_InputEvent>`. Depending on the event type, the object will contain specific properties related to that event. To see what events actually look like, add a Node and attach the following script:
de: Eingabe-Events sind Objekte, die von :ref:`InputEvent <class_InputEvent>` erben. Je nach Event-Typ enthält das Objekt spezifische Propertys, die sich auf das jeweilige Event beziehen. Um zu sehen, wie Events tatsächlich aussehen, fügen Sie einen Node hinzu und hängen das folgende Skript an:
zh_tw: 輸入事件是繼承自 :ref:`輸入事件 <class_InputEvent>` 的物件. 根據事件型別, 物件將包含與該事件相關的特定屬性. 為了瞭解事件的實際情況, 新增一個節點並附加以下腳本:

source: As you press keys, move the mouse, and perform other inputs, you'll see each event scroll by in the output window. Here's an example of the output:
de: Wenn Sie Tasten drücken, die Maus bewegen oder andere Eingaben machen, sehen Sie, wie die einzelnen Evebts im Ausgabefenster vorbeiscrollen. Hier ist ein Beispiel für die Ausgabe:
zh_tw: 當你按下按鍵, 移動滑鼠, 並執行其他輸入, 您會在輸出視窗中看到每個事件滾動. 下面是輸出的一個例子:

source: As you can see, the results are very different for the different types of input. Key events are even printed as their key symbols. For example, let's consider :ref:`InputEventMouseButton <class_InputEventMouseButton>`. It inherits from the following classes:
de: Wie Sie sehen können, sind die Ergebnisse für die verschiedenen Arten von Eingaben sehr unterschiedlich. Tasten-Events werden sogar als ihre Tasten-Symbole ausgegeben. Betrachten wir zum Beispiel :ref:`InputEventMouseButton <class_InputEventMouseButton>`. Sie erbt von den folgenden Klassen:
zh_tw: 如你所見, 對於不同型別的輸入, 結果是非常不同的. 按鍵事件甚至被列印為按鍵符號. 例如, 讓我們考慮 :ref:`滑鼠按鈕輸入事件 <class_InputEventMouseButton>` . 它繼承自以下類:

source: :ref:`InputEvent <class_InputEvent>` - the base class for all input events
de: :ref:`InputEvent <class_InputEvent>` - Die Basisklasse für alle Eingabe-Events
zh_tw: :ref:`InputEvent <class_InputEvent>` - 所有輸入事件的基底類別

source: :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` - adds the ability to check if modifiers are pressed, such as :kbd:`Shift` or :kbd:`Alt`.
de: :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` - fügt die Fähigkeit hinzu, zu überprüfen, ob Modifikatoren gedrückt werden, wie :kbd:`Shift` oder :kbd:`Alt`.
zh_tw: :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` - 增加了檢查是否按下修飾按鍵, 如 :kbd:`Shift` 或 :kbd:`Alt` .

source: :ref:`InputEventMouse <class_InputEventMouse>` - adds mouse event properties, such as ``position``
de: :ref:`InputEventMouse <class_InputEventMouse>` - fügt Maus-Event-Propertys hinzu, wie z.B. ``Position``
zh_tw: :ref:`InputEventMouse <class_InputEventMouse>` - 增加滑鼠事件屬性, 如 ``position``

source: :ref:`InputEventMouseButton <class_InputEventMouseButton>` - contains the index of the button that was pressed, whether it was a double-click, etc.
de: :ref:`InputEventMouseButton <class_InputEventMouseButton>` - enthält den Index der Taste, die gedrückt wurde, und ob es sich um einen Doppelklick handelte, usw.
zh_tw: :ref:`滑鼠按鈕輸入事件 <class_InputEventMouseButton>` 包含按下的按鈕的索引, 無論是按兩下, 或是其他.

source: It's a good idea to keep the class reference open while you're working with events so you can check the event type's available properties and methods.
de: Es ist eine gute Idee, die Klassenreferenz geöffnet zu lassen, während Sie mit Events arbeiten, damit Sie die verfügbaren Propertys und Methoden des Event-Typs überprüfen können.
zh_tw: 在處理事件時, 打開類引用是一個好主意, 這樣可以檢查事件型別的可用屬性和方法.

source: You can encounter errors if you try to access a property on an input type that doesn't contain it - calling ``position`` on ``InputEventKey`` for example. To avoid this, make sure to test the event type first:
de: Sie können auf Fehler stoßen, wenn Sie versuchen, auf eine Property eines Eingabetyps zuzugreifen, der sie nicht enthält - zum Beispiel, wenn Sie ``Position`` auf ``InputEventKey`` aufrufen. Um dies zu vermeiden, stellen Sie sicher, dass Sie den Event-Typ zuerst testen:
zh_tw: 如果您嘗試存取不包含屬性的輸入型別上的屬性, 則可能會遇到錯誤-例如, 對 ``InputEventKey`` 呼叫 ``Position`` . 要避免這種情況, 請確保首先測試事件型別:

source: The :ref:`InputMap <class_InputMap>` is the most flexible way to handle a variety of inputs. You use this by creating named input *actions*, to which you can assign any number of input events, such as keypresses or mouse clicks. To see them, and to add your own, open Project -> Project Settings and select the InputMap tab:
de: Die :ref:`InputMap <class_InputMap>` ist der flexibelste Weg, eine Vielzahl von Eingaben zu verarbeiten. Sie verwenden sie, indem Sie benannte Eingabe-*Aktionen* erstellen, denen Sie eine beliebige Anzahl von Eingabe-Events zuordnen können, wie z.B. Tastendrücke oder Mausklicks. Um diese zu sehen und Ihre eigenen hinzuzufügen, öffnen Sie Projekt -> Projekteinstellungen und wählen Sie den InputMap-Tab:
zh_tw: :ref:`事件表 <class_InputMap>` 是處理各種輸入的最靈活的方法. 您可以通過建立命名的輸入 *動作* 來使用它, 可以為它分配任意數量的輸入事件, 例如按鍵或滑鼠點擊. 一個新的Godot專案已經包含許多預設定義操作. 看看它們, 然後新增你自己的, 打開專案->專案設定, 並選擇事件表分頁:

source: A new Godot project includes a number of default actions already defined. To see them, turn on ``Show Built-in Actions`` in the InputMap dialog.
de: Ein neues Godot-Projekt enthält eine Reihe von bereits definierten Standardaktionen. Um diese zu sehen, schalten Sie im Dialogfeld "InputMap" die Option ``Built-in-Aktionen zeigen`` ein.
zh_tw: 新的 Godot 專案包含許多已定義的預設操作。若要查看它們，請在“InputMap”對話方塊中開啟“顯示內建操作”。

source: Capturing actions
de: Aktionen aufnehmen
zh_tw: 建立內容

source: Once you've defined your actions, you can process them in your scripts using ``is_action_pressed()`` and ``is_action_released()`` by passing the name of the action you're looking for:
de: Sobald Sie Ihre Aktionen definiert haben, können Sie diese in Ihren Skripten mit ``is_action_pressed()`` und ``is_action_released()`` verarbeiten, indem Sie den Namen der gesuchten Aktion übergeben:
zh_tw: 一旦你定義了動作, 可以在腳本中使用 ``is_action_pressed()`` 和 ``is_action_released ()`` 處理它們. 通過名稱搜尋回應的動作:

source: Keyboard events
de: Tastatur-Events
zh_tw: 鍵盤事件

source: Keyboard events are captured in :ref:`InputEventKey <class_InputEventKey>`. While it's recommended to use input actions instead, there may be cases where you want to specifically look at key events. For this example, let's check for the :kbd:`T`:
de: Tastatur-Events werden in :ref:`InputEventKey <class_InputEventKey>` erfasst. Es wird zwar empfohlen, stattdessen Eingabeaktionen zu verwenden, aber es kann Fälle geben, in denen Sie speziell nach Tastenereignissen suchen möchten. In diesem Beispiel wollen wir nach dem :kbd:`T` suchen:
zh_tw: 鍵盤事件在 :ref:`InputEventKey <class_InputEventKey>` 中被捕獲. 雖然建議使用輸入動作來代替, 但在某些情況下, 你可能會想專門查看按鍵事件. 對於目前範例, 來檢查一下 :kbd:`T` :

source: See :ref:`@GlobalScope_Key <enum_@GlobalScope_Key>` for a list of keycode constants.
de: Siehe :ref:`@GlobalScope_Key <enum_@GlobalScope_Key>` für eine Liste von Tastencode-Konstanten.
zh_tw: 詳見 :ref:`全域範圍_鍵位列表 <enum_@GlobalScope_KeyList>` 獲取掃描程式碼常數列表.

source: Due to *keyboard ghosting*, not all key inputs may be registered at a given time if you press too many keys at once. Due to their location on the keyboard, certain keys are more prone to ghosting than others. Some keyboards feature antighosting at a hardware level, but this feature is generally not present on low-end keyboards and laptop keyboards.
de: Aufgrund von *Tastatur-Ghosting* werden möglicherweise nicht alle Tasteneingaben zu einem bestimmten Zeitpunkt registriert, wenn Sie zu viele Tasten gleichzeitig drücken. Aufgrund ihrer Position auf der Tastatur sind bestimmte Tasten anfälliger für Ghosting als andere. Einige Tastaturen verfügen über eine Antighosting-Funktion auf Hardware-Ebene, aber diese Funktion ist bei einfachen Tastaturen und Laptop-Tastaturen im Allgemeinen nicht vorhanden.
zh_tw: 由於*鍵盤衝突*，如果你一次性按下了太多的鍵，那麼在特定時間點，可能是無法將所有按鍵輸入都進行註冊的。根據按鍵在鍵盤上位置的不同，某些按鍵產生衝突的可能性會比其他的要高。有些鍵盤在硬體層面會提供抗衝突功能，不過在低端鍵盤和筆記本鍵盤上很少見。

source: As a result, it's recommended to use a default keyboard layout that is designed to work well on a keyboard without antighosting. See `this Gamedev Stack Exchange question <https://gamedev.stackexchange.com/a/109002>`__ for more information.
de: Es wird daher empfohlen, ein Default-Tastaturlayout zu verwenden, das für eine Tastatur ohne Anti-Ghosting geeignet ist. Weitere Informationen finden Sie in `dieser Gamedev Stack Exchange-Frage <https://gamedev.stackexchange.com/a/109002>`__.
zh_tw: 因此，建議使用能夠在不具備抗衝突功能的鍵盤上也能正常工作的預設鍵盤配置。詳情請參閱`這個 Gamedev Stack Exchange 問題 <https://gamedev.stackexchange.com/a/109002>`__。

source: Keyboard modifiers
de: Tastaturmodifikatoren
zh_tw: 鍵盤修飾鍵

source: Modifier properties are inherited from :ref:`InputEventWithModifiers <class_InputEventWithModifiers>`. This allows you to check for modifier combinations using boolean properties. Let's imagine you want one thing to happen when the :kbd:`T` is pressed, but something different when it's :kbd:`Shift + T`:
de: Modifikator-Propertys werden von :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` geerbt. Damit können Sie mit booleschen Propertys auf Modifikator-Kombinationen prüfen. Nehmen wir an, Sie wollen, dass etwas passiert, wenn die Taste :kbd:`T` gedrückt wird, aber etwas anderes, wenn die Taste :kbd:`Shift + T` gedrückt wird:
zh_tw: 修飾鍵屬性繼承自 :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` ，可使用布林屬性檢查修飾鍵的組合。試想，如果需要在按下 :kbd:`T` 時發生一件事，而按下 :kbd:`Shift + T` 時發生不同的事：

source: Mouse events
de: Maus-Events
zh_tw: 滑鼠事件

source: Mouse events stem from the :ref:`InputEventMouse <class_InputEventMouse>` class, and are separated into two types: :ref:`InputEventMouseButton <class_InputEventMouseButton>` and :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`. Note that this means that all mouse events will contain a ``position`` property.
de: Maus-Events stammen von der Klasse :ref:`InputEventMouse <class_InputEventMouse>` und sind in zwei Typen unterteilt: :ref:`InputEventMouseButton <class_InputEventMouseButton>` und :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`. Beachten Sie, dass dies bedeutet, dass alle Maus-Events eine Property ``Position`` enthalten.
zh_tw: 滑鼠事件繼承自 :ref:`InputEventMouse <class_InputEventMouse>` 並被分成 :ref:`InputEventMouseButton <class_InputEventMouseButton>` 和 :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` 兩種型別。注意，這意味著所有滑鼠事件都包含 ``position`` 屬性。

source: Mouse buttons
de: Maustasten
zh_tw: 滑鼠按鈕

source: Capturing mouse buttons is very similar to handling key events. :ref:`@GlobalScope_MouseButton <enum_@GlobalScope_MouseButton>` contains a list of ``MOUSE_BUTTON_*`` constants for each possible button, which will be reported in the event's ``button_index`` property. Note that the scrollwheel also counts as a button - two buttons, to be precise, with both ``MOUSE_BUTTON_WHEEL_UP`` and ``MOUSE_BUTTON_WHEEL_DOWN`` being separate events.
de: Die Erfassung von Maustasten ist der Behandlung von Tasten-Events sehr ähnlich. :ref:`@GlobalScope_MouseButton <enum_@GlobalScope_MouseButton>` enthält eine Liste von ``MOUSE_BUTTON_*``-Konstanten für jede mögliche Taste, die in der ``button_index``-Eigenschaft des Events gemeldet werden. Beachten Sie, dass das Scrollrad auch als Taste zählt - zwei Tasten, um genau zu sein, wobei sowohl ``MOUSE_BUTTON_WHEEL_UP`` als auch ``MOUSE_BUTTON_WHEEL_DOWN`` separate Events sind.
zh_tw: 捕獲滑鼠按鈕與處理按鍵事件非常相似。:ref:`@GlobalScope_ButtonList <enum_@GlobalScope_ButtonList>` 包含每個可能按鈕的 `BUTTON_*` 常數列表，它將在事件的 ``button_index`` 屬性中報告。注意，滑鼠滾輪也可以算作一個按鈕——準確地說是兩個按鈕，``BUTTON_WHEEL_UP``（滾輪鍵向上）和 ``BUTTON_WHEEL_DOWN``（滾輪鍵向上）都是獨立的事件。

source: Mouse motion
de: Mausbewegung
zh_tw: 滑鼠行為

source: :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` events occur whenever the mouse moves. You can find the move's distance with the ``relative`` property.
de: :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`-Events treten auf, wenn sich die Maus bewegt. Sie können die Entfernung der Bewegung mit der ``relativ``-Property ermitteln.
zh_tw: :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` 只要滑鼠移動就會發生事件. 可以通過 ``relative`` 屬性找到移動的距離.

source: Here's an example using mouse events to drag-and-drop a :ref:`Sprite2D <class_Sprite2D>` node:
de: Hier ein Beispiel für die Verwendung von Mouse Events zum Verschieben eines :ref:`Sprite2D <class_Sprite2D>` Nodes per Drag&Drop:
zh_tw: 下面是一個使用滑鼠事件拖放 :ref:`Sprite <class_Sprite>` 節點的例子：

source: Touch events
zh_tw: 觸摸事件

source: If you are using a touchscreen device, you can generate touch events. :ref:`InputEventScreenTouch <class_InputEventScreenTouch>` is equivalent to a mouse click event, and :ref:`InputEventScreenDrag <class_InputEventScreenDrag>` works much the same as mouse motion.
de: Wenn Sie ein Touchscreen-Gerät verwenden, können Sie Touch-Events erzeugen: :ref:`InputEventScreenTouch <class_InputEventScreenTouch>` entspricht einem Mausklick-Event, und :ref:`InputEventScreenDrag <class_InputEventScreenDrag>` funktioniert ähnlich wie eine Mausbewegung.
zh_tw: 如果你使用的是觸控式螢幕裝置，就可以生成觸摸事件。:ref:`InputEventScreenTouch <class_InputEventScreenTouch>` 相當於滑鼠點擊事件，而 :ref:`InputEventScreenDrag <class_InputEventScreenDrag>` 的工作原理與滑鼠移動一致。

source: To test your touch events on a non-touchscreen device, open Project Settings and go to the "Input Devices/Pointing" section. Enable "Emulate Touch From Mouse" and your project will interpret mouse clicks and motion as touch events.
de: Um Ihre Touch-Events auf einem Nicht-Touchscreen-Gerät zu testen, öffnen Sie die Projekteinstellungen und gehen Sie zum Abschnitt "Eingabegeräte/Zeigen". Aktivieren Sie "Touch durch Maus emulieren", damit Ihr Projekt Mausklicks und Bewegungen als Touch Events interpretiert.
zh_tw: 要在非觸控式螢幕裝置上測試觸摸事件，請打開“專案設定”，進入“Input Devices/Pointing”（輸入裝置/觸點）部分。啟用“Emulate Touch From Mouse”（根據滑鼠類比觸摸），您的專案將把滑鼠按一下和移動解釋為觸摸事件。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
