Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/inputevent.po
Languages: de, zh_cn, zh_tw

source: Using InputEvent
de: Verwendung von InputEvent
zh_cn: 使用 InputEvent
zh_tw: 使用 InputEvent

source: What is it?
de: Was ist das?
zh_cn: 它是什么？
zh_tw: 它是什麼？

source: Managing input is usually complex, no matter the OS or platform. To ease this a little, a special built-in type is provided, :ref:`InputEvent <class_InputEvent>`. This datatype can be configured to contain several types of input events. Input events travel through the engine and can be received in multiple locations, depending on the purpose.
de: Das Verwalten von Eingaben ist normalerweise komplex, unabhängig vom Betriebssystem oder der Plattform. Um dies ein wenig zu vereinfachen, wird ein spezieller Built-in-Typ bereitgestellt :ref:`InputEvent <class_InputEvent>`. Dieser Datentyp kann so konfiguriert werden, dass er verschiedene Arten von Eingabeereignissen enthält. Eingabeereignisse laufen durch die Engine und können je nach Zweck an mehreren Orten empfangen werden.
zh_cn: 无论是在操作系统或平台上, 管理输入通常很复杂. 为了简化输入管理, 引擎提供了一个特殊的内置类型 :ref:`InputEvent <class_InputEvent>`. 此类型可被设置成包含多种类型的输入事件. 输入事件通过引擎传递, 可在多个位置接收, 具体位置取决于目的.
zh_tw: 無論是在作業系統或平臺上, 管理輸入通常很複雜. 為了簡化輸入管理, 引擎提供了一個特殊的內建型別 :ref:`InputEvent <class_InputEvent>`. 此型別可被設定成包含多種型別的輸入事件. 輸入事件通過引擎傳遞, 可在多個位置接收, 具體位置取決於目的.

source: Here is a quick example, closing your game if the escape key is hit:
de: Hier ist ein kurzes Beispiel, dass das Spiel beendet, sobald die Escape-Taste gedrückt wird:
zh_cn: 这里有一个简单的示例，按下 ESC 键时关闭你的游戏：
zh_tw: 這裡有一個簡單的範例，按下 ESC 鍵時關閉您的遊戲：

source: However, it is cleaner and more flexible to use the provided :ref:`InputMap <class_InputMap>` feature, which allows you to define input actions and assign them different keys. This way, you can define multiple keys for the same action (e.g. the keyboard escape key and the start button on a gamepad). You can then more easily change this mapping in the project settings without updating your code, and even build a key mapping feature on top of it to allow your game to change the key mapping at runtime!
de: Es ist jedoch sauberer und flexibler, die bereitgestellte Funktion :ref:`InputMap <class_InputMap>` zu verwenden, mit der Sie Eingabeaktionen definieren und ihnen verschiedene Tasten zuweisen können. Auf diese Weise können Sie mehrere Tasten für dieselbe Aktion definieren (z.B. die Escape-Taste auf der Tastatur und den Start-Button auf einem Gamepad). Sie können diese Zuordnung dann einfacher in den Projekteinstellungen ändern, ohne Ihren Code zu aktualisieren, und sogar eine Tastenzuordnung darüber erstellen, damit Ihr Spiel diese Zuordnung zur Laufzeit ändern kann!
zh_cn: 但是，使用所提供的 :ref:`InputMap <class_InputMap>` 功能更简洁灵活，它允许你定义输入操作并分配不同的键。这样，你可以定义多个键的相同动作，例如键盘ESC键和游戏手柄上的启动按钮。然后，你可以在不更新代码的情况下轻松更改项目设置中的此映射，甚至在上面构建键映射功能，以便你的游戏在运行时更改键值映射！
zh_tw: 但是，使用所提供的 :ref:`InputMap <class_InputMap>` 功能更簡潔靈活，它允許您定義輸入操作並分配不同的鍵。這樣，您可以定義多個鍵的相同動作，例如鍵盤ESC鍵和遊戲手柄上的啟動按鈕。然後，你可以在不更新程式碼的情況下輕鬆更改專案設定中的此對應，甚至在上面建構鍵對應功能，以便您的遊戲在運作時更改鍵值對應！

source: You can set up your InputMap under **Project > Project Settings > Input Map** and then use those actions like this:
de: Sie können Ihre InputMap unter **Projekt > Projekt Einstellungen > Eingabe-Zuordnung** einrichten und dann die folgenden Aktionen ausführen:
zh_cn: 你可以在\ **项目 > 项目设置 > 按键映射**\ 下设置你的输入映射，这些动作的使用方法如下：
zh_tw: 您可以在**專案 > 專案設定 > 按鍵對應**下設定您的輸入對應，這些動作的使用方法如下：

source: How does it work?
de: Wie funktioniert es?
zh_cn: 工作原理是怎样的？
zh_tw: 工作原理是怎樣的？

source: Every input event is originated from the user/player (though it's possible to generate an InputEvent and feed them back to the engine, which is useful for gestures). The DisplayServer for each platform will read events from the operating system, then feed them to the root :ref:`Window <class_Window>`.
de: Jedes Eingabeereignis geht vom Benutzer/Spieler aus (obwohl es möglich ist, ein InputEvent zu generieren und es an die Engine zurückzugeben, was für Gesten nützlich ist). Der DisplayServer für jede Plattform liest Ereignisse vom Betriebssystem und leitet sie dann an das Root-:ref:`Fenster <class_Window>` weiter.
zh_cn: 每个输入事件都来源于用户/玩家（虽然也可以自己生成 InputEvent 并提供给引擎，多用于手势）。各个平台的 DisplayServer 都会从操作系统读取事件，然后提供给根 :ref:`Window <class_Window>`\ 。
zh_tw: 每個輸入事件都來源於使用者/玩家（雖然也可以自己生成 InputEvent 並提供給引擎，多用於手勢）。各個平臺的 DisplayServer 都會從作業系統讀取事件，然後提供給根 :ref:`Window <class_Window>`。

source: The window's :ref:`Viewport <class_Viewport>` does quite a lot of stuff with the received input, in order:
de: Der :ref:`Viewport <class_Viewport>` des Fensters macht eine ganze Menge Dinge mit den empfangenen Eingaben, der Reihe nach:
zh_cn: 窗口的 :ref:`Viewport <class_Viewport>` 会对收到的输入进行很多处理，依次为：
zh_tw: 視窗的 :ref:`Viewport <class_Viewport>` 會對收到的輸入進行很多處理，依次為：

source: If the Viewport is embedding Windows, the Viewport tries to interpret the event in its capability as a Window-Manager (e.g. for resizing or moving Windows).
de: Wenn das Viewport Fenster einbettet, versucht das Viewport das Event in seiner Funktion als Window-Manager zu interpretieren (z.B. für Größenänderung oder Verschieben von Fenstern).
zh_cn: 如果该 Viewport 内嵌了 Window，则该 Viewport 会尝试以窗口管理器的身份解释事件（例如对 Window 进行大小调整和移动）。
zh_tw: 如果該 Viewport 內嵌了 Window，則該 Viewport 會嘗試以視窗管理器的身份解釋事件（例如對 Window 進行大小調整和移動）。

source: Next if an embedded Window is focused, the event is sent to that Window and processed in the Windows Viewport and afterwards treated as handled. If no embedded Window is focused, the event is sent to the nodes of the current viewport in the following order.
de: Wenn ein eingebettetes Fenster fokussiert ist, wird das Event an dieses Fenster gesendet, im Fenster-Viewport verarbeitet und anschließend als behandelt betrachtet. Wenn kein eingebettetes Fenster fokussiert ist, wird das Event an die Nodes des aktuellen Viewports in der folgenden Reihenfolge gesendet.
zh_cn: 接下来，如果存在聚焦的内嵌 Window，则会将事件发送给该 Window，在该窗口的 Viewport 中进行处理，然后将事件标记为已处理。如果不存在聚焦的内嵌 Window，则会将事件发送给当前视口中的节点，顺序如下。
zh_tw: 接下來，如果存在聚焦的內嵌 Window，則會將事件發送給該 Window，在該視窗的 Viewport 中進行處理，然後將事件標記為已處理。如果不存在聚焦的內嵌 Window，則會將事件發送給目前視口中的節點，順序如下。

source: First of all, the standard :ref:`Node._input() <class_Node_private_method__input>` function will be called in any node that overrides it (and hasn't disabled input processing with :ref:`Node.set_process_input() <class_Node_method_set_process_input>`). If any function consumes the event, it can call :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`, and the event will not spread any more. This ensures that you can filter all events of interest, even before the GUI. For gameplay input, :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` is generally a better fit, because it allows the GUI to intercept the events.
de: Zunächst einmal wird die Standardfunktion :ref:`Node._input() <class_Node_private_method__input>` in jedem Node aufgerufen, der sie überschreibt (und die Eingabeverarbeitung nicht mit :ref:`Node.set_process_input() <class_Node_method_set_process_input>` deaktiviert hat). Wenn eine Funktion das Ereignis konsumiert, kann sie :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>` aufrufen, und das Ereignis wird nicht mehr verbreitet. Dies stellt sicher, dass Sie alle Ereignisse von Interesse filtern können, sogar vor der GUI. Für Gameplay-Eingaben ist :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` im Allgemeinen besser geeignet, weil es der GUI erlaubt, die Ereignisse abzufangen.
zh_cn: 首先会调用标准的 :ref:`Node._input() <class_Node_private_method__input>` 函数，调用只会发生在覆盖了这个函数（并且没有通过 :ref:`Node.set_process_input() <class_Node_method_set_process_input>` 禁用）的节点上。如果某个函数消耗了该事件，就可以调用 :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`\ ，事件就不会再继续传播。这样就保证了你可以在 GUI 之前过滤自己感兴趣的事件。对于游戏输入，\ :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` 通常更合适，因为这个函数能够让 GUI 拦截事件。

source: Second, it will try to feed the input to the GUI, and see if any control can receive it. If so, the :ref:`Control <class_Control>` will be called via the virtual function :ref:`Control._gui_input() <class_Control_private_method__gui_input>` and the signal "gui_input" will be emitted (this function is re-implementable by script by inheriting from it). If the control wants to "consume" the event, it will call :ref:`Control.accept_event() <class_Control_method_accept_event>` and the event will not spread any more. Use the :ref:`Control.mouse_filter <class_Control_property_mouse_filter>` property to control whether a :ref:`Control <class_Control>` is notified of mouse events via :ref:`Control._gui_input() <class_Control_private_method__gui_input>` callback, and whether these events are propagated further.
de: Zweitens wird versucht, die Eingabe an die GUI weiterzuleiten und zu sehen, ob irgendein Control sie empfangen kann. Wenn ja, wird das :ref:`Control <class_Control>` über die virtuelle Funktion :ref:`Control._gui_input() <class_Control_private_method__gui_input>` aufgerufen und das Signal "gui_input" wird ausgesendet (diese Funktion kann von Skripten durch Vererbung neu implementiert werden). Wenn das Control das Event "konsumieren" will, ruft es :ref:`Control.accept_event() <class_Control_method_accept_event>` auf und das Event wird nicht mehr verbreitet. Mit der Property :ref:`Control.mouse_filter <class_Control_property_mouse_filter>` können Sie steuern, ob ein :ref:`Control <class_Control>` über Mausereignisse per :ref:`Control._gui_input() <class_Control_private_method__gui_input>`-Callback benachrichtigt wird und ob diese Ereignisse weiter verbreitet werden.
zh_cn: 然后，它会尝试将输入提供给 GUI，并查看是否有任何控件可以接收它。如果有，\ :ref:`Control <class_Control>` 将通过虚函数 :ref:`Control._gui_input() <class_Control_private_method__gui_input>` 被调用并发出“gui_input”信号（此函数可通过继承它的脚本重新实现）。如果控件想“消耗”该事件，它将调用 :ref:`Control.accept_event() <class_Control_method_accept_event>` 阻止事件的传播。请使用 :ref:`Control.mouse_filter <class_Control_property_mouse_filter>` 属性来控制 :ref:`Control <class_Control>` 是否通过 :ref:`Control._gui_input() <class_Control_private_method__gui_input>` 回调接收鼠标事件的通知，以及是否进一步传播这些事件。

source: If so far no one consumed the event, the :ref:`Node._shortcut_input() <class_Node_private_method__shortcut_input>` callback will be called if overridden (and not disabled with :ref:`Node.set_process_shortcut_input() <class_Node_method_set_process_shortcut_input>`). This happens only for :ref:`InputEventKey <class_InputEventKey>`, :ref:`InputEventShortcut <class_InputEventShortcut>` and :ref:`InputEventJoypadButton <class_InputEventJoypadButton>`. If any function consumes the event, it can call :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`, and the event will not spread any more. The shortcut input callback is ideal for treating events that are intended as shortcuts.
de: Wenn bisher niemand das Event konsumiert hat, wird der :ref:`Node._shortcut_input() <class_Node_private_method__shortcut_input>`-Callback aufgerufen, falls überschrieben (und nicht mit :ref:`Node.set_process_shortcut_input() <class_Node_method_set_process_shortcut_input>` deaktiviert). Dies geschieht nur für :ref:`InputEventKey <class_InputEventKey>`, :ref:`InputEventShortcut <class_InputEventShortcut>` und :ref:`InputEventJoypadButton <class_InputEventJoypadButton>`. Wenn eine Funktion das Event konsumiert, kann sie :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>` aufrufen, und das Event wird nicht mehr verbreitet. Der Tastenkürzel-Input-Callback ist ideal für die Behandlung von Ereignissen, die als Tastenkürzel gedacht sind.
zh_cn: 如果事件到目前为止还没有被消耗，并且覆盖了 :ref:`Node._shortcut_input() <class_Node_private_method__shortcut_input>` 函数（并且没有通过 :ref:`Node.set_process_shortcut_input() <class_Node_method_set_process_shortcut_input>` 禁用），那么就会调用这个回调。只有 :ref:`InputEventKey <class_InputEventKey>`\ 、\ :ref:`InputEventShortcut <class_InputEventShortcut>` 和 :ref:`InputEventJoypadButton <class_InputEventJoypadButton>` 才有这一步。如果某个函数消耗了该事件，就可以调用 :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`\ ，事件就不会再继续传播。快捷键输入回调主要用于处理快捷键相关的事件。

source: If so far no one consumed the event, the :ref:`Node._unhandled_key_input() <class_Node_private_method__unhandled_key_input>` callback will be called if overridden (and not disabled with :ref:`Node.set_process_unhandled_key_input() <class_Node_method_set_process_unhandled_key_input>`). This happens only if the event is a :ref:`InputEventKey <class_InputEventKey>`. If any function consumes the event, it can call :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`, and the event will not spread any more. The unhandled key input callback is ideal for key events.
de: Wenn bisher niemand das Event konsumiert hat, wird der :ref:`Node._unhandled_key_input() <class_Node_private_method__unhandled_key_input>`-Callback aufgerufen, falls überschrieben (und nicht mit :ref:`Node.set_process_unhandled_key_input() <class_Node_method_set_process_unhandled_key_input>` deaktiviert). Dies geschieht nur, wenn das Event ein :ref:`InputEventKey <class_InputEventKey>` ist. Wenn eine Funktion das Event konsumiert, kann sie :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>` aufrufen, und das Event wird nicht mehr verbreitet. Der Callback für unbehandelte Tasteneingaben ist ideal für Tasten-Events.
zh_cn: 如果事件到目前为止还没有被消耗，并且覆盖了 :ref:`Node._unhandled_key_input() <class_Node_private_method__unhandled_key_input>` 函数（并且没有通过 :ref:`Node.set_process_unhandled_key_input() <class_Node_method_set_process_unhandled_key_input>` 禁用），那么就会调用这个回调。只有 :ref:`InputEventKey <class_InputEventKey>` 才有这一步。如果某个函数消耗了该事件，就可以调用 :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`\ ，事件就不会再继续传播。未处理按键输入回调主要用于处理按键相关的事件。

source: If so far no one consumed the event, the :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` callback will be called if overridden (and not disabled with :ref:`Node.set_process_unhandled_input() <class_Node_method_set_process_unhandled_input>`). If any function consumes the event, it can call :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`, and the event will not spread any more. The unhandled input callback is ideal for full-screen gameplay events, so they are not received when a GUI is active.
de: Wenn bisher niemand das Event konsumiert hat, wird der :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>`-Callback aufgerufen, wenn er überschrieben ist (und nicht mit :ref:`Node.set_process_unhandled_input() <class_Node_method_set_process_unhandled_input>` deaktiviert wurde). Wenn eine Funktion das Event konsumiert, kann sie :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>` aufrufen, und das Event wird nicht mehr weitergegeben. Der unbehandelte Eingabe-Callback ist ideal für Vollbild-Gameplay-Ereignisse, damit sie nicht empfangen werden, wenn eine GUI aktiv ist.
zh_cn: 如果事件到目前为止还没有被消耗，并且覆盖了 :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` 函数（并且没有通过 :ref:`Node.set_process_unhandled_input() <class_Node_method_set_process_unhandled_input>` 禁用），那么就会调用这个回调。如果某个函数消耗了该事件，就可以调用 :ref:`Viewport.set_input_as_handled() <class_Viewport_method_set_input_as_handled>`\ ，事件就不会再继续传播。未处理输入回调主要用于处理全屏游戏事件，GUI 处于活动状态时不会收到。

source: When sending events to its child and descendant nodes, the viewport will do so, as depicted in the following graphic, in a reverse depth-first order, starting with the node at the bottom of the scene tree, and ending at the root node. Excluded from this process are Windows and SubViewports.
de: Wenn der Viewport Events an seine Child- und darunter liegenden Nodes sendet, geschieht dies, wie in der folgenden Grafik dargestellt, in umgekehrter Reihenfolge, beginnend mit dem Node am unteren Ende des Szenenbaums und endend mit dem Root Node. Ausgenommen von diesem Prozess sind Fenster und SubViewports.
zh_cn: 视口会向子孙节点发送事件，如下图所示，发送时会按照逆深度优先顺序进行，从场景树最底部的节点开始，到根节点结束。这个过程中会跳过 Window 和 SubViewport。
zh_tw: 將事件發送到場景中的所有偵聽節點時, 視口將以反向深度優先循序執行: 從場景樹底部的節點開始, 到根節點結束。

source: This order doesn't apply to :ref:`Control._gui_input() <class_Control_private_method__gui_input>`, which uses a different method based on event location or focused Control.
de: Diese Reihenfolge gilt nicht für :ref:`Control._gui_input() <class_Control_private_method__gui_input>`, die je nach Event-Ort oder fokussiertem Control eine andere Methode verwendet.
zh_cn: 这个顺序并不适用于 :ref:`Control._gui_input() <class_Control_private_method__gui_input>`\ ，这个函数的调用顺序与事件的位置和聚焦的 Control 有关，使用的是不同的方法。

source: Since Viewports don't send events to other :ref:`SubViewports <class_SubViewport>`, one of the following methods has to be used:
de: Da die Viewports keine Events an andere :ref:`SubViewports <class_SubViewport>` senden, muss eine der folgenden Methoden verwendet werden:
zh_cn: 由于 Viewport 不会将事件发送给其他 :ref:`SubViewport <class_SubViewport>`\ ，所以需要在下列方法中选择一个：
zh_tw: 由於視窗不會將事件傳送到其他 SubViewports <class_SubViewport>`，因此必須使用下列方法之一：

source: Use a :ref:`SubViewportContainer <class_SubViewportContainer>`, which automatically sends events to its child :ref:`SubViewports <class_SubViewport>` after :ref:`Node._input() <class_Node_private_method__input>` or :ref:`Control._gui_input() <class_Control_private_method__gui_input>`.
de: Verwenden Sie einen :ref:`SubViewportContainer <class_SubViewportContainer>`, der automatisch Events an seine untergeordneten :ref:`SubViewports <class_SubViewport>` nach :ref:`Node._input() <class_Node_private_method__input>` oder :ref:`Control._gui_input() <class_Control_private_method__gui_input>` sendet.
zh_cn: 使用 :ref:`SubViewportContainer <class_SubViewportContainer>`\ ，这个节点会在 :ref:`Node._input() <class_Node_private_method__input>` 或 :ref:`Control._gui_input() <class_Control_private_method__gui_input>` 之后，自动将事件发送给子级 :ref:`SubViewport <class_SubViewport>`\ 。

source: Implement event propagation based on the individual requirements.
de: Implementierung der Event-Propagation auf der Grundlage der individuellen Anforderungen.
zh_cn: 根据具体需求实现事件传播逻辑。
zh_tw: 根據個人需求實作事件傳播。

source: GUI events also travel up the scene tree but, since these events target specific Controls, only direct ancestors of the targeted Control node receive the event.
de: GUI-Events werden auch im Szenenbaum angezeigt. Da diese Events jedoch auf bestimmte Controls abzielen, erhalten nur direkte Vorfahren des als Ziel gesetzten Control-Nodes das Event.
zh_cn: GUI 事件也会沿着场景树向上传播，但由于这些事件针对的是特定的 Control，所以只有目标 Control 节点的直接父节点才会收到该事件。
zh_tw: GUI事件也在場景樹上傳播，但由於這些事件針對的是特定的控制項，所以只有目標控制項節點的第一個父節點才會收到該事件。

source: In accordance with Godot's node-based design, this enables specialized child nodes to handle and consume particular events, while their ancestors, and ultimately the scene root, can provide more generalized behavior if needed.
de: In Übereinstimmung mit dem Node-basierten Design von Godot können spezialisierte Child-Nodes bestimmte Events verarbeiten, während ihre Vorfahren und letztendlich der Szenen-Root bei Bedarf ein allgemeineres Verhalten liefern können.
zh_cn: 根据Godot基于节点的设计, 这使得专门的子节点能够处理和消费特定的事件, 而它们的父级节点, 以及最终的场景根节点, 可以在需要时提供更通用的行为.
zh_tw: 根據Godot基於節點的設計, 這使得專門的子節點能夠處理和消費特定的事件, 而它們的父級節點, 以及最終的場景根節點, 可以在需要時提供更通用的行為.

source: Anatomy of an InputEvent
de: Anatomie eines InputEvents
zh_cn: InputEvent 剖析
zh_tw: InputEvent 剖析

source: :ref:`InputEvent <class_InputEvent>` is just a base built-in type, it does not represent anything and only contains some basic information, such as event ID (which is increased for each event), device index, etc.
de: :ref:`InputEvent <class_InputEvent>` ist nur ein Built-in-Basistyp, stellt nichts dar und enthält nur einige grundlegende Informationen wie die Event-ID (die für jedes Event erhöht wird), den Geräteindex usw.
zh_cn: :ref:`InputEvent <class_InputEvent>` 只是一个基本的内置类型, 它不代表任何东西, 只包含一些基本信息, 如事件ID(每个事件增加), 设备索引等.
zh_tw: :ref:`InputEvent <class_InputEvent>` 只是一個基本的內建型別, 它不代表任何東西, 只包含一些基本資訊, 如事件ID(每個事件增加), 裝置索引等.

source: There are several specialized types of InputEvent, described in the table below:
de: Es gibt verschiedene spezielle Arten von Eingabe-Events, die in der folgenden Tabelle beschrieben werden:
zh_cn: InputEvent有几种专门的类型, 如下表所述:
zh_tw: InputEvent有幾種專門的型別, 如下表所述:

source: Description
de: Beschreibung
zh_cn: 描述
zh_tw: 說明

source: Empty Input Event.
de: Leeres Eingabe-Event.
zh_cn: 空输入事件.
zh_tw: 空輸入事件.

source: Contains a keycode and Unicode value, as well as modifiers.
de: Enthält einen Tasten-Code und einen Unicode-Wert sowie Modifikatoren.
zh_tw: 包含一個鍵盤掃描碼和Unicode值, 以及修飾鍵.

source: Contains click information, such as button, modifiers, etc.
de: Enthält Klickinformationen, z. B. Button, Modifikatoren usw.
zh_cn: 包含点击信息, 例如按钮, 修饰键等.
zh_tw: 包含點擊資訊, 例如按鈕, 修飾鍵等.

source: Contains motion information, such as relative and absolute positions and speed.
de: Enthält Bewegungsinformationen, wie z.B. relative und absolute Positionen und Geschwindigkeit.
zh_tw: 包含運動資訊, 例如相對位置, 絕對位置和速度.

source: Contains Joystick/Joypad analog axis information.
de: Enthält Informationen zu den analogen Joystick/Joypad-Achsen.
zh_cn: 包含操纵杆/ Joypad模拟轴信息.
zh_tw: 包含操縱桿/ Joypad類比軸資訊.

source: Contains Joystick/Joypad button information.
de: Enthält Informationen zu Joystick-/Joypad-Buttons.
zh_cn: 包含操纵杆/ Joypad按钮信息.
zh_tw: 包含操縱桿/ Joypad按鈕資訊.

source: Contains multi-touch press/release information. (only available on mobile devices)
de: Enthält Multi-Touch-Informationen für Drücken/Loslassen. (nur auf Mobilgeräten verfügbar)
zh_cn: 包含多点触控按下/释放信息. (仅适用于移动设备)
zh_tw: 包含多點觸控按下/釋放資訊. (僅適用於移動裝置)

source: Contains multi-touch drag information. (only available on mobile devices)
de: Enthält Informationen zum Multi-Touch-Ziehen (nur auf Mobilgeräten verfügbar)
zh_cn: 包含多点触控拖动信息. (仅适用于移动设备)
zh_tw: 包含多點觸控拖動資訊. (僅適用於移動裝置)

source: Contains a position, a factor as well as modifiers.
de: Enthält eine Position, einen Faktor sowie Modifikatoren.
zh_tw: 包含一個鍵盤掃描碼和Unicode值, 以及修飾鍵.

source: Contains a position, a delta as well as modifiers.
de: Enthält eine Position, ein Delta sowie Modifikatoren.
zh_tw: 包含一個鍵盤掃描碼和Unicode值, 以及修飾鍵.

source: Contains MIDI-related information.
de: Enthält MIDI-bezogene Informationen.
zh_tw: 包含操縱桿/ Joypad按鈕資訊.

source: Contains a shortcut.
de: Enthält ein Tastenkürzel.
zh_cn: 容器布局。
zh_tw: 容器佈局。

source: Contains a generic action. These events are often generated by the programmer as feedback. (more on this below)
de: Enthält eine generische Aktion. Diese Events werden häufig vom Programmierer als Feedback generiert. (mehr dazu weiter unten)
zh_cn: 包含一般动作. 这些事件通常由程序员作为反馈生成. (以下更多内容)
zh_tw: 包含一般動作. 這些事件通常由程式師作為回饋生成. (以下更多內容)

source: Actions
de: Aktionen
zh_cn: 动作
zh_tw: 動作

source: Actions are a grouping of zero or more InputEvents into a commonly understood title (for example, the default "ui_left" action grouping both joypad-left input and a keyboard's left arrow key). They are not required to represent an InputEvent but are useful because they abstract various inputs when programming the game logic.
de: Aktionen sind eine Gruppierung von null oder mehr InputEvents zu einem allgemein verständlichen Titel (z.B. die Default-Aktion "ui_left", die sowohl die Joypad-Links-Eingabe als auch die linke Pfeiltaste der Tastatur gruppiert). Sie sind nicht erforderlich, um ein InputEvent darzustellen, sind aber nützlich, weil sie verschiedene Eingaben bei der Programmierung der Spiellogik abstrahieren.
zh_tw: 動作是將零個或多個輸入事件群組為通常理解的標題（例如，預設的「ui_left」動作將手柄左輸入和鍵盤左箭頭鍵群組）。它們不需要表示輸入事件，但很有用，因為它們在編寫遊戲邏輯時抽象化了各種輸入。

source: This allows for:
de: Dies ermöglicht:
zh_tw: 這樣的做法有許多優點：
