Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/inputevent.po
Languages: de, zh_cn, zh_tw

source: The same code to work on different devices with different inputs (e.g., keyboard on PC, Joypad on console).
de: Derselbe Code funktioniert für verschiedene Geräte mit unterschiedlichen Eingaben (z.B. Tastatur auf dem PC, Joypad auf Konsolen).
zh_cn: 相同的代码可以在具有不同输入的不同设备上工作(例如,PC上的键盘, 控制台上的Joypad).
zh_tw: 相同的程式碼可以在具有不同輸入的不同裝置上工作(例如,PC上的鍵盤, 控制台上的Joypad).

source: Input to be reconfigured at run-time.
de: Eingaben, die zur Laufzeit neu konfiguriert werden sollen.
zh_cn: 输入要在运行时重新配置.
zh_tw: 輸入要在運作時重新配置.

source: Actions to be triggered programmatically at run-time.
de: Aktionen, die zur Laufzeit programmatisch ausgelöst werden sollen.
zh_tw: 輸入要在運作時重新配置.

source: Actions can be created from the Project Settings menu in the **Input Map** tab and assigned input events.
de: Aktionen können über das Menü Projekteinstellungen auf dem Tab **Eingabe-Zuordnung** erstellt und Eingabe-Events zugewiesen werden.
zh_tw: 動作可以在“專案設定”功能表的“動作”分頁中建立。

source: Any event has the methods :ref:`InputEvent.is_action() <class_InputEvent_method_is_action>`, :ref:`InputEvent.is_pressed() <class_InputEvent_method_is_pressed>` and :ref:`InputEvent <class_InputEvent>`.
de: Jedes Event hat die Methoden :ref:`InputEvent.is_action() <class_InputEvent_method_is_action>`, :ref:`InputEvent.is_pressed() <class_InputEvent_method_is_pressed>` und :ref:`InputEvent <class_InputEvent>`.
zh_cn: 任何事件都有方法 :ref:`InputEvent.is_action() <class_InputEvent_method_is_action>`, :ref:`InputEvent.is_pressed() <class_InputEvent_method_is_pressed>` and :ref:`InputEvent <class_InputEvent>`.
zh_tw: 任何事件都有方法 :ref:`InputEvent.is_action() <class_InputEvent_method_is_action>`, :ref:`InputEvent.is_pressed() <class_InputEvent_method_is_pressed>` and :ref:`InputEvent <class_InputEvent>`.

source: Alternatively, it may be desired to supply the game back with an action from the game code (a good example of this is detecting gestures). The Input singleton has a method for this: :ref:`Input.parse_input_event() <class_input_method_parse_input_event>`. You would normally use it like this:
de: Alternativ kann es gewünscht sein, dem Spiel eine Aktion aus dem Spielcode zurückzuliefern (ein gutes Beispiel dafür ist die Erkennung von Gesten). Das Input-Singleton hat eine Methode dafür: :ref:`Input.parse_input_event() <class_input_method_parse_input_event>`. Normalerweise würden Sie sie wie folgt verwenden:
zh_cn: 或者, 可能希望从游戏代码中向游戏提供一个动作, 一个很好的例子是检测手势.Input单例有一个方法来实现这个功能 :ref:`Input.parse_input_event() <class_input_method_parse_input_event>` . 通常这样使用它:
zh_tw: 或者, 可能希望從遊戲程式碼中向遊戲提供一個動作, 一個很好的例子是偵測手勢.Input單例有一個方法來實作這個功能 :ref:`Input.parse_input_event() <class_input_method_parse_input_event>` . 通常這樣使用它:

source: Customizing and re-mapping input from code is often desired. If your whole workflow depends on actions, the :ref:`InputMap <class_InputMap>` singleton is ideal for reassigning or creating different actions at run-time. This singleton is not saved (must be modified manually) and its state is run from the project settings (project.godot). So any dynamic system of this type needs to store settings in the way the programmer best sees fit.
de: Die Anpassung und Neuzuordnung von Eingaben aus dem Code ist oft gewünscht. Wenn Ihr gesamter Workflow von Aktionen abhängt, ist das Singleton :ref:`InputMap <class_InputMap>` ideal für die Neuzuweisung oder Erstellung verschiedener Aktionen zur Laufzeit. Dieses Singleton wird nicht gespeichert (es muss manuell geändert werden) und sein Zustand wird über die Projekteinstellungen (project.godot) gesteuert. Daher muss jedes dynamische System dieser Art die Einstellungen so speichern, wie es der Programmierer für richtig hält.
zh_cn: 经常需要的从代码中定制和重新映射输入. 如果你的整个运行流程依赖于动作, 那么 :ref:`InputMap <class_InputMap>` 单例是在运行时重新分配或创建不同动作的理想选择. 这个单例不被保存(必须手动修改), 其状态从项目设置进行(project.godot). 所以任何这种类型的动态系统, 都需要以程序员认为最合适的方式来存储设置.
zh_tw: 經常需要的從程式碼中定制和重新對應輸入. 如果你的整個運作流程依賴於動作, 那麼 :ref:`InputMap <class_InputMap>` 單例是在運作時重新分配或建立不同動作的理想選擇. 這個單例不被保存(必須手動修改), 其狀態從專案設定進行(project.godot). 所以任何這種型別的動態系統, 都需要以程式師認為最合適的方式來儲存設定.

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: Event
zh_cn: 事件
zh_tw: 事件

source: :ref:`InputEventMagnifyGesture <class_InputEventMagnifyGesture>`
zh_tw: :ref:`InputEvent <class_InputEvent>`

source: :ref:`InputEventPanGesture <class_InputEventPanGesture>`
zh_tw: :ref:`InputEvent <class_InputEvent>`

source: :ref:`InputEventMIDI <class_InputEventMIDI>`
zh_tw: :ref:`int <class_int>`

source: :ref:`InputEventShortcut <class_InputEventShortcut>`
zh_tw: :ref:`InputEvent <class_InputEvent>`
