Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/mouse_and_input_coordinates.po
Languages: de

source: Mouse and input coordinates
de: Maus- und Eingabe-Koordinaten

source: About
de: Über

source: The reason for this small tutorial is to clear up many common mistakes about input coordinates, obtaining mouse position and screen resolution, etc.
de: Das Ziel dieses kleinen Tutorial ist es, viele häufige Irrtümer über Eingabekoordinaten, Mausposition und Bildschirmauflösung etc. auszuräumen.

source: Hardware display coordinates
de: Hardware-Anzeigekoordinaten

source: Using hardware coordinates makes sense in the case of writing complex UIs meant to run on PC, such as editors, MMOs, tools, etc. However, it does not make as much sense outside of that scope.
de: Die Verwendung von Hardwarekoordinaten ist sinnvoll, wenn komplexe Benutzeroberflächen geschrieben und auf einem PC ausgeführt werden sollen, z.B. Editoren, MMOs, Tools usw. Außerhalb dieses Anwendungsbereichs ist dies jedoch weniger sinnvoll.

source: Viewport display coordinates
de: Anzeigekoordinaten des Viewports

source: Godot uses viewports to display content, and viewports can be scaled by several options (see :ref:`doc_multiple_resolutions` tutorial). Use, then, the functions in nodes to obtain the mouse coordinates and viewport size, for example:
de: Godot verwendet Viewports zum Anzeigen von Inhalten, und diese können durch verschiedene Optionen skaliert werden (siehe :ref:`doc_multiple_resolutions`). Verwenden Sie dann die Funktionen im Node, um die Mauskoordinaten und die Größe des Viewports zu erhalten, zum Beispiel:

source: Alternatively, it's possible to ask the viewport for the mouse position:
de: Alternativ können Sie den Viewport nach der Mausposition fragen:

source: When the mouse mode is set to ``Input.MOUSE_MODE_CAPTURED``, the ``event.position`` value from ``InputEventMouseMotion`` is the center of the screen. Use ``event.relative`` instead of ``event.position`` and ``event.velocity`` to process mouse movement and position changes.
de: Wenn der Mausmodus auf ``Input.MOUSE_MODE_CAPTURED`` gesetzt ist, ist der ``event.position``-Wert von ``InputEventMouseMotion`` die Mitte des Bildschirms. Verwenden Sie ``event.relative`` anstelle von ``event.position`` und ``event.velocity``, um Mausbewegungen und Positionsänderungen zu verarbeiten.

source: Translation status
de: Übersetzungsstatus
