Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/submitting_to_assetlib.po
Languages: de, zh_tw

source: Submitting to the Asset Library
de: Übermittlung an die Asset-Bibliothek
zh_tw: 提交資源到素材庫

source: Introduction
de: Einführung
zh_tw: 前言

source: This tutorial aims to serve as a guide on how you can submit your own assets to the `Godot Asset Library <https://godotengine.org/asset-library/asset>`_ and share them with the Godot community.
de: Dieses Tutorial soll als Anleitung dienen, wie Sie Ihre eigenen Assets in die `Godot Asset-Bibliothek <https://godotengine.org/asset-library/asset>`_ einbringen und mit der Godot-Community teilen können.
zh_tw: 本教學旨在指導你如何向 `Godot 素材庫 <https://godotengine.org/asset-library/asset>`_提交自己的素材並與 Godot 社區分享。

source: As mentioned in the :ref:`doc_using_assetlib` document, in order to be able to submit assets to the AssetLib, you need to have a registered account, and be logged in.
de: Wie im Dokument :ref:`doc_using_assetlib` erwähnt, müssen Sie über ein registriertes Konto verfügen und angemeldet sein, um Assets an die AssetLib senden zu können.
zh_tw: 正如 :ref:`doc_using_assetlib` 文件中提到的, 為了能夠向AssetLib提交資源, 您需要有一個註冊的帳戶, 並且需要登錄.

source: Submission guidelines
de: Einsenderichtlinien
zh_tw: 提交規範

source: Before submitting your asset, please ensure it follows all of the requirements, and also consider following the recommendations.
de: Vergewissern Sie sich vor der Einreichung Ihres Assets, dass sie alle Anforderungen erfüllt, und beachten Sie auch die Empfehlungen.
zh_tw: 在提交您的資源之前, 請確保您的資源符合所有要求, 並考慮遵循規範建議.

source: Requirements
de: Anforderungen
zh_tw: 系統需求

source: Generally speaking, most assets people submit to the asset library are accepted. However, in order for your asset to be accepted, there are a few requirements your asset needs to meet to be approved.
de: Im Allgemeinen werden die meisten Assets, die an die Asset-Bibliothek übermittelt werden, akzeptiert. Damit Ihr Asset akzeptiert wird, muss es jedoch einige Voraussetzungen erfüllen.
zh_tw: 一般來說, 人們提交給資源庫的大部分資源都會被接受. 然而, 為了使您的資源被接受, 資源需要滿足一些要求才能被批准.

source: The asset must **work**. If the asset doesn't run or otherwise doesn't work in the specified Godot version, then it will be rejected.
de: Das Asset muss **funktionieren**. Wenn das Asset nicht läuft oder anderweitig nicht in der angegebenen Godot-Version funktioniert, wird es abgelehnt.
zh_tw: 素材必須是**有效的**。如果該素材無法工作或在指定的 Godot 版本中不能工作，那麼它將被拒絕。

source: The asset must have a proper **.gitignore** file. It's important to keep redundant data out of the repository. `Here's a template. <https://raw.githubusercontent.com/aaronfranke/gitignore/godot/Godot.gitignore>`_
de: Das Asset muss eine geeignete **.gitignore**-Datei haben. Es ist wichtig, redundante Daten aus dem Repository herauszuhalten. `Hier ist eine Vorlage. <https://raw.githubusercontent.com/aaronfranke/gitignore/godot/Godot.gitignore>`_
zh_tw: 該素材必須擁有合適的 **.gitignore** 檔案。把多餘的資料從版本庫中剔除是很重要的。`這裡有一個範本。 <https://raw.githubusercontent.com/aaronfranke/gitignore/godot/Godot.gitignore>`_

source: No **submodules**, or any submodules must be non-essential. GitHub does not include submodules in the downloaded ZIP file, so if the asset needs the contents of the submodule, your asset won't work.
de: Keine **Submodule**, oder alle Submodule müssen optional sein. GitHub nimmt keine Submodule in die heruntergeladene ZIP-Datei auf. Wenn das Asset also den Inhalt des Submoduls benötigt, wird Ihr Asset nicht funktionieren.
zh_tw: 不使用**子模組**，或者所有子模組都必須是非必要的。GitHub 下載的 ZIP 檔中不包括子模組，所以如果你的素材需要用到子模組中的內容，將無法使用。

source: The **license** needs to be correct. The license listed on the asset library must match the license in the repository. The repo MUST have a license file, called either "LICENSE" or "LICENSE.md". This file must contain the license text itself and a copyright statement that includes the year(s) and copyright holder.
de: Die **Lizenz** muss korrekt sein. Die in der Asset-Bibliothek angegebene Lizenz muss mit der Lizenz im Repository übereinstimmen. Das Repository MUSS eine Lizenzdatei enthalten, die entweder "LICENSE" oder "LICENSE.md" heißt. Diese Datei muss den eigentlichen Lizenztext und eine Urheberrechtserklärung enthalten, die das Jahr oder die Jahre und den Urheberrechtsinhaber angibt.
zh_tw: 許可證 **license** 需是正確。素材庫中列出的許可證必須與版本庫中的許可證一致。版本庫需要有一個授權檔案，稱為 "LICENSE" 或 "LICENSE.md" 。這個檔必須包含許可證文字本身和版權宣告，包括年份和版權所有者。

source: Use proper **English** for the name and description of your asset. This includes using correct capitalization, and using full sentences in the description. You can also include other languages, but there should at least be an English version.
de: Verwenden Sie korrektes **Englisch** für den Namen und die Beschreibung Ihres Assets. Dazu gehören die korrekte Groß- und Kleinschreibung und die Verwendung vollständiger Sätze in der Beschreibung. Sie können auch andere Sprachen angeben, aber es sollte zumindest eine englische Version geben.
zh_tw: 在你的素材名稱和描述中使用正確的**英語**。這包括使用正確的大寫字母，並在描述中使用完整的句子。你也可以包括其他語言，但至少應該有一個英文版本。

source: The icon link must be a **direct link**. For icons hosted on GitHub, the link must start with "raw.githubusercontent.com", not "github.com".
de: Der Link zum Icon muss ein **direkter Link** sein. Bei Icons, die auf GitHub gehostet werden, muss der Link mit "raw.githubusercontent.com" beginnen, nicht mit "github.com".
zh_tw: 圖示連結必須是一個 **direct link** 直接連結。對於託管在GitHub上的圖示，連結必須以 "raw.githubusercontent.com" 開頭，而不是 "github.com"。

source: Recommendations
de: Empfehlungen
zh_tw: 建議

source: These things are not required for your asset to be approved, but if you follow these recommendations, you can help make the asset library a better place for all users.
de: Diese Dinge sind nicht erforderlich, damit Ihr Asset genehmigt wird. Wenn Sie jedoch diese Empfehlungen befolgen, können Sie dazu beitragen, die Asset-Bibliothek für alle Benutzer zu einem besseren Ort zu machen.
zh_tw: 這些事情並不是你的資源被批准的必要條件, 但如果你遵循這些建議, 你可以幫助使資源庫成為所有使用者體驗更好的地方.

source: When creating non-project assets, it is common practice to place your files inside of an **addons/asset_name/** folder. Do this to avoid having your files clash with other assets, or with the files of users installing your asset. This folder will **not** be automatically generated when a user installs your asset.
de: Bei der Erstellung von projektfremden Assets ist es üblich, die Dateien in einem Ordner **addons/asset_name/** abzulegen. Damit vermeiden Sie, dass Ihre Dateien mit anderen Assets oder mit den Dateien von Benutzern, die Ihr Asset installieren, kollidieren. Dieser Ordner wird **nicht** automatisch erstellt, wenn ein Benutzer Ihr Asset installiert.
zh_tw: 建立非專案素材時，通常的做法是將檔放在 **addons/asset_name/** 資料夾中。這樣做可以避免您的檔與其他素材或安裝了您的素材的使用者檔發生衝突。當使用者安裝您的素材時，此資料夾 **不會** 自動生成。

source: Fix or suppress all script **warnings**. The warning system is there to help identify issues with your code, but people using your asset don't need to see them.
de: Beheben oder unterdrücken Sie alle Skript-**Warnungen**. Das Warnsystem ist dazu da, Probleme mit Ihrem Code zu erkennen, aber die Benutzer Ihres Assets sollten sie nicht sehen müssen.
zh_tw: 修復或禁止所有腳本**警告**。警告系統可説明識別您的程式碼問題，但使用您的素材的人不需要看到它們。

source: Make your code conform to the official **style guides**. Having a consistent style helps other people read your code, and it also helps if other people wish to contribute to your asset. See: the :ref:`doc_gdscript_styleguide` or the :ref:`doc_c_sharp_styleguide`.
de: Achten Sie darauf, dass Ihr Code den offiziellen **Style Guides** entspricht. Ein einheitlicher Stil hilft anderen Leuten, Ihren Code zu lesen, und er hilft auch, wenn andere Leute zu Ihrem Projekt beitragen wollen. Siehe: den :ref:`doc_gdscript_styleguide` oder den :ref:`doc_c_sharp_styleguide`.
zh_tw: 使你的程式碼符合官方的**風格指南**。有一致的風格有助於其他人閱讀你的程式碼，如果其他人希望為你的素材做貢獻，將會有幫助。請參閱 :ref:`doc_gdscript_styleguide` 或 :ref:`doc_c_sharp_styleguide`。

source: If you have screenshots in your repo, place them in their own subfolder and add an empty **.gdignore** file in the same folder (note: **gd**, not **git**). This prevents Godot from importing your screenshots. On Windows, open a command prompt in the project folder and run ``type nul > .gdignore`` to create a file whose name starts with a period.
de: Wenn Sie Screenshots in Ihrem Repo haben, legen Sie diese in einem eigenen Unterordner ab und fügen Sie eine leere **.gdignore**-Datei im selben Ordner hinzu (Hinweis: **gd**, nicht **git**). Dies verhindert, dass Godot Ihre Screenshots importiert. Unter Windows öffnen Sie eine Eingabeaufforderung im Projektordner und führen Sie ``type nul > .gdignore`` aus, um eine Datei zu erstellen, deren Name mit einem Punkt beginnt.
zh_tw: 如果倉庫中有截圖，把它們放在子資料夾裡，並在該資料夾裡新增一個 **.gdignore** 檔案（注意：是 **gd**，不是 **git**）。這樣可以防止 Godot 匯入截圖。在 Windows 上，在專案檔案夾中打開命令提示符，運作 ``type nul > .gdignore`` 來建立一個名字以點開頭的檔。

source: If your asset is a library for working with other files, consider including **example files** in the asset.
de: Wenn Ihr Asset eine Bibliothek für die Arbeit mit anderen Dateien ist, sollten Sie **Beispieldateien** in das Asset aufnehmen.
zh_tw: 如果您的素材是用於處理其他檔的庫，請考慮在素材中包含**範例檔**。

source: Consider adding a **.gitattributes** file to your repo. This file allows giving extra instructions to Git, such as specifying line endings and listing files not required for your asset to function with the ``export-ignore`` directive. This directive removes such files from the resulting ZIP file, preventing them from being downloaded by the asset library users. These are common examples of **.gitattributes**:
de: Erwägen Sie das Hinzufügen einer **.gitattributes** Datei zu Ihrem Repository. Diese Datei erlaubt es, Git zusätzliche Anweisungen zu geben, wie z.B. die Angabe von Zeilenenden und die Auflistung von Dateien, die für die Funktion Ihres Assets nicht benötigt werden, mit der Direktive ``export-ignore``. Diese Direktive entfernt solche Dateien aus der resultierenden ZIP-Datei und verhindert, dass sie von den Benutzern der Asset-Bibliothek heruntergeladen werden. Dies sind gängige Beispiele für **.gitattributes**:
zh_tw: 請考慮將 **.gitattributes** 檔案新增到你的倉庫中。該檔能夠向 Git 提供額外的指令，例如指定行結尾和列出素材不需要使用 ``export-ignore`` 指令運作的檔。該指令會從生成的 ZIP 檔中刪除此類檔，防止素材庫使用者下載到它們。以下是一些常見的 **.gitattributes** 範例：

source: Projects / Templates
de: Projekte / Vorlagen
zh_tw: 各專案定義的樣板

source: If you are submitting a plugin, add a **copy** of your license and readme to the plugin folder itself. This is the folder that users are guaranteed to keep with their project, so a copy ensures they always have those files handy (and helps them fulfill your licensing terms).
de: Wenn Sie ein Plugin einreichen, fügen Sie eine **Kopie** Ihrer Lizenz und der Readme-Datei in den Plugin-Ordner selbst ein. Dies ist der Ordner, den die Benutzer garantiert mit ihrem Projekt behalten werden. Eine Kopie stellt also sicher, dass sie diese Dateien immer griffbereit haben (und hilft ihnen, Ihre Lizenzbedingungen zu erfüllen).
zh_tw: 如果你要提交一個外掛程式，請將你的許可證和readme的 **copy** 新增到外掛程式資料夾本身。這是保證使用者與他們的專案一起保留的資料夾，副本確保他們始終可以方便地使用這些檔，並幫助他們履行你的許可條款。

source: While the asset library allows more than just GitHub, consider hosting your asset's source code on **GitHub**. Other services may not work reliably, and a lack of familiarity can be a barrier to contributors.
de: Auch wenn die Asset-Bibliothek mehr als nur GitHub zulässt, sollten Sie den Quellcode Ihres Assets auf **GitHub** hosten. Andere Dienste funktionieren möglicherweise nicht zuverlässig, und mangelnde Vertrautheit kann ein Hindernis für Mitwirkende sein.
zh_tw: 雖然素材庫允許的不僅僅是 GitHub，但考慮將素材的原始程式碼託管在 **GitHub**。其他服務可能無法可靠地工作，而且不熟悉可能會成為貢獻者的障礙。

source: Submitting
de: Einreichen
zh_tw: 提交

source: Once you are logged in, you will be able to head over to the "Submit Assets" page of the AssetLib, which will look like this:
de: Sobald Sie angemeldet sind, können Sie zur Seite "Assets Submit" der AssetLib wechseln, die folgendermaßen aussieht:
zh_tw: 一旦您登錄，您將能夠轉到 AssetLib 的“Submit Assets”（提交素材）頁面，該頁面如下所示：

source: While it may look like a lot (and there is more as you scroll down), each field is described in terms of what you should put in. We will nonetheless go over what is required in the submission form here as well.
de: Es sieht zwar nach viel aus (und es gibt noch mehr, wenn Sie nach unten scrollen), aber zu jedem Feld wird beschrieben, was Sie eingeben sollten. Wir werden jedoch auch hier auf das eingehen, was im Einreichungsformular erforderlich ist.
zh_tw: 雖然它可能看起來很多（並且向下滾動時會顯示更多），每個欄位都是根據您應該放入的內容進行描述的。但是，我們仍堅持在這裡將提交表單中所需的內容詳細闡述一遍。

source: The name of your asset. Should be a unique, descriptive title of what your asset is.
de: Der Name Ihres Assets. Es sollte ein eindeutiger, beschreibender Titel sein.
zh_tw: 您素材名稱。應該是您素材的特有描述性標題。

source: The category that your asset belongs to, and will be shown in search results. The category is split into **Addons** and **Projects**. In-editor, assets of the Project type (Templates, Demos, Projects) only show up when viewing the AssetLib from the Project Manager, while assets of the Addon type will only be visible from inside a project.
de: Die Kategorie, zu der Ihr Asset gehört und die in den Suchergebnissen angezeigt wird. Die Kategorie ist in **Addons** und **Projekte** unterteilt. Im Editor werden Assets des Projekttyps (Vorlagen, Demos, Projekte) nur angezeigt, wenn die AssetLib im Projektmanager angezeigt wird, während Assets des Addon-Typs nur innerhalb eines Projekts sichtbar sind.
zh_tw: 您的素材所屬的類別，將顯示在搜索結果中。該類別分為 **Addons**（外掛程式）和 **Projects**（專案）。在編輯器中，專案型別（範本、演示、專案）的素材將顯示在專案管理器的 AssetLib 中，而外掛程式型別的資源僅顯示在專案內部中。

source: The version of the engine that the asset works with. Currently, it's not possible to have a single asset entry contain downloads for multiple engine versions, so you may need to re-submit the asset multiple times, with an entry for each Godot version it supports. This is particularly important when dealing with major versions of the engine, such as Godot 2.x and Godot 3.x.
de: Die Version der Engine, mit der das Asset arbeitet. Derzeit ist es nicht möglich, dass ein einzelner Asset-Eintrag Downloads für mehrere Engine-Versionen enthält. Daher müssen Sie das Asset möglicherweise mehrmals mit einem Eintrag für jede unterstützte Godot-Version erneut einsenden. Dies ist besonders wichtig, wenn Sie sich mit Hauptversionen der Engine wie Godot 2.x und Godot 3.x befassen.
zh_tw: 該素材適用的引擎版本。目前，無法讓一個素材條目包含多個引擎版本的下載，所以你可能需要多次提交素材，為其支援的每個 Godot 版本新增一個條目。在處理主要的引擎版本時，這一點尤其重要，如 Godot 2.x 和 Godot 3.x。

source: The version number of the asset. While you are free to choose and use any versioning scheme that you like, you may want to look into something such as `SemVer <https://semver.org>`_ if you want your asset's versioning scheme to be clear and consistent. Note that there is also an internal version number, incremented every time the asset download URL is changed or updated.
de: Die Versionsnummer des Assets. Es steht Ihnen zwar frei, ein beliebiges Versionsschema zu wählen und zu verwenden, aber wenn Sie ein klares und konsistentes Versionsschema für Ihr Asset wünschen, sollten Sie sich für etwas wie `SemVer <https://semver.org>`_ entscheiden. Beachten Sie, dass es auch eine interne Versionsnummer gibt, die jedes Mal erhöht wird, wenn die Download-URL des Assets geändert oder aktualisiert wird.
zh_tw: 素材的版本號。雖然您可以自由選擇和使用您喜歡的任何版本控制方案，但如果您希望素材的版本控制方案清晰且一致，您可能需要查看諸如 `SemVer <https://semver.org>`_ 之類的內容。請注意，系統內還有一個內部版本號，每次更改或更新資源下載位址時都會增加。

source: Assets uploaded to the AssetLib are not hosted on it directly. Instead, they point to repositories hosted on third-party Git providers, such as GitHub, GitLab or Bitbucket. This is where you choose which provider your asset uses, so the site can compute the final download link.
de: Assets, die in die AssetLib hochgeladen werden, werden nicht direkt in der AssetLib gehostet. Stattdessen verweisen sie auf Repositories, die bei Git-Anbietern wie GitHub, GitLab oder Bitbucket gehostet werden. Hier wählen Sie, welchen Anbieter Ihr Asset verwendet, damit die Website den endgültigen Download-Link berechnen kann.
zh_tw: 上傳到 AssetLib 的素材並不直接託管在它上面。而是指向 GitHub、GitLab、Bitbucket 等協力廠商 Git 提供商託管的倉庫。這就是你選擇素材所用提供商的地方，這樣網站就能據此計算出最終的下載連結。

source: The URL to your asset's files/webpage. This will vary based on your choice of provider, but it should look similar to `https://github.com/<user>/<project>`.
de: Die URL zu den Dateien/Webseiten Ihres Assets. Dies hängt von der Wahl des Anbieters ab, sollte aber in etwa so aussehen: `https://github.com/<user>/<project>`.
zh_tw: 素材檔/網頁的 URL。這將根據您選擇的提供商而有所不同，但結構類似於 `https://github.com/<使用者>/<專案>`。

source: The URL to your asset's issue tracker. Again, this will differ from repository host to repository host, but will likely look similar to `https://github.com/<user>/<project>/issues`. You may leave this field empty if you use your provider's issue tracker, and it's part of the same repository.
de: Die URL zum Issue-Tracker Ihres Assets. Dies unterscheidet sich wiederum von Repository-Host zu Repository-Host, sieht jedoch wahrscheinlich ähnlich aus wie `https://github.com/<user>/<project>/issues`. Sie können dieses Feld leer lassen, wenn Sie den Issue-Tracker Ihres Providers verwenden und er Teil desselben Repositorys ist.
zh_tw: 資源問題追蹤器的 URL。同樣，根據託管倉庫的不同而不同，但結構類似於 `https://github.com/<使用者>/<專案>/issues`。如果您使用提供商的問題追蹤器，則可以將此欄位留空，因為它是倉庫的一部分。

source: The commit of the asset. For example, `b1d3172f89b86e52465a74f63a74ac84c491d3e1`. The site computes the actual download URL from this.
de: Der Commit des Assets, zum Beispiel `b1d3172f89b86e52465a74f63a74ac84c491d3e1`. Die Webseite berechnet daraus die tatsächliche Download-URL.
zh_tw: 該素材的提交號。例如，`b1d3172f89b86e52465a74f63a74ac84c491d3e1`。網站以此計算出實際的下載 URL。

source: The URL to your asset's icon (which will be used as a thumbnail in the AssetLib search results and on the asset's page). Should be an image in either the PNG or JPG format.
de: Die URL zum Symbol Ihres Assets (das als Miniaturbild in den AssetLib-Suchergebnissen und auf der Seite des Assets verwendet wird). Es sollte ein Bild im PNG oder JPG Format sein.
zh_tw: 素材圖示的 URL（將在 AssetLib 搜索結果和素材頁面中用作縮略圖）。應該是 PNG 或 JPG 格式的圖像。

source: The **icon** must be square (1:1 aspect ratio). It should have a minimum resolution of 128×128 pixels.
de: Das **Icon** muss quadratisch sein (Seitenverhältnis 1:1). Es sollte eine Mindestauflösung von 128×128 Pixel haben.
zh_tw: **icon** 應為正方形，其縱橫比應為 1:1。它的最低解析度最好是64x64像素。

source: The license under which you are distributing the asset. The list includes a variety of free and open source software licenses, such as GPL (v2 and v3), MIT, BSD and Boost Software License. You can visit `OpenSource.org <https://opensource.org>`_ for a detailed description of each of the listed licenses.
de: Die Lizenz, unter der Sie das Asset veröffentlichen. Die Liste enthält eine Vielzahl von Lizenzen für freie und quelloffene Software, wie z. B. GPL (v2 und v3), MIT, BSD und Boost Software License. Eine ausführliche Beschreibung der aufgelisteten Lizenzen finden Sie unter `OpenSource.org <https://opensource.org>`_.
zh_tw: 您分發資源的許可證。該列表包括各種自由且開源軟體許可證，如 GPL (v2和v3)、MIT、BSD 和 Boost 軟體許可證。您可以存取 `OpenSource.org <https://opensource.org>`_ 獲取每個列出的許可證的詳細說明。

source: Finally, you can use the Description field for a textual overview of your asset, its features and behavior, a changelog, et cetera. In the future, formatting with Markdown will be supported, but currently, your only option is plain text.
de: Schließlich können Sie das Description-Feld für einen textlichen Überblick über Ihr Asset, seine Features und sein Verhalten, ein Änderungsprotokoll usw. verwenden. In Zukunft wird die Formatierung mit Markdown unterstützt werden, aber derzeit ist die einzige Option reiner Text.
zh_tw: 最後, 您可以使用Description欄位來查看資源, 其功能和行為, 更改紀錄等文字概述. 將來, 將支援使用Markdown格式, 但目前只支援純文字.

source: You may also include up to three video and/or image previews, which will be shown at the bottom of the asset page. Use the "Enable" checkbox on each of the preview submission boxes to enable them.
de: Sie können auch bis zu drei Video- und/oder Bild-Previews einfügen, die unten auf der Asset-Seite angezeigt werden. Verwenden Sie das Kontrollkästchen "Aktivieren" in jedem der Vorschau-Übermittlungsfelder, um sie zu aktivieren.
zh_tw: 您還可以包含最多三個影片和/或圖像預覽，這些預覽將顯示在資源頁面的底部。請使用每個預覽提交框上的“啟用”核取方塊從而啟用它們。

source: Either an image, or a video.
de: Entweder ein Bild oder ein Video.
zh_tw: 圖像或影片。

source: **Image/YouTube URL**:
de: **Bild/YouTube URL**:

source: Either a link to the image, or to a video, hosted on YouTube.
de: Entweder ein Verweis auf ein Bild oder ein Video, das auf YouTube gehostet ist.
zh_tw: 圖像或託管在 YouTube 上的影片的連結。

source: A URL to an image that will be used as a thumbnail for the preview. This option will be removed eventually, and thumbnails will be automatically computed instead.
de: Eine URL zu einem Bild, das als Miniaturbild für die Vorschau verwendet wird. Diese Option wird nach und nach entfernt und die Miniaturbilder werden stattdessen automatisch berechnet.
zh_tw: 圖片的 URL，這張圖片將用作預覽的縮略圖。這個選項最終將被刪除，縮略圖將被自動計算出來。

source: Once you are done, press "Submit". Your asset will be entered into the review queue. You can check all assets currently pending a review `here <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_ . The approval process is manual and may take up to a few days for your asset to be accepted (or rejected), so please be patient!
de: Sobald Sie fertig sind, drücken Sie auf "Absenden". Ihr Asset wird in die Warteschlange für die Überprüfung aufgenommen. Sie können alle Assets, die derzeit zur Prüfung anstehen `hier <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_ einsehen. Das Genehmigungsverfahren ist manuell und es kann einige Tage dauern, bis Ihr Asset angenommen (oder abgelehnt) wird. Bitte haben Sie etwas Geduld!
zh_tw: 完成後點擊“Submit”。你的素材就會進入審核佇列。你可以在`這裡 <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_查看所有正在等待審核的素材。審核過程是人工的，你的素材可能會花上若干天才能通過（或者駁回），請耐心等待！

source: You may have some luck accelerating the approval process by messaging the moderators and AssetLib reviewers on the `Godot Contributors Chat <https://chat.godotengine.org/>`_, or the official Discord server.
de: Vielleicht können Sie den Genehmigungsprozess beschleunigen, indem Sie die Moderatoren und AssetLib-Reviewer im `Godot Mitwirkenden-Chat <https://chat.godotengine.org/>`_ oder auf dem offiziellen Discord-Server anschreiben.
zh_tw: 你可以在`貢獻者聊天室 <https://chat.godotengine.org/>`_或官方 Discord 伺服器中聯繫管理員和 AssetLib 審核員碰碰運氣看看能不能加速審核進度。

source: You will be informed when your asset is reviewed. If it was rejected, you will be told why that may have been, and you will be able to submit it again with the appropriate changes.
de: Sie werden benachrichtigt, wenn Ihr Beitrag geprüft wurde. Wenn er abgelehnt wurde, wird Ihnen mitgeteilt, warum dies der Fall war, und Sie können ihn mit den entsprechenden Änderungen erneut einreichen.
zh_tw: 你的素材通過審核後會通知你。如果被駁回，會告知你相關原因，你可以在做出正確的修改後重新提交。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Addons / Asset Packs
zh_tw: 附加組件 / 素材包
