Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/using_assetlib.po
Languages: de, zh_tw

source: Using the Asset Library
de: Verwenden der Asset-Bibliothek
zh_tw: 素材庫

source: On the website
de: Auf der Webseite
zh_tw: 在網站上

source: Overview
de: Übersicht
zh_tw: 概覽

source: As mentioned before, you can access the web frontend of the Asset Library on `Godot's official website <https://godotengine.org/asset-library/asset>`_. This is what it looks like when you first visit it:
de: Wie bereits erwähnt, können Sie auf das Web-Frontend der Asset-Bibliothek über die offizielle Website von `Godot <https://godotengine.org/asset-library/asset>`_ zugreifen. So sieht sie beim ersten Besuch aus:
zh_tw: 如前所述，你可以在 `Godot 的官方網站 <https://godotengine.org/asset-library/asset>`_上存取素材庫的 Web 前端。這是你第一次存取它時的樣子：

source: At the top, you see the **header**, which takes you to various other parts of the AssetLib - at the moment, it's empty, as we are not logged in.
de: Oben sehen Sie den **Header**, der Sie zu verschiedenen anderen Teilen der Asset-Bibliothek führt - im Moment ist er leer, da wir nicht angemeldet sind.
zh_tw: 在頂部, 你看到 **header** , 它導覽到AssetLib的各個其他部分, 目前, 它是空的, 因為我們沒有登錄.

source: Searching
de: Suchen
zh_tw: 搜索

source: In the center is the **search bar + settings** section, and the **assets** section below it - this lets you filter out certain kinds of assets based on a host of criteria. These include the asset **category** (such as 2D tools, scripts and demos), **engine version** they are intended for, **sorting order** (by update date, by name, etc.) and **support level**.
de: In der Mitte befinden sich der Abschnitt **Suchleiste + Einstellungen** und der Abschnitt **Assets** darunter. Auf diese Weise können Sie bestimmte Arten von Assets anhand einer Vielzahl von Kriterien herausfiltern. Dazu gehören die **Kategorie** (wie 2D-Tools, Skripte und Demos), die **Engine-Version** für die sie bestimmt sind, die **Sortierreihenfolge** (nach Aktualisierungsdatum, nach Name usw.) und **Support-Level**.
zh_tw: 在中心是 **搜索欄+設定** 部分, 以及它下面的 **資源** 部分 - 這使您可以根據一系列標準篩選掉某些型別的資源. 這些包括資源的 **類別** (例如2D工具, 腳本和演示), **引擎版本** , **排序** (按更新日期, 按名稱等)和 **支援級別** .

source: While most other filter settings should be fairly self-explanatory, it's worth going over what "support level" means in the Asset Library. Currently there are three support levels, and each asset can belong to only one.
de: Während die meisten anderen Filtereinstellungen ziemlich selbsterklärend sein sollten, lohnt es sich, einmal zu erklären, was "Support-Level" in der Asset-Bibliothek bedeutet. Derzeit gibt es drei Support-Levels, und jedes Asset kann nur zu einer gehören.
zh_tw: 雖然大多數其他篩檢程式設定是不言自明的，但值得討論是素材庫中“支援級別”的含義。目前有三個支援級別，每個素材只能屬於一個。

source: **Official** assets are created and maintained by the official Godot Engine developers. Currently, these include the official engine demos, which showcase how various areas of the engine work.
de: **Offizielle** Assets werden von den offiziellen Godot Engine-Entwicklern erstellt und verwaltet. Derzeit gehören dazu die offiziellen Engine-Demos, die zeigen, wie verschiedene Teile der Engine funktionieren.
zh_tw: **官方** 資源由官方Godot Engine開發人員建立和維護. 目前, 這些資源包括官方引擎演示, 它們展示了引擎工作的各個方面.

source: **Community** assets are submitted and maintained by the members of the Godot community.
de: **Community**-Assets werden von den Mitgliedern der Godot-Community eingereicht und verwaltet.
zh_tw: **社區** 資源由Godot社區成員提交和維護.

source: **Testing** assets are works-in-progress, and may contain bugs and usability issues. They are not recommended for use in serious projects, but you are encouraged to download, test them, and submit issues to the original authors.
de: **Test**-Assets sind noch in Arbeit und können Fehler und Stabilitäts-Probleme enthalten. Sie werden nicht für ernsthafte Projekte empfohlen. Sie sollten sie jedoch herunterladen, testen und Probleme an die ursprünglichen Autoren senden.
zh_tw: **測試** 資源是正在開發中的資源, 可能包含錯誤和可用性問題. 建議不要將它們用於正式的專案中, 但建議您下載並測試它們從而向原作者報告問題.

source: You can mix and match any of the search filters and criteria, and upon clicking the Search button, receive the list of all assets in the Library that match them.
de: Sie können die Suchfilter und -kriterien beliebig kombinieren und erhalten nach einem Klick auf den Suchen-Button eine Liste aller Assets in der Bibliothek, die diesen Kriterien entsprechen.
zh_tw: 您可以混合和配對任何搜索篩檢程式和條件，並在按一下“搜索”按鈕後，接收庫中與其配對的所有資源的列表。

source: Note that the search results are not updated in real-time, so you will have to re-submit the search query each time you change the query settings.
de: Beachten Sie, dass die Suchergebnisse nicht in Echtzeit aktualisiert werden. Sie müssen die Suchabfrage daher jedes Mal erneut senden, wenn Sie die Abfrageeinstellungen ändern.
zh_tw: 請注意, 搜索結果不會即時更新, 因此每次更改查詢設定時都必須重新提交搜索查詢.

source: Breakdown of an asset
de: Aufschlüsselung eines Assets
zh_tw: 資源的細分

source: Now let's take a look at what an asset's page looks like and what it contains.
de: Schauen wir uns nun an, wie die Seite eines Assets aussieht und was sie enthält.
zh_tw: 現在讓我們來看看資源的頁面是什麼樣的以及它包含的內容.

source: Asset's thumbnail/icon.
de: Miniaturansicht/Symbol des Assets.
zh_tw: 資源的縮略圖/圖示.

source: Asset's name.
de: Name des Assets.
zh_tw: 資源的名稱.

source: Current version number of the asset.
de: Aktuelle Versionsnummer des Assets.
zh_tw: 資源的目前版本號.

source: Asset's category, Godot version, and support status.
de: Asset-Kategorie, Godot-Version und Support-Status.
zh_tw: 資源類別,Godot版本和支援狀態.

source: Asset's original author/submitter.
de: Der ursprüngliche Autor/Einsender des Assets.
zh_tw: 資源的原作者/提交者.

source: The license the asset is distributed under.
de: Die Lizenz, unter der das Asset veröffentlicht wird.
zh_tw: 資源配置的許可證.

source: The date of the asset's latest edit/update.
de: Das Datum der letzten Bearbeitung/Aktualisierung des Assets.
zh_tw: 資源的最新編輯/更新日期.

source: A textual description of the asset.
de: Eine Textbeschreibung des Assets.
zh_tw: 資源的文字描述.

source: Links related to the asset (download link, file list, issue tracker).
de: Links zum Asset (Download-Link, Dateiliste, Issue-Tracker).
zh_tw: 與資源相關的連結(下載連結, 檔列表, 問題追蹤器).

source: Images and videos showcasing the asset.
de: Bilder und Videos, die das Asset zeigen.
zh_tw: 展示資源的圖片和影片.

source: Registering and logging in
de: Registrierung und Login
zh_tw: 註冊並登錄

source: In order to upload assets to the AssetLib, you need to be logged in, and to do that, you need a registered user account. In the future, this may also give you access to other features, such as commenting on or rating the existing assets. You do *not* need to be logged in to browse and download the assets.
de: Um Assets in die Asset-Bibliothek hochzuladen, müssen Sie angemeldet sein. Dazu benötigen Sie ein registriertes Benutzerkonto. In Zukunft erhalten Sie möglicherweise auch Zugriff auf andere Features, z.B. das Kommentieren oder Bewerten der vorhandenen Assets. Sie müssen *nicht* angemeldet sein, um die Assets zu durchsuchen und herunterzuladen.
zh_tw: 要將資源上傳到AssetLib, 您需要登錄, 為此, 您需要一個註冊使用者帳戶. 將來, 這還可以讓您存取其他功能, 例如對現有資源評論或評級. 您 *不* 需要登錄就可以瀏覽和下載資源.

source: The login/registration page can be accessed from the AssetLib header.
de: Auf die Anmelde- bzw. Registrierungsseite kann über den AssetLib-Header zugegriffen werden.
zh_tw: 可以從AssetLib標題部分存取登錄/註冊頁面.

source: From here, you can register your account, which requires a valid email address, a username, and a (preferably strong) password.
de: Von hier aus können Sie Ihr Konto registrieren, für das eine gültige E-Mail-Adresse, ein Benutzername und ein (vorzugsweise sicheres) Passwort erforderlich sind.
zh_tw: 在這裡, 您可以註冊您的帳戶, 該帳戶需要有效的電子郵寄地址, 使用者名和密碼(最好是強式密碼).

source: Then, you can use your username and password to log in.
de: Anschließend können Sie sich mit Ihrem Benutzernamen und Passwort anmelden.
zh_tw: 然後, 您可以使用您的使用者名和密碼登錄.

source: This will change the look of the AssetLib header. Now you get access to a handful of new functions:
de: Dadurch wird das Aussehen des AssetLib-Headers geändert. Jetzt haben Sie Zugriff auf eine Handvoll neuer Funktionen:
zh_tw: 這將改變AssetLib標題的外觀. 現在你可以存取一些新的功能:

source: The feed, which shows a list of status updates on your submitted assets (and possibly more in the future).
de: Der Feed, der eine Liste der Statusaktualisierungen Ihrer übermittelten Assets (und möglicherweise in Zukunft weitere Dinge) anzeigt.
zh_tw: Feed, 顯示已提交資源的狀態更新列表(將來可能更多).

source: A list of your uploaded assets.
de: Eine Liste Ihrer hochgeladenen Assets.
zh_tw: 您上傳的資源列表.

source: The ability to submit new assets.
de: Die Möglichkeit, neue Assets einzureichen.
zh_tw: 提交新資源的能力.

source: You can learn how to submit assets to the Library, and what the asset submission guidelines are, in the next part of this tutorial, :ref:`doc_submitting_to_assetlib`.
de: Im nächsten Teil dieses Tutorials, :ref:`doc_submitting_to_assetlib`, erfahren Sie, wie Sie Assets bei der Bibliothek einreichen und welche Richtlinien für die Einreichung von Assets gelten.
zh_tw: 你可以在本教學的下一部分 :ref:`doc_submitting_to_assetlib` 中學習如何向庫中提交素材，以及素材提交規範是什麼。

source: In the editor
de: Im Editor
zh_tw: 在編輯器中

source: The editor will display different categories of assets depending on whether you're browsing the Project Manager's **Asset Library Projects** tab or the editor's **AssetLib** tab.
de: Der Editor zeigt unterschiedliche Kategorien von Assets an, je nachdem, ob Sie den Tab **Asset-Bibliotheks-Projekte** des Projektmanagers oder die Registerkarte **AssetLib** des Editors durchsuchen.
zh_tw: 編輯器將根據你是在瀏覽專案管理器的**範本**分頁或是編輯器的 **AssetLib** 分頁，顯示不同類別的素材。

source: The Project Manager's **Asset Library Projects** tab will only display assets that are standalone projects by themselves. This is denoted on the asset library with the *Templates*, *Demos* and *Projects* categories.
de: Auf dem Tab **Asset-Bibliotheks-Projekte** des Projektmanagers werden nur Assets angezeigt, die eigenständige Projekte sind. Dies wird in der Asset-Bibliothek mit den Kategorien *Vorlagen*, *Demos* und *Projekte* gekennzeichnet.
zh_tw: 專案管理器的**素材庫專案**分頁只會顯示本身是獨立專案的素材。在素材庫中用 *Templates*、*Demos* 和 *Projects* 類別來表示。

source: The editor's **AssetLib** tab will only display assets that are *not* standalone projects by themselves. In other words, it will display assets from all categories except *Templates*, *Demos* and *Projects*.
de: Auf dem Tab **AssetLib** des Editors werden nur Assets angezeigt, die *keine* eigenständigen Projekte sind. Mit anderen Worten: Es werden Assets aus allen Kategorien außer *Vorlagen*, *Demos* und *Projekte* angezeigt.
zh_tw: 編輯器的 **AssetLib** 分頁將只顯示本身 *不是* 獨立專案的素材。換句話說，它將顯示除 *Template*、*Demos* 和 *Projects* 以外的所有類別的素材。

source: You can also access the AssetLib directly from Godot:
de: Sie können auch direkt von Godot aus auf die AssetLib zugreifen:
zh_tw: 你也可以直接從Godot存取AssetLib:

source: Click on it, and Godot will fetch info about the assets from the AssetLib. Once it's finished, you will see a window similar to what the AssetLib website looks like, with some differences:
de: Klicken Sie darauf, und Godot ruft Informationen zu den Assets aus der AssetLib ab. Sobald es fertig ist sehen Sie ein Fenster, das dem Aussehen der Asset-Bibliothek-Website ähnelt, mit einigen Unterschieden:
zh_tw: 按一下它,Godot將從AssetLib獲取有關資源的資訊. 一旦完成, 您將看到一個類似於AssetLib網站的視窗, 但有一些不同之處:

source: Similarly to the web version of the AssetLib, here you can search for assets by category, name, and sort them by factors such as name or edit date.
de: Ähnlich wie in der Webversion der AssetLib können Sie hier Assets nach Kategorie oder Name suchen und nach Faktoren wie Name oder Bearbeitungsdatum sortieren.
zh_tw: 與AssetLib的網頁版本類似, 您可以在此處按類別, 名稱搜索資源, 並按名稱或編輯日期等因素對其進行排序.

source: Notably, you can only fetch assets for the current version of Godot you are running. Projects, Demos and Templates can be downloaded from the Project Manager view of the AssetLib. Addons (tools, scripts, materials etc.) can be downloaded from the in-project AssetLib and added to the current project. In addition, unlike when using the web frontend, the search results are updated in real-time (you do not have to press Search after every change to your search query for the changes to take place).
de: Sie können nur Assets für die aktuelle Godot-Version abrufen, die Sie verwenden. Projekte, Demos und Vorlagen können aus der Projektmanageransicht der AssetLib heruntergeladen werden. Addons (Tools, Skripte, Materialien usw.) können aus der projektinternen AssetLib heruntergeladen und dem aktuellen Projekt hinzugefügt werden. Außerdem werden die Suchergebnisse, anders als bei der Verwendung des Web-Frontends, in Echtzeit aktualisiert (Sie müssen nicht nach jeder Änderung Ihrer Suchanfrage auf Suchen drücken, damit die Änderungen übernommen werden).
zh_tw: 顯然，你只能獲取與你所運作的 Godot 版本一致的素材。專案、演示、範本可以從專案管理器的 AssetLib 裡下載。擴充（工具、腳本、材質等）可以從專案的 AssetLib 裡下載並新增到目前專案。此外，與網頁前端不同，這些搜索結果是即時更新的（每次修改搜索內容後無需點擊搜索按鈕）。

source: In the future, you will be able to choose a different AssetLib provider to fetch assets from (using the Site dropdown menu), however currently only the official `Godot website <https://godotengine.org>`_ version of the AssetLib is supported, as well as the version that may be running on your local machine's web server (the localhost option).
de: In Zukunft können Sie einen anderen Asset-Bibliothek-Anbieter zum Abrufen von Assets auswählen (über das seitliche Dropdown-Menü). Derzeit wird jedoch nur die offizielle Version der Asset-Bibliothek auf der `Godot Website <https://godotengine.org>`_ unterstützt, sowie die Version, die möglicherweise auf dem Webserver Ihres lokalen Computers ausgeführt wird (die localhost Option).
zh_tw: 將來，您將能夠選擇一個不同的 AssetLib 提供程式來獲取資源（使用網站下拉式功能表），但是目前只支援官方的 `Godot 網站 <https://godotengine.org>`_ 版本的 AssetLib，和可能在本地 Web 伺服器上運作的素材庫（即 localhost 選項）。

source: When you click on an asset, you will see more information about it.
de: Durch Klicken auf ein Asset werden weitere Information darüber angezeigt.
zh_tw: 按一下資源時, 您將看到有關它的更多資訊.

source: If you click on the Install button, Godot will fetch an archive of the asset, and will track download progress of it at the bottom of the editor window. If the download fails, you can retry it using the Retry button.
de: Wenn Sie auf den Installieren-Button klicken, ruft Godot ein Archiv des Assets ab und verfolgt den Download-Fortschritt unten im Editorfenster. Wenn der Download fehlschlägt, können Sie ihn über den Wiederholen-Button neu anstarten.
zh_tw: 如果按一下Install按鈕,Godot引擎將下載資源的壓縮包, 並將在編輯器視窗的底部顯示它的下載進度. 如果下載失敗, 您可以使用Retry按鈕重試.

source: When it finishes, you can proceed to install it using the Install button. This will bring up the Package Installer window.
de: Wenn es fertig ist, können Sie mit der Installation über den Installieren-Button fortfahren. Dadurch wird das Paketinstallationsfenster geöffnet.
zh_tw: 完成後, 您可以使用Install按鈕繼續安裝它. 這將打開Package Installer視窗.

source: Here you can see a list of all the files that will be installed. You can tick off any of the files that you do not wish to install, and Godot will also inform you about any problems with files that it cannot install. These files will be shown in red, and hovering over them will show you a message stating why it cannot be installed.
de: Hier sehen Sie eine Liste aller Dateien, die installiert werden. Sie können alle Dateien ankreuzen, die Sie nicht installieren möchten, und Godot informiert Sie auch über Probleme mit Dateien, die nicht installiert werden können. Diese Dateien werden rot angezeigt. Wenn Sie mit dem Mauszeiger darüber fahren, wird eine Meldung angezeigt, warum sie nicht installiert werden können.
zh_tw: 在這裡, 您可以看到將要安裝的所有檔的列表. 您可以勾選您不想安裝的任何檔,Godot引擎也會告知您無法安裝的檔案的任何問題. 這些檔將以紅色顯示, 將滑鼠懸停在它們上方會顯示一條消息, 說明無法安裝的原因.

source: Once you are done, you can press the Install button, which will unzip all the files in the archive, and import any assets contained therein, such as images or 3D models. Once this is done, you should see a message stating that the Package installation is complete.
de: Sobald Sie fertig sind, können Sie auf den Installieren-Button klicken, um alle Dateien im Archiv zu entpacken und alle darin enthaltenen Elemente wie Bilder oder 3D-Modelle zu importieren. Sobald dies erledigt ist, sollte eine Meldung angezeigt werden, die besagt, dass die Paketinstallation abgeschlossen ist.
zh_tw: 完成後, 您可以按Install按鈕, 該按鈕將解壓縮存檔中的所有檔, 並匯入其中包含的所有資源, 例如圖像或3D模型. 完成此操作後, 您應該會看到一條消息, 指出Package安裝已完成.

source: You may also use the Import button to import asset archives obtained elsewhere (such as downloading them directly from the AssetLib web frontend), which will take you through the same package installation procedure as with the assets downloaded directly via Godot that we just covered.
de: Sie können auch den Importieren-Button verwenden, um Asset-Archive zu importieren, die Sie anderweitig erhalten haben (z. B. durch direktes Herunterladen aus dem AssetLib-Web-Frontend). Dabei durchlaufen Sie dasselbe Paketinstallationsverfahren wie bei Assets, die direkt über Godot heruntergeladen wurden.
zh_tw: 您還可以使用Import按鈕匯入在其他位置獲取的資源壓縮包(例如直接從AssetLib 網頁前端下載的), 這將引導您完成與我們剛剛通過Godot引擎實作的套裝程式安裝過程.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
