Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/what_*_assetlib.po
Languages: de, zh_tw

source: About the Asset Library
de: Über die Asset-Bibliothek
zh_tw: 關於素材庫

source: The Godot Asset Library, otherwise known as the AssetLib, is a repository of user-submitted Godot addons, scripts, tools, and other resources, collectively referred to as assets. They're available to all Godot users for download directly from within the engine, but it can also be accessed at Godot's `official website <https://godotengine.org/asset-library/asset>`_.
de: Die Godot Asset-Bibliothek, auch bekannt als AssetLib, ist eine Sammlung für von Benutzern eingereichte Godot-Addons, Skripte, Tools und andere Ressourcen, die zusammenfassend als Assets bezeichnet werden. Sie stehen allen Godot-Benutzern direkt in der Engine zum Download zur Verfügung, können aber auch über die `offizielle Godot-Website <https://godotengine.org/asset-library/asset>`_ abgerufen werden.
zh_tw: Godot 素材庫，又稱 AssetLib，是一個使用者提交的 Godot 附加元件、腳本、工具和其他資源的倉庫，統稱為素材。所有 Godot 使用者都可以從引擎中直接下載，也可以從 Godot 的`官方網站 <https://godotengine.org/asset-library/asset>`_存取。

source: On the surface, the Asset Library might look and function similar to asset stores available for other engines, such as Unity's Asset Store, or Unreal Engine's Marketplace, where you can submit both freely-available assets, as well as paid, commercial ones. In addition, often times such assets are distributed under non-free, proprietary licenses, limiting what you can do with them.
de: Oberflächlich betrachtet mag die Asset-Bibliothek ähnlich aussehen und funktionieren wie Asset-Stores für andere Engines, wie z. B. der Asset-Store von Unity oder der Marktplatz der Unreal Engine, wo Sie sowohl frei verfügbare als auch kostenpflichtige, kommerzielle Assets einreichen können. Darüber hinaus werden solche Assets oft unter unfreien, proprietären Lizenzen vertrieben, von denen die Möglichkeiten der Nutzung eingeschränkt weden.
zh_tw: 從表面上看，素材庫的外觀和功能可能類似於其他引擎的素材商店，比如 Unity 的素材商店或者虛幻引擎的市場，在那裡你可以提交免費的素材以及付費的商業素材。此外，很多時候，這些素材是在非自由、專有的許可證下發行的，限制了你對它們的使用。

source: The Asset Library is different - all assets are distributed free of charge, and under a host of open source licenses (such as the MIT license, the GPL, and the Boost Software License). This makes the AssetLib more similar to the software repositories of a Linux distribution.
de: Die Asset-Bibliothek ist anders - alle Assets werden kostenlos und unter einer Vielzahl von Open-Source-Lizenzen (wie der MIT-Lizenz, der GPL und der Boost Software License) verteilt. Dadurch ähnelt die AssetLib eher den Software-Repositorys einer Linux-Distribution.
zh_tw: 素材庫則不同 - 所有資源都是免費分發的，並且服從多種開源許可證（例如 MIT 許可證、GPL 和 Boost 軟體許可證）。這使得 AssetLib 更類似於 Linux 發行版本的軟體倉庫。

source: This set of pages will cover how to use the AssetLib (both from inside Godot, and on the website), how you can submit your own assets, and what the guidelines for submission are.
de: Auf diesen Seiten erfahren Sie, wie Sie die Asset-Bibliothek verwenden (sowohl innerhalb von Godot als auch auf der Website), wie Sie Ihre eigenen Assets einreichen können und welche Richtlinien für die Übermittlung gelten.
zh_tw: 接下的內容將介紹如何使用 AssetLib（從 Godot 引擎內部或網站上），如何提交自己的資源，以及提交規範。

source: Please note that the AssetLib is relatively young - it may have various pain points, bugs, and usability issues. As with all Godot projects, the code repository is available on `GitHub <https://github.com/godotengine/godot-asset-library>`_, where you can submit pull requests and issues, so please do not hesitate to visit it!
de: Bitte beachten Sie, dass die AssetLib relativ jung ist - sie kann verschiedene Schwachstellen, Fehler und Probleme mit der Benutzerfreundlichkeit haben. Wie bei allen Godot-Projekten ist das Code-Repository auf `GitHub <https://github.com/godotengine/godot-asset-library>`_ verfügbar, wo Sie Pull-Requests und Probleme einreichen können, also zögern Sie nicht, es zu besuchen!
zh_tw: 請注意，AssetLib還比較年輕--它可能有各種痛點、錯誤和可用性問題。與所有Godot專案一樣，程式碼庫在 `GitHub <https://github.com/godotengine/godot-asset-library>`_ 上，你可以在那裡提交拉取請求和問題，所以請毫不猶豫地存取它!

source: Types of assets
de: Arten von Assets
zh_tw: 素材的型別

source: Be aware that there are, broadly, two different types of assets you can post.
de: Beachten Sie, dass es im Allgemeinen zwei verschiedene Arten von Assets gibt, die Sie veröffentlichen können.
zh_tw: 要知道, 你可以發行的資源大致有兩種不同的型別.

source: Assets labeled as "Templates", "Projects", or "Demos" appear under the "Asset Library Projects" tab in the Godot Project Manager. These assets are standalone Godot projects that can run by themselves.
de: Assets, die als "Vorlagen", "Projekte" oder "Demos" gekennzeichnet sind, erscheinen im Tab "Asset-Bibliotheks-Projekte" im Godot-Projektmanager. Bei diesen Assets handelt es sich um eigenständige Godot-Projekte, die selbständig ausgeführt werden können.
zh_tw: 標為 "範本" , "專案" 或 "演示" 的資源出現在Godot專案管理的 "範本" 標籤下. 這些資源是獨立的Godot專案, 可以單獨運作.

source: Other assets show up inside of the Godot editor under the "AssetLib" main screen tab, next to "2D", "3D", and "Script". These assets are meant to be downloaded and placed into an existing Godot project.
de: Weitere Assets werden im Godot-Editor auf der Registerkarte "AssetLib" neben "2D", "3D" und "Skript" angezeigt. Diese Assets sind dazu gedacht, heruntergeladen und in ein bestehendes Godot-Projekt eingefügt zu werden.
zh_tw: 其他資源顯示在Godot編輯器內部的 "AssetLib" 主螢幕標籤下,"2D" , "3D" 和 "Script" 旁邊. 這些資源可以下載並存入現有的Godot專案中.

source: Frequently asked questions
de: Häufig gestellte Fragen
zh_tw: 常見問題

source: Can paid assets be uploaded to the asset library?
de: Können gekaufte Assets in die Asset-Bibliothek hochgeladen werden?
zh_tw: 收費資源可以上傳到素材庫嗎？

source: Not to the official one, though in the future, there might be other asset libraries which allow it. That said, you are allowed to monetize and sell Godot assets outside the Asset Library.
de: Nicht für die offizielle, obwohl es in Zukunft möglicherweise andere Asset-Bibliothek geben wird, die dies zulässt. Sie dürfen jedoch Godot-Assets außerhalb der Asset-Bibliothek zu Geld machen und verkaufen.
zh_tw: 不是對官方的，雖然在未來，可能會有其他素材庫允許這樣做。也就是說，你可以在素材庫以外的地方將 Godot 素材貨幣化並出售。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
