Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/best_practices_for_engine_contributors.po
Languages: de, zh_cn

source: Libraries must use a permissive enough license to be included into Godot. Some examples of acceptable licenses are Apache 2.0, BSD, MIT, ISC, and MPL 2.0. In particular, we cannot accept libraries licensed under the GPL or LGPL since these licenses effectively disallow static linking in proprietary software (which Godot is distributed as in most exported projects). This requirement also applies to the editor, since we may want to run it on iOS in the long term. Since iOS doesn't support dynamic linking, static linking is the only option on that platform.
de: Bibliotheken müssen eine ausreichend offene Lizenz verwenden, um in Godot aufgenommen zu werden. Einige Beispiele für akzeptable Lizenzen sind Apache 2.0, BSD, MIT, ISC und MPL 2.0. Insbesondere können wir keine Bibliotheken akzeptieren, die unter der GPL oder LGPL lizenziert sind, da diese Lizenzen das statische Linken in proprietärer Software (als die Godot in den meisten exportierten Projekten verteilt wird) effektiv verbieten. Diese Anforderung gilt auch für den Editor, da wir ihn auf lange Sicht möglicherweise auf iOS einsetzen wollen. Da iOS kein dynamisches Linking unterstützt, ist statisches Linking die einzige Option auf dieser Plattform.

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
