Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/best_practices_for_engine_contributors.po
Languages: de, zh_cn

source: Best practices for engine contributors
de: Bewährte Praktiken für Engine-Entwickler
zh_cn: 引擎贡献者的最佳实践

source: Introduction
de: Einführung
zh_cn: 前言

source: Godot has a large amount of users who have the ability to contribute because the project itself is aimed mainly at users who can code. That being said, not all of them have the same level of experience working in large projects or in software engineering, which can lead to common misunderstandings and bad practices during the process of contributing code to the project.
de: Godot hat eine große Anzahl von Nutzern, die einen Beitrag leisten können, weil das Projekt selbst hauptsächlich auf Nutzer ausgerichtet ist, die programmieren können. Allerdings haben nicht alle von ihnen das gleiche Maß an Erfahrung in der Arbeit an großen Projekten oder in der Softwareentwicklung, was zu häufigen Missverständnissen und schlechten Praktiken beim Beitragen von Code zu dem Projekt führen kann.

source: Language
de: Sprache
zh_cn: 语言

source: The scope of this document is to be a list of best practices for contributors to follow, as well as to create a language they can use to refer to common situations that arise in the process of submitting their contributions.
de: Dieses Dokument soll eine Liste bewährter Praktiken zur Verfügung stellen, an die sich die Mitwirkenden halten können, und außerdem eine Sprache schaffen, mit der sie sich auf häufige Problemsituationen beim Einreichen ihrer Beiträge beziehen können.
zh_cn: 本文档的范围是罗列让贡献者遵循的最佳实践，并且创建一种语言，供他们用来指代提交贡献过程中出现的常见情况。

source: While a generalized list of software development best practices might be useful, we'll focus on the situations that are most common in our project.
de: Obwohl eine allgemeine Liste von guten Praktiken für die Softwareentwicklung nützlich wäre, werden wir uns auf die Situationen konzentrieren, die in unserem Projekt am häufigsten vorkommen.

source: Contributions are most of the time categorized as bug fixes, enhancements or new features. To abstract this idea, we will call them *Solutions*, because they always seek to solve something that can be described as a *Problem*.
de: Beiträge werden meistens als Bugfixes, Verbesserungen oder neue Features eingestuft. Um diesen Gedanken zu abstrahieren, werden wir sie *Lösungen* nennen, weil man immer versucht, damit etwas zu lösen, das als *Problem* beschrieben werden kann.
zh_cn: 贡献大部分时间都归类为错误修复, 增强功能或新功能. 为了抽象化这个想法, 我们将它们称为 *解决方案*, 因为它们总是寻求解决可以描述为 *问题* 的问题.

source: Best Practices
de: Bewährte Praktiken
zh_cn: 最佳实践

source: #1: The problem always comes first
de: #1: Das Problem steht immer an erster Stelle
zh_cn: #1：问题第一

source: Many contributors are extremely creative and just enjoy the process of designing abstract data structures, creating nice user interfaces, or simply love programming. Whatever the case may be, they come up with cool ideas, which may or may not solve real problems.
de: Viele Mitwirkende sind äußerst kreativ und haben einfach Spaß daran, abstrakte Datenstrukturen zu entwerfen, schöne Benutzeroberflächen zu gestalten, oder sie lieben einfach das Programmieren. Was auch immer der Fall sein mag, sie kommen mit coolen Ideen, die manchmal echte Probleme lösen, manchmal aber auch nicht.
zh_cn: 许多贡献者非常有创造力，他们就是享受设计抽象数据结构、创建漂亮的用户界面，或者就是单纯喜欢编程。不管是什么情况，他们都会想出很酷的想法，但这些想法可能并不能真正解决任何实际问题。

source: These are usually called *solutions in search of a problem*. In an ideal world, they would not be harmful but, in reality, code takes time to write, takes up space and requires maintenance once it exists. Avoiding the addition of anything unnecessary is always considered a good practice in software development.
de: Letztere werden gewöhnlich bezeichnet als *Lösungen, die nach einem Problem suchen*. In einer idealen Welt wären sie nicht schädlich, aber in der Realität kostet es Zeit, Code zu schreiben, er nimmt Speicherplatz in Anspruch und muss gewartet werden, sobald er existiert. In der Softwareentwicklung ist es immer eine gute Praxis, alles Unnötige zu vermeiden.
zh_cn: 这种情况通常被称为\ *为解决方案寻找问题*\ 。在理想情况下并没有害处，但在现实世界中，代码需要花费时间去编写、需要占用空间、出现后就需要维护。在软件开发领域，避免添加任何不必要的东西永远是最佳实践。

source: #2: To solve the problem, it has to exist in the first place
de: #2: Um das Problem zu lösen, muss es überhaupt existieren
zh_cn: #2：只能解决存在的问题

source: This is a variation of the previous practice. Adding anything unnecessary is not a good idea, but what constitutes what is necessary and what isn't?
de: Dies ist eine Abwandlung der bisherigen Praxis. Es ist keine gute Idee, etwas Unnötiges hinzuzufügen, aber woran erkennt man, was notwendig ist und was nicht?
zh_cn: 这是上一条的变体。添加不必要的东西是不好的，但是如何判断是否必要呢？

source: The answer to this question is that the problem needs to *exist* before it can be actually solved. It must not be speculation or a belief. The user must be using the software as intended to create something they *need*. In this process, the user may stumble upon a problem that requires a solution to proceed, or in order to achieve greater productivity. In this case, *a solution is needed*.
de: Die Antwort auf diese Frage lautet, dass das Problem *existieren* muss, bevor es tatsächlich gelöst werden kann. Es darf keine Spekulation oder ein Glaube sein. Der Benutzer muss die Software wie vorgesehen verwenden, um etwas zu erstellen, das er *haben möchte*. Dabei kann der Benutzer auf ein Problem stoßen, das eine Lösung braucht, damit er weiterkommt oder eine bessere Produktivität erreicht. In diesem Fall *wird eine Lösung benötigt*.
zh_cn: 答案是问题需要先\ *存在*\ ，然后才能解决。问题不能是推测或者观点。用户必须正常使用软件，才能创造出他们\ *需要*\ 的东西。在这个过程中，用户可能会遇到一些问题，需要有解决方案才能继续，或者达到更高的生产力。这种情况下就\ *需要解决方案*\ 。

source: Believing that problems may arise in the future and that the software needs to be ready to solve them by the time they appear is called *"Future proofing"* and its characterized by lines of thought such as:
de: Der Glaube, dass Probleme in der Zukunft auftreten könnten und dass die Software zum Zeitpunkt dieses Auftretens in der Lage sein muss, sie zu lösen, wird als "Future Proofing" bezeichnet und ist durch folgende Gedankengänge gekennzeichnet:
zh_cn: 坚信将来可能会出现问题，并且软件需要在问题出现时就已准备好解决它们，这被称为\ *“保护未来”*\ ，其特点是思路如下：

source: I think it would be useful for users to...
de: Ich denke, es wäre nützlich für Benutzer, ...
zh_cn: 我想这对于用户来说是有用的....

source: I think users will eventually need to...
de: Ich denke, Benutzer bräuchten irgendwann ...
zh_cn: 我认为用户最终需要...

source: This is generally considered a bad habit because trying to solve problems that *don't actually exist* in the present will often lead to code that will be written but never used, or that is considerably more complex to use and maintain than it needs to be.
de: Dies wird im Allgemeinen als schlechte Angewohnheit angesehen, da der Versuch, Probleme zu lösen, die derzeit *nicht wirklich existieren*, sehr oft zu Code führt, der geschrieben, aber nie verwendet wird oder zu Code, dessen Verwendung und Wartung erheblich komplexer ist als notwendig.
zh_cn: 通常认为这是不好的习惯，因为试图解决\ *当前不存在*\ 的问题的结果往往是代码写好了，但是从来没人用，或者是无论用起来还是维护起来都比实际需要的要复杂地多。

source: #3: The problem has to be complex or frequent
de: #3: Das Problem muss komplex sein oder häufig auftreten
zh_cn: #3：问题应该比较复杂或频繁出现

source: Software is designed to solve problems, but we can't expect it to solve *every problem that exists under the sun*. As a game engine, Godot will help you make games better and faster, but it won't make an *entire game* for you. A line must be drawn somewhere.
de: Software wird entwickelt, um Probleme zu lösen, aber wir können nicht erwarten, dass sie *jedes Problem löst, das es auf der Welt gibt*. Als Game Engine wird Godot Ihnen helfen, Spiele besser und schneller zu machen, aber es wird nicht ein *gesamtes Spiel* für Sie machen. Irgendwo muss eine Grenze gezogen werden.

source: Whether a problem is worth solving is determined by the effort that is required to work around it. The required effort depends on:
de: Ob es sich lohnt, ein Problem zu lösen, hängt von der Schwierigkeit für den Benutzer ab, es zu umgehen. Diese Schwierigkeit kann ausgedrückt werden als:

source: The complexity of the problem
de: die Komplexität des Problems
zh_cn: 问题的复杂性

source: The frequency the problem
de: die Häufigkeit des Problems
zh_cn: 问题发生的频率

source: If the problem is *too complex* for most users to solve, then the software should offer a ready-made solution for it. Likewise, if the problem is easy for the user to work around, offering such a solution is unnecessary.
de: Wenn das Problem für die meisten Benutzer *zu komplex* ist, dann sollte die Software eine fertige Lösung dafür anbieten. Wenn das Problem für den Benutzer leicht zu umgehen ist, ist es nicht notwendig, eine solche Lösung anzubieten.

source: The exception, however, is when the user encounters a problem *frequently enough* that having to do the simple solution every time becomes an annoyance. In this case, the software should offer a solution to simplify the use case.
de: Die Ausnahme ist jedoch, wenn der Benutzer *häufig genug* auf ein Problem stößt, so dass es lästig wird, jedes Mal die einfache Lösung ausführen zu müssen. In diesem Fall sollte die Software eine Lösung anbieten, um den Anwendungsfall zu vereinfachen.

source: It's usually easy to tell if a problem is complex or frequent, but it can be difficult. This is why discussing with other developers (next point) is always advised.
de: Normalerweise ist es leicht, zu erkennen, ob ein Problem komplex oder häufig ist, aber es kann sich auch als schwierig herausstellen. Deshalb ist es immer ratsam, sich mit anderen Entwicklern auszutauschen (nächster Punkt).

source: #4: The solution must be discussed with others
de: #4: Die Lösung muss mit anderen besprochen werden
zh_cn: #4：必须与其他人讨论解决方案

source: Often, users will be immersed in their own projects when they stumble upon problems. These users will naturally try to solve the problem from their perspective, thinking only about their own use case. As a result, user proposed solutions don't always contemplate all use cases and are often biased towards the user's own requirements.
de: Oft sind die Benutzer in ihre eigenen Projekte vertieft, wenn sie auf Probleme stoßen. Diese Benutzer werden natürlich versuchen, das Problem aus ihrer Perspektive zu lösen und nur an ihren eigenen Anwendungsfall denken. Infolgedessen berücksichtigen die von einem Benutzer vorgeschlagenen Lösungen nicht immer alle Anwendungsfälle und sind oft auf die Anforderungen dieses Benutzers ausgerichtet.
zh_cn: 当用户偶尔发现问题时，他们往往会沉浸在自己的项目中。自然而然地，他们会尝试从他们自己的角度来解决问题，并只关注他们自己的情况。因此，用户提出的解决方案通常偏向于用户自己的需求，考虑不到所有情况。

source: For developers, the perspective is different. They may find the user's problem too unique to justify a solution (instead of a workaround), or they might suggest a partial (usually simpler or lower level) solution that applies to a wider range of known problems and leave the rest of the solution up to the user.
de: Für Entwickler ist die Perspektive eine andere. Sie finden vielleicht, dass das Problem des Benutzers zu einzigartig ist, um eine Lösung (anstelle eines Workarounds) zu rechtfertigen, oder sie schlagen eine Teillösung vor (in der Regel eine einfachere oder auf niedrigerer Ebene), die für eine größere Anzahl bekannter Probleme gilt, und überlassen den Rest der Lösung dem Benutzer.

source: In any case, before attempting to contribute, it is important to discuss the actual problems with the other developers or contributors, so a better agreement on implementation can be reached.
de: In jedem Fall ist es wichtig, vor dem Versuch, einen Beitrag zu leisten, die tatsächlichen Probleme mit den anderen Entwicklern oder Mitwirkenden zu besprechen, damit eine bessere Einigung über die Umsetzung erzielt werden kann.

source: The only exception is when an area of code has a clear agreed upon owner, who talks to users directly and has the most knowledge to implement a solution directly.
de: Die einzige Ausnahme ist, wenn ein Bereich des Codes einen klar definierten Eigentümer hat, der direkt mit den Benutzern spricht und über das meiste Wissen verfügt, um eine Lösung direkt umzusetzen.

source: Also, Godot's philosophy is to favor ease of use and maintenance over absolute performance. Performance optimizations will be considered, but they may not be accepted if they make something too difficult to use or if they add too much complexity to the codebase.
de: Godots Philosophie ist es auch, die Benutzerfreundlichkeit und Wartung der absoluten Performance vorzuziehen. Performanceoptimierungen werden berücksichtigt, sie werden jedoch möglicherweise nicht akzeptiert, wenn sie die Verwendung zu schwierig machen oder wenn die Codebasis zu komplex wird.
zh_cn: 另外,Godot的理念是支持易用性和维护性, 而不是绝对性能. 性能优化将被考虑, 但是如果它们使得某些东西太难使用或者给代码库增加了太多的复杂性, 那么它们可能不会被接受.

source: #5: To each problem, its own solution
de: #5: Für jedes Problem eine eigene Lösung
zh_cn: #5：不同的问题用不同的解决方案

source: For programmers, it is always a most enjoyable challenge to find the most optimal solutions to problems. It is possible to go overboard, though. Sometimes, contributors will try to come up with solutions that solve as many problems as possible.
de: Für Programmierer ist es immer eine sehr angenehme Herausforderung, optimale Lösungen für Probleme zu finden. Allerdings kann man dabei auch über das Ziel hinausschießen. Manchmal wird versucht, Lösungen zu finden, die so viele Probleme wie möglich lösen.

source: The situation will often take a turn for the worse when, in order to make this solution appear even more fantastic and flexible, the pure speculation-based problems (as described in #2) also make their appearance on stage.
de: Die Situation verschlechtert sich oft, wenn die rein auf Spekulation basierenden Probleme (wie in Nr. 2 beschrieben) auch noch auftauchen, um diese Lösung noch fantastischer und flexibler erscheinen zu lassen.
zh_cn: 当为了使这个解决方案显得更加奇妙和灵活, 纯粹的基于推测的问题(如#2所述)也出现在舞台上时, 情况往往会变得更糟.

source: The main problem is that, in reality, it rarely works this way. Most of the time, writing an individual solution to each problem results in code that is simpler and more maintainable.
de: Das Hauptproblem ist, dass es in der Realität selten so funktioniert. Meistens führt das Schreiben einer individuellen Lösung für jedes Problem zu Code, der einfacher und besser wartbar ist.
zh_cn: 主要问题是，在现实中，它很少以这种方式工作。大多数情况下，只要为每个问题编写一个单独的解决方案，代码就会变得更简单，更易于维护。

source: Additionally, solutions that target individual problems are better for the users. Targeted solutions allow users find something that does exactly what they need, without having to learn a more complex system they will only need for simple tasks.
de: Außerdem sind Lösungen, die auf individuelle Probleme ausgerichtet sind, besser für die Nutzer. Gezielte Lösungen ermöglichen es den Nutzern, etwas zu finden, das genau das tut, was sie brauchen, ohne ein komplexeres System erlernen zu müssen, das sie nur für einfache Aufgaben benötigen.

source: Big and flexible solutions also have an additional drawback which is that, over time, they are rarely flexible enough for all users. Users end up requesting more and more functionality which ends up making the API and codebase more and more complex.
de: Große und flexible Lösungen haben auch den Nachteil, dass sie im Laufe der Zeit selten flexibel genug für alle Nutzer sind. Die Nutzer fordern immer mehr Funktionen an, was dazu führt, dass die API und die Codebasis immer komplexer werden.

source: #6: Cater to common use cases, leave the door open for the rare ones
de: #6: Gängige Anwendungsfälle bearbeiten, aber die Tür für seltene geöffnet lassen
zh_cn: #6：满足常见用例，为罕见用例敞开大门

source: This is a continuation of the previous point, which further explains why this way of thinking and designing software is preferred.
de: Dies ist eine Fortsetzung des vorherigen Punktes, der weiter erklärt, warum diese Art des Denkens und Entwerfens von Software bevorzugt wird.
zh_cn: 这是前一点的延续, 这进一步解释了为什么这种思维方式和设计软件是首选.

source: As mentioned before (in point #2), it is very difficult for us (as human beings who design software) to actually understand all future user needs. Trying to write very flexible structures that cater to many use cases at once is often a mistake.
de: Wie bereits in Punkt 2 erwähnt, ist es für uns (als Menschen, die Software entwickeln) sehr schwierig, alle zukünftigen Benutzeranforderungen tatsächlich zu verstehen. Der Versuch, sehr flexible Strukturen zu schreiben, die viele Anwendungsfälle gleichzeitig abdecken, ist oft keine gute Idee.
zh_cn: 如前所述(第2点), 我们(作为设计软件的人)很难真正理解所有未来的用户需求. 试图同时编写满足许多用例的非常灵活的结构常常是一个错误.

source: We may come up with something we believe is brilliant but later find out that users will never even use half of it or that they require features that don't quite fit into our original design, forcing us to either throw it away or make it even more complex.
de: Es kann sein, dass wir etwas entwickelt haben, von dem wir glauben, dass es brillant ist, aber später herausfinden, dass die Benutzer nicht einmal die Hälfte davon nutzen oder dass sie Features benötigen, die nicht ganz in unser ursprüngliches Design passen, was uns dazu zwingt, es entweder wegzuwerfen oder noch komplexer zu gestalten.

source: The question is then, how do we design software that both allows users to do *what we know they need to do* now and allows them to do *what we don't yet know they'll need to do* in the future?
de: Die Frage ist also, wie entwerfen wir eine Software, die es den Nutzern ermöglicht, sowohl das zu tun, *von dem wir wissen, dass sie es jetzt brauchen*, als auch das zu tun, *von dem wir noch nicht wissen, ob sie es in Zukunft brauchen werden*?

source: The answer to this question is that, to ensure users still can do what they want to do, we need to give them access to a *low level API* that they can use to achieve what they want, even if it's more work for them because it means reimplementing some logic that already exists.
de: Die Antwort auf diese Frage lautet: Um sicherzustellen, dass Benutzer weiterhin das tun können, was sie möchten, müssen wir ihnen Zugriff auf eine *Low-Level-API* gewähren, mit der sie das erreichen können, was sie möchten, auch wenn es mehr Arbeit für sie ist, weil es bedeutet eine bereits existierende Logik neu zu implementieren.
zh_cn: 这个问题的答案是, 为了确保用户仍然可以做他们想做的事情, 我们需要让他们访问一个 "低级API", 他们可以用它来实现他们想要的, 即使这对他们来说是更大的工作, 因为这意味着重新实现一些已经存在的逻辑.

source: In real-life scenarios, these use cases will be at most rare and uncommon anyway, so it makes sense a custom solution needs to be written. This is why it's important to still provide users the basic building blocks to do it.
de: In realen Szenarien sind diese Anwendungsfälle ohnehin höchst selten und ungewöhnlich. Daher ist es sinnvoll, eine benutzerdefinierte Lösung zu schreiben. Aus diesem Grund ist es wichtig, den Benutzern weiterhin die grundlegenden Bausteine dafür bereitzustellen.
zh_cn: 在现实场景中, 这些用例无论如何都是非常罕见的, 所以需要编写一个定制的解决方案是有意义的. 这就是为什么仍然要为用户提供基本的构建块来实现这一点很重要.

source: #7: Prefer local solutions
de: #Nr. 7: Lokale Lösungen bevorzugen
zh_cn: #7：局部解决方案优先

source: When looking for a solution to a problem, be it implementing a new feature or fixing a bug, sometimes the easiest path is to add data or a new function in the core layers of code.
de: Wenn Sie nach einer Lösung für ein Problem suchen, sei es die Implementierung eines neuen Features oder die Behebung eines Bugs, ist es manchmal am einfachsten, Daten oder ein neues Feature in die Kern-Ebenen des Codes einzufügen.
zh_cn: 当寻找一个问题的解决方法时, 例如实现新特性或者修复一个BUG, 有时最简单的方式是在核心代码层中, 添加数据或是一个新的代码函数.

source: The main problem here is, adding something to the core layers that will only be used from a single location far away will not only make the code more difficult to follow (split in two), but also make the core API larger, more complex, more difficult to understand in general.
de: Das Hauptproblem hierbei ist, dass das Hinzufügen von Elementen zu den Kern-Ebenen, die nur von einem einzigen weit entfernten Ort aus verwendet werden, nicht nur das Verständnis des Codes erschwert (da zweigeteilt), sondern auch die Kern-API größer und komplexer macht, also im Allgemeinen schwieriger zu verstehen.
zh_cn: 这里的主要问题是, 在核心层中添加一些只在很远的地方使用的东西, 不仅会使代码更难理解(一分为二), 而且还会使核心API更大, 更复杂, 更难理解.

source: This is bad, because readability and cleanness of core APIs is always of extreme importance given how much code relies on it, and because it's key for new contributors as a starting point to learning the codebase.
de: Das ist schlecht, denn die Lesbarkeit und Sauberkeit der Kern-APIs ist immer von äußerster Wichtigkeit, wenn man bedenkt, wie viel Code davon abhängt, und weil es für neue Mitwirkende ein wichtiger Ausgangspunkt ist, um die Codebasis zu verstehen.
zh_cn: 这是不好的, 因为核心api的可读性和干净性总是非常重要的, 因为它是新贡献者学习代码库的一个起点.

source: A common reason for wanting to do this is that it's usually less code to simply add a hack in the core layers.
de: Ein häufiger Grund dafür ist, dass es in der Regel weniger Code erfordert, einfach einen Hack in den Kern-Ebenen hinzuzufügen.

source: Doing so is not advised. Generally, the code for a solution should be closer to where the problem originates, even if it involves additional, duplicated, more complex, or less efficient code. More creativity might be needed, but this path is always the advised one.
de: Dies ist jedoch nicht ratsam. Im Allgemeinen sollte der Code für eine Lösung näher am Ursprung des Problems liegen, auch wenn dies zusätzlichen, duplizierten, komplexeren oder weniger effizienten Code bedeutet. Es könnte mehr Kreativität erforderlich sein, aber dieser Weg ist immer der richtige.

source: #8: Don't use complex canned solutions for simple problems
de: #8: Verwenden Sie keine komplexen Komplettlösungen für einfache Probleme
zh_cn: #8：不要用复杂的现成解决方案来处理简单的问题

source: Not every problem has a simple solution and, many times, the right choice is to use a third party library to solve the problem.
de: Nicht jedes Problem hat eine einfache Lösung, und oft ist es die richtige Wahl, eine Drittanbieter-Bibliothek zu verwenden, um das Problem zu lösen.
zh_cn: 并非每个问题都有一个简单的解决方案, 很多时候, 正确的选择是使用第三方库来解决问题.

source: As Godot requires to be shipped in a large amount of platforms, we can't link libraries dynamically. Instead, we bundle them in our source tree.
de: Da Godot in einer großen Anzahl von Plattformen ausgeliefert werden muss, können wir die Bibliotheken nicht dynamisch linken. Stattdessen bündeln wir sie in unserem Quellcode-Baum.
zh_cn: 由于 Godot 需要在大量的平台上发布，我们无法对库进行动态链接。相反，我们将它们捆绑在我们的源代码树中。

source: As a result, we are very picky with what goes in, and we tend to prefer smaller libraries (single header ones are our favorite). We will only bundle something larger if there is no other choice.
de: Daher sind wir sehr wählerisch bei der Auswahl und bevorzugen kleinere Bibliotheken (am liebsten solche mit nur einem Header). Wir werden nur dann etwas Größeres bündeln, wenn es keine andere Wahl gibt.
