Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/code_style_guidelines.po
Languages: de, tr

source: Code style guidelines
de: Richtlinien für den Codestil
tr: Kod tarzı rehberleri

source: When contributing to Godot's source code, you will be expected to follow the style guidelines outlined below. Some of them are checked via the Continuous Integration process and reviewers will ask you to fix potential issues, so best setup your system as outlined below to ensure all your commits follow the guidelines.
de: Um zu Godots Quellcode beizutragen, ist der nachstehend aufgeführte Style Guide zu befolgen. Einige Punkte werden im Rahmen der Continuous Integration automatisch überprüft und auch die Reviewer werden auf die Erfüllung dieser und weiterer Bedingungen hinweisen. Daher sollte Ihr System wie unten beschrieben eingerichtet sein, um sicherzustellen, dass alle Commits den Richtlinien entsprechen.
tr: Godot'nun kaynak koduna katkıda bulunurken, aşağıda anahatları verilen tarz rehberlerini takip etmenizi bekliyoruz. Bunlardan bazıları, Sürekli Bütünleşme (CI, continous integration) yardımıyla denetlenir ve gözden geçirenler sizden olası sorunları düzeltmenizi isteyeceklerdir, bu nedenle işlemelerinizin rehberleri takip ettiğinden emin olmak için aşağıda anahatlarıyla verilen ayarlamaları sisteminizde uygulamanız en iyisi olacaktır.

source: C++ and Objective-C
de: C++ und Objective-C
tr: C++ ve Objective-C

source: There are no written guidelines, but the code style agreed upon by the developers is enforced via the `clang-format <https://clang.llvm.org/docs/ClangFormat.html>`__ code beautifier, which takes care for you of all our conventions. To name a few:
de: Es gibt keine schriftlichen Richtlinien, aber der Code-Stil, auf den sich die Entwickler geeinigt haben, wird durch den Code-Beautifier `clang-format <https://clang.llvm.org/docs/ClangFormat.html>`__ durchgesetzt, der sich für Sie um alle unsere Konventionen kümmert. Um ein paar zu nennen:

source: Indentation and alignment are both tab based (respectively one and two tabs)
de: Einrückung und Ausrichtung sind beide Tabulator-basiert (jeweils ein und zwei Tabulatoren)
tr: Girintiler ve hizalamaların her ikisi de sekme temellidir (sırayla bir ve iki sekme)

source: One space around math and assignments operators as well as after commas
de: Ein einziges Leerzeichen vor und nach Mathe- und Zuweisungsoperatoren sowie nach Kommas
tr: Matematik ve atama işleçleri ile virgüllerden sonra bir boşluk

source: Pointer and reference operators are affixed to the variable identifier, not to the type name
de: Pointer- und Referenzoperatoren werden an den Variablen-Identifier und nicht an den Typnamen angehängt
tr: İşaretçi ve başvuru işleçleri değişken tanımlayıcısına yapışıktır, tip ismine değil

source: See further down regarding header includes
de: Weitere Informationen zu Header-Includes finden Sie weiter unten
tr: Başlık içermelerine dair daha aşağıya bakın

source: The rules used by clang-format are outlined in the `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ file of the Godot repository.
de: Die von clang-format verwendeten Regeln sind in der Datei `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ des Godot-Repositorys beschrieben.
tr: clang-format tarafından kullanılan kurallar, Godot kod deposundaki `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ dosyasında anahatlarıyla verilmiştir.

source: As long as you ensure that your style matches the surrounding code and that you not introducing trailing whitespace or space-based indentation, you should be fine. If you plan to contribute regularly, however, we strongly advise that you set up clang-format locally to check and automatically fix all your commits.
de: Solange Sie sicherstellen, dass Ihr Stil mit dem umgebenden Code übereinstimmt und dass Sie keine abschließenden Leerzeichen oder Einrückungen mit Leerzeichen einführen, sollte alles in Ordnung sein. Wenn Sie jedoch planen, regelmäßig Beiträge zu leisten, raten wir Ihnen dringend, clang-format lokal einzurichten, um alle Ihre Commits zu prüfen und automatisch zu korrigieren.

source: Godot's code style should *not* be applied to third-party code, i.e. that is included in Godot's source tree but was not written specifically for our project. Such code usually comes from different upstream projects with their own style guides (or lack thereof), and don't want to introduce differences that would make syncing with upstream repositories harder.
de: Der Codestil von Godot sollte *nicht* auf Code von Drittanbietern angewendet werden, d. h. auf Code, der in Godots Quellcode-Baum enthalten ist, aber nicht speziell für unser Projekt geschrieben wurde. Solcher Code stammt in der Regel von verschiedenen Upstream-Projekten mit ihren eigenen Style-Guides (oder ggf. ohne diese), und wir wollen keine Unterschiede einführen, die eine Synchronisation mit Upstream-Repositories erschweren würden.

source: Third-party code is usually included in the ``thirdparty/`` folder and can thus easily be excluded from formatting scripts. For the rare cases where a third-party code snippet needs to be included directly within a Godot file, you can use ``/* clang-format off */`` and ``/* clang-format on */`` to tell clang-format to ignore a chunk of code.
de: Code von Drittanbietern ist normalerweise im Ordner ``thirdparty/`` enthalten und kann daher leicht von Formatierungsskripten ausgeschlossen werden. Für die seltenen Fälle, in denen ein Codeschnipsel eines Drittanbieters direkt in eine Godot-Datei eingebunden werden muss, können Sie ``/* clang-format off */`` und ``/* clang-format on */`` verwenden, um clang-format anzuweisen, ein Stück Code zu ignorieren.
tr: Üçüncü-parti kodlar genellikle ``thirdparty/`` klasöründe dahil edilir ve bu sayede kolaylıkla biçimlendirme betiklerinin dışında tutulabilirler. Ancak, çok az durumda bazı üçüncü-parti kod parçalarının doğrudan Godot dosyalarının içine dahil edilmesi gerekebilir, böyle zamanlarda ``/* clang-format off */`` ve ``/* clang-format on */`` kullanarak `clang-format` 'ın bu kod parçalarını görmezden gelmesini sağlayabilirsiniz.

source: These guidelines only cover code formatting. See :ref:`doc_cpp_usage_guidelines` for a list of language features that are permitted in pull requests.
de: Diese Richtlinien betreffen nur die Formatierung des Codes. Siehe :ref:`doc_cpp_usage_guidelines` für eine Liste von Sprachfeatures, die in Pull Requests erlaubt sind.
tr: Bu rehberler sadece biçimlendirmeyi kapsar. Çekme isteklerinde izin verilen dil özelliklerinin bir listesi için :ref:`doc_cpp_usage_guidelines` sayfasına bakınız.

source: Using clang-format locally
de: Lokale Verwendung von clang-format
tr: `clang-format`'ı yerel olarak kullanmak

source: First of all, you will need to install clang-format. As of now, you need to use **clang-format 13** to be compatible with Godot's format. Later versions might be suitable, but previous versions may not support all used options, or format some things differently, leading to style issues in pull requests.
de: Zuallererst müssen Sie clang-format installieren. Aktuell müssen Sie **clang-format 13** verwenden, um mit Godots Format kompatibel zu sein. Spätere Versionen könnten geeignet sein, aber frühere Versionen unterstützen möglicherweise nicht alle verwendeten Optionen oder formatieren einige Dinge anders, was zu Stil-Problemen in Pull Requests führt.
tr: İlk olarak, clang-format 'ı kurmanız gerekecek. Bugün için, Godot biçimleriyle uyumlu olmak için **clang-format 13** kullanmanız gerekiyor. Sonraki sürümler uygun olmayabilirler, ve önceki sürümler de kullanılan seçenekleri desteklemeyebilir, ya da bir şeyleri farklı biçimlendirebilirler; bu da çekme isteklerinde tarz sorunlarına yol açacaktır.

source: Here's how to install clang-format:
de: So wird clang-format installiert:
tr: clang-format 'ı şu şekilde kurabilirsiniz:

source: Linux: It will usually be available out-of-the-box with the clang toolchain packaged by your distribution. If your distro version is not the required one, you can download a pre-compiled version from the `LLVM website <https://releases.llvm.org/download.html>`__, or if you are on a Debian derivative, use the `upstream repos <https://apt.llvm.org/>`__.
de: Linux: Normalerweise ist es mit der clang-Toolchain, die in Ihrer Distribution enthalten ist, sofort verfügbar. Wenn Ihre Distribution nicht die notwendige Version enthält, können Sie eine vorkompilierte Version von der `LLVM-Website <https://releases.llvm.org/download.html>`__ herunterladen, oder wenn Sie ein Debian-Derivat benutzen, verwenden Sie die `Upstream-Repos <https://apt.llvm.org/>`__.

source: macOS and Windows: You can download precompiled binaries from the `LLVM website <https://releases.llvm.org/download.html>`__. You may need to add the path to the binary's folder to your system's ``PATH`` environment variable to be able to call ``clang-format`` out of the box.
de: macOS und Windows: Sie können vorkompilierte Binärdateien von der `LLVM Website <https://releases.llvm.org/download.html>`__ herunterladen. Möglicherweise müssen Sie den Pfad zum Ordner der Binärdatei zur ``PATH``-Umgebungsvariablen Ihres Systems hinzufügen, um ``clang-format`` direkt aufrufen zu können.

source: You then have different possibilities to apply clang-format to your changes:
de: Sie haben dann verschiedene Möglichkeiten, das Clang-Format auf Ihre Änderungen anzuwenden:
tr: Bundan sonra, yaptığınız değişiklikler üzerine clang-format uygulamak için değişik olasılıklarınız olacak:

source: Manual usage
de: Manuelle Verwendung
tr: Elden kullanım

source: You can apply clang-format manually for one or more files with the following command:
de: Mit dem folgenden Befehl können Sie clang-format manuell auf eine oder mehrere Dateien anwenden:

source: ``-i`` means that the changes should be written directly to the file (by default clang-format would only output the fixed version to the terminal).
de: ``-i`` bedeutet, dass die Änderungen direkt in die Datei geschrieben werden sollen (standardmäßig würde clang-format die geänderte Version nur in das Terminal ausgeben).
tr: ``-i`` 'nin anlamı, değişikliklerin doğrudan dosyaya geri yazılacağıdır (varsayılan olarak, clang-format düzeltilmiş kodu uç-birime yazdırır).

source: The path can point to several files, either one after the other or using wildcards like in a typical Unix shell. Be careful when globbing so that you don't run clang-format on compiled objects (.o and .a files) that are in Godot's tree. So better use ``core/*.{cpp,h}`` than ``core/*``.
de: Der Pfad kann auf mehrere Dateien zeigen, entweder nacheinander oder mit Platzhaltern wie in einer typischen Unix-Shell. Seien Sie beim Globbing vorsichtig, damit Sie nicht clang-format auf kompilierte Objekte (.o- und .a-Dateien) anwenden, die sich in Godots Dateibaum befinden. Verwenden Sie also lieber ``core/*.{cpp,h}`` als ``core/*``.
tr: Yol, birden fazla dosyayı işaret edebilir; birinin ardına diğeri yazılarak, ya da Unix kabuklarında sık kullanılan eşleme karakterleri kullanarak. Ama bu topaklamayı yaparken dikkat edip clang-format'ı derlenmiş nesneler üzerinde çalıştırmayın; Godot klasör ağacındaki .o ve .a dosyaları. Yani en iyisi, mesela ``core/*`` değil ``core/*.{cpp,h}`` kullanın.

source: For ease of use, we provide a pre-commit hook for Git that will run clang-format automatically on all your commits to check them, and let you apply its changes in the final commit.
de: Zur Vereinfachung bieten wir einen Pre-Commit-Hook für Git an, der über clang-format automatisch alle Ihre Commits prüft, damit Sie die Änderungen in den endgültigen Commit übernehmen können.
tr: Kullanım kolaylığı için, Git için bir ön-işleme kancası sunuyoruz; her işlemenizi kontrol etmek için önce otomatik olarak `clang-format` çalıştırıyor ve değişiklikleri son işlemenize uygulamanıza yardım ediyor.

source: This "hook" is a script that can be found in ``misc/hooks``, refer to that folder's README.md for installation instructions.
de: Dieser "Hook" ist ein Skript, das in ``misc/hooks`` zu finden ist. Lesen Sie die README.md dieses Ordners für die Installationsanweisungen.

source: If your clang-format is not in the ``PATH``, you may have to edit the ``pre-commit-clang-format`` to point to the correct binary for it to work. The hook was tested on Linux and macOS, but should also work in the Git Shell on Windows.
de: Wenn sich Ihr clang-format nicht im ``PATH`` befindet, müssen Sie möglicherweise die Datei ``pre-commit-clang-format`` bearbeiten, um auf das richtige Binary zu verweisen, damit es funktioniert. Der Hook wurde unter Linux und macOS getestet, sollte aber auch in der Git-Shell unter Windows funktionieren.
tr: Eğer `clang-format` geçerli ``PATH`` içerinde değilse, bunun çalışabilmesi için ``pre-commit-clang-format`` değerini ikili-tip dosyanın gerçek yoluna ayarlayın. Kanca, Linux ve macOS üzerinde deneniştir, ama Windows için Git Shell içinde de sorunsuz çalışıyor olması gerekiyor.

source: Most IDEs or code editors have beautifier plugins that can be configured to run clang-format automatically, for example, each time you save a file.
de: Die meisten IDEs oder Code-Editoren verfügen über Beautifier-Plugins, die so konfiguriert werden können, dass clang-format automatisch ausgeführt wird, beispielsweise jedes Mal, wenn Sie eine Datei speichern.

source: Here is a non-exhaustive list of beautifier plugins for some IDEs:
de: Hier ist eine unvollständige Liste von Beautifier-Plugins für einige IDEs:
tr: Aşağıda, bazı IDEler için güzelleştirici eklentilerin küçük bir listesi var:

source: CLion: Starting from version ``2019.1``, no plugin is required. Instead, enable `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__
de: CLion: Ab der Version ``2019.1`` wird kein Plugin mehr benötigt. Aktivieren Sie stattdessen `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__
tr: CLion: ``2019.1`` sürümünden bu yana hiç bir eklenti gerekmiyor. Bunun yerine sadece `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__ seçeneğini etkinleştirin

source: (Pull requests are welcome to extend this list with tested plugins.)
de: (Pull Requests sind willkommen, um diese Liste mit getesteten Plugins zu erweitern.)

source: When adding new C++ or Objective-C files or including new headers in existing ones, the following rules should be followed:
de: Beim Hinzufügen neuer C++ oder Objective-C Dateien oder beim Einfügen neuer Header in vorhandene Dateien, sollten die folgenden Regeln beachtet werden:
tr: Yeni C++ yada Objective-C dosyası, ya da var olanlara yeni başlık dosyası içermeleri eklerken, aşağıdaki kurallara uyulmalıdır:

source: The first lines in the file should be Godot's copyright header and MIT license, copy-pasted from another file. Make sure to adjust the filename.
de: Die ersten Zeilen in der Datei sollten Godots Copyright-Header und MIT-Lizenz sein, die aus einer anderen Datei kopiert wurden. Achten Sie darauf, den Dateinamen anzupassen.
tr: Dosyadaki ilk satırlar, Godot'nun telif hakkı başlığı ve MIT lisansı olmalıdır; başka bir dosyadan aynen kopyalayın. İçerisinde dosya ismini düzelttiğinizden emin olun.

source: In a ``.h`` header, include guards should be used with the form ``FILENAME_H``.
de: In einem ``.h``-Header sollten Include-Guards in der Form ``DATEINAME_H`` verwendet werden.
tr: Bir ``.h`` başlık dosyasında, içerme korumaları ``DOSYANINISMI_H`` ismi ile birlikte kullanılmalıdır.

source: In a ``.cpp`` file (e.g. ``filename.cpp``), the first include should be the one where the class is declared (e.g. ``#include "filename.h"``), followed by an empty line for separation.
de: In einer ``.cpp``-Datei (z.B. ``dateiname.cpp``) sollte das erste Include dasjenige sein, in dem die Klasse deklariert wird (z.B. ``#include "dateiname.h"``), gefolgt von einer Leerzeile zur Trennung.
tr: Bir ``.cpp`` dosyasında (mesela ``dosyaismi.cpp``), yazılacak ilk içerme sınıfın bildirildiği dosya olmalıdır (mesela ``#include "dosyaismi.h"``), ve sonraki satır ayrım yapmak için boş bırakılmalıdır.

source: Then come headers from Godot's own code base, included in alphabetical order (enforced by ``clang-format``) with paths relative to the root folder. Those includes should be done with quotes, e.g. ``#include "core/object.h"``. The block of Godot header includes should then be followed by an empty line for separation.
de: Dann kommen Header aus Godots eigener Code-Basis, die in alphabetischer Reihenfolge (erzwungen durch ``clang-format``) mit Pfaden relativ zum Stammverzeichnis eingebunden werden. Diese Includes sollten mit Anführungszeichen eingebunden werden, z.B. ``#include "core/object.h"``. Auf den Block der Godot-Header-Includes sollte dann eine Leerzeile zur Trennung folgen.
tr: Daha sonra, Godot'nun kendi kod temelindeki başlıkların içermeleri, kök dizinden olan göreceli yollarına göre, alfabe sırasına göre yapılır (``clang-format`` tarafından zorunlu tutulur). Bu içermeler tırnak işareti içinde olmalıdır, mesela ``#include "core/object.h"``. Godot başlıklarını içerme bölümünün ardından gelen satır, yine ayrım amaçlı, boş bırakılmalıdır.

source: Finally, third-party headers (either from ``thirdparty`` or from the system's include paths) come next and should be included with the < and > symbols, e.g. ``#include <png.h>``. The block of third-party headers should also be followed by an empty line for separation.
de: Schließlich kommen Drittanbieter-Header (entweder von ``thirdparty`` oder aus den Include-Pfaden des Systems) und sollten mit den Symbolen < und > eingebunden werden, z.B. ``#include <png.h>``. Auf den Block der Drittanbieter-Header sollte ebenfalls eine Leerzeile zur Trennung folgen.
tr: Son olarak, üçüncü-taraf başlıklar (ister ``üçüncütaraf`` isterse sistemin içerme yollarından olsun) sırayı alır ve < ile > simgeleri arasında yer almaları gerekir, mesela ``#include <png.h>``. üçüncü-taraf başlıkların bölümü de, diğerleri gibi, ayrım amaçlı boş bir satır ile devam etmelidir.

source: Godot and third-party headers should be included in the file that requires them, i.e. in the `.h` header if used in the declarative code or in the `.cpp` if used only in the imperative code.
de: Godot- und Drittanbieter-Header sollten in die Datei aufgenommen werden, die sie benötigt, d. h. in den `.h`-Header, wenn sie im deklarativen Code verwendet werden, oder in die `.cpp`, wenn sie nur im imperativen Code verwendet werden.
tr: Godot ve üçüncü-taraf başlıklar, bunlara ihtiyaç duyan dosyanın içinde kullanılmalıdır; mesela bildirim yapmak için kullanılacaksa `.h` başlık dosyasında, eylemsel kod olarak kullanılacaksa `.cpp` içerisinde.

source: Example:
de: Beispiel:
tr: Örnek:

source: Godot's Java code (mostly in ``platform/android``) is also enforced via ``clang-format``, so see the instructions above to set it up. Keep in mind that this style guide only applies to code written and maintained by Godot, not third-party code such as the ``java/src/com/google`` subfolder.
de: Godots Java-Code (meist in ``platform/android``) wird auch über ``clang-format`` erzwungen - siehe die Anweisungen oben, um es einzurichten. Beachten Sie, dass dieser Style-Guide nur für Code gilt, der von Godot geschrieben und gewartet wird, nicht für Code von Drittanbietern wie dem Unterordner ``java/src/com/google``.
tr: Godot'nun Java kodu da (çoğunlukla ``platform/android`` altında) yine ``clang-format`` tarafından zorunlu tutulur, bu nedenle ayarlamak için yukarıdaki talimatları takip edin. Ama unutmayın, burada bahsedilen tarz rehberi sadece Godot tarafından yazılıp bakımı yapılan kod için geçerlidir; ``java/src/com/google`` klasörü gibi üçüncü-taraf kodlar buna dahil değildir.

source: Godot's SCons buildsystem is written in Python, and various scripts included in the source tree are also using Python.
de: Das SCons-Buildsystem von Godot ist in Python geschrieben, und verschiedene im Quellcode-Baum enthaltene Skripte verwenden ebenfalls Python.
tr: Godot'nun SCons derleme sistemi Python ile yazılmıştır, ve kaynak ağacında dahil edilen çeşitli betikler de yine Python kullanır.

source: For those, we follow the `Black style guide <https://github.com/psf/black#the-black-code-style>`__. Blacken your Python changes using `Black <https://pypi.org/project/black/>`__.
de: Für diese folgen wir dem `Black Code Style <https://github.com/psf/black#the-black-code-style>`__. "Blacken" Sie ihre eigenen Python-Änderungen mit `Black <https://pypi.org/project/black/>`__.
tr: Bunlar için, `Black tarz rehberi <https://github.com/psf/black#the-black-code-style>`__ 'ni takip ediyoruz. Python değişikliklerinizi `Black <https://pypi.org/project/black/>`__ (kara) kullanarak karartabilirsiniz..

source: Using black locally
de: Black lokal verwenden
tr: `black` 'i yerel olarak kullanma

source: First of all, you will need to install Black. Black requires Python 3.7+ to run.
de: Zuerst müssen Sie Black installieren. Black benötigt zur Ausführung Python 3.7+.

source: Here's how to install black:
de: So wird Black installiert:
tr: `black` 'in kurulumu şu şekildedir:

source: You then have different possibilities to apply black to your changes:
de: Sie haben dann verschiedene Möglichkeiten, Black auf Ihre Änderungen anzuwenden:
tr: Bundan sonra, yaptığınız değişiklikler üzerinde `black` uygulamak için çok çeşitli olasılıklar mevcuttur:

source: You can apply ``black`` manually to one or more files with the following command:
de: Sie können ``Black`` manuell auf eine oder mehrere Dateien mit dem folgenden Befehl anwenden:
tr: Aşağıdaki komutu kullanarak, bir veya daha fazla dosya üzerinde ``black`` 'i elden uygulayabilirsiniz:

source: ``-l 120`` means that the allowed number of characters per line is 120. This number was agreed upon by the developers.
de: ``-l 120`` bedeutet, dass die zulässige Anzahl von Zeichen pro Zeile 120 beträgt. Diese Anzahl wurde von den Entwicklern vereinbart.
tr: Burada ``-l 120`` 'nin anlamı, satır başına izin verilen karakter sayısının 120 olmasıdır. Bu sayı, geliştiriciler arasında kararlaştırılmış bir sayıdır.

source: The path can point to several files, either one after the other or using wildcards like in a typical Unix shell.
de: Der Pfad kann auf mehrere Dateien verweisen, entweder nacheinander oder mit Platzhaltern wie in einer typischen Unix-Shell.
tr: Yol, bir çok dosyaya işaret edebilir; birinin ardına diğeri yazılarak, ya da Unix kabuklarında sık kullanılan eşleme karakterleri kullanarak.

source: For ease of use, we provide a pre-commit hook for Git that will run black automatically on all your commits to check them, and let you apply its changes in the final commit.
de: Um die Benutzung zu erleichtern, bieten wir einen Pre-Commit-Hook für Git an, der automatisch bei allen Ihren Commits Black zur Überprüfung ausführt und mit dem Sie dessen Änderungen auf das endgültige Commit anwenden können.
tr: Kullanım kolaylığı için, Git için bir ön-işleme kancası sunuyoruz; her işlemenizi kontrol etmek için önce otomatik olarak `black` çalıştırıyor ve değişiklikleri son işlemenize uygulamanıza yardım ediyor.

source: This "hook" is a script which can be found in ``misc/hooks``. Refer to that folder's ``README.md`` for installation instructions.
de: Dieser "Hook" ist ein Skript, das unter ``misc/hooks`` zu finden ist. In der ``README.md`` des Ordners finden Sie Anweisungen zur Installation.
tr: Bu "kanca", ``misc/hooks`` altında bulabileceğiniz bir betik dosyasıdır. Kurulum talimatları için aynı klasördeki README.md dosyasına başvurun.
