Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/code_style_guidelines.po
Languages: de, tr

source: Many IDEs or code editors have beautifier plugins that can be configured to run black automatically, for example, each time you save a file. For details, you can check `Black editor integration <https://github.com/psf/black#editor-integration>`__.
de: Viele IDEs oder Code-Editoren verfügen über Beautifier-Plugins, die so konfiguriert werden können, dass Black automatisch ausgeführt wird, beispielsweise jedes Mal, wenn Sie eine Datei speichern. Weitere Informationen finden Sie unter `Black im Editor integrieren <https://github.com/psf/black#editor-integration>`__.

source: Comment style guide
de: Style Guide für Kommentare
tr: Yorum tarzı rehberi

source: This comment style guide applies to all programming languages used within Godot's codebase.
de: Dieser Kommentar-Style Guide gilt für alle Programmiersprachen, die innerhalb der Codebasis von Godot verwendet werden.
tr: Bu yorum tarzı rehberi, Godot'nun kodtemeli içerisinde kullanılan bütün dilleri kapsar.

source: Begin comments with a space character to distinguish them from disabled code.
de: Verwenden Sie am Anfang von Kommentaren ein Leerzeichen, um sie von deaktiviertem Code zu unterscheiden.
tr: Yorumlara başlarken başında bir boşluk kullanın (yorum karekterinden sonra); bu şekilde devredışı bırakılmış kod ile karıştırılmaz.

source: Use sentence case for comments. Begin comments with an uppercase character and always end them with a period.
de: Verwenden Sie ganze Sätze für Kommentare. Kommentare sollen mit einem Großbuchstaben beginnen und immer mit einem Punkt enden.
tr: Yorumlarda cümle harf boyu kullanın. Yorumlara büyük harf ile başlayın, ve bir nokta ile bitirin.

source: Reference variable/function names and values using backticks.
de: Referenzieren Sie Variablen-/Funktionsnamen und -werte mit Backticks.
tr: Değişken/fonksiyon isimlerine ve değerlere başvuruları yazarken kesme işareti içinde kullanın (tek/çift tırnak değil).

source: Wrap comments to ~100 characters.
de: Brechen Sie Kommentare bei ~100 Zeichen um.
tr: Yorum satırlarını ~100 karakterle sınırlayıp alt satırda devam edin.

source: You can use ``TODO:``, ``FIXME:``, ``NOTE:``, or ``HACK:`` as admonitions when needed.
de: Sie können ``TODO:``, ``FIXME:``, ``NOTE:``, oder ``HACK:`` als Ermahnungen verwenden, wenn es nötig ist.

source: **Example:**
de: **Beispiel:**
tr: **Örnek:**

source: Don't repeat what the code says in a comment. Explain the *why* rather than *how*.
de: Wiederholen Sie nicht, was der Code in einem Kommentar sagt. Erklären Sie eher das *Warum* als das *Wie*.
tr: Kodun içinde açık olanları yorumlarda tekrar etmeyin. *Nasıl* olduğunu değil, *neden* öyle olduğunu açıklayın.

source: **Bad:**
de: **Schlecht:**
tr: **Kötü Örnek:**

source: You can use Javadoc-style comments above function or macro definitions. It's recommended to use Javadoc-style comments *only* for methods which are not exposed to scripting. This is because exposed methods should be documented in the :ref:`class reference XML <doc_updating_the_class_reference>` instead.
de: Sie können Kommentare im Javadoc-Stil über Funktions- oder Makrodefinitionen verwenden. Es wird empfohlen, Kommentare im Javadoc-Stil *nur* für Methoden zu verwenden, die für Skripting nicht sichtbar sind. Dies liegt daran, dass diese Methoden stattdessen im :ref:`Klassenreferenz-XML <doc_updating_the_class_reference>` dokumentiert werden sollten.
tr: Fonksiyonların ve makro tanımlarının üzerinde Javadoc-tarzı yorumlar kullanabilirsiniz. Ancak, bu Javadoc-tarzı yorumları *sadece* betiklere açılmayan yöntemlerde kullanmanızı tavsiye ederiz. Bunun nedeni, dışa açılan yöntemlerin belgelenmesinin :ref:`sınıf başvurusu XML <doc_updating_the_class_reference>` içerisinde yapılmasının gerekliliğidir.

source: For member variables, don't use Javadoc-style comments but use single-line comments instead:
de: Verwenden Sie für Member-Variablen keine Kommentare im Javadoc-Stil, sondern verwenden Sie stattdessen einzeilige Kommentare:
tr: Üye değişkenler için, Javadoc-tarzı yorumlar kullanmayın, bunu yerine tek-satırlık yorumlar kullanın:

source: Translation status
de: Übersetzungsstatus
tr: Çeviri durumu

source: Installation
tr: Kurulum

source: Pre-commit hook
tr: Ön-işleme kancası

source: IDE plugin
tr: IDE eklentisi

source: Header includes
tr: Başlık dosya içermeleri

source: Editor integration
tr: Düzenleyici bütünleşmesi
