Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/cpp_usage_guidelines.po
Languages: de, zh_tw

source: C++ usage guidelines
de: C++-Verwendungsrichtlinien
zh_tw: Bug 分級方針

source: Rationale
de: Hintergrund
zh_tw: 理由

source: Since Godot 4.0, the C++ standard used throughout the codebase is a subset of **C++17**. While modern C++ brings a lot of opportunities to write faster, more readable code, we chose to restrict our usage of C++ to a subset for a few reasons:
de: Seit Godot 4.0 wird in der gesamten Codebasis eine Untermenge des **C++17**-Standards verwendet. Obwohl modernes C++ viele Möglichkeiten bietet, schnelleren, besser lesbaren Code zu schreiben, haben wir uns aus einigen Gründen dafür entschieden, unsere Verwendung von C++ auf eine Untermenge zu beschränken:
zh_tw: 從 Godot 4.0 開始，程式碼庫中所使用的 C++ 標準是 **C++17** 的子集。現代 C++ 帶來了許多機會，讓我們能夠編寫更快、更易讀的程式碼，但我們選擇將我們對 C++ 的使用限制在一個子集中，原因有這麼幾點：

source: It makes it easier to review code in online editors. This is because engine contributors don't always have access to a full-featured IDE while reviewing code.
de: Das Reviewen von Code in Online-Editoren wird dadurch erleichtert. Der Grund dafür ist, dass die Mitwirkenden an der Engine nicht immer Zugang zu einer vollwertigen IDE haben, wenn sie den Code reviewen.
zh_tw: 易於使用線上編輯器審核程式碼。這是因為引擎的貢獻者在審核程式碼時並不總是可以使用完整的 IDE。

source: It makes the code easier to grasp for beginner contributors (who may not be professional C++ programmers). Godot's codebase is known to be easy to learn from, and we'd like to keep it that way.
de: Der Code wird für Anfänger (die vielleicht keine professionellen C++-Programmierer sind) leichter verständlich. Die Codebasis von Godot ist dafür bekannt, dass sie leicht zu erlernen ist, und wir möchten, dass das auch so bleibt.
zh_tw: 易於讓新手貢獻者掌握程式碼（他們可能不是專業的 C++ 程式師）。Godot 的程式碼庫是公認的易於學習，我們希望繼續保持。

source: To get your pull request merged, it needs to follow the C++ usage guidelines outlined here. Of course, you can use features not allowed here in your own C++ modules or GDExtensions.
de: Damit Ihr Pull Request gemergt werden kann, muss er den hier beschriebenen C++-Verwendungsrichtlinien entsprechen. Natürlich können Sie Features, die hier nicht erlaubt sind, in Ihren eigenen C++-Modulen oder GDExtensions verwenden.
zh_tw: 要讓你的拉取請求被合併，就需要遵守這裡描述的 C++ 使用規範。當然，在你自己的 C++ 模組或 GDNative 腳本中是可以使用此處禁止的功能的。

source: Prior to Godot 4.0, the C++ standard used throughout the codebase was C++03, with a handful of C++14 extensions. If you are contributing a pull request to the `3.x` branch rather than `master`, your code can't use C++17 features. Instead, your code must be able to be built with a C++14 compiler.
de: Vor Godot 4.0 galt in der gesamten Codebasis der C++03-Standard, mit einer Handvoll C++14-Erweiterungen. Wenn Sie einen Pull Request für den `3.x`-Branch und nicht für den `master`-Branch einreichen, darf Ihr Code keine C++17-Features verwenden. Stattdessen muss Ihr Code mit einem C++14-Compiler erstellt werden können.
zh_tw: 在 Godot 4.0 之前的版本中，程式碼庫所使用的 C++ 標準曾是 C++03，外加一些 C++14 擴充。如果你是在為 `3.x` 分支提交拉取請求而不是 `master`，就不能使用 C++17 的功能。請確保你的程式碼能夠使用 C++14 編譯器建構。

source: The guidelines below don't apply to third-party dependencies, although we generally favor small libraries instead of larger solutions. See also :ref:`doc_best_practices_for_engine_contributors`.
de: Die folgenden Richtlinien gelten nicht für Abhängigkeiten von Drittanbietern, obwohl wir im Allgemeinen kleine Bibliotheken den größeren Lösungen vorziehen. Siehe auch :ref:`doc_best_practices_for_engine_contributors`.
zh_tw: 以下規範並不適用於協力廠商依賴，雖然我們一般傾向於使用小型的庫而不是大型的解決方案。另請參閱 :ref:`doc_best_practices_for_engine_contributors`。

source: See :ref:`doc_code_style_guidelines` for formatting guidelines.
de: Siehe :ref:`doc_code_style_guidelines` für Formatierungsrichtlinien.
zh_tw: 請參考 :ref:`doc_running_code_in_the_editor` 以瞭解詳情。

source: Disallowed features
de: Unzulässige Features
zh_tw: 這樣的做法有許多優點：

source: **Any feature not listed below is allowed.** Using features like ``constexpr`` variables and ``nullptr`` is encouraged when possible. Still, try to keep your use of modern C++ features conservative. Their use needs to serve a real purpose, such as improving code readability or performance.
de: **Jedes Feature, das unten nicht aufgeführt ist, ist erlaubt.** Die Verwendung von Features wie ``constexpr``-Variablen und ``nullptr`` wird empfohlen, wenn möglich. Versuchen Sie dennoch, den Gebrauch moderner C++-Features konservativ zu halten. Ihre Verwendung muss einem echten Zweck dienen, wie z.B. der Verbesserung der Lesbarkeit des Codes oder der Performance.
zh_tw: **未在下方列出的功能都是允許的。**鼓勵盡可能使用 ``constexpr`` 變數和 ``nullptr`` 等功能。不過請您在使用現代 C++ 功能時保持保守。使用時應當為實際的目的服務，例如提升程式碼可讀性或性能。

source: Standard Template Library
de: STL (Standard Template Library)
zh_tw: STL(Standard Template Library)

source: We don't allow using the `STL <https://en.wikipedia.org/wiki/Standard_Template_Library>`__ as Godot provides its own data types (among other things). See :ref:`doc_faq_why_not_stl` for more information.
de: Wir erlauben nicht die Verwendung der `STL <https://en.wikipedia.org/wiki/Standard_Template_Library>`__, da Godot (unter anderem) seine eigenen Datentypen bereitstellt. Siehe :ref:`doc_faq_why_not_stl` für weitere Informationen.
zh_tw: 我們不允許使用 `STL <https://en.wikipedia.org/wiki/Standard_Template_Library>`__，因為 Godot 提供了自有的資料型別（及其他工具）。詳情請參閱 :ref:`doc_faq_why_not_stl`。

source: This means that pull requests should **not** use ``std::string``, ``std::vector`` and the like. Instead, use Godot's datatypes as described below:
de: Das bedeutet, dass Pull Requests **nicht** ``std::string``, ``std::vector`` und dergleichen verwenden sollten. Verwenden Sie stattdessen die Datentypen von Godot, wie unten beschrieben:
zh_tw: 這意味著拉取請求中**不應該**使用 ``std::string``、``std::vector`` 等工具。請使用如下所述的 Godot 資料型別代替：

source: Use ``String`` instead of ``std::string``.
de: Verwenden Sie ``String`` anstelle von ``std::string``.
zh_tw: 使用 ``or`` 而不是 ``||`` 。

source: Use ``Vector`` instead of ``std::vector``. In some cases, ``LocalVector`` can be used as an alternative (ask core developers first).
de: Verwenden Sie ``Vector`` anstelle von ``std::vector``. In einigen Fällen kann ``LocalVector`` als Alternative verwendet werden (fragen Sie zuerst die Core-Entwickler).
zh_tw: 使用 ``Vector`` 代替 ``std::vector``。某些情況下也可以用 ``LocalVector`` 代替（請先諮詢核心開發者）。

source: Use ``Array`` instead of ``std::array``.
de: Verwenden Sie ``Array`` anstelle von ``std::array``.
zh_tw: 使用 ``or`` 而不是 ``||`` 。

source: Godot also has a List datatype (which is a linked list). While List is already used in the codebase, it typically performs worse than other datatypes like Vector and Array. Therefore, List should be avoided in new code unless necessary.
de: Godot verfügt auch über einen List-Datentyp (eine Linked-List). List wird zwar bereits in der Codebasis verwendet, hat aber in der Regel eine schlechtere Performance als andere Datentypen wie Vector und Array. Daher sollte List in neuem Code vermieden werden, sofern dies nicht notwendig ist.
zh_tw: Godot 還有一個 List 資料型別（是個鏈表）。雖然 List 在程式碼庫中有所使用，但一般性能都比 Vector 和 Array 等資料型別要差。因此，除非必要，否則應該避免在新程式碼中使用 List。

source: ``auto`` keyword
zh_tw: Onready 關鍵字

source: Please don't use the ``auto`` keyword for type inference. While it can avoid repetition, it can also lead to confusing code:
de: Bitte verwenden Sie nicht das Keyword ``auto`` für die Typinferenz. Es kann zwar Wiederholungen vermeiden, aber es kann auch zu verwirrendem Code führen:
zh_tw: 請勿使用 ``auto`` 關鍵字進行型別推導。雖然可以避免重複，但也可能導致令人費解的程式碼：

source: Keep in mind hover documentation often isn't readily available for pull request reviewers. Most of the time, reviewers will use GitHub's online viewer to review pull requests.
de: Beachten Sie, dass die Hover-Dokumentation für die Reviewer von Pull Requests oft nicht ohne Weiteres verfügbar ist. In den meisten Fällen werden die Reviewer den Online-Viewer von GitHub verwenden, um Pull Requests zu reviewen.
zh_tw: 請記住，拉取請求的審核者一般是沒有懸停文件的。大多數情況下，審核者是用 GitHub 的線上檢視器審核拉取請求的。

source: We chose to forbid ``auto`` instead of allowing it on a case-by-case basis to avoid having to decide on difficult edge cases. Thank you for your understanding.
de: Wir haben uns dafür entschieden, ``auto`` zu verbieten, anstatt es von Fall zu Fall zu erlauben, um zu vermeiden, dass wir über schwierige Grenzfälle entscheiden müssen. Wir danken Ihnen für Ihr Verständnis.
zh_tw: 為了避免需要在難以抉擇的極端情況上下定論的情況發生，我們選擇禁止 ``auto``，不允許特事特辦。感謝您的理解。

source: Lambdas
de: Lambda-Ausdrücke
zh_tw: Lambda

source: Lambdas should be used conservatively when they make code effectively faster or simpler, and do not impede readability. Please ask before using lambdas in a pull request.
de: Lambda-Ausdrücke sollten konservativ verwendet werden, und nur, wenn sie den Code effektiv schneller oder einfacher machen und die Lesbarkeit nicht beeinträchtigen. Bitte fragen Sie, bevor Sie Lambdas in einem Pull Request verwenden.
zh_tw: 應該保守地使用 lambda，需要在能讓程式碼更快或者更簡單的同時，不妨礙可讀性。請在拉取請求中使用 lambda 前先詢問。

source: ``#pragma once`` directive
de: ``#pragma once``-Direktive
zh_tw: ``#pragma once`` 指令

source: To follow the existing style, please use standard ``#ifdef``-based include guards instead of ``#pragma once`` in new files.
de: Um dem bestehenden Stil zu folgen, verwenden Sie bitte die Standard ``#ifdef``-basierten Include-Guards anstelle von ``#pragma once`` in neuen Dateien.
zh_tw: 為了遵循現有風格，請在新檔中使用標準的基於 ``#ifdef`` 的包含保護，不要使用 ``#pragma once``。

source: See :ref:`doc_code_style_guidelines_header_includes` for guidelines on sorting includes in C++ and Objective-C files.
de: Siehe :ref:`doc_code_style_guidelines_header_includes` für Richtlinien zur Sortierung von Includes in C++ und Objective-C Dateien.
zh_tw: C++ 和 Objective-C 檔中 include 的排序規範請參閱 :ref:`doc_code_style_guidelines_header_includes`。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
