Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_antialiasing.po
Languages: de, zh_cn, zh_tw

source: 2D antialiasing
zh_cn: **2D 抗锯齿**
zh_tw: **抗鋸齒：**

source: Godot also supports antialiasing in 3D rendering. This is covered on the :ref:`doc_3d_antialiasing` page.
de: Godot unterstützt auch Antialiasing beim 3D-Rendering. Dies wird auf der Seite :ref:`doc_3d_antialiasing` behandelt.
zh_cn: Godot 同样支持 3D 抗锯齿。参看 :ref:`doc_3d_antialiasing` 页面。
zh_tw: Godot 同樣支援 3D 抗鋸齒。參看 :ref:`doc_3d_antialiasing` 頁面。

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: Due to their limited resolution, scenes rendered in 2D can exhibit aliasing artifacts. These artifacts usually manifest in the form of a "staircase" effect on geometry edges, and are most noticeable when using nodes such as :ref:`class_Line2D`, :ref:`class_Polygon2D` or :ref:`class_TextureProgressBar`. :ref:`doc_custom_drawing_in_2d` can also have aliasing artifacts for methods that don't support antialiasing.
de: Aufgrund ihrer begrenzten Auflösung können in 2D gerenderte Szenen Aliasing-Artefakte aufweisen. Diese Artefakte manifestieren sich in der Regel in Form eines "Treppen"-Effekts an Geometriekanten und sind am auffälligsten, wenn Nodes wie :ref:`class_Line2D`, :ref:`class_Polygon2D` oder :ref:`class_TextureProgressBar` verwendet werden. :ref:`doc_custom_drawing_in_2d` kann ebenfalls Aliasing-Artefakte für Methoden aufweisen, die kein Antialiasing unterstützen.
zh_cn: 由于分辨率有限，以 2D 渲染的场景可能会出现锯齿现象。 这些伪影通常以几何边缘上的“楼梯”效果的形式出现，并且在使用诸如 :ref:`class_Line2D`、 :ref:`class_Polygon2D` 或 :ref:`class_TextureProgressBar` 等节点时最为明显。 :ref:`doc_custom_drawing_in_2d` 对于不支持抗锯齿的方法也可能会出现锯齿现象。
zh_tw: 由於其有限的解析度，以2D算繪的場景可能出現鋸齒偽影。這些偽影通常以幾何邊緣上的“樓梯狀”效果的形式呈現，並且在使用節點（如 :ref:`class_Line2D`, :ref:`class_Polygon2D` 或者 :ref:`class_TextureProgressBar`. :ref:`doc_custom_drawing_in_2d`）時最為顯著。對於不支援消除鋸齒的方法，也可能出現鋸齒偽影。

source: In the example below, you can notice how edges have a blocky appearance:
de: Im folgenden Beispiel sehen Sie, wie die Kanten blockartig aussehen:
zh_cn: 在下面的示例中，你可以看到边缘呈现出块状：
zh_tw: 在下面的範例中，你可以看到邊緣呈現出塊狀：

source: Image is scaled by 2× with nearest-neighbor filtering to make aliasing more noticeable.
de: Das Bild wurde um das zweifache skaliert und mit einem Nearest-Neighbor-Filter versehen, um Aliasing deutlicher zu machen.
zh_cn: 图像缩放 2 倍并进行近邻滤波，使混叠现象更加明显。
zh_tw: 圖像縮放 2 倍並進行近鄰濾波，使混疊現象更加明顯。

source: To combat this, Godot supports several methods of enabling antialiasing on 2D rendering.
de: Um dem entgegenzuwirken, unterstützt Godot mehrere Methoden zur Aktivierung von Antialiasing beim 2D-Rendering.
zh_cn: 为了解决这个问题，Godot 支持多种在 2D 渲染中启用抗锯齿的方法。
zh_tw: 為了解決這個問題，Godot 支援多種在 2D 算繪中啟用抗鋸齒的方法。

source: Antialiasing property in Line2D and custom drawing
de: Die Antialiasing-Property in Line2D und benutzerdefiniertes Zeichnen
zh_cn: Line2D 和自定义绘图中的反锯齿属性
zh_tw: Line2D 和自訂繪圖中的反鋸齒屬性

source: This is the recommended method, as it has a lower performance impact in most cases.
de: Dies ist die empfohlene Methode, da sie in den meisten Fällen eine geringere Auswirkung auf die Performance hat.
zh_cn: 这是推荐的方法，因为在大多数情况下，这种方法对性能的影响较小。
zh_tw: 這是推薦的方法，因為在大多數情況下，這種方法對性能的影響較小。

source: Line2D has an **Antialiased** property which you can enable in the inspector. Also, several methods for :ref:`doc_custom_drawing_in_2d` support an optional ``antialiased`` parameter, which can be set to ``true`` when calling the function.
de: Line2D hat eine **Antialiased**-Property, die Sie im Inspektor aktivieren können. Außerdem unterstützen mehrere Methoden für :ref:`doc_custom_drawing_in_2d` einen optionalen ``antialiased`` Parameter, der beim Aufruf der Funktion auf ``true`` gesetzt werden kann.
zh_cn: Line2D 具有 **Antialiased**\ （抗锯齿）属性，可以在检查器中启用。此外，\ :ref:`doc_custom_drawing_in_2d` 中的一些方法支持提供可选的 ``antialiased`` 参数，可以在调用函数时设置为 ``true``\ 。
zh_tw: Line2D 具有 **Antialiased**（抗鋸齒）屬性，可以在屬性面板中啟用。此外，:ref:`doc_custom_drawing_in_2d` 中的一些方法支援提供可選的 ``antialiased`` 參數，可以在呼叫函式時設定為 ``true``。

source: These methods do not require MSAA to be enabled, which makes their *baseline* performance cost low. In other words, there is no permanent added cost if you're not drawing any antialiased geometry at some point.
de: Für diese Methoden muss MSAA nicht aktiviert sein, was die Kosten für die *Basis-Performance* niedrig hält. Mit anderen Worten, es gibt keine dauerhaften zusätzlichen Kosten, wenn Sie zu einem bestimmten Zeitpunkt keine Geometrie mit Antialiasing zeichnen.
zh_cn: 这些方法不需要启用 MSAA，这使得它们的 *基准* 性能成本很低。换句话说，如果你在某个阶段没有绘制任何抗锯齿几何图形，则不会产生永久性的额外性能消耗。
zh_tw: 這些方法不需要啟用MSAA，這使得它們的*基準*性能成本很低。換句話說，如果您在某個階段沒有繪製任何抗鋸齒幾何圖形，則不會產生永久性的額外性能消耗。

source: The downside of these antialiasing methods is that they work by generating additional geometry. If you're generating complex 2D geometry that's updated every frame, this may be a bottleneck. Also, Polygon2D, TextureProgressBar, and several custom drawing methods don't feature an antialiased property. For these nodes, you can use 2D multisample antialiasing instead.
de: Der Nachteil dieser Antialiasing-Methoden ist, dass sie durch die Erzeugung zusätzlicher Geometrie funktionieren. Wenn Sie komplexe 2D-Geometrie erzeugen, die bei jedem Frame aktualisiert wird, kann dies ein Bottleneck sein. Außerdem verfügen Polygon2D, TextureProgressBar und mehrere benutzerdefinierte Zeichenmethoden nicht über eine Antialiasing-Property. Für diese Nodes können Sie stattdessen 2D-Multisample-Antialiasing verwenden.
zh_cn: 这些抗锯齿方法的缺点是需要生成额外的几何图形。如果要生成每帧都需要更新的复杂 2D 几何图形，这可能会成为程序的性能瓶颈。此外，Polygon2D、TextureProgressBar 和几种自定义绘图方法都不具备抗锯齿属性。对于这些节点，可以使用 2D 多采样抗锯齿来代替。
zh_tw: 這些抗鋸齒方法的缺點是需要生成額外的幾何圖形。如果要生成每影格都需要更新的複雜 2D 幾何圖形，這可能會成為程式的性能瓶頸。此外，Polygon2D、TextureProgressBar 和幾種自訂繪圖方法都不具備抗鋸齒屬性。對於這些節點，可以使用 2D 多取樣抗鋸齒來代替。

source: Multisample antialiasing (MSAA)
zh_cn: 多重采样抗锯齿（MSAA）
zh_tw: 多取樣抗鋸齒 (MSAA)。

source: Before enabling MSAA in 2D, it's important to understand what MSAA will operate on. MSAA in 2D follows similar restrictions as in 3D. While it does not introduce any blurriness, its scope of application is limited. The main applications of 2D MSAA are:
de: Bevor Sie MSAA in 2D aktivieren, ist es wichtig zu verstehen, worauf MSAA angewendet wird. MSAA unterliegt in 2D ähnlichen Einschränkungen wie in 3D. Es führt zwar keine Unschärfe ein, aber sein Anwendungsbereich ist begrenzt. Die wichtigsten Anwendungen von 2D MSAA sind:
zh_cn: 在 2D 中启用 MSAA 之前，必须先了解 MSAA 的操作对象。2D 中的 MSAA 遵循与 3D 中类似的限制。虽然它不会带来任何模糊，但其应用范围是有限的。2D MSAA 的主要应用包括：
zh_tw: 在 2D 中啟用 MSAA 之前，必須先瞭解 MSAA 的操作物件。2D 中的 MSAA 遵循與 3D 中類似的限制。雖然它不會帶來任何模糊，但其應用範圍是有限的。2D MSAA 的主要應用包括：

source: Geometry edges, such as line and polygon drawing.
de: Geometrische Kanten, wie z. B. Linien- und Polygonzeichnungen.
zh_cn: 几何边缘，如直线和多边形绘图。
zh_tw: 幾何邊緣，如直線和多邊形繪圖。

source: Sprite edges *only for pixels touching one of the texture's edges*. This works for both linear and nearest-neighbor filtering. Sprite edges created using transparency on the image are not affected by MSAA.
de: Sprite-Kanten *nur für Pixel, die eine der Kanten der Textur berühren*. Dies funktioniert sowohl für lineare als auch für Nearest-Neighbor-Filterung. Sprite-Kanten, die mit Hilfe von Transparenz auf dem Bild erstellt werden, sind von MSAA nicht betroffen.
zh_cn: 精灵边缘 *仅限于与纹理边缘接触的像素* 。这适用于线性过滤和最近邻插值过滤。使用图像透明度创建的精灵边缘不受 MSAA 影响。
zh_tw: 精靈邊緣*僅限於與紋理邊緣接觸的像素*。這適用於線性篩選和最近鄰插值篩選。使用圖像透明度建立的精靈邊緣不受MSAA影響。

source: The downside of MSAA is that it only operates on edges. This is because MSAA increases the number of *coverage* samples, but not the number of *color* samples. However, since the number of color samples did not increase, fragment shaders are still run for each pixel only once. As a result, MSAA will **not affect** the following kinds of aliasing in any way:
de: Der Nachteil von MSAA ist, dass es nur auf Kanten wirkt. Das liegt daran, dass MSAA die Anzahl der *Deckungs*-Samples erhöht, aber nicht die Anzahl der *Farb*-Samples. Da sich jedoch die Anzahl der Farb-Samples nicht erhöht hat, werden Fragment-Shader weiterhin für jedes Pixel nur einmal ausgeführt. Infolgedessen hat MSAA **keine Auswirkungen** auf die folgenden Arten von Aliasing:
zh_cn: MSAA 的不足之处在于它只对边缘进行操作。这是因为 MSAA 增加了\ *覆盖采样*\ 的数量，而不是\ *颜色*\ 采样的数量。然而，由于颜色采样的数量并没有增加，片段着色器仍然只会为每个像素运行一次。因此，MSAA *不会影响*\ 以下类型的锯齿：
zh_tw: MSAA 的不足之處在於它只對邊緣進行操作。這是因為 MSAA 增加了*覆蓋取樣*的數量，而不是*顏色*取樣的數量。然而，由於顏色取樣的數量並沒有增加，片段著色器仍然只會為每個像素運作一次。因此，MSAA *不會影響*以下型別的鋸齒：

source: Aliasing *within* nearest-neighbor filtered textures (pixel art).
de: Aliasing *innerhalb* von Texturen mit Nearest-Neighbor-Filter (Pixel Art).
zh_cn: 最近邻过滤纹理 *中* 的混叠现象（像素艺术）。
zh_tw: 最近鄰篩選紋理中的混疊現象（像素藝術）。

source: Aliasing caused by custom 2D shaders.
de: Aliasing verursacht durch benutzerdefinierte 2D-Shader.
zh_cn: 自定义 2D 着色器造成的锯齿。
zh_tw: 自訂 2D 著色器造成的鋸齒。

source: Specular aliasing when using Light2D.
de: Specular Aliasing bei Verwendung von Light2D.
zh_cn: 使用 Light2D 时的镜面反射锯齿。
zh_tw: 使用 Light2D 時的鏡面反射鋸齒。

source: Aliasing in font rendering.
de: Aliasing beim Rendern von Schriftarten.
zh_cn: 文字渲染中的锯齿。
zh_tw: 點算繪的點大小.

source: MSAA can be enabled in the Project Settings by changing the value of the **Rendering > Anti Aliasing > Quality > MSAA 2D** setting. It's important to change the value of the **MSAA 2D** setting and not **MSAA 3D**, as these are entirely separate settings.
de: MSAA kann in den Projekteinstellungen aktiviert werden, indem der Wert der Einstellung **Rendern > Kantenglättung > Qualität > MSAA 2D** geändert wird. Es ist wichtig, den Wert der Einstellung **MSAA 2D** und nicht **MSAA 3D** zu ändern, da es sich um völlig separate Einstellungen handelt.
zh_cn: 可以通过更改项目设置中**渲染 > 抗锯齿 > 质量 > MSAA 2D** 的设置值来启用 MSAA。重要的是要更改 **MSAA 2D** 的设置值，而不是 **MSAA 3D**，因为它们是完全独立的设置项。
zh_tw: 可以通過更改專案設定中**算繪 > 抗鋸齒 > 品質 > MSAA 2D** 的設定值來啟用 MSAA。重要的是要更改 **MSAA 2D** 的設定值，而不是 **MSAA 3D**，因為它們是完全獨立的設定項。

source: Comparison between no antialiasing (left) and various MSAA levels (right). The top-left corner contains a Line2D node, the top-right corner contains 2 TextureProgressBar nodes. The bottom contains 8 pixel art sprites, with 4 of them touching the edges (green background) and 4 of them not touching the edges (Godot logo):
de: Vergleich zwischen keinem Antialiasing (links) und verschiedenen MSAA-Stufen (rechts). Die obere linke Ecke enthält einen Line2D-Node, die obere rechte Ecke enthält 2 TextureProgressBar-Nodes. Der untere Bereich enthält 8 Pixel Art-Sprites, von denen 4 die Kanten berühren (grüner Hintergrund) und 4 die Kanten nicht berühren (Godot-Logo):
zh_cn: 左侧为无抗锯齿，右侧为不同级别的多重采样抗锯齿MSAA比较。左上角包含一个Line2D节点，右上角包含2个TextureProgressBar进度条节点。底部包含8个精灵，他们中的4个与边缘接触（绿色背景），另外4个不与边缘接触（Godot标志）：
zh_tw: 左側為無抗鋸齒，右側為不同級別的多重取樣抗鋸齒MSAA比較。左上角包含一個Line2D節點，右上角包含2個TextureProgressBar進度條節點。底部包含8個精靈，他們中的4個與邊緣接觸（綠色背景），另外4個不與邊緣接觸（Godot旗標）：

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
