Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_lights_and_shadows.po
Languages: de, zh_cn, zh_tw

source: For shadows to appear in the scene, LightOccluder2D nodes must be added to the scene. These nodes must also have occluder polygons that are designed to match the sprite's outline.
de: Damit Schatten in der Szene erscheinen können, müssen LightOccluder2D-Nodes zur Szene hinzugefügt werden. Diese Nodes müssen auch über Occluder-Polygone verfügen, die so gestaltet sind, dass sie mit dem Umriss des Sprites übereinstimmen.
zh_cn: 要在场景中显示阴影，必须在场景中添加 LightOccluder2D 节点。这些节点还必须具有与精灵轮廓相匹配的遮光多边形。
zh_tw: 要在場景中顯示陰影，必須在場景中新增 LightOccluder2D 節點。這些節點還必須具有與精靈輪廓相配對的遮光多邊形。

source: Along with their polygon resource (which must be set to have any visual effect), LightOccluder2D nodes have 2 properties:
de: Neben ihrer Polygon-Ressource (die gesetzt sein muss, um einen visuellen Effekt zu haben), haben LightOccluder2D-Nodes 2 Propertys:
zh_cn: 除了多边形资源（必须设置多边形资源才能产生视觉效果）之外，LightOccluder2D 节点还有两个属性：
zh_tw: 除了多邊形資源（必須設定多邊形資源才能產生視覺效果）之外，LightOccluder2D 節點還有兩個屬性：

source: **SDF Collision:** If enabled, the occluder will be part of a real-time generated *signed distance field* that can be used in custom shaders. When not using custom shaders that read from this SDF, enabling this makes no visual difference and has no performance cost, so this is enabled by default for convenience.
de: **SDF-Kollision:** Wenn diese Option aktiviert ist, ist der Occluder Teil eines in Echtzeit generierten *Signed Distance Fields*, das in benutzerdefinierten Shadern verwendet werden kann. Wenn keine benutzerdefinierten Shader verwendet werden, die aus diesem SDF lesen, macht die Aktivierung keinen visuellen Unterschied und hat keine Leistungseinbußen, so dass dies standardmäßig aktiviert ist.
zh_cn: **SDF碰撞：**\ 如果启用，则遮挡器将成为可在自定义着色器中使用的实时生成的 *签名距离字段* （signed distance field）的一部分。当不使用从此 SDF 中读取的自定义着色器时，启用这个功能不会带来视觉上的差异，并且没有性能成本，因此默认情况下为方便起见它是启用的。
zh_tw: **SDF碰撞：**如果啟用，則遮擋器將成為可在自訂著色器中使用的即時生成的 *簽章距離欄位* （signed distance field）的一部分。當不使用從此 SDF 中讀取的自訂著色器時，啟用這個功能不會帶來視覺上的差異，並且沒有性能成本，因此預設情況下為方便起見它是啟用的。

source: **Occluder Light Mask:** This is used in tandem with PointLight2D and DirectionalLight2D's **Shadow > Item Cull Mask** property to control which objects cast shadows for each light. This can be used to prevent specific objects from casting shadows.
de: **Occluder Lichtmaske:** Diese Eigenschaft wird in Verbindung mit der Eigenschaft **Schatten > Objekt-Cull-Maske** von PointLight2D und DirectionalLight2D verwendet, um zu steuern, welche Objekte für jedes Licht Schatten werfen. Dies kann verwendet werden, um zu verhindern, dass bestimmte Objekte Schatten werfen.
zh_cn: **遮挡器光照蒙版：** 这与 PointLight2D 和 DirectionalLight2D 的 ** Shadow > Item Cull Mask ** 属性一起使用，以控制哪些对象为每个光源投射阴影。 这可用于防止特定对象投射阴影。
zh_tw: **遮擋器光照遮罩：** 這是與 PointLight2D 和 DirectionalLight2D 的 **Shadow > Item Cull Mask** 屬性一起使用的功能，以控制哪些物件為每個光照投射陰影。這可用於防止特定物件投射陰影。

source: There are two ways to create light occluders:
de: Es gibt zwei Möglichkeiten, Light Occluders zu erstellen:
zh_cn: 有两种方法可以来创建光线遮挡器：
zh_tw: Godot 沒有使用限制

source: Automatically generating a light occluder
de: Automatisches Erzeugen eines Light Occluders
zh_cn: 自动生成光遮蔽器
zh_tw: 自動生成光遮蔽器

source: Occluders can be created automatically from Sprite2D nodes by selecting the node, clicking the **Sprite2D** menu at the top of the 2D editor then choosing **Create LightOccluder2D Sibling**.
de: Occluder können automatisch aus Sprite2D-Nodes erstellt werden, indem man den Node auswählt, auf das Menü **Sprite2D** oben im 2D-Editor klickt und dann **LightOccluder2D-Nachbar erstellen** wählt.
zh_cn: 遮挡器可以自动地 Sprite2D 节点上创建，需要选中节点，单击2D编辑器顶部的 **Sprite2D** 菜单，然后选择 **创建 LightOccluder2D 兄弟节点** 从而自动进行。
zh_tw: 遮擋器可以自動地 Sprite2D 節點上建立，需要選中節點，按一下2D編輯器頂部的 **Sprite2D**功能表，然後選擇 **建立 LightOccluder2D 兄弟節點**\\\\從而自動進行。

source: In the dialog that appears, an outline will surround your sprite's edges. If the outline matches the sprite's edges closely, you can click **OK**. If the outline is too far away from the sprite's edges (or is "eating" into the sprite's edges), adjust **Grow (pixels)** and **Shrink (pixels)**, then click **Update Preview**. Repeat this operation until you get satisfactory results.
de: In dem daraufhin angezeigten Dialogfeld werden die Kanten des Sprites von einem Umriss umgeben. Wenn der Umriss genau mit den Kanten des Sprites übereinstimmt, können Sie auf **OK** klicken. Wenn der Umriss zu weit von den Rändern des Sprites entfernt ist (oder sich in die Ränder des Sprites "frisst"), passen Sie **Wachsen (Pixel)** und **Schrumpfen (Pixel)** an und klicken Sie dann auf **Vorschau aktualisieren**. Wiederholen Sie diesen Vorgang, bis Sie zufriedenstellende Ergebnisse erhalten.
zh_cn: 在出现的窗口中，一个外框将会包裹在你的精灵的边缘。如果外框贴合在了你的精灵的边缘上，你可以点击**确定**。如果外框离你的精灵边缘太远（或者它穿过了你的精灵的边缘），调整**扩展（像素）**和**收缩（像素）**，然后点击**更新预览**。重复这一个操作直到你对结果满意为止。
zh_tw: 在出現的視窗中，一個外框將會包裹在你的精靈的邊緣。如果外框貼合在了你的精靈的邊緣上，你可以點擊**確定**。如果外框離你的精靈邊緣太遠（或者它穿過了你的精靈的邊緣），調整**擴充（像素）**和**收縮（像素）**，然後點擊**更新預覽**。重複這一個操作直到你對結果滿意為止。

source: Manually drawing a light occluder
de: Manuelles Zeichnen eines Light Occluders
zh_cn: 手动绘制光遮蔽器
zh_tw: 手動繪製光遮蔽器

source: Create a LightOccluder2D node, then select the node and click the "+" button at the top of the 2D editor. When asked to create a polygon resource, answer **Yes**. You can then start drawing an occluder polygon by clicking to create new points. You can remove existing points by right-clicking them, and you can create new points from the existing line by clicking on the line then dragging.
de: Erstellen Sie einen LightOccluder2D Node, wählen Sie den Node aus und klicken Sie oben im 2D-Editor auf den "+"-Button. Wenn Sie aufgefordert werden, eine Polygon-Ressource zu erstellen, antworten Sie mit **Ja**. Sie können dann mit dem Zeichnen eines Verdeckungspolygons beginnen, indem Sie klicken, um neue Punkte zu erstellen. Sie können vorhandene Punkte entfernen, indem Sie sie mit der rechten Maustaste anklicken, und Sie können neue Punkte von der vorhandenen Linie aus erstellen, indem Sie auf die Linie klicken und sie dann ziehen.
zh_cn: 创建一个 LightOccluder2D 节点，然后选择该节点并单击 2D 编辑器顶部的“+”按钮。 当要求创建多边形资源时，回答 **是** 。 然后，你可以通过单击创建新点来开始绘制遮挡多边形。你可以通过右键单击现有点来删除它们，也可以通过单击线条然后拖动来从现有线条创建新点。
zh_tw: 建立一個 LightOccluder2D 節點，然後選中節點，點擊 2D 編輯器頂部的 “+” 按鈕。在詢問是否要新增一個多邊形資源的時候選擇**建立**。然後你就可以通過點擊新增頂點的方式繪製遮光多邊形了。你可以通過右鍵已經建立的頂點來刪除它們，並且你可以點擊並拖動一個已經存在的線段上來新增新的頂點。

source: The following properties can be adjusted on 2D lights that have shadows enabled:
de: Die folgenden Propertys können bei 2D-Lichtern mit aktiviertem Schatten angepasst werden:
zh_cn: 启用阴影的 2D 灯光能够调整以下属性：
zh_tw: 啟用陰影的 2D 燈光能夠調整以下屬性：

source: **Color:** The color of shaded areas. By default, shaded areas are fully black, but this can be changed for artistic purposes. The color's alpha channel controls how much the shadow is tinted by the specified color.
de: **Farbe:** Die Farbe der schattierten Bereiche. Standardmäßig sind schattierte Bereiche vollständig schwarz, aber dies kann für gestalterische Zwecke geändert werden. Der Alphakanal der Farbe steuert, wie stark der Schatten durch die angegebene Farbe eingefärbt wird.
zh_cn: **Color：**\ 阴影区域的颜色。默认情况下，阴影区域是全黑的，但这可以出于艺术目的而改变。颜色的 alpha 通道控制的是阴影被指定颜色着色的程度。
zh_tw: **Color：**陰影區域的顏色。預設情況下，陰影區域是全黑的，但這可以出於藝術目的而改變。顏色的 alpha 通道控制的是陰影被指定顏色著色的程度。

source: **Filter:** The filter mode to use for shadows. The default **None** is the fastest to render, and is well suited for games with a pixel art aesthetic (due to its "blocky" visuals). If you want a soft shadow, use **PCF5** instead. **PCF13** is even softer, but is the most demanding to render. PCF13 should only be used for a few lights at once due to its high rendering cost.
de: **Filter:** Der für Schatten zu verwendende Filtermodus. Die Standardeinstellung **Keine** ist am schnellsten zu rendern und eignet sich gut für Spiele mit einer Pixelart-Ästhetik (aufgrund seiner "blockigen" Optik). Wenn Sie einen weichen Schatten wünschen, verwenden Sie stattdessen **PCF5**. **PCF13** ist sogar noch weicher, aber auch am anspruchsvollsten zu rendern. PCF13 sollte aufgrund der hohen Rendering-Kosten nur für wenige Lichter auf einmal verwendet werden.
zh_cn: **Filter：**\ 阴影所使用的过滤模式。默认值为 **None**\ ，渲染速度最快，并且非常适合像素艺术风格的游戏（因为它具有“方块”视觉效果）。如果你想要柔和的阴影，请使用 **PCF5**\ 。\ **PCF13** 则更柔和，但渲染需求更高。由于渲染成本较高，\ **PCF13** 只应用于少量光源同时存在的情况下。
zh_tw: **Filter：**陰影所使用的篩選模式。預設值為 **None**，算繪速度最快，並且非常適合像素藝術風格的遊戲（因為它具有“方塊”視覺效果）。如果你想要柔和的陰影，請使用 **PCF5**。**PCF13** 則更柔和，但算繪需求更高。由於算繪成本較高，**PCF13** 只應用於少量光源同時存在的情況下。

source: **Filter Smooth:** Controls how much softening is applied to shadows when **Filter** is set to **PCF5** or **PCF13**. Higher values result in a softer shadow, but may cause banding artifacts to be visible (especially with PCF5).
de: **Filter Glatt:** Steuert, wie stark die Schatten abgeschwächt werden, wenn **Filter** auf **PCF5** oder **PCF13** eingestellt ist. Höhere Werte führen zu einem weicheren Schatten, können aber dazu führen, dass Banding-Artefakte sichtbar werden (insbesondere bei PCF5).
zh_cn: **Filter Smooth：**\ 过滤平滑。控制的是当 **Filter** 为 **PCF5** 或* *PCF13** 时，应用于阴影的柔化程度。较高的值会导致阴影更加柔和，但可能会出现带状伪影（特别是使用 PCF5 时）。
zh_tw: **Filter Smooth：**篩選平滑。控制的是當 **Filter** 為 **PCF5** 或* *PCF13** 時，應用於陰影的柔化程度。較高的值會導致陰影更加柔和，但可能會出現帶狀偽影（特別是使用 PCF5 時）。

source: **Item Cull Mask:** Controls which LightOccluder2D nodes cast shadows, depending on their respective **Occluder Light Mask** properties.
de: **Objekt-Cull-Maske:** Steuert, welche LightOccluder2D-Nodes Schatten werfen, abhängig von ihren jeweiligen **Occluder Lichtmaske**-Propertys.
zh_cn: **Item Cull Mask：**\ 项目剔除遮罩。控制的是哪些 LightOccluder2D 节点能够投射阴影，取决于对应的 **Occluder Light Mask**\ （遮挡器灯光遮罩）属性。
zh_tw: **Item Cull Mask：**專案剔除遮罩。控制的是哪些 LightOccluder2D 節點能夠投射陰影，取決於對應的 **Occluder Light Mask**（遮擋器燈光遮罩）屬性。

source: Hard shadows
de: Harte Schatten
zh_cn: 硬阴影
zh_tw: 硬或軟陰影。

source: Soft shadows (PCF13, Filter Smooth 1.5)
de: Weiche Schatten (PCF13, Filterglättung 1.5)
zh_cn: 柔和阴影（PCF13，滤镜平滑度 1.5）
zh_tw: 柔和陰影（PCF13，濾鏡平滑度 1.5）

source: Soft shadows with streaking artifacts due to Filter Smooth being too high (PCF5, Filter Smooth 4)
de: Weiche Schatten mit Schlierenartefakten aufgrund von zu hohem Filter Smooth (PCF5, Filterglättung 4)
zh_cn: 由于滤波平滑度太高（PCF5，滤波平滑度 4），阴影变得柔和，并出现条纹伪影
zh_tw: 由於濾波平滑度太高（PCF5，濾波平滑度 4），陰影變得柔和，並出現條紋偽影

source: Occluder draw order
de: Zeichenreihenfolge des Occluders
zh_cn: 遮挡器绘制顺序
zh_tw: 遮擋模式

source: **LightOccluder2Ds follows the usual 2D drawing order.** This is important for 2D lighting, as this is how you control whether the occluder should occlude the sprite itself or not.
de: **LightOccluder2Ds folgt der üblichen 2D-Zeichenreihenfolge.** Das ist wichtig für 2D-Beleuchtung, da so gesteuert wird, ob der Occluder das Sprite selbst verdecken soll oder nicht.
zh_cn: **LightOccluder2D 遵循常规的 2D 绘图顺序。**\ 这对于 2D 灯光而言非常重要，因为可以用来控制遮挡器是否应该遮挡精灵本身。
zh_tw: **LightOccluder2D 遵循常規的 2D 繪圖順序。**這對於 2D 燈光而言非常重要，因為可以用來控制遮擋器是否應該遮擋精靈本身。

source: If the LightOccluder2D node is a *sibling* of the sprite, the occluder will occlude the sprite itself if it's placed *below* the sprite in the scene tree.
de: Wenn der LightOccluder2D-Node ein *Nachbar* des Sprites ist, wird der Occluder das Sprite selbst verdecken, wenn er *unter* dem Sprite im Szenenbaum platziert ist.
zh_cn: 如果 LightOccluder2D 节点是精灵的\ *兄弟*\ 节点，并且场景树中的遮挡器被放在精灵的\ *下方*\ ，会遮挡住精灵本身。
zh_tw: 如果 LightOccluder2D 節點是精靈的*兄弟*節點，並且場景樹中的遮擋器被放在精靈的*下方*，會遮擋住精靈本身。

source: If the LightOccluder2D node is a *child* of the sprite, the occluder will occlude the sprite itself if **Show Behind Parent** is disabled on the LightOccluder2D node (which is the default).
de: Wenn der LightOccluder2D Node ein *Child* des Sprites ist, wird der Occluder das Sprite selbst verdecken, wenn **Zeichne hinter Parent** auf dem LightOccluder2D Node deaktiviert ist (was die Voreinstellung ist).
zh_cn: 如果 LightOccluder2D 节点是一个精灵的子节点，如果在 LightOccluder2D 节点中禁用了 **Show Behind Parent**\ （显示在父级之后）这个遮挡器将遮挡住精灵本身（该选项默认禁用）。
zh_tw: 如果 LightOccluder2D 節點是一個精靈的子節點，如果在 LightOccluder2D 節點中禁用了 **Show Behind Parent**（顯示在父級之後）這個遮擋器將遮擋住精靈本身（該選項預設禁用）。

source: Normal and specular maps
de: Normal und Specular Maps
zh_cn: 法线和镜面贴图
zh_tw: 法線和鏡面貼圖

source: Normal maps and specular maps can greatly enhance the sense of depth of your 2D lighting. Similar to how these work in 3D rendering, normal maps can help make lighting look less flat by varying its intensity depending on the direction of the surface receiving light (on a per-pixel basis). Specular maps further help improve visuals by making some of the light reflect back to the viewer.
de: Normal Maps und Specular Maps können die Tiefenwirkung Ihrer 2D-Beleuchtung erheblich verbessern. Ähnlich wie beim 3D-Rendering können Normal Maps dazu beitragen, dass die Beleuchtung weniger flach wirkt, indem sie ihre Intensität in Abhängigkeit von der Richtung der Oberfläche, die das Licht empfängt, variieren (auf einer Pixel-Basis). Specular-Maps tragen ebenfalls zur Verbesserung der visuellen Darstellung bei, indem sie einen Teil des Lichts zum Betrachter zurückreflektieren.
zh_cn: 法线贴图和镜面贴图可以大大提升你的2D光照的立体感。与3D渲染类似，法线贴图可以根据接收光线的表面方向来改变光线的强度，从而使照明效果不再平面化（按像素进行调整）。镜面贴图通过让一部分光线反射回观察者来进一步改善视觉效果。
zh_tw: 法線貼圖和鏡面貼圖可以大大提升你的2D光照的立體感。與3D算繪類似，法線貼圖可以根據接收光線的表面方向來改變光線的強度，從而使照明效果不再平面化（按像素進行調整）。鏡面貼圖通過讓一部分光線反射回觀察者來進一步改善視覺效果。

source: Both PointLight2D and DirectionalLight2D support normal mapping and specular mapping. Since Godot 4.0, normal and specular maps can be assigned to any 2D element, including nodes that inherit from Node2D or Control.
de: Sowohl PointLight2D als auch DirectionalLight2D unterstützen Normal Mapping und Specular Mapping. Seit Godot 4.0 können Normal- und Specular-Maps jedem 2D-Element zugewiesen werden, auch Nodes, die von Node2D oder Control erben.
zh_cn: PointLight2D 和 DirectionalLight2D 都支持法线贴图和镜面贴图。自 Godot 4.0 起，法线贴图和镜面贴图可分配给任何 2D 元素，包括继承自 Node2D 或 Control 的节点。
zh_tw: PointLight2D 和 DirectionalLight2D 都支援法線貼圖和鏡面貼圖。自 Godot 4.0 起，法線貼圖和鏡面貼圖可分配給任何 2D 元素，包括繼承自 Node2D 或 Control 的節點。

source: A normal map represents the direction in which each pixel is "pointing" towards. This information is then used by the engine to correctly apply lighting to 2D surfaces in a physically plausible way. Normal maps are typically created from hand-painted height maps, but they can also be automatically generated from other textures.
de: Eine Normal Map gibt die Richtung an, in die jedes Pixel "zeigt". Diese Information wird dann von der Engine verwendet, um die Beleuchtung auf 2D-Oberflächen in einer physikalisch plausiblen Weise korrekt anzuwenden. Normal Maps werden in der Regel aus handgemalten Height Maps erstellt, sie können aber auch automatisch aus anderen Texturen generiert werden.
zh_cn: 法线贴图表示每个像素 “指向” 的方向。引擎会利用这些信息，以物理上合理的方式将光照正确应用到 2D 表面。法线贴图通常由手绘的高度贴图创建，但也可以由其他纹理自动生成。
zh_tw: 法線貼圖表示每個像素 “指向” 的方向。引擎會利用這些資訊，以物理上合理的方式將光照正確應用到 2D 表面。法線貼圖通常由手繪的高度貼圖建立，但也可以由其他紋理自動生成。

source: A specular map defines how much each pixel should reflect light (and in which color, if the specular map contains color). Brighter values will result in a brighter reflection at that given spot on the texture. Specular maps are typically created with manual editing, using the diffuse texture as a base.
de: Eine Specular Map legt fest, wie stark jedes Pixel Licht reflektieren soll (und in welcher Farbe, wenn die Specular Map Farbe enthält). Je heller die Werte sind, desto heller ist die Reflexion an der betreffenden Stelle der Textur. Specular Maps werden in der Regel durch manuelle Bearbeitung erstellt, wobei die diffuse Textur als Grundlage dient.
zh_cn: 镜面贴图定义了每个像素对光线的反射程度（如果镜面贴图包含颜色，则定义反射的颜色）。亮度值越高，纹理上指定位置的反射就越亮。镜面贴图通常以漫反射纹理为基础，通过手动编辑创建。
zh_tw: 鏡面貼圖定義了每個像素對光線的反射程度（如果鏡面貼圖包含顏色，則定義反射的顏色）。亮度值越高，紋理上指定位置的反射就越亮。鏡面貼圖通常以漫反射紋理為基礎，通過手動編輯建立。

source: If you don't have normal or specular maps for your sprites, you can generate them using the free and open source `Laigter <https://azagaya.itch.io/laigter>`__ tool.
de: Wenn Sie keine Normal- oder Specular-Maps für Ihre Sprites haben, können Sie diese mit dem kostenlosen und quelloffenen Tool `Laigter <https://azagaya.itch.io/laigter>`__ erzeugen.
zh_cn: 如果在你的精灵中没有使用法线贴图或者镜面贴图，可以使用免费的开源工具`Laigter <https://azagaya.itch.io/laigter>`来生成。
zh_tw: 如果在你的精靈中沒有使用法線貼圖或者鏡面貼圖，可以使用免費的開源工具`Laigter <https://azagaya.itch.io/laigter>`來生成。

source: To set up normal maps and/or specular maps on a 2D node, create a new CanvasTexture resource for the property that draws the node's texture. For example, on a Sprite2D:
de: Um Normal Maps und/oder Specular Maps auf einem 2D-Node einzurichten, erstellen Sie eine neue CanvasTexture-Ressource für die Property, von der Textur des Nodes gezeichnet wird. Zum Beispiel, auf einem Sprite2D:
zh_cn: 要在 2D 节点上设置法线贴图和/或镜面贴图，请为绘制节点纹理的属性创建一个新的 CanvasTexture 资源。例如，在一个 Sprite2D 节点上创建一个新的 CanvasTexture 资源：
zh_tw: 要在 2D 節點上設定法線貼圖和/或鏡面貼圖，請為繪製節點紋理的屬性建立一個新的 CanvasTexture 資源。例如，在一個 Sprite2D 節點上建立一個新的 CanvasTexture 資源：

source: Creating a CanvasTexture resource for a Sprite2D node
de: Erstellen einer CanvasTexture-Ressource für einen Sprite2D-Node
zh_cn: 为 Sprite2D 节点创建 CanvasTexture 资源
zh_tw: 為 Sprite2D 節點建立 CanvasTexture 資源

source: Expand the newly created resource. You can find several properties you will need to adjust:
de: Erweitern Sie die neu erstellte Ressource. Hier finden Sie mehrere Propertys, die Sie anpassen müssen:
zh_cn: 展开新创建的资源。你可以找到需要调整的几个属性：
zh_tw: 展開新建立的資源。您可以找到需要調整的幾個屬性：

source: **Diffuse > Texture:** The base color texture. In this property, load the texture you're using for the sprite itself.
de: **Diffus > Textur:** Die Textur der Grundfarbe. In diese Property laden Sie die Textur, die Sie für das Sprite selbst verwenden.
zh_cn: **Diffuse > Texture：**\ （漫反射 > 纹理）基础的颜色贴图。在这个属性中，加载你将使用在精灵本身的纹理。
zh_tw: **Diffuse > Texture：**（漫反射 > 紋理）基礎的顏色貼圖。在這個屬性中，載入你將使用在精靈本身的紋理。

source: **Normal Map > Texture:** The normal map texture. In this property, load a normal map texture you've generated from a height map (see the tip above).
de: **Normal Map > Textur:** Die Textur der Normal Map. Laden Sie in dieser Property eine Normal Map-Textur, die Sie aus einer Height Map generiert haben (siehe Tipp oben).
zh_cn: **Normal Map > Texture：**\ （法线贴图 > 纹理）法线贴图的纹理。在这个属性中，你可以加载从高度图生成的法线贴图纹理（见上面的提示）。
zh_tw: **Normal Map > Texture：**（法線貼圖 > 紋理）法線貼圖的紋理。在這個屬性中，你可以載入從高度圖生成的法線貼圖紋理（見上面的提示）。

source: **Specular > Texture:** The specular map texture, which controls the specular intensity of each pixel on the diffuse texture. The specular map is usually grayscale, but it can also contain color to multiply the color of reflections accordingly. In this property, load a specular map texture you've created (see the tip above).
de: **Specular > Textur:** Die Specular-Map-Textur, von der die Spiegelungsintensität jedes Pixels auf der diffusen Textur gesteuert wird. Die Specular Map ist normalerweise in Graustufen gehalten, kann aber auch Farbe enthalten, um die Farbe der Reflexionen entsprechend zu multiplizieren. Laden Sie in dieses Property eine von Ihnen erstellte Specular-Map-Textur (siehe Tipp oben).
zh_cn: **Specular > Texture：**\ （镜面反射 > 纹理）镜面贴图纹理，可以控制漫反射纹理上每个像素的镜面反射强度。镜面贴图通常使用灰度反射，但是它也可以包含色彩来增强反射的颜色。在这个属性中，加载一个已创建的镜面贴图纹理（见上面的提示）。
zh_tw: **Specular > Texture：**（鏡面反射 > 紋理）鏡面貼圖紋理，可以控制漫反射紋理上每個像素的鏡面反射強度。鏡面貼圖通常使用灰度反射，但是它也可以包含色彩來增強反射的顏色。在這個屬性中，載入一個已建立的鏡面貼圖紋理（見上面的提示）。

source: **Specular > Color:** The color multiplier for specular reflections.
de: **Specular > Farbe:** Der Farbmultiplikator für Specular-Reflexionen.
zh_cn: **Specular > Color：**\ （镜面反射 > 颜色）镜面反射的颜色乘数。
zh_tw: **Specular > Color：**（鏡面反射 > 顏色）鏡面反射的顏色乘數。

source: **Specular > Shininess:** The specular exponent to use for reflections. Lower values will increase the brightness of reflections and make them more diffuse, while higher values will make reflections more localized. High values are more suited for wet-looking surfaces.
de: **Specular > Glanz:** Der Specular-Exponent der für Reflexionen verwendet wird. Niedrigere Werte erhöhen die Helligkeit der Reflexionen und machen sie diffuser, während höhere Werte die Reflexionen stärker lokal eingrenzen. Hohe Werte eignen sich besser für nass aussehende Oberflächen.
zh_cn: **Specular > Shininess：**\ （镜面反射 > 光泽度）用于镜面反射的高光指数。值越低，反射的明亮度和扩散性会增加，而值越高，反射会更加局部化。较高的值适用于湿润表面。
zh_tw: **Specular > Shininess：**（鏡面反射 > 光澤度）用於鏡面反射的高光指數。值越低，反射的明亮度和擴散性會增加，而值越高，反射會更加局部化。較高的值適用於濕潤表面。

source: **Texture > Filter:** Can be set to override the texture filtering mode, regardless of what the node's property is set to (or the **Rendering > Textures > Canvas Textures > Default Texture Filter** project setting).
de: **Textur > Filter:** Kann so eingestellt werden, dass der Texturfiltermodus überschrieben wird, unabhängig davon, auf was die Property des Nodes eingestellt ist (oder die Projekteinstellung **Rendern > Texturen > Canvas-Texturen > Default-Texturfilter**).
zh_cn: **Texture > Filter：**\ （纹理 > 过滤器）可以设置为覆盖纹理过滤模式，无论节点属性设置如何（或\ **渲染 > 纹理 > 画布纹理 > 默认纹理过滤**\ 项目设置）。
zh_tw: **Texture > Filter：**（紋理 > 篩檢程式）可以設定為覆蓋紋理篩選模式，無論節點屬性設定如何（或**算繪 > 紋理 > 畫布紋理 > 預設紋理篩選**專案設定）。

source: **Texture > Repeat:** Can be set to override the texture filtering mode, regardless of what the node's property is set to (or the **Rendering > Textures > Canvas Textures > Default Texture Repeat** project setting).
de: **Textur > Wiederholung:** Kann so eingestellt werden, dass der Textur-Filtermodus überschrieben wird, unabhängig davon, was in der Property des Nodes eingestellt ist (oder in der Projekteinstellung **Rendern > Texturen > Canvas-Texturen > Default-Textur-Wiederholung**).
zh_cn: **Texture > Repeat：**\ （纹理 > 重复）可以设置为覆盖纹理过滤模式，无论节点的属性如何设置（或者\ **渲染 > 纹理 > 画布纹理 > 默认纹理重复**\ 项目设置）。
zh_tw: **Texture > Repeat：**（紋理 > 重複）可以設定為覆蓋紋理篩選模式，無論節點的屬性如何設定（或者**算繪 > 紋理 > 畫布紋理 > 預設紋理重複**專案設定）。

source: After enabling normal mapping, you may notice that your lights appear to be weaker. To resolve this, increase the **Height** property on your PointLight2D and DirectionalLight2D nodes. You may also want to increase the lights's **Energy** property slightly to get closer to how your lighting's intensity looked prior to enabling normal mapping.
de: Nach der Aktivierung von Normal Mapping werden Sie möglicherweise feststellen, dass Ihre Lichter schwächer erscheinen. Um dies zu beheben, erhöhen Sie die Property **Höhe** an Ihren PointLight2D- und DirectionalLight2D-Nodes. Sie können auch die Property **Energie** der Lichter leicht erhöhen, um die Intensität der Beleuchtung vor der Aktivierung des Normal Mapping anzugleichen.
zh_cn: 启用法线贴图后，你可能会注意到灯光会显得较弱。为了解决这个问题，可以增加 PointLight2D 和 DirectionalLight2D 节点上的 **Height** 属性。也可以略微增加灯光的 **Energy** 属性，以接近启用法线贴图之前的照明强度。
zh_tw: 啟用法線貼圖後，你可能會注意到燈光會顯得較弱。為了解決這個問題，可以增加 PointLight2D 和 DirectionalLight2D 節點上的 **Height** 屬性。也可以略微增加燈光的 **Energy** 屬性，以接近啟用法線貼圖之前的照明強度。

source: Using additive sprites as a faster alternative to 2D lights
de: Verwendung additiver Sprites als schnellere Alternative zu 2D-Lichtern
zh_cn: 使用添加式精灵作为 2D 灯光的快速替代品
zh_tw: 使用新增式精靈作為 2D 燈光的快速替代品

source: If you run into performance issues when using 2D lights, it may be worth replacing some of them with Sprite2D nodes that use additive blending. This is particularly suited for short-lived dynamic effects, such as bullets or explosions.
de: Wenn Sie bei der Verwendung von 2D-Lichtern auf Performanceprobleme stoßen, kann es sich lohnen, einige von ihnen durch Sprite2D-Nodes zu ersetzen, die additives Blending verwenden. Dies eignet sich besonders für kurzlebige dynamische Effekte, wie Kugeln oder Explosionen.
zh_cn: 如果在使用 2D 灯光时遇到性能问题，不妨将其中一些节点替换为使用叠加混合的 Sprite2D 节点。这尤其适用于短暂的动态效果，如子弹或爆炸。
zh_tw: 如果在使用 2D 燈光時遇到性能問題，不妨將其中一些節點替換為使用疊加混合的 Sprite2D 節點。這尤其適用於短暫的動態效果，如子彈或爆炸。
