Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_lights_and_shadows.po
Languages: de, zh_cn, zh_tw

source: Additive sprites are much faster to render, since they don't need to go through a separate rendering pipeline. Additionally, it is possible to use this approach with AnimatedSprite2D (or Sprite2D + AnimationPlayer), which allows for animated 2D "lights" to be created.
de: Additive Sprites sind viel schneller zu rendern, da sie keine separate Rendering-Pipeline durchlaufen müssen. Darüber hinaus ist es möglich, diesen Ansatz mit AnimatedSprite2D (oder Sprite2D + AnimationPlayer) zu verwenden, mit dem animierte 2D-"Lichter" erstellt werden können.
zh_cn: 添加式精灵的渲染速度要快得多，因为它们不需要通过单独的渲染管道。此外，这种方法还可以与 AnimatedSprite2D（或 Sprite2D + AnimationPlayer）一起使用，这样就可以创建动画二维 “灯光”。
zh_tw: 新增式精靈的算繪速度要快得多，因為它們不需要通過單獨的算繪管道。此外，這種方法還可以與 AnimatedSprite2D（或 Sprite2D + AnimationPlayer）一起使用，這樣就可以建立動畫二維 “燈光”。

source: However, additive sprites have a few downsides compared to 2D lights:
de: Allerdings haben additive Sprites im Vergleich zu 2D-Lichtern ein paar Nachteile:
zh_cn: 不过，与 2D 灯光相比，添加式精灵有一些缺点：
zh_tw: 不過，與 2D 燈光相比，新增式精靈有一些缺點：

source: The blending formula is inaccurate compared to "actual" 2D lighting. This is usually not a problem in sufficiently lit areas, but this prevents additive sprites from correctly lighting up areas that are fully dark.
de: Die Blending-Formel ist im Vergleich zur "echten" 2D-Beleuchtung ungenau. In ausreichend beleuchteten Bereichen ist dies in der Regel kein Problem, aber dies verhindert, dass additive Sprites völlig dunkle Bereiche korrekt beleuchten.
zh_cn: 与 “实际 ”二维光照相比，混合公式并不准确。这在光线充足的区域通常不是问题，但这会妨碍添加精灵去正确照亮那些完全黑暗的区域。
zh_tw: 與 “實際 ”二維光照相比，混合公式並不準確。這在光線充足的區域通常不是問題，但這會妨礙新增精靈去正確照亮那些完全黑暗的區域。

source: Additive sprites cannot cast shadows, since they are not lights.
de: Additive Sprites können keine Schatten werfen, da sie keine Lichter sind.
zh_cn: 添加式精灵不能投射阴影，因为它们不是灯光。
zh_tw: 新增式精靈不能投射陰影，因為它們不是燈光。

source: Additive sprites ignore normal and specular maps used on other sprites.
de: Additive Sprites ignorieren Normal- und Specular-Maps, die auf anderen Sprites verwendet werden.
zh_cn: 添加式精灵会忽略其他精灵上使用的法线贴图和镜面贴图。
zh_tw: 新增式精靈會忽略其他精靈上使用的法線貼圖和鏡面貼圖。

source: To display a sprite with additive blending, create a Sprite2D node and assign a texture to it. In the inspector, scroll down to the **CanvasItem > Material** section, unfold it and click the dropdown next to the **Material** property. Choose **New CanvasItemMaterial**, click the newly created material to edit it, then set **Blend Mode** to **Add**.
de: Um ein Sprite mit additivem Blending darzustellen, erstellen Sie einen Sprite2D-Node und weisen ihm eine Textur zu. Scrollen Sie im Inspektor nach unten zum Abschnitt **CanvasItem > Material**, klappen Sie ihn aus und klicken Sie auf das Dropdown-Menü neben der Property **Material**. Wählen Sie **Neues CanvasItemMaterial**, klicken Sie auf das neu erstellte Material, um es zu bearbeiten, und stellen Sie dann **Mischmodus** auf **Hinzufügen**.
zh_cn: 要显示一个混合叠加效果的精灵，需要创建一个 Sprite2D 节点并分配一个纹理给它。在检视窗口中，往下滚动到 **CanvasItem > Material** 部分，展开它并点击 **Material** 属性旁边的下拉菜单。选择 **New CanvasItemMaterial**，点击新建的材质来编辑它，然后将 **Blend Mode** 设置为 **Add**。
zh_tw: 要顯示一個混合疊加效果的精靈，需要建立一個 Sprite2D 節點並分配一個紋理給它。在檢視視窗中，往下滾動到 **CanvasItem > Material** 部分，展開它並點擊 **Material** 屬性旁邊的下拉式功能表。選擇 **New CanvasItemMaterial**，點擊新建的材質來編輯它，然後將 **Blend Mode** 設定為 **Add**。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
