Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_lights_and_shadows.po
Languages: de, zh_cn, zh_tw

source: 2D lights and shadows
de: 2D Beleuchtung und Schatten
zh_cn: 2D 灯光和阴影
zh_tw: 2D 燈光和陰影

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: By default, 2D scenes in Godot are unshaded, with no lights and shadows visible. While this is fast to render, unshaded scenes can look bland. Godot provides the ability to use real-time 2D lighting and shadows, which can greatly enhance the sense of depth in your project.
de: Standardmäßig sind 2D-Szenen in Godot unshaded, d. h. Lichter und Schatten sind nicht sichtbar. Dies ist zwar schnell zu rendern, aber unshaded-Szenen können langweilig aussehen. Godot bietet die Möglichkeit, 2D-Beleuchtung und -Schatten in Echtzeit zu verwenden, was den Eindruck von Tiefe in Ihrem Projekt erheblich verbessern kann.
zh_cn: 默认情况下，Godot 中的 2D 场景采用无光照着色，看不到灯光和阴影。虽然渲染速度很快，但无阴影的场景看起来会很平淡。Godot 提供了可以使用实时 2D 照明和阴影的功能，可以大大增强项目的层次感。
zh_tw: 預設情況下，Godot 中的 2D 場景採用無光照著色，看不到燈光和陰影。雖然算繪速度很快，但無陰影的場景看起來會很平淡。Godot 提供了可以使用即時 2D 照明和陰影的功能，可以大大增強專案的層次感。

source: No 2D lights or shadows, scene is unshaded
de: Keine 2D-Lichter oder Schatten, die Szene ist unshaded
zh_cn: 无 2D 灯光或阴影，场景采用无光照着色
zh_tw: 無 2D 燈光或陰影，場景採用無光照著色

source: 2D lights enabled (without shadows)
de: 2D-Lichter aktiviert (ohne Schatten)
zh_cn: 已启用无阴影的 2D 灯光
zh_tw: :ref:`doc_2d_lights_and_shadows`

source: 2D lights and shadows enabled
de: 2D-Lichter und -Schatten aktiviert
zh_cn: 2D 灯光和阴影以启用
zh_tw: :ref:`doc_2d_lights_and_shadows`

source: Nodes
zh_cn: 节点
zh_tw: 節點

source: There are several nodes involved in a complete 2D lighting setup:
de: An einer vollständigen 2D-Beleuchtungseinrichtung sind mehrere Nodes beteiligt:
zh_cn: 完整的二维照明设置涉及多个节点：
zh_tw: 完整的二維照明設定涉及多個節點：

source: :ref:`CanvasModulate <class_CanvasModulate>` (to darken the rest of the scene)
de: :ref:`CanvasModulate <class_CanvasModulate>` (um den Rest der Szene zu verdunkeln)
zh_cn: :ref:`CanvasModulate<class_CanvasModulate>` 用于使场景变暗
zh_tw: :ref:`CanvasModulate<class_CanvasModulate>` 用於使場景變暗

source: :ref:`PointLight2D <class_PointLight2D>` (for omnidirectional or spot lights)
de: :ref:`PointLight2D <class_PointLight2D>` (für omnidirektionale oder Spot-Lichter)
zh_cn: :ref:`PointLight2D <class_PointLight2D>`\ （用于全向或点光源）
zh_tw: :ref:`PointLight2D <class_PointLight2D>`（用於全向或點光源）

source: :ref:`DirectionalLight2D <class_DirectionalLight2D>` (for sunlight or moonlight)
de: :ref:`DirectionalLight2D <class_DirectionalLight2D>` (für Sonnenlicht oder Mondlicht)
zh_cn: :ref:`DirectionalLight2D <class_DirectionalLight2D>`\ （用于日光或月光）
zh_tw: :ref:`DirectionalLight2D <class_DirectionalLight2D>`（用於日光或月光）

source: :ref:`LightOccluder2D <class_LightOccluder2D>` (for light shadow casters)
de: :ref:`LightOccluder2D <class_LightOccluder2D>` (für Lichtschattenwerfer)
zh_cn: :ref:`LightOccluder2D <class_LightOccluder2D>`
zh_tw: :ref:`LightOccluder2D <class_LightOccluder2D>`

source: Other 2D nodes that receive lighting, such as Sprite2D or TileMap.
de: Andere 2D Nodes, die beleuchtet werden, wie z.B. Sprite2D oder TileMap.
zh_cn: 其他可接收光照的 2D 节点，如 Sprite2D 或 TileMap。
zh_tw: 其他可接收光照的 2D 節點，如 Sprite2D 或 TileMap。

source: :ref:`CanvasModulate <class_CanvasModulate>` is used to darken the scene by specifying a color that will act as the base "ambient" color. This is the final lighting color in areas that are *not* reached by any 2D light. Without a CanvasModulate node, the final scene would look too bright as 2D lights would only brighten the existing unshaded appearance (which appears fully lit).
de: :ref:`CanvasModulate <class_CanvasModulate>` wird verwendet, um die Szene abzudunkeln, indem eine Farbe angegeben wird, die als Grundfarbe für die Umgebung dient. Dies ist die endgültige Beleuchtungsfarbe in Bereichen, die *nicht* von einem 2D-Licht erreicht werden. Ohne einen CanvasModulate-Node würde die endgültige Szene zu hell aussehen, da 2D-Lichter nur das vorhandene, nicht schattierte Erscheinungsbild aufhellen würden (das voll beleuchtet erscheint).
zh_cn: :ref:`CanvasModulate<class_CanvasModulate>` 用于指定一种颜色作为“环境”基色，从而使场景变暗。这是任何 2D 灯光都 **无法** 到达区域的最终照明颜色。如果没有 CanvasModulate 节点，由于 2D 灯光只会照亮现有的无阴影外观（看起来完全亮了），最终场景看起来会过于明亮。
zh_tw: :ref:`CanvasModulate<class_CanvasModulate>` 用於指定一種顏色作為“環境”基色，從而使場景變暗。這是任何 2D 燈光都 **無法** 到達區域的最終照明顏色。如果沒有 CanvasModulate 節點，由於 2D 燈光只會照亮現有的無陰影外觀（看起來完全亮了），最終場景看起來會過於明亮。

source: :ref:`Sprite2Ds <class_Sprite2D>` are used to display the textures for the light blobs, the background, and for the shadow casters.
de: :ref:`Sprite2Ds <class_Sprite2D>` werden verwendet, um die Texturen für die Licht-Blobs, den Hintergrund und die Schattenwerfer darzustellen.
zh_cn: :ref:`Sprite2Ds <class_Sprite2D>` 用于显示灯泡、背景和阴影投射器的纹理。
zh_tw: :ref:`Sprites <class_Sprite>` 用於顯示燈泡、背景和產生陰影的物體的紋理。

source: :ref:`PointLight2Ds <class_PointLight2D>` are used to light the scene. The way a light typically works is by adding a selected texture over the rest of the scene to simulate lighting.
de: :ref:`PointLight2Ds <class_PointLight2D>` werden verwendet, um die Szene zu beleuchten. Ein Licht funktioniert normalerweise so, dass eine ausgewählte Textur über den Rest der Szene gelegt wird, um eine Beleuchtung zu simulieren.
zh_cn: :ref:`Light2Ds <class_Light2D>` 用于点亮场景。光通常的工作方式是在场景的其余部分添加选定的纹理以模拟光照。但它可以以其他方式使用，例如屏蔽部分场景。
zh_tw: :ref:`Light2Ds <class_Light2D>` 用於點亮場景. 光通常的工作方式是在場景的其餘部分新增選定的紋理以模擬光照. 但它可以以其他方式使用, 例如遮罩部分場景.

source: :ref:`LightOccluder2Ds <class_LightOccluder2D>` are used to tell the shader which parts of the scene cast shadows. These occluders can be placed as independent nodes or can be part of a TileMap node.
de: :ref:`LightOccluder2Ds <class_LightOccluder2D>` werden verwendet, um dem Shader mitzuteilen, welche Teile der Szene Schatten werfen. Diese Occluder können als unabhängige Nodes platziert werden oder Teil eines TileMap-Nodes sein.
zh_cn: :ref:`LightOccluder2Ds <class_LightOccluder2D>` 用于告诉着色器场景的哪些部分投射阴影。 这些遮挡物可以放置为独立节点，也可以作为 TileMap 节点的一部分。
zh_tw: :ref:`LightOccluder2Ds <class_LightOccluder2D>` 用於告訴著色器, 場景的哪些部分投射陰影. 陰影僅出現在 :ref:`Light2D <class_Light2D>` 所覆蓋的區域, 它們的方向基於 :ref:`Light <class_Light2D>` 的中心.

source: The shadows appear only on areas covered by the :ref:`PointLight2D <class_PointLight2D>` and their direction is based on the center of the :ref:`Light <class_PointLight2D>`.
de: Die Schatten erscheinen nur auf Flächen, die von dem :ref:`PointLight2D <class_PointLight2D>` abgedeckt werden und ihre Richtung basiert auf dem Zentrum des :ref:`Lichts <class_PointLight2D>`.
zh_cn: 阴影仅出现在 :ref:`PointLight2D <class_PointLight2D>` 覆盖的区域上，并且其方向基于 :ref:`Light <class_PointLight2D>` 的中心。
zh_tw: :ref:`LightOccluder2Ds <class_LightOccluder2D>` 用於告訴著色器, 場景的哪些部分投射陰影. 陰影僅出現在 :ref:`Light2D <class_Light2D>` 所覆蓋的區域, 它們的方向基於 :ref:`Light <class_Light2D>` 的中心.

source: The background color does **not** receive any lighting. If you want light to be cast on the background, you need to add a visual representation for the background, such as a Sprite2D.
de: Die Hintergrundfarbe wird **nicht** beleuchtet. Wenn Sie möchten, dass Licht auf den Hintergrund geworfen wird, müssen Sie eine visuelle Darstellung für den Hintergrund hinzufügen, wie z. B. ein Sprite2D.
zh_cn: 背景色 **不会** 接收任何光照。如果要在背景上投射灯光，则需要为背景添加可视化表示，例如 Sprite2D。
zh_tw: 背景色 **不會** 接收任何光照。如果要在背景上投射燈光，則需要為背景新增視覺化表示，例如 Sprite2D。

source: The Sprite2D's **Region** properties can be helpful to quickly create a repeating background texture, but remember to also set **Texture > Repeat** to **Enabled** in the Sprite2D's properties.
de: Die Propertys **Region** des Sprite2D können hilfreich sein, um schnell eine sich wiederholende Hintergrundtextur zu erstellen, aber denken Sie daran, auch **Textur > Wiederholen** in den Propertys des Sprite2D auf **Aktiviert** zu setzen.
zh_cn: Sprite2D 的 **Region** 属性有助于快速创建重复的背景纹理，但要记住在 Sprite2D 属性中将 **Texture > Repeat** 设置为 **Enabled** 。
zh_tw: Sprite2D 的 **Region** 屬性有助於快速建立重複的背景紋理，但要記住在 Sprite2D 屬性中將 **Texture > Repeat** 設定為 **Enabled** 。

source: Point lights
de: Punktlichter
zh_cn: 点光源
zh_tw: 骨骼權重

source: Point lights (also called positional lights) are the most common element in 2D lighting. Point lights can be used to represent light from torches, fire, projectiles, etc.
de: Punktlichter (auch Positionslichter genannt) sind das häufigste Element der 2D-Beleuchtung. Punktlichter können verwendet werden, um das Licht von Fackeln, Feuer, Geschossen usw. darzustellen.
zh_cn: 点光源（也称位置光源）是 2D 照明中最常见的元素。点光源可用于表示火把、火、射弹等发出的光。
zh_tw: 點光源（也稱位置光源）是 2D 照明中最常見的元素。點光源可用於表示火把、火、射彈等發出的光。

source: PointLight2D offers the following properties to tweak in the inspector:
de: PointLight2D bietet die folgenden Propertys, die im Inspektor angepasst werden können:
zh_cn: PointLight2D 提供了以下属性，可在检查器中进行调整：
zh_tw: PointLight2D 提供了以下屬性，可在屬性面板中進行調整：

source: **Texture:** The texture to use as a light source. The texture's size determines the size of the light. The texture may have an alpha channel, which is useful when using Light2D's **Mix** blend mode, but it is not required if using the **Add** (default) or **Subtract** blend modes.
de: **Textur:** Die Textur, die als Lichtquelle verwendet werden soll. Die Größe der Textur bestimmt die Größe des Lichts. Die Textur kann einen Alphakanal haben, was nützlich ist, wenn Sie den Mischmodus **Mix** von Light2D verwenden, aber er ist nicht erforderlich, wenn Sie die Blending-Modi **Add** (Default) oder **Subtract** verwenden.
zh_cn: **纹理：** 用作光源的纹理。纹理的大小决定光源的大小。纹理可以有一个 alpha 通道，这在使用 Light2D 的 **Mix** 混合模式时非常有用，但在使用 **Add** （默认）或 **Subtract** 混合模式时则不需要。
zh_tw: **紋理：** 用作光源的紋理。紋理的大小決定光源的大小。紋理可以有一個 alpha 通道，這在使用 Light2D 的 **Mix** 混合模式時非常有用，但在使用 **Add** （預設）或 **Subtract** 混合模式時則不需要。

source: **Offset:** The offset for the light texture. Unlike when you move the light node, changing the offset does *not* cause shadows to move.
de: **Offset:** Der Offset für die Lichttextur. Anders als beim Verschieben des Licht-Nodes bewirkt das Ändern des Offsets *keine* Verschiebung des Schattens.
zh_cn: **偏移量：** 灯光纹理的偏移量。与移动灯光节点不同，改变偏移量 *不会* 导致阴影移动。
zh_tw: **偏移量：** 燈光紋理的偏移量。與移動燈光節點不同，改變偏移量 *不會* 導致陰影移動。

source: **Texture Scale:** The multiplier for the light's size. Higher values will make the light extend out further. Larger lights have a higher performance cost as they affect more pixels on screen, so consider this before increasing a light's size.
de: **Texturskalierung:** Der Multiplikator für die Größe des Lichts. Höhere Werte lassen das Licht weiter ausgreifen. Größere Lichter haben höhere Performancekosten, da sie mehr Pixel auf dem Bildschirm beeinflussen, also beachten Sie dies vor dem Vergrößern eines Lichts.
zh_cn: **纹理缩放：** 灯光大小的乘法器。数值越大，灯光越亮。较大的灯光会影响屏幕上更多的像素，因此在增大灯光尺寸前要考虑到这一点。
zh_tw: **紋理縮放：** 燈光大小的乘法器。數值越大，燈光越亮。較大的燈光會影響螢幕上更多的像素，因此在增大燈光尺寸前要考慮到這一點。

source: **Height:** The light's virtual height with regards to normal mapping. By default, the light is very close to surfaces receiving lights. This will make lighting hardly visible if normal mapping is used, so consider increasing this value. Adjusting the light's height only makes a visible difference on surfaces that use normal mapping.
de: **Höhe:** Die virtuelle Höhe des Lichts in Bezug auf das Normal Mapping. Standardmäßig befindet sich das Licht sehr nahe an den Oberflächen, die Licht empfangen. Dadurch wird die Beleuchtung kaum sichtbar, wenn Normal Mapping verwendet wird, daher sollten Sie diesen Wert erhöhen. Die Anpassung der Lichthöhe macht nur auf Oberflächen, die Normal Mapping verwenden, einen sichtbaren Unterschied.
zh_cn: **高度：** 灯光在法线贴图中的虚拟高度。默认情况下，灯光与接收灯光的表面非常接近。如果使用法线贴图，这将使灯光几乎不可见，因此可以考虑增加此值。只有在使用法线贴图的表面上，调整灯光的高度才会产生明显的不同。
zh_tw: **高度：** 燈光在法線貼圖中的虛擬高度。預設情況下，燈光與接收燈光的表面非常接近。如果使用法線貼圖，這將使燈光幾乎不可見，因此可以考慮增加此值。只有在使用法線貼圖的表面上，調整燈光的高度才會產生明顯的不同。

source: If you don't have a pre-made texture to use in a light, you can use this "neutral" point light texture (right-click > **Save Image As…**):
de: Wenn Sie keine vorgefertigte Textur für ein Licht haben, können Sie diese "neutrale" Punktlichttextur verwenden (Rechtsklick > **Bild speichern unter...**):
zh_cn: 如果没有预制纹理可用于灯光，可以使用这种 “中性 ”点光源纹理（右键单击 > **图像另存为...** ）：
zh_tw: 如果沒有預製紋理可用於燈光，可以使用這種 “中性 ”點光源紋理（按右鍵 > **圖像另存為...** ）：

source: Neutral point light texture
de: Neutrale Punktlichttextur
zh_cn: 紫外线对质地轻
zh_tw: 匯入紋理

source: If you need different falloff, you can procedurally create a texture by assigning a **New GradientTexture2D** on the light's **Texture** property. After creating the resource, expand its **Fill** section and set the fill mode to **Radial**. You will then have to adjust the gradient itself to start from opaque white to transparent white, and move its starting location to be in the center.
de: Wenn Sie einen anderen Abfall benötigen, können Sie eine Textur prozedural erstellen, indem Sie dem Licht über die Property **Textur** einen **New GradientTexture2D** zuweisen. Nachdem Sie die Ressource erstellt haben, erweitern Sie den Abschnitt **Füllen** und setzen Sie den Füllmodus auf **Radial**. Anschließend müssen Sie den Farbverlauf selbst so anpassen, dass er von opakem Weiß zu transparentem Weiß wechselt, und seinen Startpunkt in die Mitte legen.
zh_cn: 如果你需要不同的渐变，可以通过在灯光的 **纹理** 属性上分配 **新建 GradientTexture2D** 来程序化地创建纹理。创建资源后，展开其 **Fill** 部分并将填充模式设置为 **Radial** 。然后，你需要调整渐变本身，使其从不透明的白色开始到透明的白色，并将其起始位置移动到中心。
zh_tw: 如果您需要不同的漸變，可以通過在燈光的**紋理**屬性上分配 **新建 GradientTexture2D** 來程式化地建立紋理。建立資源後，展開其 **Fill** 部分並將填充模式設定為 **Radial** 。然後，您需要調整漸變本身，使其從不透明的白色開始到透明的白色，並將其起始位置移動到中心。

source: Directional light
de: Gerichtetes Licht
zh_cn: 平行光
zh_tw: 平行光

source: New in Godot 4.0 is the ability to have directional lighting in 2D. Directional lighting is used to represent sunlight or moonlight. Light rays are casted parallel to each other, as if the sun or moon was infinitely far away from the surface that is receiving the light.
de: Neu in Godot 4.0 ist die Möglichkeit, gerichtetes Licht in 2D zu verwenden. Gerichtetes Licht wird verwendet, um Sonnenlicht oder Mondlicht darzustellen. Die Lichtstrahlen werden parallel zueinander geworfen, als ob die Sonne oder der Mond unendlich weit von der Oberfläche entfernt wäre, die das Licht empfängt.
zh_cn: Godot 4.0 的新功能是在 2D 中实现定向照明。定向照明用于表现阳光或月光。光线相互平行投射，就好像太阳或月亮离受光表面无限远一样。
zh_tw: Godot 4.0 的新功能是在 2D 中實作定向照明。定向照明用於表現陽光或月光。光線相互平行投射，就好像太陽或月亮離受光表面無限遠一樣。

source: DirectionalLight2D offers the following properties:
de: DirectionalLight2D bietet die folgenden Propertys:
zh_cn: DirectionalLight2D 提供以下的属性：
zh_tw: DirectionalLight2D 提供以下的屬性：

source: **Height:** The light's virtual height with regards to normal mapping (``0.0`` = parallel to surfaces, ``1.0`` = perpendicular to surfaces). By default, the light is fully parallel with the surfaces receiving lights. This will make lighting hardly visible if normal mapping is used, so consider increasing this value. Adjusting the light's height only makes a visual difference on surfaces that use normal mapping. **Height** does not affect shadows' appearance.
de: **Höhe:** Die virtuelle Höhe des Lichts in Bezug auf das Normal Mapping (``0.0`` = parallel zu Oberflächen, ``1.0`` = senkrecht zu Oberflächen). Standardmäßig ist das Licht vollständig parallel zu den beleuchteten Flächen. Dadurch wird die Beleuchtung kaum sichtbar, wenn Normal Mapping verwendet wird, daher sollten Sie diesen Wert erhöhen. Die Anpassung der Lichthöhe macht nur bei Flächen, die Normal Mapping verwenden, einen visuellen Unterschied. Die **Höhe** hat keinen Einfluss auf das Aussehen der Schatten.
zh_cn: **高度：** 灯光在法线贴图中的虚拟高度（ ``0.0`` = 平行于曲面， ``1.0`` = 垂直于曲面）。默认情况下，灯光与接收灯光的表面完全平行。如果使用法线贴图，这将使灯光几乎不可见，因此可以考虑增大此值。调整灯光的高度只会对使用法线贴图的表面产生视觉差异。 **高度** 不会影响阴影的外观。
zh_tw: **高度：** 燈光在法線貼圖中的虛擬高度（ ``0.0`` = 平行於曲面， ``1.0`` = 垂直於曲面）。預設情況下，燈光與接收燈光的表面完全平行。如果使用法線貼圖，這將使燈光幾乎不可見，因此可以考慮增大此值。調整燈光的高度只會對使用法線貼圖的表面產生視覺差異。 **高度** 不會影響陰影的外觀。

source: **Max Distance:** The maximum distance from the camera center objects can be before their shadows are culled (in pixels). Decreasing this value can prevent objects located outside the camera from casting shadows (while also improving performance). Camera2D zoom is not taken into account by **Max Distance**, which means that at higher zoom values, shadows will appear to fade out sooner when zooming onto a given point.
de: **Max Abstand:** Der maximale Abstand von der Kameramitte, den Objekte haben dürfen, bevor ihre Schatten gecullt werden (in Pixel). Eine Verringerung dieses Wertes kann verhindern, dass Objekte, die sich außerhalb der Kamera befinden, Schatten werfen (und gleichzeitig die Leistung verbessern). Der Camera2D-Zoom wird bei **Max Abstand** nicht berücksichtigt, was bedeutet, dass bei höheren Zoom-Werten die Schatten beim Zoomen auf einen bestimmten Punkt früher ausgeblendet werden.
zh_cn: **最大距离：** 物体距离摄像机中心的最大距离（单位：像素）。减小该值可以防止对位于摄像机外的物体投射阴影（同时还能提高性能）。 **最大距离** 不考虑 Camera2D 的缩放，这意味着在较高的缩放值下，当缩放至给定点时，阴影会更快消失。
zh_tw: **最大距離：** 物體距離相機中心的最大距離（單位：像素）。減小該值可以防止對位於相機外的物體投射陰影（同時還能提高性能）。 **最大距離** 不考慮 Camera2D 的縮放，這意味著在較高的縮放值下，當縮放至給定點時，陰影會更快消失。

source: Directional shadows will always appear to be infinitely long, regardless of the value of the **Height** property. This is a limitation of the shadow rendering method used for 2D lights in Godot.
de: Gerichtete Schatten werden immer unendlich lang erscheinen, unabhängig vom Wert der **Höhe**-Property. Dies ist eine Einschränkung der Schatten-Rendering-Methode, die für 2D-Lichter in Godot verwendet wird.
zh_cn: 无论 **Height** 属性的值是多少，定向阴影看起来总是无限长。这是 Godot 中用于 2D 灯光的阴影渲染方法的限制。
zh_tw: 無論 **Height** 屬性的值是多少，定向陰影看起來總是無限長。這是 Godot 中用於 2D 燈光的陰影算繪方法的限制。

source: To have directional shadows that are not infinitely long, you should disable shadows in the DirectionalLight2D and use a custom shader that reads from the 2D signed distance field instead. This distance field is automatically generated from LightOccluder2D nodes present in the scene.
de: Um gerichtete Schatten zu haben, die nicht unendlich lang sind, sollten Sie Schatten im DirectionalLight2D deaktivieren und stattdessen einen benutzerdefinierten Shader verwenden, der aus dem 2D-Signed Distance Field liest. Dieses Distance Field wird automatisch aus LightOccluder2D Nodes in der Szene generiert.
zh_cn: 不想获得无限长的定向阴影，应禁用 DirectionalLight2D 中的阴影，并使用自定义着色器来读取 2D 带符号距离场。该距离场从场景中的 LightOccluder2D 节点自动生成。
zh_tw: 不想獲得無限長的定向陰影，應禁用 DirectionalLight2D 中的陰影，並使用自訂著色器來讀取 2D 帶符號距離場。該距離場從場景中的 LightOccluder2D 節點自動生成。

source: Common light properties
de: Allgemeine Licht-Propertys
zh_cn: 常用灯光属性
zh_tw: 建立屬性群組

source: Both PointLight2D and DirectionalLight2D offer common properties, which are part of the Light2D base class:
de: Sowohl PointLight2D als auch DirectionalLight2D bieten gemeinsame Propertys, die Teil der Light2D-Basisklasse sind:
zh_cn: PointLight2D 和 DirectionalLight2D 都提供共同的属性，这些属性是 Light2D 基类的一部分：
zh_tw: PointLight2D 和 DirectionalLight2D 都提供共同的屬性，這些屬性是 Light2D 基底類別的一部分：

source: **Enabled:** Allows toggling the light's visibility. Unlike hiding the light node, disabling this property will not hide the light's children.
de: **Aktiviert:** Ermöglicht das Umschalten der Sichtbarkeit des Lichts. Im Gegensatz zum Ausblenden des Light Nodes werden durch die Deaktivierung dieser Property die Child-Elemente des Lichts nicht ausgeblendet.
zh_cn: **启用：** 允许切换灯光的可见性。与隐藏灯光节点不同，禁用此属性不会隐藏灯光的子节点。
zh_tw: **啟用：** 允許切換燈光的可見性。與隱藏燈光節點不同，禁用此屬性不會隱藏燈光的子節點。

source: **Editor Only:** If enabled, the light is only visible within the editor. It will be automatically disabled in the running project.
de: **Nur Editor:** Wenn diese Option aktiviert ist, ist das Licht nur im Editor sichtbar. Im laufenden Projekt wird es automatisch deaktiviert.
zh_cn: **仅编辑器：**\ 如果启用，灯光仅在编辑器中可见。在运行的项目中将自动禁用。
zh_tw: **僅編輯器：** 如果啟用，燈光僅在編輯器中可見。在運作的專案中將自動禁用。

source: **Color:** The light's color.
de: **Farbe:** Die Farbe des Lichts.
zh_cn: **颜色：** 灯光的颜色。
zh_tw: **顏色：** 燈光的顏色。

source: **Energy:** The light's intensity multiplier. Higher values result in a brighter light.
de: **Energie:** Der Multiplikator der Lichtintensität. Höhere Werte ergeben ein helleres Licht.
zh_cn: **能量：** 灯光强度乘数。数值越大，光线越亮。
zh_tw: **能量：** 燈光強度乘數。數值越大，光線越亮。

source: **Blend Mode:** The blending formula used for light computations. The default **Add** is suited for most use cases. **Subtract** can be used for negative lights, which are not physically accurate but can be used for special effects. The **Mix** blend mode mixes the value of pixels corresponding to the light's texture with the values of pixels under it by linear interpolation.
de: **Blending-Modus:** Die für die Lichtberechnungen verwendete Blending-Formel. Die Standardeinstellung **Hinzufügen** ist für die meisten Anwendungsfälle geeignet. **Subtrahieren** kann für negative Lichter verwendet werden, die physikalisch nicht genau sind, aber für spezielle Effekte verwendet werden können. Der Blending-Modus **Mix** mischt den Wert der Pixel, die der Textur des Lichts entsprechen, mit den Werten der darunter liegenden Pixel durch lineare Interpolation.
zh_cn: **混合模式：** 用于光线计算的混合公式。默认的 **添加（Add）** 适合大多数使用情况。 **减（Subtract）** 可用于负光，负光在物理上并不精确，但可用于特殊效果。 **混合（Mix）** 模式通过线性插值将灯光纹理对应的像素值与灯光下方的像素值混合。
zh_tw: **混合模式：** 用於光線計算的混合公式。預設的 **新增（Add）** 適合大多數使用情況。 **減（Subtract）** 可用於負光，負光在物理上並不精確，但可用於特殊效果。 **混合（Mix）** 模式通過線性插值將燈光紋理對應的像素值與燈光下方的像素值混合。

source: **Range > Z Min:** The lowest Z index affected by the light.
de: **Bereich > Z Min:** Der niedrigste vom Licht beeinflusste Z-Index.
zh_cn: **范围 > Z 下限：** 受光线影响的最小 Z 值。
zh_tw: **範圍 > Z 下限：** 受光線影響的最小 Z 值。

source: **Range > Z Max:** The highest Z index affected by the light.
de: **Bereich > Z Max:** Der höchste vom Licht beeinflusste Z-Index.
zh_cn: **范围 > Z 上限：** 受光线影响的最大 Z 值。
zh_tw: **範圍 > Z 上限：** 受光線影響的最大 Z 值。

source: **Range > Layer Min:** The lowest visual layer affected by the light.
de: **Bereich > Ebene Min:** Die unterste visuelle Ebene, die vom Licht betroffen ist.
zh_cn: **范围 > 层下限：** 受光线影响的最小层数值。
zh_tw: **範圍 > 層下限：** 受光線影響的最小層數值。

source: **Range > Layer Max:** The highest visual layer affected by the light.
de: **Bereich > Ebene Max:** Die höchste visuelle Ebene, die vom Licht betroffen ist.
zh_cn: **范围 > 层上限：** 受光线影响的最大层数值。
zh_tw: **範圍 > 層上限：** 受光線影響的最大層數值。

source: **Range > Item Cull Mask:** Controls which nodes receive light from this node, depending on the other nodes' enabled visual layers **Occluder Light Mask**. This can be used to prevent certain objects from receiving light.
de: **Bereich > Objekt-Cull-Maske:** Steuert, welche Nodes Licht von diesem Node erhalten, abhängig von den aktivierten visuellen Ebenen **Occluder Light Mask** der anderen Nodes . Dies kann verwendet werden, um zu verhindern, dass bestimmte Objekte Licht erhalten.
zh_cn: **范围 > 对象遮罩：** 根据其他节点的可视层选项**Occluder Light Mask**（遮挡掩膜），控制那些节点接收到来自这个节点的光线。通过这种方式可以让某些物体不被光线照射。
zh_tw: **範圍 > 對象遮罩：** 根據其他節點的可視層選項**Occluder Light Mask**（遮擋掩膜），控制那些節點接收到來自這個節點的光線。通過這種方式可以讓某些物體不被光線照射。

source: Setting up shadows
de: Schatten einrichten
zh_cn: 设置阴影
zh_tw: 設定 SCons

source: After enabling the **Shadow > Enabled** property on a PointLight2D or DirectionalLight2D node, you will not see any visual difference initially. This is because no nodes in your scene have any *occluders* yet, which are used as a basis for shadow casting.
de: Nachdem Sie die **Schatten > Aktiviert**-Property auf einem PointLight2D oder DirectionalLight2D-Node aktiviert haben, werden Sie zunächst keinen visuellen Unterschied sehen. Das liegt daran, dass noch keine Nodes in Ihrer Szene über *Occluder* verfügen, die als Basis für den Schattenwurf verwendet werden.
zh_cn: 启用一个 PointLight2D 或者 DirectionalLight2D 节点的 **Shadow > Enabled** 属性之后，你将看不到任何变化。这是因为在你的场景中还没有任何节点拥有投射阴影需要使用的 *遮挡器* 。
zh_tw: 啟用一個 PointLight2D 或者 DirectionalLight2D 節點的 **Shadow > Enabled** 屬性之後，你將看不到任何變化。這是因為在你的場景中還沒有任何節點擁有投射陰影需要使用的 *遮擋器* 。
