Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_movement.po
Languages: de, zh_tw

source: 2D movement overview
de: Übersicht 2D-Bewegung
zh_tw: 2D 運動概述

source: Introduction
de: Einführung
zh_tw: 前言

source: Every beginner has been there: "How do I move my character?" Depending on the style of game you're making, you may have special requirements, but in general the movement in most 2D games is based on a small number of designs.
de: Jeder Anfänger hat diese Frage: "Wie bewege ich meinen Charakter?" Abhängig vom Stil des Spiels, das Sie erstellen, haben Sie möglicherweise spezielle Anforderungen, aber im Allgemeinen basiert die Bewegung in den meisten 2D-Spielen auf einer kleinen Menge von Designs.
zh_tw: 每個初學者都曾遇過同樣的情況：「我要怎麼控制我的角色？」根據你想做的遊戲風格，你可能會有特殊的需求。但普遍來說，大部分2D遊戲的操控是以少數幾種設計為基礎的。

source: We'll use :ref:`CharacterBody2D <class_CharacterBody2D>` for these examples, but the principles will apply to other node types (Area2D, RigidBody2D) as well.
de: Wir verwenden :ref:`CharacterBody2D <class_CharacterBody2D>` für diese Beispiele, aber die Prinzipien gelten auch für andere Node-Typen (Area2D, RigidBody2D).
zh_tw: 這裡我們用 :ref:`KinematicBody2D <class_KinematicBody2D>` 當做例子，不過其他型別的節點(Area2D, RigidBody2D) 也適用相同原則。

source: Setup
de: Einrichtung
zh_tw: 設定

source: Each example below uses the same scene setup. Start with a ``CharacterBody2D`` with two children: ``Sprite2D`` and ``CollisionShape2D``. You can use the Godot icon ("icon.png") for the Sprite2D's texture or use any other 2D image you have.
de: Jedes der folgenden Beispiele verwendet den gleichen Szenenaufbau. Beginnen Sie mit einem ``CharacterBody2D`` mit zwei Child-Nodes: ``Sprite2D`` und ``CollisionShape2D``. Sie können das Godot-Symbol ("icon.png") für die Textur des Sprite2D verwenden oder jedes andere 2D-Bild, das Sie haben.
zh_tw: 以下每個範例都使用相同的場景佈置。從帶有 ``Sprite2D`` 和 ``CollisionShape2D`` 這兩個子節點的 ``CharacterBody2D`` 開始。你可以將 Godot 圖示（“icon.png”）用於 Sprite2D 的紋理，也可以使用你擁有的任何其他 2D 圖像。

source: Open ``Project -> Project Settings`` and select the "Input Map" tab. Add the following input actions (see :ref:`InputEvent <doc_inputevent>` for details):
de: Öffnen Sie ``Projekt -> Projekteinstellungen`` und wählen Sie den Tab "Eingabe-Zuordnung". Fügen Sie die folgenden Eingabeaktionen hinzu (siehe :ref:`InputEvent <doc_inputevent>` für Details):
zh_tw: 打開``專案 -> 專案設定``並選擇“輸入對應”分頁。新增以下輸入操作（相關詳細資訊請參閱 :ref:`InputEvent <doc_inputevent>`）：

source: 8-way movement
de: 8-Wege-Bewegung
zh_tw: 八向移動

source: In this scenario, you want the user to press the four directional keys (up/left/down/right or W/A/S/D) and move in the selected direction. The name "8-way movement" comes from the fact that the player can move diagonally by pressing two keys at the same time.
de: In diesem Szenario soll der Benutzer die vier Richtungstasten (oben/links/unten/rechts oder W/A/S/D) drücken und sich in die ausgewählte Richtung bewegen. Der Name "8-Wege-Bewegung" kommt daher, dass sich der Spieler durch gleichzeitiges Drücken von zwei Tasten diagonal bewegen kann.
zh_tw: 在這種情況下, 您希望使用者按下四個方向鍵(上/左/下/右或W / A / S / D)並沿所選方向移動. "8向移動" 意味著遊戲角色可以通過同時按下兩個鍵實作斜向移動.

source: Add a script to the character body and add the following code:
de: Fügen Sie ein Skript in den Charakter-Body ein und fügen Sie den folgenden Code hinzu:
zh_tw: 點擊 [場景] -> [新增場景]，然後新增下列節點：

source: In the ``get_input()`` function, we use :ref:`Input <class_Input>` ``get_vector()`` to check for the four key events and sum return a direction vector.
de: In der Funktion ``get_input()`` verwenden wir :ref:`Input <class_Input>`-``get_vector()``, um auf die vier Schlüsselereignisse zu prüfen und in der Summe einen Richtungsvektor zurückzugeben.
zh_tw: 在函式 ``get_input()`` 中，我們使用 :ref:`Input <class_Input>` 的 ``get_vector()`` 來檢查四個按鍵事件，並返回一個方向向量的累加值。

source: We can then set our velocity by multiplying this direction vector, which has a length of ``1``, by our desired speed.
de: Wir können dann unsere Geschwindigkeit festlegen, indem wir diesen Richtungsvektor, der eine Länge von ``1`` hat, mit unserer gewünschten Geschwindigkeit multiplizieren.
zh_tw: 然後，我們可以將長度為 ``1`` 的方向向量乘以所需的速度來設定速度。

source: If you've never used vector math before, or need a refresher, you can see an explanation of vector usage in Godot at :ref:`doc_vector_math`.
de: Wenn Sie noch nie Vektor-Mathematik verwendet haben oder eine Auffrischung benötigen, können Sie eine Erklärung der Vektorverwendung in Godot unter :ref:`doc_vector_math` einsehen.
zh_tw: 如果你之前從未接觸過向量數學, 或者需要複習, 你可以在 :ref:`doc_vector_math` 看到Godot中向量用法的解釋.

source: If the code above does nothing when you press the keys, double-check that you've set up input actions correctly as described in the :ref:`doc_2d_movement_setup` part of this tutorial.
de: Wenn der obige Code nichts bewirkt, wenn Sie die Tasten drücken, überprüfen Sie, ob Sie die Eingabeaktionen korrekt eingerichtet haben, wie im :ref:`doc_2d_movement_setup`-Teil dieses Tutorials beschrieben.
zh_tw: 如果在你按下鍵時上面的程式碼不起任何作用, 請仔細檢查你是否按照本教學的 :ref:`doc_2d_movement_setup` 部分所描述的正確設定了輸入操作.

source: Rotation + movement
de: Rotation + Bewegung
zh_tw: 旋轉+移動

source: This type of movement is sometimes called "Asteroids-style" because it resembles how that classic arcade game worked. Pressing left/right rotates the character, while up/down moves it forward or backward in whatever direction it's facing.
de: Diese Art der Bewegung wird manchmal als "Asteroids-Stil" bezeichnet, weil sie der Funktionsweise dieses klassischen Arcade-Spiels ähnelt. Durch Drücken von links/rechts wird die Figur gedreht, während sie durch Drücken von oben/unten vorwärts oder rückwärts in die jeweilige Richtung bewegt wird.
zh_tw: 這種型別的運動有時被稱為 "Asteroids式運動", 因為它類似於經典街機遊戲Asteroids的工作方式. 按左/右旋轉角色, 而按上/下使得角色在面向的方向上向前或向後.

source: Here we've added two variables to track our rotation direction and speed. The rotation is applied directly to the body's ``rotation`` property.
de: Hier haben wir zwei Variablen hinzugefügt, um unsere Rotationsrichtung und Geschwindigkeit zu tracken. Die Rotation wird direkt auf die Property ``rotation`` des Body angewendet.
zh_tw: 我們新增了兩個新變數來追蹤旋轉方向和速度. 同樣, 一次按下兩個鍵將相互抵消並導致沒有旋轉. 旋轉直接應用於物體的 ``rotation`` 屬性上.

source: To set the velocity, we use the body's ``transform.x`` which is a vector pointing in the body's "forward" direction, and multiply that by the speed.
de: Um die Geschwindigkeit festzulegen, verwenden wir den Vektor ``transform.x`` des Bodys, der in die "Vorwärts"-Richtung des Bodys zeigt, und multiplizieren ihn mit der Geschwindigkeit.
zh_tw: 要設定速度，我們使用物體的 ``transform.x`` ，這是一個指向物體 “前進” 方向的向量，然後乘以速度。

source: Rotation + movement (mouse)
de: Rotation + Bewegung (Maus)
zh_tw: 旋轉+移動（滑鼠）

source: This style of movement is a variation of the previous one. This time, the direction is set by the mouse position instead of the keyboard. The character will always "look at" the mouse pointer. The forward/back inputs remain the same, however.
de: Dieser Bewegungsstil ist eine Variation des vorherigen Stils. Diesmal wird die Richtung statt über die Tastatur über die Mausposition vorgegeben. Der Charakter "schaut" immer auf den Mauszeiger. Die Vorwärts-/Rückwärts-Eingaben bleiben jedoch gleich.
zh_tw: 這種運動方式是前一種運動方式的變體。這次，方向由滑鼠位置而不是鍵盤設定。角色將始終“看向”滑鼠指標。前進/後退輸入保持不變。

source: Here we're using the :ref:`Node2D <class_Node2D>` ``look_at()`` method to point the player towards the mouse's position. Without this function, you could get the same effect by setting the angle like this:
de: Hier benutzen wir die :ref:`Node2D <class_Node2D>`-``look_at()`` Methode, um den Spieler auf die Position der Maus auszurichten. Ohne diese Funktion könnte man den gleichen Effekt erzielen, indem man den Winkel wie folgt einstellt:
zh_tw: 這裡我們用到 :ref:`Node2D <class_Node2D>` 中的 ``look_at()`` 方法, 使遊戲角色朝向給定的位置. 如果沒有此函式, 為獲得相同的效果, 可能需要像下面這樣設定角度:

source: Click-and-move
de: Klicken und Bewegen
zh_tw: 點擊並移動

source: This last example uses only the mouse to control the character. Clicking on the screen will cause the player to move to the target location.
de: Dieses letzte Beispiel verwendet nur die Maus, um den Charakter zu steuern. Wenn Sie auf den Bildschirm klicken, bewegt sich der Spieler zum Zielort.
zh_tw: 最後一個範例僅使用滑鼠來控制角色. 按一下螢幕將使遊戲角色移動到目標位置.

source: Note the ``distance_to()`` check we make prior to movement. Without this test, the body would "jitter" upon reaching the target position, as it moves slightly past the position and tries to move back, only to move too far and repeat.
de: Beachten Sie den ``distance_to()``-Check, den wir vor der Bewegung durchführen. Ohne diesen Check würde der Body beim Erreichen der Zielposition "jittern", da er sich leicht an der Position vorbei bewegt und versucht, sich zurück zu bewegen, nur um sich dabei ebenfalls zu weit zu bewegen und sich wieder nach vorn zu bewegen und so weiter.
zh_tw: 注意我們在移動之前做的 ``distance_to()`` 檢查. 如果沒有這個檢查, 物體在到達目標位置時會 "抖動", 因為它稍微移過該位置時就會試圖向後移動, 只是每次移動步長都會有點遠從而導致來回重複移動.

source: Uncommenting the ``look_at()`` line will also turn the body to point in its direction of motion if you prefer.
de: Wenn Sie die Zeile ``look_at()`` auskommentieren, wird der Body auch so gedreht, dass er in seine Bewegungsrichtung zeigt, wenn Sie möchten.
zh_tw: 如果你喜歡, 取消注釋的 ``rotation`` 程式碼可以使物體轉向其運動方向.

source: This technique can also be used as the basis of a "following" character. The ``target`` position can be that of any object you want to move to.
de: Diese Technik kann auch als Grundlage für ein "Verfolger"-Charakter verwendet werden. Die ``target``-Position kann die eines beliebigen Objekts sein, zu dem Sie sich bewegen möchten.
zh_tw: 該技術也可以用到“跟隨”的遊戲角色中。``target`` 目標位置可以是任何你想移動到的物件的位置。

source: Summary
de: Zusammenfassung
zh_tw: 總結

source: You may find these code samples useful as starting points for your own projects. Feel free to use them and experiment with them to see what you can make.
de: Diese Codebeispiele können als Ausgangspunkt für Ihre eigenen Projekte hilfreich sein. Nutzen Sie sie gern, um mit ihnen zu experimentieren und um zu sehen, was Sie damit erschaffen können.
zh_tw: 你可能覺得這些程式碼範例可以作為你自己的專案的一個有用的出發點. 請隨意使用它們並試驗它們, 看看你能做些什麼.

source: You can download this sample project here: `2d_movement_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/2d_movement_starter.zip>`_
de: Sie können dieses Beispielprojekt hier herunterladen: `2d_movement_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/2d_movement_starter.zip>`_
zh_tw: 您可以在此處下載這個範例專案：`2d_movement_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/2d_movement_starter.zip>`_

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
