Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_meshes.po
Languages: de, zh_tw

source: 2D meshes
zh_tw: 2D 網格

source: Introduction
de: Einführung
zh_tw: 前言

source: In 3D, meshes are used to display the world. In 2D, they are rare as images are used more often. Godot's 2D engine is a pure two-dimensional engine, so it can't really display 3D meshes directly (although it can be done via ``Viewport`` and ``ViewportTexture``).
de: In 3D werden Meshes verwendet, um die Welt anzuzeigen. In 2D sind sie selten, da häufiger Bilder verwendet werden. Die 2D-Engine von Godot ist eine reine zweidimensionale Engine, sodass 3D-Meshes nicht direkt angezeigt werden können (obwohl dies über ``Viewport`` und ``ViewportTexture`` möglich ist).
zh_tw: 在 3D 中，網格用於顯示世界。在 2D 中它們不常見，因為圖片使用得更頻繁。Godot 的 2D 部分是一個純 2D 引擎，因此它不能直接顯示 3D 網格（儘管它可以通過 ``Viewport`` 和 ``ViewportTexture`` 來實作）。

source: If you are interested in displaying 3D meshes on a 2D viewport, see the :ref:`doc_viewport_as_texture` tutorial.
de: Wenn Sie 3D-Meshes in einem 2D-Viewport anzeigen möchten, lesen Sie das Tutorial :ref:`doc_viewport_as_texture`.
zh_tw: 如果你對在二維視口上顯示三維網格感興趣, 請參見 :ref:`doc_viewport_as_texture` 教學.

source: 2D meshes are meshes that contain two-dimensional geometry (Z can be omitted or ignored) instead of 3D. You can experiment creating them yourself using ``SurfaceTool`` from code and displaying them in a ``MeshInstance2D`` node.
de: 2D-Meshes sind Meshes, die zweidimensionale Geometrie anstelle von 3D enthalten (Z kann weggelassen oder ignoriert werden). Sie können damit experimentieren, sie mit ``SurfaceTool`` aus dem Code heraus zu erzeugen und in einem ``MeshInstance2D``-Node darzustellen.
zh_tw: 2D 網格是包含二維幾何（Z 軸可以省略或忽略）而不是三維幾何的網格。你可以嘗試使用程式碼中的 ``SurfaceTool`` 建立它們，並在 ``MeshInstance2D`` 節點中顯示它們。

source: Currently, the only way to generate a 2D mesh within the editor is by either importing an OBJ file as a mesh, or converting it from a Sprite2D.
de: Derzeit ist die einzige Möglichkeit, ein 2D-Mesh im Editor zu erzeugen, entweder der Import einer OBJ-Datei als Mesh oder die Konvertierung aus einem Sprite2D.
zh_tw: 目前, 在編輯器中生成二維網格的唯一方法, 是匯入一個OBJ檔作為網格, 或者從Sprite轉換而來.

source: Optimizing pixels drawn
de: Optimierung der gezeichneten Pixel
zh_tw: 優化繪製的像素

source: This workflow is useful for optimizing 2D drawing in some situations. When drawing large images with transparency, Godot will draw the whole quad to the screen. The large transparent areas will still be drawn.
de: Dieser Workflow ist in einigen Situationen nützlich, um das 2D-Zeichnen zu optimieren. Wenn Sie große transparente Bilder zeichnen, zeichnet Godot das gesamte Rechteck auf den Bildschirm. Die großen transparenten Bereiche werden trotzdem gezeichnet.
zh_tw: 在某些情況下, 這個工作流程對於優化二維繪圖比較有用. 當繪製具有透明度的大型圖像時,Godot將把整個四方形(quad)繪製到螢幕上. 大片的透明區域還是會被繪製.

source: This can affect performance, especially on mobile devices, when drawing very large images (generally screen sized), or layering multiple images on top of each other with large transparent areas (for example, when using ``ParallaxBackground``).
de: Dies kann die Performance beeinträchtigen, besonders auf mobilen Geräten, wenn sehr große Bilder gezeichnet werden (im Allgemeinen in Bildschirmgröße) oder wenn mehrere Bilder mit großen transparenten Bereichen übereinander gelegt werden (zum Beispiel bei der Verwendung von ``ParallaxBackground``).
zh_tw: 如果繪製非常大的圖像時（大概螢幕大小），或者將多個有大透明區域的圖像疊加在一起（例如使用 ``ParallaxBackground`` 時），這會影響性能，尤其是在移動裝置上。

source: Converting to a mesh will ensure that only the opaque parts will be drawn and the rest will be ignored.
de: Durch die Umwandlung in ein Mesh wird sichergestellt, dass nur die undurchsichtigen Teile gezeichnet werden und der Rest ignoriert wird.
zh_tw: 轉換成網格能確保只繪製不透明部分, 其餘部分被忽略.

source: Converting Sprite2Ds to 2D meshes
de: Sprite2Ds in 2D-Meshes umwandeln
zh_tw: 建立 Godot 伺服器

source: You can take advantage of this optimization by converting a ``Sprite2D`` to a ``MeshInstance2D``. Start with an image that contains large amounts of transparency on the edges, like this tree:
de: Sie können diese Optimierung ausnutzen, indem Sie ein ``Sprite2D`` in ein ``MeshInstance2D`` umwandeln. Beginnen Sie mit einem Bild, das große Mengen an Transparenz an den Kanten enthält, wie dieser Baum:
zh_tw: 你可以通過把 ``Sprite2D`` 轉換為 ``MeshInstance2D`` 的方法來利用這種優化。從邊緣有大量透明的圖片開始，就像這棵樹：

source: Put it in a ``Sprite2D`` and select "Convert to 2D Mesh" from the menu:
de: Legen Sie es in ein ``Sprite2D`` und wählen Sie "Convert to 2D Mesh" aus dem Menü:
zh_tw: 把它放到一個 ``Sprite2D`` 中，從功能表選擇“轉換為 2D 網格”：

source: A dialog will appear, showing a preview of how the 2D mesh will be created:
de: Es erscheint ein Dialog, der eine Vorschau auf die Erstellung des 2D-Meshes zeigt:
zh_tw: 會出現一個對話方塊, 顯示將要建立的二維網格預覽:

source: The default values are good enough for many cases, but you can change growth and simplification according to your needs:
de: Die Defaultwerte sind für viele Fälle ausreichend, aber Sie können das Wachstum und die Vereinfachung nach Ihren Bedürfnissen ändern:
zh_tw: 很多情況下, 預設值已經足夠好, 但是你可以根據需要改變growth(增長)和simplication(簡化):

source: Finally, push the ``Convert 2D Mesh`` button and your Sprite2D will be replaced:
de: Zum Schluss drücken Sie den Button ``2D-Mesh konvertieren`` und Ihr Sprite2D wird ersetzt:
zh_tw: 最後，按下 ``轉換 2D 網格`` 按鈕，你的 Sprite2D 將被替換：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
