Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_sprite_animation.po
Languages: de, zh_tw

source: 2D sprite animation
zh_tw: Sprite 動畫

source: Introduction
de: Einführung
zh_tw: 前言

source: In this tutorial, you'll learn how to create 2D animated characters with the AnimatedSprite2D class and the AnimationPlayer. Typically, when you create or download an animated character, it will come in one of two ways: as individual images or as a single sprite sheet containing all the animation's frames. Both can be animated in Godot with the AnimatedSprite2D class.
de: In diesem Tutorial lernen Sie, wie Sie 2D-animierte Charaktere mit der AnimatedSprite2D-Klasse und dem AnimationPlayer erstellen. Wenn Sie eine animierte Figur erstellen oder herunterladen, gibt es in der Regel zwei Möglichkeiten: als einzelne Bilder oder als ein einzelnes Sprite Sheet, das alle Frames der Animation enthält. Beides kann in Godot mit der Klasse AnimatedSprite2D animiert werden.
zh_tw: 在本教學中，你將學習如何使用 AnimatedSprite（動畫精靈）類和 AnimationPlayer 來建立 2D 動畫角色。無論是自己繪製還是直接下載現成的，拿到的動畫角色素材一般就是兩種形式：一系列單獨的圖片，或者一張包含所有動畫影格的精靈表（Sprite Sheet）。兩者都可以使用 Godot 的 AnimatedSprite 類進行動畫。

source: First, we'll use :ref:`AnimatedSprite2D <class_AnimatedSprite2D>` to animate a collection of individual images. Then we will animate a sprite sheet using this class. Finally, we will learn another way to animate a sprite sheet with :ref:`AnimationPlayer <class_AnimationPlayer>` and the *Animation* property of :ref:`Sprite2D <class_Sprite2D>`.
de: Zuerst werden wir :ref:`AnimatedSprite2D <class_AnimatedSprite2D>` verwenden, um eine Sammlung von Einzelbildern zu animieren. Dann werden wir ein Sprite Sheet mit dieser Klasse animieren. Schließlich lernen wir eine weitere Möglichkeit kennen, ein Sprite Sheet mit :ref:`AnimationPlayer <class_AnimationPlayer>` und der *Animation*-Property von :ref:`Sprite2D <class_Sprite2D>` zu animieren.
zh_tw: 我們首先會用 :ref:`AnimatedSprite <class_AnimatedSprite>` 來把一系列單獨的圖片做成動畫，然後我們再會這個類來把精靈表做成動畫，最後我們還會學習使用 :ref:`AnimationPlayer <class_AnimationPlayer>` 和 :ref:`Sprite <class_Sprite>` 的 *Animation*（動畫）屬性來把精靈表做成動畫。

source: Art for the following examples by https://opengameart.org/users/ansimuz and tgfcoder.
de: Grafiken für die folgenden Beispiele von https://opengameart.org/users/ansimuz und tgfcoder.
zh_tw: 以下範例的美術素材由 https://opengameart.org/users/ansimuz 和 https://opengameart.org/users/tgfcoder 共同提供。

source: Individual images with AnimatedSprite2D
de: Einzelne Bilder mit AnimatedSprite2D
zh_tw: AnimateSprite 與若干單獨的圖片

source: In this scenario, you have a collection of images, each containing one of your character's animation frames. For this example, we'll use the following animation:
de: In diesem Szenario haben Sie eine Sammlung von Bildern, die jeweils einen Animations-Frame Ihres Charakters enthalten. In diesem Beispiel verwenden wir die folgende Animation:
zh_tw: 在這個情況下, 你有一組圖像, 每一個都包含你角色的動畫的一影格. 對於這個例子, 我們將使用以下動畫:

source: You can download the images here: `2d_sprite_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/2d_sprite_animation_assets.zip>`_
de: Sie können die Bilder hier herunterladen: `2d_sprite_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/2d_sprite_animation_assets.zip>`_
zh_tw: 你可以在這裡下載圖片：`2d_sprite_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/2d_sprite_animation_assets.zip>`_

source: Unzip the images and place them in your project folder. Set up your scene tree with the following nodes:
de: Entpacken Sie die Bilder und legen Sie sie in Ihrem Projektordner ab. Richten Sie Ihren Szenenbaum mit den folgenden Nodes ein:
zh_tw: 解壓縮這些圖像並將它們放在專案檔案夾中. 使用以下節點佈置場景樹:

source: The root node could also be :ref:`Area2D <class_Area2D>` or :ref:`RigidBody2D <class_RigidBody2D>`. The animation will still be made in the same way. Once the animation is completed, you can assign a shape to the CollisionShape2D. See :ref:`Physics Introduction <doc_physics_introduction>` for more information.
de: Der Root-Node könnte auch :ref:`Area2D <class_Area2D>` oder :ref:`RigidBody2D <class_RigidBody2D>` sein. Die Animation wird trotzdem auf dieselbe Weise erstellt. Sobald die Animation abgeschlossen ist, können Sie dem CollisionShape2D eine Shape zuweisen. Siehe :ref:`Physics Introduction <doc_physics_introduction>` für weitere Informationen.
zh_tw: 根節點也可以是 :ref:`Area2D <class_Area2D>` 或 :ref:`RigidBody2D <class_RigidBody2D>`。動畫仍然會以同樣的方式製作。一旦動畫完成，你就可以為 CollisionShape2D 形狀分配一個形狀。更多資訊請參見:ref:`物理介紹 <doc_physics_introduction>`。

source: Now select the ``AnimatedSprite2D`` and in its *SpriteFrames* property, select "New SpriteFrames".
de: Wählen Sie nun ``AnimatedSprite2D`` und wählen Sie in der Property *SpriteFrames* den Eintrag "New SpriteFrames".
zh_tw: 現在選中 ``AnimatedSprite``，並在它的 *SpriteFrames* 屬性中，選擇“新建 SpriteFrames”。

source: Click on the new SpriteFrames resource and you'll see a new panel appear at the bottom of the editor window:
de: Klicken Sie auf die neue SpriteFrames-Ressource. Am unteren Rand des Editorfensters wird ein neues Panel angezeigt:
zh_tw: 點擊新的 SpriteFrames 資源，你會看到一個新的面板出現在編輯器視窗的底部：

source: From the FileSystem dock on the left side, drag the 8 individual images into the center part of the SpriteFrames panel. On the left side, change the name of the animation from "default" to "run".
de: Ziehen Sie aus dem Dateisystem-Dock auf der linken Seite die 8 Einzelbilder in den mittleren Bereich des SpriteFrame-Panels. Ändern Sie auf der linken Seite den Namen der Animation von "Default" in "Ausführen".
zh_tw: 將這 8 張獨立的圖片從左邊的“檔案系統”面板拖放到“動畫影格”面板的中間部分。在左邊，將動畫名稱從“default”更改為“run”。

source: Use the "Play" buttons on the top-right of the *Filter Animations* input to preview the animation. You should now see the animation playing in the viewport. However, it is a bit slow. To fix this, change the *Speed (FPS)* setting in the SpriteFrames panel to 10.
de: Verwenden Sie die "Abspielen"-Buttons oben rechts am Eingang *Filteranimationen*, um eine Vorschau der Animation anzuzeigen. Sie sollten nun sehen, wie die Animation im Ansichtsfenster abgespielt wird. Sie ist jedoch ein wenig langsam. Um dies zu beheben, ändern Sie die Einstellung *Geschwindigkeit (FPS)* im SpriteFrames-Panel auf 10.
zh_tw: 回到“屬性面板”，勾選 *Playing* 屬性。您現在應該可以看到在視口中播放的動畫。然而，它有點慢。為了解決這個問題，請將“動畫影格”面板中的*速度（FPS）*改為 10。

source: You can add additional animations by clicking the "Add Animation" button and adding additional images.
de: Sie können weitere Animationen hinzufügen, indem Sie auf die Schaltfläche "Animation hinzufügen" klicken und weitere Bilder hinzufügen.
zh_tw: 你可以通過點擊“新建動畫”按鈕並新增其他的圖像，來添其他的動畫。

source: Controlling the animation
de: Steuerung der Animation
zh_tw: 建立內容

source: Once the animation is complete, you can control the animation via code using the ``play()`` and ``stop()`` methods. Here is a brief example to play the animation while the right arrow key is held, and stop it when the key is released.
de: Sobald die Animation abgeschlossen ist, können Sie die Animation über Code mit den Methoden ``play()`` und ``stop()`` steuern. Hier ist ein kurzes Beispiel, um die Animation abzuspielen, während die rechte Pfeiltaste gedrückt gehalten wird, und sie anzuhalten, wenn die Taste losgelassen wird.
zh_tw: 動畫完成後, 你可以通過程式碼中的 ``play()`` 和 ``stop()`` 方法控制動畫. 這裡有一個簡單的例子, 按住右方向鍵播放動畫, 鬆開後就停下.

source: Sprite sheet with AnimatedSprite2D
de: Sprite-Sheet mit AnimatedSprite2D
zh_tw: AnimateSprite 與精靈表

source: You can also easily animate from a sprite sheet with the class ``AnimatedSprite2D``. We will use this public domain sprite sheet:
de: Mit der Klasse ``AnimatedSprite2D`` kann man auch leicht von einem Sprite Sheet animieren. Wir werden dieses Public Domain Sprite Sheet verwenden:
zh_tw: 你還可以很方便地使用 ``AnimatedSprite`` 把精靈表做成動畫。我們會用到這張公共領域的精靈表：

source: Right-click the image and choose "Save Image As" to download it, and then copy the image into your project folder.
de: Klicken Sie mit der rechten Maustaste auf das Bild und wählen Sie "Bild speichern unter" um es herunterzuladen. Kopieren Sie das Bild dann in Ihren Projektordner.
zh_tw: 按右鍵圖片，選擇“圖片另存為”來下載圖片，然後將圖片複製到專案檔案夾中。

source: Set up your scene tree the same way you did previously when using individual images. Select the ``AnimatedSprite2D`` and in its *SpriteFrames* property, select "New SpriteFrames".
de: Richten Sie Ihren Szenenbaum auf die gleiche Weise ein, wie Sie es zuvor bei der Verwendung einzelner Bilder getan haben. Wählen Sie ``AnimatedSprite2D`` und wählen Sie in der Property *SpriteFrames* den Eintrag "Neue SpriteFrames".
zh_tw: 設定場景樹的方法與之前使用單獨圖片的時候相同。選中 ``AnimatedSprite`` 後在 *SpriteFrames* 屬性裡選擇“新建 SpriteFrames”。

source: Click on the new SpriteFrames resource. This time, when the bottom panel appears, select "Add frames from a Sprite Sheet".
de: Klicken Sie auf die neue SpriteFrames-Ressource. Wenn diesmal das untere Panel angezeigt wird, wählen Sie "Frames aus einem Sprite-Sheet hinzufügen".
zh_tw: 點擊建立出來的 SpriteFrames 資源。底部面板出現後，這次我們選擇“從精靈表中新增影格”。

source: You will be prompted to open a file. Select your sprite sheet.
de: Sie werden aufgefordert, eine Datei zu öffnen. Wählen Sie Ihr Sprite-Sheet aus.
zh_tw: 在彈出的打開檔案對話方塊中，選擇你的精靈表。

source: A new window will open, showing your sprite sheet. The first thing you will need to do is to change the number of vertical and horizontal images in your sprite sheet. In this sprite sheet, we have four images horizontally and two images vertically.
de: Ein neues Fenster mit Ihrem Sprite-Sheet wird geöffnet. Als Erstes muss die Anzahl der vertikalen und horizontalen Bilder im Sprite-Sheet geändert werden. In diesem Sprite-Sheet haben wir vier Bilder horizontal und zwei Bilder vertikal.
zh_tw: 接下來會打開一個新的視窗，裡面會顯示剛才的精靈表。你首先需要修改精靈表中縱向和橫向的圖片數量，我們的這張精靈表裡橫向有四張圖片、縱向有兩張。

source: Next, select the frames from the sprite sheet that you want to include in your animation. We will select the top four, then click "Add 4 frames" to create the animation.
de: Wählen Sie als Nächstes die Frames aus dem Sprite-Sheet aus, die Sie in Ihre Animation aufnehmen möchten. Wir werden die vier ersten auswählen und dann auf "4 Frames hinzufügen" klicken, um die Animation zu erstellen.
zh_tw: 然後，在精靈表中選擇動畫中想要包含的影格。這裡我們選中上面的四個，然後點擊“新增 4 影格”來建立動畫。

source: You will now see your animation under the list of animations in the bottom panel. Double click on default to change the name of the animation to jump.
de: Sie sehen Ihre Animation nun unter der Liste der Animationen im unteren Panel. Klicken Sie doppelt auf "default", um den Namen der zu Sprung-Animation zu ändern.
zh_tw: 現在你就可以看到在底部面板的動畫列表裡看到這個動畫了。按兩下 default（預設），然後把動畫的名稱改成 jump（跳躍）。

source: Finally, check the play button on the SpriteFrames editor to see your frog jump!
de: Zum Schluss klicken Sie auf den Play-Button im SpriteFrames-Editor, um Ihren Frosch springen zu sehen!
zh_tw: 最後，在屬性面板中勾選 AnimatedSprite 的 Playing（播放）就可以看到青蛙跳起來了！

source: Sprite sheet with AnimationPlayer
de: Sprite-Sheet mittels AnimationPlayer
zh_tw: AnimationPlayer 與精靈表

source: Another way that you can animate when using a sprite sheet is to use a standard :ref:`Sprite2D <class_Sprite2D>` node to display the texture, and then animating the change from texture to texture with :ref:`AnimationPlayer <class_AnimationPlayer>`.
de: Eine andere Möglichkeit, ein Sprite-Sheet zu animieren, besteht darin, einen Standard-:ref:`Sprite2D <class_Sprite2D>`-Node zu verwenden, um die Textur anzuzeigen, und dann den Wechsel von Textur zu Textur mit :ref:`AnimationPlayer <class_AnimationPlayer>` zu animieren.
zh_tw: 在使用精靈表時，另一種方法是使用標準的 :ref:`Sprite <class_Sprite>` 節點來顯示紋理，然後用 :ref:`AnimationPlayer <class_AnimationPlayer>` 來實作從紋理到紋理的動畫變化。

source: Consider this sprite sheet, which contains 6 frames of animation:
de: Schauen Sie sich dieses Sprite-Sheet an, das 6 Animationsbilder enthält:
zh_tw: 考慮一下這個包含 6 影格動畫的精靈表：

source: Right-click the image and choose "Save Image As" to download, then copy the image into your project folder.
de: Klicken Sie mit der rechten Maustaste auf das Bild und wählen Sie "Bild speichern unter" zum Herunterladen. Kopieren Sie das Bild dann in Ihren Projektordner.
zh_tw: 按右鍵圖片，選擇“圖片另存為”下載圖片，然後將圖片複製到專案檔案夾中。

source: Our goal is to display these images one after another in a loop. Start by setting up your scene tree:
de: Unser Ziel ist es, diese Bilder nacheinander in einer Schleife anzuzeigen. Beginnen Sie mit der Einrichtung Ihres Szenenbaums:
zh_tw: 我們的目的是, 迴圈著一個接一個地顯示這些圖像. 首先佈置你的場景樹:

source: Drag the spritesheet into the Sprite's *Texture* property, and you'll see the whole sheet displayed on the screen. To slice it up into individual frames, expand the *Animation* section in the Inspector and set the *Hframes* to ``6``. *Hframes* and *Vframes* are the number of horizontal and vertical frames in your sprite sheet.
de: Ziehen Sie das Sprite-Sheet in die *Textur*-Property des Sprites, und das gesamte Sheet wird auf dem Bildschirm angezeigt. Um es in einzelne Frames aufzuteilen, erweitern Sie den Abschnitt *Animation* im Inspektor und setzen Sie die *Hframes* auf ``6``. *Hframes* und *Vframes* sind die Anzahl der horizontalen und vertikalen Frames in Ihrem Sprite-Sheet.
zh_tw: 將精靈表拖拽到 Sprite 的 *Texture* 屬性裡，你會看到整個列表顯示在螢幕上。要把它分割成單獨的影格，請在“屬性面板”中展開 *Animation* 部分，將 *Hframes* 設定為 ``6``。*Hframes* 和 *Vframes* 是精靈表中水平和垂直影格的數量。

source: Now try changing the value of the *Frame* property. You'll see that it ranges from ``0`` to ``5`` and the image displayed by the Sprite2D changes accordingly. This is the property we'll be animating.
de: Versuchen Sie nun, den Wert der Property *Frame* zu ändern. Sie werden sehen, dass der Bereich von ``0`` bis ``5`` reicht und das vom Sprite2D angezeigte Bild sich entsprechend ändert. Dies ist die Property, die wir animieren werden.
zh_tw: 現在嘗試更改 *Frame* 屬性的值. 你可以看到它的範圍從 ``0`` 到 ``5`` ,Sprite 所顯示的圖像也隨之改變. 這就是我們想要動畫化的屬性.

source: Select the ``AnimationPlayer`` and click the "Animation" button followed by "New". Name the new animation "walk". Set the animation length to ``0.6`` and click the "Loop" button so that our animation will repeat.
de: Wählen Sie den ``AnimationPlayer`` und klicken Sie auf die Schaltfläche "Animation" und dann auf "Neu". Nennen Sie die neue Animation "walk". Setzen Sie die Länge der Animation auf ``0.6`` und klicken Sie auf den "Loop"-Button, damit die Animation wiederholt wird.
zh_tw: 選中 ``AnimationPlayer`` , 然後點擊 "動畫" 按鈕, 然後點擊 "新建" 按鈕. 將新動畫命名為 "walk". 將動畫長度設定為 ``0.6`` , 點擊 "Loop" 按鈕, 讓動畫重複播放.

source: Now select the ``Sprite2D`` node and click the key icon to add a new track.
de: Wählen Sie nun den ``Sprite2D``-Node und klicken Sie auf das Schlüsselsymbol, um einen neuen Track hinzuzufügen.
zh_tw: 現在選中 ``Sprite`` 節點，然後按一下鑰匙圖示，新增一個新軌道。

source: Continue adding frames at each point in the timeline (``0.1`` seconds by default), until you have all the frames from 0 to 5. You'll see the frames actually appearing in the animation track:
de: Fügen Sie an jedem Punkt in der Zeitleiste weitere Frames hinzu (standardmäßig ``0.1`` Sekunden), bis Sie alle Frames von 0 bis 5 haben. Sie werden sehen, dass die Bilder tatsächlich in der Animationsspur erscheinen:
zh_tw: 繼續在時間軸的每一點新增影格（預設為 ``0.1`` 秒），直到你得到了從 0 到 5 的所有影格。你會看到這些影格出現在動畫軌道上：

source: Press "Play" on the animation to see how it looks.
de: Drücken Sie "Play" in der Animation, um zu sehen wie sie aussieht.
zh_tw: 按下動畫上的“播放”鍵，看看效果如何。

source: Controlling an AnimationPlayer animation
de: Steuerung einer AnimationPlayer-Animation
zh_tw: 建立內容

source: Like with AnimatedSprite2D, you can control the animation via code using the ``play()`` and ``stop()`` methods. Again, here is an example to play the animation while the right arrow key is held, and stop it when the key is released.
de: Wie bei AnimatedSprite2D können Sie die Animation über Code mit den Methoden ``play()`` und ``stop()`` steuern. Hier ist wieder ein Beispiel, um die Animation abzuspielen, während die rechte Pfeiltaste gehalten wird, und sie anzuhalten, wenn die Taste losgelassen wird.
zh_tw: 正如AnimationSprite一樣, 你可以通過程式碼中的 ``play()`` 和 ``stop()`` 方法控制動畫. 同樣, 這裡有一個簡單的例子, 按住右方向鍵鍵播放動畫, 鬆開後就停下.

source: If updating both an animation and a separate property at once (for example, a platformer may update the sprite's ``h_flip``/``v_flip`` properties when a character turns while starting a 'turning' animation), it's important to keep in mind that ``play()`` isn't applied instantly. Instead, it's applied the next time the :ref:`AnimationPlayer <class_AnimationPlayer>` is processed. This may end up being on the next frame, causing a 'glitch' frame, where the property change was applied but the animation was not. If this turns out to be a problem, after calling ``play()``, you can call ``advance(0)`` to update the animation immediately.
de: Wenn man sowohl eine Animation als auch eine separate Property auf einmal aktualisiert (z.B. kann ein Platformer die Propertys ``h_flip``/``v_flip`` des Sprites aktualisieren, wenn ein Charakter sich dreht, während er eine 'Umdrehen'-Animation startet), ist es wichtig zu beachten, dass ``play()`` nicht sofort angewendet wird. Stattdessen wird es das nächste Mal angewendet, wenn der :ref:`AnimationPlayer <class_AnimationPlayer>` verarbeitet wird. Das kann dazu führen, dass im nächsten Frame ein "Glitch"-Frame entsteht, in dem die Property-Änderung angewendet wurde, die Animation aber nicht. Sollte sich dies als Problem herausstellen, können Sie nach dem Aufruf von ``play()`` die Methode ``advance(0)`` aufrufen, um die Animation sofort zu aktualisieren.
zh_tw: 如果同時更新一個動畫和一個其他的屬性（比如說，平臺跳躍遊戲可能會更新精靈的 ``h_flip``/``v_flip`` 屬性然後同時開始一個轉身動畫“turning”），要記住 ``play()`` 不是即時生效的。它會在下次 :ref:`AnimationPlayer <class_AnimationPlayer>` 被處理時生效。也就是說可能要到下一影格才行，導致現在這一影格變成“問題”影格——應用了屬性的變化，但動畫還沒有開始。如果這會造成麻煩的話，在呼叫 ``play()`` 後，你可以呼叫 ``advance(0)`` 來立即開始播放動畫。

source: Summary
de: Zusammenfassung
zh_tw: 總結

source: These examples illustrate the two classes you can use in Godot for 2D animation. ``AnimationPlayer`` is a bit more complex than ``AnimatedSprite2D``, but it provides additional functionality, since you can also animate other properties like position or scale. The class ``AnimationPlayer`` can also be used with an ``AnimatedSprite2D``. Experiment to see what works best for your needs.
de: Diese Beispiele illustrieren die beiden Klassen, die Sie in Godot für 2D-Animation verwenden können. ``AnimationPlayer`` ist etwas komplexer als ``AnimatedSprite2D``, bietet aber zusätzliche Funktionalität, da man auch andere Properties wie Position oder Skalierung animieren kann. Die Klasse ``AnimationPlayer`` kann auch mit einem ``AnimatedSprite2D`` verwendet werden. Experimentieren Sie, um zu sehen, was für Ihre Bedürfnisse am besten funktioniert.
zh_tw: 以上的例子演示了使用 Godot 提供的兩個類來製作 2D 動畫的方法。 ``AnimationPlayer`` 相比 ``AnimatedSprite`` 而言略顯複雜，但同時也提供了更多的功能，因為你還可以同時動畫位置和縮放之類的其它的屬性。 ``AnimationPlayer`` 也可以和 ``AnimatedSprite`` 配合使用，你可以自己試一試，看看怎樣的做法更適合你自己。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
