Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_transforms.po
Languages: de, zh_cn, zh_tw

source: Viewport and canvas transforms
de: Viewport- und Canvas-Transformationen
zh_cn: 视口变换与画布变换
zh_tw: Viewport 和畫布變換

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: This is an overview of the 2D transforms going on for nodes from the moment they draw their content locally to the time they are drawn onto the screen. This overview discusses very low level details of the engine.
de: Dies ist eine Übersicht über die 2D-Transformationen, die für Nodes vom Zeitpunkt des lokalen Zeichnens ihres Inhalts bis zum Zeitpunkt des Zeichnens auf dem Bildschirm ausgeführt werden. In dieser Übersicht werden grundlegende Details des Engine erläutert.
zh_cn: 本文简要介绍了从本地绘制节点内容开始到这些内容绘制到屏幕上为止的 2D 变换过程，对引擎非常底层的细节进行了讨论。
zh_tw: 本頁介紹了節點從其內容在本機被繪製一直到被繪製到畫面上的 2D 變換過程。本概覽也討論了有關引擎非常低階的細節。

source: The goal of this tutorial is to teach a way for feeding input events to the Input with a position in the correct coordinate system.
de: Das Ziel dieses Tutorials ist es, eine Methode zu vermitteln, wie man Eingabeereignisse mit einer Position im richtigen Koordinatensystem an den Input weiterleitet.
zh_cn: 本教程的目标是介绍如何为提供给 Input 的输入事件在正确的坐标系中确定位置。
zh_tw: 本教學的目標是介紹如何為提供給 Input 的輸入事件在正確的坐標系中確定位置。

source: A more extensive description of all coordinate systems and 2d transforms is available in :ref:`doc_2d_coordinate_systems`.
de: Eine ausführlichere Beschreibung aller Koordinatensysteme und 2D-Transformationen finden Sie in :ref:`doc_2d_coordinate_systems`.
zh_cn: 关于所有坐标系以及 2D 变换的详尽描述见 :ref:`doc_2d_coordinate_systems`\ 。
zh_tw: 關於所有坐標系以及 2D 變換的詳盡描述見 :ref:`doc_2d_coordinate_systems`。

source: Canvas transform
de: Canvas-Transformation
zh_cn: 画布变换
zh_tw: Canvas 變換

source: As mentioned in the previous tutorial, :ref:`doc_canvas_layers`, every CanvasItem node (remember that Node2D and Control based nodes use CanvasItem as their common root) will reside in a *Canvas Layer*. Every canvas layer has a transform (translation, rotation, scale, etc.) that can be accessed as a :ref:`Transform2D <class_Transform2D>`.
de: Wie in der vorherigen Anleitung :ref:`doc_canvas_layers` erwähnt, befindet sich jeder CanvasItem-Node in einer *Canvas-Ebene* (denken Sie daran, dass Node2D- und Control-basierte Nodes CanvasItem als gemeinsamen Root verwenden). Jede Canvas-Ebene verfügt über eine Transformation (Verschiebung, Drehung, Skalierung usw.), auf die wie folgt zugegriffen werden kann :ref:`Transform2D <class_Transform2D>`.
zh_cn: 正如前面教程 :ref:`doc_canvas_layers` 中提到的那样，每个 CanvasItem 节点（要记得 Node2D 和基于 Control 的节点都使用 CanvasItem 作为它们的公共根）将驻留在 *Canvas Layer* 中。每个 Canvas Layer 都有一个变换（平移、旋转、缩放等），可以作为 :ref:`Transform2D <class_Transform2D>` 进行访问。
zh_tw: 與之前的教學，ref:`doc_canvas_layers`，提到的一樣，所有 CanvasItem 節點 (請記得，基於 Node2D 與 Control 的節點都使用 CanvasItem 作為共同的基礎型別) 會被保持放在 **Canvas Layer** 中。所有的 Canvas Layer 都有可作為 :ref:`Transform2D <class_Transform2D>` 存取的變換 (平移、旋轉、縮放…等)。

source: Also covered in the previous tutorial, nodes are drawn by default in Layer 0, in the built-in canvas. To put nodes in a different layer, a :ref:`CanvasLayer <class_CanvasLayer>` node can be used.
de: Ebenfalls im vorherigen Kapitel behandelt, werden Nodes standardmäßig in Ebene 0 im Built-in-Canvas gezeichnet. Um Nodes in einer anderen Ebene zu platzieren, kann ein :ref:`CanvasLayer <class_CanvasLayer>`-Node verwendet werden.
zh_cn: 在前面的教程中也有介绍，节点默认是在 0 层上绘制，即内置的画布。如果要把节点放在不同的层中，可以使用 :ref:`CanvasLayer <class_CanvasLayer>` 节点。
zh_tw: 另外，在之前的教學中也有提到，節點預設會在內建 Canvas 的 Layer 0 中繪製。若要將節點放在不同的圖層中，可使用 :ref:`CanvasLayer <class_CanvasLayer>` 節點。

source: Global canvas transform
de: Globale Canvas-Transformation
zh_cn: 全局画布变换
zh_tw: 全域 Canvas 變換

source: Viewports also have a Global Canvas transform (also a :ref:`Transform2D <class_Transform2D>`). This is the master transform and affects all individual *Canvas Layer* transforms. Generally, this is primarily used in Godot's CanvasItem Editor.
de: Viewports haben auch eine globale Canvas-Transformation (auch eine :ref:`Transform2D <class_Transform2D>`). Dies ist die Master-Transformation und beeinflusst alle individuellen *Canvas Layer* Transformationen. Im Allgemeinen wird dies hauptsächlich im CanvasItem-Editor von Godot verwendet.
zh_cn: Viewport 还具有全局画布变换（也是一个 :ref:`Transform2D <class_Transform2D>`\ ）。这是一个能够影响所有\ *画布层*\ 的主变换。一般而言，主要用于 Godot 的 CanvasItem 编辑器。
zh_tw: Viewport 也有一個全域 Canvas 變換 (該變換也是 :ref:`Transform2D <class_Transform2D>`)。全域 Canvas 為主變換，會影響所有單獨的 **Canvas Layer** 變換。一般來說，這種變換並不常用，但在 Godot 編輯器中的 CanvasItem 編輯器中有用到。

source: Stretch transform
de: Stretch-Transformation
zh_cn: 拉伸变换
zh_tw: 拉伸變換

source: Finally, viewports have a *Stretch Transform*, which is used when resizing or stretching the screen. This transform is used internally (as described in :ref:`doc_multiple_resolutions`), but can also be manually set on each viewport.
de: Schließlich verfügen Ansichtsfenster über eine *Stretch-Transformation*, die beim Ändern der Größe oder Strecken des Bildschirms verwendet wird. Diese Transformation wird intern verwendet (wie in :ref:`doc_multiple_resolutions` beschrieben), kann aber auch manuell für jeden Viewport festgelegt werden.
zh_cn: 最后，Viewport 有\ *拉伸变换*\ ，用于调整大小或拉伸屏幕。此变换在内部使用（见 :ref:`doc_multiple_resolutions`\ ），但也可以在每个 Viewport 上手动设置。
zh_tw: 最後，Viewport 還有 **拉伸變換 (Stretch Transform)** ，該變換時用來縮放或拉伸螢幕的。這個變換時在內部使用的 (與 :ref:`doc_multiple_resolutions` 中說明的一樣)，但也可以手動在各個 Viewport 上設定。

source: Input events are multiplied by this transform but lack the ones above. To convert InputEvent coordinates to local CanvasItem coordinates, the :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` function was added for convenience.
de: Eingabeereignisse werden mit dieser Transformation multipliziert, aber nicht mit den oben genannten. Um InputEvent-Koordinaten in lokale CanvasItem-Koordinaten umzuwandeln, wurde der Einfachheit halber die Funktion :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` hinzugefügt.
zh_cn: 输入事件会与这个变换相乘，但还缺少前面说的那些。为了方便将 InputEvent 的坐标转换到 CanvasItem 局部坐标，添加了 :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` 函数。
zh_tw: 有接受 :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` 回呼的輸入事件也會受到該變換加成，但並不屬於上述變換。若要將 InputEvent 座標轉換為本機 CanvasItem 座標，我們提供了方便的 :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` 函式。

source: Window transform
de: Window-Transformation
zh_cn: 窗口变换
zh_tw: Canvas 變換

source: The root viewport is a :ref:`Window <class_Window>`. In order to scale and position the *Window's* content as described in :ref:`doc_multiple_resolutions`, each :ref:`Window <class_Window>` contains a *window transform*. It is for example responsible for the black bars at the *Window's* sides so that the *Viewport* is displayed with a fixed aspect ratio.
de: Der Root-Viewport ist ein :ref:`Window <class_Window>`. Um den Inhalt des *Windows* wie in :ref:`doc_multiple_resolutions` beschrieben zu skalieren und zu positionieren, enthält jedes :ref:`Window <class_Window>` eine *Window-Transformation*. Sie ist z.B. für die schwarzen Balken an den Seiten des *Windows* verantwortlich, damit der *Viewport* mit einem festen Seitenverhältnis dargestellt wird.
zh_cn: 根视口是一个 :ref:`Window <class_Window>`\ 。为了能够像 :ref:`doc_multiple_resolutions` 中一样将\ *窗口*\ 的内容进行缩放和移动，每个 :ref:`Window <class_Window>` 都包含了\ *窗口变换*\ 。例如在 *Viewport* 使用固定长宽比显示时，负责\ *窗口*\ 边缘的黑框。
zh_tw: 根視口是一個 :ref:`Window <class_Window>`。為了能夠像 :ref:`doc_multiple_resolutions` 中一樣將*視窗*的內容進行縮放和移動，每個 :ref:`Window <class_Window>` 都包含了*視窗變換*。例如在 *Viewport* 使用固定長寬比顯示時，負責*視窗*邊緣的黑框。

source: Transform order
de: Transformationsreihenfolge
zh_cn: 变换顺序
zh_tw: 變換順序

source: To convert a CanvasItem local coordinate to an actual screen coordinate, the following chain of transforms must be applied:
de: Um eine lokale CanvasItem-Koordinate in eine tatsächliche Bildschirmkoordinate umzuwandeln, muss die folgende Kette von Transformationen angewendet werden:
zh_cn: 要将 CanvasItem 本地坐标转换为实际屏幕坐标，必须应用以下变换链：
zh_tw: 要將 CanvasItem 本機屬性內的座標轉換為實際螢幕上的座標，必須要套用下列一系列的變換：

source: Transform functions
de: Transformationsfunktionen
zh_cn: 变换函数
zh_tw: 變換函式

source: The above graphic shows some available transform functions. All transforms are directed from right to left, this means multiplying a transform with a coordinate results in a coordinate system further to the left, multiplying the :ref:`affine inverse <class_Transform2D_method_affine_inverse>` of a transform results in a coordinate system further to the right:
de: Die obige Grafik zeigt einige verfügbare Transformationsfunktionen. Alle Transformationen sind von rechts nach links gerichtet, d.h. die Multiplikation einer Transformation mit einer Koordinate ergibt ein weiter links liegendes Koordinatensystem, die Multiplikation der :ref:`affinen Inversen <class_Transform2D_method_affine_inverse>` einer Transformation ergibt ein weiter rechts liegendes Koordinatensystem:
zh_cn: 上图显示了一些可用的变换函数。所有变换都是从右向左的，这意味着将一个变换与一个坐标相乘会得到一个更靠左的坐标系，将一个变换的 :ref:`affine inverse <class_Transform2D_method_affine_inverse>` 相乘会得到一个更靠右的坐标系：
zh_tw: 上圖顯示了一些可用的變換函式。所有變換都是從右向左的，這意味著將一個變換與一個座標相乘會得到一個更靠左的坐標系，將一個變換的 :ref:`affine inverse <class_Transform2D_method_affine_inverse>` 相乘會得到一個更靠右的坐標系：

source: Finally, then, to convert a CanvasItem local coordinates to screen coordinates, just multiply in the following order:
de: Um die lokalen CanvasItem-Koordinaten in Bildschirmkoordinaten umzuwandeln, multiplizieren Sie sie einfach in der folgenden Reihenfolge:
zh_cn: 那么最后, 要将CanvasItem的本地坐标转换为屏幕坐标, 只需按以下顺序相乘:
zh_tw: 最後，要將 CanvasItem 本機座標轉換為螢幕座標，只需要以下列順序相乘：

source: Keep in mind, however, that it is generally not desired to work with screen coordinates. The recommended approach is to simply work in Canvas coordinates (``CanvasItem.get_global_transform()``), to allow automatic screen resolution resizing to work properly.
de: Beachten Sie jedoch, dass es im Allgemeinen nicht erwünscht ist, mit Bildschirmkoordinaten zu arbeiten. Der empfohlene Ansatz besteht darin, einfach in Canvas-Koordinaten (``CanvasItem.get_global_transform()``) zu arbeiten, damit die automatische Größenänderung der Bildschirmauflösung ordnungsgemäß funktioniert.
zh_cn: 但请记住, 通常情况最好不要使用屏幕坐标. 推荐的方法是, 仅仅使用画布坐标( ``CanvasItem.get_global_transform()`` ), 以保证自动分辨率调整能正常工作.
zh_tw: 請記得，我們通常不會使用到螢幕座標。建議的做法是只要處理 Canvas 座標就好了 (``CanvasItem.get_global_transform()``)，使用 Canvas 座標就可以自動處理好不同的螢幕解析度縮放。

source: Feeding custom input events
de: Benutzerdefinierte Eingabeereignisse weiterleiten
zh_cn: 提供自定义输入事件
zh_tw: 處理自定輸入事件

source: It is often desired to feed custom input events to the game. With the above knowledge, to correctly do this in the focused window, it must be done the following way:
de: Oft ist es erwünscht, benutzerdefinierte Eingabeereignisse an das Spiel weiterzuleiten. Mit dem obigen Wissen muss dies im fokussierten Fenster auf die folgende Weise geschehen:
zh_cn: 通常需要将自定义输入事件提供给场景树。要正确地做到这一点，必须通过以下方式完成：
zh_tw: 很多情況下我們會想將自定輸入事件提供給場景樹。有了上述知識，若要正確將自定輸入事件提供給場景樹，則必須要通過下列方法：

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
