Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/canvas_layers.po
Languages: de, pl

source: Canvas layers
de: Canvas-Ebenen
pl: Warstwy Kanwy (Canvas layers)

source: Viewport and Canvas items
de: Viewport- und Canvas-Elemente
pl: Rzut Widoku oraz Elementy Kanwy (Viewport and Canvas items)

source: :ref:`CanvasItem <class_CanvasItem>` is the base for all 2D nodes, be it regular 2D nodes, such as :ref:`Node2D <class_Node2D>`, or :ref:`Control <class_Control>`. Both inherit from :ref:`CanvasItem <class_CanvasItem>`. You can arrange canvas items in trees. Each item will inherit its parent's transform: when the parent moves, its children move too.
de: :ref:`CanvasItem <class_CanvasItem>` ist die Basis für alle 2D-Nodes, seien es normale 2D-Nodes, wie :ref:`Node2D <class_Node2D>`, oder :ref:`Control <class_Control>`. Beide erben von :ref:`CanvasItem <class_CanvasItem>`. Sie können Canvas-Elemente in Bäumen anordnen. Jedes Element erbt die Transformation seines Parents: Wenn sich der Parent bewegt, bewegen sich auch seine Child-Elemente.
pl: :ref:`CanvasItem <class_CanvasItem>` jest podstawą wszystkich węzłów 2D, czy to zwykłych takich jak :ref:`Node2D <class_Node2D>`, lub :ref:`Control <class_Control>`. Oba dziedziczą od :ref:`CanvasItem <class_CanvasItem>`. Elementy Kanwy można układać w struktury drzew. Każdy element dziedziczy transformacje od swojego rodzica: gdy rodzic się porusza jego dzieci również się poruszają.

source: CanvasItem nodes, and nodes inheriting from them, are direct or indirect children of a :ref:`Viewport <class_Viewport>`, that displays them.
de: CanvasItem-Nodes und Nodes, die davon erben, sind direkte oder indirekte Child-Elemente eines :ref:`Viewport <class_Viewport>`, das sie anzeigt.
pl: Węzeł CanvasItem oraz węzły od niego dziedziczące są bezpośrednio bądź pośrednio dziećmi :ref:`Viewport <class_Viewport>`a, który je wyświetla.

source: The Viewport's property :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>`, allows to apply a custom :ref:`Transform2D <class_Transform2D>` transform to the CanvasItem hierarchy it contains. Nodes such as :ref:`Camera2D <class_Camera2D>` work by changing that transform.
de: Die Viewport-Property :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>` erlaubt es, eine benutzerdefinierte :ref:`Transform2D <class_Transform2D>`-Transformation auf die CanvasItem-Hierarchie anzuwenden, die sie enthält. Nodes wie :ref:`Camera2D <class_Camera2D>` funktionieren, indem sie diese Transformation ändern.
pl: Właściwość Viewporta :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>`, pozwala na zastosowanie niestandardowej transformacji :ref:`Transform2D <class_Transform2D>` w ramach hierarchi CanvasItem . Węzły takie jak :ref:`Camera2D <class_Camera2D>` działają poprzez zmiane tej transformacji.

source: To achieve effects like scrolling, manipulating the canvas transform property is more efficient than moving the root canvas item and the entire scene with it.
de: Effekte wie das Scrollen lassen sich am besten durch Bearbeiten der Canvas-Property "Transformation" erzielen. Dieser Ansatz ist effizienter als das Verschieben des Root-Canvas-Elements (und damit der gesamten Szene).
pl: Aby uzyskać efekt skrolowania, zmiana właściwości kanwy 'transform' jest bardziej efektywna zamiast poruszać korzeniem elemnetów kanwy, który także poruszy całą sceną.

source: Usually though, we don't want *everything* in the game or app to be subject to the canvas transform. For example:
de: Normalerweise wollen wir nicht, dass *alles* im Spiel durch Canvas-Transformation beeinflusst werden soll. Dazu zählen beispielsweise:
pl: Zazwyczaj jednak nie chcemy, aby *wszystko* w grze lub aplikacji podlegało transformacji kanwy. Na przykład:

source: **Parallax Backgrounds**: Backgrounds that move slower than the rest of the stage.
de: **Parallax-Hintergründe**: Hintergründe, die sich langsamer bewegen als der Rest des Geschehens.
pl: **Parallax Backgrounds**: Tło które porusza się wolniej niż reszta sceny.

source: **UI**: Think of a user interface (UI) or head-up display (HUD) superimposed on our view of the game world. We want a life counter, score display and other elements to retain their screen positions even when our view of the game world changes.
de: **UI**: Stellen Sie sich eine Benutzeroberfläche (UI) oder ein Head-up-Display (HUD) vor, die unsere Sicht auf die Spielwelt überlagert. Wir möchten, dass eine Lebensanzeige, eine Punkteanzeige und andere Elemente ihre Positionen auf dem Bildschirm beibehalten, auch wenn sich unsere Sicht auf die Spielwelt ändert.
pl: **UI**: Pomyślmy o interfejsie użytkownika (user inteface - UI) lub o head-up display (HUD) nałożonych na nasz widok świata gry . Chcemy, aby licznik żyć, wyświetlanie wyników i inne elementy zachowały swoje pozycje na ekranie, nawet gdy nasz widok świata gry się zmienia.

source: **Transitions**: We may want visual effects used for transitions (fades, blends) to remain at a fixed screen location.
de: **Übergänge**: Übergangseffekte (Fading, Blending) bleiben üblicherweise ebenso auf einer festen Position.
pl: **Transitions**: Możemy chcieć uzyskać wizualny efekt przejścia np. między scenami (zanikanie, blendowanie) to chcemy aby efekt pozostał w stałej lokalizacji ekranu.

source: How to solve these problems in a single scene tree?
de: Wie lassen sich diese Probleme in einem einzigen Szenenbaum lösen?
pl: Jak mogę to rozwiązać za pomocą jednej sceny?

source: The answer is :ref:`CanvasLayer <class_CanvasLayer>`, which is a node that adds a separate 2D rendering layer for all its children and grand-children. Viewport children will draw by default at layer "0", while a CanvasLayer will draw at any numeric layer. Layers with a greater number will be drawn above those with a smaller number. CanvasLayers also have their own transform and do not depend on the transform of other layers. This allows the UI to be fixed in screen-space while our view on the game world changes.
de: Die Antwort ist :ref:`CanvasLayer <class_CanvasLayer>`, ein Node, der eine separate 2D-Ebene zum Zeichnen seiner untergeordneten Nodes bietet. Child-Nodes des Viewports werden grundsätzlich auf Ebene "0" gezeichnet, wohingegen ein CanvasLayer auf jeder beliebigen Ebene sein kann. Ebenen mit einer höheren Nummer liegen über jenen mit einer kleineren. CanvasLayers besitzen jeweils eigene Transformationsanpassungen und sind nicht von denen der anderen Ebenen abhängig. Dadurch kann die Benutzeroberfläche im Screen-Space fixiert werden, während sich die Ansicht der Spielwelt ändert.
pl: Odpowiedzią jest :ref:`CanvasLayer <class_CanvasLayer>`, który jest węzłem dodającym oddzielną warstwę renderowania 2D dla wszystkich swoich dzieci i wnuków (podwęzłów). Dzieci Viewporta będą domyślnie rysowane na warstwie numer "0", podczas gdy CanvasLayer może być rysowanym na dowolnym numerze warstwy. Warstwy z większym numerem będą rysowane wyżej od tych z mniejszym numerem. Będą je przysłaniać. CanvasLayers mają również własną transformację i nie zależą od transformacji innych warstw. Dzięki temu interfejs użytkownika może być stały w przestrzeni ekranu, podczas gdy nasz widok na świat gry się zmienia.

source: An example of this is creating a parallax background. This can be done with a CanvasLayer at layer "-1". The screen with the points, life counter and pause button can also be created at layer "1".
de: Ein Beispiel dazu ist ein Parallax-Hintergrund. So kann dieser in einem CanvasLayer auf Ebene "-1" dargestellt werden. Die Ansicht mit Punktestand, Lebensanzeige und Pause-Button dagegen werden auf Ebene "1" angelegt.
pl: Przykładem tego jest tworzenie tła paralaksy. Można to zrobić ustawiająć w CanvasLayer warstwę na "-1". Ekran z punktami, ilością żyć bądź przyciskiem pauzy można utworzyć na warstwie "1".

source: Here's a diagram of how it looks:
de: Hier ein Diagramm zur Veranschaulichung:
pl: Tutaj jest diagram jak to powinno wyglądać:

source: CanvasLayers are independent of tree order, and they only depend on their layer number, so they can be instantiated when needed.
de: CanvasLayer sind unabhängig von der Baumreihenfolge und hängen nur von der Ebenennummer ab, so dass sie bei Bedarf instanziiert werden können.
pl: CanvasLayers są niezależne od pozycji w drzewie sceny i zależą wyłącznie od numeru warstwy, więc możesz je dodać na dowolnym poziomie drzewa sceny.

source: CanvasLayers aren't necessary to control the drawing order of nodes. The standard way to ensuring that a node is correctly drawn 'in front' or 'behind' others is to manipulate the order of the nodes in the scene panel. Perhaps counterintuitively, the topmost nodes in the scene panel are drawn on *behind* lower ones in the viewport. 2D nodes also have the :ref:`CanvasItem.z_index <class_CanvasItem_property_z_index>` property for controlling their drawing order.
de: CanvasLayer sind nicht notwendig, um die Zeichenreihenfolge von Nodes zu steuern. Der Standardweg, um sicherzustellen, dass ein Node korrekt "vor" oder "hinter" anderen gezeichnet wird, besteht darin, die Reihenfolge der Nodes im Szenenfenster zu manipulieren. Vielleicht kontraintuitiv, werden die obersten Nodes im Szenenfenster *hinter* den niedrigeren im Viewport gezeichnet. 2D-Nodes haben auch die Property :ref:`CanvasItem.z_index <class_CanvasItem_property_z_index>`, um ihre Zeichenreihenfolge zu steuern.
pl: CanvasLayers nie są konieczne do kontrolowania kolejności widoczności węzłów. Standardowym sposobem upewnienia się, że węzeł jest poprawnie rysowany "przed" lub "za" innymi, jest ustawianie kolejności węzłów na liście drzewa węzłów sceny. Wbrew intuicji najwyższe węzły w panelu sceny są rysowane *za* niższymi w rzutni. Węzły 2D mają również właściwość :ref:`CanvasItem.z_index <class_CanvasItem_property_z_index>` do kontrolowania ich kolejności rysowania.

source: Translation status
de: Übersetzungsstatus
pl: Status tłumaczenia
