Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/particle_systems_2d.po
Languages: es

source: Intro
es: Introducción

source: The idea is that a "particle" is emitted at a fixed interval and with a fixed lifetime. During its lifetime, every particle will have the same base behavior. What makes each particle different from the rest and provides a more organic look is the "randomness" associated with each parameter. In essence, creating a particle system means setting base physics parameters and then adding randomness to them.
es: La idea es que una "partícula" se emite a un intervalo fijo y con una vida útil fija. Durante su vida útil, cada partícula tendrá el mismo comportamiento básico. Lo que hace que cada partícula sea diferente y proporciona un aspecto más orgánico es la "aleatoriedad" asociada a cada parámetro. En esencia, crear un sistema de partículas significa establecer parámetros físicos básicos y luego agregarles aleatoriedad.

source: Particle nodes
es: Nodos de partículas

source: Texture
es: Textura

source: Time parameters
es: Parámetros de Tiempo (Time)

source: Lifetime
es: Lifetime (Tiempo de vida)

source: The time in seconds that every particle will stay alive. When lifetime ends, a new particle is created to replace it.
es: El tiempo en segundos que cada partícula estará viva. Cuando termina su tiempo de vida, se crea una nueva partícula para reemplazarla.

source: Lifetime: 0.5
es: Tiempo de vida: 0.5

source: Lifetime: 4.0
es: Tiempo de vida: 4.0

source: One Shot
es: One Shot (Una Vez)

source: Preprocess
es: Preprocess (Preproceso)

source: Particle systems begin with zero particles emitted, then start emitting. This can be an inconvenience when loading a scene and systems like a torch, mist, etc. begin emitting the moment you enter. Preprocess is used to let the system process a given number of seconds before it is actually drawn the first time.
es: Los sistemas de partículas comienzan con cero partículas emitidas, luego comienzan a emitir. Esto puede ser un inconveniente al cargar una escena y sistemas de partículas como una antorcha, niebla, etc. ya que comienzan a emitir en el momento en que entras. El preproceso se usa para permitir que el sistema procese un número determinado de segundos antes de que se dibuje por primera vez.

source: Speed Scale
es: Speed Scale (Escala de Velocidad)

source: The speed scale has a default value of ``1`` and is used to adjust the speed of a particle system. Lowering the value will make the particles slower while increasing the value will make the particles much faster.
es: La escala de velocidad tiene un valor predeterminado de ``1``, y se usa para ajustar la velocidad de un sistema de partículas. Disminuir el valor hará que las partículas se vuelvan más lentas, aumentar el valor hará que las partículas sean mucho más rápidas.

source: Explosiveness
es: Explosiveness (Explosividad)

source: If lifetime is ``1`` and there are 10 particles, it means a particle will be emitted every 0.1 seconds. The explosiveness parameter changes this, and forces particles to be emitted all together. Ranges are:
es: Si el tiempo de vida es ``1`` y hay diez partículas, significa que se emitirá una partícula cada 0.1 segundos. El parámetro de explosividad cambia esto y obliga a las partículas a emitirse todas al mismo tiempo. Los rangos son:

source: 0: Emit particles at regular intervals (default value).
es: 0: Emite partículas a intervalos regulares (valor predeterminado).

source: 1: Emit all particles simultaneously.
es: 1: Emite todas las partículas simultáneamente.

source: Values in the middle are also allowed. This feature is useful for creating explosions or sudden bursts of particles:
es: Los valores intermedios también están permitidos. Esta característica es útil para crear explosiones o ráfagas repentinas de partículas:

source: Randomness
es: Randomness (Aleatoriedad)

source: All physics parameters can be randomized. Random values range from ``0`` to ``1``. The formula to randomize a parameter is:
es: Todos los parámetros de física se pueden aleatorizar. Los valores aleatorios varían de ``0`` a ``1``. La fórmula para aleatorizar un parámetro es:

source: Fixed FPS
es: FPS fijo

source: This setting can be used to set the particle system to render at a fixed FPS. For instance, changing the value to ``2`` will make the particles render at 2 frames per second. Note this does not slow down the particle system itself.
es: Esta configuración se puede usar para configurar el sistema de partículas para que se renderice a un FPS(Fotogramas Por Segundo) fijo. Por ejemplo, cambiar el valor a ``2`` hará que las partículas se rendericen a 2 fotogramas por segundo. Tenga en cuenta que esto no ralentiza el sistema de partículas en sí.

source: This can be used to turn Fract Delta on or off.
es: Esto se puede usar para activar o desactivar Fract Delta.

source: Drawing parameters
es: Parámetros de Dibujo (Drawing)

source: Visibility Rect
es: Visibility Rect (Rectángulo de Visibilidad)

source: The visibility rectangle controls the visibility of the particles on screen. If this rectangle is outside of the viewport, the engine will not render the particles on screen.
es: El rectángulo de visibilidad controla la visibilidad del sistema de partícuas. Si el rectángulo está fuera del Viewport, el motor no dibujará en pantalla las particulas del sistema.

source: The rectangle's ``W`` and ``H`` properties respectively control its Width and its Height. The ``X`` and ``Y`` properties control the position of the upper-left corner of the rectangle, relative to the particle emitter.
es: Los valores ``W`` y ``H`` controlan el ancho y alto del rectángulo de visibilidad. Los valores ``X`` y ``Y`` controlan la posición de la esquina superior izquierda del rectángulo de visibilidad, relativo al emisor de partículas.

source: You can control the emit duration with the ``Generation Time (sec)`` option. The maximum value is 25 seconds. If you need more time for your particles to move around, you can temporarily change the ``preprocess`` duration on the Particles2D node.
es: Puedes controlar la duración de la emisión con la opción ``Tiempo de generación (seg)``. El valor máximo es de 25 segundos, si necesitas más tiempo para que tus partículas se muevan, puedes cambiar temporalmente la propiedad ``preprocess`` en el nodo Particles2D.

source: Local Coords
es: Coordenadas Locales

source: By default this option is on, and it means that the space that particles are emitted to is relative to the node. If the node is moved, all particles are moved with it:
es: Por defecto esta opción está activada, y significa que el espacio al que se emiten las partículas es relativo al nodo. Si se mueve el nodo, todas las partículas se mueven con él:

source: If disabled, particles will emit to global space, meaning that if the node is moved, already emitted particles are not affected:
es: Si se desactiva, las partículas se emitirán en el espacio global, lo que significa que si el nodo se mueve, las partículas ya emitidas no se verán afectadas:

source: Draw Order
es: Draw Order (Orden de Dibujo)

source: This controls the order in which individual particles are drawn. ``Index`` means particles are drawn according to their emission order (default). ``Lifetime`` means they are drawn in order of remaining lifetime.
es: Esto controla el orden en el que se dibujan las partículas individuales. ``Index`` significa que las partículas son dibujadas de acuerdo a su orden de emisión (por defecto). ``Lifetime`` significa que se dibujan en el orden de la vida restante.

source: Direction
es: Dirección

source: This is the base direction at which particles emit. The default is ``Vector3(1, 0, 0)`` which makes particles emit to the right. However, with the default gravity settings, particles will go straight down.
es: Esta es la dirección base en la que las partículas emiten. El valor por defecto es "Vector3(1, 0, 0)`` que hace que las partículas emitan hacia la derecha. Sin embargo, con la configuración predeterminada de la gravedad, las partículas irán directamente hacia abajo.

source: For this property to be noticeable, you need an *initial velocity* greater than 0. Here, we set the initial velocity to 40. You'll notice that particles emit toward the right, then go down because of gravity.
es: Para que esta propiedad se note, se necesita una *velocidad inicial* mayor que 0. Aquí, fijamos la velocidad inicial en 40. Notará que las partículas se emiten hacia la derecha, y luego bajan debido a la gravedad.

source: Spread
es: Spread (Propagación)

source: This parameter is the angle in degrees which will be randomly added in either direction to the base ``Direction``. A spread of ``180`` will emit in all directions (+/- 180). For spread to do anything the "Initial Velocity" parameter must be greater than 0.
es: Este parámetro es el ángulo en grados que se añadirá aleatoriamente en cualquier dirección a la base ``Direction``. Un spread(Dispersión) de ``180`` emitirá en todas las direcciones (+/- 180).

source: Flatness
es: Llanura

source: This property is only useful for 3D particles.
es: Esta propiedad sólo es útil para las partículas 3D.

source: Gravity
es: Gravity (Gravedad)

source: The gravity applied to every particle.
es: La gravedad aplicada a cada partícula.

source: Initial Velocity
es: Initial Velocity (Velocidad Inicial)

source: Initial velocity is the speed at which particles will be emitted (in pixels/sec). Speed might later be modified by gravity or other accelerations (as described further below).
es: Initial Velocity es la velocidad a la que se emitirán las partículas (en píxeles/segundo). La velocidad puede ser modificada posteriormente por la gravedad u otras aceleraciones (como se describe más adelante).

source: Angular Velocity
es: Angular Velocity (Velocidad Angular)

source: Angular velocity is the initial angular velocity applied to particles.
es: Angular velocity es la velocidad angular inicial aplicada a las partículas.

source: Spin Velocity
es: Spin Velocity (Velocidad de Giro)

source: Spin velocity is the speed at which particles turn around their center (in degrees/sec).
es: Spin velocity es la velocidad a la que las partículas giran alrededor de su centro (en grados/segundo).

source: Orbit Velocity
es: Orbit Velocity (Velocidad de la Órbita)

source: Orbit velocity is used to make particles turn around their center.
es: Orbit velocity se utiliza para hacer que las partículas giren alrededor de su centro.

source: Linear Acceleration
es: Linear Acceleration (Aceleración Lineal)

source: The linear acceleration applied to each particle.
es: La aceleración lineal aplicada a cada partícula.

source: Radial Acceleration
es: Radial Acceleration (Aceleración Radial)

source: If this acceleration is positive, particles are accelerated away from the center. If negative, they are absorbed towards it.
es: Si esta aceleración es positiva, las partículas se aceleran lejos del centro. Si es negativo, se atraen hacia él.

source: Tangential Acceleration
es: Tangential Acceleration (Aceleración Tangencial)

source: This acceleration will use the tangent vector to the center. Combining with radial acceleration can do nice effects.
es: Esta aceleración utilizará el vector tangente hasta el centro. La combinación con la aceleración radial puede producir buenos efectos.

source: Damping
es: Damping (Amortiguación)

source: Damping applies friction to the particles, forcing them to stop. It is especially useful for sparks or explosions, which usually begin with a high linear velocity and then stop as they fade.
es: Damping aplica fricción a las partículas, forzándolas a detenerse. Es especialmente útil para chispas o explosiones, que generalmente comienzan con una alta velocidad lineal y luego se detienen a medida que se desvanecen.

source: Angle
es: Angle (Ángulo)

source: Determines the initial angle of the particle (in degrees). This parameter is mostly useful randomized.
es: Determina el ángulo inicial de la partícula (en grados). Este parámetro es mayormente útil aleatorizado.

source: Scale
es: Escala

source: Determines the initial scale of the particles.
es: Determina la escala inicial de las partículas.

source: Used to change the color of the particles being emitted.
es: Permite cambiar el color de las partículas emitidas.

source: The ``Variation`` value sets the initial hue variation applied to each particle. The ``Variation Random`` value controls the hue variation randomness ratio.
es: El valor de ``Variation`` establece la variación de tono inicial aplicada a cada partícula. El valor ``Variation Random`` controla el ratio de aleatoriedad de la variación de tono.

source: Animation
es: Animación

source: Emission Shapes
es: Formas de Emisión

source: Open it and select "Load Emission Mask":
es: Abrelo y selecciona "Cargar Máscara de Emisión":

source: Then select which texture you want to use as your mask:
es: Luego selecciona la textura que usarás como máscara:

source: A dialog box with several settings will appear.
es: Aparecerá un cuadro de diálogo con varias configuraciones.

source: Emission Mask
es: Máscara de Emisión

source: Three types of emission masks can be generated from a texture:
es: Desde una textura se pueden generar tres tipos de máscaras de emisión:

source: Solid Pixels: Particles will spawn from any area of the texture, excluding transparent areas.
es: Pixeles Sólidos: Las partículas aparecerán desde cualquier área de la textura, excluyendo áreas transparentes.

source: Border Pixels: Particles will spawn from the outer edges of the texture.
es: Píxeles de Borde: Las partículas saldrán de los bordes exteriores de la textura.

source: Directed Border Pixels: Similar to Border Pixels, but adds extra information to the mask to give particles the ability to emit away from the borders. Note that an ``Initial Velocity`` will need to be set in order to utilize this.
es: Píxeles de Borde Directos: Similar a Píxeles de Borde, pero agrega información extra a la máscara para darle la habilidad de emitirse hacia afuera de los bordes. Nota que la ``Initial Velocity`` debe ser asignada para utilizar esto.

source: Emission Colors
es: Colores de Emisión

source: ``Capture from Pixel`` will cause the particles to inherit the color of the mask at their spawn points.
es: ``Capture from Pixel`` causará que las partículas hereden el color de la máscara donde son emitidos.

source: All of the values within this section have been automatically generated by the "Load Emission Mask" menu, so they should generally be left alone.
es: Todos los valores de esta sección han sido generados automáticamente por el menú "Cargar Máscara de Emisión", así que en general no debe tocarse nada.

source: An image should not be added to ``Point Texture`` or ``Color Texture`` directly. The "Load Emission Mask" menu should always be used instead.
es: La imagen no debe ser agregada directamente a ``Point Texture`` o ``Color Texture``. Se debe usar siempre el menú "Cargar Máscara de Emisión".

source: Translation status
es: Estado de traducción
