Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: de, zh_cn, zh_tw

source: **Y Sort Origin:** The vertical offset to use for tile sorting based on its Y coordinate (in pixels). This allows using layers as if they were on different height for top-down games. Adjusting this can help alleviate issues with sorting certain tiles. Only effective if **Y Sort Enabled** is ``true`` on the TileMap layer the tile is placed on.
de: **Y-Sortierungsursprung:** Der vertikale Offset, der für die Sortierung der Tiles basierend auf ihrer Y-Koordinate (in Pixel) verwendet wird. Dies ermöglicht die Verwendung von Ebenen, wie wenn sie auf verschiedenen Höhen bei Top-Down-Spiele wären. Die Anpassung dieses Wertes kann helfen, Probleme bei der Sortierung bestimmter Tiles zu beheben. Nur wirksam, wenn **Y-Sortierung aktiviert** auf dem TileMap Layer, auf dem das Tile platziert ist, auf ``true`` steht.
zh_cn: **Y 排序原点：**\ （Y Sort Origin）基于其 Y 坐标（以像素为单位）进行图块排序时要使用的垂直偏移量。这使得可以将图层视为在不同高度上用于俯视角的游戏。调整此值可以帮助缓解某些图块排序的问题。仅当放置图块的 TileMap 图层的 **Y Sort Enabled** 为 ``启用`` 时才有效。
zh_tw: **Y 排序原點：** 用於基於 Y 座標（以像素為單位）進行圖塊排序的垂直偏移。這允許在自上而下的遊戲中使用圖層，就好像它們處於不同的高度一樣。調整此項可以幫助緩解對某些圖塊進行排序的問題。僅在放置圖塊的 TileMap 圖層上 **Y Sort Enabled** 為「true」時才有效。

source: You can create an additional alternative tile variant by clicking the large "+" icon next to the alternative tile. This is equivalent to selecting the base tile and right-clicking it to choose **Create an Alternative Tile** again.
de: Sie können eine zusätzliche alternative Tile-Variante erstellen, indem Sie auf das große "+"-Symbol neben der alternativen Tile klicken. Dies ist gleichbedeutend mit der Auswahl der Basis-Tile und einem Rechtsklick darauf, um erneut **Alternative Tile erstellen** zu wählen.
zh_cn: 你可以通过点击在备选图块旁的 “+” 图标来创建一个基于该图块的新的备选图块。该操作与在选择基本图块后并右键选择 “创建备选图块” 等价。
zh_tw: 你可以通過點擊在備選圖塊旁的 “+” 圖示來建立一個基於該圖塊的新的備選圖塊。該操作與在選擇基本圖塊後並右鍵選擇 “建立備選圖塊” 等價。

source: When creating an alternative tile, none of the properties from the base tile are inherited. You must set properties again on the alternative tile if you wish those to be identical on the base tile and the alternative tile.
de: Bei der Erstellung einer alternativen Tile wird keine der Propertys der Basis-Tile übernommen. Sie müssen die Propertys auf der alternativen Tile erneut festlegen, wenn Sie möchten, dass diese auf der Basis-Tile und der alternativen Tile identisch sind.
zh_cn: 当创建一个备选图块时，其基本图块的任何属性将不会被继承下来。如果你希望备选图块与基本图块的属性相同，那么你需要在备选图块中重新设置这些属性。
zh_tw: 當建立一個備選圖塊時，其基本圖塊的任何屬性將不會被繼承下來。如果你希望備選圖塊與基本圖塊的屬性相同，那麼你需要在備選圖塊中重新設定這些屬性。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
