Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: de, zh_cn, zh_tw

source: Select this scene slot in the right column, then use **Quick Load** (or **Load**) to load the scene file containing the particles:
de: Wählen Sie diesen Szenenslot in der rechten Spalte aus, und verwenden Sie **Schnellladen** (oder **Laden**), um die Szenendatei mit den Partikeln zu laden:
zh_cn: 在右栏中选中这个场景槽，然后使用\ **快速加载**\ （或\ **加载**\ ）来加载包含粒子的场景文件：
zh_tw: 在右欄中選中這個場景槽，然後使用**快速載入**（或**載入**）來載入包含粒子的場景檔：

source: Creating a scene slot, then loading a scene file into it in the TileSet editor
de: Erstellen eines Szenenslots und anschließendes Laden einer Szenendatei in diesen Slot im TileSet-Editor
zh_cn: 在 TileSet 编辑器中创建场景槽，然后为其加载场景文件
zh_tw: 在 TileSet 編輯器中建立場景槽，然後為其載入場景檔案

source: You now have a scene tile in your TileSet. Once you switch to the TileMap editor, you'll be able to select it from the scenes collection and paint it like any other tile.
de: Sie haben jetzt eine Tile in Ihrem TileSet. Sobald Sie zum TileMap-Editor wechseln, können Sie sie aus der Szenensammlung auswählen und wie jede andere Tile malen.
zh_cn: 现在你的 TileSet 中就有了一个场景图块。切换到 TileMap 编辑器之后，你就可以在场景合集中选择则个场景图块，然后和其他图块一样进行绘制。
zh_tw: 現在你的 TileSet 中就有了一個場景圖塊。切換到 TileMap 編輯器之後，你就可以在場景合集中選擇則個場景圖塊，然後和其他圖塊一樣進行繪製。

source: Merging several atlases into a single atlas
de: Zusammenführung mehrerer Atlasse zu einem einzigen Atlas
zh_cn: 将若干图集合并为单个图集
zh_tw: 將若干合集合並為單個合集

source: Using multiple atlases within a single TileSet resource can sometimes be useful, but it can also be cumbersome in certain situations (especially if you're using one image per tile). Godot allows you to merge several atlases into a single atlas for easier organization.
de: Die Verwendung mehrerer Atlasse innerhalb einer einzigen TileSet-Ressource kann manchmal nützlich sein, aber in bestimmten Situationen auch umständlich (insbesondere wenn Sie ein Bild pro Tile verwenden). Godot ermöglicht es Ihnen, mehrere Atlasse zu einem einzigen Atlas zusammenzufassen, um die Organisation zu erleichtern.
zh_cn: 在单个 TileSet 资源中使用多个图集有时可能很有用，但在某些情况下可能会变得繁琐（特别是如果你每个图块使用一个图像）。Godot 允许你将多个图集合并成一个单独的图集，以便更轻松地组织。
zh_tw: 在單個TileSet資源中使用多個合集有時可能很有用，但在某些情況下可能會變得繁瑣（特別是如果您每個圖塊使用一個圖像）。Godot允許您將多個合集合並成一個單獨的合集，以便更輕鬆地組織。

source: To do so, you must have more than one atlas created in the TileSet resource. Use the "three vertical dots" menu button located at the bottom of the list of atlases, then choose **Open Atlas Merging Tool**:
de: Dazu müssen Sie mehr als einen Atlas in der TileSet-Ressource erstellt haben. Verwenden Sie den "drei vertikale Punkte"-Menü-Button unten in der Liste der Atlasse und wählen Sie dann **Tool zum Zusammenführen von Atlassen öffnen**:
zh_cn: 如果要这样做，你必须在TileSet资源处创建了不止一个atlas。在atlas列表下找到“three vertical dots”的菜单按钮，然后选择**图集合并合工具**:
zh_tw: 如果要這樣做，你必須在TileSet資源處建立了不止一個atlas。在atlas列表下找到“three vertical dots”的功能表按鈕，然後選擇**合集合併合工具**:

source: Opening the atlas merging tool after creating multiple atlases
de: Öffnen des Tools zum Zusammenführen von Atlassen nach dem Erstellen mehrerer Atlasse
zh_cn: 在创建多个图集后，打开图集合并工具
zh_tw: 在建立多個合集後，打開合集合並工具

source: This will open a dialog, in which you can select several atlases by holding :kbd:`Shift` or :kbd:`Ctrl` then clicking on multiple elements:
de: Dies öffnet einen Dialog, in dem Sie mehrere Atlasse auswählen können, indem Sie :kbd:`Umschalt` oder :kbd:`Strg` gedrückt halten und dann auf mehrere Elemente klicken:
zh_cn: 这将打开一个对话框，在该对话框中，你可以通过按住 :kbd:`Shift` 或 :kbd:`Ctrl` 键并同时点击多个元素来选择多个图集：
zh_tw: 這將打開一個對話方塊，在該對話方塊中，您可以通過按住 :kbd:`Shift` 或 :kbd:`Ctrl` 鍵並同時點擊多個元素來選擇多個合集：

source: Using the atlas merging tool dialog
de: Verwendung des Dialogfelds des Tools zur Zusammenführung von Atlassen
zh_cn: 使用图集合并工具对话框
zh_tw: 使用合集合並工具對話方塊

source: Choose **Merge** to merge the selected atlases into a single atlas image (which translates to a single atlas within the TileSet). The unmerged atlases will be removed within the TileSet, but *the original tilesheet images will be kept on the filesystem*. If you don't want the unmerged atlases to be removed from the TileSet resource, choose **Merge (Keep Original Atlases)** instead.
de: Wählen Sie **Zusammenführen**, um die ausgewählten Atlasse zu einem einzigen Atlasbild zusammenzuführen (was einem einzigen Atlas innerhalb des TileSet entspricht). Die nicht zusammengeführten Atlasse werden aus dem TileSet entfernt, aber *die ursprünglichen Tilesheet-Bilder bleiben im Dateisystem erhalten*. Wenn Sie nicht möchten, dass die nicht zusammengeführten Atlasse aus der TileSet-Ressource entfernt werden, wählen Sie stattdessen **Zusammenführen (Original-Atlasse behalten)**.
zh_cn: 选择 **合并** 将以选择的图集合并成一个图集图片（在 TileSet 的单个图集）。没有合并的图集将会在 TileSet 被移除，但是 *原来的 tilesheet 图片会被保留在文件系统里* 。如果你想在TileSet 资源保留没有合并的图集，选择 **合并（保留原来的图集）** 。
zh_tw: 選擇 **合併** 將以選擇的合集合並成一個合集圖片（在 TileSet 的單個合集）。沒有合併的合集將會在 TileSet 被移除，但是 *原來的 tilesheet 圖片會被保留在檔案系統裡* 。如果你想在TileSet 資源保留沒有合併的合集，選擇 **合併（保留原來的合集）** 。

source: TileSet features a system of *tile proxies*. Tile proxies are a mapping table that allows notifying the TileMap using a given TileSet that a given set of tile identifiers should be replaced by another one.
de: TileSet verfügt über ein System von *Tile Proxies*. Tile-Proxies sind eine Zuordnungstabelle, die es ermöglicht, der TileMap, die ein bestimmtes TileSet verwendet, mitzuteilen, dass ein bestimmter Satz von Tile-Identifikatoren durch einen anderen ersetzt werden soll.
zh_cn: TileSet 具有一个 *图块代理* 系统。图块代理是一张映射表，它允许通知使用了给定 TileSet 的 TileMap，以便将一组给定的图块标识符替换为另一组图块标识符。
zh_tw: TileSet 具有一個 *圖塊代理* 系統。圖塊代理是一張對應表，它允許通知使用了給定 TileSet 的 TileMap，以便將一組給定的圖塊識別字替換為另一組圖塊識別字。

source: Tile proxies are automatically set up when merging different atlases, but they can also be set manually thanks to the **Manage Tile Proxies** dialog you can access using the "three vertical dots" menu mentioned above.
de: Tile Proxys werden beim Zusammenführen verschiedener Atlasse automatisch eingerichtet, können aber auch manuell über den Dialog **Tile Proxys verwalten** eingestellt werden, den Sie über das oben erwähnte Menü mit den drei vertikalen Punkten aufrufen können.
zh_cn: 合并不同图集时会自动设置图块代理，但也可以通过 **管理图块代理** 对话框手动设置，你可以使用上面提到的“三个竖点”菜单访问该对话框。
zh_tw: 合併不同合集時會自動設定圖塊代理，但也可以通過 **管理圖塊代理** 對話方塊手動設定，你可以使用上面提到的“三個豎點”功能表存取該對話方塊。

source: Manually creating tile proxies may be useful when you changed an atlas ID or want to replace all tiles from an atlas by the ones from another atlas. Note that when editing a TileMap, you can replace all cells by their corresponding mapped value.
de: Die manuelle Erstellung von Tile-Proxys kann nützlich sein, wenn Sie eine Atlas-ID geändert haben oder alle Tiles aus einem Atlas durch die eines anderen Atlas ersetzen möchten. Beachten Sie, dass Sie bei der Bearbeitung einer TileMap alle Zellen durch ihren entsprechenden zugeordneten Wert ersetzen können.
zh_cn: 当你更改了图集 ID 或想用另一个图集的图块替换一个图集的所有图块时，手动创建图块代理可能会很有用。请注意，编辑 TileMap 时，你可以用相应的映射值替换所有网格。
zh_tw: 當你更改了合集 ID 或想用另一個合集的圖塊替換一個合集的所有圖塊時，手動建立圖塊代理可能會很有用。請注意，編輯 TileMap 時，你可以用相應的對應值替換所有網格。

source: Adding collision, navigation and occlusion to the TileSet
de: Hinzufügen von Kollision, Navigation und Occlusion zum TileSet
zh_cn: 向 TileSet 添加碰撞、导航和遮挡
zh_tw: 向 TileSet 新增碰撞、導覽和遮擋

source: We've now successfully created a basic TileSet. We could start using in the TileMap node now, but it currently lacks any form of collision detection. This means the player and other objects could walk straight through the floor or walls.
de: Wir haben nun erfolgreich ein grundlegendes TileSet erstellt. Wir könnten nun den TileMap-Node verwenden, aber dieser verfügt derzeit über keine Form der Kollisionserkennung. Das bedeutet, dass der Spieler und andere Objekte direkt durch den Boden oder die Wände laufen könnten.
zh_cn: 现在我们已经成功创建了一个基本的 TileSet。我们现在可以开始使用 TileMap 节点，但它目前缺乏任何形式的碰撞检测。这意味着玩家和其他物体可以直接穿过地板或墙壁。
zh_tw: 現在我們已經成功建立了一個基本的 TileSet。我們現在可以開始使用 TileMap 節點，但它目前缺乏任何形式的碰撞偵測。這意味著玩家和其他物體可以直接穿過地板或牆壁。

source: If you use :ref:`2D navigation <doc_navigation_overview_2d>`, you'll also need to define navigation polygons for tiles to generate a navigation mesh that agents can use for pathfinding.
de: Wenn Sie :ref:`2D-Navigation <doc_navigation_overview_2d>` verwenden, müssen Sie auch Navigationspolygone für Tiles definieren, um ein Navigations-Mesh zu erzeugen, das Agenten für die Wegfindung verwenden können.
zh_cn: 如果使用 :ref:`2D 导航 <doc_navigation_overview_2d>`，还需要为图块定义导航多边形，以生成导航网格，供代理用于寻路。
zh_tw: 如果使用 :ref:`2D 導覽 <doc_navigation_overview_2d>`，還需要為圖塊定義導覽多邊形，以生成導覽網格，供代理用於尋路。

source: Lastly, if you use :ref:`doc_2d_lights_and_shadows` or GPUParticles2D, you may also want your TileSet to be able to cast shadows and collide with particles. This requires defining occluder polygons for "solid" tiles on the TileSet.
de: Schließlich, wenn Sie :ref:`doc_2d_lights_and_shadows` oder GPUParticles2D verwenden, möchten Sie vielleicht auch, dass Ihr TileSet Schatten wirft und mit Partikeln kollidiert. Dazu müssen Occluder-Polygone für "solide" Tiles auf dem TileSet definiert werden.
zh_cn: 最后，如果你使用 :ref:`doc_2d_lights_and_shadows` 或 GPUParticles2D，你可能还希望 TileSet 能够投射阴影并与粒子碰撞。这就需要为 TileSet 上的 “实体” 图块定义遮挡多边形。
zh_tw: 最後，如果你使用 :ref:`doc_2d_lights_and_shadows` 或 GPUParticles2D，你可能還希望 TileSet 能夠投射陰影並與粒子碰撞。這就需要為 TileSet 上的 “實體” 圖塊定義遮擋多邊形。

source: To be able to define collision, navigation and occlusion shapes for each tile, you will need to create a physics, navigation or occlusion layer for the TileSet resource first. To do so, select the TileMap node, click the TileSet property value in the inspector to edit it then unfold **Physics Layers** and choose **Add Element**:
de: Um Kollisions-, Navigations- und Occlusion-Shapes für jede Tile definieren zu können, müssen Sie zunächst eine Physik-, Navigations- oder Occlusion-Schicht für die TileSet-Ressource erstellen. Wählen Sie dazu den Node TileMap aus, klicken Sie im Inspektor auf den Property-Wert TileSet, um ihn zu bearbeiten, klappen Sie dann **Physik-Ebenen** auf und wählen Sie **Element hinzufügen**:
zh_cn: 要为每个图块定义碰撞、导航和遮罩形状，首先需要为 TileSet 资源创建物理层、导航层或遮挡层。为此，请选择 TileMap 节点，单击检查器中的 TileSet 属性值进行编辑，然后展开 **物理层** 并选择 **添加元素**\ ：
zh_tw: 要為每個圖塊定義碰撞、導覽和遮罩形狀，首先需要為 TileSet 資源建立實體層、導覽層或遮擋層。為此，請選擇 TileMap 節點，按一下屬性面板中的 TileSet 屬性值進行編輯，然後展開 **實體層** 並選擇 **新增元素**：

source: Creating a physics layer in the TileSet resource inspector (within the TileMap node)
de: Erstellen einer Physik-Ebene im TileSet-Ressourceninspektor (innerhalb des TileMap-Nodes)
zh_cn: 在 TileSet 资源检查器（TileMap 节点内）中创建物理层
zh_tw: 在 TileSet 資源屬性面板（TileMap 節點內）中建立實體層

source: If you also need navigation support, now is a good time to create a navigation layer:
de: Wenn Sie auch Navigationsunterstützung benötigen, ist jetzt ein guter Zeitpunkt, um eine Navigationsebene zu erstellen:
zh_cn: 如果你还需要导航辅助，可以创建导航层：
zh_tw: 如果你還需要導覽輔助，可以建立導覽層：

source: Creating a navigation layer in the TileSet resource inspector (within the TileMap node)
de: Erstellen einer Navigationsebene im TileSet-Ressourceninspektor (innerhalb des TileMap-Nodes)
zh_cn: 在 TileSet 资源检查器（TileMap 节点内）中创建导航层
zh_tw: 在 TileSet 資源屬性面板（TileMap 節點內）中建立導覽層

source: If you need support for light polygon occluders, now is a good time to create an occlusion layer:
de: Wenn Sie Unterstützung für Licht-Polygon-Occluder benötigen, ist jetzt ein guter Zeitpunkt, um eine Okklusionsebene zu erstellen:
zh_cn: 如果你需要支持光照多边形遮挡器，可以创建遮挡层：
zh_tw: 如果你需要支援光照多邊形遮擋器，可以建立遮擋層：

source: Creating an occlusion layer in the TileSet resource inspector (within the TileMap node)
de: Erstellen einer Occlusion-Ebene im TileSet-Ressourceninspektor (innerhalb des TileMap-Nodes)
zh_cn: 在 TileSet 资源检查器（TileMap 节点内）中创建遮挡层
zh_tw: 在 TileSet 資源屬性面板（TileMap 節點內）中建立遮擋層

source: Future steps in this tutorial are tailored to creating collision polygons, but the procedure for navigation and occlusion is very similar. Their respective polygon editors behave in the same way, so these steps are not repeated for brevity.
de: Die weiteren Schritte in diesem Tutorial sind auf die Erstellung von Kollisionspolygonen zugeschnitten, aber das Verfahren für Navigation und Occlusion ist sehr ähnlich. Die jeweiligen Polygon-Editoren verhalten sich auf die gleiche Weise, daher werden diese Schritte der Kürze halber nicht wiederholt.
zh_cn: 本教程的后续步骤专门用于创建碰撞多边形，但导航和遮挡的步骤非常相似。它们各自的多边形编辑器行为方式相同，因此为简洁起见不再重复这些步骤。
zh_tw: 本教學的後續步驟專門用於建立碰撞多邊形，但導覽和遮擋的步驟非常相似。它們各自的多邊形編輯器行為方式相同，因此為簡潔起見不再重複這些步驟。

source: The only caveat is that the tile's occlusion polygon property is part of a **Rendering** subsection in the atlas inspector. Make sure to unfold this section so you can edit the polygon.
de: Die einzige Einschränkung ist, dass die Property des Oclusion-Polygons der Tile Teil eines Unterabschnitts **Rendering** im Atlasinspektor ist. Stellen Sie sicher, dass Sie diesen Abschnitt ausklappen, damit Sie das Polygon bearbeiten können.
zh_cn: 唯一需要注意的是，图块的遮挡多边形属性是图集检查器中 **渲染** 分节的一部分。请确保展开该部分，以便编辑多边形。
zh_tw: 唯一需要注意的是，圖塊的遮擋多邊形屬性是合集屬性面板中 **算繪** 分節的一部分。請確保展開該部分，以便編輯多邊形。

source: After creating a physics layer, you have access to the **Physics Layer** section in the TileSet atlas inspector:
de: Nachdem Sie eine Physikebene erstellt haben, haben Sie Zugriff auf den Abschnitt **Physikebene** im TileSet-Atlasinspektor:
zh_cn: 创建物理层后，你可以访问 TileSet 图集检查器中的 **物理层** 部分：
zh_tw: 建立實體層後，你可以存取 TileSet 合集屬性面板中的 **實體層** 部分：

source: Opening the collision editor while in Select mode
de: Öffnen des Kollisionseditors aus dem Auswahlmodus heraus
zh_cn: 在选择模式下打开碰撞编辑器
zh_tw: 在選擇模式下打開碰撞編輯器

source: You can quickly create a rectangle collision shape by pressing :kbd:`F` while the TileSet editor is focused. If the keyboard shortcut doesn't work, try clicking in the empty area around the polygon editor to focus it:
de: Sie können schnell eine rechteckige Kollisions-Shape erstellen, indem Sie :kbd:`F` drücken, während der TileSet-Editor fokussiert ist. Wenn das Tastenkürzel nicht funktioniert, versuchen Sie, in den leeren Bereich um den Polygon-Editor zu klicken, um ihn zu fokussieren:
zh_cn: 你可以在聚焦 TileSet 编辑器时按 :kbd:`F` 快速创建矩形碰撞形状。如果键盘快捷键不起作用，请尝试单击多边形编辑器周围的空白区域使其聚焦：
zh_tw: 你可以在聚焦 TileSet 編輯器時按 :kbd:`F` 快速建立矩形碰撞形狀。如果鍵盤快捷鍵不起作用，請嘗試按一下多邊形編輯器周圍的空白區域使其聚焦：

source: Using default rectangle collision shape by pressing :kbd:`F`
de: Verwendung der Standard-Rechteck-Kollisionsform durch Drücken von :kbd:`F`
zh_cn: 按 :kbd:`F` 键使用默认矩形碰撞形状
zh_tw: 按 :kbd:`F` 鍵使用預設矩形碰撞形狀

source: In this tile collision editor, you have access to all the 2D polygon editing tools:
de: In diesem Tile-Kollisions-Editor haben Sie Zugriff auf alle 2D-Polygon-Bearbeitungstools:
zh_cn: 在这个图块碰撞编辑器中，你可以使用所有二维多边形编辑工具：
zh_tw: 在這個圖塊碰撞編輯器中，你可以使用所有二維多邊形編輯工具：

source: Use the toolbar above the polygon to toggle between creating a new polygon, editing an existing polygon and removing points on the polygon. The "three vertical dots" menu button offers additional options, such as rotating and flipping the polygon.
de: Mit der Toolbar oberhalb des Polygons können Sie zwischen der Erstellung eines neuen Polygons, der Bearbeitung eines vorhandenen Polygons und dem Entfernen von Punkten auf dem Polygon umschalten. Der Button mit den "drei vertikalen Punkten" bietet zusätzliche Optionen, wie das Drehen und Spiegeln des Polygons.
zh_cn: 使用多边形上方的工具栏可在创建新多边形、编辑现有多边形和删除多边形上的点之间切换。“三个竖点”菜单按钮提供了其他选项，例如旋转和翻转多边形。
zh_tw: 使用多邊形上方的工具列可在建立新多邊形、編輯現有多邊形和刪除多邊形上的點之間切換。“三個豎點”功能表按鈕提供了其他選項，例如旋轉和翻轉多邊形。

source: Create new points by clicking and dragging a line between two points.
de: Erstellen Sie neue Punkte, indem Sie auf eine Linie zwischen zwei Punkten klicken und diese ziehen.
zh_cn: 通过单击并拖动两点之间的直线来创建新点。
zh_tw: 通過按一下並拖動兩點之間的直線來建立新點。

source: Remove a point by right-clicking it (or using the Remove tool described above and left-clicking).
de: Entfernen Sie einen Punkt, indem Sie ihn mit der rechten Maustaste anklicken (oder das oben beschriebene Tool "Entfernen" verwenden und mit der linken Maustaste klicken).
zh_cn: 右键单击一个点（或使用上述移除工具并左键单击）将其移除。
zh_tw: 按右鍵一個點（或使用上述移除工具並左鍵按一下）將其移除。

source: Pan in the editor by middle-clicking or right-clicking. (Right-click panning can only be used in areas where there is no point nearby.)
de: Schwenken Sie im Editor mit der mittleren Maustaste oder der rechten Maustaste. (Das Schwenken mit der rechten Maustaste kann nur in Bereichen verwendet werden, in denen sich kein Punkt in der Nähe befindet).
zh_cn: 通过中键或右键在编辑器中平移。(右键平移只能用于附近没有点的区域）
zh_tw: 通過中鍵或右鍵在編輯器中平移。(右鍵平移只能用於附近沒有點的區域）

source: You can use the default rectangle shape to quickly create a triangle-shaped collision shape by removing one of the points:
de: Sie können die Default-Rechteck-Shape verwenden, um schnell eine dreieckige Kollisions-Shape zu erstellen, indem Sie einen der Punkte entfernen:
zh_cn: 你可以使用默认的矩形形状，通过移除其中一个点来快速创建三角形碰撞形状：
zh_tw: 你可以使用預設的矩形形狀，通過移除其中一個點來快速建立三角形碰撞形狀：

source: Creating a triangle collision shape by right-clicking one of the corners to remove it
de: Erstellen einer dreieckigen Kollisions-Shape durch Rechtsklick auf eine der Ecken, um sie zu entfernen
zh_cn: 通过右键单击其中一个角将其移除来创建三角形碰撞形状
zh_tw: 通過按右鍵其中一個角將其移除來建立三角形碰撞形狀

source: You can also use the rectangle as a base for more complex shapes by adding more points:
de: Sie können das Rechteck auch als Basis für komplexere Formen verwenden, indem Sie weitere Punkte hinzufügen:
zh_cn: 你还可以通过添加更多点，将矩形用作更复杂形状的基础：
zh_tw: 你還可以通過新增更多點，將矩形用作更複雜形狀的基礎：

source: Drawing a custom collision for a complex tile shape
de: Zeichnen einer benutzerdefinierten Kollision für eine komplexe Tile-Shape
zh_cn: 为复杂图块形状绘制自定义碰撞
zh_tw: 為複雜圖塊形狀繪製自訂碰撞

source: If you have a large tileset, specifying the collision for each tile individually could take a lot of time. This is especially true as TileMaps tend to have many tiles with common collision patterns (such as solid blocks or 45-degree slopes). To apply a similar collision shape to several tiles quickly, use functionality to :ref:`assign properties to multiple tiles at once <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
de: Wenn Sie ein großes Tileset haben, kann die Angabe der Kollision für jede einzelne Tile viel Zeit in Anspruch nehmen. Dies gilt insbesondere, da TileMaps dazu neigen, viele Tiles mit gemeinsamen Kollisionsmustern zu haben (z. B. massive Blöcke oder 45-Grad-Schrägen). Um eine ähnliche Kollisions-Shape schnell auf mehrere Tiles anzuwenden, verwenden Sie die Funktion :ref:`Propertys mehreren Tiles auf einmal zuweisen <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
zh_cn: 如果你有一个大的图块集，为每个图块单独指定碰撞可能会花费很多时间。尤其是在 TileMaps 中往往有许多具有常见碰撞模式（如实心块或 45 度斜坡）的图块。要快速将类似的碰撞形状应用到多个图块，请使用\ :ref:`一次为多个图块指定属性 <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`\ 的功能。
zh_tw: 如果你有一個大的圖塊集，為每個圖塊單獨指定碰撞可能會花費很多時間。尤其是在 TileMaps 中往往有許多具有常見碰撞模式（如實心塊或 45 度斜坡）的圖塊。要快速將類似的碰撞形狀應用到多個圖塊，請使用 :ref:` 一次為多個圖塊指定屬性 <doc_using_tilemaps_assigning_properties_to_multiple_tiles>` 的功能。

source: Assigning custom metadata to the TileSet's tiles
de: Zuweisung von benutzerdefinierten Metadaten zu den Tiles des TileSet
zh_cn: 为 TileSet 的图块分配自定义元数据
zh_tw: 為 TileSet 的圖塊分配自訂中繼資料

source: You can assign custom data on a per-tile basis using *custom data layers*. This can be useful to store information specific to your game, such as the damage that a tile should deal when the player touches it, or whether a tile can be destroyed using a weapon.
de: Sie können benutzerdefinierte Daten pro Tile zuweisen, indem Sie *benutzerdefinierte Datenebenen* verwenden. Dies kann nützlich sein, um spielspezifische Informationen zu speichern, z. B. den Schaden, den eine Tile verursachen soll, wenn der Spieler sie berührt, oder ob eine Tile mit einer Waffe zerstört werden kann.
zh_cn: 你可以使用\ *自定义数据层*\ 来为各个图块分配自定义数据。可以用来存储游戏过程中所需的特定信息，例如玩家接触该图块时应该受到的伤害，以及是否能够使用物理将图块摧毁。
zh_tw: 你可以使用*自訂資料層*來為各個圖塊分配自訂資料。可以用來儲存遊戲過程中所需的特定資訊，例如玩家接觸該圖塊時應該受到的傷害，以及是否能夠使用物理將圖塊摧毀。

source: The data is associated with the tile in the TileSet: all instances of the placed tile will use the same custom data. If you need to create a variant of a tile that has different custom data, this can be done by :ref:`creating an alternative tile <doc_using_tilesets_creating_alternative_tiles>` and changing the custom data for the alternative tile only.
de: Die Daten sind mit der Tile im TileSet verbunden: alle Instanzen der platzierten Tile verwenden dieselben benutzerdefinierten Daten. Wenn Sie eine Variante einer Tile mit anderen benutzerdefinierten Daten erstellen müssen, können Sie dies tun, indem Sie :ref:`eine alternative Tile erstellen <doc_using_tilesets_creating_alternative_tiles>` und die benutzerdefinierten Daten nur für die alternative Tile ändern.
zh_cn: 数据是在 TileSet 中与图块进行关联的：放置的所有图块使用的都是相同的自定义数据。如果你需要创建拥有不同自定义数据的变体图块，可以通过\ :ref:`创建备选图块 <doc_using_tilesets_creating_alternative_tiles>`\ 并为该备选图块更改自定义数据来实现。
zh_tw: 資料是在 TileSet 中與圖塊進行關聯的：放置的所有圖塊使用的都是相同的自訂資料。如果你需要建立擁有不同自訂資料的變體圖塊，可以通過:ref:`建立備選圖塊 <doc_using_tilesets_creating_alternative_tiles>`並為該備選圖塊更改自訂資料來實作。

source: Creating a custom data layer in the TileSet resource inspector (within the TileMap node)
de: Erstellen einer benutzerdefinierten Datenebene im TileSet-Ressourceninspektor (innerhalb des TileMap-Nodes)
zh_cn: 在（TileMap 节点的）TileSet 资源检查器中创建自定义数据层
zh_tw: 在（TileMap 節點的）TileSet 資源屬性面板中建立自訂資料層

source: Example of configured custom data layers with game-specific properties
de: Beispiel für konfigurierte benutzerdefinierte Datenebenen mit spielspezifischen Propertys
zh_cn: 针对游戏中的特定属性配置自定义数据层的示例
zh_tw: 針對遊戲中的特定屬性配置自訂資料層的範例

source: You can reorder custom data without breaking existing metadata: the TileSet editor will update automatically after reordering custom data properties.
de: Sie können benutzerdefinierte Daten neu anordnen, ohne bestehende Metadaten zu zerstören: Der TileSet-Editor wird automatisch aktualisiert, nachdem benutzerdefinierte Daten-Propertys neu angeordnet wurden.
zh_cn: 改变自定义数据的顺序不会损坏现有的元数据：TileSet 编辑器会在自定义数据属性的顺序发生改变后自动进行更新。
zh_tw: 改變自訂資料的順序不會損壞現有的中繼資料：TileSet 編輯器會在自訂資料屬性的順序發生改變後自動進行更新。

source: Note that in the editor, property names do not appear (only their index, which matches the order in which they are defined). For example, with the custom data layers example shown above, we're assigning a tile to have the ``damage_per_second`` metadata set to ``25`` and the ``destructible`` metadata to ``false``:
de: Beachten Sie, dass im Editor die Namen der Propertys nicht erscheinen (nur ihr Index, in der Reihenfolge, in der sie definiert sind). In dem oben gezeigten Beispiel für benutzerdefinierte Datenebenen weisen wir einer Tile die Metadaten ``damage_per_second`` auf ``25`` und ``destructible`` auf ``false`` zu:
zh_cn: 请注意，属性的名称不会出现在编辑器中（只会显示索引号，与定义顺序一致）。例如，假设存在上面例子中的自定义数据层，那么将图块的 ``damage_per_second`` 元数据设置为 ``25``\ 、将 ``destructible`` 元数据设置为 ``false`` 就是这样的：
zh_tw: 請注意，屬性的名稱不會出現在編輯器中（只會顯示索引號，與定義順序一致）。例如，假設存在上面例子中的自訂資料層，那麼將圖塊的 ``damage_per_second`` 中繼資料設定為 ``25``、將 ``destructible`` 中繼資料設定為 ``false`` 就是這樣的：

source: Editing custom data in the TileSet editor while in Select mode
de: Bearbeiten von benutzerdefinierten Daten im TileSet-Editor aus dem Auswahlmodus heraus
zh_cn: TileSet 编辑器的“选择”模式下编辑自定义数据
zh_tw: TileSet 編輯器的“選擇”模式下編輯自訂資料

source: :ref:`Tile property painting <doc_using_tilemaps_using_tile_property_painting>` can also be used for custom data:
de: :ref:`Malen von Tile-Propertys <doc_using_tilemaps_using_tile_property_painting>` kann auch für eigene Daten verwendet werden:
zh_cn: 自定义数据也可以进行\ :ref:`图块属性的绘制 <doc_using_tilemaps_using_tile_property_painting>`\ ：
zh_tw: 自訂資料也可以進行:ref:`圖塊屬性的繪製 <doc_using_tilemaps_using_tile_property_painting>`：

source: Assigning custom data in the TileSet editor using tile property painting
de: Zuweisen von benutzerdefinierten Daten im TileSet-Editor mithilfe von Tile-Property-Malen
zh_cn: 在 TileSet 编辑器中使用图块属性绘制来分配自定义数据
zh_tw: 在 TileSet 編輯器中使用圖塊屬性繪製來分配自訂資料

source: Creating terrain sets (autotiling)
de: Erstellen von Geländesätzen (Autotiling)
zh_cn: 创建地形集（自动图块）
zh_tw: 建立內容
