Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: de, zh_cn, zh_tw

source: This functionality was implemented in a different form as *autotiling* in Godot 3.x. Terrains are essentially a more powerful replacement of autotiles. Unlike autotiles, terrains can support transitions from one terrain to another, as a tile may define several terrains at once.
de: Diese Funktionalität wurde in Godot 3.x in einer anderen Form als *Autotiling* implementiert. Terrains sind im Wesentlichen ein leistungsfähigerer Ersatz für Autotiles. Im Gegensatz zu Autotiles können Terrains Übergänge von einem Terrain zu einem anderen unterstützen, da eine Tile mehrere Terrains auf einmal definieren kann.
zh_cn: 这个功能和 Godot 3.x 中的\ *自动图块*\ 使用了不同的实现方式。地形系统能够完全替代自动图块，功能也更强大。与自动图块不同，地形系统支持不同地形之间的过渡，这样就可以为同一个图定义多个地形。
zh_tw: 這個功能和 Godot 3.x 中的*自動圖塊*使用了不同的實作方式。地形系統能夠完全替代自動圖塊，功能也更強大。與自動圖塊不同，地形系統支援不同地形之間的過渡，這樣就可以為同一個圖定義多個地形。

source: Unlike before, where autotiles were a specific kind of tiles, terrains are only a set of properties assigned to atlas tiles. These properties are then used by a dedicated TileMap painting mode that selects tiles featuring terrain data in a smart way. This means any terrain tile can be either painted as terrain or as a single tile, like any other.
de: Im Gegensatz zu früher, wo Autotiles eine spezielle Art von Tiles waren, sind Terrains nur eine Reihe von Propertys, die Atlas-Tiles zugeordnet sind. Diese Propertys werden dann von einem speziellen TileMap-Malmodus verwendet, der Tiles mit Terrain-Daten auf intelligente Weise auswählt. Das bedeutet, dass jede Terrain-Tile entweder als Terrain oder als einzelne Tile gemalt werden kann, wie jede andere auch.
zh_cn: 与以前不同的是，自动图块是一种特定类型的图块，而地形只是分配给图集图块的一组属性。使用专门的 TileMap 绘制模式时就会用到这些属性，该模式能够对带有地形数据的图块进行智能选择。这意味着地形图块既可以作为地形绘制，也可以像其他图块一样作为单个图块绘制。
zh_tw: 與以前不同的是，自動圖塊是一種特定型別的圖塊，而地形只是分配給合集圖塊的一組屬性。使用專門的 TileMap 繪製模式時就會用到這些屬性，該模式能夠對帶有地形資料的圖塊進行智慧選擇。這意味著地形圖塊既可以作為地形繪製，也可以像其他圖塊一樣作為單個圖塊繪製。

source: A "polished" tileset generally features variations that you should use on corners or edges of platforms, floors, etc. While these can be placed manually, this quickly becomes tedious. Handling this situation with procedurally generated levels can also be difficult and require a lot of code.
de: Ein "poliertes" Tileset enthält im Allgemeinen Variationen, die Sie an Ecken oder Kanten von Plattformen, Böden usw. verwenden sollten. Diese können zwar manuell platziert werden, aber das wird schnell mühsam. Die Handhabung dieser Situation mit prozedural generierten Levels kann ebenfalls schwierig sein und eine Menge Code erfordern.
zh_cn: “完善”的图块集中通常会包含很多变体图块，适用于平台、地板等位置的角落和边缘。这种图块虽然可以手动放置，但是很快就会感觉非常麻烦。在程序式生成的关卡中如果要处理这种情况也很困难，需要编写大量的代码。
zh_tw: “完善”的圖塊集中通常會包含很多變體圖塊，適用於平臺、地板等位置的角落和邊緣。這種圖塊雖然可以手動放置，但是很快就會感覺非常麻煩。在程式式生成的關卡中如果要處理這種情況也很困難，需要編寫大量的程式碼。

source: Godot offers *terrains* to perform this kind of tile connections automatically. This allows you to have the "correct" tile variants automatically used.
de: Godot bietet *Terrains*, um diese Art von Tile-Verbindungen automatisch durchzuführen. So können Sie automatisch die "richtigen" Tile-Varianten verwenden.
zh_cn: Godot 提供的\ *地形*\ 系统就能够自动进行图块的连接。这样就可以自动使用“正确”的图块变体。
zh_tw: Godot 提供的*地形*系統就能夠自動進行圖塊的連接。這樣就可以自動使用“正確”的圖塊變體。

source: Terrains are grouped into terrain sets. Each terrain set is assigned a mode from **Match Corners and Sides**, **Match Corners** and **Match sides**. They define how terrains are matched to each other in a terrain set.
de: Terrains werden in Terrainsets gruppiert. Jedem Terrainset ist ein Modus aus **Ecken und Seiten anpassen**, **Ecken anpassen** und **Seiten anpassen** zugeordnet. Sie legen fest, wie Terrains in einem Terrainset aneinander angepasst werden.
zh_cn: 地形按照地形集分组。地形集有固定的模式，包括 **Match Corners and Sides**\ 、\ **Match Corners**\ 、\ **Match sides**\ （匹配角落和边缘、匹配角落、匹配边缘）。模式决定了地形集中的地形如何相互匹配。
zh_tw: 地形按照地形集群組。地形集有固定的模式，包括 **Match Corners and Sides**、**Match Corners**、**Match sides**（配對角落和邊緣、配對角落、配對邊緣）。模式決定了地形集中的地形如何相互配對。

source: The above modes correspond to the previous bitmask modes autotiles used in Godot 3.x: 2×2, 3×3 or 3×3 minimal. This is also similar to what the `Tiled <https://www.mapeditor.org/>`__ editor features.
de: Die oben genannten Modi entsprechen den früheren Bitmasken-Modi, die in Godot 3.x verwendet wurden: 2×2, 3×3 oder 3×3 minimal. Dies entspricht auch den Funktionen des `Tiled <https://www.mapeditor.org/>`__-Editors.
zh_cn: 上述模式在 Godot 3.x 中对应的自动图块位掩码模式为 2×2、3×3、3×3 Minimal。也和 `Tiled <https://www.mapeditor.org/>`__ 编辑器中使用的模式类似。
zh_tw: 上述模式在 Godot 3.x 中對應的自動圖塊位元遮罩模式為 2×2、3×3、3×3 Minimal。也和 `Tiled <https://www.mapeditor.org/>`__ 編輯器中使用的模式類似。

source: Select the TileMap node, go to the inspector and create a new terrain set within the TileSet *resource*:
de: Wählen Sie den TileMap-Node, gehen Sie zum Inspektor und erstellen Sie ein neues Terrain-Set innerhalb der TileSet-*Ressource*:
zh_cn: 选中 TileMap 节点，在检查器的 TileSet *资源*\ 中创建一个新的地形集：
zh_tw: 選中 TileMap 節點，在屬性面板的 TileSet *資源*中建立一個新的地形集：

source: Creating a terrain set in the TileSet resource inspector (within the TileMap node)
de: Erstellen eines Terrainsets im TileSet-Ressourceninspektor (innerhalb des TileMap-Nodes)
zh_cn: 在（TileMap 节点的）TileSet 资源检查器中创建地形集
zh_tw: 在（TileMap 節點的）TileSet 資源屬性面板中建立地形集

source: After creating a terrain set, you **must** create one or more terrains *within* the terrain set:
de: Nach der Erstellung eines Terrainsets **müssen** Sie ein oder mehrere Terrains *innerhalb* des Terrainsets erstellen:
zh_cn: 创建地形集后，你\ **必须**\ 在地形集\ *中*\ 再创建若干地形：
zh_tw: 建立地形集後，你**必須**在地形集*中*再建立若干地形：

source: Creating a terrain within the terrain set
de: Erstellen eines Terrains innerhalb des Terrainsets
zh_cn: 在地形集中创建地形
zh_tw: 產生金鑰儲存區

source: In the TileSet editor, switch to Select mode and click a tile. In the middle column, unfold the **Terrains** section then assign a terrain set ID and a terrain ID for the tile. ``-1`` means "no terrain set" or "no terrain", which means you must set **Terrain Set** to ``0`` or greater before you can set **Terrain** to ``0`` or greater.
de: Wechseln Sie im TileSet-Editor in den Auswahlmodus und klicken Sie auf eine Tile. Klappen Sie in der mittleren Spalte den Abschnitt **Terrains** aus und weisen Sie der Tile eine Terrain Set-ID und eine Terrain-ID zu. ``-1`` bedeutet "kein Geländeset" oder "kein Gelände", was bedeutet, dass Sie **Geländeset** auf ``0`` oder höher setzen müssen, bevor Sie **Gelände** auf ``0`` oder höher setzen können.
zh_cn: 在 TileSet 编辑器中，切换到“选择”模式并单击图块。在中间一栏展开\ **地形**\ 部分，为图块分配地形集 ID 和地形 ID。\ ``-1`` 表示“没有地形集”和“没有地形”，因此你必须先将\ **地形集**\ 设置为大于等于 ``0`` 的值，然后才能将\ **地形**\ 设置为大于 ``0`` 的值。
zh_tw: 在 TileSet 編輯器中，切換到“選擇”模式並按一下圖塊。在中間一欄展開**地形**部分，為圖塊分配地形集 ID 和地形 ID。``-1`` 表示“沒有地形集”和“沒有地形”，因此你必須先將**地形集**設定為大於等於 ``0`` 的值，然後才能將**地形**設定為大於 ``0`` 的值。

source: Terrain set IDs and terrain IDs are independent from each other. They also start from ``0``, not ``1``.
de: Terrain Set IDs und Terrain IDs sind unabhängig voneinander. Sie beginnen auch bei ``0``, nicht bei ``1``.
zh_cn: 地形集 ID 和地形 ID 互相独立。从 ``0`` 开始，不从 ``1`` 开始。
zh_tw: 地形集 ID 和地形 ID 互相獨立。從 ``0`` 開始，不從 ``1`` 開始。

source: Configuring terrain on a single tile in the TileSet editor's Select mode
de: Konfigurieren des Terrains auf einer einzelnen Tile im Auswahlmodus des TileSet-Editors
zh_cn: 在 TileSet 编辑器的“选择”模式中配置单个图块的地形
zh_tw: 在 TileSet 編輯器的“選擇”模式中配置單個圖塊的地形

source: After doing so, you can now configure the **Terrain Peering Bits** section which becomes visible in the middle column. The peering bits determine which tile will be placed depending on neighboring tiles. ``-1`` is a special value which refers to empty space.
de: Danach können Sie nun den Abschnitt **Terrain-Peering-Bits** konfigurieren, der in der mittleren Spalte sichtbar wird. Die Peering Bits bestimmen, welche Tiles in Abhängigkeit von benachbarten Tiles platziert werden. ``-1`` ist ein besonderer Wert, der sich auf leeren Raum bezieht.
zh_cn: 完成此操作后，你现在可以配置 **地形对等位** 部分，该部分在中间一列中可见。对等位决定了根据相邻图块的情况放置哪个图块。“-1”是一个特殊值，指的是空位。
zh_tw: 完成此操作後，你現在可以配置 **地形對等位元** 部分，該部分在中間一列中可見。對等位元決定了根據相鄰圖塊的情況放置哪個圖塊。“-1”是一個特殊值，指的是空位。

source: For example, if a tile has all its bits set to ``0`` or greater, it will only appear if *all* 8 neighboring tiles are using a tile with the same terrain ID. If a tile has its bits set to ``0`` or greater, but the top-left, top and top-right bits are set to ``-1``, it will only appear if there is empty space on top of it (including diagonally).
de: Wenn zum Beispiel alle Bits einer Tile auf ``0`` oder höher gesetzt sind, erscheint sie nur, wenn *alle* 8 benachbarten Tiles eine Tile mit der gleichen Terrain ID benutzen. Wenn eine Tile ihre Bits auf ``0`` oder größer gesetzt hat, aber die Bits oben links, oben und oben rechts auf ``-1`` gesetzt sind, wird sie nur erscheinen, wenn es einen leeren Platz über ihr gibt (auch diagonal).
zh_cn: 例如，如果一个地砖的所有位都设置为 ``0`` 或更大，那么只有在 *所有* 8个相邻图块都使用具有相同地形 ID 的图块时，它才会出现。如果图块的位设置为“0”或更大，但左上、上和右上的位设置为“-1”，则只有在其顶部（包括对角线）有空位时才会出现。
zh_tw: 例如，如果一個地磚的所有位都設定為 ``0`` 或更大，那麼只有在 *所有* 8個相鄰圖塊都使用具有相同地形 ID 的圖塊時，它才會出現。如果圖塊的位設定為“0”或更大，但左上、上和右上的位設定為“-1”，則只有在其頂部（包括對角線）有空位時才會出現。

source: Configuring terrain peering bits on a single tile in the TileSet editor's Select mode
de: Konfigurieren von Terrain-Peering-Bits auf einer einzelnen Tile im Select-Modus des TileSet-Editors
zh_cn: 在图块集编辑器的选择模式下配置单个图块上的地形对等位
zh_tw: 在圖塊集編輯器的選擇模式下配置單個圖塊上的地形對等位

source: An example configuration for a full tilesheet may look as follows:
de: Eine Beispielkonfiguration für ein komplettes Tilesheet könnte wie folgt aussehen:
zh_cn: 完整图块表的配置示例如下：
zh_tw: 完整圖塊表的配置範例如下：

source: Example full tilesheet for a sidescrolling game
de: Beispiel für ein vollständiges Tilesheet für ein Sidescroller-Spiel
zh_cn: 横向卷轴游戏的完整图块表示例
zh_tw: 橫向磁碟區軸遊戲的完整圖塊表範例

source: Example full tilesheet for a sidescrolling game with terrain peering bits visible
de: Beispiel für ein vollständiges Tilesheet für ein Sidescroller-Spiel mit sichtbaren Terrain-Peering-Bits
zh_cn: 一个横向卷轴的完整图块表示例，带可见地形对等位
zh_tw: 一個橫向磁碟區軸的完整圖塊表範例，帶可見地形對等位

source: Assigning properties to multiple tiles at once
de: Zuweisung von Propertys zu mehreren Kacheln auf einmal
zh_cn: 一次为多个图块指定属性
zh_tw: 一次為多個圖塊指定屬性

source: There are two ways to assign properties to multiple tiles at once. Depending on your use cases, one method may be faster than the other:
de: Es gibt zwei Möglichkeiten, mehreren Tiles gleichzeitig Propertys zuzuweisen. Je nach Anwendungsfall kann die eine Methode schneller sein als die andere:
zh_cn: 有两种方法可以同时为多个图块分配属性。根据你的使用情况，一种方法可能比另一种方法更快：
zh_tw: 有兩種方法可以同時為多個圖塊分配屬性。根據你的使用情況，一種方法可能比另一種方法更快：

source: Using multiple tile selection
de: Mehrfachauswahl von Tiles verwenden
zh_cn: 使用多个图块选择
zh_tw: 使用多個圖塊選擇

source: If you wish to configure various properties on several times at once, choose the **Select** mode at the top of the TileSet editor:
de: Wenn Sie verschiedene Propertys für mehrere Tiles gleichzeitig konfigurieren möchten, wählen Sie den Modus **Auswählen** oben im TileSet-Editor:
zh_cn: 如果希望一次配置多种属性，请选择 TileSet 编辑器顶部的 **选择** 模式：
zh_tw: 如果希望一次配置多種屬性，請選擇 TileSet 編輯器頂部的 **選擇** 模式：

source: After doing this, you can select multiple tiles on the right column by holding :kbd:`Shift` then clicking on tiles. You can also perform rectangle selection by holding down the left mouse button then dragging the mouse. Lastly, you can deselect tiles that were already selected (without affecting the rest of the selection) by holding :kbd:`Shift` then clicking on a selected tile.
de: Danach können Sie mehrere Tiles in der rechten Spalte auswählen, indem Sie :kbd:`Shift` gedrückt halten und dann auf die Tiles klicken. Sie können auch ein Rechteck auswählen, indem Sie die linke Maustaste gedrückt halten und die Maus ziehen. Schließlich können Sie bereits ausgewählte Tiles wieder abwählen (ohne den Rest der Auswahl zu beeinflussen), indem Sie :kbd:`Umschalt` gedrückt halten und dann auf ein ausgewähltes Tile klicken.
zh_cn: 完成此操作后，你可以按住 :kbd:`Shift` 键，然后单击图块，在右侧栏中选择多个图块。你还可以按住鼠标左键然后拖动鼠标来执行矩形选择。最后，你可以按住 :kbd:`Shift` 然后单击选定的图块，取消选择已选中的图块（不会影响选择的其他部分）。
zh_tw: 完成此操作後，你可以按住 :kbd:`Shift` 鍵，然後按一下圖塊，在右側欄中選擇多個圖塊。你還可以按住滑鼠左鍵然後拖動滑鼠來執行矩形選擇。最後，你可以按住 :kbd:`Shift` 然後按一下選定的圖塊，取消選擇已選中的圖塊（不會影響選擇的其他部分）。

source: You can then assign properties using the inspector in the middle column of the TileSet editor. Only properties that you change here will be applied to all selected tiles. Like in the editor's inspector, properties that differ on selected tiles will remain different until you edit them.
de: Sie können dann mit dem Inspektor in der mittleren Spalte des TileSet-Editors Propertys zuweisen. Nur Propertys, die Sie hier ändern, werden auf alle ausgewählten Tiles angewendet. Wie im Inspektor des Editors bleiben Propertys, die sich bei ausgewählten Tiles unterscheiden, unterschiedlich, bis Sie sie bearbeiten.
zh_cn: 然后，你可以使用 TileSet 编辑器中间一列的检查器分配属性。只有在此更改的属性才会应用到所有选定的图块。与编辑器的检查器一样，在你编辑之前，所选图块上的不同属性将保持不同。
zh_tw: 然後，你可以使用 TileSet 編輯器中間一列的屬性面板分配屬性。只有在此更改的屬性才會應用到所有選定的圖塊。與編輯器的屬性面板一樣，在你編輯之前，所選圖塊上的不同屬性將保持不同。

source: With numerical and color properties, you will also see a preview of the property's value on all tiles in the atlas after editing a property:
de: Bei numerischen und farblichen Eigenschaften sehen Sie nach der Bearbeitung einer Property auch eine Vorschau des Werts der Property auf allen Tiles im Atlas:
zh_cn: 对于数值和颜色属性，编辑完成后还能在图集中的所有图块上看到属性值的预览：
zh_tw: 對於數值和顏色屬性，編輯完成後還能在合集中的所有圖塊上看到屬性值的預覽：

source: Selecting multiple tiles using the Select mode, then applying properties
de: Auswählen mehrerer Tiles im Auswahlmodus und anschließendes Anwenden von Propertys
zh_cn: 使用选择模式选择多个图块，然后应用属性
zh_tw: 使用選擇模式選擇多個圖塊，然後應用屬性

source: Using tile property painting
de: Verwenden von Tile-Property-Malen
zh_cn: 使用图块属性绘制
zh_tw: 使用匯出樣板

source: If you wish to apply a single property to several tiles at once, you can use the *property painting* mode for this purpose.
de: Wenn Sie eine einzelne Property auf mehrere Tiles gleichzeitig anwenden möchten, können Sie dazu den Modus *Property-Malen* verwenden.
zh_cn: 如果要一次将单个属性应用于多个图块，则可以使用*属性绘制*模式来实现此目的。
zh_tw: 如果要一次將單個屬性應用於多個圖塊，則可以使用*屬性繪製*模式來實作此目的。

source: Configure a property to be painted in the middle column, then click on tiles (or hold down the left mouse button) in the right column to "paint" properties onto tiles.
de: Konfigurieren Sie in der mittleren Spalte eine Property, die gezeichnet werden soll, und klicken Sie dann in der rechten Spalte auf Tiles (oder halten Sie die linke Maustaste gedrückt), um Propertys auf Tiles zu "malen".
zh_cn: 在中间一列配置要绘制的属性，然后点击右列中的图块（或按住鼠标左键）以将属性“绘制”到图块上。
zh_tw: 在中間一列配置要繪製的屬性，然後點擊右列中的圖塊（或按住滑鼠左鍵）以將屬性“繪製”到圖塊上。

source: Painting tile properties using the TileSet editor
de: Malen von Tile Propertys mit dem TileSet-Editor
zh_cn: 在文本编辑器中编辑文本
zh_tw: 在編輯器中執行腳本。

source: Tile property painting is especially useful with properties that are time-consuming to set manually, such as collision shapes:
de: Das Malen von Tile-Propertys ist besonders nützlich bei Propertys, deren manuelle Einstellung zeitaufwändig ist, wie z. B. bei Kollisions-Shapes:
zh_cn: 对于手动设置耗时的属性（例如碰撞形状），图块属性绘制特别有用：
zh_tw: 對於手動設定耗時的屬性（例如碰撞形狀），圖塊屬性繪製特別有用：

source: Painting a collision polygon, then left-clicking tiles to apply it
de: Malen eines Kollisionspolygons und anschließendes Klicken mit der linken Maustaste auf Tiles, um es anzuwenden
zh_cn: 绘制碰撞多边形，然后左键单击图块以应用它
zh_tw: 繪製碰撞多邊形，然後左鍵按一下圖塊以應用它

source: Creating alternative tiles
de: Alternative Kacheln erstellen
zh_cn: 创建备选图块
zh_tw: 建立內容

source: Sometimes, you want to use a single tile image (found only once within the atlas), but configured in different ways. For example, you may want to use the same tile image, but rotated, flipped, or modulated with a different color. This can be done using *alternative tiles*.
de: Manchmal möchten Sie ein einziges Tile-Bild (das nur einmal im Atlas vorkommt) verwenden, das aber auf unterschiedliche Weise konfiguriert ist. Zum Beispiel können Sie das gleiche Tile-Bild verwenden, aber gedreht, gespiegelt oder mit einer anderen Farbe moduliert. Dies kann mit *alternativen Tiles* geschehen.
zh_cn: 有时，你想使用单一的图块图像（在图集中只能找到一次），但要以不同的方式进行配置。例如，你可能想使用相同的图块图像，但对它进行旋转、翻转或调制成不同的颜色。这就可以使用 *备选图块* 来实现。
zh_tw: 有時，你想使用單一的圖塊圖像（在合集中只能找到一次），但要以不同的方式進行配置。例如，你可能想使用相同的圖塊圖像，但對它進行旋轉、翻轉或調變成不同的顏色。這就可以使用 *備選圖塊* 來實作。

source: Since Godot 4.2, you don't have to create alternative tiles to rotate or flip tiles anymore. You can rotate any tile while placing it in the TileMap editor by using the rotation/flip buttons in the TileMap editor toolbar.
de: Seit Godot 4.2 müssen Sie keine alternativen Tiles mehr erstellen, um Tiles zu drehen oder zu spiegeln. Sie können jede Tile drehen, während Sie sie im TileMap-Editor platzieren, indem Sie die Buttons zum Drehen/Spiegeln in der Toolbar des TileMap-Editors verwenden.
zh_cn: 从 Godot 4.2 开始，你将不再必须通过创建替代图块来旋转或翻转图块。你可以使用 TileMap 编辑器工具栏中的旋转/翻转按钮，在任何图块放置进 TileMap 编辑器中时旋转它。

source: To create an alternative tile, right-click a base tile in the atlas displayed by the TileSet editor, then choose **Create an Alternative Tile**:
de: Um eine alternative Tile zu erstellen, klicken Sie mit der rechten Maustaste auf eine Basis-Tile im Atlas, der vom TileSet-Editor angezeigt wird, und wählen Sie dann **Alternative Tile erstellen**:
zh_cn: 要创建备选图块，请右键单击 TileSet 编辑器显示的图集中的基本图块，然后选择 **创建备选图块**\ ：
zh_tw: 要建立備選圖塊，請按右鍵 TileSet 編輯器顯示的合集中的基本圖塊，然後選擇 **建立備選圖塊**：

source: Creating an alternative tile by right-clicking a base tile in the TileSet editor
de: Erstellen einer alternativen Tile durch Rechtsklick auf eine Basis-Tile im TileSet-Editor
zh_cn: 在 TileSet 编辑器中右键单击基础图块创建备选图块
zh_tw: 在 TileSet 編輯器中按右鍵基礎圖塊建立替代圖塊

source: If currently in Select mode, the alternative tile will already be selected for editing. If not currently in Select mode, you can still create alternative tiles, but you will need to switch to Select mode and select the alternative tile to edit it.
de: Wenn Sie sich im Auswahlmodus befinden, ist die alternative Tile bereits zur Bearbeitung ausgewählt. Wenn Sie sich nicht im Auswahlmodus befinden, können Sie immer noch alternative Tiles erstellen, aber Sie müssen in den Auswahlmodus wechseln und die alternative Tile auswählen, um sie zu bearbeiten.
zh_cn: 如果当前处于“选择”模式，则可编辑已选中的备选图块。如果当前不在“选择”模式下，你仍然可以创建备选图块，但需要切换到“选择”模式并选择备选图块进行编辑。
zh_tw: 如果目前處於“選擇”模式，則可編輯已選中的備選圖塊。如果目前不在“選擇”模式下，你仍然可以建立備選圖塊，但需要切換到“選擇”模式並選擇備選圖塊進行編輯。

source: If you don't see the alternative tile, pan over to the right of the atlas image, as alternative tiles always appear on the right of base tiles of a given atlas in the TileSet editor:
de: Wenn Sie die alternative Tile nicht sehen, schwenken Sie auf die rechte Seite des Atlasbildes, da alternative Tiles im TileSet-Editor immer auf der rechten Seite der Basis-Tiles eines bestimmten Atlas erscheinen:
zh_cn: 如果看不到备选图块，请平移到图集图像的右侧，因为在 TileSet 编辑器中，备选图块总是出现在给定图集基础图块的右侧：
zh_tw: 如果看不到備選圖塊，請平移到合集圖像的右側，因為在 TileSet 編輯器中，備選圖塊總是出現在給定合集基礎圖塊的右側：

source: Configuring an alternative tile after clicking it in the TileSet editor
de: Konfigurieren einer alternativen Tile nach dem Anklicken im TileSet-Editor
zh_cn: 在 TileSet 编辑器中单击备选图块后配置它
zh_tw: 在 TileSet 編輯器中按一下替代圖塊後配置它

source: After selecting an alternative tile, you can change any properties using the middle column like you would on a base tile. However, the list of exposed properties is different compared to base tiles:
de: Nachdem Sie eine alternative Tile ausgewählt haben, können Sie in der mittleren Spalte wie bei einer Basis-Tile alle Propertys ändern. Die Liste der sichtbaren Propertys ist jedoch anders als bei der Basis-Tile:
zh_cn: 选择备选图块后，你可以使用中间一列更改任何属性，就像在基础图块上一样。但暴露的属性列表与基础图块不同：
zh_tw: 選擇備選圖塊後，你可以使用中間一列更改任何屬性，就像在基礎圖塊上一樣。但暴露的屬性列表與基礎圖塊不同：

source: **Alternative ID:** The unique numerical identifier for this alternative tile. Changing it will break existing TileMaps, so be careful! This ID also controls the sorting in the list of alternative tiles displayed in the editor.
de: **Alternative ID:** Der eindeutige numerische Bezeichner für diese alternative Tile. Wenn Sie sie ändern, werden bestehende TileMaps zerstört, seien Sie also vorsichtig! Diese ID steuert auch die Sortierung in der Liste der alternativen Tiles, die im Editor angezeigt wird.
zh_cn: **备用 ID：** 此可选图块的唯一数字标识符。更改它会破坏现有的瓦片地图，所以要小心！此 ID 还控制在编辑器中显示的可选图块列表中的排序。
zh_tw: **備用 ID：** 此可選圖塊的唯一數位識別碼符。更改它會破壞現有的瓦片地圖，所以要小心！此 ID 還控制在編輯器中顯示的可選圖塊列表中的排序。

source: **Rendering > Flip H:** If ``true``, the tile is horizontally flipped.
de: **Rendern > H spiegeln:** Wenn ``true``, wird die Tile horizontal gespiegelt.
zh_cn: **渲染 > 水平翻转：** 如果 ``启用`` ，则图块水平翻转。
zh_tw: **Rendering > Flip H:** 如果為``true``，則圖塊水平翻轉。

source: **Rendering > Flip V:** If ``true``, the tile is vertically flipped.
de: **Rendern > V spiegeln:** Wenn ``true``, wird die Tile horizontal gespiegelt.
zh_cn: **渲染 > 垂直翻转：** 如果 ``启用`` ，则图块垂直翻转。
zh_tw: **Rendering > Flip V:**，如果為``true``，則磁貼垂直翻轉。

source: **Rendering > Transpose:** If ``true``, the tile is rotated 90 degrees *counter-clockwise* and then flipped vertically. In practice, this means that to rotate a tile by 90 degrees clockwise without flipping it, you should enable **Flip H** and **Transpose**. To rotate a tile by 180 degrees clockwise, enable **Flip H** and **Flip V**. To rotate a tile by 270 degrees clockwise, enable **Flip V** and **Transpose**.
de: **Rendern > Transponieren:** Wenn ``true``, wird die Tile um 90 Grad *gegen den Uhrzeigersinn* gedreht und dann vertikal gespiegelt. In der Praxis bedeutet dies, dass Sie **H spiegeln** und **Transponieren** aktivieren sollten, um eine Tile um 90 Grad im Uhrzeigersinn zu drehen, ohne sie zu spiegeln. Um eine Tile um 180 Grad im Uhrzeigersinn zu drehen, aktivieren Sie **H spiegeln** und **V spiegeln**. Um eine Kachel um 270 Grad im Uhrzeigersinn zu drehen, aktivieren Sie **V spiegeln** und **Transponieren**.
zh_cn: **渲染 > 转置：** 如果 ``启用`` ，则图块将 *逆时针* 旋转 90 度，然后再垂直翻转。实际上，这意味着要将图块顺时针旋转 90 度而不翻转它，你应该启用 **水平翻转** 和 **转置** 。要将图块顺时针旋转 180 度，请启用 **水平翻转** 和 **垂直翻转** 。要将图块顺时针旋转 270 度，请启用 **垂直翻转** 和 **转置** 。

source: **Rendering > Texture Origin:** The origin to use for drawing the tile. This can be used to visually offset the tile compared to the base tile.
de: **Rendern > Textur-Ursprung:** Der Ursprung, der für das Zeichnen der Tile verwendet wird. Dies kann verwendet werden, um die Tile im Vergleich zur Basis-Tile visuell zu versetzen.
zh_cn: **渲染 > 纹理原点：**\ 绘制图块时使用的原点。可以用来将图块进行相对于基础图块的视觉偏移。
zh_tw: **Rendering > Texture Origin：**繪製圖塊時使用的原點。可以用來將圖塊進行相對於基礎圖塊的視覺偏移。

source: **Rendering > Modulate:** The color multiplier to use when rendering the tile.
de: **Rendern > Modulieren:** Der Farbmultiplikator, der beim Rendern der Tile verwendet wird.
zh_cn: **渲染 > 调制：**\ 渲染图块时的颜色乘数。
zh_tw: **Rendering > Modulate：**算繪圖塊時的顏色乘數。

source: **Rendering > Material:** The material to use for this tile. This can be used to apply a different blend mode or custom shaders to a single tile.
de: **Rendern > Material:** Das für diese Tile zu verwendende Material. Dies kann verwendet werden, um einen anderen Blending-Modus oder benutzerdefinierte Shader auf eine einzelne Tile anzuwenden.
zh_cn: **渲染 > 材质：** 当前图块使用的材质。可以使用此选项为单个图块应用不同的混合模式或自定义着色器。
zh_tw: **Rendering > Material:** 目前圖塊使用的材質。可以使用此選項為單個圖塊應用不同的混合模式或自訂著色器。

source: **Z Index:** The sorting order for this tile. Higher values will make the tile render in front of others on the same layer.
de: **Z-Index:** Die Sortierreihenfolge für diese Tile. Bei höheren Werten wird die Kachel vor anderen auf derselben Ebene gerendert.
zh_cn: **Z 索引：** 当前图块的排序。数值大的图块会渲染在同一层中的其他图块之上。
zh_tw: **Z Index:** 目前圖塊的排序。數值大的圖塊會算繪在同一層中的其他圖塊之上。
