Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilemaps.po
Languages: de, zh_cn, zh_tw

source: Using TileMaps
de: TileMaps verwenden
zh_cn: 使用 TileMap
zh_tw: 使用圖塊地圖

source: This page assumes you have created or downloaded a TileSet already. If not, please read :ref:`doc_using_tilesets` first as you will need a TileSet to create a TileMap.
de: Diese Seite setzt voraus, dass Sie bereits ein TileSet erstellt oder heruntergeladen haben. Wenn nicht, lesen Sie bitte zuerst :ref:`doc_using_tilesets`, da Sie ein TileSet benötigen, um eine TileMap zu erstellen.
zh_cn: 本页面假设你已经创建或下载了一个图块集。如果没有，请先阅读 :ref:`doc_using_tilesets`，因为创建图块地图需要一个图块集。
zh_tw: 本頁面假設你已經建立或下載了一個圖塊集。如果沒有，請先閱讀 :ref:`doc_using_tilesets`，因為建立圖塊地圖需要一個圖塊集。

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: A tilemap is a grid of tiles used to create a game's layout. There are several benefits to using :ref:`TileMap <class_TileMap>` nodes to design your levels. First, they make it possible to draw the layout by "painting" the tiles onto a grid, which is much faster than placing individual :ref:`Sprite2D <class_Sprite2D>` nodes one by one. Second, they allow for much larger levels because they are optimized for drawing large numbers of tiles. Finally, you can add collision, occlusion, and navigation shapes to tiles, adding greater functionality to the TileMap.
de: Eine Tilemap ist ein Raster aus Tiles, das für das Layout eines Spiels verwendet wird. Die Verwendung von :ref:`TileMap <class_TileMap>`-Nodes für die Gestaltung von Levels hat mehrere Vorteile. Erstens ermöglichen sie es, das Layout zu zeichnen, indem man die Tiles auf ein Gitter "malt", was viel schneller ist, als einzelne :ref:`Sprite2D <class_Sprite2D>`-Nodes einzeln zu platzieren. Zweitens ermöglichen sie viel größere Levels, da sie für das Zeichnen einer großen Anzahl von Tiles optimiert sind. Schließlich können Sie den Tiles Kollisions-, Okklusions- und Navigations-Shapes hinzufügen, was der TileMap eine größere Funktionalität verleiht.
zh_cn: 图块地图是用于创建游戏布局的图块网格。使用 :ref:`TileMap <class_TileMap>` 节点设计关卡有很多好处。首先, 它们可以通过将图块 “绘制” 到网格上来绘制布局，这比逐个放置单个 :ref:`Sprite2D <class_Sprite2D>` 节点要快得多；其次，它们允许更大的关卡，因为它们针对绘制大量图块进行了优化。最后，你可以为图块添加碰撞，遮挡和导航形状，从而为 TileMap 添加其他功能。
zh_tw: 圖塊地圖 (TileMap) 是一組用來建立遊戲畫面的圖塊 (Tile) 網格。使用 :ref:`TileMap <class_TileMap>` 來設計關卡有許多的好處。首先，通過圖塊地圖便能通過將圖塊「畫」到網格上來繪製畫面，比起通過一個一個將 :ref:`Sprite <class_Sprite>` 節點放到畫面上來說快多了。再來，通過圖塊地圖也能製作更大的關卡，因為圖塊地圖有為繪製大量網格進行最佳化。最後，也可以給圖塊地圖加上碰撞區域、遮擋、圖塊的導覽區域，且可以為 TileMap 新增額外的功能。

source: Specifying the TileSet in the TileMap
de: Festlegen des TileSet in der TileMap
zh_cn: 在 TileMap 中指定 TileSet
zh_tw: 在 TileMap 中指定 TileSet

source: If you've followed the previous page on :ref:`doc_using_tilesets`, you should have a TileSet resource that is built-in to the TileMap node. This is good for prototyping, but in a real world project, you will generally have multiple levels reusing the same tileset.
de: Wenn Sie die vorherige Seite zu :ref:`doc_using_tilesets` durchgearbeitet haben, sollten Sie eine TileSet-Ressource haben, die in den TileMap-Node eingebaut ist. Dies ist gut für Prototypen, aber in einem realen Projekt werden Sie in der Regel mehrere Levels haben, die das gleiche Tileset verwenden.
zh_cn: 如果你已经进行了上一页 :ref:`doc_using_tilesets` 所述的步骤，你现在应该有一个内嵌进 TileMap 节点的 TileSet 资源。这样的做法适合制作原型，但在实际项目当中，你一般会有多个关卡复用同一个图块集。
zh_tw: 如果你已經進行了上一頁 :ref:`doc_using_tilesets`所述的步驟，你現在應該有一個內嵌進圖塊地圖節點的圖塊集資源。這將會便利原型設計。但在實際專案當中，你一般會有多個關卡複用同一個圖塊集。

source: The recommended way to reuse the same TileSet in several TileMap nodes is to save the TileSet to an external resource. To do so, click the dropdown next to the TileSet resource and choose **Save**:
de: Um dasselbe TileSet in mehreren TileMap Nodes wiederzuverwenden, wird empfohlen, das TileSet in einer externen Ressource zu speichern. Klicken Sie dazu auf das Dropdown-Menü neben der TileSet-Ressource und wählen Sie **Speichern**:
zh_cn: 在多个TileMap节点中重复使用相同的TileSet的推荐方法是将TileSet保存为外部资源。要这样做，请点击TileSet资源旁边的下拉菜单，然后选择**保存**：
zh_tw: 在多個TileMap節點中重複使用相同的TileSet的推薦方法是將TileSet保存為外部資源。要這樣做，請點擊TileSet資源旁邊的下拉式功能表，然後選擇**保存**：

source: Saving the built-in TileSet resource to an external resource file
de: Speichern der integrierten TileSet-Ressource in einer externen Ressourcendatei
zh_cn: 将内置 TileSet 资源保存为外部资源文件
zh_tw: 將內建 TileSet 資源保存為外部資源檔

source: Creating TileMap layers
de: Erstellen von TileMap-Ebenen
zh_cn: 创建 TileMap 图层
zh_tw: 建立內容

source: As of Godot 4.0, you can place several *layers* in a single TileMap node. For example, this allows you to distinguish foreground tiles from background tiles for better organization. You can place one tile per layer at a given location, which allows you to overlap several tiles together if you have more than one layer.
de: Ab Godot 4.0 können Sie mehrere *Layer* in einem einzigen TileMap-Node unterbringen. So können Sie zum Beispiel Vordergrund-Tiles von Hintergrund-Tiles unterscheiden, um die Organisation zu verbessern. Sie können eine Tile pro Layer an einer bestimmten Stelle platzieren, was es Ihnen ermöglicht, mehrere Tiles zu überlappen, wenn Sie mehr als einen Layer haben.
zh_cn: 从Godot 4.0开始，你可以在单个TileMap节点中放置多个图层。例如这样，这使你可以更好的区分前景图块和背景图块。你可以在给定位置的每个图层放置一个图块，这样如果你有多个图层，就可以将多个图块重叠在一起。
zh_tw: 從 Godot 4.0 開始，您可以在單一 TileMap 節點中放置多個*層*。例如，這允許您區分前景圖塊和背景圖塊，以便更好地組織。您可以在給定位置每層放置一個圖塊，這樣如果您有多個圖層，您可以將多個圖塊重疊在一起。

source: By default, a TileMap node automatically has one premade layer. You do not have to create additional layers if you only need a single layer, but if you wish to do so now, select the TileMap node and unfold the **Layers** section in the inspector:
de: Standardmäßig hat ein TileMap-Node automatisch eine vorgefertigte Ebene. Sie müssen keine zusätzlichen Ebenen erstellen, wenn Sie nur eine einzige Ebene benötigen. Wenn Sie dies jedoch jetzt tun möchten, wählen Sie den TileMap-Node und klappen Sie den Abschnitt **Ebenen** im Inspektor auf:
zh_cn: 默认情况下，TileMap 节点自动有一个预先设置的图层。如果你只需要一个图层，那么你不需要再额外创建图层。但是如果你希望这么做，在检查器中选择 TileMap 节点后，展开 **Layers** 部分：
zh_tw: 預設情況下，一個TileMap節點自動有一個預先設定的圖層。如果你只需要一個圖層，那麼你不需要再額外建立圖層。但是如果你希望這麼做，在屬性面板中選擇TileMap節點後，展開 **Layers**區段:

source: Creating layers in a TileMap node (example with "background" and "foreground")
de: Erstellen von Ebenen in einem TileMap-Node (Beispiel mit "Hintergrund" und "Vordergrund")
zh_cn: 在 TileMap 节点中创建图层（例子中的“background”和“foreground”）
zh_tw: 在 TileMap 節點中建立圖層（例子中的“background”和“foreground”）

source: Each layer has several properties you can adjust:
de: Jede Ebene hat mehrere Propertys, die Sie anpassen können:
zh_cn: 每个图层都有若干可以调整的属性：
zh_tw: 每個圖層都有若干可以調整的屬性：

source: **Name:** A human-readable name to display in the TileMap editor. This can be something like "background", "buildings", "vegetation", etc.
de: **Name:** Ein menschenlesbarer Name, der im TileMap-Editor angezeigt wird. Dies kann etwas wie "Hintergrund", "Gebäude", "Vegetation" usw. sein.
zh_cn: **Name:** 在TileMap编辑器中一个可读的显示名。这可以是"background", "buildings", "vegetation"等.
zh_tw: **Name:** 在TileMap編輯器中一個可讀的顯示名。這可以是"background", "buildings", "vegetation"等.

source: **Enabled:** If ``true``, the layer is visible in the editor and when running the project.
de: **Aktiviert:** Wenn ``true``, ist die Ebene im Editor und beim Ausführen des Projekts sichtbar.
zh_cn: **Enabled：**\ 如果为 ``true``\ ，当前图层在编辑器中和运行项目时可见。
zh_tw: **Enabled:** 如果為 ``true``, 目前圖層在編輯器中和運作專案時可見。

source: **Modulate:** The color to use as a multiplier for all tiles on the layer. This is also multiplied with the per-tile **Modulate** property and the TileMap node's **Modulate** property. For example, you can use this to darken background tiles to make foreground tiles stand out more.
de: **Modulieren:** Die Farbe, die als Multiplikator für alle Tiles auf der Ebene verwendet wird. Dieser wird auch mit der Property **Modulieren** pro Tile und der Property **Modulieren** des TileMap-Nodes multipliziert. So können Sie zum Beispiel die Hintergrund-Tiles abdunkeln, um die Vordergrund-Tiles stärker hervorzuheben.
zh_cn: **Modulate：**\ （调制）用于将层上所有图块相乘的颜色。也会与每个图块的 **Modulate** 属性和 TileMap 节点的 **Modulate** 属性相乘。例如，你可以使用这个属性来使背景图块变暗，以使前景图块更加突出。
zh_tw: **調變：** 用作圖層上所有圖塊的乘數的顏色。這也與每個圖塊的 **Modulate** 屬性和 TileMap 節點的 **Modulate** 屬性相乘。例如，您可以使用此功能使背景圖塊變暗，以使前景圖塊更加突出。

source: **Y Sort Enabled:** If ``true``, sorts tiles based on their Y position on the TileMap. This can be used to prevent sorting issues with certain tile setups, especially with isometric tiles.
de: **Y-Sortierung aktiviert:** Wenn ``true``, werden die Tiles anhand ihrer Y-Position auf der TileMap sortiert. Dies kann verwendet werden, um Sortierprobleme bei bestimmten Tile-Setups zu vermeiden, insbesondere bei isometrischen Tiles.
zh_cn: **Y Sort Enabled：**\ 如果为 ``true``\ ，则会根据图块在 TileMap 上的 Y 位置对图块进行排序。可用于防止特定图块设置下的排序问题，尤其是在使用等轴图块的时候。
zh_tw: **Y Sort Enabled：**如果為 ``true``，則會根據圖塊在 TileMap 上的 Y 位置對圖塊進行排序。可用於防止特定圖塊設定下的排序問題，尤其是在使用等軸圖塊的時候。

source: **Y Sort Origin:** The vertical offset to use for Y-sorting on each tile (in pixels). Only effective if **Y Sort Enabled** is ``true``.
de: **Y-Sortierungsursprung:** Der vertikale Offset, der für die Y-Sortierung auf jeder Tile verwendet wird (in Pixel). Nur wirksam, wenn **Y-Sortierung aktiviert** auf ``true`` steht.
zh_cn: **Y Sort Origin：**\ （Y 排序原点）用于每个图块 Y 轴排序的垂直偏移量（像素）。仅在 **Y Sort Enabled** 为 ``true`` 时有效。
zh_tw: **Y 排序原點：** 用於每個圖塊上 Y 排序的垂直偏移（以像素為單位）。僅當 **Y Sort Enabled** 為「true」時才有效。

source: **Z Index:** Controls whether this layer is drawn in front of or behind other TileMap layers. This value can be positive or negative; the layer with the highest Z Index is drawn on top of other layers. If several layers have an equal Z Index property, the layer that is *last* in the list of layers (the one which appears at the bottom in the list) is drawn on top.
de: **Z Index:** Steuert, ob diese Ebene vor oder hinter anderen TileMap-Ebenen gezeichnet wird. Dieser Wert kann positiv oder negativ sein; die Ebene mit dem höchsten Z-Index wird über den anderen Ebenen gezeichnet. Wenn mehrere Ebenen die gleiche Z-Index-Property haben, wird die Ebene, die *letzte* in der Liste der Ebenen ist (diejenige, die in der Liste ganz unten steht), oben gezeichnet.
zh_cn: **Z Index：**\（Z 轴索引）控制该图层在其他 TileMap 图层的面前或背后绘制。这个值可以是正数或负数；Z 轴索引最高的图层会被绘制在其他图层上面。如果几个图层具有相同的Z轴索引属性，列表中最后的图层（列表中显示在底部的图层）会被绘制在最上面。
zh_tw: **Z Index：** 控制該圖層是繪製在其他 TileMap 圖層的前面還是後面。該值可以是正值，也可以是負值；具有最高 Z 索引的圖層繪製在其他圖層之上。如果多個圖層具有相同的 Z 索引屬性，則圖層列表中*最後*的圖層（顯示在列表底部的圖層）將繪製在頂部。

source: You can reorder layers by drag-and-dropping the "three horizontal bars" icon on the left of the entries in the **Layers** section.
de: Sie können die Ebenen neu anordnen, indem Sie das Icon mit den "drei horizontalen Balken" links neben den Einträgen im Abschnitt **Ebenen** per Drag-and-Drop verschieben.
zh_cn: 你可以通过拖拽 **Layers** 左侧的“三横杠”图标对条目重新排序。
zh_tw: 你可以通過拖拽 **Layers** 左側的“三橫杠”圖示對條目重新排序。

source: You can create, rename or reorder layers in the future without affecting existing tiles. Be careful though, as *removing* a layer will also remove all tiles that were placed on the layer.
de: Sie können in Zukunft Ebenen erstellen, umbenennen oder neu anordnen, ohne dass sich dies auf die vorhandenen Tiles auswirkt. Seien Sie jedoch vorsichtig, denn beim *Entfernen* einer Ebene werden auch alle Tiles entfernt, die auf der Ebene platziert waren.
zh_cn: 创建，重命名或对图层进行排序时不会影响现有图块。但是请小心，在 *移除* 图层时也会同时移除该图层上所有的图块。
zh_tw: 建立，重命名或對圖層進行排序時不會影響現有圖塊。但是請小心，在“移除”時將會同時移除該圖層上所有的圖塊。

source: Opening the TileMap editor
de: Öffnen des TileMap-Editors
zh_cn: 打开 TileMap 编辑器
zh_tw: 執行編輯器

source: Select the TileMap node, then open the TileMap panel at the bottom of the editor:
de: Wählen Sie den Node TileMap aus und öffnen Sie das TileMap-Panel am unteren Rand des Editors:
zh_cn: 单击 TileMap 节点，TileMap 面板将在编辑器窗口底部打开:
zh_tw: 點擊 TileSet 屬性，會在編輯器視窗的下方開啟「TileSet」面板：

source: Opening the TileMap panel at the bottom of the editor. The TileMap node must be selected first.
de: Öffnen des TileMap-Panels am unteren Rand des Editors. Der TileMap-Node muss zuerst ausgewählt werden.
zh_cn: 先选中 TileMap 节点才能打开编辑器底部的 TileMap 面板。
zh_tw: 先選中 TileMap 節點才能打開編輯器底部的 TileMap 面板。

source: Selecting tiles to use for painting
de: Auswahl der Kacheln zum Malen
zh_cn: 选择用于绘制的图块
zh_tw: 選擇用於繪製的圖塊

source: First, if you've created additional layers above, make sure you've selected the layer you wish to paint on:
de: Wenn Sie oben zusätzliche Ebenen erstellt haben, stellen Sie zunächst sicher, dass Sie die Ebene ausgewählt haben, auf der Sie malen möchten:
zh_cn: 首先，如果你在上面创建了其他图层，确保你已经选择了要绘制的目标图层：
zh_tw: 首先，如果你在上面建立了其他圖層，確保你已經選擇了要繪製的靶心圖表層：

source: Selecting a layer to paint on in the TileMap editor
de: Auswählen einer Ebene zum Malen im TileMap-Editor
zh_cn: 在 TileMap 编辑器中选择要绘制的图层
zh_tw: 在 TileMap 編輯器中選擇要繪製的圖層

source: In the 2D editor, the layers you aren't currently editing from the same TileMap node will appear grayed out while in the TileMap editor. You can disable this behavior by clicking the icon next to the layer selection menu (**Highlight Selected TileMap Layer** tooltip).
de: Im 2D-Editor werden die Ebenen, die Sie gerade nicht über denselben TileMap-Node bearbeiten, im TileMap-Editor ausgegraut angezeigt. Sie können dieses Verhalten deaktivieren, indem Sie auf das Icon neben dem Ebenenauswahlmenü klicken (Tooltip **Ausgewählte TileMap-Ebene hervorheben**).
zh_cn: 在 2D 编辑器中，当前未在同一 TileMap 节点上编辑的图层在 TileMap 编辑器中将显示为灰色。你可以单击图层选择菜单旁边的图标（工具提示为\ **高亮所选 TileMap 图层**\ ）来禁用此行为。
zh_tw: 在 2D 編輯器中，目前未在同一 TileMap 節點上編輯的圖層在 TileMap 編輯器中將顯示為灰色。你可以按一下圖層選擇功能表旁邊的圖示（工具提示為**高亮所選 TileMap 圖層**）來禁用此行為。

source: You can skip the above step if you haven't created additional layers, as the first layer is automatically selected when entering the TileMap editor.
de: Sie können den obigen Schritt überspringen, wenn Sie keine zusätzlichen Ebenen erstellt haben, da die erste Ebene automatisch ausgewählt wird, wenn Sie den TileMap-Editor aufrufen.
zh_cn: 如果没有创建其他图层，可以跳过上述步骤，因为进入 TileMap 编辑器时会自动选择第一个图层。
zh_tw: 如果沒有建立其他圖層，可以跳過上述步驟，因為進入 TileMap 編輯器時會自動選擇第一個圖層。

source: Before you can place tiles in the 2D editor, you must select one or more tiles in the TileMap panel located at the bottom of the editor. To do so, click a tile in the TileMap panel, or hold down the mouse button to select multiple tiles:
de: Bevor Sie Tiles im 2D-Editor platzieren können, müssen Sie eine oder mehrere Tiles im TileMap-Panel am unteren Rand des Editors auswählen. Klicken Sie dazu auf eine Tile im TileMap-Panel, oder halten Sie die Maustaste gedrückt, um mehrere Tiles auszuwählen:
zh_cn: 在 2D 编辑器中放置图块之前，必须在编辑器底部的 TileMap 面板中选择一个或多个图块。为此，请单击 TileMap 面板中的图块，也可以按住鼠标选择多个图块：
zh_tw: 在 2D 編輯器中放置圖塊之前，必須在編輯器底部的 TileMap 面板中選擇一個或多個圖塊。為此，請按一下 TileMap 面板中的圖塊，也可以按住滑鼠選擇多個圖塊：

source: Selecting a tile in the TileMap editor by clicking it
de: Auswählen einer Tile im TileMap-Editor durch Anklicken
zh_cn: 点击以选中TileMap编辑器中的图块
zh_tw: 點擊以選中TileMap編輯器中的圖塊

source: Like in the 2D and TileSet editors, you can pan across the TileMap panel using the middle or right mouse buttons, and zoom using the mouse wheel or buttons in the top-left corner.
de: Wie in den 2D- und TileSet-Editoren können Sie mit der mittleren oder rechten Maustaste über das TileMap-Panel schwenken und mit dem Mausrad oder den Schaltflächen in der oberen linken Ecke zoomen.
zh_cn: 与 2D 编辑器和 TileSet 编辑器中一样，你可以使用鼠标中键或右键在 TileMap 面板上平移，使用鼠标滚轮或左上角的按钮进行缩放。
zh_tw: 與2D編輯器和TileSet編輯器中一樣，您可以使用滑鼠中鍵或右鍵在TileMap面板上平移，使用滑鼠滾輪或左上角的按鈕進行縮放。

source: You can also hold down :kbd:`Shift` to append to the current selection. When selecting more than one tile, multiple tiles will be placed every time you perform a painting operation. This can be used to paint structures composed of multiple tiles in a single click (such as large platforms or trees).
de: Sie können auch :kbd:`Umschalt` gedrückt halten, um zur aktuellen Auswahl hinzuzufügen. Wenn Sie mehr als eine Tile auswählen, werden jedes Mal, wenn Sie einen Malvorgang durchführen, mehrere Tiles platziert. Dies kann verwendet werden, um Strukturen, die aus mehreren Tiles bestehen, mit einem einzigen Klick zu malen (z. B. große Plattformen oder Bäume).
zh_cn: 你还可以按住 :kbd:`Shift` 来追加到当前选择。在选择多个图块时，每次执行绘制操作都会放置多个图块。这可以用于在单次点击中绘制由多个图块组成的结构（例如大型平台或树木）。
zh_tw: 您也可以按住 Shift 來追加到目前選擇。當選擇多個圖塊時，每次執行繪畫操作時都會放置多個圖塊。這可用於透過點擊繪製由多個圖塊組成的結構（例如大型平台或樹木）。

source: The final selection does not have to be contiguous: if there is empty space between selected tiles, it will be left empty in the pattern that will be painted in the 2D editor.
de: Die endgültige Auswahl muss nicht zusammenhängend sein: Wenn es leeren Raum zwischen den ausgewählten Tiles gibt, wird dieser in dem Muster, das im 2D-Editor gemalt wird, leer gelassen.
zh_cn: 最终的选择不必是连续的：如果在所选图块之间有空格，则将在2D编辑器中绘制的图案中留空。
zh_tw: 最終選擇不必是連續的：如果所選圖塊之間有空白空間，則在 2D 編輯器中繪製的圖案中它將留空。

source: Selecting multiple tiles in the TileMap editor by holding down the left mouse button
de: Auswählen mehrerer Tiles im TileMap-Editor durch Gedrückthalten der linken Maustaste
zh_cn: 在TileMap编辑器中按住鼠标左键可以选择多个图块
zh_tw: 在TileMap編輯器中按住滑鼠左鍵可以選擇多個圖塊

source: If you've created alternative tiles in your TileSet, you can select them for painting on the right of the base tiles:
de: Wenn Sie in Ihrem TileSet alternative Tiles erstellt haben, können Sie diese zum Malen rechts neben den Basis-Tiles auswählen:
zh_cn: 如果在 TileSet 中创建了备选图块，则可以在基准图块的右侧选择它们进行绘制：
zh_tw: 如果您在 TileSet 中建立了替代圖塊，則可以選擇它們在基礎圖塊的右側進行繪製：

source: Selecting an alternative tile in the TileMap editor
de: Auswählen einer alternativen Tile im TileMap-Editor
zh_cn: 在 TileMap 编辑器中选择备选图块
zh_tw: 使用程式碼來連接訊號

source: Lastly, if you've created a *scenes collection* in the TileSet, you can place scene tiles in the TileMap:
de: Schließlich können Sie, wenn Sie eine *Szenensammlung* im TileSet erstellt haben, Szenen-Tiles in der TileMap platzieren:
zh_cn: 最后，如果在 TileSet 中创建了一个 *场景集合（scenes collection）* ，则可以在 TileMap 中放置场景图块：
zh_tw: 最後，如果您在 TileSet 中建立了 *場景集合*，則可以將場景圖塊放置在 TileMap 中：

source: Placing a scene tile containing particles using the TileMap editor
de: Platzieren einer Tile mit Partikeln mit dem TileMap-Editor
zh_cn: 使用 TileMap 编辑器放置包含粒子的场景图块
zh_tw: 使用 TileMap 編輯器放置包含粒子的場景圖塊

source: Painting modes and tools
de: Malmodi und Tools
zh_cn: 绘制模式和工具
zh_tw: 本地坐標

source: Using the toolbar at the top of the TileMap editor, you can choose between several painting modes and tools. These modes affect operation when clicking in the 2D editor, **not** the TileMap panel itself.
de: Über die Toolbar am oberen Rand des TileMap-Editors können Sie zwischen verschiedenen Malmodi und Werkzeugen wählen. Diese Modi wirken sich auf die Bedienung beim Klicken im 2D-Editor aus, **nicht** auf das TileMap-Panel selbst.
zh_cn: 使用 TileMap 编辑器顶部的工具栏，你可以在几种绘画模式和工具之间进行选择。这些模式会影响在 2D 编辑器中点击时的操作，而 **不** 影响 TileMap 面板本身。
zh_tw: 使用 TileMap 編輯器頂部的工具列，您可以在多種繪畫模式和工具之間進行選擇。這些模式會影響在 2D 編輯器中點擊時的操作，**而不是** TileMap 面板本身。

source: From left to right, the painting modes and tools you can choose are:
de: Von links nach rechts können Sie zwischen folgenden Malmodi und Werkzeugen wählen:
zh_cn: 从左到右，可以选择的绘制模式和工具是：
zh_tw: 在工具列中從左到右：

source: Selection
de: Auswahl
zh_cn: 选择
zh_tw: 剪下所選

source: Select tiles by clicking a single tile, or by holding down the left mouse button to select multiple with a rectangle in the 2D editor. Note that empty space cannot be selected: if you create a rectangle selection, only non-empty tiles will be selected.
de: Wählen Sie Tiles aus, indem Sie auf ein einzelnes Tile klicken, oder indem Sie die linke Maustaste gedrückt halten, um mehrere mit einem Rechteck im 2D-Editor auszuwählen. Beachten Sie, dass leerer Raum nicht ausgewählt werden kann: Wenn Sie eine rechteckige Auswahl erstellen, werden nur nicht leere Tiles ausgewählt.
zh_cn: 在2D编辑器中，可以通过单击单个图块或按住鼠标左键框选多个图块来选择。请注意，无法选择空白区域：如果创建了一个矩形选择，只会选择非空图块。
zh_tw: 透過點選單一圖塊來選擇圖塊，或按住滑鼠左鍵在 2D 編輯器中使用矩形選擇多個圖塊。請注意，無法選擇空白區域：如果建立矩形選擇，則只會選擇非空圖塊。

source: To append to the current selection, hold :kbd:`Shift` then select a tile. To remove from the current selection, hold :kbd:`Ctrl` then select a tile.
de: Um eine Tile an die aktuelle Auswahl anzuhängen, halten Sie :kbd:`Umschalt` und wählen Sie eine Tile aus. Um aus der aktuellen Auswahl zu entfernen, halten Sie :kbd:`Strg` und wählen dann eine Tile aus.
zh_cn: 要追加到当前选择，按 :kbd:`Shift` 键，然后选择一个图块。要从当前选择中删除，请按 :kbd:`Ctrl` 键，然后选择一个图块。
zh_tw: 若要追加至目前選擇，請按住 Shift 然後選擇一個圖塊。若要從目前選取中刪除，請按住 Ctrl 然後選擇一個圖塊。

source: The selection can then be used in any other painting mode to quickly create copies of an already-placed pattern.
de: Die Auswahl kann dann in jedem anderen Malmodus verwendet werden, um schnell Kopien eines bereits platzierten Musters zu erstellen.
zh_cn: 然后可以在任何其他绘画模式下使用该选择来快速创建已放置模式的副本。
zh_tw: 然後可以在任何其他繪畫模式中使用該選擇來快速建立已放置圖案的副本。

source: You can remove the selected tiles from the TileMap by pressing :kbd:`Del`.
de: Sie können die ausgewählten Tiles aus der TileMap entfernen, indem Sie :kbd:`Entf` drücken.
zh_cn: 可以通过按 :kbd:`Del` ，从 TileMap 中删除选定的图块。

source: You can toggle this mode temporarily while in Paint mode by holding :kbd:`Ctrl` then performing a selection.
de: Sie können diesen Modus im Malmodus vorübergehend umschalten, indem Sie :kbd:`Strg` halten und dann eine Auswahl treffen.
zh_cn: 在绘制模式下，可以通过按住 :kbd:`Ctrl` 键然后进行选择来暂时切换到此模式。
zh_tw: 在繪畫模式下，您可以按住 Ctrl 然後執行選擇來暫時切換此模式。

source: You can copy and paste tiles that were already placed by performing a selection, pressing :kbd:`Ctrl + C` then pressing :kbd:`Ctrl + V`. The selection will be pasted after left-clicking. You can press :kbd:`Ctrl + V` another time to perform more copies this way. Right-click or press :kbd:`Escape` to cancel pasting.
de: Sie können bereits platzierte Tiles kopieren und einfügen, indem Sie eine Auswahl treffen, :kbd:`Strg + C` drücken und dann :kbd:`Strg + V`. Die Auswahl wird mit einem Linksklick eingefügt. Sie können :kbd:`Strg + V` ein weiteres Mal drücken, um weitere Kopien auf diese Weise durchzuführen. Klicken Sie mit der rechten Maustaste oder drücken Sie :kbd:`Esc`, um das Einfügen abzubrechen.
zh_cn: 你可以复制并粘贴已经放置的图块：选择图块，按 :kbd:`Ctrl+C` 键，然后按 :kbd:`Ctrl+V` 键，也可以通过左键单击将所选内容粘贴到图中。还可以按 :kbd:`Ctrl+V` 键再次进行复制，右键单击或按 :kbd:`Escape` 键可取消粘贴。
zh_tw: 您可以透過執行選取來複製並貼上已放置的圖塊，按 Ctrl + C，然後按 Ctrl + V。點擊左鍵後將貼上所選內容。您可以再次按 Ctrl + V 以這種方式執行更多副本。右鍵或按 Escape 取消貼上。

source: Paint
de: Malen
zh_cn: 绘制
zh_tw: 繪製圖塊

source: The standard Paint mode allows you to place tiles by clicking or holding down the left mouse button.
de: Im Default-Malmodus können Sie Tiles durch Klicken oder Gedrückthalten der linken Maustaste platzieren.
zh_cn: 标准绘制模式允许你通过单击或按住鼠标左键来放置图块。
zh_tw: 標準繪畫模式可讓您透過點擊或按住滑鼠左鍵來放置圖塊。

source: If you right-click, the currently selected tile will be erased from the tilemap. In other words, it will be replaced by empty space.
de: Wenn Sie mit der rechten Maustaste klicken, wird die aktuell ausgewählte Tile aus der Tilemap gelöscht. Mit anderen Worten: Sie wird durch leeren Raum ersetzt.
zh_cn: 如果右键 单击，则当前选定的图块将从图块地图中删除。换句话说，它将被替换为空白区域。
zh_tw: 如果右鍵單擊，目前選定的圖塊將從圖塊地圖中刪除。換句話說，它將被空白空間所取代。

source: If you have selected multiple tiles in the TileMap or using the Selection tool, they will be placed every time you click or drag the mouse while holding down the left mouse button.
de: Wenn Sie mehrere Tiles in der TileMap oder mit dem Auswahlwerkzeug ausgewählt haben, werden sie jedes Mal platziert, wenn Sie mit der Maus klicken oder ziehen, während Sie die linke Maustaste gedrückt halten.
zh_cn: 如果你在 TileMap 中或使用选择工具选择了多个图块，则在按住鼠标左键的同时单击或拖动鼠标时，这些图块都将会被放置。
zh_tw: 如果您在 TileMap 中或使用選擇工具選擇了多個圖塊，則每次您在按住滑鼠左鍵的同時點擊或拖曳滑鼠時都會放置它們。
