Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: de, zh_cn, zh_tw

source: Using TileSets
de: TileSets verwenden
zh_cn: 使用 TileSet
zh_tw: 使用圖塊地圖

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: A tilemap is a grid of tiles used to create a game's layout. There are several benefits to using :ref:`TileMap <class_TileMap>` nodes to design your levels. First, they let you draw a layout by "painting" tiles onto a grid, which is much faster than placing individual :ref:`Sprite2D <class_Sprite2D>` nodes one by one. Second, they allow for larger levels because they are optimized for drawing large numbers of tiles. Finally, they allow you to add greater functionality to your tiles with collision, occlusion, and navigation shapes.
de: Eine Tilemap ist ein Raster aus Tiles, das zur Gestaltung eines Spiellayouts verwendet wird. Es gibt mehrere Vorteile bei der Verwendung von :ref:`TileMap <class_TileMap>`-Nodes, um Ihre Level zu gestalten. Erstens können Sie ein Layout zeichnen, indem Sie Tiles auf ein Raster "malen", was viel schneller ist, als einzelne :ref:`Sprite2D <class_Sprite2D>`-Nodes einzeln zu platzieren. Zweitens erlauben sie größere Levels, da sie für das Zeichnen einer großen Anzahl von Tiles optimiert sind. Und schließlich können Sie Ihren Tiles mit Kollisions-, Okklusions- und Navigations-Shapes eine größere Funktionalität verleihen.
zh_cn: 图块地图（Tilemap）是由图块（Tile）组成的栅格，用于创建游戏的布局。使用 :ref:`TileMap <class_TileMap>` 节点设计关卡有很多好处。首先，你可以通过在栅格中“画”图块来绘制布局，比一个个放置 :ref:`Sprite2D <class_Sprite2D>` 节点要快很多。其次，图块地图支持的关卡更大，因为针对绘制大量图块做了优化。最后，你还可以添加碰撞、遮挡、导航形状等更强大的功能。
zh_tw: 圖塊地圖 (TileMap) 是一組用來建立遊戲畫面的圖塊 (Tile) 網格。使用 :ref:`TileMap <class_TileMap>` 來設計關卡有許多的好處。首先，通過圖塊地圖便能通過將圖塊「畫」到網格上來繪製畫面，比起通過一個一個將 :ref:`Sprite <class_Sprite>` 節點放到畫面上來說快多了。再來，通過圖塊地圖也能製作更大的關卡，因為圖塊地圖有為繪製大量網格進行最佳化。最後，也可以給圖塊地圖加上碰撞區域、遮擋、圖塊的導覽區域，且可以為 TileMap 新增額外的功能。

source: To use tilemaps, you will need to create a TileSet first. A TileSet is a collection of tiles that can be placed in a TileMap node. After creating a TileSet, you will be able to place them :ref:`using the TileMap editor <doc_using_tilemaps>`.
de: Um Tilemaps zu verwenden, müssen Sie zunächst ein TileSet erstellen. Ein TileSet ist eine Sammlung von Tiles, die in einem TileMap Node platziert werden können. Nachdem Sie ein TileSet erstellt haben, können Sie sie :ref:`mit dem TileMap-Editor <doc_using_tilemaps>` platzieren.
zh_cn: 要使用图块地图，你需要首先创建一个 TileSet。TileSet 是图块集，也就是能够放置到 TileMap 节点上的图块的合集。创建 TileSet 之后，你就可以\ :ref:`使用 TileMap 编辑器 <doc_using_tilemaps>`\ 放置图块。
zh_tw: 要使用圖塊地圖，你需要首先建立一個 TileSet。TileSet 是圖塊集，也就是能夠放置到 TileMap 節點上的圖塊的合集。建立 TileSet 之後，你就可以:ref:`使用 TileMap 編輯器 <doc_using_tilemaps>`放置圖塊。

source: To follow this guide, you will need an image containing your tiles where every tile has the same size (large objects can be split into several tiles). This image is called a *tilesheet*. Tiles do not have to be square: they can be rectangular, hexagonal, or isometric (pseudo-3D perspective).
de: Um dieser Anleitung zu befolgen, benötigen Sie ein Bild, das Ihre Tiles enthält und in dem jede Tile die gleiche Größe hat (große Objekte können in mehrere Tiles aufgeteilt werden). Dieses Bild wird *Tilesheet* genannt. Die Tiles müssen nicht quadratisch sein: Sie können rechteckig, sechseckig oder isometrisch (Pseudo-3D-Perspektive) sein.
zh_cn: 要跟随这个指南进行操作，你需要一张包含若干图块的图片，每个图块的大小都应该相同（较大的对象可以拆成若干个图块）。这种图片叫做\ *图块表*\ （Tilesheet）。图块不一定必须是正方形的：可以是矩形图块、六边形图块、等轴图块（伪 3D 透视）。
zh_tw: 要跟隨這個指南進行操作，你需要一張包含若干圖塊的圖片，每個圖塊的大小都應該相同（較大的物件可以拆成若干個圖塊）。這種圖片叫做*圖塊表*（Tilesheet）。圖塊不一定必須是正方形的：可以是矩形圖塊、六邊形圖塊、等軸圖塊（偽 3D 透視）。

source: Creating a new TileSet
de: Erstellen eines neuen TileSets
zh_cn: 新建 TileSet
zh_tw: 建立 TileSet

source: Using a tilesheet
de: Verwendung eines Tilesheets
zh_cn: 使用图块表
zh_tw: 使用檔案

source: This demonstration will use the following tiles taken from `Kenney's "Abstract Platformer" pack <https://kenney.nl/assets/abstract-platformer>`__. We'll use this particular *tilesheet* from the set:
de: Diese Demonstration wird die folgenden Tiles aus `Kenneys Abstract Platformer-Paket <https://kenney.nl/assets/abstract-platformer>`__ verwenden. Wir werden dieses spezielle *Tilesheet* aus dem Set verwenden:
zh_cn: 这个演示使用的是从 `Kenney 的“抽象平台跳跃”包 <https://kenney.nl/assets/abstract-platformer>`__\ 中选取的图块。我们会使用该集合中的这个\ *图块表*\ ：
zh_tw: 本處的示範專案使用了來自 Kenney 製作的「Abstract Platform」藝術包中的下列網格。可以在 `此處 <https://kenney.nl/assets/abstract-platformer>`_ 找到該藝術包中所有的網格，但本處的示範專案只會使用一小部分。

source: Tilesheet example with 64×64 tiles
de: Beispiel für ein Tilesheet mit 64×64 Tiles
zh_cn: 图块表示例，64×64 图块
zh_tw: 圖塊表範例，64×64 圖塊

source: Tilesheet with 64×64 tiles. Credit: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
de: Tilesheet mit 64×64 Tiles. Quelle: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
zh_cn: 64×64 图块的图块表。作者：\ `Kenney <https://kenney.nl/assets/abstract-platformer>`__
zh_tw: 64×64 圖塊的圖塊表。作者：`Kenney <https://kenney.nl/assets/abstract-platformer>`__

source: Create a new **TileMap** node, then select it and create a new TileSet resource in the inspector:
de: Erstellen Sie einen neuen Node **TileMap**, wählen Sie ihn aus und erstellen Sie eine neue TileSet-Ressource im Inspektor:
zh_cn: 新建 **TileMap** 节点，选中，然后在检查器中新建 TileSet 资源：
zh_tw: 新建 **TileMap** 節點，選中，然後在屬性面板中新建 TileSet 資源：

source: Creating a new TileSet resource within the TileMap node
de: Erstellen einer neuen TileSet-Ressource innerhalb des TileMap-Nodes
zh_cn: 在 TileMap 节点中新建 TileSet 资源
zh_tw: 在 TileMap 節點中新建 TileSet 資源

source: After creating the TileSet resource, click the value to unfold it in the inspector. The default tile shape is Square, but you can also choose Isometric, Half-Offset Square or Hexagon (depending on the shape of your tile images). If using a tile shape other than Square, you may also need to adjust the **Tile Layout** and **Tile Offset Axis** properties. Lastly, enabling the **Rendering > UV Clipping** property may be useful if you wish tiles to be clipped by their tile coordinates. This ensures tiles cannot draw outside their allocated area on the tilesheet.
de: Nachdem Sie die TileSet-Ressource erstellt haben, klicken Sie auf den Wert, um ihn im Inspektor auszuklappen. Die Standardform der Kachel ist Quadratisch, aber Sie können auch Isometrisch, Halbversetztes Quadrat oder Sechseck wählen (abhängig von der Form Ihrer Tile-Bilder). Wenn Sie eine andere Tile-Form als Square verwenden, müssen Sie möglicherweise auch die Propertys **Tile-Layout** und **Tile-Versatzachse** anpassen. Schließlich kann es nützlich sein, die Property **Rendern > UV-Clipping** zu aktivieren, wenn Sie möchten, dass Tiles durch ihre Tile-Koordinaten geclippt werden. Dadurch wird sichergestellt, dass Tiles nicht außerhalb ihres zugewiesenen Bereichs auf dem Tilesheet gezeichnet werden können.
zh_cn: 创建 TileSet 资源后，在检查器中点击该值可以将其展开。默认图块形状是 Square（正方形），但是你也可以根据图块图像中的形状去选择 Isometric（等轴）、Half-Offset Square（半偏移正方形）、Hexagon（六边形）。如果使用了 Square 以外的图块形状，你可能还需要调整 **Tile Layout**\ （图块布局）和 **Tile Offset Axis**\ （图块偏移轴）等属性。最后，如果你想要让图块被图块坐标裁剪，还可以启用 **Rendering > UV Clipping**\ （渲染 > UV 裁剪）属性。这样就能够保证图块无法绘制到它们在图块表上分配的区域之外。
zh_tw: 建立 TileSet 資源後，在屬性面板中點擊該值可以將其展開。預設圖塊形狀是 Square（正方形），但是你也可以根據圖塊圖像中的形狀去選擇 Isometric（等軸）、Half-Offset Square（半偏移正方形）、Hexagon（六邊形）。如果使用了 Square 以外的圖塊形狀，你可能還需要調整 **Tile Layout**（圖塊佈局）和 **Tile Offset Axis**（圖塊偏移軸）等屬性。最後，如果你想要讓圖塊被圖塊座標裁剪，還可以啟用 **Rendering > UV Clipping**（算繪 > UV 裁剪）屬性。這樣就能夠保證圖塊無法繪製到它們在圖塊表上分配的區域之外。

source: Set the tile size to 64×64 in the inspector to match the example tilesheet:
de: Stellen Sie die Größe der Tiles im Inspektor auf 64×64 ein, um dem Beispiel-Tilesheet zu entsprechen:
zh_cn: 在检查器中将图块大小设置为 64×64，与示例图块表相匹配：
zh_tw: 在屬性面板中將圖塊大小設定為 64×64，與範例圖塊表相配對：

source: Setting the tile size to 64×64 to match the example tilesheet
de: Einstellung der Tile-Größe auf 64×64, um dem Beispiel-Tilesheet zu entsprechen
zh_cn: 将图块大小设置为 64×64，与示例图块表相匹配
zh_tw: 將圖塊大小設定為 64×64，與範例圖塊表相配對

source: If relying on automatic tiles creation (like we're about to do here), you must set the tile size **before** creating the *atlas*. The atlas will determine which tiles from the tilesheet can be added to a TileMap node (as not every part of the image may be a valid tile).
de: Wenn Sie sich auf die automatische Erstellung von Tiles verlassen (wie wir es hier tun werden), müssen Sie die Größe der Tiles **vor** der Erstellung des *Atlas* festlegen. Der Atlas bestimmt, welche Tiles aus dem Tilesheet zu einem TileMap-Node hinzugefügt werden können (da nicht jeder Teil des Bildes ein gültiges Tile sein kann).
zh_cn: 如果依赖于自动图块创建（就像我们即将要做的那样），你必须在创建 *图集* **之前** 设置图块大小。图集将确定哪些图块可以添加到 TileMap 节点（因为并不是图像的每一个部分都是有效的图块）。
zh_tw: 如果依賴於自動圖塊建立（就像我們即將要做的那樣），您必須在建立*合集***之前**設定圖塊大小。合集將確定哪些圖塊可以新增到TileMap節點（因為並不是圖像的每一個部分都是有效的圖塊）。

source: Open the **TileSet** panel at the bottom of the editor, then click the "+" icon in the bottom-left corner to add a new atlas:
de: Öffnen Sie das **TileSet**-Panel unten im Editor und klicken Sie dann auf das "+"-Icon in der linken unteren Ecke, um einen neuen Atlas hinzuzufügen:
zh_cn: 在编辑器底部面板中点击 **TileSet**\ ，然后点击左下角的“+”号图片按钮增加一个新的图集：
zh_tw: 在編輯器底部面板中點擊 **TileSet**，然後點擊左下角的“+”號圖片按鈕增加一個新的合集：

source: Creating a new atlas in a TileSet resource using the bottom panel
de: Erstellen eines neuen Atlasses in einer TileSet-Ressource unter Verwendung des unteren Bedienfelds
zh_cn: 使用底部面板来给 TileSet 创建一个新图集
zh_tw: 使用底部面板來給 TileSet 建立一個新合集

source: After creating an atlas, you must assign a tilesheet texture to it. This can be done by choosing it on the left column of the bottom panel, then clicking the value of the **Texture** property and choosing **Quick Load** (or **Load**). Specify the path to the image file using the file dialog that appears.
de: Nachdem Sie einen Atlas erstellt haben, müssen Sie ihm eine Tilesheet-Textur zuweisen. Wählen Sie dazu den Atlas in der linken Spalte des unteren Panels aus, klicken Sie dann auf den Wert der **Textur**-Property und wählen Sie **Schnell laden** (oder **Laden**). Geben Sie den Pfad zu der Bilddatei im angezeigten Dateidialog an.
zh_cn: 创建图集之后，你必须为其分配图块表。在底部面板的左栏中选中图集，然后点击\ **纹理**\ 属性的值，选择\ **快速加载**\ （或\ **加载**\ ）。请在显示的文件对话框中指定图像文件的路径。
zh_tw: 建立合集之後，你必須為其分配圖塊表。在底部面板的左欄中選中合集，然後點擊**紋理**屬性的值，選擇**快速載入**（或**載入**）。請在顯示的檔對話方塊中指定影像檔的路徑。

source: Loading a tilesheet image in the newly created TileSet atlas
de: Laden eines Tilesheet-Bildes in den neu erstellten TileSet-Atlas
zh_cn: 为新创建的 TileSet 图集加载图块表图像
zh_tw: 為新建立的 TileSet 合集載入圖塊表圖像

source: After specifying a valid image, you will be asked whether to create tiles automatically. Answer **Yes**:
de: Nachdem Sie ein gültiges Bild angegeben haben, werden Sie gefragt, ob die Tiles automatisch erstellt werden sollen. Antworten Sie mit **Ja**:
zh_cn: 指定有效的图像后，会问你要不要自动创建图块。请回答\ **是**\ ：
zh_tw: 指定有效的圖像後，會問你要不要自動建立圖塊。請回答**是**：

source: Automatically creating tiles based on tilesheet image content
de: Automatisches Erstellen von Tiles auf der Grundlage von Tilesheet-Bildmaterial
zh_cn: 根据图块表图像内容自动创建图块
zh_tw: 根據圖塊表圖像內容自動建立圖塊

source: This will automatically create tiles according to the tile size you specified earlier in the TileSet resource. This greatly speeds up initial tile setup.
de: Dadurch werden automatisch Tiles entsprechend der Tile-Größe erstellt, die Sie zuvor in der TileSet-Ressource angegeben haben. Dies beschleunigt die anfängliche Einrichtung der Tiles erheblich.
zh_cn: 这将根据你之前在 TileSet 资源中指定的磁贴尺寸自动创建磁贴。这将大大加快初始磁贴设置的速度。
zh_tw: 這將根據您之前在 TileSet 資源中指定的磁貼尺寸自動建立磁貼。這將大大加快初始磁貼設定的速度。

source: When using automatic tile generation based on image contents, parts of the tilesheet that are *fully* transparent will not have tiles generated.
de: Bei der automatischen Erzeugung von Tiles auf der Basis von Bildinhalten werden für Teile des Tilesheets, die *voll* transparent sind, keine Tiles erzeugt.
zh_cn: 使用基于图像内容的自动瓦片生成功能时，瓦片表中 *完全* 透明的部分将不会生成瓦片。
zh_tw: 使用基於圖像內容的自動瓦片生成功能時，瓦片表中 *完全* 透明的部分將不會生成瓦片。

source: If there are tiles from the tilesheet you do not wish to be present in atlas, choose the Eraser tool at the top of the tileset preview, then click the tiles you wish to remove:
de: Wenn es Tiles aus dem Tilesheet gibt, die Sie nicht im Atlas haben möchten, wählen Sie das Radiergummi-Tool am oberen Rand der Tileset-Vorschau und klicken Sie dann auf die Tiles, die Sie entfernen möchten:
zh_cn: 如果不希望地图册中出现瓦片表中的瓦片，请选择瓦片组预览顶部的橡皮擦工具，然后单击希望删除的瓦片：
zh_tw: 如果不希望地圖冊中出現瓦片表中的瓦片，請選擇瓦片組預覽頂部的橡皮擦工具，然後按一下希望刪除的瓦片：

source: Using the Eraser tool to remove unwanted tiles from the TileSet atlas
de: Verwenden des Radiergummi-Tools zum Entfernen unerwünschter Tiles aus dem TileSet-Atlas
zh_cn: 使用橡皮擦工具删除 TileSet 地图集中不需要的图块
zh_tw: 使用橡皮擦工具刪除 TileSet 地合集中不需要的圖塊

source: You can also right-click a tile and choose **Delete**, as an alternative to the Eraser tool.
de: Sie können auch mit der rechten Maustaste auf eine Tile klicken und **Löschen** wählen, als Alternative zum Radiergummi-Tool.
zh_cn: 你也可以右键单击磁贴，选择 **删除** ，作为橡皮擦工具的替代。
zh_tw: 您也可以按右鍵磁貼，選擇 **刪除** ，作為橡皮擦工具的替代。

source: Like in the 2D and TileMap editors, you can pan across the TileSet panel using the middle or right mouse buttons, and zoom using the mouse wheel or buttons in the top-left corner.
de: Wie in den 2D- und TileMap-Editoren können Sie mit der mittleren oder rechten Maustaste über das TileSet-Panel schwenken und mit dem Mausrad oder den Buttons in der oberen linken Ecke zoomen.
zh_cn: 与 2D 和 TileMap 编辑器一样，你可以使用鼠标中键或右键平移整个 TileSet 面板，并使用鼠标滚轮或左上角的按钮进行缩放。
zh_tw: 與 2D 和 TileMap 編輯器一樣，您可以使用滑鼠中鍵或右鍵平移整個 TileSet 面板，並使用滑鼠滾輪或左上角的按鈕進行縮放。

source: If you wish to source tiles from several tilesheet images for a single TileSet, create additional atlases and assign textures to each of them before continuing. It is also possible to use one image per tile this way (although using tilesheets is recommended for better usability).
de: Wenn Sie Kacheln aus mehreren Tilesheet-Bildern für ein einzelnes TileSet verwenden möchten, erstellen Sie zusätzliche Atlasse und weisen Sie jedem von ihnen Texturen zu, bevor Sie fortfahren. Es ist auch möglich, auf diese Weise ein Bild pro Tile zu verwenden (obwohl die Verwendung von Tilesheets für eine bessere Benutzerfreundlichkeit empfohlen wird).
zh_cn: 如果你想从几个图块表图片中摘取一个 TileSet 的图块，请在继续处理之前创建其他图集并为它们一一分配纹理。也可以通过这种方式为每个图块使用一个图片（尽管建议使用图块表以提高可用性）。
zh_tw: 如果你想從幾個 tilesheet 圖片中摘取一個 TileSet 的圖塊，請在繼續處理之前建立其他合集並為它們一一分配紋理。也可以通過這種方式為每個圖塊使用一個圖片（儘管建議使用 tilesheets 以提高可用性）。

source: You can adjust properties for the atlas in the middle column:
de: In der mittleren Spalte können Sie die Propertys des Atlasses anpassen:
zh_cn: 你可以调整中间的列中图集的属性：
zh_tw: 您可以調整中間的列中合集的屬性：

source: Adjusting TileSet atlas properties in the dedicated inspector (part of the TileSet panel)
de: Anpassung der TileSet-Atlas-Propertys im spezifischen Inspektor (Teil des TileSet-Panels)
zh_cn: 在专用检查器中调整 TileSet 图集属性（TileSet 面板的一部分）
zh_tw: 在專用屬性面板中調整 TileSet 合集屬性（TileSet 面板的一部分）

source: The following properties can be adjusted on the atlas:
de: Die folgenden Propertys können im Atlas angepasst werden:
zh_cn: 可以在图集上调整以下属性：
zh_tw: 可以在合集上調整以下屬性：

source: **ID:** The identifier (unique within this TileSet), used for sorting.
de: **ID:** Der Bezeichner (eindeutig in diesem TileSet), der für die Sortierung verwendet wird.
zh_cn: **ID：** 标识符（该 TileSet中的唯一），用于排序。
zh_tw: **ID：** 識別字（該 TileSet中的唯一），用於排序。

source: **Name:** The human-readable name for the atlas. Use a descriptive name here for organizational purposes (such as "terrain", "decoration", etc).
de: **Name:** Der menschenlesbare Name für den Atlas. Verwenden Sie hier einen beschreibenden Namen für organisatorische Zwecke (z. B. "Terrain", "Dekoration" usw.).
zh_cn: **名称：** 图集的人类可读名称。在此处使用描述性的名称来方便管理（例如“地形”，“装饰”等）。
zh_tw: **名稱：** 合集的人類可讀名稱。在此處使用描述性的名稱來方便管理（例如“地形”，“裝飾”等）。

source: **Margins:** The margins on the image's edges that should not be selectable as tiles (in pixels). Increasing this can be useful if you download a tilesheet image that has margins on the edges (e.g. for attribution).
de: **Ränder:** Die Ränder an den Kanten des Bildes, die nicht als Tiles ausgewählt werden sollen (in Pixeln). Eine Erhöhung dieses Wertes kann nützlich sein, wenn Sie ein Kachelbild herunterladen, das an den Rändern Ränder hat (z. B. für die Autor-Informationen).
zh_cn: **边距：** 图像边缘上的边距不应选择为图块（以像素为单位）。当你下载的图块表图像的边缘有边距（例如，用于表明归属），则增加这个值可能会很有用。
zh_tw: **邊距：** 圖像邊緣上的邊距不應選擇為圖塊（以像素為單位）。當你下載了邊緣上有邊距的 tileSheet 圖像（例如，用於表明歸屬），增加這個數值可以方便調整。

source: **Separation:** The separation between each tile on the atlas in pixels. Increasing this can be useful if the tilesheet image you're using contains guides (such as outlines between every tile).
de: **Abstand:** Der Abstand zwischen den einzelnen Tiles auf dem Atlas in Pixeln. Eine Erhöhung dieses Wertes kann nützlich sein, wenn das von Ihnen verwendete Tilesheet-Bild Hilfslinien enthält (z. B. Umrisse zwischen den einzelnen Tiles).
zh_cn: **间距：** 以像素为单位的地图集上的每个图块之间的间距。如果你使用的图块表图像包含辅助线（例如每个图块之间的轮廓），则增加间距可能会很有用。
zh_tw: **間距：** 以像素為單位的地合集上的每個圖塊之間的間距。如果你使用的 tilesheet 圖像包含輔助線（例如每個圖塊之間的輪廓），則增加間距將會很方便調整。

source: **Texture Region Size:** The size of each tile on the atlas in pixels. In most cases, this should match the tile size defined in the TileMap property (although this is not strictly necessary).
de: **Textur-Regionsgröße:** Die Größe der einzelnen Tiles im Atlas in Pixeln. In den meisten Fällen sollte dies mit der in der Property TileMap definierten Tile-Größe übereinstimmen (obwohl dies nicht unbedingt erforderlich ist).
zh_cn: **纹理区域大小：** 以像素为单位的图集上的每个图块的大小。在大多数情况下，这应该与 TileMap 属性中定义的图块大小相匹配（尽管并不是必需的）。
zh_tw: **紋理區域大小：** 以像素為單位的合集上的每個圖塊的大小。在大多數情況下，這應該與 TileMap 屬性中定義的圖塊大小相配對（儘管並不是必需的）。

source: **Use Texture Padding:** If checked, adds a 1-pixel transparent edge around each tile to prevent texture bleeding when filtering is enabled. It's recommended to leave this enabled unless you're running into rendering issues due to texture padding.
de: **Textur-Padding verwenden:** Wenn diese Option aktiviert ist, wird um jede Tile ein transparenter Rand von 1 Pixel hinzugefügt, um Textur-Bleeding zu verhindern, wenn Filtering aktiviert ist. Es wird empfohlen, dies aktiviert zu lassen, es sei denn, Sie laufen in Rendering-Probleme aufgrund von Textur-Padding.
zh_cn: **使用纹理内边距：** 如果选用，则在每个图块周围添加一个1像素的透明的边缘，以防止启用过滤时纹理渗出（bleeding）。建议默认将其启用，除非你由于纹理内边距而遇到渲染问题。
zh_tw: **使用紋理內邊距：** 如果選用，則在每個圖塊周圍新增一個1像素的透明的邊緣，以防止啟用篩選時紋理滲出（bleeding）。除非你由於紋理內邊距而遇到算繪問題，否則建議預設將其啟用。

source: Note that changing texture margin, separation and region size may cause tiles to be lost (as some of them would be located outside the atlas image's coordinates). To regenerate tiles automatically from the tilesheet, use the three vertical dots menu button at the top of the TileSet editor and choose **Create Tiles in Non-Transparent Texture Regions**:
de: Beachten Sie, dass eine Änderung des Texturrandes, des Abstandes und der Regionsgröße dazu führen kann, dass Tiles verloren gehen (da sich einige von ihnen außerhalb der Koordinaten des Atlasbildes befinden würden). Um Tiles automatisch aus dem Tilesheet zu regenerieren, verwenden Sie den Button mit den drei vertikalen Punkten oben im TileSet-Editor und wählen Sie **Tiles in nicht-transparenten Textur-Regionen erstellen**:
zh_cn: 请注意，更改纹理边距，间距和区域大小都有可能会导致图块丢失（其中一些将位于图集图片的坐标之外）。如要自动从图块表中再生图块，请使用图块集编辑器顶部的三个垂直点菜单按钮，然后选择 **在不透明纹理区域创建图块** ：
zh_tw: 請注意，更改紋理邊距，間距和區域大小都有可能會導致圖塊丟失（其中一些將位於合集圖片的座標之外）。如要自動從 TileSheet 再生圖塊，請使用圖塊集編輯器頂部的三個垂直點功能表按鈕，然後選擇 **在非透明紋理區域中建立圖塊** ：

source: Recreating tiles automatically after changing atlas properties
de: Automatische Neuerstellung von Tiles nach Änderung von Atlas-Propertys
zh_cn: 在修改图集属性后自动重新创建图块
zh_tw: 在修改合集屬性後自動重新建立圖塊

source: Using a collection of scenes
de: Verwendung einer Sammlung von Szenen
zh_cn: 使用场景合集
zh_tw: 使用場景合集

source: Since Godot 4.0, you can place actual *scenes* as tiles. This allows you to use any collection of nodes as a tile. For example, you could use scene tiles to place gameplay elements, such as shops the player may be able to interact with. You could also use scene tiles to place AudioStreamPlayer2Ds (for ambient sounds), particle effects, and more.
de: Seit Godot 4.0 können Sie tatsächliche *Szenen* als Tiles platzieren. So können Sie jede Sammlung von Nodes als Tile verwenden. Sie können zum Beispiel Szenen-Tiles verwenden, um Gameplay-Elemente zu platzieren, wie z. B. Geschäfte, mit denen der Spieler interagieren kann. Sie können Szenen-Tiles auch verwenden, um AudioStreamPlayer2Ds (für Umgebungsgeräusche), Partikeleffekte und mehr zu platzieren.
zh_cn: 自 Godot 4.0 以来，你可以将实际的 *场景* 放置为图块。这允许你将任何节点集合用作图块。比如说，你可以使用场景图块来放置游戏元素，例如玩家可以与之互动的商店。还可以使用场景图块来放置 AudioStreamPlayer2D （用于环境声音）、粒子效果等。
zh_tw: 自 Godot 4.0 以來，您可以將實際的 *場景* 放置為圖塊。這允許您將任何節點集合用作圖塊。比如說，您可以使用場景圖塊來放置遊戲元素，例如玩家可以與之互動的商店。還可以使用場景圖塊來放置 AudioStreamPlayer2D （用於環境聲音）、粒子效果等。

source: Scene tiles come with a greater performance overhead compared to atlases, as every scene is instanced individually for every placed tile.
de: Szenen-Tiles sind im Vergleich zu Atlassen mit einem größeren Performance-Overhead verbunden, da jede Szene einzeln für jedes platzierte Tile instanziiert wird.
zh_cn: 与图集相比，场景图块具有更大的性能开销，因为每个场景都是为每个放置的图块单独实例化的。
zh_tw: 與合集相比，場景圖塊具有更大的性能開銷，因為每個場景都是為每個放置的圖塊單獨產生實體的。

source: It's recommended to use only scene tiles when necessary. To draw sprites in a tile without any kind of advanced manipulation, :ref:`use atlases instead <doc_creating_tilesets_using_tilesheet>`.
de: Es wird empfohlen, nur Szenen-Tiles zu verwenden, wenn es nötig ist. Um Sprites in einer Tile ohne irgendeine Art von fortgeschrittener Manipulation zu zeichnen, :ref:`verwenden Sie stattdessen Atlasse <doc_creating_tilesets_using_tilesheet>`.
zh_cn: 建议仅在必要时使用场景图块。要在没有任何高级操作的图块中绘制精灵，\ :ref:`请使用图集代替 <doc_creating_tilesets_using_tilesheet>`\ 。
zh_tw: 建議僅在必要時使用場景圖塊。要在沒有任何高級操作的圖塊中繪製精靈，:ref:`請使用合集代替 <doc_creating_tilesets_using_tilesheet>`。

source: For this example, we'll create a scene containing a CPUParticles2D root node. Save this scene to a scene file (separate from the scene containing the TileMap), then switch to the scene containing the TileMap node. Open the TileSet editor, and create a new **Scenes Collection** in the left column:
de: Für dieses Beispiel erstellen wir eine Szene, die einen CPUParticles2D Root-Node enthält. Speichern Sie diese Szene in einer Szenendatei (getrennt von der Szene mit der TileMap) und wechseln Sie dann zu der Szene, die den TileMap-Node enthält. Öffnen Sie den TileSet-Editor und erstellen Sie eine neue **Szenensammlung** in der linken Spalte:
zh_cn: 对于本例，我们将创建一个包含 CPUParticles2D 根节点的场景。将此场景保存到场景文件（与包含 TileMap 的场景分离），然后切换到包含 TileMap 节点的场景。打开 TileSet 编辑器，在左列中创建一个新的 **场景集合** ：
zh_tw: 對於本例，我們將建立一個包含 CPUParticles2D 根節點的場景。將此場景保存到場景檔（與包含 TileMap 的場景分離），然後切換到包含 TileMap 節點的場景。打開 TileSet 編輯器，在左列中建立一個新的 **場景集合** ：

source: Creating a scenes collection in the TileSet editor
de: Erstellen einer Szenensammlung im TileSet-Editor
zh_cn: 在 TileSet 编辑器中创建场景合集
zh_tw: 使用程式碼來連接訊號

source: After creating a scenes collection, you can enter a descriptive name for the scenes collection in the middle column if you wish. Select this scenes collection then create a new scene slot:
de: Nachdem Sie eine Szenensammlung erstellt haben, können Sie in der mittleren Spalte einen beschreibenden Namen für die Szenensammlung eingeben, wenn Sie möchten. Wählen Sie diese Szenensammlung aus und erstellen Sie einen neuen Szenen-Slot:
zh_cn: 创建场景合集之后，你就可以根据自己的需要在中间栏内为场景合集输入描述名称。选中这个场景合集，然后创建一个新的场景槽：
zh_tw: 建立場景合集之後，你就可以根據自己的需要在中間欄內為場景合集輸入描述名稱。選中這個場景合集，然後建立一個新的場景槽：

source: Creating a scene tile after selecting the scenes collection in the TileSet editor
de: Erstellen einer Tile nach Auswahl der Szenensammlung im TileSet-Editor
zh_cn: 在 TileSet 编辑器中选中场景合集，然后创建场景图块
zh_tw: 在 TileSet 編輯器中選中場景合集，然後建立場景圖塊
