Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilemaps.po
Languages: de, zh_cn, zh_tw

source: While in Paint mode, you can draw a line by holding :kbd:`Shift` *before* holding down the left mouse button, then dragging the mouse to the line's end point. This is identical to using the Line tool described below.
de: Im Malmodus können Sie eine Linie zeichnen, indem Sie :kbd:`Umschalt` halten, bevor Sie die linke Maustaste gedrückt halten, und dann die Maus zum Endpunkt der Linie ziehen. Dies ist identisch mit der Verwendung des unten beschriebenen Linienwerkzeugs.
zh_cn: 在绘制模式下，可以在按住鼠标左键\ *之前*\ 按住 :kbd:`Shift`\ ，然后将鼠标拖动到线的终点来绘制一条线。这与使用下面描述的线条工具相同。
zh_tw: 在「繪畫」模式下，您可以在按住滑鼠左鍵之前按住 Shift 來繪製一條線，然後將滑鼠拖曳到線的終點。這與使用下面描述的直線工具相同。

source: You can also draw a rectangle by holding :kbd:`Ctrl` and :kbd:`Shift` *before* holding down the left mouse button, then dragging the mouse to the rectangle's end point. This is identical to using the Rectangle tool described below.
de: Sie können ein Rechteck auch zeichnen, indem Sie :kbd:`Strg` und :kbd:`Umschalt` gedrückt halten, bevor Sie die linke Maustaste drücken, und dann die Maus zum Endpunkt des Rechtecks ziehen. Dies ist identisch mit der Verwendung des unten beschriebenen Rechteckwerkzeugs.
zh_cn: 你还可以在按下鼠标左键\ *之前*\ ，按住 :kbd:`Ctrl` 和 :kbd:`Shift` 键，然后拖动鼠标到矩形的终点，以此来绘制一个矩形。这与下面描述的矩形工具有异曲同工之妙。
zh_tw: 您也可以按住 :kbd:`Ctrl` 和 :kbd:`Shift` *之前*按住滑鼠左鍵，然後將滑鼠拖曳到矩形的端點來繪製矩形。這與使用下面描述的矩形工具相同。

source: Lastly, you can pick existing tiles in the 2D editor by holding :kbd:`Ctrl` then clicking on a tile (or holding and dragging the mouse). This will switch the currently painted tile(s) to the tile(s) you've just clicked. This is identical to using the Picker tool described below.
de: Schließlich können Sie im 2D-Editor vorhandene Tiles auswählen, indem Sie :kbd:`Strg` halten und dann auf eine Tile klicken (oder die Maus halten und ziehen). Dadurch werden die aktuell gemalten Tiles durch die Tiles ersetzt, die Sie gerade angeklickt haben. Dies ist identisch mit der Verwendung des unten beschriebenen Picker-Werkzeugs.
zh_cn: 最后，可以在 2D 编辑器中按住 :kbd:`Ctrl` 键，然后点击一个图块，来选取现有的图块（或者按住不松并拖动鼠标）。这将把当前涂装的图块切换到你刚刚点击的图块。这与下面描述的 Picker 工具有相同的作用。
zh_tw: 最後，您可以透過按住 Ctrl 然後點擊圖塊（或按住並拖曳滑鼠）來選擇 2D 編輯器中的現有圖塊。這會將目前繪製的圖塊切換為您剛剛點擊的圖塊。這與使用下面描述的選擇器工具相同。

source: Line
de: Linie
zh_cn: 线段
zh_tw: 線段

source: After selecting Line Paint mode, you can draw in a line that is always 1 tile thick (no matter its orientation).
de: Wenn Sie den Linienmalmodus ausgewählt haben, können Sie eine Linie zeichnen, die immer 1 Tile breit ist (unabhängig von ihrer Ausrichtung).
zh_cn: 在选择线条涂鸦模式之后，你可以绘制线条，线条始终为1个图块厚（与线条的方向无关）。
zh_tw: 選擇「線條繪製」模式後，您可以繪製始終為 1 格粗的線條（無論其方向為何）。

source: If you right-click while in Line Paint mode, you will erase in a line.
de: Wenn Sie im Linienmalmodus mit der rechten Maustaste klicken, können Sie in einer Linie löschen.
zh_cn: 如果在“Line Paint”模式下单击鼠标右键，则将在直线中进行擦除。
zh_tw: 如果您在「線條繪製」模式下按一下滑鼠右鍵，則會清除一條線條。

source: If you have selected multiple tiles in the TileMap or using the Selection tool, you can place them in a repeating pattern across the line.
de: Wenn Sie mehrere Tiles in der TileMap oder mit dem Auswahlwerkzeug ausgewählt haben, können Sie diese in einem sich wiederholenden Muster auf der Linie platzieren.
zh_cn: 如果在 TileMap 中或使用“选择”工具选择了多个图块，你可以将它们以重复图案的形式放置在一条直线上。
zh_tw: 如果您在 TileMap 中或使用選取工具選擇了多個圖塊，則可以將它們放置在一條線上的重複圖案中。

source: You can toggle this mode temporarily while in Paint or Eraser mode by holding :kbd:`Shift` then drawing.
de: Sie können diesen Modus vorübergehend ein- oder ausschalten, wenn Sie sich im Mal- oder Radiergummimodus befinden, indem Sie :kbd:`Umschalt` halten und dann zeichnen.
zh_cn: 你可以在绘画或橡皮擦模式下按住 :kbd:`Shift` 键然后绘制来临时切换此模式。
zh_tw: 在「繪畫」或「橡皮擦」模式下，您可以按住 Shift 鍵然後繪圖來暫時切換此模式。

source: Using the line tool after selecting two tiles to draw platforms diagonally
de: Mit dem Linienwerkzeug nach Auswahl zweier Tiles Plattformen diagonal zeichnen
zh_cn: 在选择两个图块后，使用线条工具来绘制斜向平台
zh_tw: 選擇兩個圖塊後使用線條工具對角繪製平台

source: Rectangle
de: Rechteck
zh_cn: 矩形
zh_tw: 反正切

source: After selecting Rectangle Paint mode, you can draw in an axis-aligned rectangle.
de: Wenn Sie den Rechtecksmalmodus ausgewählt haben, können Sie ein achsenparalleles Rechteck zeichnen.
zh_cn: 选择“矩形绘制”模式后，可以绘制轴对齐的矩形。
zh_tw: 選擇矩形繪製模式後，您可以繪製軸對齊的矩形。

source: If you right-click while in Rectangle Paint mode, you will erase in an axis-aligned rectangle.
de: Wenn Sie mit der rechten Maustaste klicken, während Sie sich im Rechteckmalmodus befinden, löschen Sie in einem achsenparallelen Rechteck.
zh_cn: 如果在“矩形绘制”模式下单击鼠标右键，将在轴对齐的矩形中进行擦除。
zh_tw: 如果在「矩形繪製」模式下按滑鼠右鍵，則會清除軸對齊的矩形。

source: If you have selected multiple tiles in the TileMap or using the Selection tool, you can place them in a repeating pattern within the rectangle.
de: Wenn Sie mehrere Tiles in der TileMap oder mit dem Auswahlwerkzeug ausgewählt haben, können Sie diese in einem sich wiederholenden Muster innerhalb des Rechtecks platzieren.
zh_cn: 如果在 TileMap 中或使用“选择”工具选择了多个图块，则可以将它们放置在矩形内的重复图案中。
zh_tw: 如果您在 TileMap 中或使用選取工具選擇了多個圖塊，則可以將它們放置在矩形內的重複圖案中。

source: You can toggle this mode temporarily while in Paint or Eraser mode by holding :kbd:`Ctrl` and :kbd:`Shift` then drawing.
de: Sie können diesen Modus im Mal- oder Radiermodus vorübergehend ein- und ausschalten, indem Sie :kbd:`Strg` und :kbd:`Umschalt` gedrückt halten und dann zeichnen.
zh_cn: 在“绘制”或“橡皮擦”模式下，你可以通过按住 :kbd:`Ctrl` 和 :kbd:` Shift ` 然后绘图来临时切换此模式。
zh_tw: 您可以在「繪畫」或「橡皮擦」模式下暫時切換此模式，方法是按住 Ctrl 和 Shift 然後繪圖。

source: Bucket Fill
de: Fülleimer
zh_cn: 油漆桶填充
zh_tw: 油漆桶填滿

source: After selecting Bucket Fill mode, you can choose whether painting should be limited to contiguous areas only by toggling the **Contiguous** checkbox that appears on the right of the toolbar.
de: Nachdem Sie den Füllmodus ausgewählt haben, können Sie festlegen, ob das Malen auf zusammenhängende Bereiche beschränkt werden soll, indem Sie das Kontrollkästchen **Zusammenhängend** aktivieren, das rechts in der Toolbar erscheint.
zh_cn: 选择“油漆桶填充”模式后，可以通过切换工具栏右侧的\ **连续**\ 复选框来选择是否仅将绘画限制在连续区域。
zh_tw: 選擇「桶填滿」模式後，您可以透過切換工具列右側顯示的「**連續**」複選框來選擇是否僅將繪畫限制在連續區域。

source: If you enable **Contiguous** (the default), only matching tiles that touch the current selection will be replaced. This contiguous check is performed horizontally and vertically, but *not* diagonally.
de: Wenn Sie **Zusammenhängend** aktivieren (die Default-Einstellung), werden nur übereinstimmende Tiles, die an die aktuelle Auswahl angrenzen, ersetzt. Diese Prüfung auf Zusammenhang wird horizontal und vertikal durchgeführt, aber *nicht* diagonal.
zh_cn: 如果启用\ **连续**\ （默认启用），则只会替换与当前选择相匹配的图块。这种连续检查是水平和垂直执行的，但\ *不是*\ 对角执行的。
zh_tw: 如果啟用**連續**（預設設定），則僅取代接觸目前選擇的符合圖塊。這種連續檢查是水平和垂直執行的，但*不是*對角執行。

source: If you disable **Contiguous**, all tiles with the same ID in the entire TileMap will be replaced by the currently selected tile. If selecting an empty tile with **Contiguous** unchecked, all tiles in the rectangle that encompasses the TileMap's effective area will be replaced instead.
de: Wenn Sie **Zusammenhängend** deaktivieren, werden alle Tiles mit der gleichen ID in der gesamten TileMap durch die aktuell ausgewählte Tile ersetzt. Wenn Sie eine leere Tile auswählen und **Zusammenhängend** nicht aktiviert ist, werden stattdessen alle Tiles in dem Rechteck ersetzt, das den effektiven Bereich der TileMap umschließt.
zh_cn: 如果禁用\ **连续**\ ，则整个 TileMap 中具有相同 ID 的所有图块都将被当前选定的图块。如果在未选中\ **连续**\ 的情况下选择一个空图块，则包含图块有效区域的矩形中的所有图块都将被替换。
zh_tw: 如果停用**連續**，則整個 TileMap 中具有相同 ID 的所有圖塊都會被目前選定的圖塊取代。如果選擇未選取「連續」的空白圖塊，則包含 TileMap 有效區域的矩形中的所有圖塊都會被取代。

source: If you right-click while in Bucket Fill mode, you will replace matching tiles with empty tiles.
de: Wenn Sie im Füllmodus mit der rechten Maustaste klicken, werden entsprechende Tiles durch leere Tiles ersetzt.
zh_cn: 如果在油漆桶填充模式下单击鼠标右键，则会将匹配的图块替换为空图块。
zh_tw: 如果您在「桶填滿」模式下按一下滑鼠右鍵，則會將相符的圖塊替換為空圖塊。

source: If you have selected multiple tiles in the TileMap or using the Selection tool, you can place them in a repeating pattern within the filled area.
de: Wenn Sie mehrere Tiles in der TileMap oder mit dem Auswahlwerkzeug ausgewählt haben, können Sie diese in einem sich wiederholenden Muster innerhalb des gefüllten Bereichs platzieren.
zh_cn: 如果在TileMap中或使用“选择”工具选择了多个图块，则可以将它们放置在填充区域内的重复图案中。
zh_tw: 如果您在 TileMap 中或使用選取工具選擇了多個圖塊，則可以將它們放置在填滿區域內的重複圖案中。

source: Using the Bucket Fill tool
de: Verwenden des Füll-Tools
zh_cn: 使用“油漆桶填充”工具
zh_tw: 建立內容

source: Picker
de: Pipette
zh_cn: 拾取器
zh_tw: 顏色

source: After selecting Picker mode, you can pick existing tiles in the 2D editor by holding :kbd:`Ctrl` then clicking on a tile. This will switch the currently painted tile to the tile you've just clicked. You can also pick multiple tiles at once by holding down the left mouse button and forming a rectangle selection. Only non-empty tiles can be picked.
de: Nachdem Sie den Pipetten-Modus ausgewählt haben, können Sie im 2D-Editor vorhandene Tiles auswählen, indem Sie :kbd:`Strg` gedrückt halten und dann auf eine Tile klicken. Dadurch wird die aktuell gemalte Tile durch die Tile ersetzt, auf die Sie gerade geklickt haben. Sie können auch mehrere Tiles auf einmal auswählen, indem Sie die linke Maustaste gedrückt halten und eine rechteckige Auswahl ausführen. Es können nur nicht leere Tiles ausgewählt werden.
zh_cn: 在选择“拾取器”模式后，你可以通过按住 :kbd:`Ctrl` 并点击一个图块来选择 2D 编辑器中的现有图块。这将把当前绘制的图块切换到你刚刚点击的图块。你还可以通过按住左鼠标按钮并形成矩形选择来一次选择多个图块。只能选择非空图块。
zh_tw: 選擇選取器模式後，您可以按住 Ctrl 然後按一下圖塊來在 2D 編輯器中選取現有圖塊。這會將目前繪製的圖塊切換為您剛剛點擊的圖塊。您也可以按住滑鼠左鍵並形成一個矩形選取範圍來一次選取多個圖塊。只能挑選非空的磁磚。

source: You can toggle this mode temporarily while in Paint mode by holding :kbd:`Ctrl` then clicking or dragging the mouse.
de: Sie können diesen Modus im Malmodus vorübergehend ein- und ausschalten, indem Sie :kbd:`Strg` halten und dann mit der Maus klicken oder ziehen.
zh_cn: 在“绘制”模式下，你可以通过按住 :kbd:`Ctrl` 然后单击或拖动鼠标来临时切换此模式。
zh_tw: 在繪畫模式下，您可以按住 Ctrl 然後點擊或拖曳滑鼠來暫時切換此模式。

source: Eraser
de: Radierer
zh_cn: 橡皮
zh_tw: 橡皮擦

source: This mode is combined with any other painting mode (Paint, Line, Rectangle, Bucket Fill). When eraser mode is enabled, tiles will be replaced by empty tiles instead of drawing new lines when left-clicking.
de: Dieser Modus wird mit jedem anderen Malmodus (Malen, Linie, Rechteck, Füllung) kombiniert. Wenn der Radierer-Modus aktiviert ist, werden Tiles durch leere Tiles ersetzt, anstatt neue Linien zu zeichnen, wenn Sie mit der linken Maustaste klicken.
zh_cn: 此模式可与任何其他绘制模式（“绘制”“直线”“矩形”“油漆桶填充”）组合使用。启用橡皮擦模式时，左键单击时，图块将被空图块替换，而不是绘制新线。
zh_tw: 此模式可與任何其他繪畫模式（繪畫、線條、矩形、桶填充）結合使用。啟用橡皮擦模式後，左鍵點擊時圖塊將被空圖塊替換，而不是繪製新線。

source: You can toggle this mode temporarily while in any other mode by right-clicking instead of left-clicking.
de: Sie können diesen Modus vorübergehend ein- und ausschalten, während Sie sich in einem anderen Modus befinden, indem Sie mit der rechten Maustaste anstelle der linken Maustaste klicken.
zh_cn: 你可以在任何其他模式下通过右键而不是左键来临时切换此模式。
zh_tw: 在任何其他模式下，您可以透過右鍵單擊（而不是左鍵單擊）暫時切換此模式。

source: Painting randomly using scattering
de: Zufälliges Malen mit Streuung
zh_cn: 使用散布随机绘图
zh_tw: 建立內容

source: While painting, you can optionally enable *randomization*. When enabled, a random tile will be chosen between all the currently selected tiles when painting. This is supported with the Paint, Line, Rectangle and Bucket Fill tools. For effective paint randomization, you must select multiple tiles in the TileMap editor or use scattering (both approaches can be combined).
de: Beim Malen können Sie optional die *Randomisierung* aktivieren. Wenn diese Option aktiviert ist, wird beim Malen eine zufällige Tile unter allen aktuell ausgewählten Tiles ausgewählt. Dies wird von den Tools Malen, Linie, Rechteck und Füllen unterstützt. Für eine effektive Randomisierung müssen Sie mehrere Tiles im TileMap-Editor auswählen oder Streuung verwenden (beide Ansätze können kombiniert werden).
zh_cn: 绘制时，可以选择启用 *随机化（randomization）* 。启用后，绘制时将在当前选定的所有图块之间选择一个随机图块。“绘制（Paint）”、“直线（Line）”、“矩形（Rectangle）”、“油漆桶填充（Bucket Fill)”工具都支持此操作。为了有效地进行绘制随机化，必须在 TileMap 编辑器中选择多个图块或使用散布（两种方法可以组合使用）。
zh_tw: 繪畫時，您可以選擇啟用*隨機化*。啟用後，繪畫時將在所有目前選定的圖塊中隨機選擇一個圖塊。繪畫、線條、矩形和桶填充工具支援此功能。為了實作有效的繪圖隨機化，您必須在 TileMap 編輯器中選擇多個圖塊或使用散射（可以組合使用兩種方法）。

source: If **Scattering** is set to a value greater than 0, there is a chance that no tile will be placed when painting. This can be used to add occasional, non-repeating detail to large areas (such as adding grass or crumbs on a large top-down TileMap).
de: Wenn **Streuung** auf einen Wert größer als 0 gesetzt wird, besteht die Möglichkeit, dass beim Malen keine Tile platziert werden. Dies kann verwendet werden, um sporadische, sich nicht wiederholende Details zu großen Bereichen hinzuzufügen (z. B. Gras oder Krümel auf einer großen TileMap in Draufsicht).
zh_cn: 如果将\ **散布**\ 设置为大于 0 的值，则绘制时可能不会放置图块。这可以用于向大区域添加偶尔的、不重复的细节（例如在大型俯视角 TileMap 上添加草或碎屑）。
zh_tw: 如果**Scattering**設定為大於0的值，則繪製時有可能不會放置圖塊。這可用於為大區域新增偶爾的、非重複的細節（例如在大型自上而下的 TileMap 上新增草或麵包屑）。

source: Example when using Paint mode:
de: Beispiel bei Verwendung des Malmodus:
zh_cn: 使用“绘图”模式的示例：
zh_tw: 使用 4 核心的例子：

source: Selecting from several times to randomly choose, then painting by holding down the left mouse button
de: Auswahl aus mehreren Tiles nach dem Zufallsprinzip, dann Malen mit gedrückter linker Maustaste
zh_cn: 从几次中随机选择，然后按住鼠标左键进行绘制
zh_tw: 多次選擇隨機選擇，然後按住滑鼠左鍵繪畫

source: Example when using Bucket Fill mode:
de: Beispiel für die Verwendung des Füllmodus:
zh_cn: 使用“油漆桶填充”模式的示例：
zh_tw: 使用“桶填充”模式時的範例：

source: Using Bucket Fill tool with a single tile, but with randomization and scattering enabled
de: Verwendung des Füll-Tools mit einer einzelnen Tile, aber mit aktivierter Randomisierung und Streuung
zh_cn: 将“油漆桶填充”工具与单个图块一起使用，但启用了随机化和散布
zh_tw: 使用帶有單一圖塊的“桶填充”工具，但啟用了隨機化和散射

source: Eraser mode does not take randomization and scattering into account. All tiles within the selection are always removed.
de: Der Radierer-Modus berücksichtigt keine Randomisierung und Streuung. Es werden immer alle Kacheln innerhalb der Auswahl entfernt.
zh_cn: 橡皮擦模式不考虑随机化和散射。选择范围内的所有图块始终被删除。
zh_tw: 橡皮擦模式不考慮隨機化和散射。選擇範圍內的所有圖塊總是會被刪除。

source: Saving and loading premade tile placements using patterns
de: Speichern und Laden von vorgefertigten Kachelplatzierungen unter Verwendung von Mustern
zh_cn: 使用模式保存和加载预制的图块放置
zh_tw: 使用圖案保存和加載預製圖塊放置

source: While you can copy and paste tiles while in Select mode, you may wish to save premade *patterns* of tiles to place together in a go. This can be done on a per-TileMap basis by choosing the **Patterns** tab of the TileMap editor.
de: Während Sie im Auswahlmodus Tiles kopieren und einfügen können, möchten Sie vielleicht vorgefertigte *Muster* von Tiles speichern, um sie in einem Durchgang zusammenzufügen. Dies ist für jede einzelne Tile möglich, indem Sie den Tab **Muster** des TileMap-Editors wählen.
zh_cn: 当你可以在选择模式下复制和粘贴图块时，你可能希望保存图块的预制图案，以便一次放置在一起。这可以在每个 TileMap 的基础上通过选择 TileMap 编辑器的\ **图案**\ 选项卡来完成。
zh_tw: 雖然您可以在選擇模式下複製和貼上圖塊，但您可能想要保存預製的圖塊「圖案」以便立即放置在一起。這可以透過選擇 TileMap 編輯器的 **Patterns** 分頁在每個 TileMap 的基礎上完成。

source: To create a new pattern, switch to Select mode, perform a selection and press :kbd:`Ctrl + C`. Click on empty space within the Patterns tab (a blue focus rectangle should appear around the empty space), then press :kbd:`Ctrl + V`:
de: Um ein neues Muster zu erstellen, wechseln Sie in den Auswahlmodus, führen Sie eine Auswahl durch und drücken Sie :kbd:`Strg + C`. Klicken Sie auf eine leere Stelle im "Muster"-Tab (um die leere Stelle sollte ein blaues Fokusrechteck erscheinen) und drücken Sie dann :kbd:`Strg + V`:
zh_cn: 要创建新模式，请切换到“选择”模式，执行选择并按 :kbd:`Ctrl+C`\ 。单击“图案”选项卡中的空白区域（空白区域周围应出现一个蓝色焦点矩形），然后按 :kbd:`Ctrl+V`\ ：
zh_tw: 若要建立新圖案，請切換到選擇模式，執行選擇並按 :kbd:`Ctrl + C`。按一下「圖案」標籤中的空白區域（空白區域周圍應出現藍色焦點矩形），然後按 :kbd:`Ctrl + V`：

source: Creating a new pattern from a selection in the TileMap editor
de: Erstellen eines neuen Musters aus einer Auswahl im TileMap-Editor
zh_cn: 从 TileMap 编辑器中的选择创建新图案
zh_tw: 從 TileMap 編輯器中的選擇建立新圖案

source: To use an existing pattern, click its image in the **Patterns** tab, switch to any painting mode, then left-click somewhere in the 2D editor:
de: Um ein vorhandenes Muster zu verwenden, klicken Sie auf dessen Bild im **Muster**-Tab, wechseln Sie in einen beliebigen Malmodus und klicken Sie dann mit der linken Maustaste irgendwo im 2D-Editor:
zh_cn: 要使用现有图案，请在\ **图案**\ 选项卡中单击其图像，切换到任何绘画模式，然后在 2D 编辑器中的某个位置左键单击：
zh_tw: 若要使用現有圖案，請在 **Patterns** 標籤中按一下其影像，切換至任何繪畫模式，然後左鍵按一下 2D 編輯器中的某處：

source: Placing an existing pattern using the TileMap editor
de: Platzieren eines vorhandenen Musters mit dem TileMap-Editor
zh_cn: 使用 TileMap 编辑器放置现有图案
zh_tw: 使用 TileMap 編輯器放置現有圖案

source: Like multi-tile selections, patterns will be repeated if used with the Line, Rectangle or Bucket Fill painting modes.
de: Wie bei der Auswahl von mehreren Tiles werden die Muster wiederholt, wenn sie mit den Malmodi Linie, Rechteck oder Füllung verwendet werden.
zh_cn: 与多图块选择一样，如果与“绘制（Paint）”“直线（Line）”“矩形（Rectangle）”“油漆桶填充（Bucket Fill)”绘画模式一起使用，图案将重复。
zh_tw: 與多圖塊選擇一樣，如果與線條、矩形或桶填充繪畫模式一起使用，圖案將重複。

source: Despite being edited in the TileMap editor, patterns are stored in the TileSet resource. This allows reusing patterns in different TileMap nodes after loading a TileSet resource saved to an external file.
de: Obwohl sie im TileMap-Editor bearbeitet werden, werden die Muster in der TileSet-Ressource gespeichert. Dies ermöglicht die Wiederverwendung von Mustern in verschiedenen TileMap-Nodes nach dem Laden einer TileSet-Ressource, die in einer externen Datei gespeichert wurde.
zh_cn: 尽管在TileMap编辑器中进行了编辑，但模式仍存储在TileSet资源中。这允许在加载保存到外部文件的TileSet资源后，在不同的TileMap节点中重新使用该模式。
zh_tw: 儘管在 TileMap 編輯器中進行編輯，模式仍儲存在 TileSet 資源中。這允許在載入儲存到外部檔案的 TileSet 資源後重複使用不同 TileMap 節點中的模式。

source: Handling tile connections automatically using terrains
de: Automatische Handhabung von Tile-Verbindungen durch Terrains
zh_cn: 自动处理地形的图块连接
zh_tw: 使用地形自動處理圖塊連接

source: To use terrains, the TileMap node must feature at least one terrain set and a terrain within this terrain set. See :ref:`doc_using_tilesets_creating_terrain_sets` if you haven't created a terrain set for the TileSet yet.
de: Um Terrains zu verwenden, muss der TileMap-Node mindestens ein Terrain-Set und ein Terrain innerhalb dieses Terrain-Sets enthalten. Siehe :ref:`doc_using_tilesets_creating_terrain_sets` wenn Sie noch kein Terrain-Set für das TileSet erstellt haben.
zh_cn: 要使用地形，TileMap 节点必须至少包含一个地形集和该地形集中的一个地形。如果尚未为 TileSet 创建地形集，请参考 :ref:`doc_using_tilesets_creating_terrain_sets`\ 。
zh_tw: 要使用地形，TileMap 節點必須至少具有一個地形集以及該地形集中的一個地形。如果您還沒有為 TileSet 建立地形集，請參閱 doc_using_tilesets_creating_terrain_sets`。

source: There are 3 kinds of painting modes available for terrain connections:
de: Es gibt 3 Arten von Malmodi, die für Terrainverbindungen zur Verfügung stehen:
zh_cn: 地形连接有 3 种绘图模式可选：
zh_tw: 有四種可用於取得設定的巨集：

source: **Connect**, where tiles are connected to surrounding tiles on the same TileMap layer.
de: **Verbinden**, bei dem Tiles mit umliegenden Tiles auf derselben TileMap-Ebene verbunden werden.
zh_cn: **连接**\ ，图块会与相同 TileMap 图层上的相邻图块连接。
zh_tw: **連接**，其中圖塊連接到同一 TileMap 圖層上的周圍圖塊。

source: **Path**, where tiles are connected to tiles painted in the same stroke (until the mouse button is released).
de: **Pfad**, bei dem Tiles mit den Tiles verbunden sind, die im selben Zug gemalt wurden (bis die Maustaste losgelassen wird).
zh_cn: **路径**\ ，图块会与相同笔画绘制出的图块相连（直到松开鼠标按键）。
zh_tw: **路徑**，圖塊連接到以同一筆劃繪製的圖塊（直到釋放滑鼠按鈕）。

source: Tile-specific overrides to resolve conflicts or handle situations not covered by the terrain system.
de: Tile-spezifische Überschreibungen zur Lösung von Konflikten oder zur Behandlung von Situationen, die nicht durch das Terrainsystem abgedeckt sind.
zh_cn: 图块特定的覆盖以解决冲突或处理地形系统未涵盖的情况。
zh_tw: 特定於圖塊的覆蓋可解決衝突或處理地形系統未覆蓋的情況。

source: The Connect mode is easier to use, but Path is more flexible as it allows for more artist control during painting. For instance, Path can allow roads to be directly adjacent to each other without being connected to each other, while Connect will force both roads to be connected.
de: Der Modus "Verbinden" ist einfacher zu verwenden, aber "Pfad" ist flexibler, da er dem Designer mehr Kontrolle beim Malen ermöglicht. Bei "Pfad" können beispielsweise Straßen direkt nebeneinander liegen, ohne miteinander verbunden zu sein, während bei "Verbinden" beide Straßen verbunden sein müssen.
zh_cn: “连接”模式更容易使用，但“路径”更灵活，因为它允许艺术家在绘制过程中进行更多控制。例如，“路径”可以让道路直接相邻而不相互连接，而“连接”则会强制两条道路相连。
zh_tw: 連接模式更容易使用，但路徑更靈活，因為它允許藝術家在繪畫過程中進行更多控制。例如，Path 可以允許道路直接相鄰而不相互連接，而 Connect 將強制連接兩條道路。

source: Selecting Connect mode in the TileMap editor's Terrains tab
de: Auswahl des Verbindungsmodus im Terrains-Tab des TileMap-Editors
zh_cn: 在 TileMap 编辑器的“地形”选项卡中选择“连接”模式
zh_tw: 在 TileMap 編輯器的 Terrains 標籤中選擇 Connect 模式

source: Selecting Path mode in the TileMap editor's Terrains tab
de: Auswahl des Pfadmodus auf dem Terrains-Tab des TileMap-Editors
zh_cn: 在 TileMap 编辑器的“地形”选项卡中选择“路径”模式
zh_tw: 在 TileMap 編輯器的 Terrains 標籤中選擇 Path 模式

source: Lastly, you can select specific tiles from the terrain to resolve conflicts in certain situations:
de: Schließlich können Sie bestimmte Tiles auf dem Terrain auswählen, um in bestimmten Situationen Konflikte zu lösen:
zh_cn: 最后，在某些情况下，你可以从地形中选择特定的图块来解决冲突：
zh_tw: 最後，您可以從地形中選擇特定的圖塊來解決某些情況下的衝突：

source: Painting with specific tiles in the TileMap editor's Terrains tab
de: Malen mit bestimmten Tiles im TileMap-Editor auf dem Terrains-Tab
zh_cn: 在 TileMap 编辑器的“地形”选项卡中绘制特定图块
zh_tw: 在 TileMap 編輯器的 Terrains 標籤中使用特定圖塊進行繪畫

source: Any tile that has at least one of its bits set to a value set to the corresponding terrain ID will appear in the list of tiles to choose from.
de: Jede Tile, bei der mindestens eines ihrer Bits auf einen Wert der entsprechenden Terrain-ID gesetzt ist, erscheint in der Liste der Tiles, aus denen man wählen kann.
zh_cn: 任何至少有一个位（bit）设置为对应地形 ID 的值的图块将出现在可供选择的图块列表中。
zh_tw: 任何至少有一個位元設定為對應地形 ID 的值的圖塊將出現在可供選擇的圖塊列表中。

source: Handling missing tiles
de: Umgang mit fehlenden Tiles
zh_cn: 处理缺失图块
zh_tw: 翻譯現有頁面

source: If you remove tiles in the TileSet that are referenced in a TileMap, the TileMap will display a placeholder to indicate that an invalid tile ID is placed:
de: Wenn Sie Tiles im TileSet entfernen, die in einer TileMap referenziert werden, zeigt die TileMap einen Platzhalter an, um darauf hinzuweisen, dass eine ungültige Tile-ID platziert ist:
zh_cn: 如果删除 TileMap 所引用 TileSet 中的图块，TileMap 将显示一个占位符，表示放置的图块 ID 无效：
zh_tw: 如果您刪除 TileMap 中引用的 TileSet 中的圖塊，TileMap 將顯示一個佔位符以指示放置了無效的圖塊 ID：

source: Missing tiles in the TileMap editor due to the TileSet reference being broken
de: Fehlende Tiles im TileMap-Editor, falls die TileSet-Referenz defekt ist
zh_cn: 由于 TileSet 引用被破坏，导致 TileMap 编辑器中的图块丢失
zh_tw: 由於 TileSet 引用被破壞，TileMap 編輯器中缺少圖塊

source: These placeholders are **not** visible in the running project, but the tile data is still persisted to disk. This allows you to safely close and reopen such scenes. Once you re-add a tile with the matching ID, the tiles will appear with the new tile's appearance.
de: Diese Platzhalter sind im laufenden Projekt **nicht** sichtbar, aber die Tile-Daten werden weiterhin auf der Festplatte gespeichert. So können Sie solche Szenen sicher schließen und wieder öffnen. Sobald Sie eine Tile mit der passenden ID wieder hinzufügen, erscheinen die Tiles mit dem Aussehen der neuen Tile.
zh_cn: 这些占位符在运行的项目中\ **不可见**\ ，但图块数据仍会持久保存在磁盘中。这样你就可以安全地关闭和重新打开此类场景。重新添加具有匹配 ID 的图块后，图块将以新图块的外观出现。
zh_tw: 這些佔位符在正在運作的專案中**不**可見，但圖塊資料仍保留在磁碟上。這使您可以安全地關閉和重新開啟此類場景。一旦您重新新增具有配對 ID 的圖塊，圖塊就會以新圖塊的外觀出現。

source: Missing tile placeholders may not be visible until you select the TileMap node and open the TileMap editor.
de: Fehlende Tile-Platzhalter werden möglicherweise erst sichtbar, wenn Sie den TileMap-Node auswählen und den TileMap-Editor öffnen.
zh_cn: 在你选择 TileMap 节点并打开 TileMap 编辑器之前，可能无法看到缺失的图块占位符。
zh_tw: 在選擇 TileMap 節點並開啟 TileMap 編輯器之前，遺失的圖塊佔位符可能不可見。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
