Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_first_3d_shader.po
Languages: de, es, zh_tw

source: Your first 3D shader
de: Ihr erster 3D-Shader
es: Tu primer shader 3D
zh_tw: 第一個遊戲

source: You have decided to start writing your own custom Spatial shader. Maybe you saw a cool trick online that was done with shaders, or you have found that the :ref:`StandardMaterial3D <class_StandardMaterial3D>` isn't quite meeting your needs. Either way, you have decided to write your own and now you need to figure out where to start.
de: Sie haben sich entschlossen, Ihren eigenen Spatial-Shader zu schreiben. Vielleicht haben Sie im Internet einen coolen Trick gesehen, der mit Shadern gemacht wurde, oder Sie haben festgestellt, dass das :ref:`StandardMaterial3D <class_StandardMaterial3D>` Ihren Bedürfnissen nicht ganz gerecht wird. In jedem Fall haben Sie beschlossen, Ihr eigenes Material zu schreiben, und jetzt müssen Sie herausfinden, wo Sie anfangen sollen.
zh_tw: 你已經決定開始編寫一個自訂 Spatial 著色器。或許你在網上看到一個很酷的著色器技巧，或許你發現 :ref:`SpatialMaterial <class_SpatialMaterial>` 並不能完全滿足你的需求。總之，你決定寫一個自己的，你想弄清楚從哪裡開始。

source: This tutorial will explain how to write a Spatial shader and will cover more topics than the :ref:`CanvasItem <doc_your_first_canvasitem_shader>` tutorial.
de: Dieses Tutorial erklärt, wie Spatial-Shader erstellt werden und gehen mehr ins Detail als :ref:`CanvasItem <doc_your_first_canvasitem_shader>`.
es: Este tutorial explicará cómo escribir un Spatial shader y cubrirá más temas que el tutorial :ref:`CanvasItem <doc_your_first_canvasitem_shader>`.
zh_tw: 這個教學將說明如何編寫空間著色器, 並將涵蓋比 :ref:`CanvasItem <doc_your_first_canvasitem_shader>` 更多的主題.

source: Spatial shaders have more built-in functionality than CanvasItem shaders. The expectation with spatial shaders is that Godot has already provided the functionality for common use cases and all the user needs to do in the shader is set the proper parameters. This is especially true for a PBR (physically based rendering) workflow.
de: Spatial-Shader verfügen über mehr Built-in-Funktionen als CanvasItem-Shader. Bei räumlichen Shadern wird erwartet, dass Godot bereits die Funktionalität für allgemeine Anwendungsfälle besitzt und der Benutzer im Shader lediglich die richtigen Parameter festlegen muss. Dies gilt insbesondere für einen PBR (Physical Based Rendering)-Workflow.
es: Los Spatial shaders tienen más funcionalidad incorporada que los shaders CanvasItem. Lo que se espera de los shaders espaciales es que Godot ya ha proporcionado la funcionalidad para los casos de uso común y todo lo que el usuario necesita hacer en el shader es establecer los parámetros adecuados. Esto es especialmente cierto para un flujo de trabajo de PBR (renderización basada en la física).
zh_tw: 空間著色器比CanvasItem著色器有更多的內建功能. 對空間著色器的期望是:Godot為常見的用例提供了功能, 使用者僅需在著色器中設定適當的參數. 這對於PBR(基於物理的算繪)工作流來說尤其如此.

source: This is a two-part tutorial. In this first part we will create terrain using vertex displacement from a heightmap in the vertex function. In the :ref:`second part <doc_your_second_spatial_shader>` we will take the concepts from this tutorial and set up custom materials in a fragment shader by writing an ocean water shader.
de: Dies ist ein zweiteiliges Tutorial. In diesem ersten Teil werden wir Terrain mit Vertex-Displacement aus einer Heightmap in der Vertex-Funktion erstellen. Im :ref:`zweiten Teil <doc_your_second_spatial_shader>` werden wir die Konzepte aus diesem Tutorial übernehmen und benutzerdefinierte Materialien in einem Fragment-Shader einrichten, indem wir einen Meerwasser-Shader schreiben.
zh_tw: 這是一個兩部分的教學. 在第一部分中, 我們將學習如何在頂點函式中使用高度圖的頂點位移來製作一個簡單的地形. 在 :ref:`第二部分 <doc_your_second_spatial_shader>` 中, 我們將採用本教學中的概念, 通過編寫一個海洋水著色器, 講解如何在片段著色器中設定自訂材質.

source: This tutorial assumes some basic shader knowledge such as types (``vec2``, ``float``, ``sampler2D``), and functions. If you are uncomfortable with these concepts it is best to get a gentle introduction from `The Book of Shaders <https://thebookofshaders.com>`_ before completing this tutorial.
de: Dieses Tutorial setzt einige grundlegende Shader-Kenntnisse wie Typen (``vec2``, ``float``, ``sampler2D``) und Funktionen voraus. Wenn Sie mit diesen Konzepten nicht vertraut sind, ist es am besten, sich sanfte Einführung über `The Book of Shaders <https://thebookofshaders.com>`_ zu verschaffen, bevor Sie dieses Tutorial beenden.
es: Este tutorial asume algunos conocimientos básicos de shader como los tipos (``vec2``, ``float``, ``sampler2D``), y las funciones. Si te sientes incómodo con estos conceptos es mejor obtener una introducción suave de `The Book of Shaders <https://thebookofshaders.com>`_ antes de completar este tutorial.
zh_tw: 這個教學假定你對著色器有一些基本的瞭解, 例如型別( ``vec2`` , ``float`` , ``sampler2D`` ), 和函式. 如果你對這些概念摸不著頭腦, 那麼你在完成這個教學之前, 最好先從 `著色器之書 <https://thebookofshaders.com/?lan=ch>` 獲取一些基本知識.

source: Where to assign my material
de: Wo kann ich mein Material zuordnen?
es: Dónde asignar mi material
zh_tw: 在何處設定材質

source: In 3D, objects are drawn using :ref:`Meshes <class_Mesh>`. Meshes are a resource type that store geometry (the shape of your object) and materials (the color and how the object reacts to light) in units called "surfaces". A Mesh can have multiple surfaces, or just one. Typically, you would import a mesh from another program (e.g. Blender). But Godot also has a few :ref:`PrimitiveMeshes <class_primitivemesh>` that allow you to add basic geometry to a scene without importing Meshes.
de: In 3D werden Objekte mit :ref:`Meshes <class_Mesh>` gezeichnet. Meshes sind ein Ressourcentyp, der Geometrie (die Form des Objekts) und Materialien (die Farbe und wie das Objekt auf Licht reagiert) in Einheiten speichert, die "Oberflächen" genannt werden. Ein Mesh kann mehrere Oberflächen haben oder auch nur eine. Normalerweise importiert man ein Mesh aus einem anderen Programm (z.B. Blender). Aber Godot hat auch ein paar :ref:`PrimitiveMeshes <class_primitivemesh>`, mit denen man einer Szene grundlegende Geometrie hinzufügen kann, ohne Meshes zu importieren.
es: En 3D, los objetos se dibujan usando :ref:`Meshes <class_Mesh>`. Las mallas son un tipo de recurso que almacena la geometría (la forma de su objeto) y los materiales (el color y cómo el objeto reacciona a la luz) en unidades llamadas "superficies". Una Malla puede tener múltiples superficies, o sólo una. Típicamente, importarías una malla de otro programa (por ejemplo, Blender). Pero Godot también tiene unos cuantos :ref:`PrimitiveMeshes <class_primitivemesh>` que te permiten añadir geometría básica a una escena sin importar las Mallas.
zh_tw: 在3D中, 物件是使用 :ref:`Meshes <class_Mesh>` 繪製的.Mesh是一種資源型別, 它以 "表面(surface)" 為單位儲存幾何體(物件的形狀)和材質(對象的顏色和對光線的反應). 一個Mesh可以有多個表面, 也可以只有一個. 通常情況下, 你會從另一個程式(如Blender)匯入一個Mesh. 但是Godot也有一些 :ref:`PrimitiveMeshes <class_primitivemesh>` 允許你在不匯入Mesh的情況下為場景新增基本幾何體.

source: There are multiple node types that you can use to draw a mesh. The main one is :ref:`MeshInstance3D <class_MeshInstance3D>`, but you can also use :ref:`GPUParticles3D <class_GPUParticles3D>`, :ref:`MultiMeshes <class_MultiMesh>` (with a :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`), or others.
de: Es gibt mehrere Node-Typen, die Sie zum Zeichnen eines Meshs verwenden können. Der wichtigste ist :ref:`MeshInstance3D <class_MeshInstance3D>`, aber man kann auch :ref:`GPUParticles3D <class_GPUParticles3D>`, :ref:`MultiMeshes <class_MultiMesh>` (mit einem :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`), oder andere verwenden.
zh_tw: 你可以使用多種節點型別可以用來繪製Mesh. 主要的是 :ref:`MeshInstance <class_meshinstance>`, 但你也可以使用 :ref:`Particles <class_particles>`, :ref:`MultiMeshes <class_MultiMesh>` (與 :ref:`MultiMeshInstance <class_multimeshinstance>` 一起使用), 或其他.

source: Typically, a material is associated with a given surface in a mesh, but some nodes, like MeshInstance3D, allow you to override the material for a specific surface, or for all surfaces.
de: Normalerweise ist ein Material mit einer bestimmten Oberfläche in einem Mesh verbunden, aber einige Nodes, wie MeshInstance3D, ermöglichen es Ihnen, das Material für eine bestimmte Oberfläche oder für alle Oberflächen zu überschreiben.
zh_tw: 通常情況下, 一個材質是與Mesh中的一個給定表面相關聯的, 但有些節點, 如MeshInstance, 允許你覆蓋一個特定的表面或所有表面的材質.

source: If you set a material on the surface or mesh itself, then all MeshInstance3Ds that share that mesh will share that material. However, if you want to reuse the same mesh across multiple mesh instances, but have different materials for each instance then you should set the material on the MeshInstance3D.
de: Wenn Sie ein Material auf der Oberfläche oder dem Mesh selbst festlegen, wird dieses Material von allen MeshInstance3Ds, die dieses Mesh verwenden, übernommen. Wenn Sie jedoch dasselbe Mesh in mehreren Mesh-Instanzen wiederverwenden möchten, aber unterschiedliche Materialien für jede Instanz haben, sollten Sie das Material auf der MeshInstance3D festlegen.
zh_tw: 如果你在表面或Mesh本身上設定了材質, 那麼所有共用該Mesh的MeshInstance都共用該材質. 但是, 如果你想在多個Mesh實例中重用同一個Mesh, 但每個實例具有不同的材質, 那麼你應該在Meshinstance上設定材質.

source: For this tutorial we will set our material on the mesh itself rather than taking advantage of the MeshInstance3D's ability to override materials.
de: Für dieses Tutorial werden wir unser Material auf das Mesh selbst setzen, anstatt die Fähigkeit von MeshInstance3D zu nutzen, Materialien zu überschreiben.
zh_tw: 在本教學中, 我們將材質設定在Mesh自身上, 不使用MeshInstance覆蓋材質的功能.

source: Setting up
de: Einrichtung
es: Configurando
zh_tw: 設定

source: Add a new :ref:`MeshInstance3D <class_MeshInstance3D>` node to your scene.
de: Fügen Sie einen neuen :ref:`MeshInstance3D <class_MeshInstance3D>`-Node zu Ihrer Szene hinzu.
zh_tw: 向場景新增一個新的 :ref:`MeshInstance <class_meshinstance>` 節點.

source: In the inspector tab beside "Mesh" click "[empty]" and select "New PlaneMesh". Then click on the image of a plane that appears.
de: Klicken Sie im Inspektor-Tab neben "Mesh" auf "[leer]" und wählen Sie "Neu: PlaneMesh". Dann klicken Sie auf das Bild einer Ebene, die erscheint.
es: En la pestaña del inspector al lado de "Mesh" haga clic en "[empty]" y seleccione "New PlaneMesh". Luego haga clic en la imagen de un avión que aparece.
zh_tw: 在屬性面板分頁中，點擊“Mesh”旁邊的“[空]”，然後選擇“新建 PlaneMesh”。然後點擊出現的平面的圖像。

source: This adds a :ref:`PlaneMesh <class_planemesh>` to our scene.
de: Dies fügt ein :ref:`PlaneMesh <class_planemesh>` zu unserer Szene hinzu.
es: Esto agrega un :ref:`PlaneMesh <class_planemesh>` a nuestra escena.
zh_tw: 這會在場景中新增一個 :ref:`PlaneMesh <class_planemesh>` .

source: Then, in the viewport, click in the upper left corner on the button that says "Perspective". A menu will appear. In the middle of the menu are options for how to display the scene. Select 'Display Wireframe'.
de: Klicken Sie dann im Viewport in der oberen linken Ecke auf den Button "Perspective". Ein Menü wird angezeigt. In der Mitte des Menüs finden Sie Optionen für die Darstellung der Szene. Wählen Sie "Drahtgitter anzeigen".
es: Luego, en el viewport, haga clic en la esquina superior izquierda en el botón que dice "Perspectiva". Aparecerá un menú. En el medio del menú hay opciones para mostrar la escena. Selecciona 'Display Wireframe'.
zh_tw: 然後，在視圖中，按一下左上角的“透視”按鈕。會出現一個功能表，在功能表中間找到如何顯示場景的選項。選擇“顯示線框”。

source: This will allow you to see the triangles making up the plane.
de: So können Sie die Dreiecke sehen, aus denen die Ebene besteht.
es: Esto te permitirá ver los triángulos que componen el avión.
zh_tw: 這將允許您查看構成平面的三角形.

source: Now set ``Subdivide Width`` and ``Subdivide Depth`` of the :ref:`PlaneMesh <class_planemesh>` to ``32``.
de: Setzen Sie nun ``Unterteilungsbreite`` und ``Unterteilungstiefe`` des :ref:`PlaneMesh <class_planemesh>` auf ``32``.
zh_tw: 現在將 ``Subdivide Width`` 和 ``Subdivide Depth`` 設定為 ``32`` .

source: You can see that there are now many more triangles in the :ref:`MeshInstance3D<class_MeshInstance3D>`. This will give us more vertices to work with and thus allow us to add more detail.
de: Sie können sehen, dass es jetzt viel mehr Dreiecke in der :ref:`MeshInstance3D<class_MeshInstance3D>` gibt. Dadurch haben wir mehr Vertices, mit denen wir arbeiten können, und können somit mehr Details hinzufügen.
zh_tw: 可以看到現在 :ref:`Mesh<class_MeshInstance>` 中有了更多的三角形. 這將為我們提供更多頂點, 便於新增更多細節.

source: :ref:`PrimitiveMeshes <class_primitivemesh>`, like PlaneMesh, only have one surface, so instead of an array of materials there is only one. Click beside "Material" where it says "[empty]" and select "New ShaderMaterial". Then click the sphere that appears.
de: :ref:`PrimitiveMeshes <class_primitivemesh>`, wie PlaneMesh, haben nur eine Oberfläche, so dass es anstelle eines Arrays von Materialien nur eines gibt. Klicken Sie neben "Material", wo "[leer]" steht, und wählen Sie "Neu: ShaderMaterial". Klicken Sie dann auf die Kugel, die erscheint.
zh_tw: 表面，因此也僅有一個材質而非材質陣列。點擊“Material”旁邊的“[空]”，然後選擇“新建 ShaderMaterial”。然後點擊出現的球體。

source: Now click beside "Shader" where it says "[empty]" and select "New Shader".
de: Klicken Sie nun neben "Shader" auf die Stelle, wo "[leer]" steht, und wählen Sie "Neuer Shader".
es: Ahora haz clic al lado de "Shader" donde dice "[empty]" y selecciona "New Shader".
zh_tw: 現在點擊“Shader”旁邊寫著“[空]”的地方，選擇“新建 Shader”。

source: The shader editor should now pop up and you are ready to begin writing your first Spatial shader!
de: Der Shader-Editor sollte nun erscheinen und alles ist bereit um Ihren ersten Spatial-Shader zu schreiben!
es: El editor shader debería aparecer ahora y estás listo para empezar a escribir tu primer shader Espacial!
zh_tw: 現在將彈出一個著色器編輯器, 你已經準備好編寫你的第一個空間著色器了！

source: Shader magic
de: Shader-Magie
es: Magia Shader
zh_tw: 著色器魔術

source: The new shader is already generated with a ``shader_type`` variable and the ``fragment()`` function. The first thing Godot shaders need is a declaration of what type of shader they are. In this case the ``shader_type`` is set to ``spatial`` because this is a spatial shader.
de: Der neue Shader wird bereits mit einer ``shader_type``-Variablen und der ``fragment()``-Funktion erzeugt. Das erste, was Godot-Shader brauchen, ist eine Deklaration, welcher Typ von Shader sie sind. In diesem Fall ist der ``shader_type`` auf ``spatial`` gesetzt, da dies ein räumlicher Shader ist.
zh_tw: 注意到已經出現錯誤了嗎？ 這是因為著色器編輯器會自動重新載入著色器. Godot著色器首先需要宣告它們是什麼型別的著色器. 因此, 我們將變數 ``shader_type`` 設定為 ``spatial`` , 因為它是一個空間著色器.

source: For now ignore the ``fragment()`` function and define the ``vertex()`` function. The ``vertex()`` function determines where the vertices of your :ref:`MeshInstance3D<class_MeshInstance3D>` appear in the final scene. We will be using it to offset the height of each vertex and make our flat plane appear like a little terrain.
de: Für den Moment ignorieren Sie die ``fragment()``-Funktion und definieren die ``vertex()`` Funktion. Die ``vertex()``-Funktion bestimmt, wo die Vertices Ihrer :ref:`MeshInstance3D<class_MeshInstance3D>` in der endgültigen Szene erscheinen. Wir werden sie benutzen, um die Höhe jedes Vertex zu verschieben und unsere flache Ebene wie ein kleines Terrain erscheinen zu lassen.
zh_tw: 接下來我們將定義 ``vertex()`` 函式. ``vertex()`` 函式決定你的 :ref:`Mesh<class_MeshInstance>` 在最終場景中的頂點位置. 我們用它來偏移每個頂點的高度, 使我們的平面看起來像一個小地形.

source: We define the vertex shader like so:
de: Wir definieren den Vertex-Shader wie folgt:
es: Definimos el shader de vértices así:
zh_tw: 我們像這樣定義頂點著色器:

source: With nothing in the ``vertex()`` function, Godot will use its default vertex shader. We can easily start to make changes by adding a single line:
de: Wenn die Funktion ``vertex()`` nichts enthält, wird Godot seinen Default-Vertex-Shader verwenden. Wir können leicht damit beginnen, Änderungen vorzunehmen, indem wir eine einzige Zeile hinzufügen:
es: Sin nada en la función ``vertex()``, Godot usará su shader de vértices por defecto. Podemos empezar a hacer cambios fácilmente añadiendo una sola línea:
zh_tw: 在 ``vertex()`` 函式中沒有任何內容,Godot將使用其預設的頂點著色器. 我們可以簡單地通過新增一行進行更改:

source: Adding this line, you should get an image like the one below.
de: Wenn Sie diese Zeile hinzufügen, sollten Sie ein Bild wie das folgende erhalten.
es: Añadiendo esta línea, deberías obtener una imagen como la de abajo.
zh_tw: 新增此行後, 你應該會得到類似下方的圖像.

source: Okay, let's unpack this. The ``y`` value of the ``VERTEX`` is being increased. And we are passing the ``x`` and ``z`` components of the ``VERTEX`` as arguments to ``cos`` and ``sin``; that gives us a wave-like appearance across the ``x`` and ``z`` axes.
de: Okay, packen wir das mal aus. Der ``y``-Wert des ``VERTEX`` wird erhöht. Und wir geben die ``x``- und ``z``-Komponenten der ``VERTEX`` als Argumente an ``cos`` und ``sin`` weiter; das gibt uns ein wellenförmiges Aussehen über die ``x``- und ``z``-Achsen.
es: Bien, vamos a desempacar esto. El valor ``y`` del ``VERTEX`` se está incrementando. Y estamos pasando los componentes ``x`` y ``z`` del ``VERTEX`` como argumentos para ``cos`` y ``sin``; eso nos da una apariencia de onda a través de los ejes ``x`` y ``z``.
zh_tw: 好, 我們來解讀一下. ``VERTEX`` 的 ``y`` 值正在增加. 我們將 ``VERTEX`` 的 ``x`` 和 ``z`` 分量作為參數傳遞給 ``cos`` 和 ``sin`` ；這樣就得到了在 ``x`` 和 ``z`` 軸上呈現出波浪狀的圖像.

source: What we want to achieve is the look of little hills; after all. ``cos`` and ``sin`` already look kind of like hills. We do so by scaling the inputs to the ``cos`` and ``sin`` functions.
de: Was wir schließlich erreichen wollen, ist das Aussehen von kleinen Hügeln. ``cos`` und ``sin`` sehen ja schon irgendwie wie Hügel aus. Wir tun dies, indem wir die Eingaben für die Funktionen ``cos`` und ``sin`` skalieren.
es: Lo que queremos lograr es el aspecto de pequeñas colinas; después de todo. ``cos`` y ``sin`` ya se parecen a las colinas. Lo hacemos escalando las entradas a las funciones ``cos`` y ``sin``.
zh_tw: 我們想要實作的是小山丘的外觀. 而 ``cos`` 和 ``sin`` 已經有點像山丘了. 我們便可以通過縮放 ``cos`` 和 ``sin`` 函式的輸入來實作.

source: This looks better, but it is still too spiky and repetitive, let's make it a little more interesting.
de: Das sieht besser aus, aber es ist immer noch zu stachelig und repetitiv, wir sollten es etwas interessanter gestalten.
es: Esto se ve mejor, pero sigue siendo demasiado puntiagudo y repetitivo, hagámoslo un poco más interesante.
zh_tw: 看起來效果好了一些, 但它仍然過於尖銳和重複, 讓我們把它變得更有趣一點.

source: Noise heightmap
de: Rausch-Höhenkarte
es: Mapa de altura con ruido
zh_tw: 雜訊高度圖

source: Noise is a very popular tool for faking the look of terrain. Think of it as similar to the cosine function where you have repeating hills except, with noise, each hill has a different height.
de: Rauschen ist ein sehr beliebtes Mittel, um das Aussehen eines Geländes vorzutäuschen. Stellen Sie es sich ähnlich wie die Kosinusfunktion vor, bei der Sie sich wiederholende Hügel haben, mit dem Unterschied, dass bei Rauschen jeder Hügel eine andere Höhe hat.
es: Noise(Ruido) es una herramienta muy popular para fingir el aspecto del terreno. Piense en ello como en la función del coseno, donde tiene colinas que se repiten, excepto que, con el ruido, cada colina tiene una altura diferente.
zh_tw: 雜訊是一種非常流行的偽造地形的工具. 可以認為它和餘弦函式一樣生成重複的小山, 只是在雜訊的影響下每個小山都擁有不同的高度.

source: Godot provides the :ref:`NoiseTexture2D <class_noisetexture2D>` resource for generating a noise texture that can be accessed from a shader.
de: Godot stellt die Ressource :ref:`NoiseTexture2D <class_noisetexture2D>` zur Verfügung, um eine Geräuschtextur zu erzeugen, auf die von einem Shader aus zugegriffen werden kann.
zh_tw: Godot提供了 :ref:`雜訊紋理 <class_noisetexture>` 資源, 可以生成從著色器存取的雜訊紋理.

source: To access a texture in a shader add the following code near the top of your shader, outside the ``vertex()`` function.
de: Um auf eine Textur in einem Shader zuzugreifen, fügen Sie den folgenden Code am Anfang Ihres Shaders ein, außerhalb der ``vertex()`` Funktion.
es: Para acceder a una textura en un shader agregue el siguiente código cerca de la parte superior de su shader, fuera de la función ``vertex()``.
zh_tw: 要在著色器中存取紋理，請在著色器頂部附近、``vertex()`` 函式外部新增以下程式碼。

source: This will allow you to send a noise texture to the shader. Now look in the inspector under your material. You should see a section called "Shader Params". If you open it up, you'll see a section called "noise".
de: Dies ermöglicht es Ihnen, eine Rauschtextur an den Shader zu senden. Schauen Sie nun im Inspektor unter Ihrem Material nach. Sie sollten einen Abschnitt namens "Shader-Params" sehen. Wenn Sie diesen öffnen, sehen Sie einen Abschnitt namens "Rauschen".
es: Esto te permitirá enviar una textura de ruido al shader. Ahora mira en el inspector debajo de tu material. Deberías ver una sección llamada "Shader Params". Si la abres, verás una sección llamada "noise".
zh_tw: 你可以用它將雜訊紋理發送給著色器。現在看看屬性面板中的材質。你應該會看到一個名為“Shader Params”（著色器參數）的區域。如果展開該區域，就會看到一個叫“noise”的部分。

source: Click beside it where it says "[empty]" and select "New NoiseTexture2D". Then in your :ref:`NoiseTexture2D <class_noisetexture2D>` click beside where it says "Noise" and select "New FastNoiseLite".
de: Klicken Sie daneben, wo "[leer]" steht, und wählen Sie "Neu: NoiseTexture2D". Dann klicken Sie in Ihrem :ref:`NoiseTexture2D <class_noisetexture2D>` auf die Stelle, an der "Rauschen" steht, und wählen Sie "Neu: FastNoiseLite".
zh_tw: 點擊旁邊寫著“[空]”的地方，選擇“新建 NoiseTexture”。在你的 NoiseTexture 中，點擊旁邊的“Noise”，然後選擇“新建 OpenSimplexNoise”。

source: :ref:`FastNoiseLite <class_fastnoiselite>` is used by the NoiseTexture2D to generate a heightmap.
de: :ref:`FastNoiseLite <class_fastnoiselite>` wird von der NoiseTexture2D verwendet, um eine Höhenkarte zu erzeugen.
es: :ref:`FastNoiseLite <class_fastnoiselite>` es utilizado por NoiseTexture2D para generar un heightmap (mapa de altura).
zh_tw: NoiseTexture2D 使用 :ref:`FastNoiseLite <class_fastnoiselite>` 來生成高度圖。

source: Once you set it up and should look like this.
de: Sobald Sie es eingerichtet haben und so aussehen sollten.
es: Una vez que esté todo configurado, debería verse así.
zh_tw: 設定好後, 看起來應該像這樣.

source: Now, access the noise texture using the ``texture()`` function. ``texture()`` takes a texture as the first argument and a ``vec2`` for the position on the texture as the second argument. We use the ``x`` and ``z`` channels of ``VERTEX`` to determine where on the texture to look up. Note that the PlaneMesh coordinates are within the [-1,1] range (for a size of 2), while the texture coordinates are within [0,1], so to normalize we divide by the size of the PlaneMesh by 2.0 and add 0.5. ``texture()`` returns a ``vec4`` of the ``r, g, b, a`` channels at the position. Since the noise texture is grayscale, all of the values are the same, so we can use any one of the channels as the height. In this case we'll use the ``r``, or ``x`` channel.
de: Greifen Sie nun mit der Funktion ``texture()`` auf die Rauschtextur zu. Die Funktion ``texture()`` nimmt eine Textur als erstes Argument und ein ``vec2`` für die Position auf der Textur als zweites Argument. Wir benutzen die ``x`` und ``z``-Kanäle von ``VERTEX``, um zu bestimmen, wo auf der Textur nachgeschaut werden soll. Beachten Sie, dass die Koordinaten des PlaneMesh im Bereich [-1,1] liegen (bei einer Größe von 2), während die Koordinaten der Textur im Bereich [0,1] liegen, so dass wir zur Normalisierung die Größe des PlaneMesh durch 2,0 teilen und 0,5 addieren. ``Textur()`` gibt eine ``Vec4`` der ``r, g, b, a`` Kanäle an der Position zurück. Da die Rauschtextur Graustufen hat, sind alle Werte gleich, so dass wir jeden der Kanäle als Höhe verwenden können. In diesem Fall verwenden wir den ``r``- oder ``x``-Kanal.
zh_tw: 現在, 使用 ``texture()`` 函式獲取雜訊紋理. ``texture()`` 將一個紋理作為第一個參數, 將在紋理上的位置 ``vec2`` 作為第二個參數. 我們用 ``VERTEX`` 的 ``x`` 和 ``z`` 通道來確定在紋理上的位置. 請注意 PlaneMesh 座標在 [-1,1] 範圍內 (大小為 2的情況下), 而紋理座標在 [0,1] 範圍內, 所以為了規範化, 我們將PlaneMesh的大小除以2.0並加上 0.5. ``texture()`` 返回一個目前位置 ``r, g, b, a`` 通道的 ``vec4`` . 由於雜訊紋理是灰度的, 所有的值都相同, 所以我們可以使用任意一個通道作為高度. 本例中, 我們將使用 ``r`` , 或者說 ``x`` 通道.
