Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_second_3d_shader.po
Languages: de, zh_tw

source: With this code you should end up with more complex looking waves and all you had to do was add a bit of math!
de: Mit diesem Code sollten Sie komplexer aussehende Wellen erhalten, und alles, was Sie tun mussten, war, ein wenig Mathematik hinzuzufügen!
zh_tw: 有了這段程式碼, 你應該可以得到更複雜的波形, 而你所要做的只是增加一點數學運算！

source: For more information about Spatial shaders read the :ref:`Shading Language <doc_shading_language>` doc and the :ref:`Spatial Shaders <doc_spatial_shader>` doc. Also look at more advanced tutorials in the :ref:`Shading section <toc-learn-features-shading>` and the :ref:`3D <toc-learn-features-3d>` sections.
de: Weitere Informationen zu Spatial-Shadern finden Sie in den Dokumenten :ref:`Shader-Sprache <doc_shading_language>` und :ref:`Spatial-Shader <doc_spatial_shader>`. Weitere fortgeschrittene Anleitungen finden Sie im :ref:`Shading-Abschnitt <toc-learn-features-shading>` und den :ref:`3D <toc-learn-features-3d>`-Abschnitten.
zh_tw: 有關空間著色器的更多資訊, 請閱讀 :ref:`Shading Language <doc_shading_language>` 文件和 :ref:`Spatial Shaders <doc_spatial_shader>` 文件. 也可以看看 :ref:`Shading 部分 <toc-learn-features-shading>` 和 :ref:`3D <toc-learn-features-3d>` 部分的高級教學.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
