Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_first_2d_shader.po
Languages: de, zh_tw

source: Your first 2D shader
de: Ihr erster 2D-Shader
zh_tw: 第一個遊戲

source: Introduction
de: Einführung
zh_tw: 前言

source: Shaders are special programs that execute on the GPU and are used for rendering graphics. All modern rendering is done with shaders. For a more detailed description of what shaders are please see :ref:`What are shaders <doc_introduction_to_shaders>`.
de: Shader sind spezielle Programme, die auf dem Grafikprozessor ausgeführt und zum Rendern von Grafiken verwendet werden. Das gesamte moderne Rendering wird mit Shadern durchgeführt. Eine genauere Beschreibung der Shader finden Sie unter :ref:`Was sind Shader <doc_introduction_to_shaders>`.
zh_tw: 著色器是在 GPU 上運作，用來算繪圖像的一種特殊程式。現代算繪都是通過著色器實作的。若想瞭解關於著色器更詳細的說明，請查看:ref:`著色器是什麼 <doc_introduction_to_shaders>`。

source: This tutorial will focus on the practical aspects of writing shader programs by walking you through the process of writing a shader with both vertex and fragment functions. This tutorial targets absolute beginners to shaders.
de: Dieses Tutorial konzentriert sich auf die praktischen Aspekte der Erstellung von Shader-Programmen, indem es Sie durch den Prozess der Erstellung eines Shaders mit Vertex- und Fragment-Funktionen führt. Dieses Tutorial richtet sich an absolute Anfänger im Bereich Shader.
zh_tw: 本教學將重點介紹實際編寫著色器程式的各個方面, 引導您走過使用頂點和片段函式編寫著色器的整個流程. 本教學面向著色器.

source: If you have experience writing shaders and are just looking for an overview of how shaders work in Godot, see the :ref:`Shading Reference <toc-shading-reference>`.
de: Wenn Sie Erfahrung mit dem Schreiben von Shadern haben und nur einen Überblick über die Funktionsweise von Shadern in Godot suchen, lesen Sie die :ref:`Shading Reference <toc-shading-reference>`.
zh_tw: 如果你在著色器方面有一定的經驗，只是想知道著色器在 Godot 中是如何運作的，請參閱:ref:`著色器參考 <toc-shading-reference>`。

source: Setup
de: Einrichtung
zh_tw: 設定

source: :ref:`CanvasItem shaders <doc_canvas_item_shader>` are used to draw all 2D objects in Godot, while :ref:`Spatial <doc_spatial_shader>` shaders are used to draw all 3D objects.
de: :ref:`CanvasItem-Shader <doc_canvas_item_shader>` werden verwendet, um alle 2D-Objekte in Godot zu zeichnen, während :ref:`Spatial <doc_spatial_shader>`-Shader verwendet werden, um alle 3D-Objekte zu zeichnen.
zh_tw: 對象，而 :ref:`Spatial <doc_spatial_shader>` 著色器則用於繪製所有 3D 物件。

source: In order to use a shader it must be attached inside a :ref:`Material <class_Material>` which must be attached to an object. Materials are a type of :ref:`Resource <doc_resources>`. To draw multiple objects with the same material, the material must be attached to each object.
de: Um einen Shader zu verwenden, muss er innerhalb eines :ref:`Materials <class_Material>` angehängt sein, das wiederum an ein Objekt angehängt sein muss. Materialien sind ein Typ von :ref:`Ressource <doc_resources>`. Um mehrere Objekte mit demselben Material zu zeichnen, muss das Material an jedes Objekt angehängt werden.
zh_tw: 要使用著色器，它必須要被附加到一個 :ref:`Material <class_material>`（材質）上，而這個材質也必須附加在一個物件上。材質是一種 :ref:`Resource <doc_resources>`。若要使用同一材質繪製多個物件，該材質必須附加到每個物件上。

source: All objects derived from a :ref:`CanvasItem <class_CanvasItem>` have a material property. This includes all :ref:`GUI elements <class_Control>`, :ref:`Sprite2Ds <class_Sprite2D>`, :ref:`TileMaps <class_Tilemap>`, :ref:`MeshInstance2Ds <class_MeshInstance2D>` etc. They also have an option to inherit their parent's material. This can be useful if you have a large number of nodes that you want to use the same material.
de: Alle Objekte, die von einem :ref:`CanvasItem <class_CanvasItem>` abgeleitet sind, haben eine Material-Property. Dazu gehören alle :ref:`GUI-Elemente <class_Control>`, :ref:`Sprite2Ds <class_Sprite2D>`, :ref:`TileMaps <class_Tilemap>`, :ref:`MeshInstance2Ds <class_MeshInstance2D>` usw. Sie haben auch die Möglichkeit, das Material ihrer Eltern zu erben. Dies kann nützlich sein, wenn Sie eine große Anzahl von Nodes haben, die das gleiche Material verwenden sollen.
zh_tw: 所有繼承自 :ref:`CanvasItem <class_canvasitem>` 的物件都有一個材質屬性, 這包含所有的 :ref:`GUI 元素 <class_Control>`, :ref:`精靈 <class_sprite>`, :ref:`方塊地圖 <class_tilemap>`, :ref:`2D 網格實例 <class_meshinstance2d>` 等等. 它們同時也可以選擇性地繼承其父類的材質. 如果你有要使用同一材質的很多節點, 這個功能就可以派上用場.

source: To begin, create a Sprite2D node. :ref:`You can use any CanvasItem <doc_custom_drawing_in_2d>`, so long as it is drawing to the canvas, so for this tutorial we will use a Sprite2D, as it is the easiest CanvasItem to start drawing with.
de: Zu Beginn erstellen Sie einen Sprite2D-Node. :ref:`Sie können ein beliebiges CanvasItem <doc_custom_drawing_in_2d>` verwenden, solange es auf den Canvas zeichnet. Für dieses Tutorial werden wir ein Sprite2D verwenden, da es das einfachste CanvasItem ist, um mit dem Zeichnen zu beginnen.
zh_tw: 首先，建立一個 Sprite2D 節點。 :ref:`您可以使用任何 CanvasItem <doc_custom_drawing_in_2d>`，只要它繪製到畫布上即可，因此在本教學中我們將使用 Sprite2D，因為它是最容易開始繪製的 CanvasItem。

source: Next, look down in the Inspector, under the CanvasItem section, click beside "Material" and select "New ShaderMaterial". This creates a new Material resource. Click on the sphere that appears. Godot currently doesn't know whether you are writing a CanvasItem Shader or a Spatial Shader and it previews the output of spatial shaders. So what you are seeing is the output of the default Spatial Shader.
de: Schauen Sie im Inspektor nach unten im Abschnitt CanvasItem, klicken Sie neben "Material" und wählen Sie "Neues ShaderMaterial". Dadurch wird eine neue Materialressource erstellt. Klicken Sie auf die erscheinende Kugel. Godot weiß derzeit nicht, ob Sie einen CanvasItem-Shader oder einen Spatial-Shader schreiben, und zeigt eine Vorschau der Ausgabe von Spatial-Shadern an. Was Sie also sehen, ist die Ausgabe des Default-Spatial-Shaders.
zh_tw: 接下來，在“屬性面板”下的 CanvasItem 部分中，在“Material”旁點擊並選擇“新建 ShaderMaterial”。這會建立一個新的材質資源。然後點擊新出現的球體。Godot 目前還不知道你是要寫 CanvasItem 著色器還是 Spatial 著色器，它顯示 Spatial 著色器的輸出預覽，所以你看到的是預設的 Spatial 著色器的輸出。

source: Click beside "Shader" and select "New Shader". Finally, click on the shader you just created and the shader editor will open. You are now ready to begin writing your first shader.
de: Klicken Sie neben "Shader" und wählen Sie "Neuer Shader". Klicken Sie schließlich auf den soeben erstellten Shader und der Shader-Editor wird geöffnet. Sie können nun mit dem Schreiben Ihres ersten Shaders beginnen.
zh_tw: 點擊“Shader”旁邊的位置並選擇“新建 Shader”。最後，點擊新建立的著色器資源，就會打開著色器編輯器。你現在就已經準備好開始寫你的第一個著色器了。

source: Your first CanvasItem shader
de: Ein erster CanvasItem-Shader
zh_tw: 你的第一個 CanvasItem 著色器

source: In Godot, all shaders start with a line specifying what type of shader they are. It uses the following format:
de: In Godot beginnen alle Shader mit einer Zeile, die angibt, um welche Art von Shader es sich handelt. Dabei wird das folgende Format verwendet:
zh_tw: 在Godot中, 所有的著色器第一行都是指定著色器型別的, 格式如下:

source: Because we are writing a CanvasItem shader, we specify ``canvas_item`` in the first line. All our code will go beneath this declaration.
de: Da wir einen CanvasItem-Shader schreiben, geben wir ``canvas_item`` in der ersten Zeile an. Unser gesamter Code wird unterhalb dieser Deklaration stehen.
zh_tw: 因為我們正在編寫CanvasItem著色器, 所以我們在第一行中指定了 ``canvas_item``. 我們所有的程式碼都會在這個宣告下面.

source: This line tells the engine which built-in variables and functionality to supply you with.
de: Diese Zeile teilt der Engine mit, welche Buit-in-Variablen und -Funktionen Sie bereitstellen soll.
zh_tw: 這一行告訴遊戲引擎要提供你哪些內建變數以及函式.

source: In Godot you can override three functions to control how the shader operates; ``vertex``, ``fragment``, and ``light``. This tutorial will walk you through writing a shader with both vertex and fragment functions. Light functions are significantly more complex than vertex and fragment functions and so will not be covered here.
de: In Godot können Sie drei Funktionen überschreiben, um zu kontrollieren, wie der Shader arbeitet: ``Vertex``, ``Fragment`` und ``Licht``. Dieses Tutorial wird Sie durch das Schreiben eines Shaders mit Vertex- und Fragmentfunktionen führen. Lichtfunktionen sind wesentlich komplexer als Vertex- und Fragmentfunktionen und werden daher hier nicht behandelt.
zh_tw: 在Godot中, 你可以重寫三個函式來控制著色器的運作, 它們是 ``vertex`` (頂點函式), ``fragment`` (片段函式)和 ``light`` (光照函式). 本教學會引導你寫出一個包含頂點和片段函式的著色器. 因為光照函式比另外兩個函式要複雜非常多, 所以在這裡不會進行講解.

source: Your first fragment function
de: Ihre erste Fragmentfunktion
zh_tw: 你的第一個片段函式

source: The fragment function runs for every pixel in a Sprite2D and determines what color that pixel should be.
de: Die Fragment-Funktion wird für jedes Pixel in einem Sprite2D ausgeführt und bestimmt, welche Farbe dieses Pixel haben soll.
zh_tw: 片段函式對精靈中的每個像素進行操作, 並且決定這個像素應該是什麼顏色的.

source: They are restricted to the pixels covered by the Sprite2D, that means you cannot use one to, for example, create an outline around a Sprite2D.
de: Sie sind auf die vom Sprite2D abgedeckten Pixel beschränkt, d.h. man kann sie nicht verwenden, um z.B. einen Umriss um ein Sprite2D zu erstellen.
zh_tw: 它們限制在精靈覆蓋的那些像素中, 這也就意味著, 你無法用片段函式來實作例如在精靈周圍加邊框的事情.

source: The most basic fragment function does nothing except assign a single color to every pixel.
de: Die einfachste Fragmentfunktion tut nichts anderes, als jedem Pixel eine einzelne Farbe zuzuweisen.
zh_tw: 最基礎的片段函式僅僅給每個像素賦予一個顏色.

source: We do so by writing a ``vec4`` to the built-in variable ``COLOR``. ``vec4`` is shorthand for constructing a vector with 4 numbers. For more information about vectors see the :ref:`Vector math tutorial <doc_vector_math>`. ``COLOR`` is both an input variable to the fragment function and the final output from it.
de: Wir tun dies, indem wir einen ``vec4`` in die Built-in-Variable ``COLOR`` schreiben. ``vec4`` ist eine Abkürzung für das Konstruieren eines Vektors mit 4 Zahlen. Für weitere Informationen über Vektoren siehe das :ref:`Vector math tutorial <doc_vector_math>`. ``COLOR`` ist sowohl eine Eingabevariable für die Fragmentfunktion als auch die endgültige Ausgabe der Funktion.
zh_tw: 我們向內建變數 ``COLOR`` 中寫入一個 ``vec4`` 來做到這點. ``vec4`` 是建立一個四維向量的簡寫形式. 若想進一步瞭解向量, 請參閱 :ref:`向量數學教學 <doc_vector_math>`. ``COLOR`` 變數既是片段函式的一個輸入, 同時也是它的最終輸出.

source: Congratulations! You're done. You have successfully written your first shader in Godot.
de: Herzlichen Glückwunsch! Sie sind fertig. Sie haben erfolgreich Ihren ersten Shader in Godot geschrieben.
zh_tw: 恭喜你！你成功在 Godot 中寫出了你的第一個著色器。

source: Now let's make things more complex.
de: Lassen Sie uns die Dinge jetzt komplexer machen.
zh_tw: 接著, 我們來討論更複雜的事情.

source: There are many inputs to the fragment function that you can use for calculating ``COLOR``. ``UV`` is one of them. UV coordinates are specified in your Sprite2D (without you knowing it!) and they tell the shader where to read from textures for each part of the mesh.
de: Es gibt viele Eingaben für die Fragment-Funktion, die Sie für die Berechnung von ``COLOR`` verwenden können. ``UV`` ist einer davon. UV-Koordinaten werden in Ihrem Sprite2D angegeben (ohne dass Sie es wissen!) und sie sagen dem Shader, wo er die Texturen für jeden Teil des Meshes auslesen soll.
zh_tw: 你可以使用片段函式中的很多輸入來計算 ``COLOR``, ``UV`` 就是其中的一個. 你的精靈指定了UV座標(在你不知情的情況下！), 而它們告訴著色器, 對於網格的每個部分從紋理的何處讀取資訊.

source: In the fragment function you can only read from ``UV``, but you can use it in other functions or to assign values to ``COLOR`` directly.
de: In der Fragmentfunktion können Sie nur von ``UV`` lesen, aber Sie können es in anderen Funktionen verwenden oder ``COLOR`` direkt Werte zuweisen.
zh_tw: 在片段函式中你只能從 ``UV`` 中讀取, 但是你可以在其他函式中使用, 或者直接對 ``COLOR`` 賦值.

source: ``UV`` varies between 0-1 from left-right and from top-bottom.
de: ``UV`` variiert zwischen 0-1 von links nach rechts und von oben nach unten.
zh_tw: ``UV`` 取值在0-1之間, 從左到右, 由上到下.

source: Using ``TEXTURE`` built-in
de: Verwenden des ``TEXTURE``-Built-ins
zh_tw: 使用內建變數 ``TEXTURE``

source: Uniform input
de: Uniform-Eingabe
zh_tw: Uniform 輸入

source: Uniform input is used to pass data into a shader that will be the same across the entire shader.
de: Uniform-Eingabe wird verwendet, um Daten in einen Shader zu übertragen, die im gesamten Shader gleich sind.
zh_tw: Uniform 輸入是用來向著色器傳遞資料的，這些資料在整個著色器中都是一致的。

source: You can use uniforms by defining them at the top of your shader like so:
de: Sie können Uniforms verwenden, indem Sie sie oben im Shader wie folgt definieren:
zh_tw: 你可以像這樣通過在著色器頂部定義來使用 Uniform 值：

source: For more information about usage see the :ref:`Shading Language doc <doc_shading_language>`.
de: Weitere Informationen über Godots Shader-Sprache gibt es im eigenen Artikel: :ref:`Shading-Sprach-Dokumentation <doc_shading_language>`.
zh_tw: 用法的更多詳情請參見:ref:`著色語言文件 <doc_shading_language>`。

source: Add a uniform to change the amount of blue in our Sprite2D.
de: Fügen Sie ein Uniform hinzu, um die Menge an Blau in unserem Sprite2D zu ändern.
zh_tw: 新增一個 Uniform 值來改變 Sprite 中藍色量。

source: Now you can change the amount of blue in the Sprite2D from the editor. Look back at the Inspector under where you created your shader. You should see a section called "Shader Param". Unfold that section and you will see the uniform you just declared. If you change the value in the editor, it will overwrite the default value you provided in the shader.
de: Jetzt können Sie den Blauanteil im Sprite2D über den Editor ändern. Schauen Sie im Inspektor unter der Stelle nach, an der Sie Ihren Shader erstellt haben. Sie sollten einen Abschnitt namens "Shader Param" sehen. Klappen Sie diesen Abschnitt auf und Sie werden das Uniform sehen, das Sie gerade deklariert haben. Wenn Sie den Wert im Editor ändern, wird der Defaultwert, den Sie im Shader angegeben haben, überschrieben.
zh_tw: 現在你可以在編輯器中改變Sprite的藍色量. 回頭看看你建立著色器的地方的屬性面板. 你應該看到一個叫做 "Shader Param" 的部分. 展開這個部分, 你會看到你剛剛宣告的Uniform. 如果你在編輯器中改變這個值, 它將覆蓋你在著色器中提供的預設值.

source: Interacting with shaders from code
de: Interaktion mit Shadern aus Code
zh_tw: 程式碼與著色器的互動

source: You can change uniforms from code using the function ``set_shader_parameter()`` which is called on the node's material resource. With a Sprite2D node, the following code can be used to set the ``blue`` uniform.
de: Sie können Uniforms vom Code aus ändern, indem Sie die Funktion ``set_shader_parameter()`` verwenden, die auf der Materialressource des Nodes aufgerufen wird. Bei einem Sprite2D-Node kann der folgende Code verwendet werden, um das ``blaue`` Uniform zu setzen.
zh_tw: 你可以使用在節點的材質資源上呼叫的函式 ``set_shader_param()`` , 從程式碼中改變Uniform. 對於一個Sprite節點, 可以使用下面的程式碼來設定 ``blue`` Uniform.

source: Note that the name of the uniform is a string. The string must match exactly with how it is written in the shader, including spelling and case.
de: Beachten Sie, dass der Name des Uniforms ein String ist. Der String muss genau mit der Schreibweise im Shader übereinstimmen, einschließlich Rechtschreibung und Groß-/Kleinschreibung.
zh_tw: 注意,uniform值的名稱是一個字串. 字串必須與它在著色器中的書寫方式完全配對, 包括拼寫和大小寫.

source: Your first vertex function
de: Ihre erste Vertex Funktion
zh_tw: 你的第一個頂點函式

source: Now that we have a fragment function, let's write a vertex function.
de: Da wir nun eine Fragment-Funktion haben, schreiben wir eine Vertex-Funktion.
zh_tw: 現在我們有了一個片段函式, 我們再寫一個頂點函式.

source: Use the vertex function to calculate where on the screen each vertex should end up.
de: Verwenden Sie die Vertex-Funktion zur Berechnung, wo auf dem Bildschirm jeder Vertex landen soll.
zh_tw: 使用頂點函式計算螢幕上每個頂點的結束位置.

source: The most important variable in the vertex function is ``VERTEX``. Initially, it specifies the vertex coordinates in your model, but you also write to it to determine where to actually draw those vertices. ``VERTEX`` is a ``vec2`` that is initially presented in local-space (i.e. not relative to the camera, viewport, or parent nodes).
de: Die wichtigste Variable in der Vertex-Funktion ist ``VERTEX``. Anfänglich gibt sie die Koordinaten der Vertices in Ihrem Modell an, aber Sie schreiben auch in sie, um zu bestimmen, wo diese Vertices tatsächlich gezeichnet werden sollen. ``VERTEX`` ist eine ``vec2``, die anfänglich im lokalen Raum dargestellt wird (d.h. nicht relativ zur Kamera, dem Viewport oder den übergeordneten Nodes).
zh_tw: 頂點函式中最重要的變數是 ``VERTEX``。它最初指定的是模型中的頂點座標，但你也會通過往裡面寫值來決定把這些頂點畫到哪裡。``VERTEX`` 是一個 ``vec2``，最初使用的是局部空間（即與相機、視口、父節點無關）。

source: You can offset the vertices by directly adding to ``VERTEX``.
de: Sie können die Vertices mit einem Offset verschieben, indem Werte zu ``VERTEX`` addieren.
zh_tw: 您可以通過直接調整 ``VERTEX`` 來偏移頂點。

source: Combined with the ``TIME`` built-in variable, this can be used for basic animation.
de: In Kombination mit der Built-in-Variable ``TIME`` kann diese für einfache Animationen verwendet werden.
zh_tw: 與內建變數 ``TIME`` 相結合，可用於簡單的動畫。

source: Conclusion
de: Fazit
zh_tw: 結論

source: At their core, shaders do what you have seen so far, they compute ``VERTEX`` and ``COLOR``. It is up to you to dream up more complex mathematical strategies for assigning values to those variables.
de: Im Kern tun Shader das, was Sie bisher gesehen haben: Sie berechnen ``VERTEX`` und ``COLOR``. Es liegt an Ihnen, sich komplexere mathematische Strategien für die Zuweisung von Werten zu diesen Variablen auszudenken.
zh_tw: 著色器的核心, 如你所見, 是計算 ``VERTEX`` 和 ``COLOR``. 你可以制定更複雜的數學策略來給這些變數賦值.

source: For inspiration, take a look at some of the more advanced shader tutorials, and look at other sites like `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4>`_ and `The Book of Shaders <https://thebookofshaders.com>`_.
de: Um sich zu inspirieren, schauen Sie sich einige der fortgeschritteneren Shader-Tutorials an, und schauen Sie sich andere Seiten wie `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4>`_ und `The Book of Shaders <https://thebookofshaders.com>`_ an.
zh_tw: 一些更高級的著色器教學可以給你啟發, 如 `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4>`_ 和 `著色器之書 <https://thebookofshaders.com/?lan=ch>`_ .

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
