Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_first_3d_shader.po
Languages: de, es, zh_tw

source: Note: ``xyzw`` is the same as ``rgba`` in GLSL, so instead of ``texture().x`` above, we could use ``texture().r``. See the `OpenGL documentation <https://www.khronos.org/opengl/wiki/Data_Type_(GLSL)#Vectors>`_ for more details.
de: Anmerkung: ``xyzw`` ist dasselbe wie ``rgba`` in GLSL, also könnten wir statt ``texture().x`` oben ``texture().r`` verwenden. Siehe die `OpenGL Dokumentation <https://www.khronos.org/opengl/wiki/Data_Type_(GLSL)#Vectors>`_ für weitere Details.
es: Nota: ``xyzw`` es lo mismo que ``rgba`` en GLSL, así que en lugar de ``texture().x`` arriba, podríamos usar ``texture().r``. Mira la ``Documentación OpenGL <https://www.khronos.org/opengl/wiki/Data_Type_(GLSL)#Vectores>`_ para mayor detalle.
zh_tw: 注意: ``xyzw`` 和GLSL中的 ``rgba`` 是相同的, 所以我們可以用 ``texture().x`` 代替上面的 ``texture().r`` . 詳情請參見 `OpenGL 文件 <https://www.khronos.org/opengl/wiki/Data_Type_(GLSL)#Vectors>`_ .

source: Using this code you can see the texture creates random looking hills.
de: Mit diesem Code können Sie sehen, wie die Textur zufällig aussehende Hügel erzeugt.
es: Usando este código puedes ver que la textura crea colinas de aspecto aleatorio.
zh_tw: 使用此程式碼後, 你可以看到紋理建立了隨機外觀的山峰.

source: Right now it is too spiky, we want to soften the hills a bit. To do that, we will use a uniform. You already used a uniform above to pass in the noise texture, now let's learn how they work.
de: Im Moment ist es zu stachelig, wir wollen die Hügel ein wenig abmildern. Um das zu tun, werden wir ein Uniform verwenden. Sie haben bereits oben ein Uniform verwendet um die Rausch-Textur zu übergeben, jetzt lassen Sie uns lernen, wie sie funktionieren.
es: Ahora mismo es demasiado puntiagudo, queremos suavizar un poco las colinas. Para ello, usaremos un uniforme. Ya usaste un uniforme arriba para pasar la textura del ruido, ahora vamos a aprender cómo funcionan.
zh_tw: 目前它還很尖銳, 我們需要稍微柔化一下山峰. 這將用到uniform值. 你在之前已經使用了uniform 值來傳遞雜訊紋理, 現在讓我們來學習一下其中的工作原理.

source: Uniforms
zh_tw: Uniform

source: Uniform variables allow you to pass data from the game into the shader. They are very useful for controlling shader effects. Uniforms can be almost any datatype that can be used in the shader. To use a uniform, you declare it in your :ref:`Shader<class_Shader>` using the keyword ``uniform``.
de: Uniform-Variablen ermöglichen es Ihnen, Daten aus dem Spiel an den Shader zu übergeben. Sie sind sehr nützlich für die Steuerung von Shader-Effekten. Uniforms können fast jeder Datentyp sein, der im Shader verwendet werden kann. Um ein Uniform zu verwenden, deklariert man es in seinem :ref:`Shader<class_Shader>` mit dem Schlüsselwort ``uniform``.
es: Las variables uniformes permiten pasar datos del juego al shader. Son muy útiles para controlar los efectos shader. Los uniformes pueden ser casi cualquier tipo de dato que se pueda usar en el shader. Para usar un uniforme, lo declaras en tu :ref:`Shader<class_Shader>` usando la palabra clave ``uniform``.
zh_tw: uniform值變數允許你把遊戲的變數傳遞到著色器. 它們對於控制著色器效果非常有用. 幾乎所有在著色器中使用的資料型別都可以作為uniform值. 要使用uniform值, 請在 :ref:`Shader<class_Shader>` 中使用關鍵字 ``uniform`` 宣告它.

source: Let's make a uniform that changes the height of the terrain.
de: Lassen Sie uns ein Uniform herstellen, das die Höhe des Geländes verändert.
es: Hagamos un uniforme que cambie la altura del terreno.
zh_tw: 讓我們做一個改變地形高度的uniform.

source: Godot lets you initialize a uniform with a value; here, ``height_scale`` is set to ``0.5``. You can set uniforms from GDScript by calling the function ``set_shader_parameter()`` on the material corresponding to the shader. The value passed from GDScript takes precedence over the value used to initialize it in the shader.
de: Godot erlaubt es Ihnen, ein Uniform mit einem Wert zu initialisieren; hier ist ``height_scale`` auf ``0.5`` gesetzt. Sie können Uniforms von GDScript aus setzen, indem Sie die Funktion ``set_shader_parameter()`` auf dem Material, das dem Shader entspricht, aufrufen. Der von GDScript übergebene Wert hat Vorrang vor dem Wert, mit dem er im Shader initialisiert wurde.
zh_tw: Godot讓你用一個值來初始化uniform；這裡, ``height_scale`` 被設定為 ``0.5`` . 你可以通過在著色器對應的材質上呼叫函式 ``set_shader_param()`` 來從GDScript設定uniform . 從GDScript傳來的值優先於在著色器中用於初始化的值.

source: Changing uniforms in Spatial-based nodes is different from CanvasItem-based nodes. Here, we set the material inside the PlaneMesh resource. In other mesh resources you may need to first access the material by calling ``surface_get_material()``. While in the MeshInstance3D you would access the material using ``get_surface_material()`` or ``material_override``.
de: Das Ändern von Uniforms in Spatial-basierten Nodes unterscheidet sich von CanvasItem-basierten Nodes. Hier setzen wir das Material innerhalb der PlaneMesh-Ressource. In anderen Mesh-Ressourcen müssen Sie möglicherweise zuerst auf das Material zugreifen, indem Sie ``surface_get_material()`` aufrufen. In der MeshInstance3D würde man auf das Material mit ``get_surface_material()`` oder ``material_override`` zugreifen.
zh_tw: 更改uniform值時, 基於空間的節點與基於CanvasItem的節點使用的方法不同. 在這裡, 我們在PlaneMesh資源內設定材質. 在其他mesh資源中, 你可能要先呼叫 ``surface_get_material()`` 來獲取材質. 而在MeshInstance中, 則是用 ``get_surface_material()`` 或 ``material_override`` 獲取材質.

source: Remember that the string passed into ``set_shader_parameter()`` must match the name of the uniform variable in the :ref:`Shader<class_Shader>`. You can use the uniform variable anywhere inside your :ref:`Shader<class_Shader>`. Here, we will use it to set the height value instead of arbitrarily multiplying by ``0.5``.
de: Denken Sie daran, dass der String, der in ``set_shader_parameter()`` übergeben wird, mit dem Namen der Uniform-Variable im :ref:`Shader<class_Shader>` übereinstimmen muss. Sie können die Uniform-Variable überall in Ihrem :ref:`Shader<class_Shader>` verwenden. Hier werden wir sie benutzen, um den Höhenwert zu setzen, anstatt willkürlich mit ``0.5`` zu multiplizieren.
zh_tw: 請記住, 傳入 ``set_shader_param()`` 的字串必須與 :ref:`Shader<class_Shader>` 中的uniform變數名稱相配對. 你可以在 :ref:`Shader<class_Shader>` 中的任何地方使用這個uniform變數. 在這裡, 我們將用它來設定高度值, 而不是任意地乘以 ``0.5`` .

source: Now it looks much better.
de: Nun sieht es viel besser aus.
es: Ahora se ve mucho mejor.
zh_tw: 現在它看起來好多了.

source: Using uniforms, we can even change the value every frame to animate the height of the terrain. Combined with :ref:`Tweens <class_Tween>`, this can be especially useful for animations.
de: Mit Uniforms können wir den Wert sogar bei jedem Frame ändern, um die Höhe des Geländes zu animieren. In Kombination mit :ref:`Tweens <class_Tween>` kann dies besonders für Animationen nützlich sein.
zh_tw: 使用 uniform，我們甚至可以在每一影格改變數值，以動畫化地形的高度。結合 :ref:`Tween <class_Tween>`，這對簡單的動畫特別有用。

source: Interacting with light
de: Mit Licht interagieren
es: Interactuar con la luz
zh_tw: 與光互動

source: First, turn wireframe off. To do so, click in the upper-left of the Viewport again, where it says "Perspective", and select "Display Normal".
de: Schalten Sie zunächst die Drahtgitterdarstellung aus. Klicken Sie dazu erneut oben links im Ansichtsfenster, wo "Perspektive" steht, und wählen Sie "Normalen anzeigen".
es: Primero, apaga el marco de alambre. Para ello, haz clic en la parte superior izquierda del Viewport de nuevo, donde dice "Perspectiva", y selecciona "Visualización Normal".
zh_tw: 首先關閉線框顯示。再次點擊視口左上角的“透視”字樣，選擇“顯示標準”。

source: Note how the mesh color goes flat. This is because the lighting on it is flat. Let's add a light!
de: Beachten Sie, dass die Farbe des Meshes flach wird. Das liegt daran, dass die Beleuchtung darauf flach ist. Fügen wir ein Licht hinzu!
es: Fíjese en cómo el color de la malla se vuelve plano. Esto se debe a que la iluminación de la misma es plana. ¡Añadamos una luz!
zh_tw: 注意網格顏色是如何變得平滑的. 這是因為它的光線是平滑的. 讓我們加一盞燈吧!

source: First, we will add an :ref:`OmniLight3D<class_OmniLight3D>` to the scene.
de: Zunächst fügen wir der Szene ein :ref:`OmniLight3D<class_OmniLight3D>` hinzu.
zh_tw: 首先, 我們將在場景中新增一個 :ref:`OmniLight<class_OmniLight>` .

source: You can see the light affecting the terrain, but it looks odd. The problem is the light is affecting the terrain as if it were a flat plane. This is because the light shader uses the normals from the :ref:`Mesh <class_mesh>` to calculate light.
de: Sie können sehen, wie das Licht auf das Gelände wirkt, aber es sieht seltsam aus. Das Problem ist, dass das Licht auf das Terrain einwirkt, als ob es eine flache Ebene wäre. Das liegt daran, dass der Licht-Shader die Normalen aus dem :ref:`Mesh <class_mesh>` zur Berechnung des Lichts verwendet.
es: Se puede ver la luz que afecta al terreno, pero se ve rara. El problema es que la luz está afectando al terreno como si fuera plano. Esto se debe a que el shader de luz utiliza las normales de la :ref:`Mesh <class_mesh>` para calcular la iluminación.
zh_tw: 你會看到光線影響了地形, 但這看起來很奇怪. 問題是光線對地形的影響就像在平面上一樣. 這是因為光著色器使用 :ref:`網格 <class_mesh>` 中的法線來計算光.

source: The normals are stored in the Mesh, but we are changing the shape of the Mesh in the shader, so the normals are no longer correct. To fix this, we can recalculate the normals in the shader or use a normal texture that corresponds to our noise. Godot makes both easy for us.
de: Die Normalen sind im Mesh gespeichert, aber wir ändern die Form des Mesh im Shader, so dass die Normalen nicht mehr korrekt sind. Um dies zu beheben, können wir die Normalen im Shader neu berechnen oder eine Normalentextur verwenden, die unserem Rauschen entspricht. Godot macht beides für uns einfach.
es: Los normales se almacenan en la Mesh, pero estamos cambiando la forma de la Malla en el shader, por lo que los normales ya no son correctos. Para arreglar esto, podemos recalcular los normales en el shader o usar una textura normal que corresponda a nuestro ruido. Godot hace ambas cosas fáciles para nosotros.
zh_tw: 法線儲存在網格中, 但是我們在著色器中改變網格的形狀, 所以法線不再正確. 為了解決這個問題, 我們可以在著色器中重新計算法線, 或者使用與我們的雜訊相對應的法線紋理.Godot讓這一切變得很簡單.

source: You can calculate the new normal manually in the vertex function and then just set ``NORMAL``. With ``NORMAL`` set, Godot will do all the difficult lighting calculations for us. We will cover this method in the next part of this tutorial, for now we will read normals from a texture.
de: Sie können die neue Normale manuell in der Vertex-Funktion berechnen und dann einfach ``NORMAL`` setzen. Wenn ``NORMAL`` gesetzt ist, wird Godot alle schwierigen Beleuchtungsberechnungen für uns erledigen. Wir werden diese Methode im nächsten Teil dieses Tutorials behandeln, für jetzt werden wir Normalen von einer Textur lesen.
es: Puedes calcular la nueva normalidad manualmente en la función de vértice y luego sólo tienes que poner "NORMAL". Con "NORMAL", Godot hará todos los cálculos de iluminación difíciles para nosotros. Cubriremos este método en la próxima parte de este tutorial, por ahora leeremos normales de una textura.
zh_tw: 您可以在頂點函式中手動計算新的法線，然後只需設定法線 ``NORMAL``。設定好 ``NORMAL`` 後，Godot 將為我們完成所有困難的光照計算。我們將在本教學的下一部分介紹這種方法，現在我們將從紋理中讀取法線。

source: Instead we will rely on the NoiseTexture again to calculate normals for us. We do that by passing in a second noise texture.
de: Stattdessen werden wir uns wieder auf die NoiseTexture verlassen, um die Normalen für uns zu berechnen. Wir tun dies, indem wir eine zweite Rauschtextur übergeben.
es: En cambio, confiaremos en el NoiseTexture de nuevo para calcular las normales por nosotros. Lo hacemos pasando una segunda textura de ruido.
zh_tw: 相反, 我們將再次依靠雜訊來計算法線. 我們通過傳入第二個雜訊紋理來做到這一點.

source: Set this second uniform texture to another :ref:`NoiseTexture2D <class_noisetexture2D>` with another :ref:`FastNoiseLite <class_fastnoiselite>`. But this time, check **As Normalmap**.
de: Setzen Sie diese zweite Uniform-Textur auf eine weitere :ref:`NoiseTexture2D <class_noisetexture2D>` mit einer weiteren :ref:`FastNoiseLite <class_fastnoiselite>`. Aber dieses Mal aktivieren Sie **Als Normal Map**.
zh_tw: 把第二個 uniform 紋理設為另一個帶有單獨 OpenSimplexNoise 的 NoiseTexture。不過這一回，請取消勾選“As Normalmap”。

source: Now, because this is a normalmap and not a per-vertex normal, we are going to assign it in the ``fragment()`` function. The ``fragment()`` function will be explained in more detail in the next part of this tutorial.
de: Da es sich hier um eine Normal Map und nicht um eine Per-Vertex-Normale handelt, werden wir sie in der Funktion ``fragment()`` zuweisen. Die ``fragment()``-Funktion wird im nächsten Teil des Tutorials genauer erklärt.
es: Ahora, porque este es un mapa normal y no un normal por vértice, vamos a asignarlo en la función ``fragment()``. La función ``fragment()`` se explicará con más detalle en la siguiente parte de este tutorial.
zh_tw: 現在, 因為這是一個法線貼圖, 而不是每個頂點的法線, 我們將在 ``fragment()`` 函式中分配它. ``fragment()`` 函式將在本教學的下一部分中詳細解釋.

source: When we have normals that correspond to a specific vertex we set ``NORMAL``, but if you have a normalmap that comes from a texture, set the normal using ``NORMAL_MAP``. This way Godot will handle the wrapping of texture around the mesh automatically.
de: Wenn wir Normalen haben, die einem bestimmten Vertex entsprechen, setzen wir ``NORMAL``, aber wenn Sie eine Norma Map haben, die von einer Textur kommt, setzen Sie die Normalen mit ``NORMAL_MAP``. Auf diese Weise wird Godot das umschließen der Textur um das Mesh automatisch handhaben.
zh_tw: 當我們有對應某個特定頂點的法線時，就要設定 ``NORMAL``，但如果你有一個來自紋理的法線貼圖，要使用 ``NORMALMAP`` 設定法線。這樣，Godot 將自動處理環繞網格的紋理。

source: Lastly, in order to ensure that we are reading from the same places on the noise texture and the normalmap texture, we are going to pass the ``VERTEX.xz`` position from the ``vertex()`` function to the ``fragment()`` function. We do that with varyings.
de: Um sicherzustellen, daß wir von den gleichen Stellen in der Rausch-Textur und der Normal Map-Textur lesen, übergeben wir die Position ``VERTEX.xz`` von der Funktion ``vertex()`` an die Funktion ``fragment()``. Wir machen das mit Varyings.
es: Por último, para asegurarnos de que estamos leyendo de los mismos lugares en la textura del ruido y la textura del mapa normal, vamos a pasar la posición ``VERTEX.xz`` de la función ``vertex()`` a la función ``fragment()``. Lo hacemos con variaciones.
zh_tw: 最後, 為了確保我們從雜訊紋理和法線圖紋理的相同位置讀取資料, 我們將把 ``vertex()`` 函式中的 ``VERTEX.xz`` 座標傳遞給 ``fragment()`` 函式. 我們用variings來做這個.

source: Above the ``vertex()`` define a ``vec2`` called ``tex_position``. And inside the ``vertex()`` function assign ``VERTEX.xz`` to ``tex_position``.
de: Oberhalb von ``vertex()`` definieren Sie einen ``vec2`` namens ``tex_position``. Und innerhalb der ``vertex()``-Funktion weisen Sie ``VERTEX.xz`` der ``tex_position`` zu.
es: Sobre el ``vertex()`` define un ``vec2`` llamado ``tex_position``. Y dentro de la función ``vertex()`` asigna ``VERTEX.xz`` a la ``tex_position``.
zh_tw: 在 ``vertex()`` 上面定義一個 ``vec2`` 叫做 ``tex_position`` . 在 ``vertex()`` 函式中, 將 ``VERTEX.xz`` 分配給 ``tex_position`` .

source: And now we can access ``tex_position`` from the ``fragment()`` function.
de: Und jetzt können wir auf ``tex_position`` von der ``fragment()`` Funktion aus zugreifen.
es: Y ahora podemos acceder a ``tex_position`` desde la función ``fragment()``.
zh_tw: 現在我們可以從 ``fragment()`` 函式中存取 ``tex_position`` .

source: With the normals in place the light now reacts to the height of the mesh dynamically.
de: Mit den Normalen reagiert das Licht nun dynamisch auf die Höhe des Meshs.
es: Con los normales en su lugar la luz ahora reacciona a la altura de la malla de forma dinámica.
zh_tw: 法線就位後, 光線就會對網格的高度做出動態反應.

source: We can even drag the light around and the lighting will update automatically.
de: Wir können das Licht sogar herumziehen und die Beleuchtung wird automatisch aktualisiert.
es: Incluso podemos arrastrar la luz y la iluminación se actualizará automáticamente.
zh_tw: 我們甚至可以把燈拖來拖去, 燈光會自動更新.

source: Here is the full code for this tutorial. You can see it is not very long as Godot handles most of the difficult stuff for you.
de: Hier ist der vollständige Code für dieses Tutorial. Wie Sie sehen können, ist er nicht sehr lang, da Godot die meisten schwierigen Dinge für Sie erledigt.
es: Aquí está el código completo de este tutorial. Puedes ver que no es muy largo ya que Godot maneja la mayoría de las cosas difíciles para ti.
zh_tw: 以下是本教學的完整程式碼. 您可以看到,Godot會為您處理大多數繁瑣的事情, 本教學篇幅不會太長.

source: That is everything for this part. Hopefully, you now understand the basics of vertex shaders in Godot. In the next part of this tutorial we will write a fragment function to accompany this vertex function and we will cover a more advanced technique to turn this terrain into an ocean of moving waves.
de: Das ist alles für diesen Teil. Hoffentlich verstehen Sie jetzt die Grundlagen von Vertex-Shadern in Godot. Im nächsten Teil dieses Tutorials werden wir eine Fragment-Funktion schreiben, um diese Vertex-Funktion zu begleiten, und wir werden eine fortgeschrittenere Technik behandeln, um dieses Terrain in ein Meer von sich bewegenden Wellen zu verwandeln.
es: Eso es todo para esta parte. Esperemos que ahora entiendas lo básico de los sombreadores de vértices en Godot. En la próxima parte de este tutorial escribiremos una función de fragmento para acompañar esta función de vértice y cubriremos una técnica más avanzada para convertir este terreno en un océano de olas en movimiento.
zh_tw: 這就是這部分的全部內容. 希望您現在已瞭解Godot中頂點著色器的基本知識. 在本教學的下一部分中, 我們將編寫一個片段函式來配合這個頂點函式, 並且我們將介紹一種更高級的技術來將這個地形轉換成一個移動的波浪海洋.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
zh_tw: 翻譯狀態
