Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/ways_to_contribute.po
Languages: de

source: Ways to contribute
de: Möglichkeiten, einen Beitrag zu leisten

source: Godot Engine is a non-profit, community-driven free and open source project. Almost all (but our lead dev Juan, more on that below) developers are working *pro bono* on their free time, out of personal interest and for the love of creating a libre engine of exceptional quality.
de: Godot Engine ist ein gemeinnütziges, von der Community betriebenes freies und quelloffenes Open-Source Projekt. Fast alle (außer unserem Hauptentwickler Juan, mehr dazu weiter unten) arbeiten in ihrer Freizeit, aus persönlichem Interesse und aus Liebe zur Entwicklung einer freien Engine von außergewöhnlicher Qualität.

source: This means that to thrive, Godot needs as many users as possible to get involved by contributing to the engine. There are many ways to contribute to such a big project, making it possible for everybody to bring something positive to the engine, regardless of their skill set:
de: Das bedeutet, dass Godot, um zu gedeihen, so viele Nutzer wie möglich braucht, die sich an der Engine beteiligen und zu ihr beitragen. Es gibt viele Möglichkeiten, zu einem so großen Projekt beizutragen, so dass jeder etwas Positives zur Engine beitragen kann, unabhängig von seinen Fähigkeiten:

source: **Be part of the community.** The best way to contribute to Godot and help it become ever better is simply to use the engine and promote it by word-of-mouth, in the credits or splash screen of your games, blog posts, tutorials, videos, demos, gamedev or free software events, support on the Q&A, forums, Contributors Chat, Discord, etc. Participate! Being a user and advocate helps spread the word about our great engine, which has no marketing budget and can therefore only rely on its community to become more mainstream.
de: **Seien Sie Teil der Community.** Der beste Weg, zu Godot beizutragen und zu helfen, es immer besser zu machen, ist einfach, die Engine zu benutzen und sie durch Mundpropaganda, in den Credits oder auf dem Startbildschirm Ihrer Spiele, in Blog-Beiträgen, Tutorials, Videos, Demos, Gamedev- oder Free-Software-Events, Support in den Fragen und Antworten, in den Foren, im Mitwirkenden-Chat, auf Discord usw. zu bewerben. Beteiligen Sie sich! Als Nutzer und Befürworter tragen Sie dazu bei, unsere großartige Engine bekannt zu machen, die über kein Marketingbudget verfügt und sich daher nur auf ihre Community verlassen kann, um sich zu etablieren.

source: **Make games.** It's no secret that, to convince new users and especially the industry at large that Godot is a relevant market player, we need great games made with Godot. We know that the engine has a lot of potential, both for 2D and 3D games, but given its young age we still lack big releases that will draw attention to Godot. So keep working on your awesome projects, each new game increases our credibility on the gamedev market!
de: **Machen Sie Spiele.** Es ist kein Geheimnis, dass wir großartige Spiele brauchen, die mit Godot gemacht werden, um neue Nutzer und vor allem die Branche insgesamt davon zu überzeugen, dass Godot ein relevanter Marktteilnehmer ist. Wir wissen, dass die Engine viel Potenzial hat, sowohl für 2D- als auch für 3D-Spiele, aber angesichts ihres jungen Alters fehlen uns noch große Releases, um die Aufmerksamkeit auf Godot zu lenken. Arbeiten Sie also weiter an Ihren großartigen Projekten. Jedes neue Spiel erhöht unsere Glaubwürdigkeit auf dem Gamedev-Markt!

source: **Get involved in the engine's development.** This can be by contributing code via pull requests, testing the development snapshots or directly the git *master* branch, report bugs or suggest enhancements on the issue tracker, improve the official documentation (both the class reference and tutorials) and its translations. The following sections will cover each of those "direct" ways of contributing to the engine.
de: **Beteiligen Sie sich an der Entwicklung der Engine**, indem Sie Code über Pull Requests beisteuern, die Entwicklungs-Snapshots oder direkt den Git *Master* Branch testen, Bugs melden oder Verbesserungen auf dem Issue-Tracker vorschlagen, die offizielle Dokumentation (sowohl die Klassenreferenz als auch die Tutorials) und ihre Übersetzungen verbessern. Die folgenden Abschnitte behandeln jede dieser "direkten" Möglichkeiten, zur Engine beizutragen.

source: **Donate.** Godot is a non-profit project, but it can still benefit from user donations for many things. Apart from usual expenses such as hosting costs or promotional material on events, we also use donation money to acquire hardware when necessary (e.g. we used donation money to buy a MacBook Pro to implement Retina/HiDPI support and various other macOS-related features). Most importantly, we also used donation money to hire core developers so they can work full-time on the engine. Even with a low monthly wage, we need a steady donation income to continue doing this, which has been very beneficial to the project so far. So if you want to donate some money to the project, check `our website <https://godotengine.org/donate>`_ for details.
de: **Spenden Sie.** Godot ist ein gemeinnütziges Projekt, kann aber dennoch von Spenden der Nutzer für viele Dinge profitieren. Abgesehen von den üblichen Ausgaben wie Hosting-Kosten oder Werbematerial für Veranstaltungen verwenden wir Spendengelder auch für die Anschaffung von Hardware, wenn dies notwendig ist (z.B. haben wir Spendengelder für den Kauf eines MacBook Pro verwendet, um Retina/HiDPI-Unterstützung und verschiedene andere macOS-bezogene Features zu implementieren). Vor allem aber haben wir Spendengelder verwendet, um Kernentwickler einzustellen, damit sie Vollzeit an der Engine arbeiten können. Selbst bei einem geringen monatlichen Gehalt brauchen wir ein regelmäßiges Spendeneinkommen, um diese Arbeit fortzusetzen, was dem Projekt bisher sehr gut getan hat. Wenn Sie also etwas Geld für das Projekt spenden möchten, finden Sie `auf unserer Website <https://godotengine.org/donate>`_ weitere Informationen.

source: Contributing code
de: Mitwirken am Code

source: The possibility to study, use, modify and redistribute modifications of the engine's source code are the fundamental rights that Godot's `MIT <https://tldrlegal.com/license/mit-license>`_ license grants you, making it `free and open source software <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_.
de: Die Möglichkeit, den Quellcode der Engine zu studieren, zu verwenden, zu modifizieren und weiterzuverbreiten, sind die grundlegenden Rechte, die Ihnen die `MIT <https://tldrlegal.com/license/mit-license>`_-Lizenz von Godot einräumt und sie zu einer `freien und quelloffenen Software <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ macht.

source: As such, everyone is entitled to modify `Godot's source code <https://github.com/godotengine/godot>`_, and send those modifications back to the upstream project in the form of a patch (a text file describing the changes in a ready-to-apply manner) or - in the modern workflow that we use - via a so-called "pull request" (PR), i.e. a proposal to directly merge one or more Git commits (patches) into the main development branch.
de: Als solcher ist jeder berechtigt, `Godots Quellcode <https://github.com/godotengine/godot>`_ zu ändern und diese Änderungen an das Upstream-Projekt zurückzusenden, und zwar in Form eines Patches (einer Textdatei, die Änderungen in einer anwendungsbereiten Weise beschreibt) oder - in dem modernen Workflow, den wir verwenden - über einen sogenannten "Pull Request" (PR), d.h. einen Vorschlag, einen oder mehrere Git Commits (Patches) direkt in den Hauptentwicklungsbranch zu mergen.

source: Contributing code changes upstream has two big advantages:
de: Das Beisteuern von Codeänderungen im Upstream hat zwei große Vorteile:

source: Your own code will be reviewed and improved by other developers, and will be further maintained directly in the upstream project, so you won't have to reapply your own changes every time you move to a newer version. On the other hand it comes with a responsibility, as your changes have to be generic enough to be beneficial to all users, and not just your project; so in some cases it might still be relevant to keep your changes only for your own project, if they are too specific.
de: Ihr eigener Code wird von anderen Entwicklern gereviewt und verbessert und wird direkt im Upstream-Projekt weiter gepflegt, so dass Sie Ihre eigenen Änderungen nicht jedes Mal neu einpflegen müssen, wenn Sie zu einer neueren Version wechseln. Auf der anderen Seite bringt es eine Verantwortung mit sich, da Ihre Änderungen allgemein genug sein müssen, um für alle User von Nutzen zu sein, und nicht nur für Ihr Projekt; in einigen Fällen kann es also immer noch relevant sein, Ihre Änderungen nur für Ihr eigenes Projekt zu behalten, wenn sie zu spezifisch sind.

source: The whole community will benefit from your work, and other contributors will behave the same way, contributing code that will be beneficial to you. At the time of this writing, over 2,000 developers have contributed code changes to the engine!
de: Die gesamte Community wird von Ihrer Arbeit profitieren, und andere Mitwirkende werden sich genauso verhalten und Code beisteuern, der für Sie von Nutzen sein wird. Zum Zeitpunkt der Erstellung dieses Artikels haben über 2000 Entwickler Codeänderungen zur Engine beigetragen!

source: To ensure good collaboration and overall quality, the Godot developers enforce some rules for code contributions, for example regarding the style to use in the C++ code (indentation, brackets, etc.) or the Git and PR workflow.
de: Um eine gute Zusammenarbeit und Gesamtqualität zu gewährleisten, setzen die Godot-Entwickler einige Regeln für Codebeiträge durch, z.B. hinsichtlich des im C++ Code zu verwendenden Stils (Einrückung, Klammern usw.) oder des Git- und PR-Workflows.

source: A good place to start is by searching for issues tagged as `good first issue <https://github.com/godotengine/godot/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22>`_ on GitHub.
de: Ein guter Anfang ist es, auf GitHub nach Issues zu suchen, die als `good first issue <https://github.com/godotengine/godot/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22>`_ gekennzeichnet sind.

source: Technical details about the PR workflow are outlined in a specific section, :ref:`doc_pr_workflow`.
de: Technische Details zum PR-Workflow finden Sie in diesem Abschnitt: :ref:`doc_pr_workflow`.

source: Details about the code style guidelines and the ``clang-format`` tool used to enforce them are outlined in :ref:`doc_code_style_guidelines`.
de: Details zu den Richtlinien für den Codestil und dem Tool ``clang-format`` finden Sie unter :ref:`doc_code_style_guidelines`.

source: All pull requests must go through a review process before being accepted. Depending on the scope of the changes, it may take some time for a maintainer responsible for the modified part of the engine to provide their review. We value all of our contributors and ask them to be patient in the meantime, as it is expected that in an open source project like Godot, there is going to be way more contributions than people validating them.
de: Alle Pull Requests müssen einen Review-Prozess durchlaufen, bevor sie akzeptiert werden. Abhängig vom Umfang der Änderungen kann es einige Zeit dauern, bis ein Maintainer, der für den geänderten Teil der Engine verantwortlich ist, sein Review zur Verfügung stellt. Wir schätzen alle unsere Mitwirkenden und bitten sie, in der Zwischenzeit geduldig zu sein, da man bei einem Open-Source-Projekt wie Godot damit rechnen muss, dass es viel mehr Beiträge gibt als Leute, die sie überprüfen.

source: To make sure that your time and efforts aren't wasted, it is recommended to vet the idea first before implementing it and putting it for a review as a PR. To that end, Godot has a `proposal system <https://github.com/godotengine/godot-proposals>`_. Its usage is encouraged to plan changes and discuss them with the community. Implementation details can also be discussed with other contributors on the `Godot Contributors Chat <https://chat.godotengine.org/>`_.
de: Um sicherzustellen, dass Ihre Zeit und Mühe nicht umsonst sind, wird empfohlen, die Idee zunächst prüfen zu lassen, bevor Sie sie umsetzen und als PR zum Review stellen. Zu diesem Zweck verfügt Godot über ein `Vorschlagssystem <https://github.com/godotengine/godot-proposals>`_. Dessen Nutzung wird empfohlen, um Änderungen zu planen und sie mit der Community zu diskutieren. Implementierungsdetails können auch mit anderen Mitwirkenden im `Godot-Mitwirkenden-Chat <https://chat.godotengine.org/>`_ diskutiert werden.

source: Proposals are only required when working on an enhancement or a new feature. Bug reports are sufficient for fixing issues.
de: Vorschläge sind nur erforderlich, wenn Sie an einer Erweiterung oder einem neuen Feature arbeiten. Für die Behebung von Problemen sind Bug-Reports ausreichend.

source: Testing and reporting issues
de: Testen und Melden von Problemen

source: Another great way of contributing to the engine is to test development releases or the development branch and to report issues. It is also helpful to report issues discovered in stable releases, so that they can be fixed in the development branch and in future maintenance releases.
de: Eine weitere Möglichkeit, einen Beitrag zur Engine zu leisten, besteht darin, Entwicklungsreleases oder den Entwicklungsbranch zu testen und Probleme zu melden. Es ist auch hilfreich, Probleme zu melden, die in stabilen Releases entdeckt wurden, damit sie im Entwicklungsbranch und in zukünftigen Wartungsreleases behoben werden können.

source: Testing development versions
de: Entwicklungsversionen testen

source: To help with the testing, you have several possibilities:
de: Um beim Testen zu helfen, haben Sie mehrere Möglichkeiten:

source: Compile the engine from source yourself, following the instructions of the :ref:`Compiling <toc-devel-compiling>` page for your platform.
de: Kompilieren Sie die Engine selbst aus dem Quellcode. Befolgen Sie dazu die Anweisungen auf der entsprechenden :ref:`Kompilieren <toc-devel-compiling>`-Seite für Ihre Plattform.

source: Test official pre-release binaries when they are announced (usually on the blog and other community platforms), such as alpha, beta and release candidate (RC) builds.
de: Testen Sie offizielle Pre-Release-Binärdateien, wenn sie angekündigt werden (normalerweise auf dem Blog und anderen Community-Plattformen), z.B. Alpha, Beta und Release Candidate (RC).

source: Test "trusted" unofficial builds of the development branch; just ask community members for reliable providers. Whenever possible, it's best to use official binaries or to compile yourself though, to be sure about the provenance of your binaries.
de: Testen Sie "vertrauenswürdige" inoffizielle Builds des Entwicklungsbranchs. Fragen Sie einfach Community-Mitglieder nach zuverlässigen Anbietern. Wann immer möglich, ist es am besten, offizielle Binärdateien zu verwenden oder sie sich selbst zu kompilieren, um sich der Herkunft der Binärdateien sicher zu sein.

source: As mentioned previously, it is also helpful to keep your eyes peeled for potential bugs that might still be present in the stable releases, especially when using some niche features of the engine which might get less testing by the developers.
de: Wie bereits erwähnt, ist es auch hilfreich, die Augen nach potenziellen Bugs offen zu halten, die möglicherweise noch in den stable Releases vorhanden sind, insbesondere wenn einige Nischen-Features der Engine verwendet werden, die von den Entwicklern möglicherweise weniger getestet werden.

source: Filing an issue on GitHub
de: Eine Issue auf GitHub einreichen

source: Godot uses `GitHub's issue tracker <https://github.com/godotengine/godot/issues>`_ for bug reports. When you start filing a bug report, you’ll be given a form to fill out. Please try to follow it so that all issues are consistent and provide the required information.
de: Godot verwendet für Bug-Reports den `Issue-Tracker von GitHub <https://github.com/godotengine/godot/issues>`_. Wenn Sie einen Bug-Report einreichen, erscheint ein Formular zum Ausfüllen. Bitte versuchen Sie, die Anweisungen zu befolgen, damit alle Meldungen konsistent sind und die erforderlichen Informationen enthalten.

source: Contributing to the documentation
de: Beitrag zur Dokumentation

source: There are two separate resources referred to as "documentation" in Godot:
de: In Godot gibt es zwei separate Ressourcen, die als "Dokumentation" bezeichnet werden:

source: **The class reference.** This is the documentation for the complete Godot API as exposed to GDScript and the other scripting languages. It can be consulted offline, directly in Godot's code editor, or online at Godot :ref:`Class Reference <doc_class_reference>`. To contribute to the class reference, you have to edit the XML file corresponding to the class and make a pull request. See :ref:`doc_updating_the_class_reference` and :ref:`doc_class_reference_primer` for more details.
de: **Die Klassenreferenz.** Dies ist die Dokumentation für die gesamte Godot-API, wie sie für GDScript und die anderen Skriptsprachen zur Verfügung steht. Sie kann offline, direkt im Code-Editor von Godot, oder online in der Godot-:ref:`Klassenreferenz <doc_class_reference>` eingesehen werden. Um zur Klassenreferenz beizutragen, müssen Sie die der Klasse entsprechende XML-Datei bearbeiten und einen Pull Request stellen. Siehe :ref:`doc_updating_the_class_reference` und :ref:`doc_class_reference_primer` für weitere Details.

source: **The tutorials and engine documentation and its translations.** This is the part you are reading now, which is distributed in the HTML format. Its contents are generated from plain text files in the reStructured Text (rst) format, to which you can contribute via pull requests on the `godot-docs <https://github.com/godotengine/godot-docs>`_ GitHub repository. See :ref:`doc_contributing_to_the_documentation` for more details.
de: **Die Tutorials und Engine-Dokumentation und ihre Übersetzungen.** Dies ist der Teil, den Sie gerade lesen und der im HTML-Format bereitgestellt wird. Sein Inhalt wird aus reinen Textdateien im reStructured Text (rst)-Format generiert, zu denen Sie über Pull Requests auf dem GitHub-Repository `godot-docs <https://github.com/godotengine/godot-docs>`_ beitragen können. Siehe :ref:`doc_contributing_to_the_documentation` für weitere Details.

source: Contributing translations
de: An Übersetzungen mitwirken

source: To make Godot accessible to everyone, including users who may prefer resources in their native language instead of English, our community helps translate both the Godot editor and its documentation in many languages.
de: Um Godot für alle zugänglich zu machen, einschließlich Benutzer, die Material in ihrer Muttersprache anstelle von Englisch bevorzugen, hilft unsere Community dabei, sowohl den Godot-Editor als auch seine Dokumentation in viele Sprachen zu übersetzen.

source: See :ref:`doc_editor_and_docs_localization` for more details.
de: Siehe :ref:`doc_editor_and_docs_localization` für weitere Details.

source: Translation status
de: Übersetzungsstatus
