Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/immediatemesh.po
Languages: de, zh_cn

source: Using ImmediateMesh
de: Verwenden von ImmediateMesh
zh_cn: 使用 ImmediateMesh

source: The :ref:`ImmediateMesh <class_ImmediateMesh>` is a convenient tool to create dynamic geometry using an OpenGL 1.x-style API. Which makes it both approachable to use and efficient for meshes which need to be updated every frame.
de: Das :ref:`ImmediateMesh <class_ImmediateMesh>` ist ein praktisches Werkzeug zur Erstellung dynamischer Geometrie unter Verwendung einer OpenGL 1.x-ähnlichen API. Das macht es sowohl einfach zu benutzen als auch effizient für Meshes, die in jedem Frame aktualisiert werden müssen.
zh_cn: :ref:`ImmediateMesh <class_ImmediateMesh>` 是一个使用 OpenGL 1.x 风格的 API 创建动态几何体的便捷工具。这使得它对于需要每帧更新的网格来说，既易于使用又高效。

source: Generating complex geometry (several thousand vertices) with this tool is inefficient, even if it's done only once. Instead, it is designed to generate simple geometry that changes every frame.
de: Die Erzeugung komplexer Geometrien (mehrere Tausend Vertices) mit diesem Werkzeug ist ineffizient, selbst wenn sie nur einmal durchgeführt wird. Stattdessen ist es darauf ausgelegt, einfache Geometrie zu erzeugen, die sich bei jedem Bild ändert.
zh_cn: 使用这个工具生成复杂的几何体（几千个顶点）效率很低，即使只做一次。相反，它的设计是为了生成每一帧变化的简单几何体。

source: First, you need to create a :ref:`MeshInstance3D <class_meshinstance3d>` and add an :ref:`ImmediateMesh <class_ImmediateMesh>` to it in the Inspector.
de: Zuerst müssen Sie eine :ref:`MeshInstance3D <class_meshinstance3d>` erstellen und ihr im Inspektor ein :ref:`ImmediateMesh <class_ImmediateMesh>` hinzufügen.
zh_cn: 首先，你需要创建一个 :ref:`MeshInstance3D <class_meshinstance3d>` 并在检查其中向其添加一个 :ref:`ImmediateMesh <class_ImmediateMesh>`。

source: Next, add a script to the MeshInstance3D. The code for the ImmediateMesh should go in the ``_process()`` function if you want it to update each frame, or in the ``_ready()`` function if you want to create the mesh once and not update it. If you only generate a surface once, the ImmediateMesh is just as efficient as any other kind of mesh as the generated mesh is cached and reused.
de: Als nächstes fügen Sie ein Skript zu der MeshInstance3D hinzu. Der Code für das ImmediateMesh sollte in der ``_process()`` Funktion stehen, wenn Sie wollen, dass es bei jedem Frame aktualisiert wird, oder in der ``_ready()`` Funktion, wenn Sie das Mesh einmal erzeugen und nicht aktualisieren wollen. Wenn Sie eine Oberfläche nur einmal erzeugen, ist das ImmediateMesh genauso effizient wie jede andere Art von Mesh, da das erzeugte Mesh zwischengespeichert und wiederverwendet wird.
zh_cn: 接下来，将脚本添加到 MeshInstance3D 上。如果你希望 ImmediateMesh 每帧都更新，则应该把 ImmediateMesh 的代码放在 ``_process()`` 函数中；如果你想创建一次网格体而后不再更新它，则代码应放在 ``_ready()`` 函数中。如果仅生成一次表面，则 ImmediateMesh 与任何其他类型的网格一样高效，因为生成的网格会被缓存并重用。

source: To begin generating geometry you must call ``surface_begin()``. ``surface_begin()`` takes a ``PrimitiveType`` as an argument. ``PrimitiveType`` instructs the GPU how to arrange the primitive based on the vertices given whether it is triangles, lines, points, etc. A complete list can be found under the :ref:`Mesh <class_mesh>` class reference page.
de: Um mit der Erzeugung von Geometrie zu beginnen, müssen Sie ``surface_begin()`` aufrufen. ``surface_begin()`` nimmt einen ``PrimitiveType`` als Argument. Der ``PrimitiveType`` weist die GPU an, wie sie das Primitive basierend auf den angegebenen Vertices anordnen soll, je nachdem ob es sich um Dreiecke, Linien, Punkte, etc. handelt. Eine vollständige Liste kann auf der :ref:`Mesh <class_mesh>`-Klassenreferenzseite gefunden werden.
zh_cn: 必须调用 ``surface_begin()`` 才能开始生成几何体 。\ ``surface_begin()`` 将一个 ``PrimitiveType`` 作为参数。\ ``PrimitiveType``\ （图元类型）指示 GPU 如何根据给定的顶点来安排图元，可以是三角形、线、点等。完整的列表可以在 :ref:`Mesh <class_mesh>` 的类参考页面中找到。

source: Once you have called ``surface_begin()`` you are ready to start adding vertices. You add vertices one at a time. First you add vertex specific attributes such as normals or UVs using ``surface_set_****()`` (e.g. ``surface_set_normal()``). Then you call ``surface_add_vertex()`` to add a vertex with those attributes. For example:
de: Sobald Sie ``surface_begin()`` aufgerufen haben, können Sie mit dem Hinzufügen von Vertices beginnen. Sie fügen Vertices einen nach dem anderen hinzu. Zuerst fügen Sie vertex-spezifische Attribute wie Normalen oder UVs mit ``surface_set_****()`` hinzu (z.B. ``surface_set_normal()``). Dann rufen Sie ``surface_add_vertex()`` auf, um einen Vertex mit diesen Attributen hinzuzufügen. Zum Beispiel:
zh_cn: 一旦你调用了 ``surface_begin()`` ，就可以开始添加顶点了。每次添加一个顶点，首先使用 ``surface_set_****()`` （例如 ``surface_set_normal()`` ）添加顶点的特定属性，如法线或 UV。然后调用 ``surface_add_vertex()`` 来添加一个带有这些属性的顶点。例如：

source: Only attributes added before the call to ``surface_add_vertex()`` will be included in that vertex. If you add an attribute twice before calling ``surface_add_vertex()``, only the second call will be used.
de: Nur Attribute, die vor dem Aufruf von ``surface_add_vertex()`` hinzugefügt wurden, werden in diesen Vertex einbezogen. Wenn Sie ein Attribut zweimal hinzufügen, bevor Sie ``surface_add_vertex()`` aufrufen, wird nur der zweite Aufruf verwendet.
zh_cn: 只有在调用 ``surface_add_vertex()`` 之前添加的属性才会被包含在该顶点中。如果在调用 ``surface_add_vertex()`` 之前添加属性两次，则仅第二次调用才会被使用。

source: Finally, once you have added all your vertices call ``surface_end()`` to signal that you have finished generating the surface. You can call ``surface_begin()`` and ``surface_end()`` multiple times to generate multiple surfaces for the mesh.
de: Wenn Sie alle Vertices hinzugefügt haben, rufen Sie ``surface_end()`` auf, um zu signalisieren, dass Sie die Erzeugung der Oberfläche beendet haben. Sie können ``surface_begin()`` und ``surface_end()`` mehrfach aufrufen, um mehrere Oberflächen für das Mesh zu erzeugen.
zh_cn: 最后，当添加了所有的顶点后，调用 ``surface_end()`` 来表示已经完成了网格的生成。你可以多次调用 ``surface_begin()`` 和 ``surface_end()`` 来为网格生成多个表面。

source: The example code below draws a single triangle in the ``_ready()`` function.
de: Der folgende Beispielcode zeichnet ein einzelnes Dreieck in der Funktion ``_ready()``.
zh_cn: 下面的示例代码在 ``_ready()`` 函数中绘制了一个三角形。

source: The ImmediateMesh can also be used across frames. Each time you call ``surface_begin()`` and ``surface_end()``, you are adding a new surface to the ImmediateMesh. If you want to recreate the mesh from scratch each frame, call ``surface_clear()`` before calling ``surface_begin()``.
de: Das ImmediateMesh kann auch frameübergreifend verwendet werden. Jedes Mal, wenn Sie ``surface_begin()`` und ``surface_end()`` aufrufen, fügen Sie eine neue Oberfläche zum ImmediateMesh hinzu. Wenn Sie das Mesh bei jedem Frame von Grund auf neu erstellen wollen, rufen Sie ``surface_clear()`` auf, bevor Sie ``surface_begin()`` aufrufen.
zh_cn: ImmediateMesh 也可以在帧之间使用。每次调用 ``surface_begin()`` 和 ``surface_end()`` 时，你都会向 ImmediateMesh 添加一个新表面。如果你想在每一帧从头开始重新创建网格，请在调用 ``surface_begin()`` 之前先调用 ``surface_clear()`` 。

source: The above code will dynamically create and draw a single surface each frame.
de: Der obige Code erstellt und zeichnet dynamisch eine einzelne Oberfläche pro Frame.
zh_cn: 上面的代码将在每个帧里动态地创建并绘制一个表面。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
