Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/index.po
Languages: de, zh_cn, zh_tw

source: Procedural geometry
de: Prozedurale Geometrie
zh_cn: 程序式几何体
zh_tw: 程式式幾何體

source: There are many ways to procedurally generate geometry in Godot. In this tutorial series, we will explore a few of them. Each technique has its own benefits and drawbacks, so it is best to understand each one and how it can be useful in a given situation.
de: Es gibt viele Möglichkeiten, Geometrie in Godot prozedural zu erzeugen. In dieser Tutorial-Artikelreihe werden wir einige von ihnen erkunden. Jede Technik hat ihre eigenen Vor- und Nachteile, daher ist es am besten, jede einzelne zu verstehen und zu wissen, wie sie in einer bestimmten Situation nützlich sein kann.
zh_cn: 在 Godot 中，有许多方法可以通过程序生成几何体。在本系列教程中，我们将探讨其中的几种方法。每种技术都有自己的优点和缺点，所以最好了解每种技术，以及它在特定情况下如何发挥作用。
zh_tw: 在 Godot 中，有許多方法可以通過程式生成幾何體。在本系列教學中，我們將探討其中的幾種方法。每種技術都有自己的優點和缺點，所以最好瞭解每種技術，以及它在特定情況下如何發揮作用。

source: All the procedural geometry generation methods described here run on the CPU. Godot doesn't support generating geometry on the GPU yet.
de: Alle hier beschriebenen Methoden der prozeduralen Geometrieerzeugung laufen auf der CPU. Godot unterstützt die Erzeugung von Geometrie auf der GPU noch nicht.
zh_cn: 这里描述的所有程序几何生成（ procedural geometry generation ）方法都在 CPU 上运行。 Godot 尚不支持在 GPU 上生成几何体。
zh_tw: 這裡描述的所有程式幾何生成方法都在 CPU 上運作。 Godot 尚未支援在 GPU 上產生幾何體。

source: What is geometry?
de: Was ist Geometrie?
zh_cn: 什么是几何体？
zh_tw: 什麼是幾何體？

source: Geometry is a fancy way of saying shape. In computer graphics, geometry is typically represented by an array of positions called "vertices". In Godot, geometry is represented by Meshes.
de: Geometrie ist eine schicke Umschreibung für Form. In der Computergrafik wird die Geometrie in der Regel durch eine Liste von Positionen dargestellt, die als "Vertices" bezeichnet werden. In Godot wird die Geometrie durch Meshes dargestellt.
zh_cn: 几何体是形状的一种花式说法。在计算机图形学中，几何体通常由称为“顶点”的位置数组来表示。在 Godot 中，几何体用 Mesh（网格）来表示。
zh_tw: 幾何體是形狀的一種花式說法。在電腦圖形學中，幾何體通常由稱為“頂點”的位置陣列來表示。在 Godot 中，幾何體用 Mesh（網格）來表示。

source: What is a Mesh?
de: Was ist ein Mesh?
zh_cn: 什么是网格？
zh_tw: 什麼是網格？

source: Many things in Godot have mesh in their name: the :ref:`Mesh <class_Mesh>`, the :ref:`ArrayMesh <class_ArrayMesh>`, the :ref:`ImmediateMesh <class_ImmediateMesh>`, the :ref:`MeshInstance3D <class_MeshInstance3D>`, the :ref:`MultiMesh <class_MultiMesh>`, and the :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. While they are all related, they have slightly different uses.
de: Viele Dinge in Godot haben mesh in ihrem Namen: das :ref:`Mesh <class_Mesh>`, das :ref:`ArrayMesh <class_ArrayMesh>`, das :ref:`ImmediateMesh <class_ImmediateMesh>`, das :ref:`MeshInstance3D <class_MeshInstance3D>`, das :ref:`MultiMesh <class_MultiMesh>`, und das :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. Obwohl sie alle miteinander verwandt sind, haben sie leicht unterschiedliche Verwendungszwecke.
zh_cn: Godot 中的很多东西的名称中都有“Mesh”（网格）：:ref:`Mesh <class_Mesh>`、:ref:`ArrayMesh <class_ArrayMesh>`、:ref:`ImmediateMesh <class_ImmediateMesh>`、:ref:`MeshInstance3D <class_MeshInstance3D>`、:ref:`MultiMesh <class_MultiMesh>`、和 :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`。虽然它们都是相关的，但它们的用途略有不同。

source: Meshes and ArrayMeshes are resources that are drawn using a MeshInstance3D node. Resources like Meshes and ArrayMeshes cannot be added to the scene directly. A MeshInstance3D represents one instance of a mesh in your scene. You can reuse a single mesh in multiple MeshInstance3Ds to draw it in different parts of your scene with different materials or transformations (scale, rotation, position etc.).
de: Meshes und ArrayMeshes sind Ressourcen, die mit einem MeshInstance3D-Node gezeichnet werden. Ressourcen wie Meshes und ArrayMeshes können nicht direkt zur Szene hinzugefügt werden. Ein MeshInstance3D stellt eine Instanz eines Meshes in Ihrer Szene dar. Sie können ein einzelnes Mesh in mehreren MeshInstance3Ds wiederverwenden, um es in verschiedenen Teilen Ihrer Szene mit unterschiedlichen Materialien oder Transformationen (Skalierung, Drehung, Position usw.) zu zeichnen.
zh_cn: Mesh 和 ArrayMesh 是使用 MeshInstance3D 节点绘制的资源。像 Mesh 和 ArrayMesh 这样的资源不能直接添加到场景中。MeshInstance3D 代表的是某个网格在场景中的实例。你可以在多个 MeshInstance3D 中重复使用同一个网格，用不同的材质或变换（缩放、旋转、位置等）在场景的不同部分绘制它。
zh_tw: Mesh 和 ArrayMesh 是使用 MeshInstance 節點繪製的資源。像 Mesh 和 ArrayMesh 這樣的資源不能直接新增到場景中。MeshInstance 代表的是某個網格在場景中的實例。您可以在多個 MeshInstance 中重複使用同一個網格，用不同的材質或變換（縮放、旋轉、位置等）在場景的不同部分繪製它。

source: If you are going to draw the same object many times, it can be helpful to use a MultiMesh with a MultiMeshInstance3D. MultiMeshInstance3Ds draw meshes thousands of times very cheaply by taking advantage of hardware instancing. The drawback with using a MultiMeshInstance3D is that each of your mesh's surfaces are limited to one material for all instances. It uses an instance array to store different colors and transformations for each instance, but all the instances of each surface use the same material.
de: Wenn Sie dasselbe Objekt viele Male zeichnen wollen, kann es hilfreich sein, ein MultiMesh mit einem MultiMeshInstance3D zu verwenden. MultiMeshInstance3Ds zeichnen Meshes tausende Male sehr kostengünstig, indem sie die Vorteile der Hardware-Instanziierung nutzen. Der Nachteil bei der Verwendung eines MultiMeshInstance3D ist, dass jede Oberfläche des Meshes auf ein Material für alle Instanzen beschränkt ist. Es verwendet ein Instanz-Array, um verschiedene Farben und Transformationen für jede Instanz zu speichern, aber alle Instanzen jeder Oberfläche verwenden das gleiche Material.
zh_cn: 如果你要多次绘制同一个对象，那么将 MultiMesh 与 MultiMeshInstance3D 结合使用会很有帮助。MultiMeshInstance3D 可以以非常低的性能成本绘制数千次网格，利用的是硬件实例化的优势。使用 MultiMeshInstance3D 的缺点是所有网格的表面都只能使用同一种材质。它使用一个实例数组为每个实例存储不同的颜色和变换，但所有实例的表面使用的都是相同的材质。
zh_tw: 如果你要多次繪製同一個物件，那麼使用 MultiMesh 與 MultiMeshInstance 就會很有幫助。MultiMeshInstance 可以非常便宜地繪製數千次網格，利用的是硬體產生實體的優勢。使用 MultiMeshInstance 的缺點是所有實例都只能使用同一種材質。它使用一個實例陣列為每個實例儲存不同的顏色和變換，但所有實例的表面使用的都是相同的材質。

source: What a Mesh is
de: Was ein Mesh ist
zh_cn: 什么是网格
zh_tw: 什麼是網格

source: A Mesh is composed of one or more surfaces. A surface is an array composed of multiple sub-arrays containing vertices, normals, UVs, etc. Normally the process of constructing surfaces and meshes is hidden from the user in the :ref:`RenderingServer <class_RenderingServer>`, but with ArrayMeshes, the user can construct a Mesh manually by passing in an array containing the surface information.
de: Ein Mesh besteht aus einer oder mehreren Oberflächen. Eine Oberfläche ist ein Array, das aus mehreren Unter-Arrays besteht, die Vertices, Normalen, UVs usw. enthalten. Normalerweise wird der Prozess der Konstruktion von Oberflächen und Meshes vor dem Benutzer im :ref:`RenderingServer <class_RenderingServer>` verborgen, aber mit ArrayMeshes kann der Benutzer ein Mesh manuell konstruieren, indem er ein Array mit den Oberflächeninformationen übergibt.
zh_cn: 网格（Mesh）由一个或多个表面（Surface）组成。表面是由多个子数组组成的数组，包含顶点、法线、UV 等。通常情况下，构造表面和网格的过程对用户来说是隐藏在 :ref:`RenderingServer <class_RenderingServer>` 中的，但是通过 ArrayMesh，用户可以通过传递一个包含表面信息的数组来手动构造网格。
zh_tw: 網格（Mesh）由一個或多個表面（Surface）組成。表面是由多個子陣列組成的陣列，包含頂點、法線、UV 等。通常情況下，建構表面和網格的過程對使用者來說是隱藏在 :ref:`VisualServer <class_VisualServer>` 中的，但是通過 ArrayMesh，使用者可以通過傳遞一個包含表面資訊的陣列來手動建構網格。

source: Surfaces
de: Oberflächen
zh_cn: 表面
zh_tw: 表面

source: Each surface has its own material. Alternatively, you can override the material for all surfaces in the Mesh when you use a MeshInstance3D using the :ref:`material_override <class_GeometryInstance3D_property_material_override>` property.
de: Jede Oberfläche hat ihr eigenes Material. Alternativ können Sie das Material für alle Oberflächen im Mesh überschreiben, wenn Sie eine MeshInstance3D mit der Property :ref:`material_override <class_GeometryInstance3D_property_material_override>` verwenden.
zh_cn: 每个表面都有自己的材质。使用 MeshInstance3D 时，你也可以使用 :ref:`material_override <class_GeometryInstance3D_property_material_override>` 属性来覆盖 Mesh 中所有表面的材质。
zh_tw: 每個表面都有自己的材質。使用 MeshInstance 時，你也可以使用 :ref:`material_override <class_GeometryInstance_property_material_override>` 屬性來覆蓋 Mesh 中所有表面的材質。

source: Surface array
de: Oberflächen-Array
zh_cn: 表面数组
zh_tw: 表面陣列

source: The surface array is an array of length ``ArrayMesh.ARRAY_MAX``. Each position in the array is filled with a sub-array containing per-vertex information. For example, the array located at ``ArrayMesh.ARRAY_NORMAL`` is a :ref:`PackedVector3Array <class_PackedVector3Array>` of vertex normals. See :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` for more information.
de: Das Oberflächen-Array ist ein Array der Länge ``ArrayMesh.ARRAY_MAX``. Jede Position im Array wird mit einem Sub-Array gefüllt, das Informationen pro Vertex enthält. Zum Beispiel ist das Array an ``ArrayMesh.ARRAY_NORMAL`` ein :ref:`PackedVector3Array <class_PackedVector3Array>` von Vertex-Normalen. Siehe :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` für weitere Informationen.
zh_cn: 表面数组是一个长度为 ``ArrayMesh.ARRAY_MAX`` 的数组。数组中的每个位置都有一个子数组，包含每个顶点的信息。例如，位于 ``ArrayMesh.ARRAY_NORMAL`` 处的数组是顶点法线的 :ref:`PackedVector3Array <class_PackedVector3Array>`\ 。更多信息请参阅 :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`。
zh_tw: 表面陣列是一個長度為 ``ArrayMesh.ARRAY_MAX`` 的陣列。陣列中的每個位置都有一個子陣列，包含每個頂點的資訊。例如，位於 ``ArrayMesh.ARRAY_NORMAL`` 處的陣列是頂點法線的 :ref:`PoolVector3Array <class_PoolVector3Array>`。更多資訊請參閱 :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`。

source: The surface array can be indexed or non-indexed. Creating a non-indexed array is as easy as not assigning an array at the index ``ArrayMesh.ARRAY_INDEX``. A non-indexed array stores unique vertex information for every triangle, meaning that when two triangles share a vertex, the vertex is duplicated in the array. An indexed surface array only stores vertex information for each unique vertex and then also stores an array of indices which maps out how to construct the triangles from the vertex array. In general, using an indexed array is faster, but it means you have to share vertex data between triangles, which is not always desired (e.g. when you want per-face normals).
de: Das Oberflächen-Array kann indiziert oder nicht-indiziert sein. Die Erstellung eines nicht-indizierten Arrays erfolgt einfach durch die Nichtzuweisung eines Arrays mit dem Index ``ArrayMesh.ARRAY_INDEX``. Ein nicht-indiziertes Array speichert eindeutige Vertexinformationen für jedes Dreieck, was bedeutet, dass, wenn zwei Dreiecke einen Vertex teilen, der Vertex im Array dupliziert wird. Ein indiziertes Oberflächenarray speichert nur Vertexinformationen für jeden einzelnen Vertex und speichert dann auch ein Array mit Indizes, die zeigen, wie die Dreiecke aus dem Vertexarray zu konstruieren sind. Im Allgemeinen ist die Verwendung eines indizierten Arrays schneller, aber es bedeutet, dass Sie die Vertexdaten zwischen den Dreiecken teilen müssen, was nicht immer erwünscht ist (z. B. wenn Sie Normalen pro Fläche wünschen).
zh_cn: 表面数组可以是有索引的，也可以是非索引的。创建非索引数组就像在索引 ``ArrayMesh.ARRAY_INDEX`` 处不分配数组一样简单。非索引数组为每个三角形存储唯一的顶点信息，也就是说，当两个三角形共用一个顶点时，顶点在数组中是重复的。有索引的曲面数组只存储每个唯一顶点的顶点信息，然后还存储一个索引数组，它映射出如何从顶点数组构造三角形。一般来说，使用索引数组的速度更快，但这意味着你必须在三角形之间共享顶点数据，这并不总是需要的（例如，当你想要每面法线时）。
zh_tw: 表面陣列可以是有索引的，也可以是非索引的。建立非索引陣列就像在索引 ``ArrayMesh.ARRAY_INDEX`` 處不分配陣列一樣簡單。非索引陣列為每個三角形儲存唯一的頂點資訊，也就是說，當兩個三角形共用一個頂點時，頂點在陣列中是重複的。有索引的曲面陣列只儲存每個唯一頂點的頂點資訊，然後還儲存一個索引陣列，它對應出如何從頂點陣列建構三角形。一般來說，使用索引陣列的速度更快，但這意味著您必須在三角形之間共用頂點資料，這並不總是需要的（例如，當您想要每面法線時）。

source: Tools
zh_cn: 工具
zh_tw: 工具

source: Godot provides different ways of accessing and working with geometry. More information on each will be provided in the following tutorials.
de: Godot bietet verschiedene Möglichkeiten für den Zugriff auf und die Arbeit mit Geometrie. Weitere Informationen zu den einzelnen Möglichkeiten werden in den folgenden Tutorials gegeben.
zh_cn: Godot 提供了不同的访问和处理几何体的方法. 关于每种方法的更多信息将在下面的教程中提供.
zh_tw: Godot 提供了不同的存取和處理幾何體的方法. 關於每種方法的更多資訊將在下面的教學中提供.

source: The ArrayMesh resource extends Mesh to add a few different quality of life functions and, most importantly, the ability to construct a Mesh surface through scripting.
de: Die ArrayMesh-Ressource erweitert Mesh um einige Funktionen zur Verbesserung der Benutzerfreundlichkeit und vor allem um die Möglichkeit, eine Mesh-Oberfläche per Skripting zu erstellen.
zh_cn: ArrayMesh 资源扩展了 Mesh，增加了一些不同的便捷函数，最重要的是，可以通过脚本构建 Mesh 表面。
zh_tw: ArrayMesh 資源擴充了 Mesh，增加了一些不同的便捷函式，最重要的是，可以通過腳本建構 Mesh 表面。

source: For more information about the ArrayMesh, please see the :ref:`ArrayMesh tutorial <doc_arraymesh>`.
de: Weitere Informationen zum MeshDataTool finden Sie im :ref:`ArrayMesh-Tutorial <doc_arraymesh>`.
zh_cn: 有关ArrayMesh的更多信息, 请参阅 :ref:`ArrayMesh tutorial <doc_arraymesh>`.
zh_tw: 有關ArrayMesh的更多資訊, 請參閱 :ref:`ArrayMesh tutorial <doc_arraymesh>`.

source: The MeshDataTool is a resource that converts Mesh data into arrays of vertices, faces, and edges that can be modified at runtime.
de: Das MeshDataTool ist eine Ressource, die Mesh-Daten in Arrays von Vertices, Flächen und Kanten konvertiert, die zur Laufzeit geändert werden können.
zh_cn: MeshDataTool是一个将Mesh数据转换为顶点, 面和边的数组的资源, 可以在运行时进行修改.
zh_tw: MeshDataTool是一個將Mesh資料轉換為頂點, 面和邊的陣列的資源, 可以在運作時進行修改.

source: For more information about the MeshDataTool, please see the :ref:`MeshDataTool tutorial <doc_meshdatatool>`.
de: Weitere Informationen zum MeshDataTool finden Sie im :ref:`MeshDataTool-Tutorial <doc_meshdatatool>`.
zh_cn: 有关 MeshDataTool 的完整列表, 请参见 :ref:`MeshDataTool tutorial <doc_meshdatatool>`.
zh_tw: 有關 MeshDataTool 的完整列表, 請參見 :ref:`MeshDataTool tutorial <doc_meshdatatool>`.

source: The SurfaceTool allows the creation of Meshes using an OpenGL 1.x immediate mode style interface.
de: Das SurfaceTool ermöglicht die Erstellung von Meshes über eine Schnittstelle im Stil des OpenGL 1.x Immediate Mode.
zh_cn: SurfaceTool允许使用OpenGL 1.x即时模式风格的接口创建网格.
zh_tw: SurfaceTool允許使用OpenGL 1.x即時模式風格的介面建立網格.

source: For more information about the SurfaceTool, please see the :ref:`SurfaceTool tutorial <doc_surfacetool>`.
de: Weitere Informationen zum SurfaceToolfinden Sie im :ref:`SurfaceTool-Tutorial <doc_surfacetool>`.
zh_cn: 有关SurfaceTool的更多信息, 请阅读 :ref:`SurfaceTool tutorial <doc_surfacetool>`.
zh_tw: 有關SurfaceTool的更多資訊, 請閱讀 :ref:`SurfaceTool tutorial <doc_surfacetool>`.

source: ImmediateMesh is useful for prototyping because of its straightforward API, but it is slow because the geometry is rebuilt each time you make a change. It is most useful for adding simple geometry for visual debugging (e.g. by drawing lines to visualize physics raycasts etc.).
de: ImmediateMesh ist wegen seiner unkomplizierten API nützlich für das Prototyping, aber es ist langsam, weil die Geometrie bei jeder Änderung neu aufgebaut wird. Am nützlichsten ist es für das Hinzufügen einfacher Geometrie zur visuellen Fehlersuche (z. B. durch das Zeichnen von Linien zur Visualisierung von physikalischen Raycasts usw.).
zh_cn: ImmediateMesh 因为其直接的 API 而对原型设计很有用，但它的速度很慢，因为每次进行修改时都要重建几何体。它最有用的是快速添加简单的几何体来进行可视化调试（例如，通过绘制线条来可视化物理光线投射等）。

source: For more information about ImmediateMesh, please see the :ref:`ImmediateMesh tutorial <doc_immediatemesh>`.
de: Weitere Informationen zu ImmediateGeometry finden Sie im :ref:`ImmediateGeometry-Tutorial <doc_immediatemesh>`.
zh_cn: 有关 ImmediateMesh的更多信息，请参见 :ref:`ImmediateMesh 教程 <doc_immediatemesh>`\ 。
zh_tw: 有關 ImmediateGeometry 的更多資訊，請參見 :ref:`ImmediateGeometry 教學 <doc_immediategeometry>`。

source: Which one should I use?
de: Welche sollte ich verwenden?
zh_cn: 我应该使用哪一个？
zh_tw: GDScript是什麼？為什麼我要用它？

source: Which approach you use depends on what you are trying to do and what kind of procedure you are comfortable with.
de: Welchen Ansatz Sie wählen, hängt davon ab, was Sie erreichen wollen und mit welcher Art von Verfahren Sie zufrieden sind.
zh_cn: 用哪种方法取决于你想做什么，以及你觉得什么样的做法用起来更舒服。
zh_tw: 用哪種方法取決於你想做什麼，以及你覺得什麼樣的做法用起來更舒服。

source: Both SurfaceTool and ArrayMesh are excellent for generating static geometry (meshes) that don't change over time.
de: Sowohl SurfaceTool als auch ArrayMesh eignen sich hervorragend für die Erzeugung statischer Geometrien (Meshes), die sich im Laufe der Zeit nicht verändern.
zh_cn: SurfaceTool和ArrayMesh都是生成不随时间变化的静态几何体(网格)的绝佳工具.
zh_tw: SurfaceTool和ArrayMesh都是生成不隨時間變化的靜態幾何體(網格)的絕佳工具.

source: Using an ArrayMesh is slightly faster than using a SurfaceTool, but the API is a little more challenging. Additionally, SurfaceTool has a few quality of life methods such as ``generate_normals()`` and ``index()``.
de: Die Verwendung eines ArrayMesh ist etwas schneller als die eines SurfaceTools, aber die API ist etwas anspruchsvoller. Außerdem hat SurfaceTool ein paar benutzerfreundliche Methoden wie ``generate_normals()`` und ``index()``.
zh_cn: 使用 ArrayMesh 比使用 SurfaceTool 稍快一些，但 API 的难度更大一些。另外，SurfaceTool 还有一些便捷的方法，比如 ``generate_normals()`` 和 ``index()``\ 。
zh_tw: 使用 ArrayMesh 比使用 SurfaceTool 稍快一些，但 API 的難度更大一些。另外，SurfaceTool 還有一些便捷的方法，比如 ``generate_normals()`` 和 ``index()``。

source: ImmediateMesh is more limited than both ArrayMesh and SurfaceTool. However, if you need the geometry to change every frame anyway, it provides a much easier interface that can be slightly faster than generating an ArrayMesh every frame.
de: ImmediateMesh ist stärker eingeschränkt als ArrayMesh und SurfaceTool. Wenn sich die Geometrie jedoch ohnehin bei jedem Frame ändern muss, bietet es eine viel einfachere Schnittstelle, die etwas schneller sein kann als die Erzeugung eines ArrayMesh bei jedem Frame.
zh_cn: ImmediateMesh 比 ArrayMesh 和 SurfaceTool 受到更多限制。但是，如果你本来就需要每一帧都改变几何体，它提供的接口更简单，甚至可能比每一帧生成一个 ArrayMesh 更快。

source: The MeshDataTool is not fast, but it gives you access to all kinds of properties of the mesh that you don't get with the others (edges, faces, etc.). It is incredibly useful when you need that sort of data to transform the mesh, but it is not a good idea to use it if that extra information is not needed. The MeshDataTool is best used if you are going to be using an algorithm that requires access to the face or edge array.
de: Das MeshDataTool ist nicht schnell, aber es gibt Ihnen Zugriff auf alle möglichen Propertys des Meshes, die Sie mit den anderen nicht erhalten (Kanten, Flächen usw.). Es ist unglaublich nützlich, wenn man diese Art von Daten benötigt, um das Mesh zu transformieren, aber es ist keine gute Idee, es zu verwenden, wenn diese zusätzlichen Informationen nicht benötigt werden. Das MeshDataTool ist am besten geeignet, wenn Sie einen Algorithmus verwenden, der Zugriff auf das Flächen- oder Kanten-Array benötigt.
zh_cn: MeshDataTool 的速度并不快，但它可以让你访问网格的各种属性，而这些属性是其他工具无法获得的（边、面等）。当你需要根据这类数据来变换网格时，它是非常有用的，但如果不需要这些信息，就不适合使用。如果你要使用需要访问面数组或边数组的算法，最好使用 MeshDataTool。
zh_tw: MeshDataTool 的速度並不快，但它可以讓你存取網格的各種屬性，而這些屬性是其他工具無法獲得的（邊、面等）。當你需要根據這類資料來變換網格時，它是非常有用的，但如果不需要這些資訊，就不適合使用。如果您要使用需要存取面陣列或邊陣列的演算法，最好使用 MeshDataTool。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: ImmediateMesh
zh_tw: 即時幾何體
