Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/surfacetool.po
Languages: de, zh_tw

source: Using the SurfaceTool
de: Nutzen des SurfaceTools
zh_tw: 使用 SurfaceTool

source: The :ref:`SurfaceTool <class_surfacetool>` provides a useful interface for constructing geometry. The interface is similar to the :ref:`ImmediateMesh <class_ImmediateMesh>` node. You set each per-vertex attribute (e.g. normal, uv, color) and then when you add a vertex it captures the attributes.
de: Das :ref:`SurfaceTool <class_surfacetool>` bietet eine nützliche Schnittstelle für die Konstruktion von Geometrie. Die Schnittstelle ist ähnlich wie der :ref:`ImmediateMesh <class_ImmediateMesh>`-Node. Man setzt jedes Attribut pro Vertex (z.B. normal, uv, Farbe) und wenn man dann einen Vertex hinzufügt, werden die Attribute erfasst.
zh_tw: :ref:`SurfaceTool <class_surfacetool>` 提供了一個有用的介面來建構幾何體。這個介面類別似於 :ref:`ImmediateGeometry <class_immediategeometry>` 節點。你設定每個頂點的屬性（例如法線、uv、顏色），然後當你新增一個頂點時，它就會捕捉到這些屬性。

source: The SurfaceTool also provides some useful helper functions like ``index()`` and ``generate_normals()``.
de: Das SurfaceTool bietet auch einige nützliche Hilfsfunktionen wie ``index()`` und ``generate_normals()``.
zh_tw: SurfaceTool 還提供了一些有用的輔助函式，如 ``index()`` 和 ``generate_normals()``。

source: Attributes are added before each vertex is added:
de: Attribute werden hinzugefügt, bevor jeder Vertex hinzugefügt wird:
zh_tw: 屬性是在新增每個頂點之前新增的：

source: When finished generating your geometry with the :ref:`SurfaceTool <class_surfacetool>` call ``commit()`` to finish generating the mesh. If an :ref:`ArrayMesh <class_ArrayMesh>` is passed to ``commit()`` then it appends a new surface to the end of the ArrayMesh. While if nothing is passed in, ``commit()`` returns an ArrayMesh.
de: Wenn die Erzeugung der Geometrie mit dem :ref:`SurfaceTool <class_surfacetool>` abgeschlossen ist, rufen Sie ``commit()`` auf, um die Erzeugung des Meshs zu beenden. Wenn ein :ref:`ArrayMesh <class_ArrayMesh>` an ``commit()`` übergeben wird, dann wird eine neue Oberfläche an das Ende des ArrayMeshs angehängt. Wenn nichts übergeben wird, gibt ``commit()`` ein ArrayMesh zurück.
zh_tw: 當使用 :ref:`SurfaceTool <class_surfacetool>` 完成生成幾何體後，呼叫 ``commit()`` 完成生成網格。如果將一個 :ref:`ArrayMesh <class_ArrayMesh>` 傳遞給了 ``commit()``，那麼它就會在這個 ArrayMesh 的末尾附加一個新的表面。而如果沒有傳遞任何資訊，``commit()`` 則返回一個 ArrayMesh。

source: Code creates a triangle with indices
de: Code erstellt ein Dreieck mit Indizes
zh_tw: 程式碼建立一個有索引的三角形

source: You can optionally add an index array, either by calling ``add_index()`` and adding vertices to the index array or by calling ``index()`` which shrinks the vertex array to remove duplicate vertices.
de: Sie können optional ein Index-Array hinzufügen, entweder durch den Aufruf von ``add_index()`` und Hinzufügen von Vertices zum Index-Array oder durch den Aufruf von ``index()``, der das Vertex-Array verkleinert, um doppelte Vertices zu entfernen.
zh_tw: 你可以選擇新增一個索引陣列, 可以通過呼叫 ``add_index()`` 將頂點新增到索引陣列中, 也可以通過呼叫 ``index()`` 將頂點陣列縮小以刪除重複的頂點.

source: Similarly, if you have an index array, but you want each vertex to be unique (e.g. because you want to use unique normals or colors per face instead of per-vertex), you can call ``deindex()``.
de: Ähnlich verhält es sich, wenn Sie ein Index-Array haben, aber wollen, dass jeder Vertex eindeutig ist (z.B. weil Sie eindeutige Normalen oder Farben pro Fläche statt pro Vertex verwenden wollen), können Sie ``deindex()`` aufrufen.
zh_tw: 同樣, 如果你有一個索引陣列, 但希望每個頂點都是唯一的(例如, 因為想在每個面而不是每個頂點使用唯一的法線或顏色), 可以呼叫 ``deindex()`` .

source: If you don't add custom normals yourself, you can add them using ``generate_normals()``, which should be called after generating geometry and before committing the mesh using ``commit()`` or ``commit_to_arrays()``. Calling ``generate_normals(true)`` will flip the resulting normals. As a side note, ``generate_normals()`` only works if the primitive type is set to ``Mesh.PRIMITIVE_TRIANGLES``.
de: Wenn Sie keine eigenen Normalen hinzufügen, können Sie sie mit ``generate_normals()`` hinzufügen, was nach der Erzeugung der Geometrie und vor der Übergabe des Meshs mit ``commit()`` oder ``commit_to_arrays()`` aufgerufen werden sollte. Der Aufruf von ``generate_normals(true)`` wird die resultierenden Normalen umkehren. Nebenbei bemerkt, ``generate_normals()`` funktioniert nur, wenn der primitive Typ auf ``Mesh.PRIMITIVE_TRIANGLES`` gesetzt ist.
zh_tw: 如果你不想自行新增自訂法線，那麼可以使用 ``generate_normals()`` 來新增，呼叫時機應該是在生成幾何體之後、使用 ``commit()`` 或 ``commit_to_arrays()`` 提交網格之前。呼叫 ``generate_normals(true)`` 會將最終的法線翻轉。另外請注意，``generate_normals()`` 只有在像素型別為 ``Mesh.PRIMITIVE_TRIANGLES`` 時有效。

source: You may notice that normal mapping or other material properties look broken on the generated mesh. This is because normal mapping **requires** the mesh to feature *tangents*, which are separate from *normals*. You can either add custom tangents manually, or generate them automatically with ``generate_tangents()``. This method requires that each vertex have UVs and normals set already.
de: Möglicherweise werden Sie feststellen, dass das Normal Mapping oder andere Material-Propertys auf dem generierten Mesh nicht korrekt aussehen. Das liegt daran, dass die Normalenabbildung **erfordert**, dass das Mesh *Tangenten* aufweist, die von den *Normalen* getrennt sind. Sie können entweder manuell eigene Tangenten hinzufügen oder sie automatisch mit ``generate_tangents()`` erzeugen. Diese Methode setzt voraus, dass jeder Vertex bereits UVs und Normalen gesetzt hat.
zh_tw: 你可能發現了，在生成的網格上，法線貼圖或者其他一些材質屬性看上去不對勁。這是因為對法線貼圖而言，**必需**的是*切線*，這和*法線*是兩碼事。有兩種解決方法，手動新增切線資訊，或者使用 ``generate_tangents()`` 自動生成。這個方法要求每個頂點都已經具有 UV 和法線。

source: By default, when generating normals, they will be calculated on a per-face basis. If you want smooth vertex normals, when adding vertices, call ``add_smooth_group()``. ``add_smooth_group()`` needs to be called while building the geometry, e.g. before the call to ``add_vertex()`` (if non-indexed) or ``add_index()`` (if indexed).
de: Standardmäßig werden bei der Erzeugung von Normalen diese pro Fläche berechnet. Wenn Sie glatte Vertexnormalen wollen, rufen Sie ``add_smooth_group()`` auf, wenn Sie Vertices hinzufügen. ``add_smooth_group()`` muss während der Erstellung der Geometrie aufgerufen werden, z.B. vor dem Aufruf von ``add_vertex()`` (wenn nicht indiziert) oder ``add_index()`` (wenn indiziert).
zh_tw: 預設情況下, 當生成法線時, 它們將以每個面為基礎進行計算. 如果想要平滑的頂點法線, 在新增頂點時, 呼叫 ``add_smooth_group()`` . ``add_smooth_group()`` 需要在建立幾何體時呼叫, 例如在呼叫 ``add_vertex()`` (如果沒有索引)或 ``add_index()`` (如果有索引)之前.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
