Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: de, zh_cn

source: Signal ``raise_request`` moved to base class ``GraphElement``
de: Signal ``raise_request`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``raise_request`` 移动到基类 ``GraphElement``

source: Property ``resizable`` moved to base class ``GraphElement``
de: Property ``resizable`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 属性 ``ressized`` 移至基类 ``GraphElement``

source: Signal ``resize_request`` moved to base class ``GraphElement``
de: Signal ``resize_request`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``resize_request`` 移动到基类 ``GraphElement``

source: Property ``selectable`` moved to base class ``GraphElement``
de: Property ``selectable`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 属性 ``selectable`` 移至基类 ``GraphElement``

source: Property ``selected`` moved to base class ``GraphElement``
de: Property ``selected`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 属性 ``selected`` 移至基类 ``GraphElement``

source: Property ``show_close`` removed
de: Property ``show_close`` entfernt
zh_cn: 删除了属性 ``show_close``

source: Property ``text_direction`` removed
de: Property ``text_direction`` entfernt
zh_cn: 删除了属性 ``text_direction``

source: Property ``cell_quadrant_size`` renamed to ``rendering_quadrant_size``
de: Property ``cell_quadrant_size`` umbenannt in ``rendering_quadrant_size``
zh_cn: 属性 ``cell_quadrant_size`` 更名为 ``rendering_quadrant_size``

source: Property ``environment_blend_mode`` added
de: Property ``environment_blend_mode`` hinzugefügt
zh_cn: 新增了属性 ``environment_blend_mode``

source: This change breaks compatibility in C# because the new property conflicts with the name of an existing enum and the C# bindings generator gives priority to properties, so the enum type was renamed from ``EnvironmentBlendMode`` to ``EnvironmentBlendModeEnum``.
de: Diese Änderung führt zu einem Kompatibilitätsbruch in C#, da die neue Property mit dem Namen eines existierenden Enum kollidiert und der C# Binding-Generator den Propertys Priorität einräumt. Daher wurde der Enum-Typ von ``EnvironmentBlendMode`` in ``EnvironmentBlendModeEnum`` umbenannt.
zh_cn: 这一更改破坏了 C# 中的兼容性，因为新属性和现有枚举的名称相冲突，而 C# 绑定生成器优先考虑属性，因此枚举类型由 ``EnvironmentBlendMode`` 重命名为 ``EnvironmentBlendModeEnum``。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
