Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: de, zh_cn

source: Upgrading from Godot 4.1 to Godot 4.2
de: Upgrade von Godot 4.1 auf Godot 4.2
zh_cn: 从 Godot 4.1 升级到 Godot 4.2

source: For most games and apps made with 4.1 it should be relatively safe to migrate to 4.2. This page intends to cover everything you need to pay attention to when migrating your project.
de: Für die meisten Spiele und Anwendungen, die mit 4.1 entwickelt wurden, sollte es relativ sicher sein, auf 4.2 zu migrieren. Diese Seite soll alles abdecken, worauf Sie bei der Migration Ihres Projekts achten müssen.
zh_cn: 对于大多数使用 4.1 制作的游戏和应用程序来说，迁移到 4.2 应该相对安全。本页旨在介绍迁移项目时需要注意的所有事项。

source: Breaking changes
de: Änderungen, die etwas kaputtmachen können
zh_cn: 破坏性更改

source: If you are migrating from 4.1 to 4.2, the breaking changes listed here might affect you. Changes are grouped by areas/systems.
de: Wenn Sie von 4.1 auf 4.2 migrieren, könnten Sie von den hier aufgeführten Änderungen betroffen sein. Die Änderungen sind nach Bereichen/Systemen gruppiert.
zh_cn: 如果你要从 4.1 迁移到 4.2，这里列出的破坏性更改可能会影响到你。更改按照领域/系统分组。

source: The :ref:`class_Mesh` resource format has changed in 4.2 to allow for `vertex and attribute compression <https://github.com/godotengine/godot/pull/81138>`__. This allows for improved rendering performance, especially on platforms constrained by memory bandwidth such as mobile.
de: Das :ref:`class_Mesh`-Ressourcenformat hat sich in 4.2 geändert, um eine `Vertex- und Attributkompression <https://github.com/godotengine/godot/pull/81138>`__ zu ermöglichen. Dies ermöglicht eine verbesserte Rendering-Leistung, insbesondere auf Plattformen mit eingeschränkter Speicherbandbreite, wie z.B. auf mobilen Geräten.
zh_cn: :ref:`class_Mesh` 资源格式在 4.2 中已更改，以允许 `顶点和属性压缩 <https://github.com/godotengine/godot/pull/81138>`__ 。这个更改可以提高渲染性能，尤其是在受内存带宽限制的平台（例如移动设备）上。

source: It is still possible to load the Godot 4.0-4.1 Mesh formats, but it is **not** possible to load the Godot 4.2 Mesh format in prior Godot versions. When opening a Godot project made with a version prior to 4.2, you may be presented with an upgrade dialog that offers two options:
de: Es ist immer noch möglich, die Godot 4.0-4.1 Mesh-Formate zu laden, aber es ist **nicht** möglich, das Godot 4.2 Mesh-Format in früheren Godot-Versionen zu laden. Wenn Sie ein Godot-Projekt öffnen, das mit einer Version vor 4.2 erstellt wurde, wird möglicherweise ein Upgrade-Dialog angezeigt, der zwei Optionen bietet:
zh_cn: 仍然可以加载 Godot 4.0-4.1 Mesh 格式，但在之前的 Godot 版本中 **不可能** 加载 Godot 4.2 Mesh 格式。打开使用 4.2 之前版本创建的 Godot 项目时，可能会出现一个升级对话框，其中会提供两个选项：

source: **Restart & Upgrade:** Upgrades the mesh format for all meshes in the project and saves the result to disk. Once chosen, this option prevents downgrading the project to a Godot version prior to 4.2. Set up a version control system and push your changes *before* choosing this option!
de: **Neustart & Upgrade:** Aktualisiert das Mesh-Format für alle Meshes im Projekt und speichert das Ergebnis auf der Festplatte. Einmal gewählt, verhindert diese Option ein Downgrade des Projekts auf eine Godot-Version vor 4.2. Richten Sie ein Versionsverwaltungssystem ein und pushen Sie Ihre Änderungen *vor* der Auswahl dieser Option!
zh_cn: **重启并升级：** 升级项目中所有网格的网格格式，并将结果保存到磁盘。一旦选择，此选项可以防止将项目降级到 4.2 之前的 Godot 版本。请设置版本控制系统，并在 *选择此选项之前* 推送你的更改！

source: **Upgrade Only:** Upgrades the mesh format in-memory without writing it to disk. This allows downgrading the project to a Godot version older than 4.2 if you need to do so in the future. The downside is that loading the project will be slower every time as the mesh format needs to be upgraded every time the project is loaded. These increased loading times will also affect the exported project. The number and complexity of Mesh resources determines how much loading times are affected.
de: **Nur Upgrade:** Aktualisiert das Meshformat im Speicher, ohne es auf die Festplatte zu schreiben. Dies ermöglicht ein Downgrade des Projekts auf eine Godot-Version, die älter als 4.2 ist, falls Sie dies in Zukunft benötigen. Der Nachteil ist, dass das Laden des Projekts jedes Mal langsamer wird, da das Mesh-Format jedes Mal aktualisiert werden muss, wenn das Projekt geladen wird. Diese längeren Ladezeiten wirken sich auch auf das exportierte Projekt aus. Die Anzahl und Komplexität der Mesh-Ressourcen bestimmt, wie stark die Ladezeiten beeinflusst werden.
zh_cn: **仅升级：** 升级内存中的网格格式，但不将升级结果写入磁盘。如果将来有需要，这个设置可允许你将项目降级回到 4.2 之前的 Godot 版本。这个设置的缺点是每次加载项目都会变慢，因为每次加载项目时都需要升级网格格式。这些增加的加载时间也会影响导出的项目。 Mesh 资源的数量和复杂度决定了加载时间受影响的程度。

source: If this dialog doesn't appear, use **Project > Tools > Upgrade Mesh Surfaces…** at the top of the editor.
de: Wenn dieser Dialog nicht erscheint, verwenden Sie **Projekt > Tools > Mesh-Oberflächen aktualisieren...** oben im Editor.
zh_cn: 如果该对话框没有出现，请使用编辑器顶端的 **项目 > 工具 > 升级网格表面...**。

source: This article indicates whether each breaking change affects GDScript and whether the C# breaking change is *binary compatible* or *source compatible*:
de: Dieser Artikel gibt an, ob die einzelnen Änderungen GDScript betreffen und ob die C#-Änderung *binärkompatibel* oder *quelltextkompatibel* ist:
zh_cn: 这篇文章指出了每项破坏性改动是否会影响 GDScript，以及 C# 的破坏性改动是 *二进制兼容* 还是 *源代码兼容*\ ：

source: **Binary compatible** - Existing binaries will load and execute successfully without recompilation, and the run-time behavior won't change.
de: **Binärkompatibel** - Vorhandene Binärdateien werden ohne Neukompilierung erfolgreich geladen und ausgeführt, und das Laufzeitverhalten ändert sich nicht.
zh_cn: **二进制兼容** —— 现有二进制文件无需重新编译即可加载并成功执行，运行时的行为不会改变。

source: **Source compatible** - Source code will compile successfully without changes when upgrading Godot.
de: **Quellcodekompatibel** - Der Quellcode wird beim Upgrade von Godot ohne Änderungen erfolgreich kompiliert.
zh_cn: ** 源代码兼容** —— 在升级 Godot 时，源代码可成功编译，无需更改。

source: Core
de: Kern
zh_cn: 核心

source: Change
de: Veränderung
zh_cn: 更改

source: GDScript Compatible
de: GDScript- kompatibel
zh_cn: GDScript 兼容

source: C# Binary Compatible
de: C#-binär- kompatibel
zh_cn: C# 二进制兼容

source: C# Source Compatible
de: C#-quellcode- kompatibel
zh_cn: C# 源代码兼容

source: Introduced
de: Eingeführt in
zh_cn: 引入

source: **Node**
zh_cn: **节点**

source: Constant ``NOTIFICATION_NODE_RECACHE_REQUESTED`` removed
de: Konstante ``NOTIFICATION_NODE_RECACHE_REQUESTED`` entfernt
zh_cn: 常量 ``NOTIFICATION_NODE_RECACHE_REQUESTED`` 已被删除

source: Animation
zh_cn: 动画

source: Method ``_post_process_key_value`` moved to base class ``AnimationMixer``
de: Methode ``_post_process_key_value`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``_post_process_key_value`` 移动到基类 ``AnimationMixer``

source: Method ``add_animation_library`` moved to base class ``AnimationMixer``
de: Methode ``add_animation_library`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``add_animation_library`` 移动到基类 ``AnimationMixer``

source: Method ``advance`` moved to base class ``AnimationMixer``
de: Methode ``advance`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``advance`` 移至基类 ``AnimationMixer``

source: Signal ``animation_finished`` moved to base class ``AnimationMixer``
de: Signal ``Animation_finished`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 信号 ``animation_finished`` 移动到基类 ``AnimationMixer``

source: Signal ``animation_started`` moved to base class ``AnimationMixer``
de: Signal ``Animation_started`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 信号 ``animation_started`` 移动到基类 ``AnimationMixer``

source: Signal ``animation_libraries_updated`` moved to base class ``AnimationMixer``
de: Signal ``animation_libraries_updated`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 信号 ``animation_libraries_updated`` 移动到基类 ``AnimationMixer``

source: Signal ``animation_list_changed`` moved to base class ``AnimationMixer``
de: Signal ``animation_list_changed`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 信号 ``animation_list_changed`` 移动到基类 ``AnimationMixer``

source: Property ``audio_max_polyphony`` moved to base class ``AnimationMixer``
de: Property ``audio_max_polyphony`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``audio_max_polyphony`` 移动到基类 ``AnimationMixer``

source: Signal ``caches_cleared`` moved to base class ``AnimationMixer``
de: Signal ``caches_cleared`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 信号 ``caches_cleared`` 移动到基类 ``AnimationMixer``

source: Method ``clear_caches`` moved to base class ``AnimationMixer``
de: Methode ``clear_caches`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``clear_caches`` 移至基类 ``AnimationMixer``

source: Method ``find_animation`` moved to base class ``AnimationMixer``
de: Methode ``find_animation`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``find_animation`` 移至基类 ``AnimationMixer``

source: Method ``find_animation_library`` moved to base class ``AnimationMixer``
de: Methode ``find_animation_library`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``find_animation_library`` 移动到基类 ``AnimationMixer``

source: Method ``get_animation`` moved to base class ``AnimationMixer``
de: Methode ``get_animation`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_animation`` 移至基类 ``AnimationMixer``

source: Method ``get_animation_library`` moved to base class ``AnimationMixer``
de: Methode ``get_animation_library`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_animation_library`` 移动到基类 ``AnimationMixer``

source: Method ``get_animation_library_list`` moved to base class ``AnimationMixer``
de: Methode ``get_animation_library_list`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_animation_library_list`` 移至基类 ``AnimationMixer``

source: Method ``get_animation_list`` moved to base class ``AnimationMixer``
de: Methode ``get_animation_list`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_animation_list`` 移至基类 ``AnimationMixer``

source: Method ``has_animation`` moved to base class ``AnimationMixer``
de: Methode ``has_animation`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``has_animation`` 移至基类 ``AnimationMixer``

source: Method ``has_animation_library`` moved to base class ``AnimationMixer``
de: Methode ``has_animation_library`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``has_animation_library`` 移动到基类 ``AnimationMixer``

source: Property ``method_call_mode`` renamed to ``callback_mode_method`` and moved to base class ``AnimationMixer``
de: Property ``method_call_mode`` umbenannt in ``callback_mode_method`` und in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``method_call_mode`` 重命名为 ``callback_mode_method`` ，并移至基类 ``AnimationMixer``

source: Property ``playback_active`` renamed to ``active`` and moved to base class ``AnimationMixer``
de: Property ``playback_active`` umbenannt in ``active`` und in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``playback_active`` 重命名为 ``active`` ，并移至基类 ``AnimationMixer``

source: Property ``playback_process_mode`` renamed to ``callback_mode_process`` and moved to base class ``AnimationMixer``
de: Property ``playback_process_mode`` umbenannt in ``callback_mode_process`` und in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``playback_process_mode`` 重命名为 ``callback_mode_process`` ，并移动到基类 ``AnimationMixer``

source: Method ``remove_animation_library`` moved to base class ``AnimationMixer``
de: Methode ``remove_animation_library`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``remove_animation_library`` 移动到基类 ``AnimationMixer``

source: Method ``rename_animation_library`` moved to base class ``AnimationMixer``
de: Methode ``rename_animation_library`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``rename_animation_library`` 移动到基类 ``AnimationMixer``

source: Property ``reset_on_save`` moved to base class ``AnimationMixer``
de: Property ``reset_on_save`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``reset_on_save`` 移至基类 ``AnimationMixer``

source: Property ``root_node`` moved to base class ``AnimationMixer``
de: Property ``root_node`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``root_node`` 移动到基类 ``AnimationMixer``

source: Method ``set_reset_on_save_enabled`` moved to base class ``AnimationMixer``
de: Methode ``set_reset_on_save_enabled`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``set_reset_on_save_enabled`` 移至基类 ``AnimationMixer``

source: Method ``seek`` adds a new ``update_only`` optional parameter
de: Methode ``seek`` bekommt einen neuen optionalen Parameter ``update_only``
zh_cn: 方法 ``seek`` 添加了一个新的 ``update_only`` 可选参数

source: Property ``active`` moved to base class ``AnimationMixer``
de: Property ``active`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``active`` 移至基类 ``AnimationMixer``

source: Method ``get_root_motion_position`` moved to base class ``AnimationMixer``
de: Methode ``get_root_motion_position`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_root_motion_position`` 移至基类 ``AnimationMixer``

source: Method ``get_root_motion_position_accumulator`` moved to base class ``AnimationMixer``
de: Methode ``get_root_motion_position_accumulator`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_root_motion_position_accumulator`` 移动到基类 ``AnimationMixer``

source: Method ``get_root_motion_rotation`` moved to base class ``AnimationMixer``
de: Methode ``get_root_motion_rotation`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_root_motion_rotation`` 移至基类 ``AnimationMixer``

source: Method ``get_root_motion_rotation_accumulator`` moved to base class ``AnimationMixer``
de: Methode ``get_root_motion_rotation_accumulator`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_root_motion_rotation_accumulator`` 移动到基类 ``AnimationMixer``

source: Method ``get_root_motion_scale`` moved to base class ``AnimationMixer``
de: Methode ``get_root_motion_scale`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_root_motion_scale`` 移至基类 ``AnimationMixer``

source: Method ``get_root_motion_scale_accumulator`` moved to base class ``AnimationMixer``
de: Methode ``get_root_motion_scale_accumulator`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 方法 ``get_root_motion_scale_accumulator`` 移至基类 ``AnimationMixer``

source: Property ``process_callback`` renamed to ``callback_mode_process`` and moved to base class ``AnimationMixer``
de: Property ``process_callback`` umbenannt in ``callback_mode_process`` und in die Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``process_callback`` 重命名为 ``callback_mode_process`` ，并移至基类 ``AnimationMixer``

source: Property ``root_motion_track`` moved to base class ``AnimationMixer``
de: Property ``root_motion_track`` in Basisklasse ``AnimationMixer`` verschoben
zh_cn: 属性 ``root_motion_track`` 移动到基类 ``AnimationMixer``

source: Property ``tree_root`` changes type from ``AnimationNode`` to ``AnimationRootNode``
de: Property ``tree_root`` ändert Typ von ``AnimationNode`` in ``AnimationRootNode``
zh_cn: 属性 ``tree_root`` 的类型从 ``AnimationNode`` 改为 ``AnimationRootNode``

source: GUI nodes
zh_cn: GUI 节点

source: Method ``add_icon_shortcut`` adds a new ``allow_echo`` optional parameter
de: Methode ``add_icon_shortcut`` bekommt einen neuen optionalen Parameter ``allow_echo``
zh_cn: ``add_icon_shortcut`` 方法增加了一个新的 ``allow_echo`` 可选参数

source: Method ``add_shortcut`` adds a new ``allow_echo`` optional parameter
de: Methode ``add_shortcut`` bekommt einen neuen optionalen Parameter ``allow_echo``
zh_cn: ``add_shortcut`` 方法增加了一个新的 ``allow_echo`` 可选参数

source: Method ``clear`` adds a new ``free_submenus`` optional parameter
de: Methode ``clear`` bekommt einen neuen optionalen Parameter ``free_submenus``
zh_cn: 方法 ``clear`` 添加了一个新的 ``free_submenus`` 可选参数

source: Method ``add_image`` adds new ``key``, ``pad``, ``tooltip``, and ``size_in_percent`` optional parameters
de: Methode ``add_image`` bekommt neue optionale Parameter ``key``, ``pad``, ``tooltip`` und ``size_in_percent``
zh_cn: 方法 ``add_image`` 添加新的 ``key`` 、 ``pad`` 、 ``tooltip`` 和 ``size_in_percent`` 可选参数

source: Rendering
de: Rendern
zh_cn: 渲染

source: Method ``add_surface`` changes ``flags`` parameter type from ``uint32`` to ``uint64``
de: Methode ``add_surface`` ändert den Typ des Parameters ``flags`` von ``uint32`` auf ``uint64``
zh_cn: 方法 ``add_surface`` 将 ``flags`` 参数类型从 ``uint32`` 更改为 ``uint64``

source: Method ``get_surface_format`` changes return type from ``uint32`` to ``uint64``
de: Methode ``get_surface_format`` ändert Rückgabetyp von ``uint32`` auf ``uint64``
zh_cn: 方法 ``get_surface_format`` 将返回类型从 ``uint32`` 更改为 ``uint64``

source: Method ``commit_to_surface`` adds a new ``compression_flags`` optional parameter
de: Methode ``commit_to_surface`` bekommt einen neuen optionalen Parameter ``compression_flags``
zh_cn: 方法 ``commit_to_surface`` 添加了一个新的 ``compression_flags`` 可选参数

source: Method ``get_format`` changes return type from ``uint32`` to ``uint64``
de: Methode ``get_format`` ändert Rückgabetyp von ``uint32`` auf ``uint64``
zh_cn: 方法 ``get_format`` 将返回类型从 ``uint32`` 更改为 ``uint64``

source: Enum field ``BarrierMask.BARRIER_MASK_RASTER`` changes value from ``1`` to ``9``
de: Enum-Feld ``BarrierMask.BARRIER_MASK_RASTER`` ändert Wert von ``1`` auf ``9``
zh_cn: 枚举字段 ``BarrierMask.BARRIER_MASK_RASTER`` 将值从 ``1`` 更改为 ``9``

source: Enum field ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` changes value from ``7`` to ``32767``
de: Enum-Feld ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` ändert Wert von ``7`` auf ``32767``
zh_cn: 枚举字段 ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` 将值从 ``7`` 更改为 ``32767``

source: Enum field ``BarrierMask.BARRIER_MASK_NO_BARRIER`` changes value from ``8`` to ``32768``
de: Enum-Feld ``BarrierMask.BARRIER_MASK_NO_BARRIER`` ändert Wert von ``8`` auf ``32768``
zh_cn: 枚举字段 ``BarrierMask.BARRIER_MASK_NO_BARRIER`` 将值从 ``8`` 更改为 ``32768``

source: Method ``shader_create_from_bytecode`` adds a new ``placeholder_rid`` optional parameter
de: Methode ``shader_create_from_bytecode`` bekommt einen neuen optionalen Parameter ``placeholder_rid``
zh_cn: 方法 ``shader_create_from_bytecode`` 添加了一个新的 ``placeholder_rid`` 可选参数

source: Method ``shader_get_vertex_input_attribute_ask`` changes return type from ``uint32`` to ``uint64``
de: Methode ``shader_get_vertex_input_attribute_ask`` ändert Rückgabetyp von ``uint32`` auf ``uint64``
zh_cn: 方法 ``shader_get_vertex_input_attribute_ask`` 将返回类型从 ``uint32`` 更改为 ``uint64``

source: Method ``commit`` changes ``flags`` parameter type from ``uint32`` to ``uint64``
de: Methode ``commit`` ändert den Typ des Parameters ``flags`` von ``uint32`` auf ``uint64``
zh_cn: 方法 ``commit`` 将 ``flags`` 参数类型从 ``uint32`` 更改为 ``uint64``

source: Text
zh_cn: 文本

source: **Font**
zh_cn: **字体**

source: Method ``set_fallbacks`` replaced with ``fallbacks`` property
de: Methode ``set_fallbacks`` ersetzt durch die Property ``fallbacks``
zh_cn: 方法 ``set_fallbacks`` 替换为 ``fallbacks`` 属性

source: Method ``get_fallbacks`` replaced with ``fallbacks`` property
de: Methode ``get_fallbacks`` ersetzt durch die Property ``fallbacks``
zh_cn: 方法 ``get_fallbacks`` 替换为 ``fallbacks`` 属性

source: Method ``find_variation`` adds new ``spacing_top``, ``spacing_bottom``, ``spacing_space``, and ``spacing_glyph`` optional parameters
de: Methode ``find_variation`` bekommt neue optionale Parameter ``spacing_top``, ``spacing_bottom``, ``spacing_space`` und ``spacing_glyph``
zh_cn: 方法 ``find_variation`` 添加了新的可选参数： ``spacing_top`` 、 ``spacing_bottom`` 、 ``spacing_space`` 、 ``spacing_glyph``

source: Property ``arrange_nodes_button_hidden`` renamed to ``show_arrange_button``
de: Property ``arrange_nodes_button_hidden`` umbenannt in ``show_arrange_button``
zh_cn: 属性 ``arrange_nodes_button_hidden`` 更名为 ``show_arrange_button``

source: Method ``get_zoom_hbox`` renamed to ``get_menu_hbox``
de: Methode ``get_zoom_hbox`` umbenannt in ``get_menu_hbox``
zh_cn: 方法 ``get_zoom_hbox`` 更名为 ``get_menu_hbox``

source: Property ``snap_distance`` renamed to ``snapping_distance``
de: Property ``snap_distance`` umbenannt in ``snapping_distance``
zh_cn: 属性 ``snap_distance`` 更名为 ``snapping_distance``

source: Property ``use_snap`` renamed to ``snapping_enabled``
de: Property ``snap_distance`` umbenannt in ``snapping_distance``
zh_cn: 属性 ``use_snap`` 更名为 ``snapping_enabled``

source: Property ``comment`` removed
de: Property ``comment`` entfernt
zh_cn: 删除了属性 ``comment``

source: Signal ``close_request`` renamed to ``delete_request`` and moved to base class ``GraphElement``
de: Signal ``close_request`` umbenannt in ``delete_request`` und in die Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``close_request`` 重命名为 ``delete_request`` ，并移至基类 ``GraphElement``

source: Property ``draggable`` moved to base class ``GraphElement``
de: Property ``draggable`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 属性 ``draggable`` 移至基类 ``GraphElement``

source: Signal ``dragged`` moved to base class ``GraphElement``
de: Signal ``dragged`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``dragged`` 移动到基类 ``GraphElement``

source: Method ``get_connection_input_color`` removed
de: Methode ``get_connection_input_color`` entfernt
zh_cn: 删除了方法 ``get_connection_input_color``

source: Method ``get_connection_input_count`` removed
de: Methode ``get_connection_input_count`` entfernt
zh_cn: 删除了方法 ``get_connection_input_count``

source: Method ``get_connection_input_height`` removed
de: Methode ``get_connection_input_height`` entfernt
zh_cn: 删除了方法 ``get_connection_input_height``

source: Method ``get_connection_input_position`` removed
de: Methode ``get_connection_input_position`` entfernt
zh_cn: 删除了方法 ``get_connection_input_position``

source: Method ``get_connection_input_slot`` removed
de: Methode ``get_connection_input_slot`` entfernt
zh_cn: 删除了方法 ``get_connection_input_slot``

source: Method ``get_connection_input_type`` removed
de: Methode ``get_connection_input_type`` entfernt
zh_cn: 删除了方法 ``get_connection_input_type``

source: Method ``get_connection_output_color`` removed
de: Methode ``get_connection_output_color`` entfernt
zh_cn: 删除了方法 ``get_connection_output_color``

source: Method ``get_connection_output_count`` removed
de: Methode ``get_connection_output_count`` entfernt
zh_cn: 删除了方法 ``get_connection_output_count``

source: Method ``get_connection_output_height`` removed
de: Methode ``get_connection_output_height`` entfernt
zh_cn: 删除了方法 ``get_connection_output_height``

source: Method ``get_connection_output_position`` removed
de: Methode ``get_connection_output_position`` entfernt
zh_cn: 删除了方法 ``get_connection_output_position``

source: Method ``get_connection_output_slot`` removed
de: Methode ``get_connection_output_slot`` entfernt
zh_cn: 删除了方法 ``get_connection_output_slot``

source: Method ``get_connection_output_type`` removed
de: Methode ``get_connection_output_type`` entfernt
zh_cn: 删除了方法 ``get_connection_output_type``

source: Property ``language`` removed
de: Property ``language`` entfernt
zh_cn: 删除了属性 ``language``

source: Signal ``node_deselected`` moved to base class ``GraphElement``
de: Signal ``node_deselected`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``node_deselected`` 移动到基类 ``GraphElement``

source: Signal ``node_selected`` moved to base class ``GraphElement``
de: Signal ``node_selected`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``node_selected`` 移动到基类 ``GraphElement``

source: Property ``overlay`` removed
de: Property ``overlay`` entfernt
zh_cn: 删除了属性 ``overlay``

source: Property ``position_offset`` moved to base class ``GraphElement``
de: Property ``position_offset`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 属性 ``position_offset`` 移动到基类 ``GraphElement``

source: Signal ``position_offset_changed`` moved to base class ``GraphElement``
de: Signal ``position_offset_changed`` in Basisklasse ``GraphElement`` verschoben
zh_cn: 信号 ``position_offset_changed`` 移动到基类 ``GraphElement``
