Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/deploying_to_android.po
Languages: de, zh_tw

source: Deploying to Android
de: Auslieferung für Android
zh_tw: 正在為Android匯出

source: Setup
de: Einrichtung
zh_tw: 設定

source: Most standalone headsets run on Android and OpenXR support is making its way to these platforms.
de: Die meisten Standalone-Headsets laufen unter Android, und die OpenXR-Unterstützung macht sich auf dem Weg zu diesen Plattformen.
zh_tw: 大多數獨立耳機都在 Android 上運作，而 OpenXR 支援正在進入這些平台。

source: Before following the OpenXR-specific instructions here, you'll need to first setup your system to export to Android in general, including:
de: Bevor Sie die OpenXR-spezifischen Anweisungen befolgen, müssen Sie zunächst Ihr System für den Export zu Android im Allgemeinen einrichten, einschließlich:
zh_tw: 在遵循此處特定於 OpenXR 的說明之前，您需要先設定係統以匯出到 Android，包括：

source: Installing OpenJDK 17
de: Installieren von OpenJDK 17

source: Installing Android Studio
de: Installieren von Android Studio
zh_tw: 安裝 Android Studio

source: Creating a debug.keystore
de: Erstellen eines debug.keystore
zh_tw: 建立 debug.keystore

source: Configuring the location of the Android SDK and debug.keystore in Godot
de: Konfiguration des Speicherorts von Android SDK und debug.keystore in Godot
zh_tw: 配置Godot中Android SDK和debug.keystore的位置

source: See :ref:`doc_exporting_for_android` for the full details, and return here when you've finished these steps.
de: Siehe :ref:`doc_exporting_for_android` für die vollständigen Details. Kehren Sie hierher zurück, wenn Sie diese Schritte abgeschlossen haben.
zh_tw: 請參閱 doc_exporting_for_android 以了解完整詳細信息，並在完成這些步驟後返回此處。

source: Official support for the Android platform wasn't added to the OpenXR specification initially resulting in various vendors creating custom loaders to make OpenXR available on their headsets. While the long term expectation is that all vendors will adopt the official OpenXR loader, for now these loaders need to be added to your project.
de: Offizielle Unterstützung für die Android-Plattform wurde der OpenXR-Spezifikation zunächst nicht hinzugefügt, was dazu führte, dass verschiedene Anbieter eigene Loader erstellten, um OpenXR auf ihren Headsets verfügbar zu machen. Langfristig ist zu erwarten, dass alle Anbieter den offiziellen OpenXR-Loader übernehmen, aber zunächst müssen diese Loader zu Ihrem Projekt hinzugefügt werden.
zh_tw: OpenXR 規範並未新增對 Android 平台的官方支援，最初導致各個供應商建立自訂載入器以使 OpenXR 在其耳機上可用。雖然長期期望所有供應商都將採用官方 OpenXR 載入器，但目前需要將這些載入器新增到您的專案中。

source: In order to include the vendor-specific OpenXR loader into your project, you will need to setup a gradle Android build.
de: Um den herstellerspezifischen OpenXR-Loader in Ihr Projekt einzubinden, müssen Sie einen Gradle-Android-Build einrichten.

source: Select **Install Android Build Template...** from the **Project** menu:
de: Wählen Sie **Android Build Template installieren...** aus dem Menü **Projekt**:
zh_tw: 從 **專案* 選單中選擇 **安裝 Android 建置範本...**：

source: This will create a folder called **android** inside of your project that contains all the runtime files needed on Android. You can now customize this installation. Godot won't show this in the editor but you can find it with a file browser.
de: Dadurch wird ein Ordner namens **android** innerhalb Ihres Projekts erstellt, der alle für Android benötigten Runtimes enthält. Sie können diese Installation nun anpassen. Godot zeigt dies nicht im Editor an, aber Sie können es mit einem Dateibrowser finden.
zh_tw: 這將在您的專案中建立一個名為 **android** 的資料夾，其中包含 Android 上所需的所有運作時檔案。現在您可以自訂此安裝。 Godot 不會在編輯器中顯示它，但您可以使用檔案瀏覽器找到它。

source: You can read more about gradle builds here: :ref:`doc_android_gradle_build`.
de: Sie können mehr über Gradle-Builds hier lesen: :ref:`doc_android_gradle_build`.

source: Installing the vendors plugin
de: Installation des Vendors-Plugins

source: You will find the installed files inside the **addons** folder.
de: Sie finden die installierten Dateien im Ordner **addons**.
zh_tw: 這會將所需檔案下載到該資料夾中.

source: Alternatively you can manually install the vendors plugin by downloading the v2.x version of the plugin `from the release page here <https://github.com/GodotVR/godot_openxr_vendors/releases>`__.
de: Alternativ können Sie das Vendors-Plugin auch manuell installieren, indem Sie die Version 2.x des Plugins `von der Release-Seite <https://github.com/GodotVR/godot_openxr_vendors/releases>`__ herunterladen.

source: You can find the main repository of the vendors plugin `here <https://github.com/GodotVR/godot_openxr_vendors>`__.
de: Das Haupt-Repository des Vendors-Plugins finden Sie `hier <https://github.com/GodotVR/godot_openxr_vendors>`__.

source: Enabling the vendors plugin
de: Aktivieren des Vendors-Plugins

source: The vendors plugin needs to be enabled before the export settings become accessible. Open **Project** and select **Project Settings...**. Go to the **Plugins** tab. Enable the **GodotOpenXRVendors** plugin.
de: Das Vendors-Plugin muss aktiviert werden, bevor die Exporteinstellungen zugänglich sind. Öffnen Sie **Projekt** und wählen Sie **Projekteinstellungen...**. Wechseln Sie zum **Plugins**-Tab. Aktivieren Sie das Plugin **GodotOpenXRVendors**.

source: Creating the export presets
de: Erstellen der Export-Vorgaben
zh_tw: 建立 UWP 匯出樣板

source: You will need to setup a separate export preset for each device, as each device will need its own loader included.
de: Sie müssen für jedes Gerät eine eigene Exportvorgabe einrichten, da jedes Gerät seinen eigenen Loader benötigt.
zh_tw: 您需要為每個裝置設定單獨的匯出預設，因為每個裝置都需要包含自己的載入程式。

source: Open **Project** and select **Export..**. Click on **Add..** and select **Android**. Next change the name of the export preset for the device you're setting this up for, say **Meta Quest**. And enable **Use Gradle Build**. If you want to use one-click deploy (described below), ensure that **Runnable** is enabled.
de: Öffnen Sie **Projekt** und wählen Sie **Exportieren...**. Klicken Sie auf **Hinzufügen...** und wählen Sie **Android**. Ändern Sie als nächstes den Namen der Exportvorgabe für das Gerät, für das Sie dies einrichten möchten, z. B. **Meta Quest**. Und aktivieren Sie **Use Gradle Build**. Wenn Sie die Ein-Klick-Bereitstellung verwenden möchten (siehe unten), stellen Sie sicher, dass **Runnable** aktiviert ist.
zh_tw: 開啟**專案**並選擇**匯出..**。點擊“**新增..**”並選擇“**Android**”。接下來更改您要設定的裝置的匯出預設的名稱，例如 **Meta Quest**。並啟用**使用 Gradle Build**。如果您想使用一鍵部署（如下所述），請確保啟用 **Runnable**。

source: If the loader plugins were installed correctly you should find entries for the different headsets, select the entry for meta:
de: Wenn die Loader-Plugins korrekt installiert wurden, sollten Sie Einträge für die verschiedenen Headsets finden, wählen Sie den Eintrag für Meta:
zh_tw: 如果加載器插件安裝正確，您應該找到不同耳機的條目，選擇元條目：

source: Also change the **XR Mode** to **OpenXR**.
de: Ändern Sie außerdem den **XR-Modus** in **OpenXR**.
zh_tw: 也將 **XR 模式** 變更為 **OpenXR**。

source: Scroll to the bottom of the list and you'll find additional XR feature sections, currently only **Meta XR Features** is available. The hand tracking and passthrough settings here currently only work for the Meta Quest and you will need to select the appropriate settings if you wish to use these features.
de: Scrollen Sie zum Ende der Liste und Sie werden zusätzliche XR-Feature-Abschnitte finden, derzeit ist nur **Meta XR Features** verfügbar. Die Handtracking- und Passthrough-Einstellungen hier funktionieren derzeit nur für die Meta Quest und Sie müssen die entsprechenden Einstellungen auswählen, wenn Sie diese Features nutzen möchten.
zh_tw: 捲動到列表底部，您會發現其他 XR 功能部分，目前僅**元 XR 功能**可用。此處的手部追蹤和直通設定目前僅適用於 Meta Quest，如果您想使用這些功能，則需要選擇適當的設定。

source: Now you can repeat the same process for the other devices.
de: Nun können Sie den gleichen Vorgang für die anderen Geräte wiederholen.
zh_tw: 灰色的節點無法重新命名。代表這些節點有母場景

source: There are separate loaders for the Meta Quest, Pico and Lynx R1 headsets.
de: Es gibt separate Loader für die Headsets Meta Quest, Pico und Lynx R1.
zh_tw: Meta Quest、Pico 和 Lynx R1 耳機有單獨的載入程式。

source: The fourth option is the official Khronos loader, in due time all headsets should work with this loader. At the moment this loader has been tested with the Magic Leap 2 and standalone HTC headsets.
de: Die vierte Option ist der offizielle Khronos-Loader, mit dem in absehbarer Zeit alle Headsets funktionieren sollten. Im Moment wurde dieser Loader mit dem Magic Leap 2 und Standalone-HTC-Headsets getestet.

source: Running on your device from the Godot editor
de: Ausführung auf Ihrem Gerät vom Godot-Editor aus
zh_tw: 通過 Godot 編輯器在裝置上運作

source: If you've setup your export settings as described above, and your headset is connected to your computer and correctly recognized, you can launch it directly from the Godot editor using :ref:`doc_one-click_deploy`:
de: Wenn Sie Ihre Exporteinstellungen wie oben beschrieben vorgenommen haben und Ihr Headset an Ihren Computer angeschlossen ist und korrekt erkannt wird, können Sie es direkt aus dem Godot-Editor mit :ref:`doc_one-click_deploy` starten:
zh_tw: 使用 :ref:`doc_one-click_deploy`直接從 Godot 編輯器啟動它：

source: For some devices on some platforms, you may need to perform some extra steps in order for your device to be recognized correctly, so be sure to check the developer documentation from your headset vendor.
de: Für einige Geräte auf einigen Plattformen müssen Sie möglicherweise einige zusätzliche Schritte durchführen, damit Ihr Gerät korrekt erkannt wird.
zh_tw: 對於某些平台上的某些裝置，您可能需要執行一些額外的步驟才能正確識別您的裝置，因此請務必檢查耳機供應商的開發人員檔案。

source: For example, with the Meta Quest 2, you need to enable developer mode on the headset, and if you're on Windows, you'll need to install special ADB drivers. See the `official Meta Quest developer documentation <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_ for more details.
de: Beim Meta Quest 2 müssen Sie beispielsweise den Entwicklermodus auf dem Headset aktivieren, und wenn Sie Windows verwenden, müssen Sie spezielle ADB-Treiber installieren. Weitere Einzelheiten finden Sie in der `offiziellen Meta Quest-Entwicklerdokumentation <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_.
zh_tw: 只有開啟開發者模式，才能夠向 Meta Quest 部署遊戲。這個模式可以使用手機上安裝的 Oculus 支援應用開啟。請`按照 Oculus 開發者網站上的說明操作 <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`__。

source: If you're having any issues with one-click deploy, check the :ref:`Troubleshooting section <doc_one-click_deploy_troubleshooting>`.
de: Wenn Sie Probleme mit der Ein-Klick-Bereitstellung haben, lesen Sie den :ref:`Abschnitt Troubleshooting <doc_one-click_deploy_troubleshooting>`.
zh_tw: 如果您對一鍵部署有任何問題，請檢查:ref:`故障排除部分 <doc_one-click_deploy_troubleshooting>`。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
