Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/introducing_xr_tools.po
Languages: de, zh_tw

source: Introducing XR tools
de: Einführung in XR-Tools
zh_tw: 匯出簡介

source: Out of the box Godot gives you all the basic support to setup an XR project. XR specific game mechanics however need to be implemented on top of this foundation. While Godot makes this relatively easy this can still be a daunting task.
de: Godot bietet Ihnen von Haus aus die grundlegende Unterstützung für die Einrichtung eines XR-Projekts. XR-spezifische Spielmechaniken müssen jedoch auf dieser Grundlage implementiert werden. Obwohl Godot dies relativ einfach macht, kann es dennoch eine herausfordernde Aufgabe sein.
zh_tw: 開箱即用的 Godot 為您提供設定 XR 專案的所有基本支援。然而，XR 特定的遊戲機制需要在此基礎上實作。雖然 Godot 讓這相對容易，但這仍然是一項艱鉅的工作。

source: For this reason Godot has developed a toolkit called `Godot XR Tools <https://github.com/GodotVR/godot-xr-tools>`_ that implements many of the basic mechanics found in XR games, from locomotion to object interaction to UI interaction.
de: Aus diesem Grund hat Godot ein Toolkit namens `Godot XR Tools <https://github.com/GodotVR/godot-xr-tools>`_ entwickelt, das viele der grundlegenden Mechanismen implementiert, die in XR-Spielen zu finden sind, von der Fortbewegung über die Objektinteraktion bis hin zur Interaktion mit der Benutzeroberfläche.
zh_tw: `Godot XR 工具 <https://github.com/GodotVR/godot-xr-tools>`__是一個包含了若干實用子場景的外掛程式，可以用來快速實作移動、物件互動、UI 元素等 XR 體驗。

source: This toolkit is designed to work with both OpenXR and WebXR runtimes. We'll be using this as a base for our documentation here. It helps developers hit the ground running but for more specific use cases building your own logic is just as valid. In that case XR tools can help in providing inspiration.
de: Dieses Toolkit ist so konzipiert, dass es sowohl mit OpenXR- als auch mit WebXR-Runtimes funktioniert. Wir werden es hier als Grundlage für unsere Dokumentation verwenden. Es hilft Entwicklern beim Einstieg, aber für spezifischere Anwendungsfälle ist das Erstellen einer eigenen Logik ebenso sinnvoll. In diesem Fall können die XR-Tools als Inspirationsquelle dienen.
zh_tw: 該工具包旨在與 OpenXR 和 WebXR 運作時配合使用。我們將使用它作為我們此處檔案的基礎。它可以幫助開發人員立即開始運作，但對於更具體的用例，建立您自己的邏輯也同樣有效。在這種情況下，XR 工具可以幫助提供靈感。

source: The current stable release of Godot XR Tools available on the Asset Library is the version for Godot 3. The port of Godot XR Tools for Godot 4 is available for download from the github website. We will walk through the step of downloading and installing it here. We will update the documentation once Godot XR Tools becomes available for Godot 4 through the asset library.
de: Die aktuelle stabile Version der Godot XR Tools, die in der Asset Bibliothek verfügbar ist, ist die Version für Godot 3. Die Portierung von Godot XR Tools für Godot 4 steht auf der github-Website zum Download bereit. Wir werden Sie hier durch die Schritte des Herunterladens und Installierens führen. Wir werden die Dokumentation aktualisieren, sobald Godot XR Tools für Godot 4 über die Asset Bibliothek verfügbar ist.
zh_tw: Asset Library 上提供的 Godot XR Tools 目前穩定版本是 Godot 3 的版本。Godot 4 的 Godot XR Tools 連接埠可從 github 網站下載。我們將在此處逐步完成下載和安裝它的步驟。一旦 Godot XR Tools 通過資源庫可用於 Godot 4，我們將更新檔案。

source: Installing XR Tools
de: Installation der XR-Tools
zh_tw: 安裝 XR 工具

source: Continuing on from our project we started in :ref:`doc_setting_up_xr` we want to add in the Godot XR Tools library. This can be downloaded from the `Godot XR Tools releases page <https://github.com/GodotVR/godot-xr-tools/releases>`_. Simply find the latest pre-release for Godot 4 and then under assets download the ``godot-xr-tools.zip`` file.
de: In Fortführung unseres Projekts, das wir in :ref:`doc_setting_up_xr` begonnen haben, wollen wir die Godot XR Tools-Bibliothek hinzufügen. Diese kann von der `Godot XR Tools Release-Seite <https://github.com/GodotVR/godot-xr-tools/releases>`_ heruntergeladen werden. Suchen Sie einfach das neueste Pre-Release für Godot 4 und laden Sie dann unter Assets die Datei ``godot-xr-tools.zip`` herunter.
zh_tw: 繼續我們的專案，我們從 doc_setting_up_xr 開始，我們想要新增 Godot XR 工具庫。可從「Godot XR Tools 發行頁面 <https://github.com/GodotVR/godot-xr-tools/releases>」下載。只要找到 Godot 4 的最新預發行版，然後在素材下下載「godot-xr-tools.zip」檔案。

source: Once downloaded unzip the file. You will notice the files are held within a ``godot-xr-tools`` subfolder. Inside of this folder you will find an ``addons`` folder. It is this folder that you want to copy in its entirety to your Godot project folder, your project should now look something like this:
de: Nach dem Herunterladen entpacken Sie die Datei. Sie werden feststellen, dass sich die Dateien in einem ``godot-xr-tools`` Unterordner befinden. Innerhalb dieses Ordners finden Sie einen ``addons``-Ordner. Kopieren Sie diesen Ordner vollständig in Ihren Godot-Projektordner. Ihr Projekt sollte nun ungefähr so aussehen:
zh_tw: 下載後解壓縮檔案。您會注意到這些檔案保存在「godot-xr-tools」子資料夾中。在此資料夾內，您將找到一個「addons」資料夾。您想要將這個資料夾全部複製到您的 Godot 專案資料夾中，您的專案現在應該如下所示：

source: Now open up your project in Godot, if you haven't already, and give it a minute or so to import all the resources of the plugin.
de: Öffnen Sie nun Ihr Projekt in Godot, falls Sie das noch nicht getan haben, und geben Sie ihm etwa eine Minute Zeit, um alle Ressourcen des Plugins zu importieren.
zh_tw: 現在，如果您還沒有在 Godot 中開啟您的專案，請花一分鐘左右的時間來匯入插件的所有資源。

source: Next open the ``Project`` menu and select ``Project Settings..``. Now go to the ``Plugins`` tab and enable the plugin.
de: Als nächstes öffnen Sie das Menü ``Projekt`` und wählen ``Projekteinstellungen``. Gehen Sie nun auf den ``Plugins``-Tab und aktivieren Sie das Plugin.
zh_tw: 在主工具列中，點擊 ``專案`` 下拉式功能表，然後點擊 ``專案設定...``。然後轉到 ``外掛程式`` 分頁，點擊右上角的 ``建立`` 按鈕。

source: Basic hands
de: Grundlegende Hände

source: Just to get a feel of things we're going to add a few standard components that dress up our scene starting with hands for our player.
de: Um ein Gefühl für die Dinge zu bekommen, fügen wir ein paar Standardkomponenten hinzu, die unsere Szene ausschmücken, angefangen mit den Händen für unseren Spieler.
zh_tw: 為了感受一下，我們將新增一些標準組件來裝飾我們的場景，從玩家的手開始。

source: OpenXR supports full hand tracking however there currently are significant differences in capabilities between the different XR Runtimes.
de: OpenXR unterstützt vollständiges Hand-Tracking, allerdings gibt es derzeit erhebliche Unterschiede in den Fähigkeiten der verschiedenen XR-Runtimes.
zh_tw: OpenXR 支援全手追踪，但目前不同 XR 運作時之間的功能存在顯著差異。

source: As a reliable alternative Godot XR Tools comes with a number of rigged hand scenes that react on trigger and grip inputs of your controller. These hands come in low and high poly versions, come in a few configurations, a number of animation files to control finger positions and a number of different textures.
de: Als zuverlässige Alternative bietet Godot XR Tools eine Reihe von geriggten Handszenen, die auf Trigger- und Grip-Eingaben Ihres Controllers reagieren. Diese Hände gibt es in Low- und High-Poly-Versionen, in mehreren Konfigurationen, einer Reihe von Animationsdateien zur Steuerung der Fingerpositionen und einer Reihe von verschiedenen Texturen.
zh_tw: 作為可靠的替代方案，Godot XR Tools 附帶了許多經過操縱的手部場景，這些場景會對控制器的觸發器和握力輸入做出反應。這些手有低多邊形和高多邊形版本，有幾種配置，許多控製手指位置的動畫檔案和許多不同的紋理。

source: In your scene tree select your left hand :ref:`XRController3D <class_xrcontroller3d>` node. Now click on the ``instantiate Child Scene`` button to add a child scene. And select ``addons/godot-xr-tools/hands/scenes/lowpoly/left_hand_low.tscn``.
de: In Ihrem Szenenbaum wählen Sie den Linke-Hand :ref:`XRController3D <class_xrcontroller3d>`-Node. Nun klicken Sie auf den ``Child-Szene instaziieren``-Button um eine Child-Szene hinzuzufügen. Und wählen Sie ``addons/godot-xr-tools/hands/scenes/lowpoly/left_hand_low.tscn``.
zh_tw: 在場景樹中選擇左側的 XRController3D <class_xrcontroller3d> 節點。現在點選「實例化子場景」按鈕新增子場景。並選擇``addons/godot-xr-tools/hands/scenes/lowpoly/left_hand_low.tscn``。

source: As you can see from the path of this scene, low poly models are in the ``lowpoly`` subfolder while high poly models are in the ``highpoly`` subfolder. You will want to use the low poly versions if you plan to release your game on mobile devices.
de: Wie Sie am Pfad dieser Szene sehen können, befinden sich die Low-Poly-Modelle im Unterordner ``lowpoly`` und die High-Poly-Modelle im Unterordner ``highpoly``. Sie werden die Low-Poly-Versionen verwenden wollen, wenn Sie planen, Ihr Spiel auf mobilen Geräten zu veröffentlichen.
zh_tw: 從該場景的路徑可以看到，低多邊形模型位於「lowpoly」子資料夾中，而高多邊形模型位於「highpoly」子資料夾中。如果您打算在行動裝置上發布遊戲，您將需要使用低多邊形版本。

source: The default hand we chose is just a hand. The other options are:
de: Die Default-Hand, die wir gewählt haben, ist nur eine Hand. Die anderen Optionen sind:
zh_tw: 我們選擇的手預設只是一個手。其他選項包括：

source: tac_glove - the hand is wearing a glove with fingers exposed
de: tac_glove - die Hand trägt einen Handschuh, mit unbedeckten Fingern
zh_tw: tac_glove -手戴手套，手指外露

source: full_glove - the hand is wearing a glove that covers the entire hand
de: full_glove - die Hand trägt einen Handschuh, der die gesamte Hand bedeckt
zh_tw: full_glove -手戴著覆蓋整個手的手套

source: Finally each hand comes in a ``physics`` version. This exposes all the bones. We'll look at how that can be used in another tutorial.
de: Schließlich gibt es jede Hand in einer ``Physik``-Version. Diese legt alle Knochen frei. Wir werden in einem anderen Tutorial sehen, wie das verwendet werden kann.
zh_tw: 最後，每只手都有一個``物理``版本。這暴露了所有的骨骼。我們將在另一個教學中介紹如何使用它。

source: We repeat the same for the right hand.
de: Wir wiederholen das Gleiche für die rechte Hand.
zh_tw: 根節點的縮放 (Scale)。

source: More information
de: Weitere Informationen
zh_tw: 更多資訊

source: We'll continue with adding features to our tutorial project using Godot XR tools in the next couple of pages. More detailed information about the toolkit can be found `on the toolkits help pages <https://godotvr.github.io/godot-xr-tools/>`_.
de: Auf den nächsten Seiten werden wir mit dem Hinzufügen von Funktionen zu unserem Tutorial-Projekt mithilfe von Godot XR-Tools fortfahren. Ausführlichere Informationen über das Toolkit finden Sie `auf den Hilfeseiten des Toolkits <https://godotvr.github.io/godot-xr-tools/>`_.
zh_tw: 在接下來的幾頁中，我們將繼續使用 Godot XR 工具為我們的教學專案新增功能。有關工具包的更多詳細資訊，請存取工具包説明頁面 <https://godotvr.github.io/godot-xr-tools/>`_。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
