Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_passthrough.po
Languages: de, zh_tw

source: The OpenXR passthrough
de: Der OpenXR-Passthrough
zh_tw: 穿透

source: Passthrough is a technique where camera images are used to present the environment of the user as the background. This turns a VR headset into an AR headset, often referred to as Mixed Reality or MR.
de: Passthrough ist eine Technik, bei der Kamerabilder verwendet werden, um die Umgebung des Benutzers als Hintergrund darzustellen. Dadurch wird ein VR-Headset zu einem AR-Headset, das oft als Mixed Reality oder MR bezeichnet wird.
zh_tw: 直通是一種使用相機影像將使用者的環境呈現為背景的技術。這會將 VR 耳機轉變為 AR 耳機，通常稱為混合實境或 MR。

source: As passthrough is relatively new there isn't a singular way this is implemented across platforms. There may be additions in the future so this is a work in progress.
de: Da Passthrough noch relativ neu ist, gibt es keine einheitliche Methode, wie dies plattformübergreifend umgesetzt wird. Es kann in der Zukunft Ergänzungen geben, daher befindet sich dies noch in der Entwicklung.
zh_tw: 由於直通相對較新，因此沒有單一的跨平台實作方式。將來可能會有補充，所以這是一項正在進行的工作。

source: Passthrough extension
de: Passthrough-Erweiterung
zh_tw: 穿透

source: OpenXR has a vendor extension for passthrough submitted by Meta. Currently this extension is only supported on Quest and PICO but may be adopted by other headsets in the future.
de: OpenXR hat eine Herstellererweiterung für Passthrough, die von Meta eingereicht wurde. Derzeit wird diese Erweiterung nur von Quest und PICO unterstützt, kann aber in Zukunft auch von anderen Headsets übernommen werden.
zh_tw: OpenXR 有一個由 Meta 提交的直通的供應商擴充。目前此擴充僅在 Quest 和 PICO 上支援，但將來可能會被其他耳機採用。

source: :ref:`XRInterface <class_xrinterface>` has entry points for passthrough so different interfaces can implement this feature. For :ref:`OpenXRInterface <class_openxrinterface>` the meta passthrough extension is implemented here.
de: :ref:`XRInterface <class_xrinterface>` hat Einstiegspunkte für Passthrough, so dass verschiedene Interfaces diese Funktion implementieren können. Für :ref:`OpenXRInterface <class_openxrinterface>` wird hier die Meta-Passthrough-Erweiterung implementiert.
zh_tw: :ref:`XRInterface <class_xrinterface>` 具有直通入口點，因此不同的介面可以實作此功能。對於 OpenXRInterface <class_openxrinterface>`，元直通擴充在這裡實作。

source: In code you can call ``is_passthrough_supported`` to check if this extension is available. If so you can simply enable passthrough by calling ``start_passthrough``. You can call ``stop_passthrough`` to disable passthrough.
de: Im Code können Sie mit ``is_passthrough_supported`` prüfen, ob diese Erweiterung verfügbar ist. Wenn ja, können Sie Passthrough einfach durch den Aufruf von ``start_passthrough`` aktivieren. Sie können ``stop_passthrough`` aufrufen, um Passthrough zu deaktivieren.
zh_tw: 在程式碼中，您可以呼叫“is_passthrough_supported”來檢查此擴充功能是否可用。如果是這樣，您只需呼叫“start_passthrough”即可啟用直通。您可以呼叫“stop_passthrough”來停用直通。

source: You do need to make sure the background is transparent. You need to enable the ``transparent_bg`` property on the viewport. Some background environment settings will still fill the background with an opaque color, you can use a ``custom color`` with a color that has alpha set to 0.
de: Sie müssen sicherstellen, dass der Hintergrund transparent ist. Sie müssen die Property ``transparent_bg`` für den Viewport aktivieren. Einige Hintergrund-Umgebungseinstellungen füllen den Hintergrund mit einer undurchsichtigen Farbe. Sie können eine ``benutzerdefinierte Farbe`` mit einer Farbe verwenden, deren Alpha auf 0 gesetzt ist.
zh_tw: 您確實需要確保背景是透明的。您需要在視窗上啟用“transparent_bg”屬性。某些背景環境設定仍會以不透明顏色填滿背景，您可以使用“自訂顏色”，其顏色的 alpha 設定為 0。

source: The OpenXR runtime will display the camera image as the background.
de: Die OpenXR-Runtime zeigt das Kamerabild als Hintergrund an.
zh_tw: OpenXR 運作時會顯示相機影像作為背景。

source: For privacy reasons **no access** is given to the camera image.
de: Aus Gründen des Datenschutzes wird **kein Zugriff** auf das Kamerabild gewährt.
zh_tw: 出於隱私原因**無法存取**相機影像。

source: After passthrough is enabled it is possible to change settings that will break passthrough. Be sure not to disable the ``transparent_bg`` setting or change the environment blend mode. This will result in the camera image no longer being visible but you still incur the overhead.
de: Nachdem Passthrough aktiviert wurde, ist es möglich, Einstellungen zu ändern, die den Passthrough unterbrechen. Achten Sie darauf, die Einstellung ``transparent_bg`` nicht zu deaktivieren oder den Blending-Modus der Umgebung zu ändern. Dies führt dazu, dass das Kamerabild nicht mehr sichtbar ist, Sie aber trotzdem den Rechen-Overhead haben.
zh_tw: 啟用直通後，可以變更會中斷直通的設定。確保不要停用“transparent_bg”設定或更改環境混合模式。這將導致相機影像不再可見，但您仍然會產生開銷。

source: Always use ``stop_passthrough`` if you wish to turn off passthrough.
de: Verwenden Sie immer ``stop_passthrough``, wenn Sie den Passthrough abschalten wollen.
zh_tw: 如果您想關閉直通，請始終使用“stop_passthrough”。

source: Finally, for using passthrough on the Quest you must set the following export property:
de: Schließlich müssen Sie für die Verwendung von Passthrough auf der Quest die folgende Export-Propertys festlegen:
zh_tw: 最後，要在 Quest 上使用直通，您必須設定以下匯出屬性：

source: Passthrough through AR
de: Passthrough durch AR
zh_tw: 穿透

source: Some of the headsets recently adding OpenXR support have taken a different approach. They simply mimic being an AR device. The Lynx R1 is such a device but others may be doing the same.
de: Einige der Headsets, die seit kurzem OpenXR unterstützen, haben einen anderen Ansatz gewählt. Sie imitieren einfach die Funktion eines AR-Geräts. Das Lynx R1 ist ein solches Gerät, aber auch andere können das gleiche tun.
zh_tw: 最近新增 OpenXR 支援的一些耳機採取了不同的方法。他們只是模仿 AR 裝置。 Lynx R1 就是這樣的裝置，但其他裝置可能也在做同樣的事情。

source: The following thus applies to both passthrough devices that mimic AR, and actual AR devices.
de: Das Folgende gilt also sowohl für Passthrough-Geräte, die AR imitieren, als auch für echte AR-Geräte.
zh_tw: 因此，以下內容適用於模仿 AR 的直通裝置和實際的 AR 裝置。

source: If ``is_passthrough_supported`` returns false the next step is to call ``get_supported_environment_blend_modes``. This will return a list of supported blend modes for submitting the main render image to OpenXR.
de: Wenn ``is_passthrough_supported`` den Wert "false" zurückgibt, ist der nächste Schritt der Aufruf von ``get_supported_environment_blend_modes``. Dieser gibt eine Liste der unterstützten Blending-Modi zurück, um das Haupt-Rendering-Bild an OpenXR zu übermitteln.
zh_tw: 如果「is_passthrough_supported」回傳 false，下一步是呼叫「get_supported_environment_blend_modes」。這將返回支援的混合模式列表，用於將主算繪圖像提交到 OpenXR。

source: We need to check if ``XR_ENV_BLEND_MODE_ALPHA_BLEND`` is present in this list. If so we can tell OpenXR to expect an image that can be alpha blended with a background. To do this, we simply call ``set_environment_blend_mode(xr_interface.XR_ENV_BLEND_MODE_ALPHA_BLEND)``.
de: Wir müssen prüfen, ob ``XR_ENV_BLEND_MODE_ALPHA_BLEND`` in dieser Liste vorhanden ist. Wenn dies der Fall ist, können wir OpenXR mitteilen, dass es ein Bild erwartet, das mit einem Hintergrund alpha-überblendet werden kann. Um dies zu tun, rufen wir einfach ``set_environment_blend_mode(xr_interface.XR_ENV_BLEND_MODE_ALPHA_BLEND)`` auf.
zh_tw: 我們需要檢查此列表中是否存在「XR_ENV_BLEND_MODE_ALPHA_BLEND」。如果是這樣，我們可以告訴 OpenXR 期望圖像可以與背景進行 Alpha 混合。為此，我們只需呼叫「set_environment_blend_mode(xr_interface.XR_ENV_BLEND_MODE_ALPHA_BLEND)」。

source: We must also set ``transparent_bg`` to true and adjust the environment to ensure we submit the right image.
de: Wir müssen auch ``transparent_bg`` auf true setzen und die Umgebung anpassen, um sicherzustellen, dass wir das richtige Bild senden.
zh_tw: 我們還必須將“transparent_bg”設為 true 並調整環境以確保我們提交正確的圖像。

source: Putting it together
de: Fügen wir alles zusammen
zh_tw: 融會貫通

source: Putting the above together we can use the following code as a base:
de: Wenn wir das obige zusammenfügen, erhalten wir nun Folgendes als Code-Basis:
zh_tw: 有下列事項需注意：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
