Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/setting_up_xr.po
Languages: de, zh_tw

source: Setting up XR
de: Einrichten von XR
zh_tw: 設定 XR

source: Introduction to the XR system in Godot
de: Einführung in das XR-System in Godot
zh_tw: 建置系統簡介

source: Godot provides a modular XR system that abstracts many of the different XR platform specifics away from the user. At the core sits the :ref:`XRServer <class_xrserver>` which acts as a central interface to the XR system that allows users to discover interfaces and interact with the components of the XR system.
de: Godot bietet ein modulares XR-System, das viele der verschiedenen XR-Plattformspezifika für den Benutzer abstrahiert. Den Kern bildet der :ref:`XRServer <class_xrserver>`, der als zentrale Schnittstelle zum XR-System fungiert und es den Benutzern ermöglicht, Schnittstellen zu entdecken und mit den Komponenten des XR-Systems zu interagieren.
zh_tw: Godot 提供了一個模組化 XR 系統，該系統將許多不同的 XR 平台細節從使用者手中抽象化。核心是 XRServer <class_xrserver>`，它充當 XR 系統的中央接口，允許使用者發現接口並與 XR 系統的組件進行互動。

source: Each supported XR platform is implemented as an :ref:`XRInterface <class_xrinterface>`. Supported interfaces register themselves with the :ref:`XRServer <class_xrserver>` and can be queried with the ``find_interface`` method on the :ref:`XRServer <class_xrserver>`. When the desired interface is found it can be initialized by calling ``initialize`` on the interface.
de: Jede unterstützte XR-Plattform ist als :ref:`XRInterface <class_xrinterface>` implementiert. Unterstützte Schnittstellen registrieren sich beim :ref:`XRServer <class_xrserver>` und können mit der Methode ``find_interface`` auf dem :ref:`XRServer <class_xrserver>` abgefragt werden. Wenn das gewünschte Interface gefunden wurde, kann es durch den Aufruf von ``initialize`` auf dem Interface initialisiert werden.

source: A registered interface means nothing more than that the interface is available, if the interface is not supported by the host system, initialization may fail and return ``false``. This can have many reasons and sadly the reasons differ from platform to platform. It can be because the user hasn't installed the required software, or that the user simply hasn't plugged in their headset. You as a developer must thus react properly on an interface failing to initialize.
de: Ein registriertes Interface bedeutet nichts weiter, als dass das Interface verfügbar ist. Wenn das Interface vom Hostsystem nicht unterstützt wird, kann die Initialisierung fehlschlagen und ``false`` zurückgeben. Dies kann viele Gründe haben und leider sind die Gründe von Plattform zu Plattform unterschiedlich. Es kann daran liegen, dass der Benutzer die erforderliche Software nicht installiert hat, oder dass der Benutzer einfach sein Headset nicht angeschlossen hat. Sie als Entwickler müssen also richtig reagieren, wenn die Schnittstelle nicht initialisiert werden kann.
zh_tw: 已註冊的接口僅表示該接口可用，如果主機系統不支援該接口，則初始化可能會失敗並返回“false”。這可能有許多原因，遺憾的是，不同平台的原因有所不同。這可能是因為使用者尚未安裝所需的軟體，或者使用者根本沒有插入耳機。因此，作為開發人員，您必須對無法初始化的介面做出正確的反應。

source: Due to the special requirements for output in XR, especially for head mounted devices that supply different images to each eye, the :ref:`XRServer <class_xrserver>` in Godot will override various features in the rendering system. For stand-alone devices this means the final output is handled by the :ref:`XRInterface <class_xrinterface>` and Godot's usual output system is disabled. For desktop XR devices that work as a second screen it is possible to dedicate a separate :ref:`Viewport <class_viewport>` to handle the XR output, leaving the main Godot window available for displaying alternative content.
de: Aufgrund der besonderen Anforderungen an die Ausgabe in XR, insbesondere bei auf dem Kopf getragenen Geräten, die für jedes Auge ein anderes Bild liefern, überschreibt der :ref:`XRServer <class_xrserver>` in Godot verschiedene Funktionen des Rendering-Systems. Für eigenständige Geräte bedeutet dies, dass die endgültige Ausgabe vom :ref:`XRInterface <class_xrinterface>` gehandhabt wird und das übliche Ausgabesystem von Godot deaktiviert ist. Für Desktop-XR-Geräte, die als zweiter Bildschirm arbeiten, ist es möglich, einen separaten :ref:`Viewport <class_viewport>` für die XR-Ausgabe zu verwenden, so dass das Godot-Hauptfenster für die Anzeige alternativer Inhalte verfügbar bleibt.
zh_tw: 由於 XR 中輸出的特殊要求，特別是對於向每隻眼睛提供不同影像的頭戴式裝置，Godot 中的 XRServer <class_xrserver>` 將覆蓋算繪系統中的各種功能。對於獨立裝置，這意味著最終輸出由 XRInterface <class_xrinterface>` 處理，並且 Godot 的常用輸出系統被停用。對於用作第二個螢幕的桌面 XR 裝置，可以專用一個單獨的 Viewport <class_viewport>` 來處理 XR 輸出，從而使主 Godot 視窗可用於顯示替代內容。

source: Note that only one interface can be responsible for handling the output to an XR device, this is known as the primary interface and by default will be the first interface that is initialized. Godot currently thus only supports implementations with a single headset. It is possible, but increasingly uncommon, to have a secondary interface, for example to add tracking to an otherwise 3DOF only device.
de: Beachten Sie, dass nur ein Interface für die Verarbeitung der Ausgabe an ein XR-Gerät zuständig sein kann. Dieses Interface wird als primäres Interface bezeichnet und ist standardmäßig das erste Interface, das initialisiert wird. Godot unterstützt daher derzeit nur Implementierungen mit einem einzigen Headset. Es ist möglich, aber zunehmend unüblich, ein sekundäres Interface zu haben, z.B. um Tracking zu einem ansonsten nur 3DOF-Gerät hinzuzufügen.
zh_tw: 請注意，只有一個接口可以負責處理 XR 裝置的輸出，這稱為主接口，預設情況下將是第一個初始化的接口。因此，Godot 目前僅支援使用單一耳機的實作。擁有輔助介面是可能的，但越來越不常見，例如向其他僅 3DOF 的裝置新增追蹤。

source: There are three XR specific node types that you will find in nearly all XR applications:
de: Es gibt drei XR-spezifische Node-Typen, die Sie in fast allen XR-Anwendungen finden werden:
zh_tw: 您幾乎可以在所有 XR 應用程式中找到三種 XR 特定節點型別：

source: :ref:`XROrigin3D <class_xrorigin3d>` represents, for all intents and purposes, the center point of your play space. That is an oversimplified statement but we'll go into more detail later. All objects tracked in physical space by the XR platform are positioned in relation to this point.
de: :ref:`XROrigin3D <class_xrorigin3d>` stellt in jeder Hinsicht den Mittelpunkt deines Spielbereichs dar. Das ist eine stark vereinfachte Aussage, aber wir werden später mehr ins Detail gehen. Alle Objekte, die von der XR-Plattform im physischen Raum verfolgt werden, werden im Verhältnis zu diesem Punkt positioniert.
zh_tw: :ref:`XROrigin3D <class_xrorigin3d>` 代表了所有意圖和目的，您的遊戲空間的中心點。這是一個過於簡單的說法，但我們稍後會更詳細地討論。 XR 平台在物理空間中追蹤的所有物件都相對於該點進行定位。

source: :ref:`XRCamera3D <class_xrcamera3d>` represents the (stereo) camera that is used when rendering output for the XR device. The positioning of this node is controlled by the XR system and updated automatically using the tracking information provided by the XR platform.
de: :ref:`XRCamera3D <class_xrcamera3d>` stellt die (Stereo-)Kamera dar, die beim Rendern der Ausgabe für das XR-Gerät verwendet wird. Die Positionierung dieses Nodes wird durch das XR-System gesteuert und automatisch anhand der von der XR-Plattform bereitgestellten Tracking-Informationen aktualisiert.
zh_tw: :ref:`XRCamera3D <class_xrcamera3d>` 表示為 XR 裝置算繪輸出時所使用的（立體）相機。此節點的定位由XR系統控制，並使用XR平台提供的追蹤資訊自動更新。

source: :ref:`XRController3D <class_xrcontroller3d>` represents a controller used by the player, commonly there are two, one held in each hand. These nodes give access to various states on these controllers and send out signals when the player presses buttons on them. The positioning of this node is controlled by the XR system and updated automatically using the tracking information provided by the XR platform.
de: :ref:`XRController3D <class_xrcontroller3d>` stellt einen Controller dar, der vom Spieler benutzt wird, üblicherweise sind es zwei, einer in jeder Hand. Diese Nodes ermöglichen den Zugriff auf verschiedene Zustände dieser Controller und senden Signale aus, wenn der Spieler Tasten auf ihnen drückt.
zh_tw: :ref:`XRController3D <class_xrcontroller3d>` 代表玩家使用的控制器，通常有兩個，每隻手握一個。這些節點可以存取這些控制器上的各種狀態，並在玩家按下它們上的按鈕時發出訊號。此節點的定位由XR系統控制，並使用XR平台提供的追蹤資訊自動更新。

source: There are other XR related nodes and there is much more to say about these three nodes, but we'll get into that later on.
de: Es gibt noch weitere XR-bezogene Nodes und es gibt noch viel mehr über diese drei Nodes zu sagen, aber dazu kommen wir später.
zh_tw: 還有其他與 XR 相關的節點，關於這三個節點還有很多要說的，但我們稍後會詳細介紹。

source: Prerequisites for XR in Godot 4
de: Voraussetzungen für XR in Godot 4
zh_tw: Godot 4 中 XR 的先決條件

source: While in Godot 3 most things worked out of the box, Godot 4 needs a little more setup. This is mainly due to the more advanced nature of the Vulkan renderer. There are many rendering features in Vulkan the XR system uses that aren't enabled by default. They are very easy to turn on, simply open up your project settings and tick the XR shaders tickbox in the XR section:
de: Während bei Godot 3 die meisten Dinge sofort funktionierten, ist bei Godot 4 etwas mehr Einarbeitungszeit erforderlich. Das liegt vor allem an der fortschrittlicheren Natur des Vulkan-Renderers. Es gibt viele Rendering-Funktionen in Vulkan, die das XR-System verwendet, die standardmäßig nicht aktiviert sind. Sie sind sehr einfach einzuschalten: Öffnen Sie einfach Ihre Projekteinstellungen und aktiveren Sie die Checkbox "XR-Shader" im Abschnitt XR:
zh_tw: 雖然 Godot 3 中的大多數功能都是開箱即用的，但 Godot 4 需要更多設定。這主要是由於 Vulkan 算繪器更加先進。 XR 系統使用的 Vulkan 中有許多算繪功能預設未啟用。它們非常容易打開，只需打開專案設定並勾選 XR 部分中的 XR 著色器複選框即可：

source: As Godot 4 is still in development, many post process effects have not yet been updated to support stereoscopic rendering. Using these will have adverse effects.
de: Da sich Godot 4 noch in der Entwicklung befindet, sind viele Nachbearbeitungseffekte noch nicht für das stereoskopische Rendering aktualisiert worden. Die Verwendung dieser Effekte hat nachteilige Auswirkungen.
zh_tw: 由於Godot 4仍處於開發階段，許多後製效果尚未更新以支援立體算繪。使用這些會產生不良影響。

source: OpenXR is a new industry standard that allows different XR platforms to present themselves through a standardised API to XR applications. This standard is an open standard maintained by the Khronos Group and thus aligns very well with Godot's interests.
de: OpenXR ist ein neuer Industriestandard, der es verschiedenen XR-Plattformen ermöglicht, sich über eine standardisierte API für XR-Anwendungen zu präsentieren. Dieser Standard ist ein offener Standard, der von der Khronos Group gepflegt wird und somit sehr gut mit den Interessen von Godot übereinstimmt.

source: The Vulkan implementation of OpenXR is closely integrated with Vulkan, taking over part of the Vulkan system. This requires tight integration of certain core graphics features in the Vulkan renderer which are needed before the XR system is setup. This was one of the main deciding factors to include OpenXR as a core interface.
de: Die Vulkan-Implementierung von OpenXR ist eng mit Vulkan gekoppelt und übernimmt einen Teil des Vulkan-Systems. Dies erfordert eine enge Integration bestimmter Kerngrafikfunktionen in den Vulkan-Renderer, die erforderlich sind, bevor das XR-System eingerichtet wird. Dies war einer der wichtigsten Entscheidungsfaktoren für die Aufnahme von OpenXR als Kernschnittstelle.
zh_tw: OpenXR 的 Vulkan 實作與 Vulkan 緊密整合，接管了 Vulkan 系統的一部分。這需要在設定 XR 系統之前將某些核心圖形功能緊密整合到 Vulkan 算繪器中。這是將 OpenXR 作為核心介面的主要決定因素之一。

source: This also means OpenXR needs to be enabled when Godot starts in order to set things up correctly. The required setting can be found in your project settings:
de: Das bedeutet auch, dass OpenXR beim Starten von Godot aktiviert sein muss, um die Dinge korrekt einzurichten. Die erforderliche Einstellung finden Sie in Ihren Projekteinstellungen:
zh_tw: 這也意味著當 Godot 啟動時需要啟用 OpenXR 才能正確設定。所需的設定可以在您的專案設定中找到：

source: As setup is brought forward with OpenXR you can find several other settings related to OpenXR here as well. These can't be changed while your application is running. The default settings will get us started and we will go into detail in another section of the documentation.
de: Während die Einrichtung mit OpenXR voranschreitet, können Sie hier verschiedene andere OpenXR-Einstellungen finden. Diese können nicht geändert werden, während Ihre Anwendung läuft. Die Default-Einstellungen sind für den Anfang ausreichend und werden in einem anderen Abschnitt der Dokumentation näher erläutert.
zh_tw: 由於 OpenXR 提供了設定功能，因此您還可以在此處找到與 OpenXR 相關的其他幾個設定。當您的應用程式運作時，這些無法更改。預設設定將幫助我們開始，我們將在檔案的另一部分中詳細介紹。

source: Setting up the XR scene
de: Einrichten der XR-Szene
zh_tw: 設定主要場景

source: Every XR application needs at least an :ref:`XROrigin3D <class_xrorigin3d>` and an :ref:`XRCamera3D <class_xrcamera3d>` node. Most will have two :ref:`XRController3D <class_xrcontroller3d>`, one for the left hand and one for the right. Keep in mind that the camera and controller nodes should be children of the origin node. Add these nodes to a new scene and rename the controller nodes to ``LeftHand`` and ``RightHand``, your scene should look something like this:
de: Jede XR Anwendung benötigt mindestens einen :ref:`XROrigin3D <class_xrorigin3d>` und einen :ref:`XRCamera3D <class_xrcamera3d>`-Node. Die meisten werden zwei :ref:`XRController3D <class_xrcontroller3d>` haben, einen für die linke Hand und einen für die rechte. Denken Sie daran, dass die Kamera- und Controller-Nodes Child-Nodes des "origin"-Nodes sein sollten. Fügen Sie diese Nodes zu einer neuen Szene hinzu und benennen Sie die Controller Nodes in ``LeftHand`` und ``RightHand`` um, Ihre Szene sollte etwa so aussehen:
zh_tw: 每個 XR 應用程式至少需要一個 XROrigin3D <class_xrorigin3d>` 和一個 XRCamera3D <class_xrcamera3d>` 節點。大多數都會有兩個 XRController3D <class_xrcontroller3d>`，一個用於左手，一個用於右手。請記住，相機和控制器節點應該是原始節點的子節點。將這些節點新增至新場景並將控制器節點重新命名為“LeftHand”和“RightHand”，您的場景應如下所示：

source: Next you need to configure the controllers, select the left hand and set it up as follows:
de: Als Nächstes müssen Sie die Controller konfigurieren. Wählen Sie die linke Hand und richten Sie sie wie folgt ein:
zh_tw: 接下來您需要配置控制器，選擇左手並進行以下設定：

source: And the right hand:
de: Und die rechten Hand:
zh_tw: 將腳本附加到節點。

source: Right now all these nodes are on the floor, they will be positioned correctly in runtime. To help during development, it can be helpful to move the camera upwards so its ``y`` is set to ``1.7``, and move the controller nodes to ``-0.5, 1.0, -0.5`` and ``0.5, 1.0, -0.5`` for respectively the left and right hand.
de: Im Moment befinden sich alle diese Nodes auf dem Boden, sie werden zur Laufzeit richtig positioniert sein. Um bei der Entwicklung zu helfen, kann es hilfreich sein, die Kamera nach oben zu verschieben, so dass ihr ``y`` auf ``1.7`` gesetzt wird, und die Controller-Nodes auf ``-0.5, 1.0, -0.5`` und ``0.5, 1.0, -0.5`` für die linke bzw. rechte Hand zu verschieben.

source: Next we need to add a script to our root node. Add the following code into this script:
de: Als nächstes müssen wir ein Skript zu unserem Root-Node hinzufügen. Fügen Sie den folgenden Code in dieses Skript ein:
zh_tw: 現在給主節點新增一個腳本, 並新增以下程式碼:

source: This code fragment assumes we are using OpenXR, if you wish to use any of the other interfaces you can change the ``find_interface`` call.
de: Dieses Codefragment geht davon aus, dass wir OpenXR verwenden. Wenn Sie eine der anderen Schnittstellen verwenden möchten, können Sie den Aufruf ``find_interface`` ändern.
zh_tw: 此程式碼片段假設我們使用 OpenXR，如果您希望使用任何其他接口，您可以更改“find_interface”呼叫。

source: As you can see in the code snippet above, we turn off v-sync. When using OpenXR you are outputting the rendering results to an HMD that often requires us to run at 90Hz or higher. If your monitor is a 60hz monitor and v-sync is turned on, you will limit the output to 60 frames per second.
de: Wie Sie im obigen Codeschnipsel sehen können, schalten wir V-Sync aus. Wenn Sie OpenXR verwenden, geben Sie die Rendering-Ergebnisse an ein HMD aus, das oft eine Bildwiederholfrequenz von 90 Hz oder mehr erfordert. Wenn Ihr Monitor ein 60-Hz-Monitor ist und V-Sync eingeschaltet ist, wird die Ausgabe auf 60 Frames pro Sekunde begrenzt.
zh_tw: 正如您在上面的程式碼片段中看到的，我們關閉了垂直同步。使用 OpenXR 時，您將算繪結果輸出到 HMD，這通常要求我們以 90Hz 或更高的頻率運作。如果您的顯示器是 60hz 顯示器並且開啟了垂直同步，您會將輸出限制為每秒 60 影格。

source: XR interfaces like OpenXR perform their own sync.
de: XR-Interfaces wie OpenXR führen ihre eigene Synchronisierung durch.
zh_tw: OpenXR 等 XR 介面執行自己的同步。

source: Also note that by default the physics engine runs at 60Hz as well and this can result in choppy physics. You should set ``Engine.physics_ticks_per_second`` to a higher value.
de: Beachten Sie auch, dass die Physik-Engine standardmäßig mit 60Hz läuft, was zu einer ruckeligen Physik führen kann. Sie sollten ``Engine.physics_ticks_per_second`` auf einen höheren Wert setzen.
zh_tw: 另請注意，預設情況下實體引擎也以 60Hz 運作，這可能會導致物理效果不穩定。您應該將“Engine.physicals_ticks_per_second”設定為更高的值。

source: If you run your project at this point in time, everything will work but you will be in a dark world. So to finish off our starting point add a :ref:`DirectionalLight3D <class_directionallight3d>` and a :ref:`WorldEnvironment <class_worldenvironment>` node to your scene. You may wish to also add a mesh instance as a child to each controller node just to temporarily visualise them. Make sure you configure a sky in your world environment.
de: Wenn Sie Ihr Projekt zu diesem Zeitpunkt starten, wird alles funktionieren, aber Sie werden sich in einer dunklen Welt befinden. Um unseren Ausgangspunkt zu vervollständigen, fügen Sie einen :ref:`DirectionalLight3D <class_directionallight3d>` und einen :ref:`WorldEnvironment <class_worldenvironment>`-Node zu Ihrer Szene hinzu. Vielleicht möchten Sie auch eine Mesh-Instanz als Child-Node zu jedem Controller-Node hinzufügen, nur um sie vorübergehend zu visualisieren. Stellen Sie sicher, dass Sie einen Himmel in Ihrer World Environment konfigurieren.
zh_tw: 如果你在這個時間點運作你的專案，一切都會正常，但你將處於一個黑暗的世界。因此，為了完成我們的起點，請在場景中新增一個:ref:`DirectionalLight3D <class_directionlight3d>` 和一個:ref:`WorldEnvironment <class_worldenvironment>` 節點。您可能還想將網格實例作為子級新增到每個控制器節點，只是為了暫時可視化它們。確保您在世界環境中配置了天空。

source: Now run your project, you should be floating somewhere in space and be able to look around.
de: Starten Sie nun Ihr Projekt. Sie sollten irgendwo im Raum schweben und sich umsehen können.
zh_tw: 現在運作您的專案，您應該漂浮在太空中的某個位置並且能夠環顧四周。

source: While traditional level switching can definitely be used with XR applications, where this scene setup is repeated in each level, most find it easier to set this up once and loading levels as a subscene. If you do switch scenes and replicate the XR setup in each one, do make sure you do not run ``initialize`` multiple times. The effect can be unpredictable depending on the XR interface used.
de: Während der traditionelle Level-Wechsel durchaus mit XR-Anwendungen verwendet werden kann, bei denen diese Szeneneinrichtung in jeder Ebene wiederholt wird, finden es die meisten einfacher, dies einmal einzurichten und Level als Unterszene zu laden. Wenn Sie die Szenen wechseln und das XR-Setup in jeder Szene wiederholen, stellen Sie sicher, dass Sie ``initialize`` nicht mehrfach ausführen. Der Effekt kann unvorhersehbar sein, abhängig von der verwendeten XR-Schnittstelle.
zh_tw: 雖然傳統的關卡切換絕對可以與 XR 應用程式一起使用，其中該場景設定在每個關卡中重複，但大多數人發現更容易設定一次並將關卡載入為子場景。如果您確實切換場景並在每個場景中複製 XR 設定，請確保不要多次執行“初始化”。根據所使用的 XR 接口，效果可能無法預測。

source: For the rest of this basic tutorial series we will create a game that uses a single scene.
de: Im weiteren Verlauf dieser grundlegenden Tutorial-Reihe werden wir ein Spiel erstellen, das eine einzige Szene verwendet.
zh_tw: 在本基本教學系列的其餘部分中，我們將建立一個使用單一場景的遊戲。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
