Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: de, zh_tw

source: The XR action map
de: Das XR-Action-Mapping
zh_tw: XR 動作對應

source: Godot has an action map feature as part of the XR system. At this point in time this system is part of the OpenXR module. There are plans to encompass WebXR into this in the near future hence we call it the XR action map system in this document. It implements the built-in action map system of OpenXR mostly exactly as it is offered.
de: Godot verfügt über ein Action Mapping-Feature als Teil des XR-Systems. Zum jetzigen Zeitpunkt ist dieses System Teil des OpenXR-Moduls. Es gibt Pläne, WebXR in naher Zukunft in dieses System einzubinden, daher nennen wir es in diesem Dokument das XR-Action Map-System. Es implementiert das Built-in-Action-Map-System von OpenXR weitgehend genau so, wie es angeboten wird.
zh_tw: Godot 具有動作地圖功能，作為 XR 系統的一部分。此時該系統是 OpenXR 模組的一部分。有計劃在不久的將來將 WebXR 納入其中，因此我們在本文件中將其稱為 XR 動作地圖系統。它實作了 OpenXR 的內建動作地圖系統，基本上與它所提供的一樣。

source: The XR action map system exposes input, positional data and output for XR controllers to your game/application. It does this by exposing named actions that can be tailored to your game/application and binding these to the actual inputs and outputs on your XR devices.
de: Das XR-Action-Map-System macht Eingaben, Positionsdaten und Ausgaben für XR-Controller für Ihr Spiel/Ihre Anwendung verfügbar. Dies geschieht durch benannte Aktionen, die auf Ihr Spiel/Ihre Anwendung zugeschnitten werden können, und deren Bindung an die tatsächlichen Ein- und Ausgänge Ihrer XR-Geräte.
zh_tw: XR 動作地圖系統會向您的遊戲/應用程式公開 XR 控制器的輸入、位置資料和輸出。它透過公開可根據您的遊戲/應用程式自訂的命名操作並將這些操作綁定到 XR 裝置上的實際輸入和輸出來實作此目的。

source: As the XR action map is currently part of the OpenXR module, OpenXR needs to be enabled in your project settings to expose it:
de: Da die XR-Action-Map derzeit Teil des OpenXR-Moduls ist, muss OpenXR in den Projekteinstellungen aktiviert sein, um sie zugängig zu machen:
zh_tw: 由於 XR 動作對應目前是 OpenXR 模組的一部分，因此需要在專案設定中啟用 OpenXR 才能顯示它：

source: You will then find the XR Action Map interface in the bottom of the screen:
de: Im unteren Teil des Bildschirms finden Sie dann das XR Action Map-Interface:
zh_tw: 然後，你會在螢幕底部看到 XR 行動地圖介面：

source: Godot's built-in input system has many things in common with the XR action map system. In fact our original idea was to add functionality to the existing input system and expose the data to the OpenXR action map system. We may revisit that idea at some point but as it turns out there were just too many problems to overcome. To name a few:
de: Das in Godot integrierte Eingabesystem hat viele Gemeinsamkeiten mit dem Action-Map-System von XR. Unsere ursprüngliche Idee war es, das bestehende Eingabesystem um Funktionen zu erweitern und die Daten in das OpenXR Action-Map-System einzubinden. Vielleicht werden wir diese Idee irgendwann wieder aufgreifen, aber wie sich herausstellte, gab es einfach zu viele Probleme zu überwinden. Um nur ein paar zu nennen:
zh_tw: Godot 的內建輸入系統與 XR 動作地圖系統有許多共同點。事實上，我們最初的想法是為現有輸入系統新增功能並將資料公開給 OpenXR 動作地圖系統。我們可能會在某個時候重新審視這個想法，但事實證明有太多的問題需要克服。僅舉幾例：

source: Godot's input system mainly centers around button inputs, XR adds triggers, axis, poses and haptics (output) into the mix. This would greatly complicate the input system with features that won't work for normal controllers or contrast with the current approach. It was felt this would lead to confusion for the majority of Godot users.
de: Das Eingabesystem von Godot konzentriert sich hauptsächlich auf Tasteneingaben, XR fügt Auslöser, Achsen, Posen und Haptik (Ausgabe) hinzu. Dies würde das Eingabesystem stark verkomplizieren, mit Features, die bei normalen Controllern nicht funktionieren oder im Gegensatz zum aktuellen Ansatz stehen. Man war der Meinung, dass dies bei der Mehrheit der Godot-Benutzer zu Verwirrung führen würde.
zh_tw: Godot 的輸入系統主要以按鈕輸入為中心，XR 增加了觸發器、軸、姿勢和觸覺（輸出）。這將使輸入系統變得非常複雜，其功能不適用於普通控制器或與目前方法相比。人們認為這會導致大多數 Godot 使用者感到困惑。

source: Godot's input system works with raw input data that is parsed and triggers emitting actions. This input data is made available to the end user. OpenXR completely hides raw data and does all the parsing for us, we only get access to already parsed action data. This inconsistency is likely to lead to bugs when an unsuspecting user tries to use an XR device as a normal input device.
de: Das Eingabesystem von Godot arbeitet mit rohen Eingabedaten, die geparst werden und Aktionen auslösen. Diese Eingabedaten werden dem Endbenutzer zur Verfügung gestellt. OpenXR verbirgt die Rohdaten vollständig und übernimmt das Parsing für uns, wir erhalten nur Zugang zu den bereits geparsten Aktionsdaten. Diese Inkonsistenz wird wahrscheinlich zu Fehlern führen, wenn ein argloser Benutzer versucht, ein XR-Gerät als normales Eingabegerät zu verwenden.
zh_tw: Godot 的輸入系統使用經過解析並觸發發出操作的原始輸入資料。此輸入資料可供最終使用者使用。 OpenXR 完全隱藏原始資料並為我們完成所有解析，我們只能存取已經解析的動作資料。當毫無戒心的使用者嘗試將 XR 裝置用作一般輸入裝置時，這種不一致可能會導致錯誤。

source: Godot's input system allows changes to what inputs are bound to actions in runtime, OpenXR does not.
de: Das Eingabesystem von Godot erlaubt es, zur Laufzeit zu ändern, welche Eingaben an Aktionen gebunden sind, OpenXR nicht.
zh_tw: Godot 的輸入系統允許在運作時更改輸入與操作的綁定，而 OpenXR 則不允許。

source: Godot's input system is based on device ids which are meaningless in OpenXR.
de: Das Eingabesystem von Godot basiert auf Geräte-IDs, die in OpenXR bedeutungslos sind.
zh_tw: Godot 的輸入系統基於裝置 ID，而這在 OpenXR 中毫無意義。

source: This does mean that a game/application that mixes traditional inputs with XR controllers will have a separation. For most applications either one or the other is used and this is not seen as a problem. In the end, it's a limitation of the system.
de: Dies bedeutet, dass ein Spiel/eine Anwendung, die traditionelle Eingaben mit XR-Controllern mischt, eine Trennung aufweist. Bei den meisten Anwendungen wird entweder das eine oder das andere verwendet und dies wird nicht als Problem angesehen. Letztendlich ist es eine Einschränkung des Systems.
zh_tw: 這確實意味著將傳統輸入與 XR 控制器混合在一起的遊戲/應用程式將會分開。對於大多數應用程式，使用其中之一，這不被視為問題。歸根結底，這是系統的限制。

source: The default action map
de: Die Default-Action-Map
zh_tw: 光照動畫

source: Godot will automatically create a default action map if no action map file is found.
de: Godot erstellt automatisch eine Default-Action-Map, wenn keine Action-Map-Datei gefunden wird.
zh_tw: 如果找不到操作對應檔，Godot 會自動建立預設操作對應。

source: This default map was designed to help developers port their XR games/applications from Godot 3 to Godot 4. As a result this map essentially binds all known inputs on all controllers supported by default, to actions one on one. This is not a good example of setting up an action map. It does allow a new developer to have a starting point when they want to become familiar with Godot XR. It prevents having to design a proper action map for their game/application first.
de: Diese Default-Map wurde entwickelt, um Entwicklern zu helfen, ihre XR-Spiele/Anwendungen von Godot 3 auf Godot 4 zu portieren. Infolgedessen bindet diese Map im Wesentlichen alle bekannten Eingaben auf allen standardmäßig unterstützten Controllern an Aktionen, und zwar eins zu eins. Dies ist kein gutes Beispiel für das Einrichten einer Action-Map. Es ermöglicht einem neuen Entwickler, einen Ausgangspunkt zu haben, wenn er sich mit Godot XR vertraut machen will. Es verhindert, dass sie zuerst eine richtige Action-Map für ihr Spiel/ihre Anwendung entwerfen müssen.
zh_tw: 該預設地圖旨在幫助開發人員將其XR 遊戲/應用程式從Godot 3 移植到Godot 4。因此，該地圖本質上將預設支援的所有控制器上的所有已知輸入綁定到一對一的操作。這不是設定行動圖的好例子。它確實讓新開發者在想要熟悉 Godot XR 時有一個起點。它避免了必須先為他們的遊戲/應用程式設計合適的動作地圖。

source: For this walkthrough we're going to start with a blank action map. You can simply delete the "Godot action set" entry at the top by pressing the trash can icon. This will clear out all actions. You might also want to remove the controllers that you do not wish to setup, more on this later.
de: Für diese Anleitung werden wir mit einer leeren Action-Map beginnen. Sie können einfach den Eintrag "Godot-Aktions-Set" oben löschen, indem Sie auf das Mülleimer-Symbol drücken. Dadurch werden alle Aktionen gelöscht. Möglicherweise möchten Sie auch die Controller entfernen, die Sie nicht einrichten möchten, dazu später mehr.
zh_tw: 對於本演練，我們將從一張空白的操作地圖開始。您只需按下垃圾桶圖示即可刪除頂部的「Godot 操作集」條目。這將清除所有操作。您可能還想刪除不想設定的控制器，稍後將詳細介紹。

source: Action sets
de: Aktions-Sets
zh_tw: 操作名稱

source: Before we dive in, you will see the term XR runtime used throughout this document. With XR runtime we mean the software that is controlling and interacting with the AR or VR headset. The XR runtime then exposes this to us through an API such as OpenXR. So:
de: Bevor wir eintauchen, werden Sie in diesem Dokument den Begriff XR-Laufzeit verwenden. Mit XR-Runtime meinen wir die Software, die das AR- oder VR-Headset steuert und mit ihm interagiert. Die XR-Laufzeit stellt uns dies dann über eine API wie OpenXR zur Verfügung. Also:
zh_tw: 在我們深入討論之前，您將看到本文件中使用的術語「XR 運作時」。對於 XR 運作時，我們指的是控制 AR 或 VR 耳機並與之互動的軟體。然後，XR 運作時透過 OpenXR 等 API 向我們公開這一點。所以：

source: for Steam this is SteamVR,
de: für Steam ist das SteamVR,
zh_tw: 對於 Steam，這是 SteamVR，

source: for Meta on desktop this is the Oculus Client (including when using Quest link),
de: für Meta auf dem Desktop ist dies der Oculus-Client (auch bei Verwendung des Quest-Links),
zh_tw: 對於桌面上的 Meta，這是 Oculus 使用者端（包括使用 Quest 連結時），

source: for Meta on Quest this is the Quest's native OpenXR client,
de: für Meta auf Quest ist dies der native OpenXR-Client von Quest,
zh_tw: 對於 Quest 上的 Meta，這是 Quest 的原生 OpenXR 使用者端，

source: on Linux this could be Monado, etc.
de: unter Linux könnte dies Monado, etc sein.
zh_tw: 在 Linux 上，這可能是 Monado 等。

source: The action map allows us to organize our actions in sets. Each set can be enabled or disabled on its own.
de: Die Action-Map ermöglicht es uns, unsere Aktionen in Gruppen zu organisieren. Jedes Set kann für sich aktiviert oder deaktiviert werden.
zh_tw: 行動圖允許我們將行動組織成群組。每組都可以單獨啟用或停用。

source: The concept here is that you could have different sets that provide bindings in different scenarios. You could have:
de: Das Konzept hier ist, dass Sie verschiedene Sets haben könnten, die Bindings in verschiedenen Szenarien bieten. Sie könnten haben:
zh_tw: 這裡的概念是，您可以擁有不同的集合來在不同的場景中提供綁定。你可以有：

source: a ``Character control`` set for when you're walking around,
de: eine ``Charakter-Control``-Set für die Zeit, in der Sie herumlaufen,
zh_tw: 當你四處走動時設定“角色控制”，

source: a ``Vehicle control`` set for when you're operating a vehicle,
de: eine ``Fahrzeug-Control``-Set für die Zeit, in der Sie ein Fahrzeug bedienen,
zh_tw: 當您操作車輛時設定的“車輛控制”，

source: a ``Menu`` set for when a menu is open.
de: ein ``Menü``-Set für die Zeit, in der ein Menü geöffnet ist.
zh_tw: 當選單開啟時設定“Menu”。

source: Only the action set applicable to the current state of your game/application can then be enabled.
de: Nur das Action Set, das für den aktuellen Zustand Ihres Spiels/Ihrer Anwendung gilt, kann dann aktiviert werden.
zh_tw: 然後只能啟用適用於遊戲/應用程式目前狀態的操作集。

source: This is especially important if you wish to bind the same input on a controller to a different action. For instance:
de: Dies ist besonders wichtig, wenn Sie dieselbe Eingabe auf einem Controller an eine andere Aktion binden möchten. Zum Beispiel:
zh_tw: 如果您希望將控制器上的相同輸入綁定到不同的操作，這一點尤其重要。例如：

source: in your ``Character control`` set you may have an action ``Jump``,
de: in Ihrem ``Charakter-Control`` haben Sie vielleicht eine Aktion ``Springen``,
zh_tw: 在你的“角色控制”集中，你可能有一個動作“跳躍”，

source: in your ``Vehicle control`` set you may have an action ``Accelerate``,
de: in Ihrem ``Fahrzeug-Control`` haben Sie vielleicht eine Aktion ``Beschleunigen``,
zh_tw: 在你的“車輛控制”集中，你可能有一個動作“加速”，

source: in your ``Menu`` set you may have an action ``Select``.
de: in Ihrem ``Menü``-Set haben Sie vielleicht eine Aktion ``Auswählen``.
zh_tw: 在您的“選單”集中，您可能有一個操作“選擇”。

source: All are bound to the trigger on your controller.
de: Alle sind an den Trigger Ihres Controller gebunden.
zh_tw: 所有這些都綁定到控制器上的觸發器。

source: OpenXR will only bind an input or output to a single action. If the same input or output is bound to multiple actions the one in the active action set with the highest priority will be the one updated/used. So in our above example it will thus be important that only one action set is active.
de: OpenXR bindet einen Eingang oder Ausgang nur an eine einzige Aktion. Wenn derselbe Eingang oder Ausgang an mehrere Aktionen gebunden ist, wird diejenige im aktiven Action Set mit der höchsten Priorität aktualisiert/verwendet. In unserem obigen Beispiel ist es also wichtig, dass nur ein Action Set aktiv ist.
zh_tw: OpenXR 只會將輸入或輸出綁定到單一操作。如果相同的輸入或輸出綁定到多個操作，則活動操作集中具有最高優先權的操作將會更新/使用。因此，在我們上面的範例中，只有一個操作集處於活動狀態非常重要。

source: For your first XR game/application we highly recommend starting with just a single action set and to not over-engineer things.
de: Für Ihr erstes XR-Spiel bzw. Ihre erste XR-Anwendung empfehlen wir Ihnen, mit einem einzigen Action Set zu beginnen und die Dinge nicht zu sehr zu verkomplizieren.
zh_tw: 對於您的第一個 XR 遊戲/應用程式，我們強烈建議您從單一操作集開始，不要過度設計。

source: For our walkthrough in this document we will thus create a single action set called ``my_first_action_set``. We do this by pressing the ``Add action set`` button:
de: Für unser Beispiel in diesem Dokument werden wir daher ein einzelnes Action Set mit dem Namen ``my_first_action_set`` erstellen. Wir tun dies, indem wir auf die Schaltfläche ``Action Set hinzufügen`` klicken:
zh_tw: 因此，對於本文件中的演練，我們將建立一個名為「my_first_action_set」的操作集。我們透過按下「新增操作集」按鈕來完成此操作：

source: The columns in our table are as follows:
de: Die Spalten in unserer Tabelle lauten wie folgt:
zh_tw: 常見的使用情景如下：

source: Col
de: Farbe
zh_tw: 顏色

source: Value
de: Wert
zh_tw: 值

source: Description
de: Beschreibung
zh_tw: 說明

source: my_first_action_set
zh_tw: 限制

source: This is the internal name of the action set. OpenXR doesn't specify specific restrictions on this name other then size, however some XR runtimes will not like spaces or special characters.
de: Dies ist der interne Name des Action Sets. OpenXR gibt für diesen Namen außer der Größe keine besonderen Beschränkungen vor, allerdings mögen einige XR-Runtimes keine Leerzeichen oder Sonderzeichen.
zh_tw: 這是操作集的內部名稱。除了大小之外，OpenXR 沒有對此名稱指定特定限制，但是某些 XR 運作時不喜歡空格或特殊字元。

source: My first action set
de: Mein erstes Action Set
zh_tw: 我的第一個動作組

source: This is a human-readable name for the action set. Some XR runtimes will display this name to the end user, for example in configuration dialogs.
de: Dies ist ein für Menschen lesbarer Name für das Action Set. Einige XR-Runtimes zeigen dem Endbenutzer diesen Namen an, zum Beispiel in Konfigurationsdialogen.
zh_tw: 這是操作集的人類可讀名稱。某些 XR 運作時會向最終使用者顯示此名稱，例如在設定對話方塊中。

source: This is the priority of the action set. If multiple active action sets have actions bound to the same controllers inputs or outputs, the action set with the highest priority value will determine the action that is updated.
de: Dies ist die Priorität des Action Sets. Wenn mehrere aktive Action Sets mit Aktionen an dieselben Controller-Eingänge oder -Ausgänge gebunden sind, bestimmt das Action Set mit dem höchsten Prioritätswert die Aktion, die aktualisiert wird.
zh_tw: 這是操作集的優先權。如果多個活動操作集的操作綁定到相同的控制器輸入或輸出，則具有最高優先權值的操作集將決定更新的操作。

source: Actions
de: Aktionen
zh_tw: 動作

source: In the XR action map, actions are the entities that your game/application will interact with. For instance, we can define an action ``Shoot`` and the input bound to that action will trigger the ``button_pressed`` signal on the relevant :ref:`XRController3D <class_xrcontroller3d>` node in your scene with ``Shoot`` as the ``name`` parameter of the signal.
de: In der XR Action-Map sind Aktionen die Entitäten, mit denen Ihr Spiel/Ihre Anwendung interagieren wird. Zum Beispiel können wir eine Aktion ``Shoot`` definieren und die Eingabe, die an diese Aktion gebunden ist, wird das Signal ``button_pressed`` auf dem entsprechenden :ref:`XRController3D <class_xrcontroller3d>`-Node in Ihrer Szene mit ``Shoot`` als ``name``-Parameter des Signals auslösen.
zh_tw: 在 XR 動作地圖中，動作是您的遊戲/應用程式將與之互動的實體。例如，我們可以定義一個動作“Shoot”，綁定到該動作的輸入將使用“Shoot”觸發場景中相關 XRController3D <class_xrcontroller3d>` 節點上的“button_pressed”訊號` 作為訊號的 ``name`` 參數。

source: You can also poll the current state of an action. :ref:`XRController3D <class_xrcontroller3d>` for instance has an ``is_button_pressed`` method.
de: Man kann auch den aktuellen Zustand einer Aktion per Polling abfragen. :ref:`XRController3D <class_xrcontroller3d>` zum Beispiel hat eine ``is_button_pressed`` Methode.
zh_tw: 您也可以輪詢操作的目前狀態。 :ref:`XRController3D <class_xrcontroller3d>` 例如有一個 ``is_button_pressed`` 方法。

source: Actions can be used for both input and output and each action has a type that defines its behavior.
de: Aktionen können sowohl für die Eingabe als auch für die Ausgabe verwendet werden, und jede Aktion hat einen Typ, der ihr Verhalten definiert.
zh_tw: 操作可用於輸入和輸出，每個操作都有一個定義其行為的型別。

source: The ``Bool`` type is used for discrete input like buttons.
de: Der Typ ``Bool`` wird für diskrete Eingaben wie Buttons verwendet.
zh_tw: “Bool”型別用於離散輸入，例如按鈕。

source: The ``Float`` type is used for analogue input like triggers.
de: Der Typ ``Float`` wird für analoge Eingänge wie Trigger verwendet.
zh_tw: “Float”型別用於觸發器等類比輸入。

source: These two are special as they are the only ones that are interchangeable. OpenXR will handle conversions between ``Bool`` and ``Float`` inputs and actions. You can get the value of a ``Float`` type action by calling the method ``get_float`` on your :ref:`XRController3D <class_xrcontroller3d>` node. It emits the ``input_float_changed`` signal when changed.
de: Diese beiden sind besonders, da sie die einzigen sind, die austauschbar sind. OpenXR wird Konvertierungen zwischen ``Bool`` und ``Float``-Eingaben und Aktionen behandeln. Sie können den Wert einer Aktion vom Typ ``Float`` erhalten, indem Sie die Methode ``get_float`` auf Ihrem :ref:`XRController3D <class_xrcontroller3d>`-Node aufrufen. Sie gibt das Signal ``input_float_changed`` aus, wenn sie geändert wird.
zh_tw: 這兩者很特別，因為它們是唯一可以互換的。 OpenXR 將處理「Bool」和「Float」輸入和操作之間的轉換。您可以透過在 XRController3D <class_xrcontroller3d>` 節點上呼叫方法 ``get_float`` 來取得 ``Float`` 型別操作的值。更改時它會發出“input_float_changed”訊號。

source: Where analogue inputs are queried as buttons a threshold is applied. This threshold is currently managed exclusively by the XR runtime. There are plans to extend Godot to provide some level of control over these thresholds in the future.
de: Bei der Abfrage von Analogeingängen als Tasten wird ein Schwellenwert angewendet. Dieser Schwellenwert wird derzeit ausschließlich von der XR-Runtime verwaltet. Es ist geplant, Godot zu erweitern, um in Zukunft ein gewisses Maß an Kontrolle über diese Schwellenwerte zu ermöglichen.
zh_tw: 當類比輸入作為按鈕查詢時，會套用閾值。該閾值目前由 XR 運作時專門管理。我們計劃在未來擴充 Godot，以提供對這些閾值的某種程度的控制。

source: The ``Vector2`` type defines the input as an axis input. Touchpads, thumbsticks and similar inputs are exposed as vectors. You can get the value of a ``Vector2`` type action by calling the method ``get_vector2`` on your :ref:`XRController3D <class_xrcontroller3d>` node. It emits the ``input_vector2_changed`` signal when changed.
de: Der Typ ``Vector2`` definiert die Eingabe als Achseneingabe. Touchpads, Thumbsticks und ähnliche Eingaben werden als Vektoren dargestellt. Sie können den Wert einer Aktion vom Typ ``Vector2`` erhalten, indem Sie die Methode ``get_vector2`` auf Ihrem :ref:`XRController3D <class_xrcontroller3d>`-Node aufrufen. Er gibt das Signal ``input_vector2_changed`` aus, wenn er geändert wird.
zh_tw: “Vector2”型別將輸入定義為軸輸入。觸控板、拇指操縱桿和類似的輸入都以向量形式公開。您可以透過在 XRController3D <class_xrcontroller3d> 節點上呼叫方法「get_vector2」來取得「Vector2」型別操作的值。更改時它會發出“input_vector2_changed”訊號。

source: The ``Pose`` type defines a spatially tracked input. Multiple "pose" inputs are available in OpenXR: ``aim``, ``grip`` and ``palm``. Your :ref:`XRController3D <class_xrcontroller3d>` node is automatically positioned based on the pose action assigned to ``pose`` property of this node. More about poses later.
de: Der Typ ``Pose`` definiert eine räumlich getrackte Eingabe. Mehrere "Pose"-Eingaben sind in OpenXR verfügbar: ``aim``, ``grip`` und ``palm``. Ihr :ref:`XRController3D <class_xrcontroller3d>`-Node wird automatisch positioniert, basierend auf der Pose-Aktion, die der ``Pose``-Property dieser Nodes zugeordnet ist. Mehr über Posen später.
zh_tw: “Pose”型別定義了空間追蹤輸入。 OpenXR 中提供多個「姿勢」輸入：「aim」、「grip」 和「palm」。您的 XRController3D <class_xrcontroller3d> 節點會根據指派給該節點的「pose」屬性的姿勢動作自動定位。稍後詳細介紹姿勢。

source: The OpenXR implementation in Godot also exposes a special pose called ``Skeleton``. This is part of the hand tracking implementation. This pose is exposed through the ``skeleton`` action that is supported outside of the action map system. It is thus always present if hand tracking is supported. You don't need to bind actions to this pose to use it.
de: Die OpenXR-Implementierung in Godot stellt auch eine spezielle Pose namens ``Skelett`` zur Verfügung. Diese ist Teil der Hand-Tracking-Implementierung. Diese Pose wird durch die Aktion ``Skelett`` dargestellt, die außerhalb des Action-Map-Systems unterstützt wird. Sie ist also immer vorhanden, wenn die Handverfolgung unterstützt wird. Man muss keine Aktionen an diese Pose binden, um sie zu benutzen.
zh_tw: Godot 中的 OpenXR 實作也公開了一種名為「Skeleton」的特殊姿勢。這是手部追蹤實施的一部分。這個姿勢是透過動作地圖系統外部支援的「骨架」動作來暴露的。因此，如果支援手部跟踪，它就會始終存在。您不需要將動作綁定到此姿勢即可使用它。

source: Finally, the only output type is ``Haptic`` and it allows us to set the intensity of haptic feedback, such as controller vibration. Controllers can have multiple haptic outputs and support for haptic vests is coming to OpenXR.
de: Schließlich ist der einzige Ausgabetyp ``Haptic`` und erlaubt es uns, die Intensität des haptischen Feedbacks, wie z.B. die Vibration des Controllers, einzustellen. Controller können mehrere haptische Ausgänge haben und Unterstützung für haptische Westen ist für OpenXR geplant.
zh_tw: 最後，唯一的輸出型別是“觸覺”，它允許我們設定觸覺回饋的強度，例如控制器振動。控制器可以有多個觸覺輸出，而 OpenXR 即將支援觸覺背心。

source: So lets add an action for our aim pose, we do this by clicking on the ``+`` button for our action set:
de: Fügen wir also eine Aktion für unsere Zielpose hinzu, indem wir auf den ``+``-Button für unser Action Set klicken:
zh_tw: 因此，讓我們為我們的目標姿勢新增一個動作，我們透過點擊動作集的「+」按鈕來完成此操作：

source: This is the internal name of the action. OpenXR doesn't specify specific restrictions on this name other then size, however some XR runtimes will not like spaces or special characters.
de: Dies ist der interne Name der Aktion. OpenXR gibt für diesen Namen außer der Größe keine besonderen Beschränkungen vor, allerdings mögen einige XR-Runtimes keine Leerzeichen oder Sonderzeichen.
zh_tw: 這是操作的內部名稱。除了大小之外，OpenXR 沒有對此名稱指定特定限制，但是某些 XR 運作時不喜歡空格或特殊字元。

source: Aim pose
de: Ziel-Pose
zh_tw: 瞄準姿勢

source: This is a human-readable name for the action. Some XR runtimes will display this name to the end user, for example in configuration dialogs.
de: Dies ist ein von Menschen lesbarer Name für die Aktion. Einige XR-Runtimes zeigen dem Endbenutzer diesen Namen an, zum Beispiel in Konfigurationsdialogen.
zh_tw: 這是該操作的人類可讀名稱。某些 XR 運作時會向最終使用者顯示此名稱，例如在設定對話方塊中。

source: Pose
zh_tw: 姿勢

source: The type of this action.
de: Der Typ dieser Aktion.
zh_tw: 有名稱的型別

source: OpenXR defines a number of bindable input poses that are commonly available for controllers. There are no rules for which poses are supported for different controllers. The poses OpenXR currently defines are:
de: OpenXR definiert eine Reihe von Binding-fähigen Eingabeposen, die für Controller allgemein verfügbar sind. Es gibt keine Regeln dafür, welche Posen für verschiedene Controller unterstützt werden. Die Posen, die OpenXR derzeit definiert, sind:
zh_tw: OpenXR 定義了許多可綁定的輸入姿勢，這些姿勢通常可用於控制器。對於不同控制器支援哪些姿勢沒有規則。 OpenXR 目前定義的姿勢是：
