Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: de, zh_tw

source: The aim pose on most controllers is positioned slightly infront of the controller and aims forward. This is a great pose to use for laser pointers or to align the muzzle of a weapon with.
de: Bei den meisten Controllern ist die Zielposition leicht vor dem Controller positioniert und zielt nach vorne. Dies ist eine großartige Pose für Laserpointer oder zum Ausrichten der Mündung einer Waffe.
zh_tw: 大多數控制器上的目標姿勢稍微位於控制器前方並向前瞄準。這是用於雷射筆或對準武器槍口的絕佳姿勢。

source: The grip pose on most controllers is positioned where the grip button is placed on the controller. The orientation of this pose differs between controllers and can differ for the same controller on different XR runtimes.
de: Bei den meisten Controllern befindet sich die Griffhaltung an der Stelle, an der sich die Grifftaste auf dem Controller befindet. Die Ausrichtung dieser Pose ist von Controller zu Controller unterschiedlich und kann für denselben Controller bei verschiedenen XR-Runtimes unterschiedlich sein.
zh_tw: 大多數控制器上的握持姿勢位於控制器上握持按鈕所在的位置。此姿勢的方向因控制器而異，並且對於不同 XR 運作時的相同控制器也可能不同。

source: The palm pose on most controllers is positioned in the center of the palm of the hand holding the controller. This is a new pose that is not available on all XR runtimes.
de: Die Handflächen-Pose wird bei den meisten Controllern in der Mitte der Handfläche der Hand positioniert, die den Controller hält. Dies ist eine neue Pose, die nicht in allen XR-Runtimes verfügbar ist.
zh_tw: 大多數控制器上的手掌姿勢位於握住控制器的手掌的中心。這是一個新姿勢，並非在所有 XR 運作時都可用。

source: If hand tracking is used, there are currently big differences in implementations between the different XR runtimes. As a result the action map is currently not suitable for hand tracking. Work is being done on this so stay tuned.
de: Wenn Handtracking verwendet wird, gibt es derzeit große Unterschiede in den Implementierungen zwischen den verschiedenen XR Runtimes. Daher ist die Action-Map derzeit nicht für die Handverfolgung geeignet. Daran wird gearbeitet, also bleiben Sie dran.
zh_tw: 如果使用手部追踪，目前不同 XR 運作時之間的實作存在很大差異。因此，動作地圖目前不適合手部追蹤。這方面的工作正在進行中，敬請關注。

source: Let's complete our list of actions for a very simple shooting game/application:
de: Vervollständigen wir unsere Liste der Aktionen für einen sehr einfaches Shooter/eine einfache Anwendung:
zh_tw: 讓我們完成一個非常簡單的射擊遊戲/應用程式的操作列表：

source: The actions we have added are:
de: Wir haben folgende Aktionen hinzugefügt:
zh_tw: 我們新增的操作是：

source: movement, which allows the user to move around outside of normal room scale tracking.
de: Bewegung, die es dem Benutzer ermöglicht, sich außerhalb des normalen Raum-Trackings zu bewegen.
zh_tw: 移動，允許使用者在正常房間規模追蹤之外移動。

source: grab, which detects that the user wants to hold something.
de: Greifen, das erkennt, dass der Benutzer etwas festhalten möchte.
zh_tw: 抓取，它偵測到使用者想要握住某物。

source: shoot, which detects that the user wants to fire the weapon they are holding.
de: Schießen, das erkennt, dass der Benutzer die Waffe, die er in der Hand hält, abfeuern möchte.
zh_tw: 射擊，它偵測到使用者想要使用他們持有的武器開火。

source: haptic, which allows us to output haptic feedback.
de: Haptisch, was uns ermöglicht, haptisches Feedback auszugeben.
zh_tw: 觸覺，它允許我們輸出觸覺回饋。

source: Now note that we don't distinguish between the left and right hand. This is something that is determined at the next stage. We've implemented the action system in such a way that you can bind the same action to both hands. The appropriate :ref:`XRController3D <class_xrcontroller3d>` node will emit the signal.
de: Beachten Sie nun, dass wir nicht zwischen der linken und der rechten Hand unterscheiden. Das wird erst in der nächsten Phase festgelegt. Wir haben das Action-System so implementiert, dass man die gleiche Aktion an beide Hände binden kann. Der entsprechende :ref:`XRController3D <class_xrcontroller3d>`-Node wird das Signal ausgeben.
zh_tw: 現在請注意，我們不區分左手和右手。這是下一階段確定的事。我們以這樣的方式實作了動作系統，您可以將相同的動作綁定到雙手。對應的 XRController3D <class_xrcontroller3d> 節點將發出訊號。

source: For both grab and shoot we've used the ``Bool`` type. As mentioned before, OpenXR does automatic conversions from an analogue controls however not all XR Runtimes currently apply sensible thresholds.
de: Sowohl für Greifen als auch für Schießen haben wir den Typ ``Bool`` verwendet. Wie bereits erwähnt, führt OpenXR automatische Konvertierungen von analogen Controls durch, jedoch wenden derzeit nicht alle XR Runtimes sinnvolle Schwellenwerte an.
zh_tw: 對於抓取和射擊，我們都使用了“Bool”型別。如前所述，OpenXR 會從模擬控制進行自動轉換，但目前並非所有 XR 運作時都會套用合理的閾值。

source: We recommend as a workaround to use the ``Float`` type when interacting with triggers and grip buttons and apply your own threshold.
de: Wir empfehlen als Workaround, den Typ ``Float`` zu verwenden, wenn Sie mit Triggern und Grip-Buttons interagieren und Ihren eigenen Schwellenwert anwenden.
zh_tw: 手把按鈕互動時使用「Float」型別作為解決方法，並套用您自己的閾值。

source: For buttons like A/B/X/Y and similar where there is no analogue option, the ``Bool`` type works fine.
de: Für Buttons wie A/B/X/Y und ähnliche, bei denen es keine analoge Option gibt, funktioniert der Typ ``Bool`` gut.
zh_tw: 對於 A/B/X/Y 等按鈕以及沒有模擬選項的類似按鈕，「Bool」型別效果很好。

source: You can bind the same action to multiple inputs for the same controller on the same profile. In this case the XR runtime will attempt to combine the inputs.
de: Sie können dieselbe Aktion an mehrere Eingänge für denselben Controller im selben Profil binden. In diesem Fall wird die XR Runtime versuchen, die Eingänge zu kombinieren.
zh_tw: 您可以將相同的操作綁定到同一設定檔上同一控制器的多個輸入。在這種情況下，XR 運作時將嘗試組合輸入。

source: For ``Bool`` inputs, this will perform an ``OR`` operation between the buttons.
de: Bei ``Bool``-Eingängen wird eine ``ODER``-Operation zwischen den Buttons durchgeführt.
zh_tw: 對於“Bool”輸入，這將在按鈕之間執行“OR”操作。

source: For ``Float`` inputs, this will take the highest value of the bound inputs.
de: Bei ``Float``-Eingaben wird der höchste Wert der gebundenen Eingaben genommen.
zh_tw: 對於“Float”輸入，這將採用綁定輸入的最高值。

source: The behavior for ``Pose`` inputs is undefined, but the first bound input is likely to be used.
de: Das Verhalten für ``Pose``-Eingaben ist undefiniert, aber die erste gebundene Eingabe wird wahrscheinlich verwendet.
zh_tw: “Pose” 輸入的行為未定義，但可能會使用第一個綁定輸入。

source: You shouldn't bind multiple actions of the same action set to the same controller input. If you do this, or if actions are bound from multiple action sets but they have overlapping priorities, the behavior is undefined. The XR runtime may simply not accept your action map, or it may take this on a first come first serve basis.
de: Sie sollten nicht mehrere Aktionen desselben Action Sets an denselben Controller-Eingang binden. Wenn Sie dies tun, oder wenn Aktionen aus mehreren Action Sets gebunden sind, diese aber überlappende Prioritäten haben, ist das Verhalten undefiniert. Es kann sein, dass die XR-Runtime Ihre Action-Map einfach nicht akzeptiert, oder dass sie diese nach dem Prinzip "Wer zuerst kommt, mahlt zuerst" annimmt.
zh_tw: 您不應將同一操作集的多個操作綁定到同一控制器輸入。如果您這樣做，或者如果操作是從多個操作集綁定的，但它們具有重疊的優先權，則行為是未定義的。 XR 運作時可能根本不接受您的操作圖，或者它可能會按照先到先得的原則接受此操作圖。

source: We are still investigating the restrictions around binding multiple actions to the same output as this scenario makes sense. The OpenXR specification seems to not allow this.
de: Wir sind noch dabei, die Einschränkungen für das Binding mehrerer Aktionen an denselben Ausgang zu untersuchen, da dieses Szenario sinnvoll ist. Die OpenXR-Spezifikation scheint dies nicht zu erlauben.
zh_tw: 我們仍在研究將多個操作綁定到相同輸出的限制，因為這種情況是有意義的。 OpenXR 規格似乎不允許這樣做。

source: Now that we have our basic actions defined, it's time to hook them up.
de: Nun, da wir unsere grundlegenden Aktionen definiert haben, ist es an der Zeit, sie zu verknüpfen.
zh_tw: 現在我們已經定義了基本操作，是時候將它們連接起來了。

source: Profiles
de: Profile
zh_tw: 分析工具

source: In OpenXR controller bindings are captured in so-called "Interaction Profiles". We've simply shortened it to "Profiles" because it takes up less space.
de: In OpenXR werden Controller-Bindings in so genannten "Interaktionsprofilen" festgehalten. Wir haben es einfach zu "Profilen" abgekürzt, weil es weniger Platz braucht.
zh_tw: 在 OpenXR 中，控制器綁定在所謂的「互動配置」中捕獲。我們只是將其縮短為“配置檔案”，因為它佔用的空間更少。

source: This generic name is chosen because controllers don't cover the entire system. Currently there are also profiles for trackers, remotes and tracked pens. There are also provisions for devices such as treadmills, haptic vests and such even though those are not part of the specification yet.
de: Dieser generische Name wurde gewählt, weil die Controller nicht das gesamte System abdecken. Derzeit gibt es auch Profile für Tracker, Fernbedienungen und Tracking-Stifte. Es gibt auch Bestimmungen für Geräte wie Laufbänder, haptische Westen und dergleichen, auch wenn diese noch nicht Teil der Spezifikation sind.
zh_tw: 選擇此通用名稱是因為控制器不覆蓋整個系統。目前還有追蹤器、遙控器和追蹤筆的設定檔。還有針對跑步機、觸覺背心等裝置的規定，儘管這些裝置尚未包含在規範中。

source: It is important to know that OpenXR has strict checking on supported devices. The core specification identifies a number of controllers and similar devices with their supported inputs and outputs. Every XR runtime must accept these interaction profiles even if they aren't applicable.
de: Es ist wichtig zu wissen, dass OpenXR eine strenge Prüfung der unterstützten Geräte vornimmt. Die Kernspezifikation identifiziert eine Reihe von Controllern und ähnlichen Geräten mit ihren unterstützten Ein- und Ausgängen. Jede XR-Runtime muss diese Interaktionsprofile akzeptieren, auch wenn sie nicht anwendbar sind.
zh_tw: 重要的是要知道 OpenXR 對支援的裝置有嚴格的檢查。核心規範確定了許多控制器和類似裝置及其支援的輸入和輸出。每個 XR 運作時都必須接受這些互動配置檔案，即使它們不適用。

source: New devices are added through extensions and XR runtimes must specify which ones they support. XR runtimes that do not support a device added through extensions will not accept these profiles. XR runtimes that do not support added input or output types will often crash if supplied.
de: Neue Geräte werden durch Erweiterungen hinzugefügt und XR-Runtimes müssen angeben, welche Geräte sie unterstützen. XR-Runtimes, die ein durch Extensions hinzugefügtes Gerät nicht unterstützen, akzeptieren diese Profile nicht. XR-Runtimes, die hinzugefügte Eingabe- oder Ausgabetypen nicht unterstützen, stürzen oft ab, wenn sie bereitgestellt werden.
zh_tw: 新裝置是透過擴充功能新增的，XR 運作時必須指定它們支援哪些裝置。不支援透過擴充功能新增的裝置的 XR 運作時將不接受這些設定檔。如果提供不支援新增的輸入或輸出型別的 XR 運作時通常會當機。

source: As such Godot keeps meta data of all available devices, their inputs and outputs and which extension adds support for them. You can create interaction profiles for all devices you wish to support. Godot will filter out those not supported by the XR runtime the user is using.
de: Godot speichert Metadaten über alle verfügbaren Geräte, ihre Ein- und Ausgänge und welche Extension sie unterstützt. Sie können Interaktionsprofile für alle Geräte erstellen, die Sie unterstützen möchten. Godot filtert diejenigen heraus, die von der XR-Runtime, die der Benutzer verwendet, nicht unterstützt werden.
zh_tw: 因此，Godot 保留所有可用裝置的元資料、它們的輸入和輸出以及哪個擴充新增了對它們的支援。您可以為您希望支援的所有裝置建立互動設定檔。 Godot 將篩選掉使用者正在使用的 XR 執行時間不支援的內容。

source: This does mean that in order to support new devices, you might need to update to a more recent version of Godot.
de: Dies bedeutet, dass Sie möglicherweise auf eine neuere Version von Godot aktualisieren müssen, um neue Geräte zu unterstützen.
zh_tw: 這確實意味著為了支援新裝置，您可能需要更新到更新版本的 Godot。

source: It is however also important to note that the action map has been designed with this in mind. When new devices enter the market, or when your users use devices that you do not have access to, the action map system relies on the XR runtime. It is the XR runtime's job to choose the best fitting interaction profile that has been specified and adapt it for the controller the user is using.
de: Es ist jedoch auch wichtig zu wissen, dass die Action-Map unter diesem Gesichtspunkt entwickelt wurde. Wenn neue Geräte auf den Markt kommen oder wenn Ihre Benutzer Geräte verwenden, auf die Sie keinen Zugriff haben, ist das Action-Map-System auf die XR-Runtime angewiesen. Es ist die Aufgabe der XR-Runtime, das am besten geeignete Interaktionsprofil auszuwählen, das angegeben wurde, und es an den vom Benutzer verwendeten Controller anzupassen.
zh_tw: 然而，同樣重要的是要注意，行動地圖的設計就考慮到了這一點。當新裝置進入市場時，或當您的使用者使用您無權存取的裝置時，動作地圖系統將依賴 XR 運作時。 XR 運作時的工作是選擇已指定的最合適的互動設定檔並使其適應使用者正在使用的控制器。

source: How the XR runtime does this is left to the implementation of the runtime and there are thus vast differences between the runtimes. Some runtimes might even permit users to edit the bindings themselves.
de: Wie die XR Runtime dies tut, bleibt der Implementierung der Runtime überlassen, und so gibt es große Unterschiede zwischen den Runtimes. Einige Runtimes erlauben es dem Benutzer sogar, die Bindings selbst zu bearbeiten.
zh_tw: XR 運作時如何做到這一點取決於運作時的實作，因此運作時之間存在巨大差異。某些運作時甚至可能允許使用者自行編輯綁定。

source: A common approach for a runtime is to look for a matching interaction profile first. If this is not found it will check the most common profiles such as that of the "Touch controller" and do a conversion. If all else fails, it will check the generic :ref:`"Simple controller" <doc_xr_action_map_simple>`.
de: Ein üblicher Ansatz für eine Runtime ist es, zunächst nach einem passenden Interaktionsprofil zu suchen. Wird dieses nicht gefunden, werden die gebräuchlichsten Profile wie das des "Touch-Controllers" geprüft und eine Konvertierung vorgenommen. Wenn alles andere fehlschlägt, prüft sie das generische :ref:`"Einfacher controller" <doc_xr_action_map_simple>`.
zh_tw: 運作時的常見方法是先尋找配對的互動配置檔。如果未找到，它將檢查最常見的配置檔案，例如“觸摸控制器”的配置檔案並進行轉換。如果所有其他方法都失敗，它將檢查通用「簡單控制器」<doc_xr_action_map_simple>`。

source: There is an important conclusion to be made here: When a controller is found, and the action map is applied to it, the XR runtime is not limited to the exact configurations you set up in Godot's action map editor. While the runtime will generally choose a suitable mapping based on one of the bindings you set up in the action map, it can deviate from it.
de: Es gibt eine wichtige Schlussfolgerung, die hier gezogen werden muss: Wenn ein Controller gefunden und die Action-Map auf ihn angewendet wird, ist die XR Runtime nicht auf die exakten Konfigurationen beschränkt, die Sie im Action-Map-Editor von Godot eingerichtet haben. Die Runtime wählt in der Regel ein geeignetes Mapping auf der Grundlage einer der von Ihnen in der Action-Map eingerichteten Bindings, kann aber auch davon abweichen.
zh_tw: 這裡有一個重要的結論：當找到控制器並將動作圖應用於它時，XR 運作時並不限於您在 Godot 的動作圖編輯器中設定的確切配置。雖然運作時通常會根據您在操作對應中設定的綁定之一選擇合適的對應，但它可能會偏離它。

source: For example, when the Touch controller profile is used any of the following scenarios could be true:
de: Bei Verwendung des Touch-Controller-Profils kann beispielsweise eines der folgenden Szenarien zutreffen:
zh_tw: 例如，使用觸控控制器設定檔時，可能會出現以下任一情況：

source: we could be using a Quest 1 controller,
de: wir könnten einen Quest 1 Controller verwenden,
zh_tw: VR控制器的程式碼

source: we could be using a Quest 2 controller,
de: wir könnten einen Quest 2-Controller verwenden,
zh_tw: VR控制器的程式碼

source: we could be using a Quest Pro controller but no Quest Pro profile was given or the XR runtime being used does not support the Quest Pro controller,
de: wir könnten einen Quest Pro-Controller verwenden, aber es wurde kein Quest Pro-Profil angegeben oder die verwendete XR Runtime unterstützt den Quest Pro Controller nicht,
zh_tw: 我們可以使用 Quest Pro 控制器，但沒有給出 Quest Pro 設定檔案，或者正在使用的 XR 運作時不支援 Quest Pro 控制器，

source: it could be a completely different controller for which no profile was given but the XR runtime is using the touch bindings as a base.
de: es könnte sich um einen völlig anderen Controller handeln, für den kein Profil angegeben wurde, aber die XR-Runtime verwendet die Touch-Bindings als Grundlage.
zh_tw: 它可能是一個完全不同的控制器，沒有給出配置檔案，但 XR 運作時使用觸摸綁定作為基礎。

source: Ergo, there currently is no way to know with certainty, which controller the user is actually using.
de: Daher gibt es derzeit keine Möglichkeit, mit Sicherheit festzustellen, welchen Controller der Benutzer tatsächlich verwendet.
zh_tw: 因此，目前無法確定使用者實際使用哪個控制器。

source: Finally, and this trips up a lot of people, the bindings aren't set in stone. It is fully allowed, and even expected, that an XR runtime allows a user to customise the bindings.
de: Schließlich, und das verwirrt viele Leute, sind die Bindings nicht in Stein gemeißelt. Es ist völlig zulässig und wird sogar erwartet, dass eine XR Runtime dem Benutzer erlaubt, die Bindings anzupassen.
zh_tw: 最後，這讓很多人感到困惑，綁定並不是一成不變的。 XR 運作時允許使用者自訂綁定是完全允許的，甚至是預期的。

source: At the moment none of the XR runtimes offer this functionality though SteamVR has an existing UI from OpenVRs action map system that is still accessible. This is actively being worked on however.
de: Im Moment bietet keine der XR-Runtimes diese Funktionalität, obwohl SteamVR eine bestehende UI von OpenVRs Action-Map-System hat, die noch zugänglich ist. Daran wird jedoch aktiv gearbeitet.
zh_tw: 目前，沒有任何 XR 運作時提供此功能，儘管 SteamVR 擁有來自 OpenVR 動作地圖系統的現有 UI，但仍然可以存取。不過，這方面的工作正在積極進行中。

source: Our first controller binding
de: Unser erstes Controller-Binding
zh_tw: 第一個控制器綁定

source: Let's set up our first controller binding, using the Touch controller as an example.
de: Richten wir unser erstes Controller-Binding ein, indem wir den Touch-Controller als Beispiel verwenden.
zh_tw: 讓我們以觸控控制器為例設定第一個控制器綁定。

source: Press "Add profile", find the Touch controller, and add it. If it is not in the list, then it may already have been added.
de: Drücken Sie auf "Profil hinzufügen", suchen Sie den Touch Controller und fügen Sie ihn hinzu. Wenn er nicht in der Liste steht, wurde er möglicherweise bereits hinzugefügt.
zh_tw: 按“新增設定檔”，找到觸控控制器並新增它。如果它不在列表中，則它可能已被新增。

source: Our UI now shows panels for both the left and right controllers. The panels contain all of the possible inputs and outputs for each controller. We can use the ``+`` next to each entry to bind it to an action:
de: Unsere Benutzeroberfläche zeigt nun Panels für den linken und rechten Controller. Die Panels enthalten alle möglichen Ein- und Ausgänge für jeden Controller. Wir können das ``+`` neben jedem Eintrag verwenden, um ihn an eine Aktion zu binden:
zh_tw: 我們的 UI 現在顯示左右控制器的面板。面板包含每個控制器的所有可能的輸入和輸出。我們可以使用每個條目旁邊的“+”將其綁定到一個操作：

source: Let's finish our configuration:
de: Beenden wir unsere Konfiguration:
zh_tw: 程式碼樣式設定

source: Each action is bound the given input or output for both controllers to indicate that we support the action on either controller. The exception is the movement action which is bound only to the right hand controller. It is likely that we would want to use the left hand thumbstick for a different purpose, say a teleport function.
de: Jede Aktion ist an den angegebenen Eingang oder Ausgang für beide Controller gebunden, um anzuzeigen, dass wir die Aktion auf beiden Controllern unterstützen. Die Ausnahme ist die Bewegungsaktion, die nur an den Controller der rechten Hand gebunden ist. Es ist wahrscheinlich, dass wir den Thumbstick der linken Hand für einen anderen Zweck verwenden wollen, z.B. für eine Teleportfunktion.
zh_tw: 每個操作都綁定兩個控制器的給定輸入或輸出，以表示我們支援任一控制器上的操作。例外情況是移動動作僅綁定到右手控制器。我們很可能希望將左手拇指操縱桿用於不同的目的，例如傳送功能。

source: In developing your game/application you have to account for the possibility that the user changes the binding and binds the movement to the left hand thumbstick.
de: Bei der Entwicklung Ihres Spiels/Ihrer Anwendung müssen Sie die Möglichkeit berücksichtigen, dass der Benutzer das Binding ändert und die Bewegung an den linken Thumbstick bindet.
zh_tw: 在開發遊戲/應用程式時，您必須考慮使用者更改綁定並將運動綁定到左手搖桿的可能性。

source: Also note that our shoot and grab boolean actions are linked to inputs of type ``Float``. As mentioned before OpenXR will do conversions between the two, but do read the warning given on that subject earlier in this document.
de: Beachten Sie auch, dass unsere booleschen Aktionen Schießen und Greifen mit Eingaben vom Typ ``Float`` verknüpft sind. Wie bereits erwähnt, führt OpenXR Konvertierungen zwischen den beiden Typen durch, aber lesen Sie bitte die Warnung zu diesem Thema weiter oben in diesem Dokument.
zh_tw: 另請注意，我們的射擊和抓取布林操作與“Float”型別的輸入相關聯。如前所述，OpenXR 將在兩者之間進行轉換，但請閱讀本文件前面關於該主題的警告。

source: Some of the inputs seem to appear in our list multiple times.
de: Einige der Eingaben scheinen mehrfach in unserer Liste aufzutauchen.
zh_tw: 有些輸入似乎多次出現在我們的列表中。

source: For instance we can find the ``X`` button twice, once as ``X click`` and then as ``X touch``. This is due to the Touch controller having a capacitive sensor.
de: Zum Beispiel können wir den ``X``-Button zweimal finden, einmal als ``X-Klick`` und dann als ``X-Touch``. Das liegt daran, dass der Touch-Controller einen kapazitiven Sensor hat.
zh_tw: 例如，我們可以找到“X”按鈕兩次，一次是“X click”，然後是“X touch”。這是由於觸控控制器具有電容式感測器。

source: ``X touch`` will be true if the user is merely touching the X button.
de: ``X-Touch`` ist "true", wenn der Benutzer lediglich die X-Taste berührt.
zh_tw: 如果使用者只是觸摸 X 按鈕，則「X touch」將為 true。

source: ``X click`` will be true when the user is actually pressing down on the button.
de: ``X-Klick`` wird "true" sein, wenn der Benutzer tatsächlich auf den Button drückt.
zh_tw: 當使用者實際按下按鈕時，「X click」將為 true。

source: Similarly for the thumbstick we have:
de: Ähnlich verhält es sich mit dem Thumbstick:
zh_tw: 同樣，對於拇指操縱桿，我們有：

source: ``Thumbstick touch`` which will be true if the user is touching the thumbstick.
de: ``Thumbstick-Touch``, das "true" wird, wenn der Benutzer den Thumbstick berührt.
zh_tw: 如果使用者觸摸拇指操縱桿，則「拇指操縱桿觸摸」為真。

source: ``Thumbstick`` which gives a value for the direction the thumbstick is pushed to.
de: ``Thumbstick``, der einen Wert für die Richtung angibt, in die der Thumbstick gedrückt wird.
zh_tw: 「Thumbstick」 給出了拇指桿被推動的方向的值。

source: ``Thumbstick click`` which is true when the user is pressing down on the thumbstick.
de: ``Thumbstick-Klick``, der "true" ist, wenn der Benutzer den Thumbstick hinein drückt.
zh_tw: 當使用者按下拇指操縱桿時，會發生「拇指操縱桿點擊」。

source: It is important to note that only a select number of XR controllers support touch sensors or have click features on thumbsticks. Keep that in mind when designing your game/application. Make sure these are used for optional features of your game/application.
de: Es ist wichtig zu beachten, dass nur eine ausgewählte Anzahl von XR-Controllern Touch-Sensoren unterstützen oder über Klickfunktionen auf den Thumbsticks verfügen. Berücksichtigen Sie dies bei der Entwicklung Ihres Spiels/Ihrer Anwendung. Stellen Sie sicher, dass diese für optionale Funktionen Ihres Spiels/Ihrer Anwendung verwendet werden.
zh_tw: 值得注意的是，只有部分 XR 控制器支援觸控感應器或在搖桿上具有點擊功能。在設計遊戲/應用程式時請記住這一點。確保這些用於您的遊戲/應用程式的可選功能。

source: The simple controller
de: Der einfache Controller
zh_tw: 建立內容

source: The "Simple controller" is a generic controller that OpenXR offers as a fallback. We'll apply our mapping:
de: Der "Einfache Controller" ist ein generischer Controller, den OpenXR als Fallback anbietet. Wir werden unser Mapping anwenden:
zh_tw: 「簡單控制器」是 OpenXR 作為後備提供的通用控制器。我們將應用我們的對應：

source: As becomes painfully clear, the simple controller is often far too simple and falls short for anything but the simplest of VR games/applications.
de: Wie schmerzlich deutlich wird, ist der einfache Controller oft viel zu einfach und eignet sich nur für die einfachsten VR-Spiele und -Anwendungen.
zh_tw: 令人痛苦的是，顯而易見的是，簡單的控制器往往過於簡單，除了最簡單的 VR 遊戲/應用程式之外，其他任何東西都達不到要求。

source: This is why many XR runtimes only use it as a last resort and will attempt to use bindings from one of the more popular systems as a fallback first.
de: Aus diesem Grund verwenden viele XR-Runtimes sie nur als letzten Ausweg und versuchen zunächst, Bindings von einem der bekannteren Systeme als Ausweichlösung zu verwenden.
zh_tw: 這就是為什麼許多 XR 運作時僅將其用作最後手段，並首先嘗試使用來自更流行的系統之一的綁定作為後備。
