Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: de, zh_tw

source: Due to the simple controller likely not covering the needs of your game, it is tempting to provide bindings for every controller supported by OpenXR. The default action map seems to suggest this as a valid course of action. As mentioned before, the default action map was designed for ease of migration from Godot 3.
de: Da der einfache Controller wahrscheinlich nicht die Bedürfnisse Ihres Spiels abdeckt, ist es verlockend, Bindings für jeden von OpenXR unterstützten Controller bereitzustellen. Die Default Action-Map scheint diese Vorgehensweise zu empfehlen. Wie bereits erwähnt, wurde die Default Action-Map entwickelt, um die Migration von Godot 3 zu erleichtern.
zh_tw: 由於簡單的控制器可能無法滿足遊戲的需求，因此很容易為 OpenXR 支援的每個控制器提供綁定。預設的行動圖似乎顯示這是一個有效的行動方案。如前所述，預設的動作對應是為了方便從 Godot 3 遷移而設計的。

source: It is the recommendation from the OpenXR Working Group that only bindings for controllers actually tested by the developer are setup. The XR runtimes are designed with this in mind. They can perform a better job of rebinding a provided binding than a developer can make educated guesses. Especially as the developer can't test if this leads to a comfortable experience for the end user.
de: Die OpenXR Working Group empfiehlt, nur Bindings für Controller einzurichten, die vom Entwickler tatsächlich getestet wurden. Die XR-Runtimes sind mit diesem Gedanken im Hinterkopf entworfen worden. Sie können ein bereitgestelltes Binding besser neu verbinden als ein Entwickler, der nur Vermutungen anstellen kann. Zumal der Entwickler nicht testen kann, ob dies zu einem angenehmen Erlebnis für den Endbenutzer führt.
zh_tw: OpenXR 工作小組建議僅設定開發人員實際測試的控制器的綁定。 XR 運作時的設計就考慮到了這一點。他們可以比開發人員做出有根據的猜測更好地重新綁定所提供的綁定。特別是因為開發人員無法測試這是否會為最終使用者帶來舒適的體驗。

source: This is our advice as well: limit your action map to the interaction profiles for devices you have actually tested your game with. The Oculus Touch controller is widely used as a fallback controller by many runtimes. If you are able to test your game using a Meta Rift or Quest and add this profile there is a high probability your game will work with other headsets.
de: Dies ist auch unser Rat: Beschränken Sie Ihre Action-Map auf die Interaktionsprofile für Geräte, mit denen Sie Ihr Spiel tatsächlich getestet haben. Der Oculus Touch-Controller wird von vielen Runtimes als Fallback-Controller verwendet. Wenn Sie in der Lage sind, Ihr Spiel mit einer Meta Rift oder Quest zu testen und dieses Profil hinzuzufügen, ist die Wahrscheinlichkeit groß, dass Ihr Spiel auch mit anderen Headsets funktionieren wird.
zh_tw: 這也是我們的建議：將您的動作圖限制為您實際測試遊戲的裝置的互動設定檔。 Oculus Touch 控制器被許多運作時廣泛用作後備控制器。如果您能夠使用 Meta Rift 或 Quest 測試您的遊戲並新增此配置檔案，那麼您的遊戲很可能可以與其他耳機配合使用。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
