Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_room_scale.po
Languages: de, zh_tw

source: Room scale in XR
de: Raumgröße in XR
zh_tw: 根縮放

source: One of the staples of XR projects is the ability to walk around freely in a large space. This space is often constrained by the room the player is physically in with tracking sensors placed within this space. With the advent of inside out tracking however ever larger play spaces are possible.
de: Eines der Hauptmerkmale von XR-Projekten ist die Möglichkeit, sich in einem großen Raum frei zu bewegen. Dieser Raum ist oft durch das Zimmer begrenzt, in dem sich der Spieler befindet, und die Tracking-Sensoren sind innerhalb dieses Raums platziert. Mit dem Aufkommen von Inside-Out-Tracking sind jedoch immer größere Spielräume möglich.
zh_tw: XR 專案的主要特點之一是能夠在大空間中自由走動。該空間通常受到玩家所在房間的限制，並且追蹤感測器放置在該空間內。然而，隨著由內向外追蹤的出現，更大的遊戲空間成為可能。

source: As a developer this introduces a number of interesting challenges. In this document we will look at a number of the challenges you may face and outline some solutions. We'll discuss the issues and challenges for seated XR games in another document.
de: Als Entwickler bringt dies eine Reihe von interessanten Herausforderungen mit sich. In diesem Dokument gehen wir auf einige der Herausforderungen ein, mit denen Sie konfrontiert werden können, und skizzieren einige Lösungen. Wir werden die Probleme und Herausforderungen für XR-Spiele im Sitzen in einem anderen Dokument diskutieren.
zh_tw: 作為開發人員，這帶來了許多有趣的挑戰。在本文件中，我們將探討您可能面臨的一些挑戰並概述一些解決方案。我們將在另一份檔案中討論坐式 XR 遊戲的問題和挑戰。

source: Often developers sit behind their desk while building the foundation to their game. In this mode the issues with developing for room scale don't show themselves until it is too late. The advice here is to start testing while standing up and walking around as early as possible. Once you are happy your foundation is solid, you can develop in comfort while remaining seated.
de: Oft sitzen die Entwickler hinter ihrem Schreibtisch, während sie die Grundlage für ihr Spiel schaffen. In diesem Modus zeigen sich die Probleme bei der Entwicklung für die Raumgröße erst, wenn es zu spät ist. Hier ist es ratsam, so früh wie möglich mit dem Testen im Stehen und beim Herumlaufen zu beginnen. Sobald Sie sich sicher sind, dass Ihr Fundament solide ist, können Sie bequem im Sitzen entwickeln.

source: In traditional first person games a player is represented by a :ref:`CharacterBody3D <class_characterbody3d>` node. This node is moved by processing traditional controller, mouse or keyboard input. A camera is attached to this node at a location roughly where the player's head will be.
de: In traditionellen Ego-Spielen wird ein Spieler durch einen :ref:`CharacterBody3D <class_characterbody3d>`-Node dargestellt. Dieser Node wird durch die Verarbeitung traditioneller Controller-, Maus- oder Tastatureingaben bewegt. Eine Kamera ist an diesem Node an einer Stelle angebracht, an der sich ungefähr der Kopf des Spielers befindet.
zh_tw: 在傳統的第一人稱遊戲中，玩家由 CharacterBody3D <class_characterbody3d> 節點表示。此節點透過處理傳統控制器、滑鼠或鍵盤輸入來移動。相機連接到該節點，大致位於玩家頭部所在的位置。

source: Applying this model to the XR setup, we add an :ref:`XROrigin3D <class_xrorigin3d>` node as a child of the character body, and add a :ref:`XRCamera3D <class_xrcamera3d>` as a child of the origin node. At face value this seems to work. However, upon closer examination this model does not take into account that there are two forms of movement in XR. The movement through controller input, and the physical movement of the player in the real world.
de: Wendet man dieses Modell auf das XR-Setup an, fügt man einen :ref:`XROrigin3D <class_xrorigin3d>`-Node als Child-Node des Character-Bodys und einen :ref:`XRCamera3D <class_xrcamera3d>` als Child-Node des Origin-Nodes hinzu. Auf den ersten Blick scheint dies zu funktionieren. Bei näherer Betrachtung berücksichtigt dieses Modell jedoch nicht, dass es in XR zwei Formen der Bewegung gibt. Die Bewegung durch die Controller-Eingabe und die physische Bewegung des Spielers in der realen Welt.
zh_tw: 將此模型應用於 XR 設定，我們新增 XROrigin3D <class_xrorigin3d>` 節點作為角色身體的子節點，並新增 XRCamera3D <class_xrcamera3d>` 作為原始節點的子節點。從表面上看，這似乎有效。然而，經過仔細檢查，該模型並未考慮到 XR 中有兩種運動形式。透過控制器輸入進行的運動，以及玩家在現實世界中的物理運動。

source: As a result, the origin node does not represent the position of the player. It represents the center, or start of, the tracking space in which the player can physically move. As the player moves around their room this movement is represented through the tracking of the players headset. In game this translates to the camera node's position being updated accordingly. For all intents and purposes, we are tracking a disembodied head. Unless body tracking is available, we have no knowledge of the position or orientation of the player's body.
de: Folglich stellt der Origin-Node nicht die Position des Spielers dar. Er stellt die Mitte oder den Anfang des Tracking-Raums dar, in dem sich der Spieler physisch bewegen kann. Wenn sich der Spieler in seinem Zimmer bewegt, wird diese Bewegung durch das Tracking des Spieler-Headsets dargestellt. Im Spiel bedeutet dies, dass die Position des Kamera-Nodes entsprechend aktualisiert wird. In jeder Hinsicht verfolgen wir einen körperlosen Kopf. Solange keine Körper-Tracking verfügbar ist, haben wir keine Kenntnis über die Position oder Ausrichtung des Spielerkörpers.
zh_tw: 因此，原點節點並不代表玩家的位置。它代表玩家可以在其中物理移動的追蹤空間的中心或起點。當玩家在房間內移動時，這種移動是透過玩家耳機的追蹤來表示的。在遊戲中，這會相應地更新相機節點的位置。出於所有意圖和目的，我們正在追蹤一個脫離實體的頭部。除非身體追蹤可用，否則我們不知道玩家身體的位置或方向。

source: The first problem this causes is fairly obvious. When the player moves with controller input, we can use the same approach in normal games and move the player in a forward direction. However the player isn't where we think they are and as we move forward we're checking collisions in the wrong location.
de: Das erste Problem, das dadurch entsteht, ist ziemlich offensichtlich. Wenn sich der Spieler mit Hilfe der Controller-Eingabe bewegt, können wir den gleichen Ansatz wie in normalen Spielen verwenden und den Spieler in Vorwärtsrichtung bewegen. Der Spieler befindet sich jedoch nicht dort, wo wir denken, dass er ist, und während wir uns vorwärts bewegen, überprüfen wir Kollisionen an der falschen Stelle.
zh_tw: 這導致的第一個問題是相當明顯的。當玩家透過控制器輸入移動時，我們可以使用與正常遊戲中相同的方法並將玩家向前移動。然而，玩家並不在我們認為的位置，當我們前進時，我們會檢查錯誤位置的碰撞。

source: The second problem really shows itself when the player walks further away from the center of the tracking space and uses controller input to turn. If we rotate our character body, the player will be moved around the room in a circular fashion.
de: Das zweite Problem zeigt sich, wenn der Spieler sich weiter vom Zentrum des Tracking-Raums entfernt und die Controller-Eingabe zum Drehen verwendet. Wenn wir den Körper unserer Figur drehen, wird der Spieler kreisförmig durch den Raum bewegt.
zh_tw: 當玩家遠離追蹤空間的中心並使用控制器輸入進行轉彎時，第二個問題才真正顯現出來。如果我們旋轉角色身體，玩家將以圓形方式在房間內移動。

source: If we fix the above issues, we will find a third issue. When the path for the player is blocked in the virtual world, the player can still physically move forward.
de: Wenn wir die oben genannten Probleme lösen, werden wir ein drittes Problem finden. Wenn der Weg des Spielers in der virtuellen Welt blockiert ist, kann sich der Spieler trotzdem physisch vorwärts bewegen.
zh_tw: 如果我們解決了上述問題，我們就會發現第三個問題。當玩家的路徑在虛擬世界中被阻擋時，玩家仍然可以物理前進。

source: We will look at solving the first two problem with two separate solutions, and then discuss dealing with the third.
de: Wir werden die ersten beiden Probleme mit zwei separaten Lösungen angehen und uns dann mit dem dritten Problem befassen.
zh_tw: 我們將著眼於用兩個單獨的解決方案來解決前兩個問題，然後討論第三個問題的處理。

source: Origin centric solution
de: Ursprungszentrierte Lösung
zh_tw: 以原點為中心的解決方案

source: Looking at the first approach for solving this we are going to change our structure. This is the approach currently implemented in XR Tools.
de: Beim ersten Ansatz zur Lösung dieses Problems werden wir unsere Struktur ändern. Dies ist der Ansatz, der derzeit in XR Tools implementiert ist.
zh_tw: 看看解決這個問題的第一種方法，我們將改變我們的結構。這是 XR Tools 目前實施的方法。

source: In this setup we mark the character body as top level so it does not move with the origin.
de: Bei dieser Einstellung wird der Character Body als oberste Ebene markiert, damit er sich nicht mit dem Ursprung bewegt.
zh_tw: 在此設定中，我們將角色身體標記為頂層，因此它不會隨原點移動。

source: We also have a helper node that tells us where our neck joint is in relation to our camera. We use this to determine where our body center is.
de: Wir haben auch einen Helfer-Node, der uns sagt, wo sich unser Nackengelenk in Bezug auf unsere Kamera befindet. Damit können wir bestimmen, wo sich unser Körperzentrum befindet.
zh_tw: 我們還有一個輔助節點，它告訴我們頸部關節相對於相機的位置。我們用它來確定我們的身體中心在哪裡。

source: Processing our character movement is now done in three steps.
de: Die Verarbeitung unserer Charakterbewegung erfolgt nun in drei Schritten.
zh_tw: 角色移動的處理現在要分三步進行。

source: The `Origin centric movement demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__ contains a more elaborate example of the technique described below.
de: Die `Ursprungszentrierte Bewegungsdemo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__ enthält ein ausführlicheres Beispiel für die unten beschriebene Methode.

source: Step 1
de: Schritt 1
zh_tw: 逐步執行

source: In the first step we're going to process the physical movement of the player. We determine where the player is right now, and attempt to move our character body there.
de: Im ersten Schritt verarbeiten wir die physische Bewegung des Spielers. Wir bestimmen, wo sich der Spieler gerade befindet, und versuchen, unseren Character Body dorthin zu bewegen.
zh_tw: 第一步，我們將處理玩家的身體運動。我們確定玩家現在所在的位置，並嘗試將我們的角色身體移動到那裡。

source: Note that we're returning ``true`` from our ``_process_on_physical_movement`` function when we couldn't move our player all the way.
de: Beachten Sie, daß wir ``true`` von unserer Funktion ``_process_on_physical_movement`` zurückgeben, wenn wir unseren Spieler nicht komplett zum Ziel bewegen konnten.
zh_tw: 請注意，當我們無法完全移動玩家時，我們將從「_process_on_physical_movement」函式傳回「true」。

source: Step 2
de: Schritt 2
zh_tw: 逐步執行

source: The second step is to handle rotation of the player as a result of user input.
de: Der zweite Schritt besteht darin, die Rotation des Spielers als Ergebnis der Benutzereingabe zu behandeln.
zh_tw: 第二步是根據使用者輸入處理玩家的旋轉。

source: As the input used can differ based on your needs we are simply calling the function ``_get_rotational_input``. This function should obtain the necessary input and return the rotational speed in radians per second.
de: Da die verwendete Eingabe je nach Bedarf unterschiedlich sein kann, rufen wir einfach die Funktion ``_get_rotational_input`` auf. Diese Funktion sollte die notwendige Eingabe erhalten und die Rotationsgeschwindigkeit in Bogenmaß pro Sekunde zurückgeben.
zh_tw: 由於使用的輸入可能會根據您的需求而有所不同，因此我們只是呼叫函式“_get_rotational_input”。此函式應獲得必要的輸入並傳回以弧度每秒為單位的旋轉速度。

source: For our example we are going to keep this simple and straight forward. We are not going to worry about comfort features such as snap turning and applying a vignette. We highly recommend implementing such comfort features.
de: Für unser Beispiel werden wir dies einfach und direkt halten. Wir werden uns nicht um Komfortfunktionen wie das Snap-Turning und die Anwendung einer Vignette kümmern. Wir empfehlen dringend, solche Komfortfunktionen zu implementieren.

source: We've added the call for processing our rotation to our physics process but we are only executing this if we were able to move our player fully. This means that if the player moves somewhere they shouldn't, we don't process further movement.
de: Wir haben den Aufruf zur Verarbeitung unserer Drehung zu unserem Physikprozess hinzugefügt, aber wir führen ihn nur aus, wenn wir unseren Spieler vollständig bewegen konnten. Das heißt, wenn sich der Spieler an eine Stelle bewegt, an die er sich nicht bewegen sollte, wird keine weitere Bewegung ausgeführt.

source: Step 3
de: Schritt 3
zh_tw: 逐步執行

source: The third and final step is moving the player forwards, backwards or sideways as a result of user input.
de: Der dritte und letzte Schritt ist die Bewegung des Spielers vorwärts, rückwärts oder seitwärts als Ergebnis der Benutzereingabe.
zh_tw: 第三步也是最後一步是根據使用者輸入向前、向後或側向移動玩家。

source: Just like with the rotation the inputs differ from project to project so we are simply calling the function ``_get_movement_input``. This function should obtain the necessary input and return a directional vector scaled to the required velocity.
de: Genau wie bei der Rotation unterscheiden sich die Eingaben von Projekt zu Projekt, so dass wir einfach die Funktion ``_get_movement_input`` aufrufen. Diese Funktion sollte die erforderlichen Eingaben erhalten und einen Richtungsvektor zurückgeben, der auf die erforderliche Geschwindigkeit skaliert ist.
zh_tw: 就像旋轉一樣，專案與專案之間的輸入也不同，因此我們只需呼叫函式「_get_movement_input」。此函式應獲得必要的輸入並傳回縮放至所需速度的方向向量。

source: Just like with rotation we're keeping it simple. Here too it is advisable to look at adding comfort settings.
de: Genau wie bei der Rotation halten wir es einfach. Auch hier ist es ratsam, zusätzliche Komforteinstellungen vorzunehmen.

source: Character body centric solution
de: Charakter-zentrische Lösung
zh_tw: 角色動畫

source: In this setup we are going to keep our character body as our root node and as such is easier to combine with traditional game mechanics.
de: In diesem Fall werden wir unseren Character Body als Root Node beibehalten, was die Kombination mit traditionellen Spielmechaniken erleichtert.
zh_tw: 在此設定中，我們將保留角色身體作為根節點，因此更容易與傳統遊戲機制結合。

source: Here we have a standard character body with collision shape, and our XR origin node and camera as normal children. We also have our neck helper node.
de: Hier haben wir einen Standard-Character Body mit Collision Shape, und unser XR Origin-Node und unsere Kamera als normale Child-Nodes. Wir haben auch unsere Hals-Helfer-Node.
zh_tw: 這裡我們有一個具有碰撞形狀的標準角色身體，以及我們的 XR 原點節點和相機作為普通子節點。我們還有頸部輔助節點。

source: Processing our character movement is done in the same three steps but implemented slightly differently.
de: Die Verarbeitung unserer Charakterbewegung erfolgt in denselben drei Schritten, ist aber etwas anders implementiert.
zh_tw: 處理我們的角色運動是透過相同的三個步驟完成的，但實施方式略有不同。

source: The `Character centric movement demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ contains a more elaborate example of the technique described below.
de: Die `Charakterzentrierte Bewegungsdemo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ enthält ein ausführlicheres Beispiel für die unten beschriebene Methode.

source: In this approach step 1 is where all the magic happens. Just like with our previous approach we will be applying our physical movement to the character body, but we will counter that movement on the origin node.
de: Bei diesem Ansatz ist Schritt 1 der Punkt, an dem die ganze Magie passiert. Genau wie bei unserem vorherigen Ansatz werden wir unsere physische Bewegung auf den Character Body anwenden, aber wir werden dieser Bewegung am Origin-Node entgegenwirken.
zh_tw: 在這個方法中，第 1 步是所有神奇發生的地方。就像我們之前的方法一樣，我們將把物理運動應用於角色身體，但我們將在原始節點上抵消該運動。

source: This will ensure that the players location stays in sync with the character body's location.
de: Dadurch wird sichergestellt, dass die Position des Spielers mit der Position des Charakters übereinstimmt.
zh_tw: 這將確保玩家位置與角色身體位置保持同步。

source: In essence the code above will move the character body to where the player is, and then move the origin node back in equal amounts. The result is that the player stays centered above the character body.
de: Im Wesentlichen wird der obige Code den Character Body dorthin bewegen, wo sich der Spieler befindet, und dann den Origin-Node in gleichem Maße zurückbewegen. Das Ergebnis ist, dass der Spieler über dem Character Body zentriert bleibt.
zh_tw: 本質上，上面的程式碼會將角色身體移動到玩家所在的位置，然後將原點節點移回等量。結果是玩家保持在角色身體上方的中心位置。

source: We start with applying the rotation. The character body should be facing where the player was looking the previous frame. We calculate our camera orientation in the space of the character body. We can now calculate the angle by which the player has rotated their head. We rotate our character body by the same amount so our character body faces the same direction as the player. And then we reverse the rotation on the origin node so the camera ends up aligned with the player again.
de: Wir beginnen mit der Anwendung der Rotation. Der Character Body sollte dorthin gerichtet sein, wohin der Spieler im vorherigen Bild geschaut hat. Wir berechnen unsere Kameraausrichtung im Raum des Character Bodys. Wir können nun den Winkel berechnen, um den der Spieler seinen Kopf gedreht hat. Wir drehen unseren Character Body um den gleichen Betrag, damit unser Character Body in die gleiche Richtung wie der Spieler schaut. Dann kehren wir die Drehung am Origin-Node um, so dass die Kamera wieder mit dem Spieler ausgerichtet ist.
zh_tw: 我們從應用旋轉開始。角色身體應該面向玩家在前一影格中註視的位置。我們計算角色身體空間中的相機方向。我們現在可以計算玩家旋轉頭部的角度。我們將角色身體旋轉相同的量，以便我們的角色身體面向與玩家相同的方向。然後我們反轉原點節點上的旋轉，以便相機最終再次與玩家對齊。

source: For the movement we do much the same. The character body should be where the player was standing the previous frame. We calculate by how much the player has moved from this location. Then we attempt to move the character body to this location.
de: Für die Bewegung machen wir das Gleiche. Der Character Body sollte sich an der Stelle befinden, wo der Spieler im vorigen Frame gestanden hat. Wir berechnen, um wie viel sich der Spieler von dieser Position aus bewegt hat. Dann versuchen wir, den Character Body an diese Stelle zu bewegen.
zh_tw: 對於運動，我們也做同樣的事情。角色身體應該是玩家在前一格站立的位置。我們根據玩家從該位置移動的距離來計算。然後我們嘗試將角色身體移動到這個位置。

source: As the player may hit a collision body and be stopped, we only move the origin point back by the amount we actually moved the character body. The player may thus move away from this location but that will be reflected in the positioning of the player.
de: Da der Spieler auf einen Collision Body treffen und angehalten werden kann, verschieben wir den Ursprung nur um den Betrag zurück, um den wir den Character Body tatsächlich bewegt haben. Der Spieler kann sich also von diesem Punkt wegbewegen, aber das wird sich in der Positionierung des Spielers widerspiegeln.
zh_tw: 由於玩家可能會碰到碰撞體並被停止，因此我們只將原點向後移動角色身體實際移動的量。因此，玩家可能會離開該位置，但這將反映在玩家的定位中。

source: As with our previous solution we return true if this is the case.
de: Wie bei unserer vorherigen Lösung geben wir true zurück, wenn dies der Fall ist.
zh_tw: 與我們之前的解決方案一樣，如果是這種情況，我們將傳回 true。

source: In this step we again apply the rotation based on controller input. However in this case the code is nearly identical to how one would implement this in a normal first person game.
de: Auch in diesem Schritt wird die Rotation auf der Grundlage der Controller-Eingabe durchgeführt. In diesem Fall ist der Code jedoch fast identisch mit dem, wie man dies in einem normalen Ego-Spiel implementieren würde.
zh_tw: 在此步驟中，我們再次根據控制器輸入應用旋轉。然而，在這種情況下，程式碼幾乎與在正常的第一人稱遊戲中實作此程式碼的方式相同。

source: For step three we again apply the movement based on controller input. However just like at step 2, we can now implement this as we would in a normal first person game.
de: In Schritt drei wenden wir die Bewegung wieder auf der Grundlage der Controller-Eingabe an. Doch genau wie bei Schritt 2 können wir dies nun wie in einem normalen Ego-Spiel umsetzen.
zh_tw: 對於第三步，我們再次應用基於控制器輸入的運動。然而，就像步驟 2 一樣，我們現在可以像在正常的第一人稱遊戲中一樣實作這一點。

source: When the player walks to somewhere they shouldn't
de: Wenn der Spieler irgendwo hingeht, wo er nicht hingehen sollte
zh_tw: 將玩家移動到樹狀結構中其他地方。

source: Think of a situation where the player is outside a locked room. You don't want the player to go into that room until the door is unlocked. You also don't want the player to see what is in this room.
de: Stellen Sie sich eine Situation vor, in der sich der Spieler vor einem verschlossenen Raum befindet. Sie möchten nicht, dass der Spieler den Raum betritt, bevor die Tür nicht aufgeschlossen ist. Sie wollen auch nicht, dass der Spieler sieht, was sich in diesem Raum befindet.
zh_tw: 想像一下玩家在上鎖的房間外面的狀況。在門解鎖之前，您不希望玩家進入該房間。您也不希望玩家看到這個房間裡有什麼。

source: The logic for moving the player through controller input nicely prevents this. The player encounters a static body, and the code prevents the player from moving into the room.
de: Die Logik für die Bewegung des Spielers durch die Controllereingabe verhindert dies auf angenehme Weise. Der Spieler trifft auf einen Static Body, und der Code verhindert, dass er sich in den Raum bewegt.
zh_tw: 透過控制器輸入移動玩家的邏輯很好地防止了這種情況。玩家遇到靜態物體，程式碼阻止玩家進入房間。

source: However with XR, nothing is preventing the player from taking a real step forward.
de: Doch mit XR hindert nichts den Spieler daran, einen echten Schritt nach vorne zu machen.
zh_tw: 然而，有了 XR，沒有什麼可以阻止玩家向前邁出真正的一步。

source: With both the approaches worked out up above we will prevent the character body from moving where the player can't go. As the player has physically moved to this location, the camera will now have moved into the room.
de: Mit den beiden oben ausgearbeiteten Ansätzen verhindern wir, dass sich der Character Body dorthin bewegt, wo der Spieler nicht hin kann. Da sich der Spieler physisch an diesen Ort bewegt hat, wird die Kamera nun in den Raum bewegt.
zh_tw: 透過上面提出的兩種方法，我們將防止角色身體移動到玩家無法到達的地方。當玩家實際移動到該位置時，攝影機現在也已移動到房間中。

source: The logical solution would be to prevent the movement altogether and adjust the placement of the XR origin point so the player stays outside of the room.
de: Die logische Lösung wäre, die Bewegung ganz zu verhindern und den XR-Ursprungspunkt so zu platzieren, dass der Spieler außerhalb des Raumes bleibt.
zh_tw: 合乎邏輯的解決方案是完全阻止移動並調整 XR 原點的位置，以便玩家留在房間外面。

source: The problem with this approach is that physical movement is now not replicated in the virtual space. This will cause nausea for the player.
de: Das Problem bei diesem Ansatz ist, dass die physische Bewegung im virtuellen Raum nicht mehr nachgebildet wird. Dies wird beim Spieler Übelkeit hervorrufen.
zh_tw: 這種方法的問題在於，實體運動現在無法在虛擬空間中複製。這會導致玩家感到噁心。

source: What many XR games do instead, is to measure the distance between where the player physically is, and where the players virtual body has been left behind. As this distance increases, usually to a distance of a few centimeters, the screen slowly blacks out.
de: Bei vielen XR-Spielen wird stattdessen die Entfernung zwischen dem physischen Standort des Spielers und dem Ort, an dem der virtuelle Body des Spielers zurückgelassen wurde, gemessen. Wenn dieser Abstand zunimmt, in der Regel bis zu einer Entfernung von einigen Zentimetern, wird der Bildschirm langsam schwarz.
zh_tw: 相反，許多 XR 遊戲所做的是測量玩家的實體位置與玩家的虛擬身體被拋在後面的位置之間的距離。隨著這個距離的增加，通常是幾公分的距離，螢幕會慢慢變黑。

source: Our solutions up above would allow us to add this logic into the code at the end of step 1.
de: Unsere obigen Lösungen würden es uns ermöglichen, diese Logik am Ende von Schritt 1 in den Code einzufügen.
zh_tw: 上面的解決方案允許我們將此邏輯新增到步驟 1 末尾的程式碼中。

source: Further improvements to the code presented could be:
de: Weitere Verbesserungen des vorgestellten Codes könnten sein:
zh_tw: 對所提供的程式碼的進一步改進可能是：

source: allowing controller input as long as this distance is still small,
de: Controller-Eingaben zu ermöglichen, solange dieser Abstand noch gering ist,
zh_tw: 只要這個距離仍然很小，就允許控制器輸入，

source: still applying gravity to the player even when controller input is disabled.
de: Schwerkraft auf den Spieler ausüben, auch wenn die Controller-Eingabe deaktiviert ist.
zh_tw: 即使控制器輸入被停用，仍然對玩家施加重力。
