Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_room_scale.po
Languages: de, zh_tw

source: The movement demos in our demo repository contain an example of blacking out the screen when a user walks into restricted areas.
de: Die Bewegungsdemos in unserem Demo-Repository enthalten ein Beispiel für die Verdunkelung des Bildschirms, wenn ein Benutzer in gesperrte Gebiete geht.

source: Further suggestions for improvements
de: Weitere Vorschläge für Verbesserungen
zh_tw: 進一步的改進建議

source: The above provides two good options as starting points for implementing room scale XR games.
de: Die obigen Ausführungen bieten zwei gute Ausgangspunkte für die Umsetzung von XR-Spielen in Raumgröße.
zh_tw: 以上提供了兩個很好的選擇作為實施房間規模 XR 遊戲的起點。

source: A few more things that are worth pointing out that you will likely want to implement:
de: Es gibt noch ein paar weitere Dinge, die Sie wahrscheinlich umsetzen wollen werden:
zh_tw: 您可能想要實施的還有一些值得指出的事情：

source: The height of the camera can be used to detect whether the player is standing up, crouching, jumping or lying down. You can adjust the size and orientation of the collision shape accordingly. Extra bonus points for adding multiple collision shapes so the head and body have their own, more accurately sized, shapes.
de: Anhand der Höhe der Kamera lässt sich erkennen, ob der Spieler steht, hockt, springt oder liegt. Sie können die Größe und Ausrichtung der Collision Shape entsprechend anpassen. Extra-Bonuspunkte gibt es für das Hinzufügen mehrerer Collision Shapes, so dass der Kopf und der Körper ihre eigenen, genauer bemessenen Shapes haben.
zh_tw: 相機的高度可以用來偵測玩家是站立、蹲伏、跳躍還是躺著。您可以相應地調整碰撞形狀的大小和方向。新增多個碰撞形狀的額外獎勵點，使頭部和身體有自己的、尺寸更準確的形狀。

source: When a scene first loads, the player may be far away from the center of the tracking space. This could result in the player spawning into a different room than our origin point. The game will now attempt, and fail, to move the player body from the starting point to where the player is standing. You should implement a reset function that moves the origin point so the player is in the correct starting position.
de: Wenn eine Szene zum ersten Mal geladen wird, kann es sein, dass der Spieler weit von der Mitte des Tracking-Raums entfernt ist. Dies könnte dazu führen, dass der Spieler in einem anderen Raum als unserem Ursprung spawnen wird. Das Spiel wird nun versuchen, den Body des Spielers vom Ursprung dorthin zu bewegen, wo der Spieler steht, was jedoch fehlschlägt. Sie sollten eine Rücksetzfunktion implementieren, die den Ursprung so verschiebt, dass sich der Spieler in der richtigen Startposition befindet.
zh_tw: 當場景首次加載時，玩家可能遠離追蹤空間的中心。這可能會導致玩家生成到與我們的原點不同的房間。遊戲現在將嘗試將玩家身體從起點移動到玩家站立的位置，但失敗了。您應該實作一個重設函式來移動原點，以便玩家處於正確的起始位置。

source: Both of the above improvements require the player to be ready and standing up straight. There is no guarantee as the player may still be putting their headset on.
de: Beide oben genannten Verbesserungen setzen voraus, dass der Spieler bereit ist und aufrecht steht. Es gibt keine Garantie, da der Spieler noch dabei sein kann, das Headset aufzusetzen.
zh_tw: 上述兩項改進都要求玩家做好準備並站直。無法保證，因為玩家可能仍然戴著耳機。

source: Many games, including XR Tools, solve this by introducing an intro screen or loading screen where the player must press a button when they are ready. This starting environment is often a large location where the positioning of the player has little impact on what the player sees. When the player is ready, and presses the button, this is the moment you record the position and height of the camera.
de: Viele Spiele, darunter auch XR-Tools, lösen dieses Problem durch die Einführung eines Intro- oder Ladebildschirms, auf dem der Spieler eine Taste drücken muss, wenn er bereit ist. Diese Startumgebung ist oft ein großer Ort, an dem die Position des Spielers wenig Einfluss darauf hat, was der Spieler sieht. Wenn der Spieler bereit ist und die Taste drückt, ist dies der Moment, in dem Sie die Position und Höhe der Kamera aufzeichnen.
zh_tw: 許多遊戲（包括 XR Tools）透過引入介紹畫面或載入畫面來解決此問題，玩家必須在準備好時按下按鈕。此起始環境通常是較大的位置，玩家的位置對玩家所看到的內容幾乎沒有影響。當玩家準備好並按下按鈕時，您就記錄了攝影機的位置和高度。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
