Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_antialiasing.po
Languages: de, zh_cn

source: Roughness limiting on import works by specifying a normal map to use as a guide for limiting roughness. This is done by selecting the roughness map in the FileSystem dock, then going to the Import dock and setting **Roughness > Mode** to the color channel the roughness map is stored in (typically **Green**), then setting the path to the material's normal map. Remember to click **Reimport** at the bottom of the Import dock after setting the path to the normal map.
de: Die Rauheitsbegrenzung beim Import funktioniert durch die Angabe einer Normalen-Karte, die als Richtlinie für die Rauheitsbegrenzung verwendet wird. Dazu wählen Sie die Rauheitskarte im Dateisystem-Dock aus, gehen dann zum Import-Dock und stellen **Rauheit > Modus** auf den Farbkanal ein, in dem die Rauheitskarte gespeichert ist (in der Regel **Grün**), und legen dann den Pfad zur Normal Map des Materials fest. Vergessen Sie nicht, auf **Neuimport** am unteren Ende des Import-Docks zu klicken, nachdem Sie den Pfad auf die Normal Map gesetzt haben.
zh_cn: 通过指定法线贴图来限制导入的粗糙度，以用作限制粗糙度的指导。 这是通过在文件系统面板中选择粗糙度图来完成的，然后转到导入面板并将 **粗糙度>模式** 设置为存储粗糙度图的颜色通道（通常为 **绿色** ），然后设置材质法线贴图的路径。 在设置法线贴图的路径后，请别忘记单击导入面板底部的 **重新导入** 。

source: Since this processing occurs purely on import, it has no performance cost whatsoever. However, its visual impact is limited. Limiting roughness on import only helps reduce specular aliasing within textures, not the aliasing that occurs on geometry edges on detailed meshes.
de: Da diese Verarbeitung ausschließlich beim Import erfolgt, hat sie keinerlei Performance-Kosten. Die visuellen Auswirkungen sind jedoch begrenzt. Die Begrenzung der Rauheit beim Import hilft nur bei der Reduzierung von spiegelndem Aliasing innerhalb von Texturen, nicht aber bei Aliasing, das an Geometriekanten auf detaillierten Meshes auftritt.
zh_cn: 由于此处理仅在导入时进行，因此没有任何性能成本。 但其视觉效果改善有限。 限制导入时的粗糙度仅有助于减少纹理内的镜面反射锯齿，而无助于减少详细网格上的几何边缘上发生的锯齿。

source: Which antialiasing technique should I use?
de: Welche Antialiasing-Methode sollte ich verwenden?
zh_cn: 我应该使用哪种抗锯齿技术？

source: **There is no "one size fits all" antialiasing technique.** Since antialiasing is often demanding on the GPU or can introduce unwanted blurriness, you'll want to add a setting to allow players to disable antialiasing.
de: **Es gibt keine Standard-Methode für das Antialiasing** Da Antialiasing die GPU oft stark beansprucht oder zu unerwünschten Unschärfen führen kann, sollten Sie eine Einstellung hinzufügen, mit der die Spieler das Antialiasing deaktivieren können.
zh_cn: **没有“一招鲜”的抗锯齿技术** 。 由于抗锯齿通常对 GPU 要求很高，或者可能会引入不必要的模糊，因此你需要添加一个设置以允许玩家禁用抗锯齿。

source: For projects with a photorealistic art direction, TAA is generally the most suitable option. While TAA can introduce ghosting artifacts, there is no other technique that combats specular aliasing as well as TAA does. The screen-space roughness limiter helps a little, but is far less effective against specular aliasing overall. If you have spare GPU power, you can use FSR2 at native resolution for a better-looking form of temporal antialiasing compared to standard TAA.
de: Für Projekte mit fotorealistischer Ausrichtung ist TAA in der Regel die am besten geeignete Option. Während TAA Ghosting-Artefakte erzeugen kann, gibt es keine andere Methode, die spiegelndes Aliasing so gut bekämpft wie TAA. Der Screen-Space-Rauheitsbegrenzer hilft ein wenig, ist aber insgesamt weit weniger wirksam gegen spiegelnde Aliasing-Effekte. Wenn Sie über zusätzliche GPU-Leistung verfügen, können Sie FSR2 bei nativer Auflösung verwenden, um eine besser aussehende Form von temporalem Antialiasing im Vergleich zu Standard-TAA zu erzielen.
zh_cn: 对于具有照片级拟真艺术目标的项目，通常来说 TAA 是最合适的选择。虽然 TAA 会引入重影伪像，但没有其他技术能像 TAA 那样对抗镜面反射锯齿。屏幕空间粗糙度限制器也有点用，但总体上对镜面反射锯齿的效果要差得多。如果你的 GPU 性能不错，则可以在原始分辨率下使用 FSR2，以获得比标准 TAA 更好的时间抗锯齿。

source: For projects with a low amount of reflective surfaces (such as a cartoon artstyle), MSAA can work well. MSAA is also a good option if avoiding blurriness and temporal artifacts is important, such as in competitive games.
de: Bei Projekten mit wenig reflektierenden Oberflächen (z. B. bei einem Cartoon-Stil) kann MSAA gut funktionieren. MSAA ist auch eine gute Option, wenn es wichtig ist, Unschärfe und zeitliche Artefakte zu vermeiden, wie z. B. bei kompetitiven Spielen.
zh_cn: 对于反射表面较少的项目（例如卡通艺术风格），MSAA 可以表现很好。如果（对项目而言）避免模糊和时域伪影很重要，例如在竞技游戏中，MSAA 也是一个不错的选择。

source: When targeting low-end platforms such as mobile or integrated graphics, FXAA is usually the only viable option. 2× MSAA may be usable in some circumstances, but higher MSAA levels are unlikely to run smoothly on mobile GPUs.
de: Wenn es um Low-End-Plattformen wie mobile oder integrierte Grafikchips geht, ist FXAA in der Regel die einzige brauchbare Option. 2× MSAA kann unter Umständen brauchbar sein, aber es ist unwahrscheinlich, dass höhere MSAA-Stufen auf mobilen GPUs reibungslos funktionieren.
zh_cn: 在针对移动或集成显卡等低端平台时，FXAA 通常是唯一可行的选择。2× MSAA 在某些情况下可能可用，但更高的 MSAA 级别不太可能在移动 GPU 上流畅运行。

source: Godot allows using multiple antialiasing techniques at the same time. This is usually unnecessary, but it can provide better visuals on high-end GPUs or for :ref:`non-real-time rendering <doc_creating_movies>`. For example, to make moving edges look better when TAA is enabled, you can also enable MSAA at the same time.
de: Godot erlaubt die gleichzeitige Verwendung mehrerer Antialiasing-Methoden. Dies ist in der Regel nicht notwendig, kann aber auf High-End-GPUs oder beim :ref:`Nicht-Echtzeit-Rendering <doc_creating_movies>` für eine bessere Darstellung sorgen. Um zum Beispiel bewegte Kanten besser aussehen zu lassen, wenn TAA aktiviert ist, können Sie gleichzeitig MSAA aktivieren.
zh_cn: Godot 允许同时使用多种抗锯齿技术。这通常是不必要的，但在高端 GPU 上或在 :ref:`非实时渲染 <doc_creating_movies>` 中可以提供更好的视觉效果。例如，为了在启用 TAA 时让移动边缘看起来更好，还可以同时启用 MSAA。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
