Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_antialiasing.po
Languages: de, zh_cn

source: 3D antialiasing
zh_cn: 3D 抗锯齿

source: Godot also supports antialiasing in 2D rendering. This is covered on the :ref:`doc_2d_antialiasing` page.
de: Godot unterstützt auch Antialiasing beim 2D-Rendering. Dies wird auf der Seite :ref:`doc_2d_antialiasing` behandelt.
zh_cn: Godot 还支持在 2D 渲染中的抗锯齿。这部分在 :ref:`doc_2d_antialiasing` 页面中进行了介绍。

source: Introduction
de: Einführung
zh_cn: 前言

source: Due to their limited resolution, scenes rendered in 3D can exhibit aliasing artifacts. These artifacts commonly manifest as a "staircase" effect on surface edges (edge aliasing) and as flickering and/or sparkles on reflective surfaces (specular aliasing).
de: Aufgrund ihrer begrenzten Auflösung können in 3D gerenderte Szenen Aliasing-Artefakte aufweisen. Diese Artefakte äußern sich in der Regel als "Treppeneffekt" an Oberflächenkanten (Kanten-Aliasing) und als Flimmern und/oder Glitzern auf reflektierenden Oberflächen (Spiegel-Aliasing).
zh_cn: 由于分辨率有限，以 3D 渲染的场景可能会出现锯齿伪影。 这些伪影通常表现为表面边缘上的“阶梯（staircase）”效应（边缘锯齿）以及反射表面上的闪烁和/或闪烁（镜面锯齿）。

source: In the example below, you can notice how edges have a blocky appearance. The vegetation is also flickering in and out, and thin lines on top of the box have almost disappeared:
de: Im folgenden Beispiel können Sie sehen, wie die Kanten blockartig aussehen. Auch die Vegetation flackert auf und ab, und die dünnen Linien oben auf der Box sind fast verschwunden:
zh_cn: 在下面的示例中，你可以注意到边缘如何具有块状外观。 植被也在闪烁，盒子顶部的细线几乎消失了：

source: Image is scaled by 2× with nearest-neighbor filtering to make aliasing more noticeable.
de: Das Bild wurde um das zweifache skaliert und mit einem Nearest-Neighbor-Filter versehen, um Aliasing deutlicher zu machen.
zh_cn: 图像缩放 2 倍并进行近邻滤波，使混叠现象更加明显。

source: To combat this, various antialiasing techniques can be used in Godot. These are detailed below.
de: Um dem entgegenzuwirken, können in Godot verschiedene Antialiasing-Techniken eingesetzt werden. Diese werden im Folgenden beschrieben.
zh_cn: 为了解决这个问题，Godot 中可以使用多种抗锯齿技术。 下面详细介绍这些内容。

source: You can compare antialiasing algorithms in action using the `3D Antialiasing demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/antialiasing>`__.
de: Sie können Antialiasing-Algorithmen in Aktion vergleichen, indem Sie das `3D Antialiasing-Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/antialiasing>`__ verwenden.
zh_cn: 你可以使用 `3D 抗锯齿演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/antialiasing>`__ 比较实际的抗锯齿算法。

source: Multisample antialiasing (MSAA)
zh_cn: 多重采样抗锯齿（MSAA）

source: This technique is the "historical" way of dealing with aliasing. MSAA is very effective on geometry edges (especially at higher levels). MSAA does not introduce any blurriness whatsoever.
de: Diese Methode ist die "historische" Art, mit Aliasing umzugehen. MSAA ist sehr effektiv bei Geometriekanten (insbesondere bei höheren Stufen). MSAA führt zu keinerlei Unschärfe.
zh_cn: 这种技术是处理别名效应的“历史”方法。多重采样抗锯齿（MSAA）在几何边缘上非常有效（尤其是在较高级别上）。MSAA不会引入任何模糊。

source: MSAA is available in 3 levels: 2×, 4×, 8×. Higher levels are more effective at antialiasing edges, but are significantly more demanding. In games with modern visuals, sticking to 2× or 4× MSAA is highly recommended as 8× MSAA is usually too demanding.
de: MSAA ist in 3 Stufen verfügbar: 2×, 4×, 8×. Höhere Stufen sind effektiver bei der Kantenglättung, sind aber auch deutlich anspruchsvoller. Bei Spielen mit moderner Grafik ist es sehr empfehlenswert, bei 2× oder 4× MSAA zu bleiben, da 8× MSAA in der Regel zu anspruchsvoll ist.
zh_cn: MSAA有三个级别可供选择：2×、4×、8×。较高级别在抗锯齿边缘方面更有效，但要求更高。在具有现代视觉效果的游戏中，强烈建议使用2×或4×的MSAA，因为8×的MSAA通常要求过高。

source: The downside of MSAA is that it only operates on edges. This is because MSAA increases the number of *coverage* samples, but not the number of *color* samples. However, since the number of color samples did not increase, fragment shaders are still run for each pixel only once. Therefore, MSAA does not reduce transparency aliasing for materials using the **Alpha Scissor** transparency mode (1-bit transparency). MSAA is also ineffective on specular aliasing.
de: Der Nachteil von MSAA ist, dass es nur auf Kanten wirkt. Das liegt daran, dass MSAA die Anzahl der *Deckungs*-Samples erhöht, aber nicht die Anzahl der *Farb*-Samples. Da sich jedoch die Anzahl der Farb-Samples nicht erhöht hat, werden Fragment-Shader weiterhin für jedes Pixel nur einmal ausgeführt. Daher reduziert MSAA das Transparenz-Aliasing bei Materialien, die den Transparenzmodus **Alpha-Schere** (1-Bit-Transparenz) verwenden, nicht. MSAA ist auch unwirksam bei spiegelndem Aliasing.
zh_cn: MSAA 的缺点是它仅在边缘上运行。 这是因为 MSAA 增加了 *覆盖率* 样本的数量，但没有增加 *颜色* 样本的数量。 然而，由于颜色样本的数量没有增加，片段着色器仍然只为每个像素运行一次。 因此，MSAA 不会减少使用 **Alpha Scissor** 透明度模式（1 位透明度）的材质的透明度锯齿。 此外，MSAA 对镜面反射锯齿也无效。

source: To mitigate aliasing on alpha scissor materials, :ref:`alpha antialiasing <doc_standard_material_3d_alpha_antialiasing>` (also called *alpha to coverage*) can be enabled on specific materials in the StandardMaterial3D or ORMMaterial3D properties. Alpha to coverage has a moderate performance cost, but it's effective at reducing aliasing on transparent materials without introducing any blurriness.
de: Um Aliasing bei Alpha-Schere-Materialien abzuschwächen, kann :ref:`alpha antialiasing <doc_standard_material_3d_alpha_antialiasing>` (auch *Alpha-to-Coverage* genannt) für bestimmte Materialien in den StandardMaterial3D- oder ORMMaterial3D-Propertys aktiviert werden. Alpha-to-Coverage hat einen moderaten Performance-Aufwand, aber es ist effektiv bei der Reduzierung von Aliasing auf transparenten Materialien, ohne Unschärfe einzuführen.
zh_cn: 为了减轻 Alpha 裁剪材质上的锯齿，可以在 StandardMaterial3D 或 ORMMaterial3D 属性中的特定材质上启用 :ref:`Alpha 抗锯齿 <doc_standard_material_3d_alpha_antialiasing>`\ （也称为 *Alpha 覆盖范围*\ ）。Alpha 覆盖范围具有适中的性能成本，但它可以有效减少透明材质上的锯齿，而且不会引入任何模糊。

source: MSAA can be enabled in the Project Settings by changing the value of the **Rendering > Anti Aliasing > Quality > MSAA 3D** setting. It's important to change the value of the **MSAA 3D** setting and not **MSAA 2D**, as these are entirely separate settings.
de: MSAA kann in den Projekteinstellungen aktiviert werden, indem der Wert der Einstellung **Rendern > Antialiasing > Qualität > MSAA 3D** geändert wird. Es ist wichtig, den Wert der Einstellung **MSAA 3D** und nicht **MSAA 2D** zu ändern, da es sich um völlig separate Einstellungen handelt.
zh_cn: 通过更改 **渲染 > 抗锯齿 > 质量 > MSAA 3D** 设置的值，可以在项目设置中启用 MSAA。 更改 **MSAA 3D** 设置的值而不是 **MSAA 2D** 非常重要，因为这些是完全独立的设置。

source: Comparison between no antialiasing (left) and various MSAA levels (right). Note that alpha antialiasing is not used here:
de: Vergleich zwischen keinem Antialiasing (links) und verschiedenen MSAA-Stufen (rechts). Beachten Sie, dass Alpha-Antialiasing hier nicht verwendet wird:
zh_cn: 无抗锯齿（左）与不同 MSAA 级别（右）之间的比较。 请注意，此处未使用 alpha 抗锯齿：

source: Temporal antialiasing (TAA)
de: Temporales Antialiasing (TAA)
zh_cn: 时间抗锯齿（TAA）

source: *This is only available in the Clustered Forward backend, not the Forward Mobile or Compatibility backends.*
de: *Dies ist nur im Clustered Forward Backend verfügbar, nicht im Forward Mobile oder Kompatibilität-Backend.*
zh_cn: *该功能仅适用于集群 Forward 后端，不适用于 Forward 移动或兼容性后端。*

source: Temporal antialiasing works by *converging* the result of previously rendered frames into a single, high-quality frame. This is a continuous process that works by jittering the position of all vertices in the scene every frame. This jittering is done to capture sub-pixel detail and should be unnoticeable except in extreme situations.
de: Temporales Antialiasing funktioniert durch *Konvertierung* des Ergebnisses zuvor gerenderter Frames zu einem einzigen, hochwertigen Frame. Dabei handelt es sich um einen kontinuierlichen Prozess, bei dem die Position aller Eckpunkte in der Szene in jedem Frame gejittert wird. Dieses Jittering wird durchgeführt, um Subpixel-Details zu erfassen, und sollte außer in extremen Situationen nicht zu bemerken sein.
zh_cn: 时间抗锯齿（Temporal antialiasing）的工作原理是将先前渲染帧的结果 *聚合* 成单个高质量帧。 这是一个连续的过程，通过在每帧抖动场景中所有顶点的位置来工作。 这种抖动是为了捕捉子像素细节，除非在极端情况下，否则（抖动）应该是不明显的。

source: This technique is commonly used in modern games, as it provides the most effective form of antialiasing against specular aliasing and other shader-induced artifacts. TAA also provides full support for transparency antialiasing.
de: Diese Methode wird häufig in modernen Spielen verwendet, da sie die effektivste Form des Antialiasing gegen Specular Aliasing und andere Shader-induzierte Artefakte bietet. TAA bietet auch volle Unterstützung für Transparenz-Antialiasing.
zh_cn: 此技术在现代游戏中常用，因为它提供了针对镜面反射锯齿和其他着色器引起的伪影的最有效的抗锯齿方式。 此外，TAA 还全面支持透明度抗锯齿。

source: TAA introduces a small amount of blur when enabled in still scenes, but this blurring effect becomes more pronounced when the camera is moving. Another downside of TAA is that it can exhibit *ghosting* artifacts behind moving objects. Rendering at a higher framerate will allow TAA to converge faster, therefore making those ghosting artifacts less visible.
de: TAA führt zu einer leichten Unschärfe, wenn es in unbewegten Szenen aktiviert ist, aber dieser Unschärfeeffekt wird deutlicher, wenn sich die Kamera bewegt. Ein weiterer Nachteil von TAA ist, dass es zu *Ghosting*-Artefakten hinter sich bewegenden Objekten kommen kann. Wenn Sie mit einer höheren Framerate rendern, kann TAA schneller konvergieren, so dass diese Ghosting-Artefakte weniger sichtbar sind.
zh_cn: 在静止场景中启用 TAA 会产生少量模糊，而当相机移动时，这种模糊效果会变得更加明显。 TAA 的另一个缺点是它可能会在移动物体后面呈现 *重影（ghosting）* 伪影。 以更高的帧速率进行渲染将使 TAA 收敛得更快，从而使这些重影伪像变得不那么明显。

source: Temporal antialiasing can be enabled in the Project Settings by changing the value of the **Rendering > Anti Aliasing > Quality > Use TAA** setting.
de: Temporales Antialiasing kann in den Projekteinstellungen aktiviert werden, indem der Wert der Einstellung **Rendern > Antialiasing > Qualität > TAA verwenden** geändert wird.
zh_cn: 通过在项目设置中更改 **渲染 > 抗锯齿 > 质量 > 使用 TAA** 的配置，可以启用时间抗锯齿功能。

source: Comparison between no antialiasing (left) and TAA (right):
de: Vergleich zwischen keinem Antialiasing (links) und TAA (rechts):
zh_cn: 无抗锯齿（左）和 TAA（右）之间的比较：

source: Since Godot 4.2, there is built-in support for `AMD FidelityFX Super Resolution <https://www.amd.com/en/technologies/fidelityfx-super-resolution>`__ 2.2. This is an :ref:`upscaling method <doc_resolution_scaling>` compatible with all recent GPUs from any vendor. FSR2 is normally designed to improve performance by lowering the internal 3D rendering resolution, then upscaling to the output resolution.
de: Seit Godot 4.2 gibt es Built-in-Unterstützung für `AMD FidelityFX Super Resolution <https://www.amd.com/en/technologies/fidelityfx-super-resolution>`__ 2.2. Dabei handelt es sich um eine :ref:`Upscaling-Methode <doc_resolution_scaling>`, die mit allen aktuellen GPUs aller Hersteller kompatibel ist. FSR2 ist normalerweise darauf ausgelegt, die Performance zu verbessern, indem die interne 3D-Rendering-Auflösung herabgesetzt und dann auf die Ausgabeauflösung hochskaliert wird.
zh_cn: 自 Godot 4.2 起，内置了对 `AMD FidelityFX Super Resolution <https://www.amd.com/zh-hans/technologies/fidelityfx-super-resolution>`__ 2.2 的支持。这是一种与任何供应商的所有最新 GPU 兼容的 :ref:`放大方法 <doc_resolution_scaling>`。 FSR2 旨在通过降低内部的 3D 渲染分辨率，然后放大到输出分辨率来提高性能。

source: However, unlike FSR1, FSR2 also provides temporal antialiasing. This means FSR2 can be used at native resolution for high-quality antialiasing, with the input resolution being equal to the output resolution. In this situation, enabling FSR2 will actually *decrease* performance, but it will significantly improve rendering quality.
de: Im Gegensatz zu FSR1 bietet FSR2 jedoch auch temporales Antialiasing. Das bedeutet, dass FSR2 bei nativer Auflösung für hochwertiges Antialiasing verwendet werden kann, wobei die Eingabeauflösung gleich der Ausgabeauflösung ist. In diesem Fall führt die Aktivierung von FSR2 zwar zu einer *verringerten* Performance, aber zu einer deutlichen Verbesserung der Rendering-Qualität.
zh_cn: 然而，与 FSR1 不同的是，FSR2 有时间抗锯齿功能。这意味着 FSR2 可以在原始分辨率下使用，以获得高质量的抗锯齿效果，并且输入分辨率等于输出分辨率。在这种情况下，启用 FSR2 实际上会 *降低* 性能，但会显着提高渲染质量。

source: Using FSR2 at native resolution is more demanding than using TAA at native resolution, so its use is only recommended if you have significant GPU headroom. On the bright side, FSR2 provides better antialiasing coverage with less blurriness compared to TAA, especially in motion.
de: Die Verwendung von FSR2 bei nativer Auflösung ist anspruchsvoller als die Verwendung von TAA bei nativer Auflösung, so dass seine Verwendung nur dann empfohlen wird, wenn Sie über erheblichen Spielraum bei der GPU verfügen. Positiv zu vermerken ist, dass FSR2 im Vergleich zu TAA eine bessere Antialiasing-Abdeckung mit weniger Unschärfe bietet, insbesondere bei Bewegungen.
zh_cn: 在原始分辨率下使用 FSR2 比在原始分辨率下使用 TAA 要求更高，因此，仅在你有足够大的 GPU 显存空间时才建议使用它。从好的方面来说，与 TAA 相比，FSR2 提供了更好的抗锯齿覆盖范围和更少的模糊度，尤其是在运动画面中。

source: Comparison between no antialiasing (left) and FSR2 at native resolution (right):
de: Vergleich zwischen keinem Antialiasing (links) und FSR2 bei nativer Auflösung (rechts):
zh_cn: 无抗锯齿（左）和原始分辨率下的 FSR2（右）之间的比较：

source: By default, the **FSR Sharpness** project setting is set to ``0.2`` (higher values result in less sharpening). For the purposes of comparison, FSR sharpening has been disabled by setting it to ``2.0`` on the above screenshot.
de: Standardmäßig ist die **FSR-Schärfe** des Projekts auf ``0,2`` eingestellt (höhere Werte bewirken eine geringere Schärfung). Zu Vergleichszwecken wurde die FSR-Schärfe auf dem obigen Screenshot auf ``2.0`` gesetzt und damit deaktiviert.
zh_cn: 默认情况下， **FSR 锐度** 项目设置设置为 ``0.2`` （值越高，锐化程度越低）。为了进行比较，在以上的屏幕截图中，FSR 锐度被设置为 ``2.0`` ，从而禁用了 FSR 锐化。

source: Fast approximate antialiasing (FXAA)
zh_cn: 快速近似抗锯齿（FXAA）

source: *This is only available in the Clustered Forward and Forward Mobile backends, not the Compatibility backend.*
de: *Dies ist nur in den Backends Clustered Forward und Forward Mobile verfügbar, nicht im Kompatibilität-Backend.*
zh_cn: *该功能仅适用于集群 Forward 和 Forward 移动后端，不适用于兼容性后端。*

source: Fast approximate antialiasing is a post-processing antialiasing solution. It is faster to run than any other antialiasing technique and also supports antialiasing transparency. However, since it lacks temporal information, it will not do much against specular aliasing.
de: Fast Approximate Antialiasing (Schnelles Angenährtes Antialiasing) ist eine Post-Processing-Antialiasing-Lösung. Sie ist schneller als jede andere Antialiasing-Technik und unterstützt auch Antialiasing-Transparenz. Da es jedoch keine zeitlichen Informationen enthält, kann es nicht viel gegen spiegelndes Aliasing ausrichten.
zh_cn: 快速近似抗锯齿是一种后期处理抗锯齿解决方案。 它的运行速度比任何其他抗锯齿技术都要快，并且还支持抗锯齿透明度。 然而，由于它缺乏时间信息，因此它对于防止镜面反射锯齿没有多大作用。

source: This technique is still sometimes used in mobile games. However, on desktop platforms, FXAA generally fell out of fashion in favor of temporal antialiasing, which is much more effective against specular aliasing. Nonetheless, exposing FXAA as an in-game option may still be worthwhile for players with low-end GPUs.
de: Diese Methode wird manchmal noch in mobilen Spielen verwendet. Auf Desktop-Plattformen ist FXAA jedoch im Allgemeinen zugunsten von temporalem Antialiasing aus der Mode gekommen, das viel effektiver gegen spiegelndes Aliasing ist. Nichtsdestotrotz kann es sich für Spieler mit leistungsschwachen GPUs lohnen, FXAA als Option im Spiel zu nutzen.
zh_cn: 这种技术有时仍会在手机游戏中使用。 然而，在桌面平台上，FXAA 通常已经是过时的，取而代之的是时间抗锯齿，后者对于对抗镜面反射锯齿更为有效。 尽管如此，对于只有低端 GPU 的玩家来说，将 FXAA 作为游戏内选项可能仍然是值得的。

source: FXAA introduces a moderate amount of blur when enabled (more than TAA when still, but less than TAA when the camera is moving).
de: FXAA führt zu einer moderaten Unschärfe, wenn es aktiviert ist (mehr als TAA, wenn die Kamera still steht, aber weniger als TAA, wenn die Kamera sich bewegt).
zh_cn: FXAA 启用后会产生适度的模糊（静止时比 TAA 多，但相机移动时比 TAA 少）。

source: FXAA can be enabled in the Project Settings by changing the value of the **Rendering > Anti Aliasing > Quality > Screen Space AA** setting to **FXAA**.
de: FXAA kann in den Projekteinstellungen aktiviert werden, indem der Wert der Einstellung **Rendern > Antialiasing > Qualität > Screen-Space AA** auf **FXAA** geändert wird.
zh_cn: 可以在项目设置中启用 FXAA，方法是将 **渲染 > 抗锯齿 > 质量 > 屏幕空间 AA** 设置的值更改为 **FXAA** 。

source: Comparison between no antialiasing (left) and FXAA (right):
de: Vergleich zwischen keinem Antialiasing (links) und FXAA (rechts):
zh_cn: 无抗锯齿（左）和 FXAA（右）之间的对比：

source: Supersample antialiasing (SSAA)
zh_cn: 超采样抗锯齿（SSAA）

source: Supersampling provides the highest quality of antialiasing possible, but it's also the most expensive. It works by shading every pixel in the scene multiple times. This allows SSAA to antialias edges, transparency *and* specular aliasing at the same time, without introducing potential ghosting artifacts.
de: Supersampling bietet die höchstmögliche Qualität des Antialiasing, ist aber auch die teuerste. Es funktioniert, indem jedes Pixel in der Szene mehrfach ein Shading erhält. Dadurch kann SSAA Kanten, Transparenz *und* spiegelndes Aliasing gleichzeitig glätten, ohne potenzielle Ghosting-Artefakte einzuführen.
zh_cn: 超采样可以提供最高质量的抗锯齿效果，但它也是成本最贵的。 它的工作原理是多次对场景中的每个像素进行着色。 这允许 SSAA 同时抗锯齿边缘、透明度 *和* 镜面反射锯齿，而不会引入潜在的重影伪影。

source: The downside of SSAA is its *extremely* high cost. This cost generally makes SSAA difficult to use for game purposes, but you may still find supersampling useful for :ref:`offline rendering <doc_creating_movies>`.
de: Der Nachteil von SSAA sind seine *extrem* hohen Kosten. Diese Kosten machen es im Allgemeinen schwierig, SSAA für Spiele zu verwenden, aber Sie können Supersampling immer noch nützlich finden für :ref:`Offline-Rendering <doc_creating_movies>`.
zh_cn: SSAA 的缺点是其 *极高* 的成本。 这种成本通常会使 SSAA 难以用于游戏目的，但你可能仍会发现超采样对于 :ref:`离线渲染 <doc_creating_movies>` 很有用。

source: Supersample antialiasing is performed by increasing the **Rendering > Scaling 3D > Scale** advanced project setting above ``1.0`` while ensuring **Rendering > Scaling 3D > Mode** is set to **Bilinear** (the default). Since the scale factor is defined per-axis, a scale factor of ``1.5`` will result in 2.25× SSAA while a scale factor of ``2.0`` will result in 4× SSAA. Since Godot uses the hardware's own bilinear filtering to perform the downsampling, the result will look crisper at integer scale factors (namely, ``2.0``).
de: Supersample-Antialiasing wird durchgeführt, indem die erweiterte Projekteinstellung **Rendern > Skalierung 3D > Skalierung** über ``1.0`` erhöht wird, während sichergestellt wird, dass **Rendern > Skalierung 3D > Modus** auf **Bilinear** (der Default) gesetzt ist. Da der Skalierungsfaktor pro Achse definiert ist, wird ein Skalierungsfaktor von ``1.5`` zu 2.25× SSAA führen, während ein Skalierungsfaktor von ``2.0`` zu 4× SSAA führen wird. Da Godot die hardwareeigene bilineare Filterung verwendet, um das Downsampling durchzuführen, sieht das Ergebnis bei ganzzahligen Skalierungsfaktoren (nämlich ``2,0``) schärfer aus.
zh_cn: 超采样抗锯齿是通过将高级项目设置中 **渲染 > 缩放 3D > 缩放** 的设置增加到 ``1.0`` 以上来执行的，同时确保 **渲染 > 缩放 3D > 模式** 设置为 **Bilinear** （默认） 。 由于比例因子是按轴定义的，比例因子 ``1.5`` 将导致 2.25× SSAA，而比例因子 ``2.0`` 将导致 4× SSAA。由于 Godot 使用硬件自身的双线性过滤来执行降采样，因此结果在整数的比例因子（即 ``2.0`` ）下看起来会更清晰。

source: Comparison between no antialiasing (left) and various SSAA levels (right):
de: Vergleich zwischen keinem Antialiasing (links) und verschiedenen SSAA-Stufen (rechts):
zh_cn: 无抗锯齿（左）与不同 SSAA 级别（右）之间的比较：

source: Supersampling also has high video RAM requirements, since it needs to render in the target resolution then *downscale* to the window size. For example, displaying a project in 3840×2160 (4K resolution) with 4× SSAA will require rendering the scene in 7680×4320 (8K resolution), which is 4 times more pixels.
de: Supersampling hat auch hohe Video-RAM-Anforderungen, da es in der Zielauflösung gerendert und dann auf die Fenstergröße *herunterskaliert* werden muss. Wenn beispielsweise ein Projekt in 3840×2160 (4K-Auflösung) mit 4× SSAA angezeigt wird, muss die Szene in 7680×4320 (8K-Auflösung) gerendert werden, also mit viermal mehr Pixeln.
zh_cn: 超采样还有很高的视频 RAM （即显存）要求，因为它需要以目标分辨率渲染，然后 *缩小* 到窗口大小。 例如，使用 4× SSAA 显示 3840×2160（4K 分辨率）的项目需要以 7680×4320（8K 分辨率）渲染场景，这是原像素数的 4 倍。

source: If you are using a high window size such as 4K, you may find that increasing the resolution scale past a certain value will cause a heavy slowdown (or even a crash) due to running out of VRAM.
de: Wenn Sie eine hohe Fenstergröße wie etwa 4K verwenden, werden Sie feststellen, dass die Erhöhung der Auflösungsskala über einen bestimmten Wert hinaus zu einer starken Verlangsamung (oder sogar zu einem Absturz) führt, weil der VRAM nicht mehr ausreicht.
zh_cn: 如果你使用较大的窗口大小（例如 4K），你可能会发现将分辨率比例增加到超过特定值时，会因 VRAM 耗尽而导致严重减速（甚至崩溃）。

source: Screen-space roughness limiter
de: Screen-Space-Rauheitsbegrenzer
zh_cn: 屏幕空间粗糙度限制器

source: This is not an edge antialiasing method, but it is a way of reducing specular aliasing in 3D.
de: Dabei handelt es sich nicht um eine Kanten-Antialiasing-Methode, sondern um eine Methode zur Verringerung von spiegelnden Aliasing-Effekten in 3D.
zh_cn: 这并不是一种边缘抗锯齿方法，而是减少 3D 镜面反射锯齿的一种方法。

source: The screen-space roughness limiter works best on detailed geometry. While it has an effect on roughness map rendering itself, its impact is limited there.
de: Der Screen-Space-Rauheitsbegrenzer funktioniert am besten bei detaillierter Geometrie. Er wirkt sich zwar auf das Rendering der Rauheitskarte selbst aus, ist dort aber nur begrenzt wirksam.
zh_cn: 屏幕空间粗糙度限制器最适合详细的几何形状。 虽然它对粗糙度图渲染本身有影响，但其影响有限。

source: The screen-space roughness limiter is enabled by default; it doesn't require any manual setup. It has a small performance impact, so consider disabling it if your project isn't affected by specular aliasing much.
de: Der Screen-Space-Rauheitsbegrenzer für den ist standardmäßig aktiviert; er erfordert keine manuelle Einstellung. Er hat eine geringe Auswirkung auf die Performance, daher sollten Sie ihn deaktivieren, wenn Ihr Projekt nicht stark von spiegelnden Aliasing betroffen ist.
zh_cn: 屏幕空间粗糙度限制器默认启用； 它不需要任何手动设置。 它对性能影响很小，因此如果你的项目不受镜面反射锯齿影响太多，请考虑禁用它。

source: Texture roughness limiter on import
de: Texturrauheitsbegrenzer beim Import
zh_cn: 导入时的纹理粗糙度限制器

source: Like the screen-space roughness limiter, this is not an edge antialiasing method, but it is a way of reducing specular aliasing in 3D.
de: Wie der Screen-Space-Rauheitsbegrenzer für den ist dies keine Kanten-Antialiasing-Methode, aber es ist eine Möglichkeit, spiegelnde Aliasing-Effekte in 3D zu reduzieren.
zh_cn: 与屏幕空间粗糙度限制器一样，这也不是一种边缘抗锯齿方法，而是减少 3D 镜面反射锯齿的一种方法。
