Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_rendering_limitations.po
Languages: de, zh_tw

source: 3D rendering limitations
de: 3D-Render-Beschränkungen
zh_tw: 3D 算繪的局限性

source: Introduction
de: Einführung
zh_tw: 前言

source: Due to their focus on performance, real-time rendering engines have many limitations. Godot's renderer is no exception. To work effectively with those limitations, you need to understand them.
de: Echtzeit-Rendering-Engines haben aufgrund ihrer Ausrichtung auf Performance viele Einschränkungen. Der Renderer von Godot ist da keine Ausnahme. Um mit diesen Einschränkungen effektiv arbeiten zu können, müssen Sie diese verstehen.
zh_tw: 出於對性能的要求, 即時算繪引擎有很多局限性.Godot的算繪器也不例外. 為了更有效地工作, 你需要瞭解這些局限性.

source: Texture size limits
de: Beschränkung der Texturgröße
zh_tw: 紋理尺寸限制

source: On desktops and laptops, textures larger than 8192×8192 may not be supported on older devices. You can check your target GPU's limitations on `GPUinfo.org <https://www.gpuinfo.org/>`__.
de: Auf Desktops und Laptops älterer Generation werden Texturen größer als 8192 × 8192 möglicherweise nicht unterstützt. Sie können die Einschränkungen Ihrer Ziel-GPU auf `GPUinfo.org <https://www.gpuinfo.org/>`__ überprüfen.
zh_tw: 在桌上型電腦和筆記型電腦上，舊裝置可能不支援大於 8192×8192 的紋理。你可以在 `GPUinfo.org <https://www.gpuinfo.org/>`__ 上檢查你的目標 GPU 的限制。

source: Mobile GPUs are typically limited to 4096×4096 textures. Also, some mobile GPUs don't support repeating non-power-of-two-sized textures. Therefore, if you want your texture to display correctly on all platforms, you should avoid using textures larger than 4096×4096 and use a power of two size if the texture needs to repeat.
de: Mobile GPUs sind normalerweise auf 4096x4096 Texturen limitiert. Nicht jede mobile GPU unterstützt Tiled-Texturen, deren Größe keine Zweierpotenz aufweist. Deshalb sollte für eine korrekte Darstellung auf allen Plattformen diese Regel beachtet sowie die Nutzung von Texturen vermieden werden, die größer sind als 4096x4096.
zh_tw: 移動端GPU通常僅支援小於4096×4096的紋理. 此外, 一些移動端GPU不支援對非二的冪次大小的紋理進行重複(repeat)操作. 因此, 如果你想讓你的紋理在所有平臺上正確顯示, 你應該避免使用比4096×4096大的紋理, 如果紋理需要重複, 應該使用兩倍的大小.

source: To limit the size of a specific texture that may be too large to render, you can set the **Process > Size Limit** import option to a value greater than ``0``. This will reduce the texture's dimensions on import (preserving aspect ratio) without affecting the source file.
de: Um die Größe einer bestimmten Textur zu begrenzen, die möglicherweise zu groß zum Rendern ist, können Sie die Importoption **Prozess > Größenbegrenzung** auf einen Wert größer als ``0`` setzen. Dadurch werden die Abmessungen der Textur beim Import reduziert (unter Beibehaltung des Seitenverhältnisses), ohne die Quelldatei zu verändern.
zh_tw: 若要限制可能太大而無法算繪的特定紋理的大小，您可以將 **Process > Size Limit** 匯入選項設定為大於「0」的值。這將減少匯入時紋理的尺寸（保留縱橫比），而不影響原始檔。

source: Color banding
zh_tw: 帶狀顏色

source: When using the Forward+ or Forward Mobile rendering methods, Godot's 3D engine renders internally in HDR. However, the rendering output will be tonemapped to a low dynamic range so it can be displayed on the screen. This can result in visible banding, especially when using untextured materials. For performance reasons, color precision is also lower when using the Forward Mobile rendering method compared to Forward+.
de: Bei Verwendung der Render-Methoden Forward+ oder Forward Mobile rendert die 3D-Engine von Godot intern in HDR. Die Render-Ausgabe wird jedoch auf einen niedrigen Dynamikbereich gemappt, damit sie auf dem Bildschirm angezeigt werden kann. Dies kann zu sichtbarem Banding führen, insbesondere bei der Verwendung von unstrukturierten Materialien. Aus Performancegründen ist die Farbgenauigkeit bei der Forward Mobile-Rendering-Methode im Vergleich zu Forward+ ebenfalls geringer.
zh_tw: 當使用GLES3或Vulkan算繪器時,Godot的3D引擎內部以高動態範圍(HDR)進行算繪. 然而, 算繪輸出將被色調對應(tonemmapped)到一個低動態範圍, 以便它可以顯示在螢幕上. 這可能導致可見的條帶效應(banding), 特別是當使用未貼圖的材質時. 在使用了具有平滑梯度的紋理的2D專案中也能看到這種效應.

source: When using the Compatibility rendering method, HDR is not used and the color precision is the lowest of all rendering methods. This also applies to 2D rendering, where banding may be visible when using smooth gradient textures.
de: Bei der Render-Methode "Kompatibilität" wird HDR nicht verwendet und die Farbgenauigkeit ist die niedrigste aller Render-Methoden. Dies gilt auch für das 2D-Rendering, bei dem bei der Verwendung von Texturen mit glatten Gradienten Banding sichtbar sein kann.
zh_tw: 使用相容性算繪方法時，不使用 HDR，顏色精確度是所有算繪方法中最低的。這也適用於 2D 算繪，其中使用平滑漸層紋理時可能會看到條帶。

source: There are two main ways to alleviate banding:
de: Es gibt im Wesentlichen zwei Möglichkeiten, Banding zu mindern:
zh_tw: Godot 沒有使用限制

source: If using the Forward+ or Forward Mobile rendering methods, enable **Use Debanding** in the advanced Project Settings. This applies a fullscreen debanding shader as a post-processing effect and is very cheap.
de: Wenn Sie die Render-Methoden Forward+ oder Forward Mobile verwenden, aktivieren Sie **Debanding verwenden** in den erweiterten Projekteinstellungen. Dies wendet einen Fullscreen-Debanding-Shader als Post-Processing-Effekt an und ist sehr kostengünstig.
zh_tw: 如果使用 Forward+ 或 Forward Mobile 算繪方法，請在進階專案設定中啟用 **Use Debanding**。這應用了全螢幕去帶著色器作為後處理效果，並且非常便宜。

source: Alternatively, bake some noise into your textures. This is mainly effective in 2D, e.g. for vignetting effects. In 3D, you can also use a `custom debanding shader <https://github.com/fractilegames/godot-gles2-debanding-material>`__ to be applied on your *materials*. This technique works even if your project is rendered with low color precision, which means it will work when using the Mobile and Compatibility rendering methods.
de: Alternativ können Sie auch etwas Rauschen in Ihre Texturen einbauen. Dies ist vor allem in 2D effektiv, z.B. für Vignettierungseffekte. In 3D können Sie auch einen `Custom Debanding Shader <https://github.com/fractilegames/godot-gles2-debanding-material>`__" verwenden, der auf Ihre *Materialien* angewendet wird. Diese Technik funktioniert auch, wenn Ihr Projekt mit geringer Farbpräzision gerendert wird, d. h. sie funktioniert auch, wenn Sie die Rendering-Methoden Mobile und Kompatibilität verwenden.
zh_tw: 或者，在你的紋理中烘焙一些雜訊。這主要在2D中是有效的，例如用於虛化效果。在3D中，你也可以使用一個 `自訂去噪著色器 <https://github.com/fractilegames/godot-gles2-debanding-material>`__ 來應用於你的 *材質* 。即使你的專案是用LDR算繪的，這種技術也是有效的，這意味著它在使用GLES2算繪器時也能發揮作用。

source: Color banding comparison (contrast increased for more visibility)
de: Vergleich von Color-Banding (erhöhter Kontrast für bessere Sichtbarkeit)
zh_tw: 色帶比較（增加對比度以提高可視性）

source: See `Banding in Games: A Noisy Rant (PDF) <https://loopit.dk/banding_in_games.pdf>`__ for more details about banding and ways to combat it.
de: Siehe `Banding in Games: A Noisy Rant (PDF) <https://loopit.dk/banding_in_games.pdf>`__ für weitere Details über Banding und Möglichkeiten, es zu bekämpfen.
zh_tw: 參見 `Banding in Games: A Noisy Rant <http://loopit.dk/banding_in_games.pdf>`__ 獲取更多有關條帶效應的細節和解決方案.

source: Depth buffer precision
de: Tiefenpuffer-Präzision
zh_tw: 深度緩衝精度

source: To sort objects in 3D space, rendering engines rely on a *depth buffer* (also called *Z-buffer*). This buffer has a finite precision: 24-bit on desktop platforms, sometimes 16-bit on mobile platforms (for performance reasons). If two different objects end up on the same buffer value, then Z-fighting will occur. This will materialize as textures flickering back and forth as the camera moves or rotates.
de: Um Objekte im 3D-Raum zu sortieren, stützen sich Rendering-Engines auf einen *Tiefenpuffer* (auch *Z-Puffer* genannt). Dieser Puffer hat eine endliche Genauigkeit: 24 Bit auf Desktop-Plattformen, manchmal 16 Bit auf mobilen Plattformen (aus Leistungsgründen). Wenn zwei verschiedene Objekte auf demselben Pufferwert landen, kommt es zu Z-Konflikten. Dies äußert sich in Form von hin- und herflackernden Texturen, wenn sich die Kamera bewegt oder dreht.
zh_tw: 為了在 3D 空間中排序物件，算繪引擎使用了*深度緩衝區*（也稱為 *Z 緩衝區*）。這個緩衝區具有有限的精度：在桌面平臺上是 24 位，在移動平臺上有時是 16 位元（出於性能原因）。如果兩個不同的物件最終具有相同的緩衝值，那麼就會發生 Z 衝突（Z-fighting），此時移動或旋轉相機，將觀察到紋理來回閃爍。

source: To make the depth buffer more precise over the rendered area, you should *increase* the Camera node's **Near** property. However, be careful: if you set it too high, players will be able to see through nearby geometry. You should also *decrease* the Camera node's **Far** property to the lowest permissible value for your use case, though keep in mind it won't impact precision as much as the **Near** property.
de: Um den Tiefenpuffer über den gerenderten Bereich präziser zu machen, sollten Sie die Property **Near** des Kamera-Nodes *erhöhen*. Seien Sie jedoch vorsichtig: Wenn Sie den Wert zu hoch einstellen, können die Spieler durch die nahe gelegene Geometrie hindurchsehen. Sie sollten auch die Property **Far** des Kamera-Nodes auf den niedrigsten zulässigen Wert für Ihren Anwendungsfall *verringern*, aber bedenken Sie, dass dies die Präzision nicht so stark beeinflusst wie die Eigenschaft **Near**.
zh_tw: 為了使深度緩衝在算繪區域上更精確，你應該*增加*相機節點的 **Near** 屬性。但是要小心，如果你設定得太高，玩家就會看穿附近的幾何體。同時，還應該*減少*相機節點的 **Far** 屬性到你用例允許的最低值，儘管它不會像 **Near** 屬性那樣影響精度。

source: If you only need high precision when the player can see far away, you could change it dynamically based on the game conditions. For instance, if the player enters an airplane, the **Near** property can be temporarily increased to avoid Z-fighting in the distance. It can then be decreased once the player leaves the airplane.
de: Wenn Sie eine hohe Präzision nur dann benötigen, wenn der Spieler weit sehen kann, können Sie sie dynamisch je nach Spielbedingungen ändern. Wenn der Spieler zum Beispiel ein Flugzeug betritt, kann die Eigenschaft **Near** vorübergehend erhöht werden, um Z-Konflikte in der Ferne zu vermeiden. Sobald der Spieler das Flugzeug verlässt, kann sie wieder verringert werden.
zh_tw: 如果你只需要當玩家能夠看到很遠的地方時才提供高精度, 你可以根據遊戲條件動態改變它. 例如, 如果玩家進入飛機, **Near** 屬性可以暫時增加, 以避免遠處的z衝突現象(z-fighting). 當玩家離開飛機時, 它便會被減少.

source: Depending on the scene and viewing conditions, you may also be able to move the Z-fighting objects further apart without the difference being visible to the player.
de: Abhängig von der Szene und den Sichtverhältnissen können Sie die am Z-Konflikt beteiligten Objekte auch weiter voneinander entfernen, ohne dass der Unterschied für den Spieler sichtbar wird.
zh_tw: 根據場景和玩家視野條件, 你還可以在玩家不會看出差異的情況下將產生z衝突的物件移得更遠.

source: Z-fighting comparison (before and after tweaking the scene by offsetting the Label3D away from the floor)
de: Z-Konflikt-Vergleich (vor und nach der Optimierung der Szene durch Versetzen des Label3D vom Boden weg)
zh_tw: Z-fighting 比較（透過將 Label3D 偏離地板來調整場景前後）

source: Transparency sorting
de: Transparenz-Sortierung
zh_tw: 透明度排序

source: In Godot, transparent materials are drawn after opaque materials. Transparent objects are sorted back to front before being drawn based on the Node3D's position, not the vertex position in world space. Due to this, overlapping objects may often be sorted out of order. To fix improperly sorted objects, tweak the material's :ref:`Render Priority <class_Material_property_render_priority>` property or the node's :ref:`Sorting Offset <class_VisualInstance3D_property_sorting_offset>`. Render Priority will force specific materials to appear in front of or behind other transparent materials, while Sorting Offset will move the object forward or backward for the purpose of sorting. Even then, these may not always be sufficient.
de: In Godot werden transparente Materialien nach undurchsichtigen Materialien gezeichnet. Transparente Objekte werden vor dem Zeichnen von hinten nach vorne sortiert, basierend auf der Position des Node3D, nicht auf der Position des Vertex im World-Space. Aus diesem Grund können sich überlappende Objekte oft in der falschen Reihenfolge sortiert werden. Um falsch sortierte Objekte zu korrigieren, ändern Sie die Property :ref:`Render-Priorität <class_Material_property_render_priority>` des Materials oder die Property :ref:`Sortier-Offset <class_VisualInstance3D_property_sorting_offset>` des Nodes. Renderpriorität erzwingt, dass bestimmte Materialien vor oder hinter anderen transparenten Materialien erscheinen, während Sortier-Offset das Objekt zum Zwecke der Sortierung nach vorne oder hinten verschiebt. Aber selbst das ist manchmal nicht ausreichend.
zh_tw: 在 Godot 中，透明材質是在不透明材質之後繪製的。透明對象在繪製之前會從後向前排序，排序依據是該 Spatial 的位置，而不是世界空間中頂點的位置。因此, 互相有重疊的物件可能會出現排序錯誤的情況。要修復排序不當的物件，可以調整材質的 :ref:`Render Priority <class_Material_property_render_priority>` 屬性。這將迫使特定的材質出現在其他透明材質的前面或後面。即便如此，這可能也並不總是能解決問題。

source: Some rendering engines feature *order-independent transparency* techniques to alleviate this, but this is costly on the GPU. Godot currently doesn't provide this feature. There are still several ways to avoid this problem:
de: Einige Rendering-Engines verfügen über *reihenfolge-unabhängige Transparenz*-Techniken, um dieses Problem zu lösen, aber das ist auf der GPU sehr kostspielig. Godot bietet diese Funktion derzeit nicht. Es gibt noch mehrere Möglichkeiten, dieses Problem zu vermeiden:
zh_tw: 一些算繪引擎會使用*順序無關的透明*技術來緩解這個問題，但這類技術對於 GPU 而言開銷很大。Godot 目前沒有提供這個功能，但仍然有幾種方法可以避免這個問題：

source: Only make materials transparent if you actually need it. If a material only has a small transparent part, consider splitting it into a separate material. This will allow the opaque part to cast shadows and will also improve performance.
de: Machen Sie Materialien nur dann transparent, wenn Sie es wirklich brauchen. Wenn ein Material nur einen kleinen transparenten Teil hat, sollten Sie es in ein separates Material aufteilen. Dadurch kann der undurchsichtige Teil Schatten werfen und die Leistung wird verbessert.
zh_tw: 只有在你真正需要的時候才讓材質透明。如果一種材質只有一個很小的透明部分，考慮將它分割成一個單獨的材質。這將允許不透明部分投射陰影，也可能提高性能。

source: If your texture mostly has fully opaque and fully transparent areas, you can use alpha testing instead of alpha blending. This transparency mode is faster to render and doesn't suffer from transparency issues. Enable **Transparency > Transparency** to **Alpha Scissor** in StandardMaterial3D, and adjust **Transparency > Alpha Scissor Threshold** accordingly if needed. Note that MSAA will not antialias the texture's edges unless alpha antialiasing is enabled in the material's properties. However, FXAA, TAA and supersampling will be able to antialias the texture's edges regardless of whether alpha antialiasing is enabled on the material.
de: Wenn Ihre Textur hauptsächlich aus vollständig deckenden und vollständig transparenten Bereichen besteht, können Sie anstelle von Alpha-Blending auch Alpha-Tests verwenden. Dieser Transparenzmodus ist schneller zu rendern und leidet nicht unter Transparenzproblemen. Aktivieren Sie **Transparenz > Transparenz** auf **Alphaschere** in StandardMaterial3D, und passen Sie **Transparenz > Alphascherenschwelle** bei Bedarf entsprechend an. Beachten Sie, dass MSAA kein Antialiasing auf den Kanten der Textur anwendet, es sei denn, Alpha-Antialiasing ist in den Materialeigenschaften aktiviert. FXAA, TAA und Supersampling sind jedoch in der Lage, Antialiasing auf den Kanten der Textur anzuwenden, unabhängig davon, ob Alpha-Antialiasing für das Material aktiviert ist.
zh_tw: 如果你的紋理上大部分都是完全不透明或完全透明的區域，可以使用 Alpha 測試而不是 Alpha 混合。這個透明模式算繪起來比較快，沒有透明度問題。可以在 SpatialMaterial 中啟用**參數 > 使用 Alpha 裁剪**，需要時還可以相應地對 **Alpha 裁剪閾值**進行調整。請注意，MSAA 不會對該紋理的邊緣進行抗鋸齒，但 FXAA 會。

source: If you need to render semi-transparent areas of the texture, alpha scissor isn't suitable. Instead, setting the StandardMaterial3D's **Transparency > Transparency** property to **Depth Pre-Pass** can sometimes work (at a performance cost). You can also try the **Alpha Hash** mode.
de: Wenn Sie halbtransparente Bereiche der Textur rendern müssen, ist Alphaschere nicht geeignet. Stattdessen kann es manchmal funktionieren, die Property **Transparenz > Transparenz** von StandardMaterial3D auf **Tiefen-Vordurchlauf** zu setzen (mit Performanceeinbußen). Sie können auch den Modus **Alpha-Hash** ausprobieren.
zh_tw: 如果你需要算繪紋理上的半透明區域，Alpha 裁剪就不適用了。將 SpatialMaterial 的**參數 > 深度繪製模式**屬性設為 **Opaque Pre-Pass**（不透明預處理）有時候會有用（但會影響性能）。

source: Transparency sorting comparison (alpha-blended materials on the left, alpha scissor materials on the right)
de: Vergleich der Transparenzsortierung (Alpha-Blending-Materialien links, Alpha-Scherenmaterialien rechts)
zh_tw: 透明度排序比較（左邊是alpha混合材質，右邊是alpha剪刀材質）

source: Multi-sample antialiasing
zh_tw: 多取樣抗鋸齒

source: Antialiasing is explained in detail on the :ref:`doc_3d_antialiasing` page.
de: Antialiasing wird auf der Seite :ref:`doc_3d_antialiasing` im Detail erklärt.
zh_tw: 輸入動作在 :ref:`doc_inputevent` 頁面上有詳細解釋。

source: Multi-sample antialiasing (MSAA) takes multiple *coverage* samples at the edges of polygons when rendering objects. It does not increase the number of *color* samples used to render a scene. Here's what this means in practice:
de: Multi-Sample-Antialiasing (MSAA) führt beim Rendern von Objekten mehrere *Verdeckungs-Abtastungen* an den Kanten von Polygonen durch. Es erhöht nicht die Anzahl der *Farb*-Abtastungen, die zum Rendern einer Szene verwendet werden. In der Praxis bedeutet dies Folgendes:
zh_tw: 多重樣本抗鋸齒(MSAA)指的是在算繪物件時在多邊形的邊上取多個覆蓋樣本(coverage samples), 但它不會增加用於算繪場景的顏色樣本數量. 下面是它在實踐中的作用和局限性:

source: Edges of meshes will be smoothed out nicely (as well as supersampling would).
de: Die Ränder von Meshes werden schön geglättet (wie es auch beim Supersampling der Fall wäre).
zh_tw: 網格的邊緣將被很好地平滑(就像超取樣一樣).

source: Transparent materials that use *alpha testing* (1-bit transparency) won't be smoothed out.
de: Transparente Materialien, die *Alpha-Tests* (1-Bit-Transparenz) verwenden, werden nicht geglättet.
zh_tw: 使用alpha測試(1位透明度)的透明材質無法被平滑.

source: Specular aliasing ("sparkles" that appear on reflective surfaces) won't be reduced.
de: Spiegel-Aliasing ("Funkeln", das auf reflektierenden Oberflächen auftritt) wird nicht reduziert.
zh_tw: 鏡面反射鋸齒問題（即出現在反射表面上的“火花”（sparkle））無法解決。

source: There are several ways to work around this limitation depending on your performance budget:
de: Es gibt mehrere Möglichkeiten, diese Einschränkung abhängig von Ihrem Performance-Budget zu umgehen:
zh_tw: 有幾種方法可以解決這一限制, 這取決於您的績效預算:

source: To make specular aliasing less noticeable, open the Project Settings and enable **Rendering > Quality > Screen Space Filters > Screen Space Roughness Limiter**. This filter has a moderate cost on performance, so it should only be enabled if you actually need it.
de: Um das spiegelnde Aliasing weniger auffällig zu machen, öffnen Sie die Projekteinstellungen und aktivieren Sie **Rendern > Qualität > Kantenglättung > Screen-Space-Grobheitsbegrenzer**. Dieser Filter hat moderate Auswirkungen auf die Performance, daher sollte er nur aktiviert werden, wenn Sie ihn tatsächlich benötigen.
zh_tw: 為了使鏡面反射鋸齒不那麼明顯，請打開專案設定，並啟用 **Rendering > Quality > Screen Space Filters > Screen Space Roughness Limiter**。這個濾波器對性能有一定影響，只有當您確實需要它時， 才應該啟用。

source: Enable fast approximate antialiasing (FXAA) in addition to (or instead of) MSAA. Since FXAA is a screen-space antialiasing method, it will smooth out anything. As a downside, FXAA also makes the scene appear blurrier, especially at resolutions below 1440p. FXAA also lacks temporal information, which means its impact on specular aliasing is limited.
de: Aktivieren Sie zusätzlich zu (oder anstelle von) MSAA schnelles approximatives Antialiasing (FXAA). Da es sich bei FXAA um eine Antialiasing-Methode für den Screen-Space handelt, wird damit alles geglättet. Der Nachteil ist, dass FXAA die Szene unschärfer erscheinen lässt, insbesondere bei Auflösungen unter 1440p. Bei FXAA fehlen auch zeitliche Informationen, was bedeutet, dass die Auswirkungen auf das Specular-Aliasing begrenzt sind.
zh_tw: 除了(或代替)MSAA之外, 啟用FXAA.FXAA是一個螢幕空間的抗鋸齒方法, 因此它將平滑一切事物. 缺點是它會使場景顯得模糊, 特別是在解析度低於1440p的時候.

source: Enable temporal antialiasing (TAA) in addition to (or instead of) MSAA. Since TAA is a screen-space antialiasing method, it will smooth out anything. As a downside, TAA also makes the scene appear blurrier, especially at resolutions below 1440p. TAA provides superior quality compared to FXAA and can effectively combat specular aliasing. However, TAA has a greater performance cost compared to FXAA, and TAA can introduce ghosting artifacts with fast movement.
de: Aktivieren Sie temporales Antialiasing (TAA) zusätzlich zu (oder anstelle von) MSAA. Da TAA eine Antialiasing-Methode für den Screen-Space ist, glättet es alles. Der Nachteil ist, dass TAA die Szene unschärfer erscheinen lässt, insbesondere bei Auflösungen unter 1440p. TAA bietet im Vergleich zu FXAA eine bessere Qualität und kann effektiv gegen Specular-Aliasing vorgehen. Allerdings hat TAA im Vergleich zu FXAA einen höheren Performance-Aufwand, und TAA kann bei schnellen Bewegungen Geisterbilder erzeugen.
zh_tw: 除了(或代替)MSAA之外, 啟用FXAA.FXAA是一個螢幕空間的抗鋸齒方法, 因此它將平滑一切事物. 缺點是它會使場景顯得模糊, 特別是在解析度低於1440p的時候.

source: Render the scene at a higher resolution by increasing the **Scaling 3D > Scale** project setting above ``1.0``. This technique is called supersample antialiasing (SSAA) and is very slow. Its use is generally only recommended for offline rendering.
de: Rendern Sie die Szene mit einer höheren Auflösung, indem Sie die Projekteinstellung **3D-Skalierung > Skalierung** über ``1.0`` erhöhen. Diese Technik wird Supersample Antialiasing (SSAA) genannt und ist sehr langsam. Ihre Verwendung wird im Allgemeinen nur für Offline-Rendering empfohlen.
zh_tw: 以更高的解析度算繪場景，然後在與視窗大小配對的 ViewportTexture 中顯示它。確保在 ViewportTexture 的標記中啟用 **Filter**。這種技術叫做*超取樣*，非常慢。通常只推薦在離線算繪時使用。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: If you want a material to fade with distance, use the StandardMaterial3D distance fade mode **Pixel Dither** or **Object Dither** instead of **Pixel Alpha**. This will make the material opaque, which also speeds up rendering.
de: Wenn Sie möchten, dass ein Material mit der Entfernung verblassen soll, verwenden Sie den StandardMaterial3D-Fernausblendungsmodus **Pixel-Dither** oder **Objekt-Dither** anstelle von **Pixel-Alpha**. Dadurch wird das Material undurchsichtig, was auch das Rendern beschleunigt.
