Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_text.po
Languages: de, zh_cn

source: 3D text
zh_cn: 3D 文本

source: Introduction
de: Einführung
zh_cn: 前言

source: In a project, there may be times when text needs to be created as part of a 3D scene and not just in the HUD. Godot provides 2 methods to do this: the Label3D node and the TextMesh *resource* for a MeshInstance3D node.
de: In einem Projekt kann es vorkommen, dass Text als Teil einer 3D-Szene und nicht nur im HUD erstellt werden muss. Godot bietet dafür zwei Methoden: den Label3D Node und die TextMesh-*Ressource* für einen MeshInstance3D-Node.
zh_cn: 项目中不仅会要在 HUD 中使用文本，有时也会需要把文本作为 3D 场景的一部分。Godot 为此提供了两种方法。Label3D 节点以及 MeshInstance3D 节点的 TextMesh *资源* 。

source: Additionally, Godot makes it possible to position Control nodes according to a 3D point's position on the camera. This can be used as an alternative to "true" 3D text in situations where Label3D and TextMesh aren't flexible enough.
de: Zusätzlich ermöglicht Godot die Positionierung von Control-Nodes entsprechend der Position eines 3D-Punktes auf der Kamera. Dies kann als Alternative zu "echtem" 3D-Text in Situationen verwendet werden, in denen Label3D und TextMesh nicht flexibel genug sind.
zh_cn: 此外，Godot 还可以使根据 3D 顶点在相机上的位置来定位控制节点成为可能。在 Label3D 和 TextMesh 不够灵活的情况下，这可以用作 "真实的" 3D 文本的替代方案。

source: You can see 3D text in action using the `3D Labels and Texts demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/labels_and_texts>`__.
de: Sie können 3D-Text in Aktion sehen, indem Sie das `"3D Labels and Texts"-Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/labels_and_texts>`__ verwenden.
zh_cn: 你可以使用 `3D 标签和文本演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/labels_and_texts>`__ 查看3D文本的实际效果。

source: This page does **not** cover how to display a GUI scene within a 3D environment. For information on how to achieve that, see the `GUI in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ demo project.
de: Diese Seite behandelt **nicht**, wie man eine GUI-Szene in einer 3D-Umgebung anzeigt. Informationen dazu finden Sie im Demoprojekt `GUI in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__.
zh_cn: 这个页面\ **不会**\ 涉及如何在 3D 环境中显示 GUI 场景。有关如何实现这个功能的信息，请参考\ `GUI in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ \ 演示项目。

source: Label3D behaves like a Label node, but in 3D space. Unlike the Label node, this Label3D node does **not** inherit properties of a GUI theme. However, its look remains customizable and uses the same font subresource as Control nodes (including support for :abbr:`MSDF (Multi-channel Signed Distance Font)` font rendering).
de: Label3D verhält sich wie ein Label-Node, aber im 3D-Raum. Anders als der Label-Node erbt dieser Label3D-Node **nicht** die Propertys eines GUI-Themes. Sein Aussehen bleibt jedoch anpassbar und verwendet dieselbe Schrift-Subresource wie Control-Nodes (einschließlich Unterstützung für :abbr:`MSDF (Multi-channel Signed Distance Font)` Font-Rendering).
zh_cn: Label3D 的行为类似于 Label 节点，只不过是换到了 3D 空间中。与 Label 节点不同，此 Label3D 节点\ **不**\ 继承 GUI 主题的属性。不过，外观还是可定制的，使用的也是与 Control 节点相同的字体子资源（包括对 :abbr:`MSDF (Multi-channel Signed Distance Font，多通道符号距离字体)` 字体渲染的支持）。

source: Advantages
de: Vorteile
zh_cn: 优势

source: Label3D is faster to generate than TextMesh. While both use a caching mechanism to only render new glyphs once, Label3D will still be faster to (re)generate, especially for long text. This can avoid stuttering during gameplay on low-end CPUs or mobile.
de: Label3D ist schneller zu erzeugen als TextMesh. Während beide einen Caching-Mechanismus verwenden, um neue Glyphen nur einmal zu rendern, wird Label3D immer noch schneller (neu) zu generieren, vor allem für langen Text. Dies kann Stutter während des Spielens auf Low-End-CPUs oder mobilen Geräten vermeiden.
zh_cn: Label3D 的生成速度比 TextMesh 快。虽然两者都使用缓存机制，只渲染一次新字形，但 Label3D 的（重新）生成速度仍然更快，尤其是对于长文本。这可以避免在低端 CPU 或移动设备上玩游戏时出现卡顿。

source: Label3D can use bitmap fonts and dynamic fonts (with and without :abbr:`MSDF (Multi-channel Signed Distance Font)` or mipmaps). This makes it more flexible on that aspect compared to TextMesh, especially for rendering fonts with self-intersecting outlines.
de: Label3D kann Bitmap-Schriftarten und dynamische Schriftarten (mit und ohne :abbr:`MSDF (Multi-channel Signed Distance Font)` oder Mipmaps) verwenden. Dies macht es in dieser Hinsicht flexibler als TextMesh, insbesondere bei der Darstellung von Schriften mit sich selbst überschneidenden Umrissen.
zh_cn: Label3D 可以使用位图字体和动态字体（带或不带 :abbr:`MSDF (Multi-channel Signed Distance Font)` 或 mipmap）。这使得它在这方面比 TextMesh 更灵活，尤其是在渲染具有自交轮廓的字体时。

source: See :ref:`doc_gui_using_fonts` for guidelines on configuring font imports.
de: Siehe :ref:`doc_gui_using_fonts` für Richtlinien zur Konfiguration von Font-Importen.
zh_cn: 有关配置字体导入的指南，请参阅 :ref:`doc_gui_using_fonts`。

source: Limitations
de: Einschränkungen
zh_cn: 限制

source: By default, Label3D has limited interaction with a 3D environment. It can be occluded by geometry and lit by light sources if the **Shaded** flag is enabled. However, it will not cast shadows even if **Cast Shadow** is set to **On** in the Label3D's GeometryInstance3D properties. This is because the node internally generates a quad mesh (one glyph per quad) with transparent textures and has the same limitations as Sprite3D. Transparency sorting issues can also become apparent when several Label3Ds overlap, especially if they have outlines.
de: Standardmäßig hat Label3D eine begrenzte Interaktion mit einer 3D-Umgebung. Es kann von Geometrie verdeckt und von Lichtquellen beleuchtet werden, wenn das Flag **Shaded** aktiviert ist. Er wirft jedoch keine Schatten, selbst wenn **Schatten werfen** in der Property der GeometryInstance3D von Label3D auf **An** gesetzt ist. Das liegt daran, dass der Node intern ein Quad-Mesh (eine Glyphe pro Quad) mit transparenten Texturen erzeugt und die gleichen Einschränkungen wie Sprite3D hat. Probleme mit der Transparenzsortierung können auch auftreten, wenn sich mehrere Label3Ds überschneiden, insbesondere wenn sie Umrisse haben.
zh_cn: 默认情况下，Label3D 与 3D 环境的交互有限。 *着色* 标志启用时能够接受光照、被光源着色。但是，即使在 Label3D 的 GeometryInstance3D 属性中将 **阴影投射** 设置为 **开启** ，它也不会投射阴影。这是因为该节点内部生成具有透明纹理的四边形网格（每个四边形一个字形），并且具有与 Sprite3D 相同的限制。当多个 Label3D 重叠，尤其是当它们具有轮廓时，透明度排序问题也会变得明显。

source: This can be mitigated by setting the Label3D's transparency mode to **Alpha Cut**, at the cost of less smooth text rendering. The **Opaque Pre-Pass** transparency mode can preserve text smoothness while allowing the Label3D to cast shadows, but some transparency sorting issues will remain.
de: Dies kann durch die Einstellung des Transparenzmodus von Label3D auf **Alpha Cut** abgemildert werden, allerdings auf Kosten einer weniger glatten Textdarstellung. Der **Opaque Pre-Pass**-Transparenzmodus kann Text-Glätte bewahren, und es gleichzeitig Label3D erlauben, Schatten zu werfen, aber einige Transparenz-Sortierungsprobleme werden bleiben.
zh_cn: 这可以将 Label3D 的透明度模式设置为 **Alpha Cut** 来缓解 ，但代价是文字渲染不够流畅。\ **Opaque Pre-Pass** 透明度模式可以保持文本的流畅性，同时允许 Label3D 投射阴影，但仍会存在一些透明度排序问题。

source: See :ref:`Transparency sorting <doc_3d_rendering_limitations_transparency_sorting>` section in the 3D rendering limitations page for more information.
de: Siehe :ref:`Transparenzsortierung <doc_3d_rendering_limitations_transparency_sorting>` auf der Seite 3D-Rendering-Einschränkungen für weitere Informationen.
zh_cn: 有关详细信息，请参阅 3D 渲染限制页面中的 :ref:`Transparency sorting <doc_3d_rendering_limitations_transparency_sorting>` 部分。

source: The TextMesh resource has similarities to Label3D. They both display text in a 3D scene, and will use the same font subresource. However, instead of generating transparent quads, TextMesh generates 3D geometry that represents the glyphs' contours and has the properties of a mesh. As a result, a TextMesh is shaded by default and automatically casts shadows onto the environment. A TextMesh can also have a material applied to it (including custom shaders).
de: Die TextMesh-Ressource hat Ähnlichkeiten mit Label3D. Beide stellen Text in einer 3D-Szene dar und verwenden dieselbe Font-Subressource. Anstatt jedoch transparente Quads zu generieren, erzeugt TextMesh eine 3D-Geometrie, die den Konturen der Glyphen entspricht und die Eigenschaften eines Meshs hat. Folglich ist ein TextMesh standardmäßig schattiert und wirft automatisch Schatten auf die Umgebung. Auf ein TextMesh kann auch ein Material angewendet werden (einschließlich benutzerdefinierter Shader).
zh_cn: TextMesh（文本网格）资源和 Label3D 类似，都能够在 3D 场景中显示文本，使用的是相同的字体子资源。但 TextMesh 生成的不是透明四边形，而是代表字形轮廓的 3D 网格，具有和网格一样的属性。因此，TextMesh 默认是开启着色的，会自动在环境中投射阴影。TextMesh 也可以设置材质（包括自定义着色器）。

source: Here is an example of a texture and how it's applied to the mesh. You can use the texture below as a reference for the generated mesh's UV map:
de: Hier ist ein Beispiel für eine Textur und wie sie auf das Mesh angewendet wird. Sie können die Textur unten als Referenz für die UV-Map des generierten Meshes verwenden:
zh_cn: 这是为网格应用纹理的示例。你可以使用下面的纹理作为生成网格 UV 贴图的参考：

source: TextMesh has a few advantages over Label3D:
de: TextMesh hat einige Vorteile gegenüber Label3D:
zh_cn: 相对于 Label3D 而言，TextMesh 有以下优点：

source: TextMesh can use a texture to modify text color on a per-side basis.
de: TextMesh kann eine Textur verwenden, um die Textfarbe für jede Seite zu ändern.
zh_cn: TextMesh 可以使用纹理来修改文本各个面的颜色。

source: TextMesh geometry can have actual depth to it, giving glyphs a 3D look.
de: Die TextMesh-Geometrie kann eine echte Tiefe haben und Glyphen ein 3D-Aussehen verleihen.
zh_cn: TextMesh 几何体具有深度，字形看上去是 3D 的。

source: TextMesh can use custom shaders, unlike Label3D.
de: TextMesh kann im Gegensatz zu Label3D eigene Shader verwenden.
zh_cn: TextMesh 可以使用自定义的着色器，而 Label3D 无法使用。

source: There are some limitations to TextMesh:
de: Es gibt einige Einschränkungen bei TextMesh:
zh_cn: TextMesh 的局限性有：

source: No built-in outline support, unlike Label3D. This can be simulated using custom shaders though.
de: Im Gegensatz zu Label3D gibt es keine integrierte Unterstützung für Umrisse. Dies kann jedoch mit benutzerdefinierten Shadern simuliert werden.
zh_cn: 没有内置的轮廓支持，而 Label3D 支持。但是可以使用自定义着色器模拟。

source: Only dynamic fonts are supported (``.ttf``, ``.otf``, ``.woff``, ``.woff2``). Bitmap fonts in the ``.fnt`` or ``.font`` formats are **not** supported.
de: Es werden nur dynamische Schriftarten unterstützt (``.ttf``, ``.otf``, ``.woff``, ``.woff2``). Bitmap-Schriften in den Formaten ``.fnt`` oder ``.font`` werden **nicht** unterstützt.
zh_cn: 仅支持动态字体（\ ``.ttf``\ 、\ ``.otf``\ 、\ ``.woff``\ 、\ ``.woff2``\ ）。\ **不支持** ``.fnt`` 和 ``.font`` 格式的位图字体。

source: Fonts with self-intersecting outlines will not render correctly. If you notice rendering issues on fonts downloaded from websites such as Google Fonts, try downloading the font from the font author's official website instead.
de: Schriftarten mit sich selbst überschneidenden Umrissen werden nicht korrekt wiedergegeben. Wenn Sie Rendering-Probleme bei Schriftarten feststellen, die von Websites wie Google Fonts heruntergeladen wurden, laden Sie die Schriftart stattdessen von der offiziellen Website des Font-Autors herunter.
zh_cn: 无法正确渲染轮廓自相交的字体。如果使用从 Google Fonts 等处下载到的字体时出现渲染问题，请尝试改为从作者的官方网站下载。

source: Projected Label node (or any other Control)
de: Projizierter Label-Node (oder jedes andere Control)
zh_cn: 投影 Label 节点（或者其他 Control 节点）

source: There is a last solution that is more complex to set up, but provides the most flexibility: projecting a 2D node onto 3D space. This can be achieved using the return value of :ref:`unproject_position<class_Camera3D_method_unproject_position>` method on a Camera3D node in a script's ``_process()`` function. This return value should then be used to set the ``position`` property of a Control node.
de: Es gibt eine letzte Lösung, die komplizierter einzurichten ist, aber die größte Flexibilität bietet: die Projektion eines 2D-Nodes in den 3D-Raum. Dies kann mit dem Rückgabewert der Methode :ref:`unproject_position <class_Camera3D_method_unproject_position>` auf einem Camera3D-Node in der Funktion ``_process()`` eines Skripts erreicht werden. Dieser Rückgabewert sollte dann verwendet werden, um die Eigenschaft ``Position`` eines Control-Nodes setzen.
zh_cn: 还有最后一种设置起来更麻烦的解决方案，但是灵活性更高：将 2D 节点投影到 3D 空间中。做法是在脚本的 ``_process()`` 函数中使用 Camera3D 节点的 :ref:`unproject_position<class_Camera3D_method_unproject_position>` 的返回值。使用这个返回值来设置 Control 节点的 ``position`` 属性。

source: See the `3D waypoints <https://github.com/godotengine/godot-demo-projects/tree/master/3d/waypoints>`__ demo for an example of this.
de: Ein Beispiel hierfür finden Sie in der Demo `3D Waypoints <https://github.com/godotengine/godot-demo-projects/tree/master/3d/waypoints>`__.
zh_cn: 示例见 `3D 路径点 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/waypoints>`__\ 演示。

source: Any Control node can be used, including Label, RichTextLabel or even nodes such as Button. This allows for powerful formatting and GUI interaction.
de: Jeder Control-Node kann verwendet werden, einschließlich Label, RichTextLabel oder sogar Nodes wie Button. Dies ermöglicht leistungsstarke Formatierung und GUI-Interaktion.
zh_cn: Label、RichTextLabel 等任何 Control 节点，甚至 Button 这样的节点都可以用这种方法。这样就能够实现强大的格式和 GUI 交互。

source: The script-based approach allows for complete freedom in positioning. For example, this makes it considerably easier to pin Controls to the screen's edges when they go off-screen (for in-game 3D markers).
de: Der skriptbasierte Ansatz lässt völlige Freiheit bei der Positionierung zu. So ist es beispielsweise wesentlich einfacher, Control-Nodes an den Bildschirmrändern zu fixieren, wenn sie den Bildschirm verlassen (für 3D-Marker im Spiel).
zh_cn: 基于脚本的做法能够在定位方面做到最大的自由度。例如，这样就能够在超出屏幕范围后将 Control 吸附到屏幕的边缘（用于在游戏中实现 3D 标记）。

source: Control theming is obeyed. This allows for easier customization that globally applies to the project.
de: Das Theme der Controls wird befolgt. Dies ermöglicht eine einfachere Anpassung, die global für das Projekt gilt.
zh_cn: Control 主题仍然有效。这样实现自定义项目全局的设置就更方便。

source: Projected Controls cannot be occluded by 3D geometry in any way. You can use a RayCast to fully hide the control if its target position is occluded by a collider, but this doesn't allow for partially hiding the control behind a wall.
de: Projizierte Controls können in keiner Weise durch 3D-Geometrie verdeckt werden. Sie können einen RayCast verwenden, um das Control vollständig auszublenden, wenn seine Zielposition von einem Collider verdeckt wird, aber dies ermöglicht nicht das teilweise Ausblenden des Controls hinter einer Wand.
zh_cn: 投影的 Control 无法以任何形式被 3D 几何体遮挡。目标位置被遮挡时，你可以借助 RayCast 将该控件完全隐藏，但是无法实现位于墙壁后面时只隐藏部分区域的效果。

source: Changing text size depending on distance by adjusting the Control's ``scale`` property is possible, but it needs to be done manually. Label3D and TextMesh automatically take care of this, at the cost of less flexibility (can't set a minimum/maximum text size in pixels).
de: Das Ändern der Textgröße in Abhängigkeit von der Entfernung durch Anpassen der Property ``Skalierung`` des Controls ist möglich, muss aber manuell durchgeführt werden. Label3D und TextMesh erledigen dies automatisch, allerdings auf Kosten einer geringeren Flexibilität (man kann keine minimale/maximale Textgröße in Pixeln festlegen).
zh_cn: 可以根据距离调整 Control 的 ``scale`` 属性，从而调整文本的大小，但是需要手动缩放。Label3D 和 TextMesh 会自动处理，但是灵活性不足（无法设置最小/最大的文本像素大小）。

source: Handling resolution and aspect ratio changes must be taken into account in the script, which can be challenging.
de: Änderungen der Auflösung und des Seitenverhältnisses müssen im Skript berücksichtigt werden, was eine Herausforderung darstellen kann.
zh_cn: 必须在脚本中考虑到分辨率和纵横比的变化，这可能具有挑战性。

source: Should I use Label3D, TextMesh or a projected Control?
de: Sollte ich Label3D, TextMesh oder ein projiziertes Steuerelement verwenden?
zh_cn: 我应当使用 Label3D，TextMesh 还是投影的 Control？

source: In most scenarios, Label3D is recommended as it's easier to set up and provides higher rendering quality (especially if 3D antialiasing is disabled).
de: In den meisten Fällen wird Label3D empfohlen, da es einfacher einzurichten ist und eine höhere Rendering-Qualität bietet (insbesondere wenn 3D-Antialiasing deaktiviert ist).
zh_cn: 在大多数情况下，建议使用 Label3D，因为它更易于设置，并能提供更高的渲染质量（尤其是在禁用 3D 抗锯齿的情况下）。

source: For advanced use cases, TextMesh is more flexible as it allows styling the text with custom shaders. Custom shaders allow for modifying the final geometry, such as curving the text along a surface. Since the text is actual 3D geometry, the text can optionally have depth to it and can also contribute to global illumination.
de: Für fortgeschrittene Anwendungsfälle ist TextMesh flexibler, da es die Gestaltung des Textes mit benutzerdefinierten Shadern ermöglicht. Mit benutzerdefinierten Shadern kann die endgültige Geometrie verändert werden, z. B. indem der Text entlang einer Oberfläche gebogen wird. Da es sich bei dem Text um tatsächliche 3D-Geometrie handelt, kann der Text optional Tiefe haben und auch zur globalen Beleuchtung beitragen.
zh_cn: 对于进阶用例，TextMesh 更为灵活，因为它允许使用自定义着色器对文字进行设计。自定义着色器可以修改最终几何图形，例如沿表面弯曲文字。由于文字是实际的三维几何体，因此文字可以选择具有深度，也可以对全局照明做出贡献。

source: If you need features such as BBCode or Control theming support, then using a projected RichTextLabel node is the only way to go.
de: Wenn Sie Featues wie BBCode- oder Control-Theme-Unterstützung benötigen, ist die Verwendung eines projizierten RichTextLabel-Nodes die einzige Möglichkeit.
zh_cn: 如果你需要 BBCode 或 Control 主题支持等功能，则使用投影 RichTextLabel 节点是唯一的方法。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
