Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/csg_tools.po
Languages: de, zh_cn, zh_tw

source: Prototyping levels with CSG
de: Level-Prototypen mittels CSG erstellen
zh_cn: 使用 CSG 设计关卡原型
zh_tw: 使用 CSG 設計關卡原型

source: Level prototyping is one of the main uses of CSG in Godot. This technique allows users to create the most common shapes by combining primitives. Interior environments can be created by using inverted primitives.
de: Level-Prototyping ist eine der Hauptanwendungen von CSG in Godot. Mit dieser Technik können Benutzer die gängigsten geometrischen Formen erstellen, indem sie Grundelemente kombinieren. Innenumgebungen können mithilfe invertierter Grundelemente erstellt werden.
zh_cn: 关卡原型是 Godot 中 CSG 的主要用途之一。该技术允许用户通过组合图元来创建最常见形状的简单版本。可以使用反转图元创建内部环境。
zh_tw: CSG 在 Godot 中的目的是將其用於關卡原型設計。該技術允許使用者通過組合像素來建立最常見形狀的簡單版本。可以使用反轉像素建立室內環境。

source: The CSG nodes in Godot are mainly intended for prototyping. There is no built-in support for UV mapping or editing 3D polygons (though extruded 2D polygons can be used with the CSGPolygon3D node).
de: Die CSG-Nodes in Godot sind hauptsächlich für das Prototyping vorgesehen. Es gibt keine Built-in-Unterstützung für UV-Mapping oder das Bearbeiten von 3D-Polygonen (obwohl extrudierte 2D-Polygone mit dem CSGPolygon3D-Node verwendet werden können).
zh_cn: Godot 中的 CSG 节点主要用于原型设计。没有内置的对 UV 贴图或编辑 3D 多边形的支持（尽管拉伸 2D 多边形可以与 CSGPolygon3D 节点一起使用）。
zh_tw: Godot中的CSG節點主要用於原型設計. 沒有內建的對UV貼圖或編輯3D多邊形的支援(儘管擠出的2D多邊形可以用CSGPolygon節點來使用).

source: You can check how to use CSG nodes to build various shapes (such as stairs or roads) using the `Constructive Solid Geometry demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/csg>`__.
de: Wie Sie CSG-Nodes verwenden, um verschiedene geometrische Formen (wie Treppen oder Straßen) zu bauen, können Sie anhand des `Constructive Solid Geometry-Demoprojekts <https://github.com/godotengine/godot-demo-projects/tree/master/3d/csg>`__ sehen.
zh_cn: 你可以通过 `CSG 演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/csg>`__ 来学习如何使用 CSG 节点构建各种形状（例如楼梯或道路）。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Introduction to CSG nodes
de: Einführung in CSG-Nodes
zh_cn: CSG 节点简介
zh_tw: 序言

source: Like other features of Godot, CSG is supported in the form of nodes. These are the CSG nodes:
de: Wie andere Features von Godot wird CSG in Form von Nodes unterstützt. Dies sind die CSG-Nodes:
zh_cn: 与 Godot 的其他功能一样，CSG 以节点的形式存在。这些是 CSG 节点：
zh_tw: 與 Godot 的其他功能一樣，CSG 以節點的形式存在。這些是 CSG 節點：

source: :ref:`CSGBox3D <class_CSGBox3D>`
zh_tw: :ref:`Color <class_Color>`

source: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (also supports cone)
de: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (unterstützt auch Kegel)
zh_cn: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (也支持锥体)
zh_tw: :ref:`CSGCylinder <class_CSGCylinder>` (也支援錐體)

source: :ref:`CSGSphere3D <class_CSGSphere3D>`
zh_tw: :ref:`Vector3 <class_Vector3>`

source: :ref:`CSGTorus3D <class_CSGTorus3D>`
zh_tw: :ref:`Color <class_Color>`

source: :ref:`CSGPolygon3D <class_CSGPolygon3D>`
zh_tw: :ref:`Color <class_Color>`

source: :ref:`CSGMesh3D <class_CSGMesh3D>`
zh_tw: :ref:`RID <class_RID>`

source: :ref:`CSGCombiner3D <class_CSGCombiner3D>`
zh_tw: :ref:`Color <class_Color>`

source: CSG tools features
de: Eigenschaften der CSG-Tools
zh_cn: CSG 工具功能
zh_tw: CSG 工具功能

source: Every CSG node supports 3 kinds of boolean operations:
de: Jeder CSG-Node unterstützt drei Arten von booleschen Operationen:
zh_cn: 每个 CSG 节点都支持 3 种布尔运算：
zh_tw: 每個 CSG 節點都支援 3 種布耳運算：

source: **Union:** Geometry of both primitives is merged, intersecting geometry is removed.
de: **Vereinigung:** Die Geometrie beider Grundelemente wird zusammengeführt, die sich überschneidende Geometrie wird entfernt.
zh_cn: **并集（Union）：**\ 合并两个图元的几何体，删除交叉的几何体。
zh_tw: **並集（Union）：**合併兩個像素的幾何體，刪除交叉的幾何體。

source: **Intersection:** Only intersecting geometry remains, the rest is removed.
de: **Schnittmenge:** Es bleibt nur die Schnittgeometrie übrig, der Rest wird entfernt.
zh_cn: **交集（Intersection）：**\ 只保留相交的几何体，其余的被删除。
zh_tw: **交集（Intersection）：**只保留相交的幾何體，其餘的被刪除。

source: **Subtraction:** The second shape is subtracted from the first, leaving a dent with its shape.
de: **Subtraktion:** Die zweite Geometrie-Form wird von der ersten subtrahiert, wobei eine Einbuchtung in ihrer Form zurückbleibt.
zh_cn: **差集（Subtraction）：**\ 从第一种形状中减去第二种形状，留下一个凹陷的形状。
zh_tw: **差集（Subtraction）：**從第一種形狀中減去第二種形狀，留下一個凹陷的形狀。

source: The :ref:`CSGPolygon3D <class_CSGPolygon3D>` node extrude along a Polygon drawn in 2D (in X, Y coordinates) in the following ways:
de: Der :ref:`CSGPolygon3D <class_CSGPolygon3D>`-Node wird entlang eines in 2D gezeichneten Polygons (in X, Y Koordinaten) auf folgende Weise extrudiert:
zh_cn: :ref:`CSGPolygon3D <class_CSGPolygon3D>` 节点通过下列方式沿着以 2D（X、Y 坐标）绘制的多边形挤出：
zh_tw: :ref:`CSGPolygon <class_CSGPolygon>` 節點以下列方式沿著以 2D（X、Y 座標）繪製的多邊形擠出：

source: **Depth:** Extruded back a given amount.
de: **Tiefe:** Extrudiert um einen bestimmten Betrag heraus.
zh_cn: **Depth：**\ （深度）挤出一定量。
zh_tw: **Depth：**（深度）擠出一定量。

source: **Spin:** Extruded while spinning around its origin.
de: **Spin:** Extrudiert beim Drehen um seinen Ursprung.
zh_cn: **Spin：**\ （旋转）围绕原点旋转时挤出。
zh_tw: **Spin：**（旋轉）圍繞原點旋轉時擠出。

source: **Path:** Extruded along a Path node. This operation is commonly called lofting.
de: **Pfad:** Extrudiert entlang eines Pfad-Nodes. Diese Operation wird üblicherweise als Lofting bezeichnet.
zh_cn: **路径(Path):** 沿路径节点挤出. 此操作通常称为放样.
zh_tw: **路徑(Path):** 沿路徑節點擠出. 此操作通常稱為放樣.

source: The **Path** mode must be provided with a :ref:`Path3D <class_Path3D>` node to work. In the Path node, draw the path and the polygon in CSGPolygon3D will extrude along the given path.
de: Der **Pfad**-Modus muss mit einem :ref:`Path3D <class_Path3D>`-Node versehen sein, um zu funktionieren. Im Path-Node zeichnen Sie den Pfad, und das Polygon in CSGPolygon3D wird entlang des angegebenen Pfades extrudiert.
zh_cn: **Path** 模式必须需要一个 :ref:`Path3D <class_Path3D>` 节点来运行。在 Path 节点中绘制路径，CSGPolygon3D 中的多边形将沿给定路径挤出。
zh_tw: **Path** 模式需要一個 :ref:`Path <class_Path>` 節點來運作。在 Path 節點中繪製路徑，CSGPolygon 中的多邊形將沿給定路徑擠出。

source: Custom meshes
de: Benutzerdefinierte Meshes
zh_cn: 自定义网格
zh_tw: 自訂網格

source: it must be closed,
de: sie muss geschlossen sein,
zh_cn: 它必须被关闭,
zh_tw: 它必須被關閉,

source: it must not self-intersect,
de: sie darf sich nicht selbst überschneiden,
zh_cn: 它不能自我相交,
zh_tw: 它不能自我相交,

source: it must not contain internal faces,
de: sie darf keine inneren Flächen enthalten,
zh_cn: 它不能包含内部面,
zh_tw: 它不能包含內部面,

source: every edge must connect to only two other faces.
de: jede Kante darf nur mit zwei anderen Flächen verbunden werden.
zh_cn: 每条边都必须连接到另外两个面.
zh_tw: 每條邊都必須連接到另外兩個面.

source: The :ref:`CSGCombiner3D <class_CSGCombiner3D>` node is an empty shape used for organization. It will only combine children nodes.
de: Der :ref:`CSGCombiner3D <class_CSGCombiner3D>`-Node ist eine leere Geometrie-Form, die zur Organisation verwendet wird. Er kombiniert nur Child-Nodes.
zh_cn: :ref:`CSGCombiner3D <class_CSGCombiner3D>` 节点是一个用于组织的空形状，它只会合并子节点。
zh_tw: :ref:`CSGCombiner <class_CSGCombiner>` 節點是一個用於組織的空形狀, 它只會合並子節點.

source: Processing order
de: Bearbeitungsreihenfolge
zh_cn: 处理顺序
zh_tw: 處理順序

source: Every CSG node will first process its children nodes and their operations: union, intersection, or subtraction, in tree order, and apply them to itself one after the other.
de: Jeder CSG-Node verarbeitet zunächst seine Child-Nodes und deren Operationen: Vereinigung, Schnittmenge oder Subtraktion, in der Reihenfolge der Baumstruktur, und wendet sie nacheinander auf sich selbst an.
zh_cn: 每个CSG节点将首先按树顺序处理其子节点及其操作：并集、交集或减，并将它们逐一应用于自身。
zh_tw: 每個CSG節點將首先按樹連續處理其子節點及其操作: 並集, 交集或減法, 並將它們逐一應用於自身.

source: In the interest of performance, make sure CSG geometry remains relatively simple, as complex meshes can take a while to process. If adding objects together (such as table and room objects), create them as separate CSG trees. Forcing too many objects in a single tree will eventually start affecting performance. Only use binary operations where you actually need them.
de: Im Interesse der Performance sollten Sie darauf achten, dass die CSG-Geometrie relativ einfach bleibt, da die Verarbeitung komplexer Meshes eine Weile dauern kann. Wenn Sie Objekte zusammenfügen (z.B. Tisch- und Raumobjekte), erstellen Sie sie als separate CSG-Bäume. Wenn Sie zu viele Objekte in einen einzigen Baum zwingen, wird sich das auf die Performance auswirken. Verwenden Sie binäre Operationen nur dort, wo Sie sie tatsächlich benötigen.
zh_cn: 为了保证性能, 确保CSG几何体保持相对简单, 因为复杂的网格可能需要一段时间来处理. 如果将对象添加在一起(如桌子和房间对象), 请将它们创建为单独的CSG树. 强制在一棵树中添加太多对象最终会影响性能. 仅在实际需要的地方使用二进制操作.
zh_tw: 為了保證性能, 確保CSG幾何體保持相對簡單, 因為複雜的網格可能需要一段時間來處理. 如果將物件新增在一起(如桌子和房間物件), 請將它們建立為單獨的CSG樹. 強制在一棵樹中新增太多物件最終會影響性能. 僅在實際需要的地方使用二進位操作.

source: Prototyping a level
de: Einen Level-Prototyp erstellen
zh_cn: 原型设计
zh_tw: 原型設計

source: We will prototype a room to practice the use of CSG tools.
de: Als Übung zur Verwendung von CSG-Tools werden wir einen Raum als Prototyp erstellen.
zh_cn: 我们将对房间进行原型设计以练习使用CSG工具.
zh_tw: 我們將對房間進行原型設計以練習使用CSG工具.

source: Working in **Orthogonal** projection gives a better view when combining the CSG shapes.
de: Das Arbeiten in der **orthogonalen** Projektion bietet eine bessere Sicht beim Kombinieren der CSG-Formen.
zh_cn: 在\ **正交**\ 视角下工作，在组合 CSG 形状时可以得到更好的视图。
zh_tw: 在**正交**視角下工作，在組合 CSG 形狀時可以得到更好的視圖。

source: Our level will contain these objects:
de: Unser Level wird folgende Objekte enthalten:
zh_cn: 我们的关卡将包含以下对象:
zh_tw: 我們的關卡將包含以下物件:

source: a room,
de: einen Raum,
zh_cn: 一个房间,
zh_tw: 一個房間,

source: a bed,
de: ein Bett,
zh_cn: 一张床,
zh_tw: 一張床,

source: a lamp,
de: eine Lampe,
zh_cn: 一盏灯,
zh_tw: 一盞燈,

source: a desk,
de: einen Schreibtisch,
zh_cn: 一张桌子,
zh_tw: 一張桌子,

source: a bookshelf.
de: ein Bücherregal.
zh_cn: 一个书架.
zh_tw: 一個書架.

source: Create a scene with a Node3D node as root node.
de: Erstellen Sie eine Szene mit einem Node3D-Node als Root.
zh_cn: 创建一个以 Node3D 节点作为根节点的场景。
zh_tw: 使用Spatial節點作為根節點建立場景.

source: The default lighting of the environment doesn't provide clear shading at some angles. Change the display mode using **Display Overdraw** in the 3D viewport menu, or add a DirectionalLight node to help you see clearly.
de: Die Default-Beleuchtung der Environment bietet in einigen Winkeln kein klares Shading. Ändern Sie den Anzeigemodus mit **Overdraw-Ansicht** im 3D-Ansichtsfenster-Menü oder fügen Sie einen DirectionalLight-Node hinzu, damit Sie klar sehen können.
zh_cn: 环境的默认光照在某些角度不能提供清晰的阴影。使用 3D 视图菜单中的\ **显示重复绘制**\ 改变显示模式，或者添加一个 DirectionalLight 节点来帮助你清楚看到。
zh_tw: 環境的預設光照在某些角度不能提供清晰的陰影。使用 3D 視圖功能表中的**顯示重複繪製**改變顯示模式，或者新增一個 DirectionalLight 節點來幫助你清楚看到。

source: Create a CSGBox3D and name it ``room``, enable **Invert Faces** and change the dimensions of your room.
de: Erstellen Sie eine CSGBox3D und nennen Sie sie ``room``, aktivieren Sie **Flächen invertieren** und ändern Sie die Abmessungen Ihres Raums.
zh_cn: 创建一个 CSGBox3D 并将其命名为 ``room``\ ，启用 **Invert Faces**\ （反转面）并改变你的房间的大小。
zh_tw: 建立一個 CSGBox 並將其命名為 ``room``，啟用 **Invert Faces**（反轉面）並改變你的房間的大小。

source: Next, create a CSGCombiner3D and name it ``desk``.
de: Erstellen Sie als nächstes einen CSGCombiner3D und nennen Sie ihn ``desk``.
zh_cn: 接下来，创建一个 CSGCombiner3D 并将其命名为 ``desk`` 。
zh_tw: 接下來, 建立一個CSGCombiner並將其命名為 ``desk`` .

source: A desk has one surface and 4 legs:
de: Ein Schreibtisch hat eine Oberfläche und 4 Beine:
zh_cn: 桌子有一个表面和四条腿:
zh_tw: 桌子有一個表面和四條腿:

source: Create 1 CSGBox3D children node in **Union** mode for the surface and adjust the dimensions.
de: Erstellen Sie einen CSGBox3D-Child-Node im **Vereinigung**-Modus für die Oberfläche und passen Sie die Abmessungen an.
zh_cn: 在 **Union** 模式下为曲面创建1个 CSGBox3D 子节点，并调整尺寸。
zh_tw: 在 **Union** 模式下為曲面建立1個CSGBox子節點, 並調整大小.

source: Create 4 CSGBox3D children nodes in **Union** mode for the legs and adjust the dimensions.
de: Erstellen Sie 4 CSGBox3D -Child-Nodes im **Vereinigung**-Modus für die Beine und passen Sie die Abmessungen an.
zh_cn: 在 **Union** 模式下为腿部创建4个 CSGBox3D 子节点并调整尺寸。
zh_tw: 在 **Union** 模式下為腿部建立4個CSGBox子節點並調整大小.

source: Adjust their placement to resemble a desk.
de: Passen Sie ihre Position so an, dass sie einem Schreibtisch ähneln.
zh_cn: 调整它们的摆放位置, 就像一张办公桌.
zh_tw: 調整它們的擺放位置, 就像一張辦公桌.

source: CSG nodes inside a CSGCombiner3D will only process their operation within the combiner. Therefore, CSGCombiner3Ds are used to organize CSG nodes.
de: CSG-Nodes innerhalb eines CSGCombiner3D werden nur innerhalb des Combiners verarbeitet. Daher werden CSGCombiner3Ds verwendet, um CSG-Nodes zu organisieren.
zh_cn: CSGCombiner3D 内的 CSG 节点只会在组合内处理它们的操作。因此，CSGCombiner3D（CSG 组合器）是用来组织 CSG 节点的。
zh_tw: CSG 組合內的 CSG 節點只會在組合內處理它們的操作。因此，CSGCombiner（CSG 組合器）是用來組織 CSG 節點的。

source: Create a CSGCombiner3D and name it ``bed``.
de: Erstellen Sie einen CSGCombiner3D und nennen Sie ihn ``bed``.
zh_cn: 创建一个 CSGCombiner3D，并将其命名为 ``bed`` 。
zh_tw: 建立一個CSGCombiner, 並將其命名為 ``bed`` .

source: Our bed consists of 3 parts: the bed, the mattress and a pillow. Create a CSGBox3D and adjust its dimension for the bed. Create another CSGBox3D and adjust its dimension for the mattress.
de: Unser Bett besteht aus 3 Teilen: dem Bett, der Matratze und einem Kissen. Erstellen Sie eine CSGBox3D und passen Sie ihre Abmessungen für das Bett an. Erstellen Sie eine weitere CSGBox3D und passen Sie deren Abmessungen für die Matratze an.
zh_cn: 我们的床由三部分组成：床，床垫和枕头。创建一个 CSGBox3D 并调整床的尺寸。再创建一个CSGBox3D，并调整床垫的尺寸。
zh_tw: 我們的床由三部群組成: 床, 床墊和枕頭. 建立一個CSGBox並調整床的尺寸. 再建立一個CSGBox, 並調整床墊的尺寸.

source: We will create another CSGCombiner3D named ``pillow`` as the child of ``bed``. The scene tree should look like this:
de: Wir werden einen weiteren CSGCombiner3D namens ``pillow`` als Child-Node von ``bed`` erstellen. Der Szenenbaum sollte folgendermaßen aussehen:
zh_cn: 我们将创建另一个名为 ``pillow`` 的 CSGCombiner3D 作为 ``bed`` 的子节点。场景树应如下所示：
zh_tw: 我們將建立另一個名為 ``pillow`` 的CSGCombiner作為 ``bed`` 的子節點. 場景樹應如下所示:

source: We will combine 3 CSGSphere3D nodes in **Union** mode to form a pillow. Scale the Y axis of the spheres and enable **Smooth Faces**.
de: Wir werden 3 CSGSphere3D-Nodes im **Vereinigung**-Modus zu einem Kissen kombinieren. Skalieren Sie die Y-Achse der Kugeln und aktivieren Sie **Flächen glätten**.
zh_cn: 我们将在 **Union** 模式下组合 3 个 CSGSphere3D 节点，形成一个枕头。缩放球体的 Y 轴并启用 **Smooth Faces**\ （平滑面）。
zh_tw: 我們將在 **Union** 模式下組合 3 個 CSGSphere 節點，形成一個枕頭。縮放球體的 Y 軸並啟用 **Smooth Faces**（平滑面）。

source: Select the ``pillow`` node and switch the mode to **Subtraction**; the combined spheres will cut a hole into the mattress.
de: Wählen Sie den ``pillow``-Node und schalten Sie den Modus auf **Subtraktion**; Die kombinierten Kugeln schneiden ein Loch in die Matratze.
zh_cn: 选择 ``pillow`` 节点，并将模式切换到 **Subtraction**\ ；组合后的球体将在床垫上开一个洞。
zh_tw: 選擇 ``pillow`` 節點，並將模式切換到 **Subtraction**；組合後的球體將在床墊上開一個洞。

source: Try to re-parent the ``pillow`` node to the root ``Node3D`` node; the hole will disappear.
de: Versuchen Sie, den ``pillow``-Node wieder dem Root-Node ``Spatial`` zuzuordnen. Das Loch wird verschwinden.
zh_cn: 试着将 ``pillow`` 节点重新设置为根 ``Node3D`` 节点的父节点；这个洞会消失。
zh_tw: 試著將 ``pillow`` 節點重設你代到根 ``Spatial`` 節點；這個洞會消失。

source: This is to illustrate the effect of CSG processing order. Since the root node is not a CSG node, the CSGCombiner3D nodes are the end of the operations; this shows the use of CSGCombiner3D to organize the CSG scene.
de: Dies soll den Effekt der CSG-Verarbeitungsreihenfolge veranschaulichen. Da der Root-Node kein CSG-Node ist, stellen die CSGCombiner3D-Nodes das Ende der Operationen dar. Dies zeigt die Verwendung von CSGCombiner3D zum Organisieren der CSG-Szene.
zh_cn: 这是为了说明CSG处理顺序的效果。由于根节点不是CSG节点，因此CSGCombiner3D节点是操作的结束；这展示了使用CSGCombiner3D来组织CSG场景。
zh_tw: 這是為了說明CSG處理順序的效果. 由於根節點不是CSG節點, 所以CSGCombiner節點是操作的結束；這顯示了使用CSGCombiner來組織CSG場景.

source: Undo the re-parent after observing the effect. The bed you've built should look like this:
de: Machen Sie die vorhin gemachte Änderung wieder rückgängig, nachdem Sie den Effekt beobachtet haben. Das fertig gebaute Bett sollte nun so aussehen:
zh_cn: 观察效果后，撤消重新选择父节点。你搭建的床应如下所示：
zh_tw: 觀察效果後, 撤銷重新選擇父節點. 您搭建的床應如下所示:

source: Create a CSGCombiner3D and name it ``lamp``.
de: Erstellen Sie einen CSGCombiner3D und nennen Sie ihn ``lamp``.
zh_cn: 创建一个CSGCombiner3D，并将其命名为 ``lamp`` 。
zh_tw: 建立一個CSGCombiner, 並將其命名為 ``lamp`` .

source: A lamp consists of 3 parts: the stand, the pole and the lampshade. Create a CSGCylinder3D, enable the **Cone** option and make it the stand. Create another CSGCylinder3D and adjust the dimensions to use it as a pole.
de: Eine Lampe besteht aus 3 Teilen: dem Ständer, der Stange und dem Lampenschirm. Erstellen Sie einen CSGCylinder3D, aktivieren Sie die Option **Zylinder** und machen Sie ihn zum Ständer. Erstellen Sie einen weiteren CSGCylinder3D und passen Sie die Abmessungen an, um ihn als Stange zu verwenden.
zh_cn: 一盏灯由三部分组成：灯座、灯杆和灯罩。创建一个 CSGCylinder3D，启用 **Cone** 选项并使其成为支架。创建另一个 CSGCylinder3D 并调整尺寸，将其用作灯杆使用。
zh_tw: 一盞燈由3部群組成: 支架, 燈杆和燈罩. 建立一個CSGCylinder, 啟用 **Cone** 選項並將其作為支架. 再建立一個CSGCylinder, 並調整尺寸, 將其作為燈杆使用.

source: We will use a CSGPolygon3D for the lampshade. Use the **Spin** mode for the CSGPolygon3D and draw a `trapezoid <https://en.wikipedia.org/wiki/Trapezoid>`_ while in **Front View** (numeric keypad 1); this shape will extrude around the origin and form the lampshade.
de: Wir werden ein CSGPolygon3D für den Lampenschirm verwenden. Verwenden Sie den **Spin**-Modus für das CSGPolygon und zeichnen Sie ein `Trapez <https://en.wikipedia.org/wiki/Trapezoid>`_ in **Sicht von vorne** (Ziffernblock 1); Diese Geometrie-Form wird um den Ursprung herum extrudiert und bildet den Lampenschirm.
zh_cn: 我们将使用 CSGPolygon3D 来制作灯罩。使用CSGPolygon3D 的 **Spin** 模式，在\ **前视图**\ （小键盘 1）下绘制一个\ `梯形 <https://zh.wikipedia.org/wiki/%E6%A2%AF%E5%BD%A2>`_\ ，这个形状将围绕原点挤出，形成灯罩。
zh_tw: 我們將使用 CSGPolygon 來製作燈罩。使用 **Spin** 模式，在**前視圖**（小鍵盤 1）下繪製一個`梯形 <https://zh.wikipedia.org/wiki/%E6%A2%AF%E5%BD%A2>`_，這個形狀將圍繞原點擠出，形成燈罩。

source: Adjust the placement of the 3 parts to make it look like a lamp.
de: Passen Sie die Platzierung der 3 Teile so an, dass sie wie eine Lampe aussehen.
zh_cn: 调整3个部分的位置，使其看起来像一盏灯。
zh_tw: 調整3個部分的位置, 使其看起來像一盞燈.

source: Create a CSGCombiner3D and name it ``bookshelf``.
de: Erstellen Sie einen CSGCombiner3D und nennen Sie ihn ``bookshelf``.
zh_cn: 创建一个CSGCombiner3D，并将其命名为 ``bookshelf`` 。
zh_tw: 建立一個CSGCombiner, 並將其命名為 ``bookshelf`` .

source: We will use 3 CSGBox3D nodes for the bookshelf. Create a CSGBox3D and adjust its dimensions; this will be the size of the bookshelf.
de: Wir werden 3 CSGBox3D-Nodes für das Bücherregal verwenden. Erstellen Sie eine CSGBox3D und passen Sie ihre Abmessungen an. Dies ist die Größe des Bücherregals.
zh_cn: 我们将为书架使用3个 CSGBox3D 节点。创建一个 CSGBox3D 并调整其大小，这将是书架的尺寸。
zh_tw: 我們將為書架使用3個CSGBox節點. 建立一個CSGBox並調整其大小, 這將是書架的尺寸.

source: Duplicate the CSGBox3D and shorten the dimensions of each axis and change the mode to **Subtraction**.
de: Duplizieren Sie die CSGBox3D, kürzen Sie die Abmessungen jeder Achse und ändern Sie den Modus in **Subtraktion**.
zh_cn: 复制 CSGBox3D 并缩短每个轴的尺寸，并将模式改为 **Subtraction**\ （减去）。
zh_tw: 複製 CSGBox 並縮短每個軸的尺寸，並將模式改為 **Subtraction**（減去）。

source: You've almost built a shelf. Create one more CSGBox3D for dividing the shelf into two levels.
de: Sie haben fast ein Regal gebaut. Erstellen Sie eine weitere CSGBox3D, um das Regal in zwei Ebenen zu unterteilen.
zh_cn: 你几乎已经建立了一个架子。再创建一个 CSGBox3D，把架子分成两层。
zh_tw: 你幾乎已經建立了一個架子. 再建立一個CSGBox, 把架子分成兩層.

source: Position your furniture in your room as you like and your scene should look this:
de: Positionieren Sie die Möbel im Raum wie Sie möchten und die Szene sollte wie folgt aussehen:
zh_cn: 根据你的喜好将你的家具放在房间里，你的场景应该是这样的：
zh_tw: 根據您的喜好將您的傢俱放在房間裡, 您的場景應該是這樣的:

source: You've successfully prototyped a room level with the CSG tools in Godot. CSG tools can be used for designing all kinds of levels, such as a maze or a city; explore its limitations when designing your game.
de: Sie haben mit den CSG-Tools in Godot erfolgreich einen Raum-Level als Prototyp erstellt. CSG-Tools können zum Entwerfen aller Arten von Leveln verwendet werden, z.B. eines Labyrinths oder einer Stadt. Erkunden Sie die Grenzen dieser Methode beim Entwerfen Ihres Spiels.
zh_cn: 你已经成功地用 Godot 中的 CSG 工具制作了一个房间关卡的原型。CSG工具可以用于设计各种类型的关卡，如迷宫或城市；在设计游戏时探究它的局限性。
zh_tw: 你已經成功地用Godot中的CSG工具製作了一個房間關卡的原型.CSG工具可以用於設計各種型別的關卡, 如迷宮或城市；在設計遊戲時探究它的局限性.

source: Using prototype textures
de: Verwenden von Prototyp-Texturen
zh_cn: 使用原型纹理
zh_tw: 使用原型紋理

source: Godot's :ref:`doc_standard_material_3d` supports *triplanar mapping*, which can be used to automatically apply a texture to arbitrary objects without distortion. This is handy when using CSG as Godot doesn't support editing UV maps on CSG nodes yet. Triplanar mapping is relatively slow, which usually restricts its usage to organic surfaces like terrain. Still, when prototyping, it can be used to quickly apply textures to CSG-based levels.
de: Godot's :ref:`doc_standard_material_3d` unterstützt *Triplanares Mapping*, welches verwendet werden kann, um automatisch eine Textur auf beliebige Objekte ohne Verzerrung anzuwenden. Dies ist praktisch, wenn man CSG benutzt, da Godot noch nicht die Bearbeitung von UV-Maps auf CSG-Nodes unterstützt. Triplanares Mapping ist relativ langsam, was seine Verwendung normalerweise auf organische Oberflächen wie Gelände beschränkt. Dennoch kann es beim Prototyping verwendet werden, um schnell Texturen auf CSG-basierte Ebenen anzuwenden.
zh_cn: Godot的 :ref:`doc_standard_material_3d` 支持 *triplanar mapping* （三平面映射）, 可用于自动将纹理应用到任意对象而不失真。使用 CSG 时这很方便，因为 Godot 尚不支持在 CSG 节点上编辑 UV 贴图。三平面映射相对较慢，这通常限制其在地形等有机表面上的使用。尽管如此，在制作原型时，它仍可用于快速将纹理应用到基于 CSG 的关卡。
zh_tw: Godot的 :ref:`doc_spatial_material` 支援*triplanar mapping*, 它可以用來自動將紋理應用到任意物件上, 而不會發生變形. 這在使用CSG時很方便, 因為Godot還不支援在CSG節點上編輯UV貼圖. 三面貼圖的速度相對較慢, 這通常限制了它的使用, 比如地形等有機表面. 不過, 在原型設計時, 還是可以用它來快速將紋理應用到基於CSG的關卡上. (CSG: 建構實體幾何(Constructive Solid Geometry)的簡寫).

source: If you need some textures for prototyping, Kenney made a `set of CC0-licensed prototype textures <https://kenney.nl/assets/prototype-textures>`__.
de: Wenn Sie einige Texturen für das Prototyping benötigen, hat Kenney eine `Reihe von CC0-lizenzierten Prototyp-Texturen erstellt <https://kenney.nl/assets/prototype-textures>`__.
zh_cn: 如果你需要一些原型的图片,Kenney做了一套 `CC0授权的原型图片 <https://kenney.nl/assets/prototype-textures>`__.
zh_tw: 如果你需要一些原型的圖片,Kenney做了一套 `CC0授權的原型圖片 <https://kenney.nl/assets/prototype-textures>`__.

source: There are two ways to apply a material to a CSG node:
de: Es gibt zwei Möglichkeiten, ein Material auf einen CSG-Node anzuwenden:
zh_cn: 有两种方法可以将材质应用到CSG节点:
zh_tw: Godot 沒有使用限制

source: Applying it to a CSGCombiner3D node as a material override (**Geometry > Material Override** in the Inspector). This will affect its children automatically, but will make it impossible to change the material in individual children.
de: Anwenden auf einen CSGCombiner3D-Node als Materialüberschreibung (**Geometrie > Materialüberschreibung** im Inspektor). Dies wirkt sich automatisch auf die Child-Nodes aus, macht es jedoch unmöglich, das Material bei einzelnen Child-Nodes zu ändern.
zh_cn: 将其作为材质覆盖应用到 CSGCombiner3D 节点上（在检查器中的 **Geometry > Material Override** ），这将自动影响它的子节点，但能改变单个子节点的材质。
zh_tw: 將其作為材質覆蓋應用到CSGCombiner節點上(在屬性面板中的 **Geometry > Material Override** ). 這將自動影響它的子節點, 但能改變單個子節點的材質.
