Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/csg_tools.po
Languages: de, zh_cn, zh_tw

source: Applying a material to individual nodes (**Material** in the Inspector). This way, each CSG node can have its own appearance. Subtractive CSG nodes will apply their material to the nodes they're "digging" into.
de: Anwenden eines Materials auf einzelne Nodes (**Material** im Inspektor). Auf diese Weise kann jeder CSG-Node sein eigenes Erscheinungsbild haben. Subtraktive CSG-Nodes wenden ihr Material auf die Nodes an, in die sie eindringen.
zh_cn: 将材质应用于单个节点( **材质** 在(属性)检查器中). 这样, 每个CSG节点都可以有自己的外观. 减去CSG节点将把它们的材质应用到 "digging" 到的节点上.
zh_tw: 將材質應用於單個節點( **材質** 在(屬性)屬性面板中). 這樣, 每個CSG節點都可以有自己的外觀. 減去CSG節點將把它們的材質應用到 "digging" 到的節點上.

source: To apply triplanar mapping to a CSG node, select it, go to the Inspector, click the **[empty]** text next to **Material Override** (or **Material** for individual CSG nodes). Choose **New StandardMaterial3D**. Click the newly created material's icon to edit it. Unfold the **Albedo** section and load a texture into the **Texture** property. Now, unfold the **Uv1** section and check **Triplanar**. You can change the texture offset and scale on each axis by playing with the **Scale** and **Offset** properties just above. Higher values in the **Scale** property will cause the texture to repeat more often.
de: Um triplanares Mapping auf einen CSG-Node anzuwenden, wählen Sie ihn aus, gehen Sie zum Inspektor und klicken Sie auf den **[leer]** Text neben **Materialüberschreibung** (oder **Material** für einzelne CSG-Nodes). Wählen Sie **Neues StandardMaterial3D**. Klicken Sie auf das Symbol des neu erstellten Materials, um es zu bearbeiten. Klappen Sie den Abschnitt **Albedo** aus und laden Sie eine Textur in die **Textur**-Property. Klappen Sie nun den Abschnitt **Uv1** aus und aktivieren Sie **Triplanar**. Sie können den Versatz und die Skalierung der Textur entlang jeder Achse ändern, indem Sie mit den Propertys **Skalierung** und **Versatz** herumspielen (siehe oben). Höhere Werte in der Property **Skalierung** führen dazu, dass die Textur häufiger wiederholt wird.
zh_cn: 要将三平面映射应用到 CSG 节点，请选中它，转到“检查器”，单击 **Material Override**\ （材质覆盖）旁的 **[空]** 字样（如果是单独的 CSG 节点则为 **Material**\ ）。选择\ **新建 SpatialMaterial3D**\ 。点击刚创建出来的材质图标来进行编辑。展开 **Albedo** 部分，为 **Texture** 属性加载一张纹理。现在再展开 **Uv1** 部分，勾选 **Triplanar**\ 。可以用上面的 **Scale** 和 **Offset** 属性来调整纹理在各个方向上的缩放和偏移量。\ **Scale** 属性越大，纹理重复得越多。
zh_tw: 要將三平面貼圖應用到 CSG 節點，請選中它，轉到“屬性面板”，按一下 **Material Override**（材質覆蓋）旁的 **[空]** 字樣（如果是單獨的 CSG 節點則為 **Material**）。選擇**新建 SpatialMaterial**。點擊剛建立出來的材質圖示來進行編輯。展開 **Albedo** 部分，為 **Texture** 屬性載入一張紋理。現在再展開 **Uv1** 部分，勾選 **Triplanar**。可以用上面的 **Scale** 和 **Offset** 屬性來調整紋理在各個方向上的縮放和偏移量。**Scale** 屬性越大，紋理重複得越多。

source: You can copy a StandardMaterial3D to reuse it across CSG nodes. To do so, click the dropdown arrow next to a material property in the Inspector and choose **Copy**. To paste it, select the node you'd like to apply the material onto, click the dropdown arrow next to its material property then choose **Paste**.
de: Sie können ein StandardMaterial3D kopieren, um es über CSG-Nodes hinweg wiederzuverwenden. Klicken Sie dazu im Inspektor auf den Dropdown-Pfeil neben einer Material-Property und wählen Sie **Kopieren**. Um es einzufügen wählen Sie den Node aus, auf den Sie das Material anwenden möchten, klicken Sie auf den Dropdown-Pfeil neben seiner Material-Property und wählen Sie dann **Einfügen**.
zh_cn: 你可以复制一个 SpatialMaterial3D，以便在 CSG 节点中重复使用它。要做到这一点，在（属性）检查器中点击材质属性旁边的下拉箭头，然后选择 **复制** 。 要粘贴它，请选择要应用该材质的节点，单击其材质属性旁边的下拉箭头，然后选择 **粘贴** 。
zh_tw: 您可以複製一個 SpatialMaterial, 以便在 CSG 節點中重複使用它. 要做到這一點, 在(屬性)屬性面板中點擊材質屬性旁邊的下拉箭頭, 然後選擇 **複製** . 要貼上它, 請選擇您要應用該材質的節點, 按一下其材質屬性旁邊的下拉箭頭, 然後選擇 **貼上** .

source: Exporting as glTF
de: Exportieren als glTF
zh_cn: 导出为 glTF
zh_tw: 匯出陣列

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: CSG stands for **Constructive Solid Geometry**, and is a tool to combine basic shapes or custom meshes to create more complex shapes. In 3D modeling software, CSG is mostly known as "Boolean Operators".
de: CSG steht für **Constructive Solid Geometry** (konstruktive Festkörpergeometrie), und ist ein Werkzeug zum Kombinieren von Grundformen oder benutzerdefinierten Meshes, um komplexere Formen zu erstellen. In 3D-Modellierungssoftware wird CSG hauptsächlich als "Boolesche Operatoren" bezeichnet.
zh_cn: CSG 是 **Constructive Solid Geometry**\ （构造实体几何）的缩写，是一种将基本形状或自定义网格组合起来以创建更复杂形状的工具。在三维建模软件中，CSG 多被称为“布尔运算符”。

source: Any mesh can be used for :ref:`CSGMesh3D <class_CSGMesh3D>`; the mesh can be modeled in other software and imported into Godot. Multiple materials are supported. There are some restrictions for geometry:
de: Jedes Mesh kann für :ref:`CSGMesh3D <class_CSGMesh3D>` verwendet werden; das Mesh kann in anderer Software modelliert und in Godot importiert werden. Es werden mehrere Materialien unterstützt. Es gibt einige Einschränkungen für die Geometrie:
zh_cn: 任何网格都可以用于 :ref:`CSGMesh3D <class_CSGMesh3D>`，网格可以在其他软件中建模并导入Godot。支持多种材质。对几何体有一些限制：

source: It can be useful to block out a level using CSG, then export it as a 3d model, to import into 3D modeling software. You can do this by selecting **Scene > Export As... > glTF 2.0 Scene**.
de: Es kann nützlich sein, einen Level mit CSG grob zu beschreiben und ihn dann als 3D-Modell zu exportieren, um ihn in eine 3D-Modellierungssoftware zu importieren. Sie können dies tun, indem Sie **Szene > Exportieren als... > glTF 2.0-Szene**.
zh_cn: 使用 CSG 绘制关卡，然后将其导出为 3D 模型，以导入到 3D 建模软件中，这是非常有用的工作流程。你可以通过选择 **场景 > 导出为...> glTF 2.0 场景** 来执行此操作。
