Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: de, zh_cn

source: There are 2 ways to use glow in 2D:
de: Es gibt 2 Möglichkeiten, Glow in 2D zu verwenden:
zh_cn: 在 2D 中使用辉光有两种方法：

source: Since Godot 4.2, you can enable HDR for 2D rendering when using the Forward+ and Mobile rendering methods. This has a performance cost, but it allows for a greater dynamic range. This also allows you to control which objects glow using their individual **Modulate** or **Self Modulate** properties (use the RAW mode in the color picker). Enabling HDR can also reduce banding in the 2D rendering output.
de: Seit Godot 4.2 können Sie HDR für das 2D-Rendering aktivieren, wenn Sie die Rendering-Methoden Forward+ und Mobile verwenden. Dies geht zwar zu Lasten der Performance, ermöglicht aber einen größeren Dynamikbereich. Außerdem können Sie so steuern, welche Objekte mit ihren individuellen **Modulieren**- oder **Selbstmodulieren**-Propertys mittels Glow leuchten (verwenden Sie den RAW-Modus in der Farbauswahl). Die Aktivierung von HDR kann auch die Streifenbildung in der 2D-Rendering-Ausgabe reduzieren.
zh_cn: 从 Godot 4.2 开始，你可以在使用 Forward+ 和移动渲染方法时，启用 HDR 进行 2D 渲染。这会产生一定的性能损耗，但也会带来更大的动态范围。HDR 还可以让你通过使用各自的 **Modulate** （调制） 或 **Self Modulate** （自调制） 属性，来控制哪些对象产生辉光（在颜色选择器中使用 RAW 模式）。启用 HDR 还可以减少 2D 渲染输出中的条带。

source: To enable HDR in 2D, open the Project Settings, enable **Rendering > Viewport > HDR 2D** then restart the editor.
de: Um HDR in 2D zu aktivieren, öffnen Sie die Projekteinstellungen, aktivieren Sie **Rendern > Viewport > HDR 2D** und starten Sie den Editor neu.
zh_cn: 要在 2D 中启用 HDR，请打开项目设置，启用 **渲染 > 视口 > HDR 2D** ，然后重新启动编辑器。

source: If you want to maximize performance, you can leave HDR disabled for 2D rendering. However, you will have less control on which objects glow.
de: Wenn Sie die Performance maximieren möchten, können Sie HDR für das 2D-Rendering deaktiviert lassen. Allerdings haben Sie dann weniger Kontrolle darüber, welche Objekte mit Glow leuchten.
zh_cn: 如果你想最大限度地提高性能，可以禁用 HDR 进行 2D 渲染。但是这会减少你物体辉光的控制。

source: Enable glow, set the environment background mode to **Canvas** then decrease **Glow HDR Threshold** so that pixels that are not overbright will still glow. To prevent UI elements from glowing, make them children of a :ref:`class_CanvasLayer` node. You can control which layers are affected by glow using the **Background > Canvas Max Layer** property of the Environment resource.
de: Aktivieren Sie Glow, setzen Sie den Environment-Hintergrundmodus auf **Canvas** und verringern Sie die **Glow HDR Schwelle**, so dass Pixel, die nicht zu hell sind, trotzdem leuchten. Um Glow von UI-Elementen zu verhindern, machen Sie sie zu Child-Nodes eines Nodes :ref:`class_CanvasLayer`. Mit der Property **Hintergrund > Max. Canvas-Ebene** der Environment-Ressource können Sie steuern, welche Ebenen vom Glow betroffen sind.
zh_cn: 启用辉光，将环境背景模式设置为 **Canvas** ，然后降低 **Glow** 中的 **HDR Threshold** （HDR 阈值），以便不是过亮的像素仍然会发出辉光。为了防止 UI 元素产生辉光，请将它们设为 :ref:`class_CanvasLayer` 节点的子节点。你可以使用环境资源的 **Background > Canvas Max Layer** 属性来控制哪些层受辉光影响。

source: Example of using glow in a 2D scene
de: Beispiel für die Verwendung von Glow in einer 2D-Szene
zh_cn: 在 2D 场景中使用辉光的示例

source: Example of using glow in a 2D scene. HDR 2D is enabled, while coins and the bullet have their **Modulate** property increased to overbright values using the RAW mode in the color picker.
de: Beispiel für die Verwendung von Glow in einer 2D-Szene. HDR 2D ist aktiviert, und die **Modulieren**-Property der Münzen und der Kugel wurde mithilfe des RAW-Modus in der Farbpalette auf überhelle Werte erhöht.
zh_cn: 在 2D 场景中使用辉光的示例。 已启用 HDR 2D，而硬币和子弹的 **Modulate** 属性使用颜色选择器中的 RAW 模式增加到过亮的值。

source: The 2D renderer renders in linear color space if the **Rendering > Viewport > HDR 2D** project setting is enabled, so ``source_color`` must also be used for uniform samplers that are used as color input in ``canvas_item`` shaders. If this is not done, the texture will appear washed out.
de: Der 2D-Renderer rendert im linearen Farbraum, wenn die Projekteinstellung **Rendern > Viewport > HDR 2D** aktiviert ist. Daher muss ``source_color`` auch für Uniform-Sampler verwendet werden, die als Farbeingabe in ``canvas_item``-Shadern eingesetzt werden. Wenn dies nicht gemacht wird, wird die Textur verwaschen erscheinen.
zh_cn: 如果启用了 **Rendering > Viewport > HDR 2D** 项目设置，2D 渲染器将在线性颜色空间中渲染，因此 ``source_color`` 也必须用于在 ``canvas_item`` 中用作颜色输入的统一采样器着色器。如果不这样做，纹理就会显得很淡。

source: If 2D HDR is disabled, ``source_color`` will keep working correctly in ``canvas_item`` shaders, so it's recommend to use it when relevant either way.
de: Wenn 2D HDR deaktiviert ist, wird ``source_color`` weiterhin korrekt in ``canvas_item``-Shadern funktionieren, daher ist es empfehlenswert, es so oder so zu verwenden, wenn es relevant ist.
zh_cn: 如果禁用了 2D HDR， ``source_color`` 将在 ``canvas_item`` 着色器中保持正常工作，因此，建议你的工作与之相关时使用它。

source: Using glow to blur the screen
de: Verwischen des Bildschirms mit Glow
zh_cn: 使用辉光来使屏幕模糊

source: Glow can be used to blur the whole viewport, which is useful for background blur when a menu is open. Only 3D rendering will be affected unless the environment's background mode is set to **Canvas**. To prevent UI elements from being blurred when using the Canvas background mode, make them children of a :ref:`class_CanvasLayer` node. You can control which layers are affected by this blurring effect using the **Background > Canvas Max Layer** property of the Environment resource.
de: Glow kann verwendet werden, um den gesamten Viewport unscharf zu machen, was für die Hintergrundunschärfe nützlich ist, wenn ein Menü geöffnet ist. Nur das 3D-Rendering wird davon betroffen sein, es sei denn, der Hintergrundmodus der Environment ist auf **Canvas** eingestellt. Um zu verhindern, dass UI-Elemente bei Verwendung des Canvas-Hintergrundmodus unscharf werden, machen Sie sie zu Child-Nodes eines :ref:`class_CanvasLayer`-Nodes. Mit der Property **Hintergrund > Max. Canvas-Ebene** der Environment-Ressource können Sie steuern, welche Ebenen von diesem Unschärfeeffekt betroffen sind.
zh_cn: 辉光可用于模糊整个视口，对于打开菜单时的背景模糊来说这个功能就很有用。除非你将环境的背景模式设置为 **Canvas** ，否则只有 3D 渲染会受到影响。为了防止 UI 元素在使用 Canvas 背景模式时变得模糊，请将它们设为 :ref:`class_CanvasLayer` 节点的子节点。你可以使用 Environment 资源的 **Background > Canvas Max Layer** 属性来控制哪些层受此模糊效果影响。

source: To use glow as a blurring solution:
de: Glow als Blur-Lösung verwenden:
zh_cn: 要使用辉光光作为一种模糊效果解决方案：

source: Enable **Normalized** and adjust levels according to preference. Increasing higher level indices will result in a more blurred image. It's recommended to leave a single glow level at ``1.0`` and leave all other glow levels at ``0.0``, but this is not required. Note that the final appearance will vary depending on viewport resolution.
de: Aktivieren Sie **Normalisiert** und passen Sie die Werte nach Ihren Wünschen an. Je höher der Level-Index, desto unschärfer das Bild. Es wird empfohlen, einen einzelnen Glow-Level auf ``1.0`` zu belassen und alle anderen Glow-Level auf ``0.0`` zu belassen, aber dies ist nicht erforderlich. Beachten Sie, dass das endgültige Aussehen von der Auflösung des Ansichtsfensters abhängt.
zh_cn: 启用 **归一化** 并根据你的需要调整辉光等级。增加更高等级的索引将导致图像更模糊。建议将单个辉光等级设置为 ``1.0`` ，并将所有其他辉光等级保留为 ``0.0`` ，不过这不是必需设置。请注意，最终外观将根据视口分辨率而有所不同。

source: Set **Intensity** to ``1.0`` and **Bloom** to ``1.0``.
de: Setzen Sie **Intensität** auf ``1.0`` und **Bloom** auf ``1.0``.
zh_cn: 将 **Intensity** 设置为 ``1.0`` ，并将 **Bloom** 设置为 ``1.0`` 。

source: Set the blend mode to **Replace** and **HDR Luminance Cap** to ``1.0``.
de: Setzen Sie den Blending-Modus auf **Ersetzen** und **HDR-Luminanzobergrenze** auf ``1,0``.
zh_cn: 将 Blend Mode （混合模式）设置为 **Replaced** ，并将 **HDR Luminance Cap** （HDR 亮度上限）设置为 ``1.0`` 。

source: Example of using glow to blur the 2D rendering in the menu's background
de: Beispiel für die Verwendung von Glow, um das 2D-Rendering im Hintergrund des Menüs zu verwischen
zh_cn: 使用辉光来模糊菜单背景中的 2D 渲染的示例

source: Adjustments
de: Anpassungen
zh_cn: 调整

source: At the end of processing, Godot offers the possibility to do some standard image adjustments.
de: Am Ende der Verarbeitung bietet Godot die Möglichkeit, einige Default-Bildanpassungen vorzunehmen.
zh_cn: 在处理结束时,Godot提供了进行一些标准图像调整的可能性.

source: **Basic BCS adjustments**
de: **Grundlegende BCS-Anpassungen**
zh_cn: **基本 BCS 调整**

source: The first adjustment is being able to change the typical **Brightness**, **Contrast**, and **Saturation** properties:
de: Die erste Anpassung ist die Möglichkeit, die üblichen Eigenschaften **Helligkeit**, **Kontrast** und **Sättigung** (Brightness, Contrast, Saturation oder kurz BCS) zu ändern:
zh_cn: 第一项调整是能够更改典型的 **Brightness** （亮度） 、 **Contrast** （对比度） 和 **Saturation** （饱和度）属性：

source: **Color correction using a 1D gradient**
de: **Farbkorrektur unter Verwendung eines 1D-Farbgradienten**
zh_cn: **使用一维渐变进行颜色校正**

source: The second adjustment is by supplying a color correction gradient. This can be done by assigning a GradientTexture1D resource to the **Color Correction** property, or by loading a texture containing a horizontal gradient. The leftmost part of the gradient represents black in the source image, whereas the rightmost part of the gradient represents white in the source image.
de: Die zweite Anpassung erfolgt durch die Bereitstellung eines Farbkorrekturgradienten. Dazu kann der Property **Farbkorrektur** eine GradientTexture1D-Ressource zugewiesen oder eine Textur mit einem horizontalen Farbgradienten geladen werden. Der linke Teil des Farbgradienten steht für Schwarz im Quellbild, während der rechte Teil des Farbgradienten für Weiß im Quellbild steht.
zh_cn: 第二项调整是通过提供颜色校正梯度。 这可以通过将 GradientTexture1D 资源分配给 **Color Correction** （颜色较准）属性，或通过加载包含水平渐变的纹理来完成。 渐变的最左边部分代表源图像中的黑色，而渐变的最右边部分代表源图像中的白色。

source: A linear black-to-white gradient like the following one will produce no effect:
de: Ein linearer Schwarz-Weiß-Gradient wie der folgende hat keine Wirkung:
zh_cn: 如下所示的线性黑色渐变将不起作用：

source: But creating custom ones will allow to map each channel to a different color:
de: Die Erstellung von benutzerdefinierten Gradienten ermöglicht es jedoch, jedem Farbkanal eine andere Farbe zuzuordnen:
zh_cn: 但是创建自定义的会允许将每个通道映射到不同的颜色:

source: **Color correction using a 3D LUT**
de: **Farbkorrektur mit einer 3D-LUT**
zh_cn: **使用 3D LUT 进行颜色校正**

source: A 3D look-up-texture (LUT) can also be used for color correction. This is a special texture used to modify each color channel separately from one another (red, green, blue). This image can be of any resolution, but since color correction is low-frequency data, sticking to low resolutions is recommended for performance reasons. A LUT texture's resolution is typically 17×17×17, 33×33×33, 51×51×51 or 65×65×65 (the odd size allows for better interpolation).
de: Zur Farbkorrektur kann auch eine 3D-Look-up-Textur (LUT) verwendet werden. Dabei handelt es sich um eine spezielle Textur, mit der die einzelnen Farbkanäle (rot, grün, blau) getrennt voneinander verändert werden können. Dieses Bild kann eine beliebige Auflösung haben, aber da es sich bei der Farbkorrektur um niederfrequente Daten handelt, wird aus Performance-Gründen empfohlen, bei niedrigen Auflösungen zu bleiben. Die Auflösung einer LUT-Textur beträgt normalerweise 17×17×17, 33×33×33, 51×51×51 oder 65×65×65 (die ungerade Größe ermöglicht eine bessere Interpolation).
zh_cn: 3D 查找纹理 (LUT) 也可用于色彩校正。 这是一种特殊的纹理，用于单独修改每个颜色通道（红色、绿色、蓝色）。 该图像可以是任何分辨率，但由于颜色校正是低频数据，出于性能原因，建议坚持使用低分辨率。 LUT 纹理的分辨率通常为 17×17×17、33×33×33、51×51×51 或 65×65×65（奇数尺寸允许更好的插值）。

source: For this to work, the look-up texture's import mode must be set to Texture3D in the Import dock (instead of being imported as a regular Texture2D):
de: Damit dies funktioniert, muss der Importmodus der Look-up-Textur im Import-Dock auf Texture3D gesetzt werden (anstatt als normale Texture2D importiert zu werden):
zh_cn: 为此，查找纹理的导入模式必须在导入坞中设置为Texture3D（而不是作为常规Texture2D导入）：

source: Make sure to configure the number of horizontal and vertical slices to import as well. If you don't do this, the LUT texture will not affect the viewport correctly when used. You can preview how the 3D texture was imported by double-clicking it, in the FileSystem dock, then going to the inspector to flip through the texture's layers.
de: Stellen Sie sicher, dass Sie auch die Anzahl der zu importierenden horizontalen und vertikalen Slices konfigurieren. Wenn Sie dies nicht tun, wirkt sich die LUT-Textur bei der Verwendung nicht korrekt auf den Viewport aus. Sie können in der Vorschau sehen, wie die 3D-Textur importiert wurde, indem Sie im Dateisystem-Dock darauf doppelklicken und dann den Inspektor aufrufen, um die Ebenen der Textur durchzublättern.
zh_cn: 确保同时配置要导入的水平和垂直切片的数量。 如果不这样做，LUT 纹理在使用时将不会正确影响视口。 辉光可以通过在文件系统面板中双击 3D 纹理来预览如何导入 3D 纹理，然后转到检查器以翻转纹理的图层。

source: You can use this neutral 33×33×33 LUT template as a base (right-click and choose **Save as…**):
de: Sie können diese neutrale 33×33×33 LUT-Vorlage als Basis verwenden (klicken Sie mit der rechten Maustaste und wählen Sie **Speichern unter...**):
zh_cn: 你可以使用这个中性 33×33×33 LUT 模板作为基础（右键单击并选择 **另存为...(Save as...)** ）：

source: With the above LUT template, after changing its import mode to **Texture3D**, set its number of **Horizontal** slices to ``33`` in the Import dock then click **Reimport**. If you load this LUT into the **Color Correction** property, you won't see any visible difference for now since this texture is designed to be a neutral starting point.
de: Nachdem Sie den Importmodus der obigen LUT-Vorlage auf **Textur3D** geändert haben, setzen Sie die Anzahl der **Horizontal**-Slices im Import-Dock auf ``33`` und klicken Sie auf **Neuimport**. Wenn Sie diese LUT in die Property **Farbkorrektur** laden, werden Sie zunächst keinen sichtbaren Unterschied feststellen, da diese Textur als neutraler Ausgangspunkt gedacht ist.
zh_cn: 使用上述 LUT 模板，将其导入模式更改为 **Texture3D** 后，在导入面板中将其 **Horizontal** 切片数量设置为 ``33`` ，然后单击 **重新导入** 。 如果将此 LUT 加载到 **颜色校正** 属性中，你现在不会看到任何明显的差异，因为该纹理被设计为中性起点。

source: This LUT template can be modified in an image editor to provide a different mood to the image. A common workflow is to place the LUT image next to a screenshot of the project's 3D viewport, then use an image editor to modify both the LUT image and the screenshot at the same time. The LUT can then be saved and applied to the game engine to perform the same color correction in real-time.
de: Diese LUT-Vorlage kann in einem Bildbearbeitungsprogramm geändert werden, um dem Bild eine andere Stimmung zu verleihen. Ein üblicher Workflow besteht darin, das LUT-Bild neben einem Screenshot des 3D-Ansichtsfensters des Projekts zu platzieren und dann einen Bildeditor zu verwenden, um sowohl das LUT-Bild als auch den Screenshot gleichzeitig zu ändern. Die LUT kann dann gespeichert und auf die Spiel-Engine angewendet werden, um die gleiche Farbkorrektur in Echtzeit durchzuführen.
zh_cn: 可以在图像编辑器中修改此 LUT 模板，以为图像提供不同的氛围。 常见的工作流程是将 LUT 图像放置在项目 3D 视口的屏幕截图旁边，然后使用图像编辑器同时修改 LUT 图像和屏幕截图。 然后可以保存 LUT 并将其应用到游戏引擎，以实时执行相同的色彩校正。

source: For example, modifying the LUT template in an image editor to give it a "sepia" look results in the image on the right:
de: Wenn Sie z.B. die LUT-Vorlage in einem Bildbearbeitungsprogramm ändern, um ihr einen "Sepia"-Look zu verleihen, erhalten Sie das rechts abgebildete Bild:
zh_cn: 例如，在图像编辑器中修改 LUT 模板以使其呈现“棕褐色”外观，结果如下图所示：

source: Adjustments and color correction are applied *after* tonemapping. This means the tonemapping properties defined above still have an effect when adjustments are enabled.
de: Anpassungen und Farbkorrekturen werden *nach* dem Tonemapping angewendet. Das bedeutet, dass die oben definierten Tonemapping-Propertys auch bei aktivierten Anpassungen wirksam sind.
zh_cn: 调整和色彩校正在色调映射 *之后* 应用。 这意味着上面定义的色调映射属性在启用调整时仍然有效。

source: Camera attribute options
de: Optionen für Kamera-Attribute
zh_cn: 相机属性选项

source: Depth of Field / Far Blur
de: Schärfentiefe / Fernunschärfe
zh_cn: 景深/远模糊

source: This effect simulates focal distance on cameras. It blurs objects behind a given range. It has an initial **Distance** with a **Transition** region (in world units):
de: Dieser Effekt simuliert die Brennweite von Kameras. Er macht Objekte hinter einem bestimmten Bereich unscharf. Er hat eine anfänglichen **Distanz** mit einem **Übergangsbereich** (in Welteinheiten):
zh_cn: 此效果可模拟高端相机的焦距。它模糊了给定范围后面的物体。它有一个 **距离** ， **过渡** 区域（世界单位）：

source: The **Amount** parameter controls the amount of blur. For larger blurs, tweaking the depth of field quality in the advanced project settings may be needed to avoid artifacts.
de: Der Parameter **Menge** steuert die Stärke der Unschärfe. Bei größeren Unschärfen kann es erforderlich sein, die Qualität der Schärfentiefe in den erweiterten Projekteinstellungen zu optimieren, um Artefakte zu vermeiden.
zh_cn: **Amount** 参数控制模糊量。对于较大的模糊，可能需要在高级项目设置中调整景深质量以避免伪影。

source: Depth of Field / Near Blur
de: Schärfentiefe / Nahunschärfe
zh_cn: 景深/近模糊

source: This effect simulates focal distance on cameras. It blurs objects close to the camera (acts in the opposite direction as far blur). It has an initial **Distance** with a **Transition** region (in world units):
de: Dieser Effekt simuliert die Brennweite von Kameras. Er macht Objekte in der Nähe der Kamera unscharf (wirkt in die entgegengesetzte Richtung wie die Fernunschärfe). Er hat eine anfängliche **Distanz** mit einer **Übergangsbereich** (in Welteinheiten):
zh_cn: 此效果可模拟相机的焦距。它使靠近相机的物体模糊（在远处模糊的相反方向上作用）。它具有 **Distance**\ （距离）以及 **Transition**\ （过渡）区域（使用世界单位）：

source: The **Amount** parameter controls the amount of blur. For larger blurs, tweaking the **Quality** may be needed in order to avoid artifacts.
de: Der Parameter **Menge** steuert die Stärke der Unschärfe. Bei größeren Unschärfen kann eine Anpassung der **Qualität** erforderlich sein, um Artefakte zu vermeiden.
zh_cn: ** Amount ** 参数控制模糊量. 对于较大的模糊, 可能需要调整 **质量** 以避免伪影.

source: It is common to use both blurs together to focus the viewer's attention on a given object, or create a so-called `"tilt shift" effect <https://en.wikipedia.org/wiki/Miniature_faking>`__.
de: Es ist üblich, beide Unschärfen zusammen zu verwenden, um die Aufmerksamkeit des Betrachters auf ein bestimmtes Objekt zu lenken oder einen sogenannten `"Tilt-Shift"-Effekt <https://en.wikipedia.org/wiki/Miniature_faking>`__ zu erzeugen.
zh_cn: 通常使用两种模糊将观众的注意力集中在给定对象上。

source: When using CameraAttributesPhysical instead of CameraAttributesPractical, depth of field is automatically computed from the camera attributes' focus distance, focal length, and aperture.
de: Bei Verwendung von CameraAttributesPhysical anstelle von CameraAttributesPractical wird die Schärfentiefe automatisch aus dem Fokusabstand, der Brennweite und der Blende der Kameraattribute berechnet.
zh_cn: 当使用 CameraAttributesPhysical 而不是 CameraAttributesPractical 时，景深是根据相机属性的焦距、焦距和光圈自动计算的。

source: Exposure
de: Belichtung
zh_cn: 曝光

source: This multiplies the overall scene brightness visible from the camera. Higher values result in a visually brighter scene.
de: Damit wird die von der Kamera sichtbare Gesamthelligkeit der Szene multipliziert. Höhere Werte führen zu einer visuell helleren Szene.
zh_cn: 这会成倍增加相机可见的整体场景亮度。 值越高，场景视觉上越亮。

source: Auto Exposure
de: Automatische Belichtung
zh_cn: 自动曝光

source: Even though, in most cases, lighting and texturing are heavily artist controlled, Godot supports a basic high dynamic range implementation with the auto exposure mechanism. This is generally used to add realism when combining interior areas with low light and bright outdoor areas. Auto exposure simulates the camera (or eye) in an effort to adapt between light and dark locations and their different amounts of light.
de: Obwohl Beleuchtung und Texturierung in den meisten Fällen stark vom Designer gesteuert werden, unterstützt Godot eine grundlegende Implementierung eines hohen Dynamikbereichs mit dem automatischen Belichtungsmechanismus. Dies wird im Allgemeinen verwendet, um den Realismus zu erhöhen, wenn Innenbereiche mit wenig Licht und hellen Außenbereichen kombiniert werden. Die automatische Belichtung simuliert die Kamera (oder das Auge) in dem Bemühen, sich zwischen hellen und dunklen Orten und deren unterschiedlichen Lichtmengen anzupassen.
zh_cn: 尽管在大多数情况下，光照和纹理都受到艺术家的严格控制，但 Godot 支持通过自动曝光机制实现基本的高动态范围。通常是在将室内区域与低光区域和明亮的室外区域相结合时，使用该功能来增加真实感。自动曝光会模拟相机（或眼睛），努力适应明暗位置及其不同的光量。

source: Auto exposure needs to evaluate the scene's brightness every frame, which has a moderate performance cost. Therefore, it's recommended to leave Auto Exposure disabled if it doesn't make much of a difference in your scene.
de: Die automatische Belichtung muss die Helligkeit der Szene bei jedem Bild neu bewerten, was mit einem moderaten Performance-Aufwand verbunden ist. Daher empfiehlt es sich, die automatische Belichtung zu deaktivieren, wenn sie in Ihrer Szene keinen großen Unterschied macht.
zh_cn: 自动曝光需要每帧评估场景的亮度，性能成本适中。 因此，如果自动曝光对场景影响不大，建议禁用它。

source: The simplest way to use auto exposure is to make sure outdoor lights (or other strong lights) have energy beyond 1.0. This is done by tweaking their **Energy** multiplier (on the Light itself). To make it consistent, the **Sky** usually needs to use the energy multiplier too, to match with the directional light. Normally, values between 3.0 and 6.0 are enough to simulate indoor-outdoor conditions.
de: Der einfachste Weg, die automatische Belichtung zu verwenden, besteht darin, sicherzustellen, dass die Außenbeleuchtung (oder andere starke Lichter) eine Energie von über 1,0 hat. Dies geschieht durch Anpassung ihres **Energie**-Multiplikators (auf dem Licht selbst). Um die Konsistenz zu gewährleisten, muss der **Himmel** in der Regel auch den Energiemultiplikator verwenden, um mit dem gerichteten Licht übereinzustimmen. Normalerweise sind Werte zwischen 3,0 und 6,0 ausreichend, um Innen- und Außenbedingungen zu simulieren.
zh_cn: 使用自动曝光的最简单方法是确保室外灯光（或其他强光）的能量超过 1.0。这是通过调整它们的 **Energy** 乘数（对灯光本身）来实现的。为了使其保持一致，\ **Sky** 通常也需要使用能量乘数，以配合平行光。通常情况下，数值在 3.0 到 6.0 之间，就足以模拟室内室外条件。

source: By combining Auto Exposure with :ref:`doc_environment_and_post_processing_glow` post-processing, pixels that go over the tonemap **White** will bleed to the glow buffer, creating the typical bloom effect in photography.
de: Durch die Kombination von automatischer Belichtung mit der Post-Processing :ref:`doc_environment_and_post_processing_glow` werden Pixel, die über die Tonemap **Weiß** hinausgehen, in den Glow-Puffer übergehen, wodurch der für die Fotografie typische Bloom-Effekt entsteht.
zh_cn: 通过将自动曝光与 :ref:`doc_environment_and_post_processing_glow` 后处理相结合（更多内容如下），超过色调映射 **White** 的像素将会逸出至辉光缓冲区，从而在摄影中创造典型的泛光效果。

source: The user-controllable values in the Auto Exposure section come with sensible defaults, but you can still tweak them:
de: Für die vom Benutzer einstellbaren Werte im Abschnitt "Automatische Belichtung" gibt es sinnvolle Standardwerte, aber Sie können sie dennoch anpassen:
zh_cn: "自动曝光" 部分中的用户可控值具有合理的默认值, 但你仍然可以调整它们:

source: **Scale:** Value to scale the lighting. Higher values produce brighter images, and lower values produce darker ones.
de: **Skalierung:** Wert zur Skalierung der Beleuchtung. Höhere Werte erzeugen hellere Bilder, niedrigere Werte dunklere Bilder.
zh_cn: **Scale：** （比例）用于缩放照明的值。较高的值会产生较亮的图像，较低的值会产生较暗的图像。
