Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: de, zh_cn

source: **Min Sensitivity / Min Exposure Value:** Minimum luminance that auto exposure will aim to adjust for (in ISO when using CameraAttributesPractical, or in EV100 when using CameraAttributesPhysical). Luminance is the average of the light in all the pixels of the screen.
de: **Min. Empfindlichkeit / Min. Belichtungswert:** Minimale Leuchtdichte als Ziel der automatischen Belichtung abzielt (in ISO, wenn CameraAttributesPractical verwendet wird, oder in EV100, wenn CameraAttributesPhysical verwendet wird). Die Luminanz ist der Durchschnitt des Lichts in allen Pixeln des Bildschirms.
zh_cn: **Min Sensitivity / Min Exposure Value：** （最小灵敏度/最小曝光值）自动曝光旨在调整的最小亮度（使用 CameraAttributesPractical 时在 ISO 中，或者使用 CameraAttributesPhysical 时在 EV100 中）。亮度是屏幕所有像素的光的平均值。

source: **Max Sensitivity / Max Exposure Value:** Maximum luminance that auto exposure will aim to adjust for (in ISO when using CameraAttributesPractical, or in EV100 when using CameraAttributesPhysical).
de: **Max. Empfindlichkeit / Max. Belichtungswert:** Maximale Leuchtdichte, als Ziel der automatischen Belichtung (in ISO, wenn CameraAttributesPractical verwendet wird, oder in EV100, wenn CameraAttributesPhysical verwendet wird).
zh_cn: **Max Sensitivity / Max Exposure Value：** （最大灵敏度/最大曝光值）自动曝光旨在调整的最大亮度（使用 CameraAttributesPractical 时在 ISO 中，或使用 CameraAttributesPhysical 时在 EV100 中）。

source: **Speed:** Speed at which luminance corrects itself. The higher the value, the faster luminance correction happens. High values may be more suited to fast-paced games, but can be distracting in some scenarios.
de: **Geschwindigkeit:** Geschwindigkeit, mit der sich die Leuchtdichte korrigiert. Je höher der Wert, desto schneller erfolgt die Luminanzkorrektur. Hohe Werte eignen sich besser für rasante Spiele, können aber in manchen Szenarien ablenken.
zh_cn: **Speed：** （速度）亮度自行校正的速度。值越高，亮度校正的速度越快。较高的值可能更适合快节奏的游戏，但在某些情况下可能会分散注意力。

source: When using CameraAttributesPractical, exposure is set using *sensitivity* defined in ISO instead of an exposure value in EV100. Typical ISO values are between 50 and 3200, with higher values resulting in higher final exposure. In real life, daytime photography generally uses ISO values between 100 and 800.
de: Bei der Verwendung von CameraAttributesPractical wird die Belichtung anhand der in ISO definierten *Empfindlichkeit* und nicht anhand eines Belichtungswerts in EV100 eingestellt. Typische ISO-Werte liegen zwischen 50 und 3200, wobei höhere Werte zu einer höheren Endbelichtung führen. In der Praxis werden bei Tageslichtaufnahmen in der Regel ISO-Werte zwischen 100 und 800 verwendet.
zh_cn: 使用 CameraAttributesPractical 时，使用 ISO 中定义的 *灵敏度* 而不是 EV100 中的曝光值来设置曝光。 典型的 ISO 值在 50 到 3200 之间，值越高，最终曝光越高。 现实生活中，白天摄影一般使用100到800之间的 ISO 值。

source: See :ref:`doc_physical_light_and_camera_units` if you wish to use real world units to configure your camera's exposure, field of view and depth of field.
de: Siehe :ref:`doc_physical_light_and_camera_units`, wenn Sie reale Einheiten zur Konfiguration der Belichtung, des Sichtfelds und der Schärfentiefe Ihrer Kamera verwenden möchten.
zh_cn: 如果你希望使用现实世界的单位来配置相机的曝光、视野和景深，请参阅 :ref:`doc_physical_light_and_camera_units`。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
