Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: de, zh_cn

source: Environment and post-processing
de: Environment und Post-Processing
zh_cn: 环境和后期处理

source: Godot 4 provides a redesigned Environment resource, as well as a new post-processing system with many available effects right out of the box.
de: Godot 4 bietet eine neu gestaltete Environment-Ressource sowie ein neues Post-Processing mit vielen standardmäßig verfügbaren Effekten.
zh_cn: Godot 4 提供了重新设计的环境资源（Environment resource），以及一个全新的后期处理（post-processing）系统，其具有许多开箱即用的效果。

source: As of Godot 4, Environment *performance/quality* settings are defined in the project settings instead of in the Environment resource. This makes global adjustments easier, as you no longer have to tweak Environment resources individually to suit various hardware configurations.
de: Ab Godot 4 werden die Environment-Einstellungen für die *Performance/Qualität* in den Projekteinstellungen und nicht mehr in der Environment-Ressource definiert. Dies erleichtert globale Anpassungen, da Sie die Environment-Ressourcen nicht mehr einzeln an verschiedene Hardwarekonfigurationen anpassen müssen.
zh_cn: 从 Godot 4 开始，环境的 *性能/质量* 设置是在项目设置中定义的，而不是在环境资源中定义的。 这使得全局调整变得更加容易，因为你不再需要单独调整环境资源，来适应各种硬件配置。

source: Note that most Environment performance/quality settings are only visible after enabling the **Advanced** toggle in the Project Settings.
de: Beachten Sie, dass die meisten Environment-Einstellungen für die Performance/Qualität der nur sichtbar sind, wenn Sie den Schalter **Erweitert** in den Projekteinstellungen aktiviert haben.
zh_cn: 请注意，大多数环境的性能/质量设置仅在项目设置中启用 **高级** 开关后才可见。

source: Environment
zh_cn: 环境

source: The :ref:`class_Environment` resource stores all the information required for controlling the 2D and 3D rendering environment. This includes the sky, ambient lighting, tone mapping, effects, and adjustments. By itself, it does nothing, but you can enable it by using it in one of the following locations, in order of priority:
de: Die Ressource :ref:`class_Environment` speichert alle Informationen, die zur Steuerung der 2D- und 3D-Rendering-Environment erforderlich sind. Dazu gehören der Himmel, das Ambient Lighting, Tone Mapping, Effekte und Anpassungen. Von sich aus tut sie nichts, aber Sie können sie aktivieren, indem Sie sie an einer der folgenden Stellen verwenden, in der Reihenfolge ihrer Priorität:
zh_cn: :ref:`class_Environment` 资源存储控制 2D 和 3D 渲染环境所需的所有信息。 其中包括天空、环境照明、色调映射、效果和调整。 它本身不执行任何操作，但你可以通过在以下位置之一（按优先级顺序）使用来启用它：

source: Camera3D node (high priority)
de: Camera3D-Node (hohe Priorität)
zh_cn: Camera3D 节点（高优先级）

source: An Environment can be set to a Camera3D node. It will have priority over any other setting.
de: Eine Environment kann auf einen Camera3D-Node gesetzt werden. Sie hat dann Vorrang vor allen anderen Einstellungen.
zh_cn: 可以为 Camera3D 节点设置 Environment。优先于其他所有设置。

source: This is mostly useful when you want to override an existing environment, but in general it's a better idea to use the option below.
de: Dies ist vor allem dann nützlich, wenn Sie eine bestehende Environment überschreiben wollen, aber im Allgemeinen ist es besser, die unten stehende Option zu verwenden.
zh_cn: 这在想要覆盖现有环境时非常有用，但通常来说使用以下的选项更好。

source: WorldEnvironment node (medium priority, recommended)
de: WorldEnvironment-Node (mittlere Priorität, empfohlen)
zh_cn: WorldEnvironment 节点（中优先级，推荐）

source: The WorldEnvironment node can be added to any scene, but only one can exist per active scene tree. Adding more than one will result in a warning.
de: Der WorldEnvironment-Node kann zu jeder Szene hinzugefügt werden, aber es kann nur einer pro aktivem Szenenbaum existieren. Das Hinzufügen von mehr als einem führt zu einer Warnung.
zh_cn: WorldEnvironment节点可以添加到任何场景, 但每个活动场景树只能存在一个. 添加多个将导致警告.

source: Any Environment added has higher priority than the default Environment (explained below). This means it can be overridden on a per-scene basis, which makes it quite useful.
de: Jede hinzugefügte Environment hat eine höhere Priorität als die Standard-Environment (siehe unten). Das bedeutet, dass sie für jede einzelne Szene überschrieben werden kann, was sie sehr nützlich macht.
zh_cn: 添加的任何 Environment 都具有比默认 Environment 更高的优先级（后述）。这意味着它可以针对各个场景分别进行覆盖，这使它非常有用。

source: Preview environment and sun (low priority)
de: Vorschau Environment und Sonne (niedrige Priorität)
zh_cn: 预览环境和太阳（低优先级）

source: Since Godot 4, the preview environment and sun system replace the ``default_env.tres`` file that was used in Godot 3 projects.
de: Seit Godot 4 ersetzen die Vorschau-Environment und das Sonnen-System die Datei ``default_env.tres``, die in Godot 3-Projekten verwendet wurde.
zh_cn: 从 Godot 4 开始，预览环境和太阳的系统替代了 Godot 3 项目中使用的 ``default_env.tres`` 文件。

source: If no WorldEnvironment node or DirectionalLight3D node is present in the current scene, the editor will display a preview environment and sun instead. This can be disabled using the buttons at the top of the 3D editor:
de: Wenn kein WorldEnvironment-Node oder DirectionalLight3D-Node in der aktuellen Szene vorhanden ist, zeigt der Editor stattdessen eine Vorschau der Umgebung und der Sonne an. Dies kann mit den Buttons am oberen Rand des 3D-Editors deaktiviert werden:
zh_cn: 如果当前场景中不存在 WorldEnvironment 节点或 DirectionalLight3D 节点，编辑器会改为显示预览环境和太阳。可以使用 3D 编辑器顶部的按钮禁用：

source: Clicking on the 3 vertical dots on the right will display a dialog which allows you to customize the appearance of the preview environment:
de: Wenn Sie auf die 3 vertikalen Punkte auf der rechten Seite klicken, wird ein Dialog angezeigt, mit dem Sie das Aussehen der Vorschau-Environment anpassen können:
zh_cn: 点击右侧的垂直排列的三个点就会显示一个对话框，能够用来自定义预览环境的外观：

source: **The preview sun and sky is only visible in the editor, not in the running project.** Using the buttons at the bottom of the dialog, you can add the preview sun and sky into the scene as nodes.
de: **Vorschau-Sonne und -Himmel sind nur im Editor sichtbar, nicht im laufenden Projekt.** Mit den Buttons am unteren Rand des Dialogs können Sie Vorschau-Sonne und -Himmel als Nodes in die Szene einfügen.
zh_cn: **预览太阳和天空只在编辑器中可见，运行项目时不可见。**\ 使用对话框底部的按钮就可以将预览太阳和天空作为节点加入到场景中。

source: If you hold :kbd:`Shift` while clicking **Add Sun to Scene** or **Add Environment to Scene** in the preview environment editor, this will add both a preview sun and environment to the current scene (as if you clicked both buttons separately). Use this to speed up project setup and prototyping.
de: Wenn Sie :kbd:`Umschalt` gedrückt halten, während Sie im Vorschau-Environment-Editor auf **Sonne zu Szene hinzufügen** oder **Environment zu Szene hinzufügen** klicken, werden sowohl eine Vorschausonne als auch eine Environment zur aktuellen Szene hinzugefügt (als hätten Sie beide Schaltflächen separat angeklickt). Verwenden Sie dies, um die Projekteinrichtung und das Prototyping zu beschleunigen.
zh_cn: 在预览环境编辑器中，点击\ **将太阳添加到场景**\ 或\ **将环境添加到场景**\ 时按住 :kbd:`Shift`\ ，就会将预览太阳和预览环境一同添加到当前场景中（就像单独点击了这两个按钮一样）。可以使用这个方法加速项目的设置和原型。

source: Camera attributes
de: Kamera-Attribute
zh_cn: 相机属性

source: In Godot 4, exposure and depth of field information was split from the Environment resource into a separate CameraAttributes resource. This allows adjusting those properties independently of other Environment settings more easily.
de: In Godot 4 wurden die Informationen über Belichtung und Schärfentiefe von der Ressource Environment in eine separate Ressource CameraAttributes aufgeteilt. Dadurch können diese Propertys unabhängig von anderen Environment-Einstellungen leichter angepasst werden.
zh_cn: 在 Godot 4 中，曝光和景深信息从环境资源中分离到单独的 CameraAttributes 资源中。 这样可以更轻松地独立于其他环境设置来调整这些属性。

source: The :ref:`class_CameraAttributes` resource stores exposure and depth of field information. It also allows enabling automatic exposure adjustments depending on scene brightness.
de: Die Ressource :ref:`class_CameraAttributes` speichert Informationen über Belichtung und Schärfentiefe. Sie ermöglicht auch die automatische Belichtungsanpassung in Abhängigkeit von der Helligkeit der Szene.
zh_cn: :ref:`class_CameraAttributes` 资源存储曝光和景深信息。 它还允许根据场景亮度自动调整曝光。

source: There are two kinds of CameraAttribute resources available:
de: Es sind zwei Arten von CameraAttribute-Ressourcen verfügbar:
zh_cn: 有两种 CameraAttribute 资源可用：

source: **CameraAttributesPractical:** Features are exposed using arbitrary units, which are easier to reason about for most game use cases.
de: **CameraAttributesPractical:** Features werden in beliebigen Einheiten dargestellt, was für die meisten Anwendungsfälle in Spielen einfacher zu verstehen ist.
zh_cn: **实用相机属性：** 使用任意单位公开功能，这对于大多数游戏用例来说更容易推理。

source: **CameraAttributesPhysical:** Features are exposed using real world units, similar to a digital camera. For example, field of view is set using a focal length in millimeters instead of a value in degrees. Recommended when physical accuracy is important, such as for photorealistic rendering.
de: **CameraAttributesPhysical:** Merkmale werden ähnlich wie bei einer Digitalkamera in realen Einheiten dargestellt. Beispielsweise wird das Field of View mit einer Brennweite in Millimetern anstelle eines Wertes in Grad festgelegt. Empfohlen, wenn physikalische Genauigkeit wichtig ist, z. B. für fotorealistisches Rendering.
zh_cn: **CameraAttributesPhysical：** 使用现实世界单位曝光特征，类似于数码相机。 例如，视野是使用以毫米为单位的焦距，而不是以度为单位的值来设置的。 当物理精度很重要时推荐使用，例如要求照片级真实感渲染。

source: Both CameraAttribute resource types allow you to use the same features, but they are configured differently. If you don't know which one to choose, use **CameraAttributesPractical**.
de: Mit beiden CameraAttribute-Ressourcentypen können Sie die gleichen Funktionen nutzen, sie sind jedoch unterschiedlich konfiguriert. Wenn Sie nicht wissen, welchen Sie wählen sollen, verwenden Sie **CameraAttributesPractical**.
zh_cn: 两种 CameraAttribute 资源类型都允许你使用相同的功能，但它们的配置不同。 如果你不知道选择哪一个，请使用 **CameraAttributesPractical** 。

source: Using a :ref:`class_CameraAttributesPhysical` on a Camera3D node will lock out FOV and aspect adjustments in that Camera3D, as field of view is adjusted in the CameraAttributesPhysical resource instead. If used in a WorldEnvironment, the CameraAttributesPhysical will not override any Camera3D in the scene.
de: Die Verwendung einer :ref:`class_CameraAttributesPhysical` auf einem Camera3D-Node sperrt FOV und Seitenverhältnis-Anpassungen in dieser Camera3D, da das Sichtfeld stattdessen in der CameraAttributesPhysical Ressource angepasst wird. Wenn sie in einer WorldEnvironment verwendet wird, überschreibt die CameraAttributesPhysical keine Camera3D in der Szene.
zh_cn: 在 Camera3D 节点上使用 :ref:`class_CameraAttributesPhysical` 将锁定该 Camera3D 中的 FOV 和长宽调整，因为视野是在 CameraAttributesPhysical 资源中调整的。 如果在 WorldEnvironment 中使用，CameraAttributesPhysical 将不会覆盖场景中的任何 Camera3D。

source: A CameraAttributes resource can be added to a Camera3D or a WorldEnvironment node. When the current camera has a CameraAttributes set, it will *override* the one set in WorldEnvironment (if any).
de: Eine CameraAttributes-Ressource kann zu einem Camera3D oder einem WorldEnvironment-Node hinzugefügt werden. Wenn die aktuelle Kamera eine CameraAttributes-Ressource hat, überschreibt sie die in WorldEnvironment eingestellte (falls vorhanden).
zh_cn: CameraAttributes 资源可以添加到 Camera3D 或 WorldEnvironment 节点上。 在当前相机设置了 CameraAttributes 时，它将 *覆盖* WorldEnvironment 中设置的CameraAttributes（如果有的话）。

source: In most situations, setting the CameraAttributes resource on the Camera3D node instead of the WorldEnvironment is recommended. Unlike WorldEnvironment, assigning the CameraAttributes resource to the Camera3D node prevents depth of field from displaying in the 3D editor viewport, unless the camera is being previewed.
de: In den meisten Situationen wird empfohlen, die CameraAttributes-Ressource auf den Camera3D-Node statt auf den WorldEnvironment-Node zu setzen. Im Gegensatz zu WorldEnvironment wird durch die Zuweisung der CameraAttributes-Ressource zum Camera3D-Node verhindert, dass die Schärfentiefe im Ansichtsfenster des 3D-Editors angezeigt wird, es sei denn, die Kamera wird in der Vorschau angezeigt.
zh_cn: 在大多数情况下，建议在 Camera3D 节点而不是 WorldEnvironment 上设置 CameraAttributes 资源。 与 WorldEnvironment 不同，将 CameraAttributes 资源分配给 Camera3D 节点会阻止景深显示在 3D 编辑器视口中，除非你正在预览相机。

source: Environment options
de: Environment-Optionen
zh_cn: 环境可选项

source: The following is a detailed description of all environment options and how they are intended to be used.
de: Nachfolgend finden Sie eine ausführliche Beschreibung aller Environment-Optionen und wie sie verwendet werden sollen.
zh_cn: 以下是所有环境选项的详细说明以及如何使用它们。

source: Background
de: Hintergrund
zh_cn: 背景

source: The Background section contains settings on how to fill the background (parts of the screen where objects were not drawn). The background not only serves the purpose of displaying an image or color. By default, it also affects how objects are affected by ambient and reflected light. This is called image-based lighting (IBL).
de: Der Abschnitt Hintergrund enthält Einstellungen, wie der Hintergrund (Teile des Bildschirms, in denen keine Objekte gezeichnet wurden) gefüllt werden soll. Der Hintergrund dient nicht nur dazu, ein Bild oder eine Farbe anzuzeigen. Standardmäßig wirkt er sich auch darauf aus, wie Objekte durch Umgebungs- und reflektiertes Licht beeinflusst werden. Dies wird als bildbasierte Beleuchtung (Image-Based Lighting, IBL) bezeichnet.
zh_cn: “背景（Background） ”部分包含有关如何填充背景的设置（屏幕中未绘制对象的部分）。 背景不仅用于显示图像或颜色。默认情况下，它还会影响对象受环境光和反射光影响的方式。 这称为基于图像的照明 (IBL)。

source: As a result, the background sky may greatly impact your scene's overall appearance, even if the sky is never directly visible on screen. This should be taken into account when tweaking lighting in your scene.
de: Daher kann der Hintergrundhimmel einen großen Einfluss auf das Gesamterscheinungsbild Ihrer Szene haben, auch wenn der Himmel nie direkt auf dem Bildschirm zu sehen ist. Dies sollte bei der Anpassung der Beleuchtung in Ihrer Szene berücksichtigt werden.
zh_cn: 因此，背景天空可能会极大地影响场景的整体外观，即使天空在屏幕上永远不会直接可见。 调整场景中的光照时应考虑到这一点。

source: There are several background modes available:
de: Es sind mehrere Hintergrundmodi verfügbar:
zh_cn: 有几种背景模式可供选择：

source: **Clear Color** uses the default clear color defined in the project settings. The background will be a constant color.
de: **Clear Color** verwendet die in den Projekteinstellungen definierte Standardfarbe "Clear". Der Hintergrund wird in einer konstanten Farbe dargestellt.
zh_cn: **清晰颜色（Clear Color ）** 使用项目设置中定义的默认清晰颜色。背景将是恒定的颜色。

source: **Custom Color** is like Clear Color, but with a custom color value.
de: **Benutzerdefinierte Farbe** ist wie Clear, aber mit einem benutzerdefinierten Farbwert.
zh_cn: **自定义颜色（Custom Color）** 与清晰颜色（Clear Color）类似，但具有自定义颜色值。

source: **Sky** lets you define a background sky material (see below). By default, objects in the scene will reflect this sky material and absorb ambient light from it.
de: Mit **Himmel** können Sie ein Himmelsmaterial für den Hintergrund definieren (siehe unten). Standardmäßig reflektieren die Objekte in der Szene dieses Himmelsmaterial und absorbieren das Umgebungslicht davon.
zh_cn: **天空（Sky）** 可允许你定义背景天空材质（见下文）。 默认情况下，场景中的对象将反射此天空材质并吸收其中的环境光。

source: **Canvas** displays the 2D scene as a background to the 3D scene. This can be used to make environment effects visible on 2D rendering, such as :ref:`glow in 2D <doc_environment_and_post_processing_using_glow_in_2d>`.
de: **Canvas** zeigt die 2D-Szene als Hintergrund für die 3D-Szene an. Dies kann verwendet werden, um Umgebungseffekte beim 2D-Rendering sichtbar zu machen, wie zum Beispiel :ref:`Glow in 2D <doc_environment_and_post_processing_using_glow_in_2d>`.
zh_cn: **画布（Canvas）** 将 2D 场景显示为 3D 场景的背景。这可用于使环境效果在 2D 渲染中可见，例如 :ref:`2D 中的辉光 <doc_environment_and_post_processing_using_glow_in_2d>`。

source: **Keep** does not draw any sky, keeping what was present on previous frames instead. This improves performance in purely indoor scenes, but creates a "hall of mirrors" visual glitch if the sky is visible at any time.
de: Mit **Beibehalten** wird kein Himmel gezeichnet, sondern das beibehalten, was in den vorherigen Bildern vorhanden war. Dies verbessert die Performance in reinen Innenraumszenen, führt aber zu einem "Spiegelkabinett"-Effekt, wenn der Himmel zu irgendeinem Zeitpunkt sichtbar ist.
zh_cn: **保留（Keep）**\ 不会绘制任何天空，而是保留前一帧中存在的内容。 这提高了纯室内场景中的性能，但如果天空随时可见，则会产生“镜厅（hall of mirrors）”视觉故障。

source: Sky materials
de: Himmelsmaterialien
zh_cn: 天空材质

source: When using the **Sky** background mode (or the ambient/reflected light mode is set to **Sky**), a Sky subresource becomes available to edit in the Environment resource. Editing this subresource allows you to create a SkyMaterial resource within the Sky.
de: Wenn Sie den Hintergrundmodus **Himmel** verwenden (oder der Umgebungs-/Reflexionslichtmodus auf **Himmel** eingestellt ist), wird eine Himmels-Subressource verfügbar, die Sie in der Ressource Environment bearbeiten können. Wenn Sie diese Subressource bearbeiten, können Sie eine SkyMaterial-Ressource innerhalb des Himmels erstellen.
zh_cn: 使用 **Sky** 背景模式（或环境光/反射光模式设置为 **Sky** ）时，Sky 子资源可在环境资源中进行编辑。 编辑此子资源允许你在 Sky 中创建 SkyMaterial 资源。

source: There are 3 built-in sky materials to choose from:
de: Sie können zwischen 3 Built-in-Himmelsmaterialien wählen:
zh_cn: 有 3 种内置天空材质可供选择：

source: **PanoramaSkyMaterial:** Use a 360 degree panorama sky image (2:1 aspect ratio recommended). To benefit from high dynamic range, the panorama image must be in an HDR-compatible format such as ``.hdr`` or ``.exr`` rather than a standard dynamic range format like ``.png`` or ``.jpg``.
de: **PanoramaSkyMaterial:** Verwenden Sie ein 360-Grad-Panoramabild des Himmels (Seitenverhältnis 2:1 empfohlen). Um den hohen Dynamikbereich zu nutzen, muss das Panoramabild in einem HDR-kompatiblen Format wie ``.hdr`` oder ``.exr`` vorliegen und nicht in einem Default-Dynamikbereich-Format wie ``.png`` oder ``.jpg``.
zh_cn: **PanoramaSkyMaterial：** 使用 360 度全景天空图像（建议长宽比为 2:1）。 为了受益于高动态范围，全景图像必须采用 HDR 兼容格式，例如 ``.hdr`` 或 ``.exr`` ，而不是标准动态范围格式，例如 ``.png`` 或 ``.jpg`` 。

source: **ProceduralSkyMaterial:** Use a procedurally generated sky with adjustable ground, sun, sky and horizon colors. This is the type of sky used in the editor preview. The sun's position is automatically derived from the first 4 DirectionalLight3D nodes present in the scene. There can be up to 4 suns at a given time.
de: **ProceduralSkyMaterial:** Verwenden Sie einen prozedural erzeugten Himmel mit einstellbaren Farben für Boden, Sonne, Himmel und Horizont. Dies ist die Art von Himmel, die in der Editorvorschau verwendet wird. Die Position der Sonne wird automatisch von den ersten 4 DirectionalLight3D-Nodes abgeleitet, die in der Szene vorhanden sind. Es kann bis zu 4 Sonnen zu einem bestimmten Zeitpunkt geben.
zh_cn: **ProceduralSkyMaterial：** 使用程序生成的天空，并可调整地面、太阳、天空和地平线的颜色。 这是编辑器预览中使用的天空类型。 太阳的位置是从场景中存在的前 4 个 DirectionalLight3D 节点自动得出的。 给定时间最多可以有 4 个太阳。

source: **PhysicalSkyMaterial:** Use a physically-based procedural sky with adjustable scattering parameters. The sun's position is automatically derived from the first DirectionalLight3D node present in the scene. PhysicalSkyMaterial is slightly more expensive to render compared to ProceduralSkyMaterial. There can be up to 1 sun at a given time.
de: **PhysicalSkyMaterial:** Verwenden Sie einen Physik-basierten prozeduralen Himmel mit einstellbaren Streuungsparametern. Die Position der Sonne wird automatisch aus dem ersten DirectionalLight3D-Node in der Szene abgeleitet. PhysicalSkyMaterial ist etwas teurer zu rendern im Vergleich zu ProceduralSkyMaterial. Es kann bis zu 1 Sonne zu einer bestimmten Zeit vorhanden sein.
zh_cn: **PhysicalSkyMaterial：** 使用具有可调整散射参数的基于物理的程序天空。 太阳的位置自动从场景中存在的第一个 DirectionalLight3D 节点导出。 与 ProceduralSkyMaterial 相比，PhysicalSkyMaterial 的渲染成本稍高。 给定时间最多可以有 1 个太阳。

source: Panorama sky images are sometimes called HDRIs (High Dynamic Range Images). You can find freely licensed HDRIs on `Poly Haven <https://polyhaven.com/hdris>`__.
de: Panorama-Himmelsbilder werden manchmal als HDRIs (High Dynamic Range Images) bezeichnet. Sie können frei lizenzierte HDRIs auf `Poly Haven <https://polyhaven.com/hdris>`__ finden.
zh_cn: 全景天空（Panorama sky）图像有时称为 HDRI（High Dynamic Range Images，高动态范围图像）。 你可以在 `Poly Haven <https://polyhaven.com/hdris>`__ 上找到具有免费许可的 HDRI。

source: HDR PanoramaSkyMaterial textures with very bright spots (such as real life photos with the sun visible) may result in visible sparkles on ambient and specular reflections. This is caused by the texture's peak exposure being too high.
de: HDR-PanoramaSkyMaterial-Texturen mit sehr hellen Stellen (z. B. Fotos aus dem wirklichen Leben, auf denen die Sonne sichtbar ist) können zu sichtbarem Glitzern auf Umgebungs- und Spiegelreflexionen führen. Dies wird dadurch verursacht, dass die Spitzenbelichtung der Textur zu hoch ist.
zh_cn: 具有非常明亮光点的 HDR PanoramaSkyMaterial 纹理（例如可以看到太阳的现实生活照片）可能会导致环境反射和镜面反射出现可见的闪光。 这是由于纹理的峰值曝光过高造成的。

source: To resolve this, select the panorama texture in the FileSystem dock, go to the Import dock, enable **HDR Clamp Exposure** then click **Reimport**.
de: Um dies zu beheben, wählen Sie die Panoramatextur im Dateisystem-Dock aus, gehen Sie zum Import-Dock, aktivieren Sie **HDR-Clamp-Belichtung** und klicken Sie dann auf **Neuimport**.
zh_cn: 要解决此问题，请在文件系统面板中选择全景纹理，转到导入面板，启用 **HDR 限制曝光** ，然后单击 **重新导入** 。

source: If you need a custom sky material (e.g. for procedural clouds), you can create a custom :ref:`sky shader <doc_sky_shader>`.
de: Wenn Sie ein benutzerdefiniertes Himmelsmaterial benötigen (z. B. für prozedurale Wolken), können Sie einen benutzerdefinierten :ref:`Himmels-Shader <doc_sky_shader>` erstellen.
zh_cn: 如果你需要自定义天空材质（例如，用于程序云），你可以创建自定义 :ref:`天空着色器 <doc_sky_shader>`。

source: Ambient light
de: Umgebungslicht
zh_cn: 环境光

source: Ambient light (as defined here) is a type of light that affects every piece of geometry with the same intensity. It is global and independent of lights that might be added to the scene. Ambient light is one of the two components of image-based lighting. Unlike reflected light, ambient light does not vary depending on the camera's position and viewing angle.
de: Umgebungslicht (wie hier definiert) ist eine Art von Licht, das auf jedes Stück Geometrie mit der gleichen Intensität wirkt. Es ist global und unabhängig von Lichtern, die der Szene hinzugefügt werden könnten. Umgebungslicht ist eine der beiden Komponenten der bildbasierten Beleuchtung. Im Gegensatz zum reflektierten Licht variiert das Umgebungslicht nicht in Abhängigkeit von der Kameraposition und dem Blickwinkel.
zh_cn: 环境光（如此处定义）是一种以相同强度影响每个几何体的光。它是全局的并且独立于可能添加到场景中的灯光。环境光是基于图像的照明的两个组成部分之一。与反射光不同，环境光不会根据相机的位置和视角而变化。

source: There are several types of ambient light to choose from:
de: Es gibt verschiedene Arten von Umgebungslicht, aus denen Sie wählen können:
zh_cn: 有几种类型的环境光可供选择：

source: **Background:** Source ambient light from the background, such as the sky, custom color or clear color (default). Ambient light intensity will vary depending on the sky image's contents, which can result in more visually appealing ambient lighting. A sky must be set as background for this mode to be visible.
de: **Hintergrund:** Quellen-Umgebungslicht aus dem Hintergrund, z.B. dem Himmel, einer benutzerdefinierten Farbe oder einer Clear-Farbe (Default). Die Intensität des Umgebungslichts variiert je nach Inhalt des Himmelsbildes, was zu einer visuell ansprechenderen Umgebungsbeleuchtung führen kann. Damit dieser Modus sichtbar ist, muss ein Himmel als Hintergrund eingestellt sein.
zh_cn: **Background：** （背景）从背景中获取环境光，例如天空、自定义颜色或透明颜色（默认）。 环境光强度将根据天空图像的内容而变化，这可以产生更具视觉吸引力的环境照明。 必须将天空设置为背景才能使此模式可见。
