Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: de, zh_cn

source: **Disabled:** Do not use any ambient light. Useful for purely indoor scenes.
de: **Deaktiviert:** Verwenden Sie kein Umgebungslicht. Nützlich für reine Innenraumszenen.
zh_cn: **Disabled：** （禁用）不使用任何环境光。 对于纯室内场景很有用。

source: **Color:** Use a constant color for ambient light, ignoring the background sky. Ambient light intensity will be the same on all sides, which may result in the scene's lighting looking more flat. Useful for indoor scenes where pitch black shadows may be too dark, or to maximize performance on low-end devices.
de: **Farbe:** Verwenden Sie eine konstante Farbe für das Umgebungslicht und ignorieren Sie den Hintergrundhimmel. Die Intensität des Umgebungslichts wird auf allen Seiten gleich sein, was dazu führen kann, dass die Beleuchtung der Szene flacher aussieht. Nützlich für Innenraumszenen, bei denen tiefschwarze Schatten zu dunkel sein könnten, oder um die Performance auf Low-End-Geräten zu maximieren.
zh_cn: **Color：** （颜色）对环境光使用恒定颜色，忽略背景天空。 所有侧面的环境光强度都相同，这可能会导致场景的照明看起来更平坦。 对于漆黑阴影可能太暗的室内场景很有用，或者可以最大限度地提高低端设备的性能。

source: **Sky:** Source ambient light from a specified sky, even if the background is set to a mode other than **Sky**. If the background mode is already **Sky**, this mode behaves identically to **Background**.
de: **Himmel:** Das Umgebungslicht wird von einem bestimmten Himmel erzeugt, auch wenn der Hintergrund auf einen anderen Modus als **Himmel** eingestellt ist. Wenn der Hintergrundmodus bereits **Himmel** ist, verhält sich dieser Modus identisch zu **Hintergrund**.
zh_cn: **Sky：** （天空）从指定的天空获取环境光，即使背景设置为 **Sky** 以外的模式。 如果背景模式已经是 **Sky** ，则此模式的行为与 **Background** 相同。

source: When the ambient light mode is set to Sky or Background (and background is set to Sky), it's possible to blend between the ambient color and sky using the **Sky Contribution** property. This value is set to ``1.0`` by default, which means that only the ambient sky is used. The ambient color is ignored unless **Sky Contribution** is decreased below ``1.0``.
de: Wenn der Umgebungslichtmodus auf "Himmel" oder "Hintergrund" eingestellt ist (und der Hintergrund auf "Himmel"), ist es möglich, zwischen der Umgebungsfarbe und dem Himmel zu überblenden, indem man die **Himmel-Beitrag**-Property benutzt. Dieser Wert ist standardmäßig auf ``1.0`` eingestellt, was bedeutet, dass nur der Umgebungshimmel verwendet wird. Die Umgebungsfarbe wird ignoriert, es sei denn, **Himmel-Beitrag** wird unter ``1.0`` gesenkt.
zh_cn: 当环境光模式设置为 Sky 或 Background（并且背景设置为天空）时，可以使用 **Sky Contribution** （天空贡献度）属性在环境颜色和天空之间进行混合。默认情况下，该值设置为 ``1.0`` ，这意味着仅使用环境天空。除非 **Sky Contribution** 降低到 ``1.0`` 以下，否则环境颜色将被忽略。

source: Here is a comparison of how different ambient light affects a scene:
de: Hier ist ein Vergleich, wie sich unterschiedliches Umgebungslicht auf eine Szene auswirkt:
zh_cn: 以下是不同环境光对场景的影响比较:

source: Finally, there is an **Energy** setting which is a multiplier. It's useful when working with HDR.
de: Schließlich gibt es eine **Energie**-Einstellung, die einen Multiplikator darstellt. Er ist nützlich, wenn Sie mit HDR arbeiten.
zh_cn: 最后有一个 **Energy（能量）** 设置，这是一个乘数，在使用HDR时非常有用。

source: In general, you should only rely on ambient light alone for simple scenes or large exteriors. You may also do so to boost performance. Ambient light is fast to render, but it doesn't provide the best lighting quality. It's better to generate ambient light from :ref:`ReflectionProbe <doc_reflection_probes>`, :ref:`VoxelGI <doc_using_voxel_gi>` or :ref:`SDFGI <doc_using_sdfgi>`, as these will simulate how indirect light propagates more accurately. Below is a comparison, in terms of quality, between using a flat ambient color and a VoxelGI:
de: Im Allgemeinen sollten Sie sich nur bei einfachen Szenen oder großen Außenbereichen auf das Umgebungslicht allein verlassen. Sie können dies auch tun, um die Performance zu steigern. Umgebungslicht ist zwar schnell zu rendern, bietet aber nicht die beste Beleuchtungsqualität. Es ist besser, Umgebungslicht aus :ref:`ReflectionProbe <doc_reflection_probes>`, :ref:`VoxelGI <doc_using_voxel_gi>` oder :ref:`SDFGI <doc_using_sdfgi>` zu erzeugen, da diese die Ausbreitung von indirektem Licht genauer simulieren. Nachfolgend finden Sie einen Qualitätsvergleich zwischen der Verwendung einer flachen Umgebungsfarbe und eines VoxelGI:
zh_cn: 一般来说，只有简单的场景或大型外部场景才应该依赖于环境光。你也可以这样做来提高性能。环境光的渲染速度很快，但无法提供最佳的照明质量。最好使用 :ref:`ReflectionProbe <doc_reflection_probes>`\ 、\ :ref:`VoxelGI <doc_using_voxel_gi>` 或 :ref:`SDFGI <doc_using_sdfgi>` 生成环境光，因为它们将更准确地模拟间接光的传播方式。下面是使用平面环境色和 VoxelGI 之间的质量比较：

source: Using one of the methods described above will replace constant ambient lighting with ambient lighting from the probes.
de: Mit einer der oben beschriebenen Methoden wird die konstante Umgebungsbeleuchtung durch die Umgebungsbeleuchtung der Probes ersetzt.
zh_cn: 使用上述方法之一，将使用来自探针的环境照明，代替恒定的环境照明。

source: Reflected light
de: Reflektiertes Licht
zh_cn: 反射光

source: Reflected light (also called specular light) is the other of the two components of image-based lighting.
de: Reflektiertes Licht (auch Specular Light genannt) ist die andere der beiden Komponenten der bildbasierten Beleuchtung.
zh_cn: 反射光（也称为镜面光）是基于图像的照明的两个组成部分中的另一个。

source: Reflected light can be set to one of 3 modes:
de: Reflektiertes Licht kann auf einen von 3 Modi eingestellt werden:
zh_cn: 反射光可以设置为三种模式之一：

source: **Background:** Reflect from the background, such as the sky, custom color or clear color (default).
de: **Hintergrund:** Reflektiert den Hintergrund, z.B. den Himmel, eine benutzerdefinierte Farbe oder eine Clear-Farbe (Default).
zh_cn: **Background：** （背景）从背景反射，例如天空、自定义颜色或透明颜色（默认）。

source: **Disabled:** Do not reflect any light from the environment. Useful for purely indoor scenes, or to maximize performance on low-end devices.
de: **Deaktiviert:** Reflektiert kein Licht aus der Umgebung. Nützlich für reine Innenraumszenen oder zur Maximierung der Performance auf Low-End-Geräten.
zh_cn: **Disabled：** （禁用）不反射环境中的任何光线。 适用于纯粹的室内场景，或最大限度地提高低端设备的性能。

source: **Sky:** Reflect from the background sky, even if the background is set to a mode other than **Sky**. If the background mode is already **Sky**, this mode behaves identically to **Background**.
de: **Himmel:** Reflektiert vom Hintergrundhimmel, auch wenn der Hintergrund auf einen anderen Modus als **Himmel** eingestellt ist. Wenn der Hintergrundmodus bereits **Himmel** ist, verhält sich dieser Modus identisch zu **Hintergrund**.
zh_cn: **Sky：** （天空）从背景天空反射，即使背景设置为 **Sky** 以外的模式。 如果背景模式已经是 **Sky** ，则此模式的行为与 **Background** 相同。

source: Fog
de: Nebel
zh_cn: 雾

source: This section refers to non-volumetric fog only. It is possible to use both non-volumetric fog and :ref:`doc_volumetric_fog` at the same time.
de: Dieser Abschnitt bezieht sich nur auf nicht-volumetrischen Nebel. Es ist möglich, sowohl nicht-volumetrischen Nebel als auch :ref:`doc_volumetric_fog` gleichzeitig zu verwenden.
zh_cn: 本节仅涉及非体积雾。 可以同时使用非体积雾和 :ref:`doc_volumetric_fog`。

source: Fog, as in real life, makes distant objects fade away into a uniform color. There are two kinds of fog in Godot:
de: Wie im wirklichen Leben lässt der Nebel entfernte Objekte in eine einheitlichen Farbe verblassen. Es gibt zwei Arten von Nebel in Godot:
zh_cn: 雾。就像在现实生活中一样，使远处的物体逐渐消失成均匀的颜色。Godot 中有两种雾：

source: **Depth Fog:** This one is applied based on the distance from the camera.
de: **Tiefennebel:** Dieser wird basierend auf der Entfernung von der Kamera angewendet.
zh_cn: **深度雾:** 这个基于距相机的距离来应用.

source: **Height Fog:** This one is applied to any objects below (or above) a certain height, regardless of the distance from the camera.
de: **Höhennebel:** Dieser wird auf alle Objekte unterhalb (oder oberhalb) einer bestimmten Höhe angewendet, unabhängig von der Entfernung zur Kamera.
zh_cn: **高度雾:** 此高度应用于任何低于(或高于)某个高度的物体, 无论距离相机的距离如何.

source: Both of these fog types can have their curve tweaked, making their transition more or less sharp.
de: Bei beiden Nebeltypen kann die Kurve angepasst werden, so dass der Übergang mehr oder weniger scharf ist.
zh_cn: 这两种雾类型都可以调整它们的曲线, 使它们的过渡或多或少变得清晰.

source: Two properties can be tweaked to make the fog effect more interesting:
de: Zwei Propertys können verändert werden, um den Nebel-Effekt interessanter zu machen:
zh_cn: 可以调整两个属性以使雾效果更有趣:

source: The first is **Sun Amount**, which makes use of the Sun Color property of the fog. When looking towards a directional light (usually a sun), the color of the fog will be changed, simulating the sunlight passing through the fog.
de: Die erste ist **Sonnen-Menge**, die von der Property "Sonnen-Farbe" des Nebels abhängt. Wenn Sie in Richtung eines gerichteten Lichts (in der Regel eine Sonne) blicken, ändert sich die Farbe des Nebels und simuliert das Sonnenlicht, das durch den Nebel fällt.
zh_cn: 第一个是 **Sun Amount**\ ，它利用雾的太阳颜色属性。当朝向平行光（通常是太阳）时，雾的颜色将会改变，模拟穿过雾的阳光。

source: The second is **Transmit Enabled** which simulates more realistic light transmittance. In practice, it makes light stand out more across the fog.
de: Die zweite Option ist **Transmission Aktiviert**, die eine realistischere Licht-Transmission simuliert. In der Praxis hebt sich das Licht dadurch stärker im Nebel ab.
zh_cn: 第二个是 **Transmit Enabled**\ ，可以模拟更逼真的透射率。实践中会使光线在雾中更加突出。

source: Volumetric Fog
de: Volumetrischer Nebel
zh_cn: 体积雾

source: Volumetric fog provides a realistic fog effect to the scene, with fog color being affected by the lights that traverse the fog.
de: Volumetrischer Nebel sorgt für einen realistischen Nebeleffekt in der Szene, wobei die Farbe des Nebels von den Lichtern beeinflusst wird, die den Nebel durchdringen.
zh_cn: 体积雾为场景提供了逼真的雾效果，雾的颜色受到穿过雾的灯光的影响。

source: See :ref:`doc_volumetric_fog` for documentation on setting up volumetric fog.
de: Siehe :ref:`doc_volumetric_fog` für die Dokumentation zum Einrichten von volumetrischem Nebel.
zh_cn: 有关设定体积雾的内容，请参看 :ref:`doc_volumetric_fog`。

source: Tonemap
zh_cn: 色调映射

source: Tonemap selects the tonemapping curve that will be applied to the scene, from a list of standard curves used in the film and game industries. Tonemapping operators other than Linear are used to make light and dark areas more homogeneous, while also avoiding clipping of bright highlights.
de: Tonemap wählt die Tonemapping-Kurve, die auf die Szene angewendet wird, aus einer Liste von Standardkurven aus, die in der Film- und Spieleindustrie verwendet werden. Andere Tonemapping-Operatoren als "Linear" werden verwendet, um helle und dunkle Bereiche homogener zu machen und gleichzeitig das Abschneiden heller Lichter zu vermeiden.
zh_cn: 色调映射从电影和游戏行业使用的标准曲线列表中，选择将应用于场景的色调映射曲线。除了 Linear （线性）之外，的色调映射运算子可使得亮部和暗部区域更加均匀，同时防止高亮区域受到裁剪。

source: The tone mapping options are:
de: Die Optionen für die Tonemapping sind:
zh_cn: 色调映射选项有：

source: **Mode:** The tone mapping mode to use.
de: **Modus:** Der zu verwendende Tonemapping-Modus.
zh_cn: **Mode（模式）：**\ 色调映射所使用的模式。

source: **Linear:** The default tonemapping mode. This is the fastest and simplest tonemapping operator, but it causes bright lighting to look blown out, with noticeable clipping in the output colors.
de: **Linear:** Der Default-Tonemapping-Modus. Dies ist der schnellste und einfachste Tonemapping-Operator, aber er führt dazu, dass helle Beleuchtungen überstrahlt aussehen und die ausgegebenen Farben deutlich beschnitten werden.
zh_cn: **Linear（线性）：**\ 默认的色调映射模式。这是最快也是最简单的色调映射运算子，但会导致高亮区域过曝，输出颜色出现可见的裁剪。

source: **Reinhardt:** Performs a variation on rendered pixels' colors by this formula: ``color = color / (1 + color)``. This avoids clipping bright highlights, but the resulting image can look a bit dull.
de: **Reinhardt:** Führt eine Variation der Farben der gerenderten Pixel nach dieser Formel durch: ``Farbe = Farbe / (1 + Farbe)``. Dadurch wird vermieden, dass helle Lichter abgeschnitten werden, aber das resultierende Bild kann etwas stumpf aussehen.
zh_cn: **Reinhardt：**\ 对渲染后像素的颜色按照这个公式执行变化：\ ``color = color / (1 + color)``\ 。可以防止裁剪高亮区域，但最终的图像可能会有些暗淡。

source: **Filmic:** This avoids clipping bright highlights, with a resulting image that usually looks more vivid than Reinhardt.
de: **Filmisch:** Dadurch wird die Beschneidung heller Lichter vermieden, und das Bild wirkt in der Regel lebendiger als bei Reinhardt.
zh_cn: **Filmic：**\ 防止裁剪高亮区域，最终的图像通常比 Reinhardt 鲜艳。

source: **ACES:** Academy Color Encoding System tonemapper. ACES is slightly more expensive than other options, but it handles bright lighting in a more realistic fashion by desaturating it as it becomes brighter. ACES typically has a more contrasted output compared to Reinhardt and Filmic. ACES is the recommended option when aiming for photorealistic visuals. This tonemapping mode was called "ACES Fitted" in Godot 3.x.
de: **ACES:** Academy Color Encoding System-Tonemapper. ACES ist etwas teurer als andere Optionen, aber es behandelt helle Beleuchtung auf realistischere Weise, indem es sie entsättigt, wenn sie heller wird. Im Vergleich zu Reinhardt und Filmisch hat ACES in der Regel eine kontrastreichere Ausgabe. ACES ist die empfohlene Option, wenn Sie eine fotorealistische Darstellung anstreben. Dieser Tonemapping-Modus wurde in Godot 3.x als "ACES Fitted" bezeichnet.
zh_cn: **ACES：**\ Academy Color Encoding System（学院色彩编码系统）色调映射器。ACES 比其他选项更耗性能一些，但对于高亮区域的处理方式更真实，越亮饱和度越低。ACES 输出的图像通常比 Reinhardt 和 Filmic 的对比度更高。想要让画面更具真实感时，推荐选用 ACES。该色调映射器在 Godot 3.x 中被叫做"ACES Fitted"。

source: **Exposure:** Tone mapping exposure which simulates amount of light received over time (default: ``1.0``). Higher values result in an overall brighter appearance. If the scene appears too dark as a result of a tonemapping operator or whitepoint change, try increasing this value slightly.
de: **Belichtung:** Tone-Mapping-Belichtung zur Simulation der Lichtmenge, die im Laufe der Zeit empfangen wird (Standard: ``1.0``). Höhere Werte führen zu einem insgesamt helleren Erscheinungsbild. Wenn die Szene infolge eines Tonemapping-Operators oder einer Weißpunktänderung zu dunkel erscheint, versuchen Sie, diesen Wert leicht zu erhöhen.
zh_cn: **Exposure（曝光）：**\ 色调映射曝光，模拟长时间获取的光照量（默认：\ ``1.0``\ ）。值越高，整体更亮。修改色调映射运算子或白点后，如果场景看上去太暗，请尝试将这个值略微调高。

source: **White:** Tone mapping whitepoint, which simulates where in the scale white is located (default: ``1.0``). For photorealistic lighting, recommended values are between ``6.0`` and ``8.0``. Higher values result in less blown out highlights, but make the scene appear slightly darker as a whole.
de: **Weiß:** Tone-Mapping-Weißpunkt, der simuliert, wo auf der Skala Weiß liegt (Default: ``1.0``). Für fotorealistische Beleuchtung liegen die empfohlenen Werte zwischen ``6.0`` und ``8.0``. Höhere Werte führen zu weniger überstrahlten Lichtern, lassen aber die Szene insgesamt etwas dunkler erscheinen.
zh_cn: **White（白点）：**\ 光照映射白点，模拟白色在整个尺度中所处的位置（默认：\ ``1.0``\ ）。为了让光照更真实，推荐使用 ``6.0`` 到 ``8.0`` 之间的值。值越高，高光区域更少过曝，但会让场景整体看起来更暗。

source: Mid- and post-processing effects
de: Mid- und Post-Processing-Effekte
zh_cn: 中后期处理效果

source: The Environment resource supports many popular mid- and post-processing effects.
de: Die Environment-Ressource unterstützt viele gängige Mid- und Post-Processing-Effekte.
zh_cn: 环境资源支持许多流行的中间和后期处理效果。

source: Screen-space effects such as :abbr:`SSR (Screen-Space Reflections)`, :abbr:`SSAO (Screen-Space Ambient Occlusion)`, :abbr:`SSIL (Screen-Space Indirect Lighting)` and glow do not operate on geometry that is located outside the camera view or is occluded by other opaque geometry. Consider this when tweaking their settings to avoid distracting changes during gameplay.
de: Screen-Space-Effekte wie :abbr:`SSR (Screen-Space Reflections)`, :abbr:`SSAO (Screen-Space Ambient Occlusion)`, :abbr:`SSIL (Screen-Space Indirect Lighting)` und Glow wirken nicht auf Geometrie, die sich außerhalb des Blickfeldes der Kamera befindet oder durch andere undurchsichtige Geometrie verdeckt ist. Berücksichtigen Sie dies, wenn Sie die Einstellungen anpassen, um ablenkende Änderungen während des Spiels zu vermeiden.
zh_cn: 屏幕空间效果，例如 :abbr:`SSR (Screen-Space Reflections, 屏幕空间反射)`\ 、\ :abbr:`SSAO (Screen-Space Ambient Occlusion, 屏幕空间环境光遮挡)`\ 、\ :abbr:`SSIL (Screen-Space Indirect Lighting, 屏幕空间间接照明)`\ 和辉光不会对位于相机视图之外的，或被其他不透明几何体遮挡的几何体进行操作。 调整设置时请考虑这一点，以避免在游戏过程中发生分散注意力的变化。

source: Screen-Space Reflections (SSR)
de: Screen-Space-Reflexionen (SSR)
zh_cn: 屏幕空间反射(SSR)

source: *This feature is only available when using the Forward+ backend, not Mobile or Compatibility.*
de: *Dieses Feature ist nur verfügbar, wenn Sie das Forward+-Backend verwenden, nicht Mobile oder Kompatibilität*.
zh_cn: *此功能仅在使用 Forward+ 后端时可用，移动或兼容性后端中不可用。*

source: While Godot supports several sources of reflection data such as :ref:`doc_reflection_probes`, they may not provide enough detail for all situations. Scenarios where screen-space reflections make the most sense are when objects are in contact with each other (object over floor, over a table, floating on water, etc).
de: Godot unterstützt zwar mehrere Quellen für Reflexionsdaten, wie z.B. :ref:`doc_reflection_probes`, doch bieten sie nicht in allen Situationen genügend Details. Am sinnvollsten sind Screen-Space-Reflexionen, wenn Objekte miteinander in Kontakt sind (Objekt über dem Boden, über einem Tisch, auf Wasser schwimmend usw.).
zh_cn: 虽然 Godot 支持多种反射数据源，例如 :ref:`doc_reflection_probes`，但它们可能无法为所有情况提供足够的细节。屏幕空间反射最有意义的场景是物体彼此接触时（地板上的物体、桌子上的物体、漂浮在水面上等）。

source: On top of providing more detail, screen-space reflections also work in real-time (while other types of reflections are usually precomputed). This can be used to make characters, cars, etc. reflect on surrounding surfaces when moving around.
de: Abgesehen davon, dass sie mehr Details bieten, funktionieren Screen-Space-Reflexionen auch in Echtzeit (während andere Arten von Reflexionen normalerweise vorberechnet werden). Dies kann verwendet werden, um Charaktere, Autos usw. bei der Bewegung auf umliegenden Oberflächen zu reflektieren.
zh_cn: 除了提供更多细节之外，屏幕空间反射还可以实时工作（而其他类型的反射通常是预先计算的）。这可用于使角色、汽车等在移动时反射到周围的表面上。

source: Screen-space reflections can be used at the same time as other reflection sources to benefit from detailed reflections when possible, while having a fallback when screen-space reflections cannot be used (for example, to reflect off-screen objects).
de: Screen-Space-Reflexionen können gleichzeitig mit anderen Reflexionsquellen verwendet werden, um von detaillierten Reflexionen zu profitieren, wenn möglich, und gleichzeitig eine Ausweichmöglichkeit zu haben, wenn Screen-Space-Reflexionen nicht verwendet werden können (zum Beispiel, um Objekte außerhalb des Bildschirms zu reflektieren).
zh_cn: 屏幕空间反射可以与其他反射源同时使用，以便在可能的情况下从详细反射中受益，同时在无法使用屏幕空间反射时进行回退（例如，反射屏幕外对象）。

source: A few user-controlled parameters are available to better tweak the technique:
de: Zur besseren Anpassung der Methode stehen ein paar benutzergesteuerte Parameter zur Verfügung:
zh_cn: 一些用户控制的参数可用于更好地调整技术:

source: **Max Steps:** Determines the length of the reflection. The bigger this number, the more costly it is to compute.
de: **Max. Schritte:** Bestimmt die Länge der Reflexion. Je größer diese Zahl ist, desto aufwendiger ist die Berechnung.
zh_cn: **最大步数** 确定反射的长度. 这个数字越大, 计算成本就越高.

source: **Fade In:** Allows adjusting the fade-in curve, which is useful to make the contact area softer.
de: **Fade-In:** Ermöglicht die Anpassung der Fade-In-Kurve, die nützlich ist, um die Kontaktfläche weicher zu machen.
zh_cn: **淡入** 允许调整淡入曲线, 这有助于使接触区域更柔和.

source: **Fade Out:** Allows adjusting the fade-out curve, so the step limit fades out softly.
de: **Fade-Out:** Ermöglicht die Einstellung der Fade-Out-Kurve, so dass die Stufengrenze sanft ausklingt.
zh_cn: **淡出** 允许调整淡出曲线, 因此步长限制会轻微淡出.

source: **Depth Tolerance:** Can be used to allow screen-space rays to pass behind objects. The rays will treat each object as if it has this depth in determining if it can pass behind the object. Higher values will make screen-space reflections exhibit fewer "breakups", at the cost of some objects creating physically incorrect reflections.
de: **Tiefentoleranz:** Kann verwendet werden, um Strahlen im Screen-Space hinter Objekten durchzulassen. Die Strahlen werden jedes Objekt so behandeln, als ob es diese Tiefe hätte, um festzustellen, ob sie hinter dem Objekt durchgehen können. Höhere Werte bewirken, dass die Reflexionen im Bildschirmraum weniger "Aufbrüche" aufweisen, was allerdings zur Folge hat, dass einige Objekte physikalisch falsche Reflexionen erzeugen.
zh_cn: **深度公差(Depth Tolerance)：** 可用于允许屏幕空间光线穿过对象后面。 光线将把每个对象视为具有此深度，以确定它是否可以从该对象后面穿过。 较高的值将使屏幕空间反射表现出更少的“分裂”，但代价是某些对象会创建物理上不正确的反射。

source: Keep in mind that screen-space-reflections only work for reflecting opaque geometry. Transparent materials won't be reflected, as they don't write to the depth buffer. This also applies to shaders that use ``hint_screen_texture`` or ``hint_depth_texture`` uniforms.
de: Denken Sie daran, dass Screen-Space-Reflexionen nur bei undurchsichtiger Geometrie funktionieren. Transparente Materialien werden nicht reflektiert, da sie nicht in den Tiefenpuffer geschrieben werden. Dies gilt auch für Shader, die ``hint_screen_texture`` oder ``hint_depth_texture``-Uniforms verwenden.
zh_cn: 请记住，屏幕空间反射仅适用于反射不透明几何体。透明材质无法反射，因为它们不会写入深度缓冲。同样也适用于使用 ``SCREEN_TEXTURE`` 或 ``DEPTH_TEXTURE`` 的着色器。

source: Screen-Space Ambient Occlusion (SSAO)
zh_cn: 屏幕空间环境遮挡(SSAO)

source: As mentioned in the **Ambient** section, areas where light from light nodes does not reach (either because it's outside the radius or shadowed) are lit with ambient light. Godot can simulate this using VoxelGI, ReflectionProbe, the Sky, or a constant ambient color. The problem, however, is that all the methods proposed previously act more on a larger scale (large regions) than at the smaller geometry level.
de: Wie im Abschnitt **Umgebung** erwähnt, werden Bereiche, die vom Licht der Nodes nicht erreicht werden (weil sie entweder außerhalb des Radius oder im Schatten liegen), mit Umgebungslicht beleuchtet. Godot kann dies mit VoxelGI, ReflectionProbe, dem Himmel oder einer konstanten Umgebungsfarbe simulieren. Das Problem ist jedoch, dass alle zuvor vorgeschlagenen Methoden eher auf einer größeren Skala (große Regionen) als auf einer kleineren Geometrieebene wirken.
zh_cn: 正如在 **环境** 部分提到的， 光节点的光线无法到达的区域会被环境光照亮(要么是因为它在半径之外, 要么是阴影)。Godot可以使用GIProbe，ReflectionProbe，Sky或恒定的环境色来模拟这种情况。但问题是，之前提出的所有方法都更多地作用于较大的尺度(大区域)，而不是较小的几何体层面。

source: Constant ambient color and Sky are the same everywhere, while GI and Reflection probes have more local detail, but not enough to simulate situations where light is not able to fill inside hollow or concave features.
de: Konstante Umgebungsfarbe und Himmel sind überall gleich, während GI- und Reflexions-Probes mehr lokale Details aufweisen, aber nicht genug, um Situationen zu simulieren, in denen das Licht nicht in der Lage ist, hohle oder konkave Merkmale auszufüllen.
zh_cn: 恒定环境色和Sky在任何地方都是一样的, 而GI和反射探针的局部细节较多, 但不足以模拟光线无法填充到中空或凹面特征内部的情况.

source: This can be simulated with Screen Space Ambient Occlusion. As you can see in the image below, its purpose is to make sure concave areas are darker, simulating a narrower path for the light to enter:
de: Dies kann mit Screen-Space-Ambient Occlusion simuliert werden. Wie Sie auf dem Bild unten sehen können, besteht sein Zweck darin, konkave Bereiche dunkler zu machen, um einen engeren Pfad für den Lichteinfall zu simulieren:
zh_cn: 这可以用屏幕空间环境遮挡来模拟. 如下图所示, 它的目的是确保凹陷区域更暗, 模拟光线进入的较窄路径:
