Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: de, zh_cn

source: It is a common mistake to enable this effect, turn on a light, and not be able to appreciate it. This is because :abbr:`SSAO (Screen-Space Ambient Occlusion)` only acts on *ambient* light. It does not affect direct light.
de: Es ist ein häufiger Fehler, diesen Effekt zu aktivieren, ein Licht einzuschalten und nicht in der Lage zu sein, ihn wahrzunehmen. Das liegt daran, dass :abbr:`SSAO (Screen-Space-Ambient Occlusion)` nur auf *Umgebungslicht* wirkt. Es wirkt nicht auf direktes Licht.
zh_cn: 启用此效果、打开灯却无法欣赏到它是一个常见的错误。这是因为 :abbr:`SSAO (Screen-Space Ambient Occlusion)` 仅作用于\ *环境光*\。而不是直接光。

source: This is why, in the image above, the effect is less noticeable under the direct light (on the left). If you want to force :abbr:`SSAO (Screen-Space Ambient Occlusion)` to work with direct light too, use the **Light Affect** parameter. Even though this is not physically correct, some artists like how it looks.
de: Aus diesem Grund ist der Effekt im obigen Bild bei direktem Licht (links) weniger ausgeprägt. Wenn Sie :abbr:`SSAO (Screen-Space-Ambient Occlusion)` auch mit direktem Licht arbeiten lassen wollen, verwenden Sie den Parameter **Lichtbeeinflussung**. Auch wenn dies physikalisch nicht korrekt ist, gefällt einigen Künstlern, wie es aussieht.
zh_cn: 这就是为什么在上图中，直射光下效果不太明显的原因（左侧）。如果你想强制 SSAO（屏幕空间环境光遮蔽） 也在直射光下工作，请使用 **Light Affect**\ （光线影响）参数（尽管并这不好，但有些设计师喜欢它的外观）。

source: :abbr:`SSAO (Screen-Space Ambient Occlusion)` looks best when combined with a real source of indirect light, like VoxelGI:
de: :abbr:`SSAO (Screen-Space Ambient Occlusion)` sieht am besten aus, wenn es mit einer echten indirekten Lichtquelle, wie VoxelGI, kombiniert wird:
zh_cn: 当与 VoxelGI 等真正的间接光源结合使用时，\ :abbr:`SSAO (Screen-Space Ambient Occlusion)` 看起来最佳：

source: Tweaking :abbr:`SSAO (Screen-Space Ambient Occlusion)` is possible with several parameters:
de: :abbr:`SSAO (Screen-Space-Ambient Occlusion)` sieht am besten aus, wenn es mit einer echten indirekten Lichtquelle, wie VoxelGI, kombiniert wird:
zh_cn: 可以使用以下几个参数调整 :abbr:`SSAO (Screen-Space Ambient Occlusion)`:

source: **Radius:** The distance at which objects can occlude each other when calculating screen-space ambient occlusion. Higher values will result in occlusion over a greater distance at the cost of performance and quality.
de: **Radius:** Der Abstand, in dem sich Objekte bei der Berechnung der Screen-Space-Ambient Occlusion gegenseitig verdecken können. Höhere Werte führen zu einer Verdeckung über eine größere Entfernung auf Kosten der Performance und Qualität.
zh_cn: **Radius：**\ 半径，计算屏幕空间环境光遮挡时对象可以相互遮挡的距离。 较高的值将导致更远距离的遮挡，但会牺牲性能和质量。

source: **Intensity:** The primary screen-space ambient occlusion intensity. Acts as a multiplier for the screen-space ambient occlusion effect. A higher value results in darker occlusion. Since :abbr:`SSAO (Screen-Space Ambient Occlusion)` is a screen-space effect, it's recommended to remain conservative with this value. :abbr:`SSAO (Screen-Space Ambient Occlusion)` that is too strong can be distracting during gameplay.
de: **Intensität:** Die primäre Screen-Space-Ambient Occlusion-Intensität. Wirkt wie ein Multiplikator für den Screen-Space-Ambient Occlusion-Effekt. Ein höherer Wert führt zu einer dunkleren Occlusion. Da es sich bei :abbr:`SSAO (Screen-Space-Ambient Occlusion)` um einen Screen-Space-Effekt handelt, wird empfohlen, mit diesem Wert konservativ umzugehen. :abbr:`SSAO (Screen-Space-Ambient Occlusion)`, das zu stark ist, kann während des Spielens ablenken.
zh_cn: **Intensity：**\ 主屏幕空间环境光遮挡强度。充当屏幕空间环境光遮挡效果的乘数。 值越高，遮挡越暗。 由于 :abbr:`SSAO (Screen-Space Ambient Occlusion，屏幕空间环境光遮蔽)` 是一种屏幕空间效果，因此建议对此值保持保守。\ :abbr:`SSAO (Screen-Space Ambient Occlusion,，屏幕空间环境光遮蔽)`\ 太强可能会在游戏过程中分散注意力。

source: **Power:** The distribution of occlusion. A higher value results in darker occlusion, similar to **Intensity**, but with a sharper falloff.
de: **Stärke:** Die Verteilung der Occlusion. Ein höherer Wert führt zu einer dunkleren Occlusion, ähnlich wie bei **Intensität**, aber mit einem stärkeren Abfall.
zh_cn: **Power：**\ 力度，遮挡的分布。值越高，遮挡越暗，类似于 **Intensity**\ ，但衰减更剧烈。

source: **Detail:** Sets the strength of the additional level of detail for the screen-space ambient occlusion effect. A high value makes the detail pass more prominent, but it may contribute to aliasing in your final image.
de: **Detail:** Legt die Stärke des zusätzlichen Detailgrads für den Screen-Space-Ambient Occlusion-Effekt fest. Ein hoher Wert macht den Detail-Durchlauf deutlicher, kann aber zu Aliasing in Ihrem endgültigen Bild beitragen.
zh_cn: **Detail：**\ 细节，设置屏幕空间环境光遮挡效果的附加细节级别的强度。 高值会使细节通道更加突出，但可能会导致最终图像出现锯齿。

source: **Horizon:** The threshold for considering whether a given point on a surface is occluded or not represented as an angle from the horizon mapped into the 0.0-1.0 range. A value of 1.0 results in no occlusion.
de: **Horizont:** Der Schwellenwert für die Beurteilung, ob ein bestimmter Punkt auf einer Fläche verdeckt ist oder nicht, wird als Winkel zum Horizont dargestellt, der in den Bereich 0,0-1,0 eingeordnet wird. Ein Wert von 1,0 bedeutet, dass keine Verdeckung auftritt.
zh_cn: **水平线(Horizon)：** 考虑表面上的给定点是否被遮挡或未表示为映射到 0.0-1.0 范围内的地平线的角度的阈值。 值为 1.0 表示无遮挡。

source: **Sharpness:** The amount that the screen-space ambient occlusion effect is allowed to blur over the edges of objects. Setting too high will result in aliasing around the edges of objects. Setting too low will make object edges appear blurry.
de: **Schärfe:** Die Stärke, mit welcher der Screen-Space-Ambient Occlusion-Effekt die Kanten von Objekten verwischen darf. Eine zu hohe Einstellung führt zu Aliasing an den Kanten von Objekten. Eine zu niedrige Einstellung lässt die Objektkanten verschwommen erscheinen.
zh_cn: **锐利度(Sharpness)：** 允许屏幕空间环境光遮挡效果在对象边缘模糊的量。 设置太高会导致对象边缘出现锯齿。 设置太低会使对象边缘显得模糊。

source: **Light Affect:** The screen-space ambient occlusion intensity in direct light. In real life, ambient occlusion only applies to indirect light, which means its effects can't be seen in direct light. Values higher than 0 will make the :abbr:`SSAO (Screen-Space Ambient Occlusion)` effect visible in direct light. Values above ``0.0`` are not physically accurate, but some artists prefer this effect.
de: **Lichteinfluss:** Die Screen-Space-Ambient Occlusion-Intensität bei direktem Licht. Im wirklichen Leben gilt Ambient Occlusion nur für indirektes Licht, was bedeutet, dass seine Auswirkungen bei direktem Licht nicht zu sehen sind. Werte größer als 0 machen den :abbr:`SSAO (Screen-Space-Ambient Occlusion)` Effekt bei direktem Licht sichtbar. Werte über ``0.0`` sind physikalisch nicht korrekt, aber einige Künstler bevorzugen diesen Effekt.
zh_cn: **光效(Light Affect)：** 直射光下的屏幕空间环境光遮挡强度。 在现实生活中，环境光遮挡仅适用于间接光，这意味着在直射光下无法看到其效果。 高于 0 的值将使 :abbr:` SSAO (Screen-Space Ambient Occlusion, 屏幕空间环境光遮挡)`效果在直射光下可见。 高于 ``0.0`` 的值在物理上并不准确，但一些艺术家更喜欢这种效果。

source: Screen-Space Indirect Lighting (SSIL)
zh_cn: 屏幕空间间接光照（SSIL）

source: :abbr:`SSIL (Screen-Space Indirect Lighting)` provides indirect lighting for small details or dynamic geometry that other global illumination techniques cannot cover. This applies to bounced diffuse lighting, but also emissive materials. When :abbr:`SSIL (Screen-Space Indirect Lighting)` is enabled on its own, the effect may not be that noticeable, which is intended.
de: :abbr:`SSIL (Screen-Space Indirect Lighting)` bietet indirekte Beleuchtung für kleine Details oder dynamische Geometrien, die von anderen Global Illumination-Methoden nicht abgedeckt werden können. Dies gilt für diffuses Licht, aber auch für emittierende Materialien. Wenn :abbr:`SSIL (Screen-Space Indirect Lighting)` allein aktiviert ist, ist der Effekt möglicherweise nicht so auffällig, was auch beabsichtigt ist.
zh_cn: :abbr:`SSIL (Screen-Space Indirect Lighting, 屏幕空间间接照明)` 为其他全局照明技术无法覆盖的小细节或动态几何体提供间接照明。 这适用于反射漫反射照明，也适用于自发光材料。 当单独启用 :abbr:`SSIL (Screen-Space Indirect Lighting, 屏幕空间间接照明)` 时，效果可能不会像预期那样明显。

source: Instead, :abbr:`SSIL (Screen-Space Indirect Lighting)` is meant to be used as a *complement* to other global illumination techniques such as VoxelGI, SDFGI and LightmapGI. :abbr:`SSIL (Screen-Space Indirect Lighting)` also provides a subtle ambient occlusion effect, similar to SSAO but with less detail.
de: Stattdessen ist :abbr:`SSIL (Screen-Space Indirect Lighting)` als *Ergänzung* zu anderen Global Illumination-Methoden wie VoxelGI, SDFGI und LightmapGI gedacht. :abbr:`SSIL (Screen-Space Indirect Lighting)` bietet auch einen subtilen Ambient Occlusion-Effekt, ähnlich wie SSAO aber mit weniger Details.
zh_cn: 相反，\ :abbr:`SSIL (Screen-Space Indirect Lighting, 屏幕空间间接照明)` 旨在用作其他全局照明技术（例如 VoxelGI、SDFGI 和 LightmapGI）的“补充”。\ :abbr:`SSIL (Screen-Space Indirect Lighting, 屏幕空间间接照明)` 还提供微妙的环境光遮挡效果，与 SSAO 类似，但细节较少。

source: This feature only provides indirect lighting. It is not a full global illumination solution. This makes it different from screen-space global illumination (SSGI) offered by other 3D engines. :abbr:`SSIL (Screen-Space Indirect Lighting)` can be combined with :abbr:`SSR (Screen-Space Reflections)` and/or :abbr:`SSAO (Screen-Space Ambient Occlusion)` for greater visual quality (at the cost of performance).
de: Dieses Feature bietet nur indirekte Beleuchtung. Es handelt sich nicht um eine vollständige Global Illumination-Lösung. Dadurch unterscheidet sie sich von der Screen-Space Global Illumination (SSGI), die von anderen 3D-Engines angeboten wird. :abbr:`SSIL (Screen-Space Indirect Lighting)` kann mit :abbr:`SSR (Screen-Space Reflexionen)` und/oder :abbr:`SSAO (Screen-Space Ambient Occlusion)` kombiniert werden, um die visuelle Qualität zu verbessern (auf Kosten der Performance).
zh_cn: 此功能仅提供间接光照，并不是完整的全局光照解决方案，与其他 3D 引擎所提供的屏幕空间全局光照（SSGI）是不同的。\ :abbr:`SSIL (Screen-Space Indirect Lighting，屏幕空间间接光照)` 可以与 :abbr:`SSR (Screen-Space Reflections，屏幕空间反射)` 和/或 :abbr:`SSAO (Screen-Space Ambient Occlusion，屏幕空间环境光遮蔽)` 组合使用，实现更高的画质（有额外性能开销）。

source: Tweaking :abbr:`SSIL (Screen-Space Indirect Lighting)` is possible with several parameters:
de: Die Einstellung von :abbr:`SSIL (Screen-Space Indirect Lighting)` ist mit verschiedenen Parametern möglich:
zh_cn: 可以使用几个参数调整 :abbr:`SSIL (Screen-Space Indirect Lighting, 屏幕空间间接照明)`:

source: **Radius:** The distance that bounced lighting can travel when using the screen space indirect lighting effect. A larger value will result in light bouncing further in a scene, but may result in under-sampling artifacts which look like long spikes surrounding light sources.
de: **Radius:** Die Entfernung, die das zurückgeworfene Licht bei der Verwendung des indirekten Lichteffekts im Screen-Space zurücklegen kann. Ein größerer Wert führt dazu, dass das Licht in einer Szene weiter gestreut wird, kann aber zu Artefakten durch Unterabtastung führen, die wie lange Spitzen um Lichtquellen herum aussehen.
zh_cn: **半径(Radius)：** 使用屏幕空间间接照明效果时，反射照明可以行进的距离。 较大的值将导致场景中的光线进一步反弹，但可能会导致采样不足的伪像，看起来像光源周围的长尖峰。

source: **Intensity:** The brightness multiplier for the screen-space indirect lighting effect. A higher value will result in brighter light.
de: **Intensität:** Der Helligkeitsmultiplikator für den indirekten Lichteffekt im Screen-Space. Ein höherer Wert führt zu einem helleren Licht.
zh_cn: **强度(Intensity)：** 屏幕空间间接照明效果的亮度乘数。 值越高，光线越亮。

source: **Sharpness:** The amount that the screen-space indirect lighting effect is allowed to blur over the edges of objects. Setting too high will result in aliasing around the edges of objects. Setting too low will make object edges appear blurry.
de: **Schärfe:** Die Stärke, mit welcher der indirekte Lichteffekt im Screen-Space die Kanten von Objekten verwischen darf. Eine zu hohe Einstellung führt zu Aliasing an den Kanten von Objekten. Eine zu niedrige Einstellung lässt die Objektkanten verschwommen erscheinen.
zh_cn: **清晰度(Sharpness)：** 允许屏幕空间间接照明效果在对象边缘模糊的量。 设置太高会导致对象边缘出现锯齿。 设置太低会使对象边缘显得模糊。

source: **Normal Rejection:** Amount of normal rejection used when calculating screen-space indirect lighting. Normal rejection uses the normal of a given sample point to reject samples that are facing away from the current pixel. Normal rejection is necessary to avoid light leaking when only one side of an object is illuminated. However, normal rejection can be disabled if light leaking is desirable, such as when the scene mostly contains emissive objects that emit light from faces that cannot be seen from the camera.
de: **Normalen-Unterdrückung:** Betrag der Normalen-Unterdrückung, der bei der Berechnung der indirekten Beleuchtung im Bildschirmraum verwendet wird. Bei der Normalen-Unterdrückung wird die Normale eines bestimmten Abtastpunkts verwendet, um Abtastungen zu unterdrücken, die vom aktuellen Pixel weg zeigen. Die Normalen-Unterdrückung ist notwendig, um Lichtlecks zu vermeiden, wenn nur eine Seite eines Objekts beleuchtet wird. Die Normalen-Unterdrückung kann jedoch deaktiviert werden, wenn Lichtlecks erwünscht sind, z. B. wenn die Szene hauptsächlich emittierende Objekte enthält, die Licht von Gesichtern emittieren, die von der Kamera aus nicht zu sehen sind.
zh_cn: **法线拒绝(Normal Rejection)：** 计算屏幕空间间接照明时使用的法线拒绝量。 法线拒绝使用给定样本点的法线来拒绝背向当前像素的样本。 当仅照亮物体的一侧时，为了避免漏光，必须进行正常抑制。 但是，如果需要漏光，例如当场景主要包含从相机无法看到的面部发出光线的发射对象时，可以禁用正常拒绝。

source: Signed Distance Field Global Illumination (SDFGI)
zh_cn: 有符号距离场全局照明（SDFGI）

source: Signed distance field global illumination (SDFGI) is a form of real-time global illumination. It is not a screen-space effect, which means it can provide global illumination for off-screen elements (unlike :abbr:`SSIL (Screen-Space Indirect Lighting)`).
de: Signed Distance Field Global Illumination (SDFGI) ist eine Form der Global Illumination in Echtzeit. Es handelt sich dabei nicht um einen Screen-Space-Effekt, d.h. es kann Global Illumination für Elemente außerhalb des Bildschirms bieten (im Gegensatz zu :abbr:`SSIL (Screen-Space Indirect Lighting)`).
zh_cn: 带符号距离场全局照明（SDFGI）是一种实时全局照明的形式。 它不是屏幕空间效果，这意味着它可以为屏幕外元素提供全局照明（与 :abbr:`SSIL (Screen-Space Indirect Lighting，屏幕空间间接照明)` 不同）。

source: See :ref:`doc_using_sdfgi` for instructions on setting up this global illumination technique.
de: Siehe :ref:`doc_using_sdfgi` für Anweisungen zum Einrichten dieser Global Illumination-Methode.
zh_cn: 有关设置此全局照明技术的说明，请参阅 :ref:`doc_using_sdfgi`。

source: Glow
zh_cn: 辉光

source: *This feature is only available when using the Forward+ and Mobile backends, not Compatibility.*
de: *Diese Funktion ist nur verfügbar, wenn die Backends Forward+ und Mobile verwendet werden, nicht aber für Kompatibilität.*
zh_cn: *此功能仅在使用 Forward+ 和移动后端时可用，在兼容后端中不可用。*

source: In photography and film, when light amount exceeds the maximum *luminance* (brightness) supported by the media, it generally bleeds outwards to darker regions of the image. This is simulated in Godot with the **Glow** effect.
de: Wenn in der Fotografie und beim Film die Lichtmenge die maximale *Luminanz* (Helligkeit) des Mediums übersteigt, strahlt sie im Allgemeinen in dunklere Bereiche des Bildes aus. Dies wird in Godot mit dem **Glow**-Effekt simuliert.
zh_cn: 在摄影和胶片中，当光量超过介质支持的最大值（无论是模拟还是数字）时，它通常会向外渗出到图像的较暗区域。在 Godot 中使用 **辉光** 模拟这种效果。

source: By default, even if the effect is enabled, it will be weak or invisible. One of two conditions need to happen for it to actually show:
de: Standardmäßig ist der Effekt, auch wenn er aktiviert ist, schwach oder unsichtbar. Damit er tatsächlich angezeigt wird, muss eine von zwei Bedingungen erfüllt sein:
zh_cn: 默认情况下，即使启用了效果，它也会变弱或不可见。实际显示它需要发生的两个条件之一：

source: The light in a pixel surpasses the **HDR Threshold** (where 0 is all light surpasses it, and 1.0 is light over the tonemapper **White** value). Normally, this value is expected to be at 1.0, but it can be lowered to allow more light to bleed. There is also an extra parameter, **HDR Scale**, that allows scaling (making brighter or darker) the light surpassing the threshold.
de: Das Licht in einem Pixel übersteigt den **HDR-Schwellenwert** (wobei 0 bedeutet, dass das gesamte Licht diesen Wert übersteigt, und 1,0 bedeutet, dass das Licht über dem Tonemapper-Wert **Weiß** liegt). Normalerweise wird erwartet, dass dieser Wert bei 1,0 liegt, aber er kann herabgesetzt werden, um mehr Licht durchzulassen. Es gibt auch einen zusätzlichen Parameter, **HDR-Skalierung**, mit dem das Licht, das den Schwellenwert überschreitet, skaliert (heller oder dunkler gemacht) werden kann.
zh_cn: 像素中的光线超过 **HDR阈值** (其中0是所有光线都超过该阈值,1.0是光线超过色调映射器 **白** 值). 通常情况下, 这个值应该在1.0, 但它可以调低, 以允许更多的光线渗入. 还有一个额外的参数, **HDR Scale** , 允许对超过阈值的光线进行缩放(使其更亮或更暗).

source: The **Bloom** property has a value greater than ``0.0``. As it increases, it sends the whole screen to the glow processor at higher amounts.
de: Die **Bloom**-Property hat einen Wert größer als ``0.0``. Je höher der Wert, desto mehr wird der gesamte Bildschirm an den Glow-Prozessor gesendet.
zh_cn: **泛光** 属性的值设置大于 ``0`` 。随着它的增加，它会以更高的数量将整个屏幕发送到辉光处理器。

source: Both will cause the light to start bleeding out of the brighter areas.
de: In beiden Fällen beginnt das Licht aus den helleren Bereichen herauszustrahlen.
zh_cn: 两者都会导致光从较亮的区域开始逸出。

source: Once glow is visible, it can be controlled with a few extra parameters:
de: Sobald das Leuchten sichtbar ist, kann es mit einigen zusätzlichen Parametern gesteuert werden:
zh_cn: 一旦看到辉光，就可以通过一些额外的参数来控制它：

source: **Intensity** is an overall scale for the effect, it can be made stronger or weaker (``0.0`` removes it).
de: **Intensität** ist eine Gesamtskala für den Effekt, er kann stärker oder schwächer gemacht werden (``0.0`` entfernt ihn).
zh_cn: **Intensity** （强度）是效果的整体比例，可以将其增强或减弱（ ``0.0`` 可以将其删除）。

source: **Strength** is how strong the gaussian filter kernel is processed. Greater values make the filter saturate and expand outwards. In general, changing this is not needed, as the size can be adjusted more efficiently with the **Levels**.
de: **Stärke** gibt an, wie stark der Gaußfilter-Kernel verarbeitet wird. Größere Werte lassen den Filter in die Sättigung gehen und nach außen expandieren. Im Allgemeinen ist eine Änderung dieses Wertes nicht erforderlich, da die Größe effizienter mit den **Stufen** angepasst werden kann.
zh_cn: **Strength** （强度）是指高斯滤波器内核的处理强度。数值越大，滤波器越饱和并向外扩展。一般来说，不需要改变这个值，因为可以通过 **Levels** 更有效地调整大小。

source: The **Blend Mode** of the effect can also be changed:
de: Der **Blending-Modus** des Effekts kann ebenfalls geändert werden:
zh_cn: 效果的\ **混合模式**\ 也可以改变：

source: **Additive** is the strongest one, as it only adds the glow effect over the image with no blending involved. In general, it's too strong to be used, but can look good with low-intensity **Bloom** (produces a dream-like effect).
de: **Additiv** ist der stärkste, da er nur den Glow-Effekt über das Bild legt, ohne dass Blending stattfindet. Im Allgemeinen ist er zu stark, um verwendet zu werden, kann aber mit **Bloom** mit geringer Intensität gut aussehen (erzeugt einen traumähnlichen Effekt).
zh_cn: **Additive** （添加）是最强的一种，因为它只在图像上添加辉光效果，不涉及混合。一般来说，它太强了，不能使用，但在低强度的 **泛光** 下可能看起来很好，会产生一种梦幻般的效果。

source: **Screen** ensures glow never brightens more than itself and it works great as an all around.
de: **Screen** sorgt dafür, dass das Glühen nie etwas stärker erhellt als es selbst ist, und es funktioniert hervorragend als Allrounder.
zh_cn: **Screen** 确保辉光永远不会比自己更亮，它作为一个整体效果非常好。

source: **Softlight** is the default and weakest one, producing only a subtle color disturbance around the objects. This mode works best on dark scenes.
de: **Softlight** ist die Standardeinstellung und der schwächste Modus, der nur eine subtile Farbstörung um die Objekte herum erzeugt. Dieser Modus funktioniert am besten bei dunklen Szenen.
zh_cn: **Softlight** 是默认的，也是最弱的一种，只在物体周围产生细微的颜色扰动。这种模式在黑暗场景中效果最好。

source: **Replace** can be used to :ref:`blur the whole screen <doc_environment_and_post_processing_using_glow_to_blur_the_screen>` or debug the effect. It only shows the glow effect without the image below.
de: **Ersetzen** kann verwendet werden, um :ref:`den gesamten Bildschirm zu verwischen <doc_environment_and_post_processing_using_glow_to_blur_the_screen>` oder den Effekt zu debuggen. Es zeigt nur den Glow-Effekt ohne das unten stehende Bild.
zh_cn: **Replace** （替换）可以用来 :ref:`模糊整个屏幕 <doc_environment_and_post_processing_using_glow_to_blur_the_screen>` 或调试效果。它只显示辉光的效果，没有下面的图片。

source: **Mix** mixes the glow effect with the main image. This can be used for greater artistic control. The mix factor is controlled by the **Mix** property which appears above the blend mode (only when the blend mode is set to Mix). High mix factor values will appear to darken the image unless **Bloom** is increased.
de: **Mischen** mischt den Leuchteffekt mit dem Hauptbild. Dies kann für größere kreative Freiheit genutzt werden. Der Mischfaktor wird über die Property **Mischen** gesteuert, die oberhalb des Blending-Modus (nur wenn der Blending-Modus auf Mischen eingestellt ist). Hohe Werte des Mischen-Faktors scheinen das Bild abzudunkeln, es sei denn, **Bloom** wird erhöht.
zh_cn: **Mix** （混合）将发光效果与主图像混合。 这可以用于更好的艺术效果控制。 混合因子由出现在混合模式上方的 **Mix** 属性控制（仅当混合模式设置为 Mix 时）。 除非增加 **泛光** ，否则高混合因子值将使图像变暗。

source: To change the glow effect size and shape, Godot provides **Levels**. Smaller levels are strong glows that appear around objects, while large levels are hazy glows covering the whole screen:
de: Um die Größe und Form des Leuchteffekts zu ändern, bietet Godot **Stufen** an. Kleinere Stufen führen zu starkem Leuchten, das um Objekte herum erscheint, während große Stufen ein trübes Leuchten darstellen, das den gesamten Bildschirm bedeckt:Um die Größe und Form des Leuchteffekts zu ändern, bietet Godot **Stufen** an. Kleinere Stufen führen zu starkem Leuchten, das um Objekte herum erscheint, während große Stufen ein trübes Leuchten darstellen, das den gesamten Bildschirm bedeckt:
zh_cn: Godot 提供了\ **等级**\ ，用于改变辉光效果的大小和形状。较小的级别是在物体周围出现的较强的辉光，而大的级别是覆盖整个屏幕的朦胧辉光：

source: The real strength of this system, though, is to combine levels to create more interesting glow patterns:
de: Die eigentliche Stärke dieses Systems ist jedoch die Kombination von Ebenen, um interessantere Glow-Muster zu erzeugen:
zh_cn: 然而，这个系统的真正优势在于结合水平来创造更有趣的辉光模式：

source: Finally, the glow effect can be controlled using a *glow map*, which is a texture that determines how bright glow should be on each part of the screen. This texture can optionally be colored to tint the glow effect to the glow map's color. The texture is stretched to fit the viewport, so using an aspect ratio that matches your viewport's most common aspect ratio (such as 16:9) is recommended to avoid visible distortion.
de: Schließlich kann der Glow-Effekt mit einer *Glow-Map* gesteuert werden, einer Textur, die bestimmt, wie hell der Glow auf jedem Teil des Bildschirms sein soll. Diese Textur kann optional eingefärbt werden, um den Glow-Effekt in der Farbe der Glow-Map zu färben. Die Textur wird so gestreckt, dass sie in das Ansichtsfenster passt. Um sichtbare Verzerrungen zu vermeiden, empfiehlt es sich, ein Seitenverhältnis zu wählen, das dem gängigen Seitenverhältnis des Ansichtsfensters entspricht (z.B. 16:9).
zh_cn: 最后，可以使用 *辉光贴图* 来控制辉光效果，这是一种纹理，用于确定屏幕每个部分的辉光亮度。 该纹理可以选择着色，以将辉光效果着色为辉光贴图的颜色。 纹理会拉伸以适合视口，因此建议使用与视口最常见的纵横比（例如 16:9）相匹配的纵横比，以避免可见的失真。

source: There are 2 main use cases for a glow map texture:
de: Es gibt 2 Hauptanwendungsfälle für eine Glow-Map-Textur:
zh_cn: 辉光贴图纹理有 2 个主要案例：

source: Create a "lens dirt" effect using a dirt pattern texture.
de: Erstellen eines "Linsenschmutz"-Effekts mit einer Schmutzmustertextur.
zh_cn: 使用污垢图案纹理创建“镜头污垢”（lens dirt）效果。

source: Make glow less strong on specific parts of the screen by using a gradient texture.
de: Verwenden einer Gradienten-Textur, um den Glow in bestimmten Bereichen des Bildschirms weniger stark zu machen.
zh_cn: 使用渐变纹理使屏幕特定部分的辉光减弱。

source: Using glow in 2D
de: Verwendung von Glow in 2D
zh_cn: 在 2D 中使用辉光
