Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/high_dynamic_range.po
Languages: de, zh_tw

source: High dynamic range lighting
de: Beleuchtung mit hohem Dynamikbereich (HDR)
zh_tw: 高動態範圍光照

source: Introduction
de: Einführung
zh_tw: 前言

source: Normally, an artist does all the 3D modeling, then all the texturing, looks at their awesome looking model in the 3D modeling software and says "looks fantastic, ready for integration!" then goes into the game, lighting is setup and the game runs.
de: Normalerweise macht ein Künstler die gesamte 3D-Modellierung, dann die Texturierung, schaut sich sein fantastisch aussehendes Modell in der 3D-Modellierungssoftware an und sagt: "Sieht fantastisch aus, bereit für die Integration!", dann geht er ins Spiel, die Beleuchtung wird eingestellt und das Spiel läuft.

source: So at what point does all this "HDR" business come into play? To understand the answer, we need to look at how displays behave.
de: Ab wann kommen die ganzen "HDR" Sachen ins Spiel? Um die Antwort zu verstehen, müssen wir uns ansehen, wie sich Displays verhalten.
zh_tw: 那麼, 所有這些" HDR"業務在什麼時候發揮作用？要理解答案, 我們需要查看顯示器的行為.

source: Your display outputs linear light ratios from some maximum to some minimum intensity. Modern game engines perform complex math on linear light values in their respective scenes. So what's the problem?
de: Ihr Display gibt lineare Lichtverhältnisse von maximaler bis minimaler Intensität aus. Moderne Spiele-Engines führen komplexe Berechnungen mit linearen Lichtwerten in ihren jeweiligen Szenen durch. Also, was ist das Problem?
zh_tw: 您的顯示器輸出線性光比率從某個最大強度到某個最小強度. 現代遊戲引擎在各自的場景中對線性光值進行複雜的數學計算. 這將會有什麼問題呢？

source: The display has a limited range of intensity, depending on the display type. The game engine renders to an unlimited range of intensity values, however. While "maximum intensity" means something to an sRGB display, it has no bearing in the game engine; there is only a potentially infinitely wide range of intensity values generated per frame of rendering.
de: Das Display hat je nach Displaytyp einen begrenzten Intensitätsbereich. Die Spiele-Engine rendert jedoch auf einen unbegrenzten Bereich von Intensitätswerten. Während "maximale Intensität" für ein sRGB-Display etwas bedeutet, hat es keinen Einfluss auf die Spiele-Engine. Pro Rendering-Frame wird nur ein potenziell unendlich großer Bereich von Intensitätswerten generiert.
zh_tw: 根據顯示器型別的不同, 顯示的強度範圍有限. 然而, 遊戲引擎算繪的強度值範圍沒有限制. 雖然 "最大強度" 對sRGB顯示器來說有一定的意義, 但在遊戲引擎中卻沒有任何影響；每影格算繪時可能產生無限寬的強度值範圍.

source: This means that some transformation of the scene light intensity, also known as *scene-referred* light ratios, need to be transformed and mapped to fit within the particular output range of the chosen display. This can be most easily understood if we consider virtually photographing our game engine scene through a virtual camera. Here, our virtual camera would apply a particular camera rendering transform to the scene data, and the output would be ready for display on a particular display type.
de: Dies bedeutet, dass eine gewisse Transformation der Szenenlichtintensität, auch als *szenenbezogene* Lichtverhältnisse bezeichnet, transformiert und abgebildet werden muss, um in den bestimmten Ausgabebereich des ausgewählten Displays zu passen. Dies kann am einfachsten verstanden werden, wenn wir annehmen unsere virtuelle Game-Engine-Szene wird mit einer virtuellen Kamera fotografiert. Hier würde unsere virtuelle Kamera eine bestimmte Kamera-Rendering-Transformation auf die Szenendaten anwenden und die Ausgabe wäre bereit für die Anzeige auf einem bestimmten Displaytyp.
zh_tw: 這意味著場景光強，也稱為*場景對應*（scene-referred）的光照比率，需要進行轉換和對應以適應所選顯示器的特定輸出範圍。這就類似通過虛擬相機拍攝我們的遊戲引擎場景，在這裡，我們的虛擬相機將對場景資料應用特定的相機算繪變換，其輸出將以特定的顯示型別顯示。

source: Godot does not support high dynamic range *output* yet. It can only perform lighting in HDR and tonemap the result to a low dynamic range image.
de: Godot unterstützt noch kein *Ausgabe* mit hohem Dynamikbereich. Es kann nur eine Beleuchtung in HDR durchführen und das Ergebnis einem Bild mit niedrigem Dynamikbereich zuordnen.
zh_tw: Godot目前尚不支援高動態範圍 *輸出*. 它只能在HDR中執行照明, 並將結果對應為低動態範圍的圖像.

source: For advanced users, it is still possible to get a non-tonemapped image of the viewport with full HDR data, which can then be saved to an OpenEXR file.
de: Für fortgeschrittene Benutzer ist es weiterhin möglich, ein Bild ohne Tone-Mapping des Viewports mit vollständigen HDR-Daten zu erhalten, das dann in einer OpenEXR-Datei gespeichert werden kann.
zh_tw: 對於高級使用者來說, 仍然可以得到一個非色調對應的視圖圖像與完整的HDR資料, 然後可以保存到一個OpenEXR檔.

source: Computer displays
de: Computerbildschirme
zh_tw: 電腦顯示器

source: Almost all displays require a nonlinear encoding for the code values sent to them. The display in turn, using its unique transfer characteristic, "decodes" the code value into linear light ratios of output, and projects the ratios out of the uniquely colored lights at each reddish, greenish, and blueish emission site.
de: Fast alle Displays erfordern eine nichtlineare Codierung für die an sie gesendeten Codewerte. Das Display "decodiert" wiederum unter Verwendung seiner einzigartigen Übertragungscharakteristik den Codewert in lineare Lichtverhältnisse der Ausgabe und projiziert die Verhältnisse aus den einzigartig gefärbten Lichtern an jeder rötlichen, grünlichen und bläulichen Ausgabestelle.
zh_tw: 幾乎所有顯示器都需要對發送給它們的程式碼值進行非線性編碼. 顯示器又利用其獨特的傳輸功能, 將程式碼值 "解碼" 為輸出的線性光比, 並在每個紅色, 綠色和藍色發射點的獨特顏色的光中投射出這些比值.

source: For a majority of computer displays, the specifications of the display are outlined in accordance with IEC 61966-2-1, also known as the 1996 sRGB specification. This specification outlines how an sRGB display is to behave, including the color of the lights in the LED pixels as well as the transfer characteristics of the input (OETF) and output (EOTF).
de: Für die meisten Computer-Displays sind die Spezifikationen des Displays gemäß IEC 61966-2-1, auch als sRGB-Spezifikation von 1996 bekannt, aufgeführt. Diese Spezifikation beschreibt wie sich ein sRGB-Display verhalten soll, einschließlich der Farbe der Lichter in den LED-Pixeln sowie der Übertragungseigenschaften des Eingangs (OETF) und des Ausgangs (EOTF).
zh_tw: 對於大多數電腦顯示器來說，顯示器的規格是根據 IEC 61966-2-1，即 1996 年的 sRGB 規格，進行概述的。該規範概述了 sRGB 顯示器的性能，包括 LED 像素中的燈光顏色以及輸入（OETF）和輸出（EOTF）的傳輸功能。

source: Not all displays use the same OETF and EOTF as a computer display. For example, television broadcast displays use the BT.1886 EOTF. However, Godot currently only supports sRGB displays.
de: Nicht alle Displays verwenden dieselbe OETF und EOTF wie ein Computer-Display. Beispielsweise verwenden Fernsehsendungen den BT.1886 EOTF. Derzeit unterstützt Godot jedoch nur sRGB-Displays.
zh_tw: 並非所有顯示器都使用與電腦顯示器相同的OETF和EOTF. 例如, 電視廣播顯示器使用BT.1886 EOTF. 然而,Godot目前只支援sRGB顯示器.

source: The sRGB standard is based around the nonlinear relationship between the current to light output of common desktop computing CRT displays.
de: Der sRGB-Standard basiert auf der nichtlinearen Beziehung zwischen der Strom- und Lichtleistung gängiger Kathodenstrahl-Displays.
zh_tw: sRGB標準是圍繞著常見的桌面計算CRT顯示器的電流與光輸出之間的非線性關係而制定的.

source: The mathematics of a scene-referred model require that we multiply the scene by different values to adjust the intensities and exposure to different light ranges. The transfer function of the display can't appropriately render the wider dynamic range of the game engine's scene output using the simple transfer function of the display. A more complex approach to encoding is required.
de: Die Mathematik eines szenenbezogenen Modells erfordert, dass wir die Szene mit verschiedenen Werten multiplizieren, um die Intensitäten und die Belichtung mit verschiedenen Lichtbereichen anzupassen. Die Übertragungsfunktion des Displays kann den breiteren Dynamikbereich der Szenenausgabe der Game Engine mithilfe der einfachen Übertragungsfunktion des Displays nicht angemessen rendern. Ein komplexerer Ansatz für die Codierung ist erforderlich.
zh_tw: 場景參考模型的數學要求我們將場景乘以不同的值, 以調整不同光照範圍的強度和曝光. 顯示器簡單的傳遞函式不能恰當地算繪遊戲從引擎場景中輸出的更大動態範圍. 這需要一種更複雜的編碼方法.

source: Scene linear & asset pipelines
de: Szenenlinear- und Asset-Pipelines
zh_tw: 場景線性和資源管道

source: Working in scene-linear sRGB is more complex than pressing a single switch. First, imported image assets must be converted to linear light ratios on import. Even when linearized, those assets may not be perfectly well-suited for use as textures, depending on how they were generated.
de: Das Arbeiten in szenenlinearem sRGB ist nicht so einfach wie das Betätigen eines Schalters. Zunächst müssen importierte Bildelemente beim Import in lineare Lichtverhältnisse konvertiert werden. Selbst wenn sie linearisiert sind, sind diese Assets möglicherweise nicht perfekt für die Verwendung als Texturen geeignet, je nachdem wie sie generiert wurden.
zh_tw: 在場景線性sRGB中工作並不像按一下開關那樣簡單. 首先, 匯入的圖像素材必須在匯入時轉換為線性光比例. 即使將其線性化, 這些素材也可能並不完全適合用作紋理, 具體取決於它們的生成方式.

source: There are two ways to do this:
de: Dies kann auf zwei Arten erledigt werden:
zh_tw: Godot 沒有使用限制

source: sRGB transfer function to display linear ratios on image import
de: sRGB-Übertragungsfunktion zur Anzeige linearer Verhältnisse beim Bildimport
zh_tw: 用於在圖像匯入時顯示線性比率的sRGB傳遞函式

source: This is the easiest method of using sRGB assets, but it's not the most ideal. One issue with this is loss of quality. Using 8 bits per channel to represent linear light ratios is not sufficient to quantize the values correctly. These textures may also be compressed later, which can exacerbate the problem.
de: Dies ist die einfachste Methode zur Verwendung von sRGB-Assets, aber nicht die idealste. Ein Problem dabei ist der Qualitätsverlust. Die Verwendung von 8 Bits pro Kanal zur Darstellung linearer Lichtverhältnisse reicht nicht aus, um die Werte korrekt zu quantisieren. Diese Texturen können auch später komprimiert werden, was das Problem allerdings verschlimmern kann.
zh_tw: 這是最簡單的使用sRGB資源的方法, 但不是最理想的. 這樣做的一個問題是品質的損失. 每通道使用8位元來表示線性光比率, 不足以正確量化這些值. 這些紋理以後也可能會被壓縮, 可能會加劇這個問題.

source: Hardware sRGB transfer function to display linear conversion
de: Hardware-sRGB-Übertragungsfunktion zur Anzeige der linearen Konvertierung
zh_tw: 硬體sRGB傳輸函式顯示線性轉換

source: The GPU will do the conversion after reading the texel using floating-point. This works fine on PC and consoles, but most mobile devices don't support it, or they don't support it on compressed texture formats (iOS for example).
de: Die GPU führt die Konvertierung durch, nachdem das Texel mit Float-Werten gelesen wurde. Dies funktioniert gut auf PCs und Konsolen, aber die meisten Mobilgeräte unterstützen es generell nicht oder nicht auf komprimierten Texturformaten (z.B. iOS).
zh_tw: GPU 會在使用浮點讀取紋素後進行轉換。這在 PC 和遊戲主機上很好用，但大多數移動裝置不支援，或者它們不支援壓縮的紋理格式（例如 iOS）。

source: Scene linear to display-referred nonlinear
de: Szenenlinear nach Display-bezogen nichtlinear
zh_tw: 場景線性到顯示參考的非線性

source: After all the rendering is done, the scene linear render requires transforming to a suitable output such as an sRGB display. To do this, enable sRGB conversion in the current :ref:`Environment <class_Environment>` (more on that below).
de: Nachdem das Rendern abgeschlossen ist, muss das lineare Rendern der Szene in eine geeignete Ausgabe wie ein sRGB-Display umgewandelt werden. Aktivieren Sie dazu die sRGB-Konvertierung in der aktuellen :ref:`Environment <class_Environment>` (mehr dazu weiter unten).
zh_tw: 完成所有算繪後, 場景線性算繪需要轉換為適當的輸出, 例如sRGB顯示. 為此, 請在目前的: :ref:`Environment <class_Environment>` 中啟用 sRGB 轉換(更多內容見下文).

source: Keep in mind that the **sRGB -> Display Linear** and **Display Linear -> sRGB** conversions must always be **both** enabled. Failing to enable one of them will result in horrible visuals suitable only for avant-garde experimental indie games.
de: Beachten Sie, dass die Konvertierungen **sRGB -> Displaylinear** und **Displaylinear -> sRGB** immer **beide** aktiviert sein müssen. Wenn einer von ihnen nicht aktiviert wird, führt dies zu schrecklicher Grafik, die nur für avantgardistische experimentelle Indie-Spiele geeignet ist.
zh_tw: 請記住, **sRGB ->顯示線性(Display Linear)** 和 **顯示線性 -> sRGB** 的轉換必須始終 **全部(both)** 啟用. 未能啟用其中一個將導致僅適用於前衛實驗性獨立遊戲的可怕視覺效果.

source: Parameters of HDR
de: Parameter von HDR
zh_tw: HDR的參數

source: HDR settings can be found in the :ref:`Environment <class_Environment>` resource. Most of the time, these are found inside a :ref:`WorldEnvironment <class_WorldEnvironment>` node or set in a Camera node. For more information, see :ref:`doc_environment_and_post_processing`.
de: HDR-Einstellungen finden Sie in der Ressource :ref:`Environment <class_Environment>`. Meistens befinden sich diese in einem :ref:`WorldEnvironment <class_WorldEnvironment>`-Node oder in einem Kamera-Node. Weitere Informationen finden Sie unter :ref:`doc_environment_and_post_processing`.
zh_tw: HDR可以在 :ref:`Environment <class_Environment>` 資源中找到. 這些在大多數情況下都可以在 :ref:`WorldEnvironment <class_WorldEnvironment>` 節點中找到或在相機中設定. 更多資訊請參閱 :ref:`doc_environment_and_post_processing`.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
