Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/lights_and_shadows.po
Languages: de, zh_cn

source: In some cases, you may want to use a different allocation strategy. For example, in a top-down game where all lights are around the same size, you may want to set all quadrants to have the same subdivision so that all lights have shadows of similar quality level.
de: In manchen Fällen kann es sinnvoll sein, eine andere Zuweisungsstrategie zu verwenden. In einem Top-Down-Spiel, in dem alle Lichter in etwa gleich groß sind, sollten Sie zum Beispiel alle Quadranten gleich unterteilen, damit alle Lichter Schatten mit einer ähnlichen Qualitätsstufe haben.
zh_cn: 在某些情况下，你可能想要使用不同的分配策略。例如，在自上而下看的游戏中，所有灯光的大小都大致相同，你可能希望将所有象限设置为具有相同的细分，以便所有灯光都具有相似质量级别的阴影。

source: Balancing performance and quality
de: Abwägung zwischen Performance und Qualität
zh_cn: 平衡性能与质量

source: Shadow rendering is a critical topic in 3D rendering performance. It's important to make the right choices here to avoid creating bottlenecks.
de: Das Schattenrendering ist ein wichtiges Thema bei der 3D-Rendering-Performance. Es ist wichtig, hier die richtigen Entscheidungen zu treffen, um Bottlenecks zu vermeiden.
zh_cn: 阴影渲染是 3D 渲染性能方面的重要议题。做出正确的选择非常重要，这样才能避免制造出瓶颈。

source: Directional shadow quality settings can be changed at run-time by calling the appropriate :ref:`class_RenderingServer` methods.
de: Die Einstellungen für die Qualität von gerichteten Schatten können während der Laufzeit durch den Aufruf der entsprechenden :ref:`class_RenderingServer`-Methoden geändert werden.
zh_cn: 平行光的阴影质量设置可以在运行时调整，调用合适的 :ref:`class_RenderingServer` 方法即可。

source: Positional (omni/spot) shadow quality settings can be changed at run-time on the root :ref:`class_Viewport`.
de: Die Einstellungen für die Qualität von Positionsschatten (Omni/Spot) können zur Laufzeit auf dem Root :ref:`class_Viewport` geändert werden.
zh_cn: 位置光（全向灯/聚光灯）的阴影质量设置可以在运行时调整，设置根 :ref:`class_Viewport` 即可。

source: Shadow map size
de: Größe der Shadow-Map
zh_cn: 阴影贴图大小

source: High shadow resolutions result in sharper shadows, but at a significant performance cost. It should also be noted that *sharper shadows are not always more realistic*. In most cases, this should be kept at its default value of ``4096`` or decreased to ``2048`` for low-end GPUs.
de: Hohe Schattenauflösungen führen zu schärferen Schatten, aber zu einem erheblichen Performance-Verlust. Es sollte auch beachtet werden, dass *schärfere Schatten nicht immer realistischer sind*. In den meisten Fällen sollte der Standardwert von ``4096`` beibehalten oder auf ``2048`` für Low-End-GPUs reduziert werden.
zh_cn: 高阴影分辨率会带来更清晰的阴影，但会付出很大的性能代价。还需要注意的是，*更清晰的阴影并不总是更逼真*。在大多数情况下，应将其保持在默认值 ``4096``，或将低端 GPU 的默认值降至 ``2048``。

source: If positional shadows become too blurry after decreasing the shadow map size, you can counteract this by adjusting the :ref:`shadow atlas <doc_lights_and_shadows_shadow_atlas>` quadrants to contain fewer shadows. This will allow each shadow to be rendered at a higher resolution.
de: Wenn Positionsschatten nach einer Verringerung der Größe der Shadow Map zu unscharf werden, können Sie dem entgegenwirken, indem Sie die :ref:`Shadow-Atlas <doc_lights_and_shadows_shadow_atlas>`-Quadranten so anpassen, dass sie weniger Schatten enthalten. Dadurch kann jeder Schatten mit einer höheren Auflösung gerendert werden.
zh_cn: 如果在减小阴影贴图大小后，位置阴影变得过于模糊，可以通过调整 :ref:`shadow atlas <doc_lights_and_shadows_shadow_atlas>` 象限以包含较少的阴影来解决。这样就能以更高的分辨率渲染每个阴影。

source: Shadow filter mode
de: Schattenfilter-Modus
zh_cn: 阴影过滤模式

source: Several shadow map quality settings can be chosen here. The default **Soft Low** is a good balance between performance and quality for scenes with detailed textures, as the texture detail will help make the dithering pattern less noticeable.
de: Hier können mehrere Qualitätseinstellungen für die Shadow Map gewählt werden. Die Standardeinstellung **Soft Low** ist eine gute Balance zwischen Leistung und Qualität für Szenen mit detaillierten Texturen, da die Texturdetails dazu beitragen, dass das Dithering-Muster weniger auffällt.
zh_cn: 这里可以选择多种阴影贴图质量设置。默认的**Soft Low**在性能和质量之间取得了很好的平衡，适用于有细节纹理的场景，因为纹理细节有助于使颜色抖动的纹路不那么明显。

source: However, in projects with less detailed textures, the shadow dithering pattern may be more visible. To hide this pattern, you can either enable :ref:`doc_3d_antialiasing_taa`, :ref:`doc_3d_antialiasing_fsr2`, :ref:`doc_3d_antialiasing_fxaa`, or increase the shadow filter quality to **Soft Medium** or higher.
de: In Projekten mit weniger detaillierten Texturen kann das Schatten-Dithering-Muster jedoch deutlicher sichtbar sein. Um dieses Muster auszublenden, können Sie entweder :ref:`doc_3d_antialiasing_taa`, :ref:`doc_3d_antialiasing_fsr2`, :ref:`doc_3d_antialiasing_fxaa` aktivieren oder die Qualität des Schattenfilters auf **Soft Medium** oder höher erhöhen.
zh_cn: 不过，在纹理细节较少的项目中，颜色抖动的纹路可能会更加明显。要隐藏这种纹路，可以启用 :ref:`doc_3d_antialiasing_taa`、 :ref:`doc_3d_antialiasing_fsr2` 、 :ref:`doc_3d_antialiasing_fxaa` 或将阴影滤镜质量提高到 **Soft Medium** 或更高。

source: The **Soft Very Low** setting will automatically decrease shadow blur to make artifacts from the low sample count less visible. Conversely, the **Soft High** and **Soft Ultra** settings will automatically increase shadow blur to better make use of the increased sample count.
de: Mit der Einstellung **Soft Very Low** wird die Schattenunschärfe automatisch verringert, um Artefakte aufgrund der geringen Abtastrate weniger sichtbar zu machen. Umgekehrt erhöhen die Einstellungen **Soft High** und **Soft Ultra** automatisch die Schattenunschärfe, um die erhöhte Anzahl von Samples besser zu nutzen.
zh_cn: **Soft Very Low** 设置会自动减少阴影模糊，使低采样数产生的伪影不那么明显。相反，\ **Soft High** 和 **Soft Ultra** 设置会自动增加阴影模糊，以更好地利用增加的样本数。

source: 16-bits versus 32-bit
zh_cn: 16 位与 32 位

source: By default, Godot uses 16-bit depth textures for shadow map rendering. This is recommended in most cases as it performs better without a noticeable difference in quality.
de: Standardmäßig verwendet Godot 16-Bit-Tiefentexturen für das Rendering von Shadow Maps. Dies wird in den meisten Fällen empfohlen, da es ohne merklichen Qualitätsunterschied zu einer besseren Performance führt.
zh_cn: 默认情况下，Godot 使用 16 位深度纹理进行阴影贴图渲染。在大多数情况下，我们都建议使用这种方式，因为它的性能更好，而且质量也不会有明显差异。

source: If **16 Bits** is disabled, 32-bit depth textures will be used instead. This can result in less artifacting in large scenes and large lights with shadows enabled. However, the difference is often barely visible, yet this can have a significant performance cost.
de: Wenn **16 Bits** deaktiviert ist, werden stattdessen 32-Bit-Tiefentexturen verwendet. Dies kann zu weniger Artefakten in großen Szenen und großen Lichtern mit aktivierten Schatten führen. Allerdings ist der Unterschied oft kaum sichtbar, was jedoch zu erheblichen Performance-Einbußen führen kann.
zh_cn: 如果禁用**16 Bits**，则将使用 32 -bits深度纹理。这可以减少大型场景和启用阴影的大型灯光中的伪影。不过，这种差异通常几乎不明显，但却会带来显著的性能损失。

source: Light/shadow distance fade
de: Entfernungs-Fading bei Licht und Schatten
zh_cn: 灯光/阴影的距离淡出

source: OmniLight3D and SpotLight3D offer several properties to hide distant lights. This can improve performance significantly in large scenes with dozens of lights or more.
de: OmniLight3D und SpotLight3D bieten mehrere Propertys, um entfernte Lichter auszublenden. Dies kann die Leistung in großen Szenen mit Dutzenden von Lichtern oder mehr erheblich verbessern.
zh_cn: OmniLight3D 和 SpotLight3D 提供了一些能够隐藏远距离灯光的属性。如果是在大型场景中，并且存在几十盏灯，就能够显著提升性能。

source: **Enabled:** Controls whether distance fade (a form of :abbr:`LOD (Level of Detail)`) is enabled. The light will fade out over **Begin + Length**, after which it will be culled and not sent to the shader at all. Use this to reduce the number of active lights in a scene and thus improve performance.
de: **Aktiviert:** Legt fest, ob das Entfernungs-Fading (eine Form von :abbr:`LOD (Level of Detail)`) aktiviert ist. Das Licht wird über **Beginn + Länge** ausgeblendet, danach wird es aussortiert und nicht mehr an den Shader gesendet. Verwenden Sie dies, um die Anzahl der aktiven Lichter in einer Szene zu reduzieren und so die Leistung zu verbessern.
zh_cn: **Enabled：**\ （启用）控制是否启用距离淡入淡出（ :abbr:`LOD (Level of Detail)` 的一种形式）。 光线将在 **Begin + Length** 内淡出，之后它将被剔除并且根本不会发送到着色器。 使用它可以减少场景中活动灯光的数量，从而提高性能。

source: **Begin:** The distance from the camera at which the light begins to fade away (in 3D units).
de: **Beginn:** Die Entfernung von der Kamera, bei der das Licht zu verblassen beginnt (in 3D-Einheiten).
zh_cn: **Begin：**\ （开始）光线开始消失时距相机的距离（以 3D 单位表示）。

source: **Shadow:** The distance from the camera at which the shadow begins to fade away (in 3D units). This can be used to fade out shadows sooner compared to the light, further improving performance. Only available if shadows are enabled for the light.
de: **Schatten:** Die Entfernung von der Kamera, bei der ein Schatten zu verblassen beginnt (in 3D-Einheiten). Dies kann verwendet werden, um Schatten im Vergleich zum Licht früher auszublenden, was die Performance weiter verbessert. Nur verfügbar, wenn Schatten für das Licht aktiviert sind.
zh_cn: **Shadow：**\ （阴影）阴影开始消失时距相机的距离（以 3D 单位表示）。 与光线相比，这可用于更快地淡出阴影，从而进一步提高性能。 仅当为灯光启用阴影时才可用。

source: **Length:** The distance over which the light and shadow fades (in 3D units). The light becomes slowly more transparent over this distance and is completely invisible at the end. Higher values result in a smoother fade-out transition, which is more suited when the camera moves fast.
de: **Länge:** Die Entfernung, über die Licht und Schatten verblassen (in 3D-Einheiten). Das Licht wird über diese Strecke langsam transparenter und ist am Ende völlig unsichtbar. Höhere Werte führen zu einem weicheren Fade-Out-Übergang, der besser geeignet ist, wenn sich die Kamera schnell bewegt.
zh_cn: **Length：** （长度）光线和阴影淡出的距离（以 3D 单位表示）。 光线在这段距离内慢慢变得更加透明，最后完全不可见。 值越高，淡出过渡越平滑，这样的配置在相机快速移动时更合适。

source: PCSS recommendations
de: PCSS-Empfehlungen
zh_cn: PCSS 建议

source: Percentage-closer soft shadows (PCSS) provide a more realistic shadow mapping appearance, with the penumbra size varying depending on the distance between the caster and the surface receiving the shadow. This comes at a high performance cost, especially for directional lights.
de: Percentage-closer soft shadows (PCSS) bieten ein realistischeres Schattenbild, wobei die Größe des Halbschattens vom Abstand zwischen dem Schattenwerfer und der Oberfläche, die den Schatten empfängt, abhängt. Dies geht mit einem hohen Leistungsaufwand einher, insbesondere bei gerichteten Lichtern.
zh_cn: 百分比接近软阴影 （Percentage-closer soft shadows，PCSS） 会提供更真实的阴影贴图外观，半影（ penumbra ）大小根据光源（caster）与接收阴影的表面之间的距离而变化。 这会带来很高的性能成本，特别是对于平行光而言。

source: To avoid performance issues, it's recommended to:
de: Um Performance-Probleme zu vermeiden, empfiehlt sich Folgendes:
zh_cn: 为了避免性能问题，建议：

source: Only use a handful of lights with PCSS shadows enabled at a given time. The effect is generally most visible on large, bright lights. Secondary light sources that are more faint usually don't benefit much from using PCSS shadows.
de: Verwenden Sie jeweils nur eine Handvoll Lichter mit aktivierten PCSS-Schatten. Der Effekt ist im Allgemeinen bei großen, hellen Lichtern am deutlichsten. Sekundäre Lichtquellen, die schwächer sind, profitieren in der Regel nicht sehr von der Verwendung von PCSS-Schatten.
zh_cn: 仅在给定时间里使用少量启用了 PCSS 阴影的灯光。 这种效果通常在大而明亮的灯光下最为明显。 较微弱的辅助光源通常不会从使用 PCSS 阴影中获益。

source: Provide a setting for users to disable PCSS shadows. On directional lights, this can be done by setting the DirectionalLight3D's ``light_angular_distance`` property to ``0.0`` in a script. On positional lights, this can be done by setting the OmniLight3D or SpotLight3D's ``light_size`` property to ``0.0`` in a script.
de: Bieten Sie eine Einstellung für Benutzer an, um PCSS-Schatten zu deaktivieren. Bei gerichteten Lichtern kann dies erreicht werden, indem die Property ``light_angular_distance`` des DirectionalLight3D in einem Skript auf ``0.0`` gesetzt wird. Bei Positionslichtern kann dies erreicht werden, indem man in einem Skript die Property ``light_size`` von OmniLight3D oder SpotLight3D auf ``0.0`` setzt.
zh_cn: 为用户提供禁用 PCSS 阴影的设置。 在平行光上，这可以通过在脚本中将 DirectionalLight3D 的 ``light_angular_distance`` 属性设置为 ``0.0`` 来完成。 对于位置光源，这可以通过在脚本中将 OmniLight3D 或 SpotLight3D 的 ``light_size`` 属性设置为 ``0.0`` 来完成。

source: Projector filter mode
de: Projektionsfilter-Modus
zh_cn: 投影器过滤模式

source: The way projectors are rendered also has an impact on performance. The **Rendering > Textures > Light Projectors > Filter** advanced project setting lets you control how projector textures should be filtered. **Nearest/Linear** do not use mipmaps, which makes them faster to render. However, projectors will look grainy at distance. **Nearest/Linear Mipmaps** will look smoother at a distance, but projectors will look blurry when viewed from oblique angles. This can be resolved by using **Nearest/Linear Mipmaps Anisotropic**, which is the highest-quality mode but also the most expensive.
de: Die Art und Weise, wie Projektoren gerendert werden, wirkt sich ebenfalls auf die Leistung aus. Mit der erweiterten Projekteinstellung **Rendern > Texturen > Lichtprojektoren > Filter** können Sie steuern, wie Projektortexturen gefiltert werden sollen. Bei **Nearest/Linear** werden keine Mipmaps verwendet, wodurch sie schneller gerendert werden können. Allerdings sehen die Projektoren aus der Entfernung körnig aus. **Nearest/Linear Mipmaps** sehen aus der Entfernung glatter aus, aber die Projektoren sehen aus schrägen Winkeln unscharf aus. Dies kann durch die Verwendung von **Nearest/Linear Mipmaps Anisotropic** behoben werden, dem qualitativ hochwertigsten, aber auch teuersten Modus.
zh_cn: 投影的渲染方式也会对性能产生影响。 **渲染> 纹理 > 光投影器 > 过滤** 高级项目设置可让你控制投影纹理的过滤方式。 **Nearest/Linear** 不使用 mipmap，这会使得渲染速度更快。 然而，投影在远处看起来会有颗粒感。 **Nearest/Linear Mipmaps** 在远处看起来会更平滑，但从倾斜角度观看时投影会看起来模糊。 这可以通过使用 **Nearest/Linear Mipmaps Anisotropic** 来解决，这是最高质量的模式，但也是消耗最大的。

source: If your project has a pixel art style, consider setting the filter to one of the **Nearest** values so that projectors use nearest-neighbor filtering. Otherwise, stick to **Linear**.
de: Wenn Ihr Projekt einen Pixel-Art-Stil hat, sollten Sie den Filter auf einen der **Nearest**-Werte einstellen, damit die Projektoren die Filterung nach dem Nearest-Neighbor-Prinzip verwenden. Bleiben Sie ansonsten bei **Linear**.
zh_cn: 如果你的项目具有像素艺术风格，请考虑将过滤器设置为 **Nearest** 的值之一，以便投影使用最近邻过滤（nearest-neighbor filtering）。 否则，请继续使用 **Linear** 。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
