Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/lights_and_shadows.po
Languages: de, zh_cn

source: The directional light also offers a **Angular Distance** property, which determines the light's angular size in degrees. Increasing this above ``0.0`` will make shadows softer at greater distances from the caster, while also affecting the sun's appearance in procedural sky materials. This is called a *contact-hardening* shadow (also known as PCSS).
de: Das gerichtete Licht bietet auch eine **Winkeldistanz**-Property zur Bestimmung der Winkelgröße des Lichts in Grad. Wenn Sie diesen Wert über ``0.0`` erhöhen, werden die Schatten bei größeren Entfernungen vom Schattenwerfer weicher, während sie auch das Aussehen der Sonne in prozeduralen Himmelsmaterialien beeinflussen. Dies wird als *Kontakthärtender* Schatten bezeichnet (auch bekannt als PCSS).
zh_cn: 平行光还提供 **Angular Distance** （角度距离）属性，该属性确定光的角度大小（以度为单位）。 将其增加到 ``0.0`` 以上将使阴影在距离光源更远的地方变得更柔和，同时也会影响太阳在程序天空材质中的外观。 这称为 *接触硬化（ contact-hardening ）* 阴影（也称为 PCSS）。

source: For reference, the angular distance of the Sun viewed from the Earth is approximately ``0.5``. This kind of shadow is expensive, so check the recommendations in :ref:`doc_lights_and_shadows_pcss_recommendations` if setting this value above ``0.0`` on lights with shadows enabled.
de: Zum Vergleich: Die Winkeldistanz der Sonne von der Erde aus gesehen beträgt ungefähr ``0,5``. Diese Art von Schatten sind teuer, daher sollten Sie die Empfehlungen in :ref:`doc_lights_and_shadows_pcss_recommendations` nachschlagen, wenn Sie diesen Wert über ``0.0`` auf Lichter mit aktiviertem Schatten setzen.
zh_cn: 作为参考，从地球看太阳的角距离约为 ``0.5``\ 。这种阴影的性能开销比较高昂，因此如果在启用阴影的灯光上将此值设置为高于 ``0.0``\ ，请查看 :ref:`doc_lights_and_shadows_pcss_recommendations` 中的建议。

source: Directional shadow mapping
de: Gerichtetes Schatten-Mapping
zh_cn: 方向光阴影贴图

source: To compute shadow maps, the scene is rendered (only depth) from an orthogonal point of view that covers the whole scene (or up to the max distance). There is, however, a problem with this approach because objects closer to the camera receive low-resolution shadows that may appear blocky.
de: Zur Berechnung von Shadow-Maps wird die Szene (nur die Tiefe) aus einem orthogonalen Blickwinkel gerendert, der die gesamte Szene (oder bis zur maximalen Entfernung) abdeckt. Bei diesem Ansatz gibt es jedoch ein Problem, da Objekte, die sich näher an der Kamera befinden, Schatten mit geringer Auflösung erhalten, die blockartig erscheinen können.
zh_cn: 为了计算阴影贴图，从覆盖整个场景（或最大距离）的正交角度渲染场景（仅深度）。但是，这种方法存在一个问题，因为靠近相机的物体接收到的低分辨率阴影可能看起来是块状的。

source: With this, shadows become more detailed:
de: Damit werden die Schatten detaillierter:
zh_cn: 有了它, 阴影变得更加详细:

source: To control PSSM, a number of parameters are exposed:
de: Zur Steuerung von PSSM werden eine Reihe von Parametern angezeigt:
zh_cn: 为了控制PSSM, 暴露了许多参数:

source: Each split distance is controlled relative to the camera far (or shadow **Max Distance** if greater than ``0.0``). ``0.0`` is the eye position and ``1.0`` is where the shadow ends at a distance. Splits are in-between. Default values generally work well, but tweaking the first split a bit is common to give more detail to close objects (like a character in a third-person game).
de: Jede Teilungsdistanz wird relativ zur Kamera-Near gesteuert (oder zur **Max-Distanz** des Schattens, wenn diese größer als ``0.0`` ist). ``0.0`` ist die Augenposition und ``1.0`` ist der Punkt, an dem der Schatten in der Entfernung endet. Die Abstände liegen dazwischen. Die voreingestellten Werte funktionieren im Allgemeinen gut, aber es ist üblich, die erste Teilung ein wenig zu verändern, um nahen Objekten (wie einer Figur in einem Third-Person-Spiel) mehr Details zu verleihen.
zh_cn: 每个分割距离都是相对于相机最远处进行控制的（如果大于 ``0`` ，则为阴影 **Max Distance(最大距离)** ）。 ``0.0`` 是眼睛位置， ``1.0`` 是阴影在一定距离处结束的位置。分割介于两者之间。默认值通常效果很好，但一般会调整第一个分割数值，以便为近处对象提供更多细节（比如第三人称游戏中的角色）。

source: Always make sure to set a shadow **Max Distance** according to what the scene needs. A lower maximum distance will result in better-looking shadows and better performance, as fewer objects will need to be included in shadow rendering. You can also adjust **Fade Start** to control how aggressive the shadow fade-out should be at a distance. For scenes where the **Max Distance** fully covers the scene at any given camera position, you can increase **Fade Start** to ``1.0`` to prevent the shadow from fading at a distance. This should not be done in scenes where **Max Distance** doesn't fully cover the scene, as the shadow will appear to be suddenly cut off at a distance.
de: Stellen Sie immer sicher, dass Sie den **Max-Abstand** des Schattens so einstellen, wie es die Szene erfordert. Ein geringerer maximaler Abstand führt zu besser aussehenden Schatten und besserer Leistung, da weniger Objekte in das Schatten-Rendering einbezogen werden müssen. Sie können auch **Verblassungsstart** einstellen, um zu kontrollieren, wie aggressiv das Ausblenden des Schattens in einer bestimmten Entfernung sein soll. Bei Szenen, in denen **Max-Abstand** die Szene an einer bestimmten Kameraposition vollständig abdeckt, können Sie **Verblassungsstart** auf ``1.0`` erhöhen, um das Ausblenden des Schattens in der Entfernung zu verhindern. Dies sollte nicht in Szenen gemacht werden, in denen **Max-Abstand** die Szene nicht vollständig abdeckt, da der Schatten in der Ferne plötzlich abgeschnitten erscheint.
zh_cn: 请务必根据场景需要设置阴影的 **Max Distance** 。最大距离越小，阴影效果越好，性能也越高，因为阴影渲染中需要包含的物体越少。你还可以调整 **Fade Start** 来控制远处阴影淡出距离的强度。对于 **Max Distance** 完全覆盖任何给定摄像机位置的场景，可以将 **Fade Start** 增加到 ``1.0`` ，以防止阴影在远处渐变。在 **Max Distance** 没有完全覆盖场景的场景中，不应该这样做，因为阴影会在远处突然消失。

source: Sometimes, the transition between a split and the next can look bad. To fix this, the **Blend Splits** option can be turned on, which sacrifices detail and performance in exchange for smoother transitions:
de: Manchmal kann der Übergang zwischen einer Teilung und der nächsten schlecht aussehen. Um dies zu beheben, kann die Option **Teilungen überblenden** aktiviert werden, die Details und Performance opfert um weichere Übergänge zu erhalten:
zh_cn: 有时，一个分割与下一个之间的过渡看起来很糟糕。要解决此问题，可以打开 **Blend Splits** （混合分割）选项，牺牲细节和性能以换取更平滑的过渡：

source: The **Shadow > Normal Bias** parameter can be used to fix special cases of self-shadowing when objects are perpendicular to the light. The only downside is that it makes the shadow a bit thinner. Consider increasing **Shadow > Normal Bias** before increasing **Shadow > Bias** in most situations.
de: Der Parameter **Schatten > Normalen-Bias** kann verwendet werden, um spezielle Fälle von Selbstüberschattung zu beheben, wenn Objekte senkrecht zum Licht stehen. Der einzige Nachteil ist, dass der Schatten dadurch etwas dünner wird. Ziehen Sie in den meisten Situationen eine Erhöhung von **Schatten > Normalen-Bias** in Betracht, bevor Sie **Schatten > Bias** erhöhen.
zh_cn: **Shadow > Normal Bias** 参数可用于修复当对象垂直于光线时自阴影的特殊情况。唯一的缺点是它会使阴影变得更薄。在大多数情况下，在增加 **Shadow > Bias** 之前，请考虑增加 **Shadow > Normal Bias** 。

source: Lastly, **Pancake Size** is a property that can be adjusted to fix missing shadows when using large objects with unsubdivided meshes. Only change this value if you notice missing shadows that are not related to shadow biasing issues.
de: Schließlich ist **Pancake-Größe** eine Property, die angepasst werden kann, um fehlende Schatten zu beheben, wenn große Objekte mit ungeteilten Meshes verwendet werden. Ändern Sie diesen Wert nur, wenn Sie fehlende Schatten bemerken, die nicht auf Probleme mit der Schatten-Bias zurückzuführen sind.
zh_cn: 最后，如果未细分网格的大型对象出现了阴影缺失的情况，可以调整 **Pancake Size**\ （压平区大小）属性来修复。只有在发现阴影缺失与阴影偏置问题无关时，才可以更改此值。

source: Omni light
de: Omni-Licht
zh_cn: 全向光

source: Omni light is a point source that emits light spherically in all directions up to a given radius.
de: Omni-Licht ist eine Punktlichtquelle, die ihr Licht bis zu einem bestimmten Radius kugelförmig in alle Richtungen abstrahlt.
zh_cn: 全向光是一种点光源，可在所有方向上发射光，直至给定的半径。

source: In real life, light attenuation is an inverse function, which means omni lights don't have a radius. This is a problem because it means computing several omni lights would become demanding.
de: Im echten Leben ist die Lichtabschwächung eine Umkehrfunktion, was bedeutet, dass Rundumlichter keinen Radius haben. Das ist ein Problem, denn es bedeutet, dass die Berechnung mehrerer Rundumlichter anspruchsvoll werden würde.
zh_cn: 在现实生活中，光衰减是个和距离成反比的函数，这意味着全向光没有半径。这是一个问题，因为这意味着计算几个全向光会变得很困难。

source: To solve this, a **Range** parameter is introduced together with an attenuation function.
de: Um dieses Problem zu lösen, wird ein Parameter **Bereich** zusammen mit einer Dämpfungsfunktion eingeführt.
zh_cn: 为了解决这个问题，引入了 **Range** （范围）参数和衰减函数。

source: These two parameters allow tweaking how this works visually in order to find aesthetically pleasing results.
de: Mit diesen beiden Parametern lässt sich die visuelle Darstellung optimieren, um ästhetisch ansprechende Ergebnisse zu erzielen.
zh_cn: 这两个参数允许调整其在视觉上的工作方式, 以便找到美学上令人愉悦的结果.

source: A **Size** parameter is also available in OmniLight3D. Increasing this value will make the light fade out slower and shadows appear blurrier when far away from the caster. This can be used to simulate area lights to an extent. This is called a *contact-hardening* shadow (also known as PCSS). This kind of shadow is expensive, so check the recommendations in :ref:`doc_lights_and_shadows_pcss_recommendations` if setting this value above ``0.0`` on lights with shadows enabled.
de: In OmniLight3D gibt es auch einen Parameter **Größe**. Wenn Sie diesen Wert erhöhen, wird das Licht langsamer ausgeblendet und die Schatten erscheinen unschärfer, wenn sie weit vom Schattenwerfer entfernt sind. Auf diese Weise können Sie in gewissem Umfang Flächenlichter simulieren. Dies wird als *Kontakthärtender* Schatten bezeichnet (auch als PCSS bekannt). Diese Art von Schatten ist teuer, daher sollten Sie die Empfehlungen in :ref:`doc_lights_and_shadows_pcss_recommendations` überprüfen, wenn Sie diesen Wert über ``0.0`` auf Lichter mit aktivierten Schatten setzen.
zh_cn: OmniLight3D 中还有一个 **Size** 参数。增大该值会使光线减弱得更慢，在远离投射者时阴影会显得更模糊。这可以在一定程度上模拟区域灯光。这就是 *接触硬化* （contact-hardening）阴影（也称为 PCSS）。这种阴影的成本较高，因此在启用阴影的灯光上将此值设置为高于 ``0.0`` 时，请查看 :ref:`doc_lights_and_shadows_pcss_recommendations` 中的建议。

source: Omni shadow mapping
zh_cn: 全向光阴影贴图

source: Omni light shadow mapping is relatively straightforward. The main issue that needs to be considered is the algorithm used to render it.
de: Omni-Licht-Shadow-Mapping ist relativ einfach. Das Hauptproblem, das berücksichtigt werden muss, ist der Algorithmus, mit dem es gerendert wird.
zh_cn: 全向光的阴影贴图相对简单。需要考虑的主要问题是用于渲染它的算法。

source: Omni Shadows can be rendered as either **Dual Paraboloid** or **Cube** mapped. **Dual Parabolid** renders quickly, but can cause deformations, while **Cube** is more correct, but slower. The default is **Cube**, but consider changing it to **Dual Parabolid** for lights where it doesn't make much of a visual difference.
de: Omni-Schatten können entweder als **Dual Paraboloid** oder **Cube** gerendert werden. **Dual Parabolid** rendert schnell, kann aber Verformungen verursachen, während **Cube** korrekter, aber langsamer ist. Die Standardeinstellung ist **Cube**, aber für Lichter, bei denen es keinen großen visuellen Unterschied macht, sollten Sie **Dual Parabolid** wählen.
zh_cn: 全向光阴影可以渲染为 **Dual Paraboloid** （双抛物面）或 **Cube** （方形）映射。 **Dual Paraboloid** 的渲染速度很快，但可能会导致变形，而 **Cube** 更正确但速度较慢。默认值为 **Cube** ，但可以考虑将其改为 **Dual Paraboloid** ，以让光线不会产生太大的视觉差异。

source: If the objects being rendered are mostly irregular and subdivided, Dual Paraboloid is usually enough. In any case, as these shadows are cached in a shadow atlas (more on that at the end), it may not make a difference in performance for most scenes.
de: Wenn die gerenderten Objekte meist unregelmäßig und unterteilt sind, ist Dual Paraboloid normalerweise ausreichend. Da diese Schatten in einem Shadow-Atlas zwischengespeichert werden (mehr dazu am Ende), macht dies für die meisten Szenen keinen Unterschied in der Leistung.
zh_cn: 如果渲染的对象大部分是不规则且细分的，那么 Dual Paraboloid （双抛物线）通常就足够了。无论怎么说，由于这些阴影被缓存在阴影图集中（后面会详细介绍）， 对于大多数场景而言，它可能不会对性能产生影响。

source: Omni lights with shadows enabled can make use of projectors. The projector texture will *multiply* the light's color by the color at a given point on the texture. As a result, lights will usually appear to be darker once a projector texture is assigned; you can increase **Energy** to compensate for this.
de: Omni-Lichter mit aktivierten Schatten können Projektoren verwenden. Die Projektor-Textur *multipliziert* die Farbe des Lichts mit der Farbe an einem bestimmten Punkt der Textur. Daher erscheinen Lichter in der Regel dunkler, wenn eine Projektor-Textur zugewiesen ist; Sie können **Energie** erhöhen, um dies auszugleichen.
zh_cn: 启用阴影功能的全向灯光可以使用投影。投影纹理会将灯光的颜色乘以纹理上给定点的颜色。因此，一旦分配了投影纹理，灯光通常会显得更暗；你可以增加 **Energy** 来弥补这一点。

source: Omni light projector textures require a special 360° panorama mapping, similar to :ref:`class_PanoramaSkyMaterial` textures.
de: Omni-Lichtprojektor-Texturen erfordern ein spezielles 360°-Panorama-Mapping, ähnlich den :ref:`class_PanoramaSkyMaterial`-Texturen.
zh_cn: 全方位光投影纹理需要特殊的 360° 全景贴图，类似于 :ref:`class_PanoramaSkyMaterial` 纹理。

source: With the projector texture below, the following result is obtained:
de: Mit der unten angegebenen Projektortextur erhält man folgendes Ergebnis:
zh_cn: 通过下面的投影纹理，可以得到以下结果：

source: If you've acquired omni projectors in the form of cubemap images, you can use `this web-based conversion tool <https://danilw.github.io/GLSL-howto/cubemap_to_panorama_js/cubemap_to_panorama.html>`__ to convert them to a single panorama image.
de: Wenn Sie Omniprojektoren in Form von Cubemap-Bildern vorliegen haben, können Sie `dieses webbasierte Konvertierungstool <https://danilw.github.io/GLSL-howto/cubemap_to_panorama_js/cubemap_to_panorama.html>`__ verwenden, um sie in ein einziges Panoramabild umzuwandeln.
zh_cn: 如果你已获得立方体贴图形式的全方位投影图像，你可以使用 `这个基于网络的转换工具 <https://danilw.github.io/GLSL-howto/cubemap_to_panorama_js/cubemap_to_panorama.html>`__ 将它们转换为单一的全景图像。

source: Spot light
de: Spot-Licht
zh_cn: 聚光

source: Spot lights are similar to omni lights, except they emit light only into a cone (or "cutoff"). They are useful to simulate flashlights, car lights, reflectors, spots, etc. This type of light is also attenuated towards the opposite direction it points to.
de: Spotlichter sind ähnlich wie Omni-Lichter, allerdings strahlen sie das Licht nur in einen Kegel (oder "Cutoff") ab. Sie sind nützlich, um Taschenlampen, Autolichter, Reflektoren, Scheinwerfer usw. zu simulieren. Diese Art von Licht wird auch in die entgegengesetzte Richtung, in die es zeigt, abgeschwächt.
zh_cn: 聚光与全向光类似，但是它们只发光到锥形（或“截断”）中。它们可用于模拟手电筒、车灯、反射器、聚光灯等。这种类型的光也会向其指向的相反方向衰减。

source: Spot lights share the same **Range**, **Attenuation** and **Size** as OmniLight3D, and add two extra parameters:
de: Spotlichter haben die gleichen Parameter **Bereich**, **Dämpfung** und **Größe** wie OmniLight3D und fügen zwei zusätzliche Parameter hinzu:
zh_cn: 聚光和 OmniLight3D**\ 共用相同的 **Range（范围）**\ 、 **Attenuation（衰减）**\ 和 **Size（大小）**\ ，并添加了两个额外参数：

source: **Angle:** The aperture angle of the light.
de: **Winkel**: Der Blendenwinkel des Lichts.
zh_cn: **Angle：** （角度）光线的光圈角度。

source: **Angle Attenuation:** The cone attenuation, which helps soften the cone borders.
de: **Winkeldämpfung:** Die Kegeldämpfung, die dazu beiträgt, die Kegelränder abzuschwächen.
zh_cn: **Angle Attenuation：** （角度衰减）锥形衰减，有助于柔化锥形边界。

source: Spot shadow mapping
de: Punktlicht-Shadow-Mapping
zh_cn: 聚光灯阴影贴图

source: Spots feature the same parameters as omni lights for shadow mapping. Rendering spot shadow maps is significantly faster compared to omni lights, as only one shadow texture needs to be rendered (instead of rendering 6 faces, or 2 in dual parabolid mode).
de: Spots verfügen über die gleichen Parameter wie Omni-Lights für die Shadow-Mapping. Das Rendern von Spot-Shadow-Maps ist im Vergleich zu Omnilichtern deutlich schneller, da nur eine Schattentextur gerendert werden muss (statt 6 Flächen oder 2 im Dual-Parabolid-Modus zu rendern).
zh_cn: 聚光灯的阴影贴图参数与全方位光源相同。由于只需渲染一个阴影纹理（而不是渲染 6 个面，或在双 Parabolid 模式下渲染 2 个面），因此渲染聚光灯阴影贴图的速度明显快于全方位光源。

source: Spot lights with shadows enabled can make use of projectors. The projector texture will *multiply* the light's color by the color at a given point on the texture. As a result, lights will usually appear to be darker once a projector texture is assigned; you can increase **Energy** to compensate for this.
de: Spotlichter mit aktivierten Schatten können Projektoren verwenden. Die Projektor-Textur *multipliziert* die Farbe des Lichts mit der Farbe an einem bestimmten Punkt der Textur. Daher erscheinen Lichter in der Regel dunkler, wenn eine Projektor-Textur zugewiesen wurde; Sie können **Energie** erhöhen, um dies auszugleichen.
zh_cn: 启用阴影功能的光线可以使用投影。投影纹理会将灯光的颜色乘以纹理上给定点的颜色。因此，一旦分配了投影纹理，灯光通常会显得更暗；你可以增加 **Energy** 来弥补这一点。

source: Unlike omni light projectors, a spot light projector texture doesn't need to follow a special format to look correct. It will be mapped in a way similar to a :ref:`decal <doc_using_decals>`.
de: Im Gegensatz zu Omni-Licht-Projektoren muss die Textur eines Punktlicht-Projektors keinem speziellen Format folgen, um korrekt auszusehen. Sie wird ähnlich wie ein :ref:`Decal <doc_using_decals>` abgebildet.
zh_cn: 与全向光投影不同，聚光灯投影纹理不需要遵循特殊格式就能看起来正确无误。它的映射方式类似于 :ref:`decal <doc_using_decals>`。

source: Spot lights with wide angles will have lower-quality shadows than spot lights with narrow angles, as the shadow map is spread over a larger surface. At angles wider than 89 degrees, spot light shadows will stop working entirely. If you need shadows for wider lights, use an omni light instead.
de: Bei Spot-Lichtern mit weitem Winkel ist die Qualität der Schatten geringer als bei Spot-Lichtern mit engem Winkel, da die Shadow-Map über eine größere Fläche verteilt wird. Bei einem Winkel von mehr als 89 Grad funktionieren die Schatten von Spot-Lichtern überhaupt nicht mehr. Wenn Sie Schatten für breitere Lichter benötigen, verwenden Sie stattdessen ein Omni-Licht.
zh_cn: 广角聚光灯的阴影质量会低于窄角聚光，因为阴影贴图会分布在更大的表面上。角度大于 89 度时，聚光阴影将完全停止工作。如果你需要更宽的灯光阴影，请使用全向光。

source: Shadow atlas
zh_cn: 阴影图集

source: Unlike Directional lights, which have their own shadow texture, omni and spot lights are assigned to slots of a shadow atlas. This atlas can be configured in the advanced Project Settings (**Rendering > Lights And Shadows > Positional Shadow**).
de: Im Gegensatz zu gerichteten Lichtern, die über eine eigene Schattentextur verfügen, werden Omni- und Punktlichter den Slots eines Shadow-Atlasses zugewiesen. Dieser Atlas kann in den erweiterten Projekteinstellungen konfiguriert werden (**Rendering > Lichter und Schatten > Positionsschatten**).
zh_cn: 与具有自己的阴影纹理的平行光不同，全向光和聚光被分配了阴影图集的槽位。该图集可以在高级项目设置（ **渲染 > 灯光和阴影 > 位置阴影** ）中进行配置。

source: The resolution applies to the whole shadow atlas. This atlas is divided into four quadrants:
de: Die Auflösung gilt für den gesamten Shadow-Atlas. Dieser Atlas ist in vier Quadranten unterteilt:
zh_cn: 这个分辨率适用于整个阴影图集。该图集分为四个象限：

source: Each quadrant can be subdivided to allocate any number of shadow maps; the following is the default subdivision:
de: Jeder Quadrant kann unterteilt werden, um eine beliebige Anzahl von Shadow-Maps zuzuweisen; die folgende Unterteilung ist die Default-Unterteilung:
zh_cn: 每个象限可以细分，分配任意数量的阴影贴图。以下是默认细分方式：

source: The shadow atlas allocates space as follows:
de: Der Shadow-Atlas weist den Platz wie folgt zu:
zh_cn: 阴影图集分配空间如下：

source: The biggest shadow map size (when no subdivision is used) represents a light the size of the screen (or bigger).
de: Die größte Shadow Map-Größe (wenn keine Unterteilung verwendet wird) stellt ein Licht in der Größe des Bildschirms (oder größer) dar.
zh_cn: 最大阴影贴图尺寸（未使用细分时）代表屏幕尺寸（或更大）的灯光。

source: Subdivisions (smaller maps) represent shadows for lights that are further away from view and proportionally smaller.
de: Unterteilungen (kleinere Karten) stellen Schatten für Lichter dar, die weiter vom Blickpunkt entfernt und proportional kleiner sind.
zh_cn: 细分（较小的贴图）表示距离视图较远并且比例较小的灯光的阴影。

source: Every frame, the following procedure is performed for all lights:
de: Bei jedem Frame wird das folgende Verfahren für alle Lichter durchgeführt:
zh_cn: 每一帧, 以下过程被应用于所有光:

source: Check if the light is on a slot of the right size. If not, re-render it and move it to a larger/smaller slot.
de: Prüfen Sie, ob sich das Licht auf einem Slot der richtigen Größe befindet. Wenn nicht, rendern Sie es neu und verschieben Sie es in einen größeren/kleineren Slot.
zh_cn: 检查灯光是否在正确大小的插槽上. 如果没有, 重新渲染它并将其移动到更大/更小的插槽.

source: Check if any object affecting the shadow map has changed. If it did, re-render the light.
de: Prüfen Sie, ob sich ein Objekt, das die Shadow-Map beeinflusst, geändert hat. Wenn ja, rendern Sie das Licht neu.
zh_cn: 检查影响阴影贴图的任何对象是否已更改. 如果是的话, 重新渲染光线.

source: If neither of the above has happened, nothing is done, and the shadow is left untouched.
de: Ist keiner der beiden Fälle eingetreten, wird nichts unternommen und der Schatten bleibt unverändert.
zh_cn: 如果上述情况均未发生, 则不执行任何操作, 阴影保持不变.

source: If the slots in a quadrant are full, lights are pushed back to smaller slots, depending on size and distance. If all slots in all quadrants are full, some lights will not be able to render shadows even if shadows are enabled on them.
de: Wenn die Slots in einem Quadranten voll sind, werden die Lichter je nach Größe und Entfernung in kleinere Slots zurückgeschoben. Wenn alle Slots in allen Quadranten voll sind, können einige Lichter keine Schatten rendern, selbst wenn Schatten für sie aktiviert sind.
zh_cn: 如果一个象限中的槽位满了，光线会被推回到更小的槽位中，取决于大小和距离。如果所有象限中的所有槽位都已满，则某些灯光即使启用了阴影，也将无法渲染阴影。

source: The default shadow allocation strategy allows rendering up to 88 lights with shadows enabled in the camera frustum (4 + 4 + 16 + 64):
de: Die Standardstrategie für die Schattenzuweisung ermöglicht das Rendern von bis zu 88 Lichtern mit aktiviertem Schatten im Kamera-Frustum (4 + 4 + 16 + 64):
zh_cn: 默认的阴影分配策略最多可以渲染 88 盏灯，并在相机锥体中启用阴影（4 + 4 + 16 + 64）：

source: The first and most detailed quadrant can store 4 shadows.
de: Der erste und detaillierteste Quadrant kann 4 Schatten speichern.
zh_cn: 第一象限也是最精细的象限，可以存储 4 个阴影。

source: The second quadrant can store 4 other shadows.
de: Der zweite Quadrant kann 4 weitere Schatten speichern.
zh_cn: 第二象限可存储 4 个其他阴影。

source: The third quadrant can store 16 shadows, with less detail.
de: Der dritte Quadrant kann 16 Schatten speichern, allerdings mit weniger Details.
zh_cn: 第三象限可存储 16 个阴影，但细节较少。

source: The fourth and least detailed quadrant can store 64 shadows, with even less detail.
de: Der vierte und am wenigsten detaillierte Quadrant kann 64 Schatten speichern, die noch weniger detailliert sind.
zh_cn: 第四象限也是细节最少的象限，可存储 64 个阴影，但细节更少。

source: Using a higher number of shadows per quadrant allows supporting a greater amount of total lights with shadows enabled, while also improving performance (as shadows will be rendered at a lower resolution for each light). However, increasing the number of shadows per quadrant comes at the cost of lower shadow quality.
de: Die Verwendung einer höheren Anzahl von Schatten pro Quadrant ermöglicht es, eine größere Anzahl von Lichtern mit aktivierten Schatten zu unterstützen und gleichzeitig die Leistung zu verbessern (da die Schatten mit einer geringeren Auflösung für jedes Licht gerendert werden). Die Erhöhung der Anzahl der Schatten pro Quadrant geht jedoch einher mit einer geringeren Schattenqualität.
zh_cn: 每个象限使用较多的阴影数量可以支持启用阴影的更多灯光，同时还能提高性能（因为阴影将以较低的分辨率为每个灯光渲染）。不过，增加每个象限的阴影数量的代价是降低阴影质量。
