Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/lights_and_shadows.po
Languages: de, zh_cn

source: 3D lights and shadows
de: 3D Beleuchtung und Schatten
zh_cn: 3D 灯光和阴影

source: Introduction
de: Einführung
zh_cn: 前言

source: Light sources emit light that mixes with the materials and produces a visible result. Light can come from several types of sources in a scene:
de: Lichtquellen emittieren Licht, das sich mit den Materialien vermischt und ein sichtbares Ergebnis erzeugt. In einer Szene kann das Licht von verschiedenen Quellen stammen:
zh_cn: 光源发出灯光，灯光会与材质相混合，产生可见的结果。场景可以有很多不同类型的光源：

source: From the material itself, in the form of the emission color (though it does not affect nearby objects unless baked or screen-space indirect lighting is enabled).
de: Vom Material selbst, in Form der Emissionsfarbe (obwohl sie sich nicht auf nahe gelegene Objekte auswirkt, es sei denn, gebackene oder indirekte Beleuchtung im Screen-Space ist aktiviert).
zh_cn: 来自材质本身的自发光颜色（但是无法影响附近的对象，除非进行了烘焙，或者启用了屏幕空间间接光照）。

source: Light nodes: DirectionalLight3D, OmniLight3D and SpotLight3D.
de: Beleuchtungs-Nodes: DirectionalLight3D, OmniLight3D und SpotLight3D.
zh_cn: 灯光节点：DirectionalLight3D、OmniLight3D、SpotLight3D。

source: Ambient light in the :ref:`Environment <class_Environment>` or :ref:`doc_reflection_probes`.
de: Umgebungslicht in der :ref:`Environment <class_Environment>` oder :ref:`doc_reflection_probes`.
zh_cn: :ref:`Environment <class_Environment>` 或 :ref:`doc_reflection_probes` 中的环境光。

source: Global illumination (:ref:`LightmapGI <doc_using_lightmap_gi>`, :ref:`VoxelGI <doc_using_voxel_gi>` or :ref:`SDFGI <doc_using_sdfgi>`).
de: Global Illumination (:ref:`LightmapGI <doc_using_lightmap_gi>`, :ref:`VoxelGI <doc_using_voxel_gi>` oder :ref:`SDFGI <doc_using_sdfgi>`).
zh_cn: 全局光照（\ :ref:`LightmapGI <doc_using_lightmap_gi>`\ 、\ :ref:`VoxelGI <doc_using_voxel_gi>`\ 、\ :ref:`SDFGI <doc_using_sdfgi>`\ ）。

source: The emission color is a material property. You can read more about it in the :ref:`doc_standard_material_3d` tutorial.
de: Die Emissionsfarbe ist eine Materialeigenschaft. Sie können mehr darüber im :ref:`doc_standard_material_3d`-Tutorial lesen.
zh_cn: 自发光是材质的属性。更多相关内容见 :ref:`doc_standard_material_3d` 教程。

source: You can compare various types of lights in action using the `3D Lights and Shadows demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/lights_and_shadows>`__.
de: Sie können verschiedene Arten von Lichtern in Aktion vergleichen, indem Sie das `3D Lights and Shadows Demo-Projekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/lights_and_shadows>`__ verwenden.
zh_cn: 可以使用 `3D 光影演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/lights_and_shadows>`__\ 动态比较不同类型的灯光。

source: Light nodes
de: Beleuchtungs-Nodes
zh_cn: 灯光节点

source: There are three types of light nodes: :ref:`class_DirectionalLight3D`, :ref:`class_OmniLight3D` and :ref:`class_SpotLight3D`. Let's take a look at the common parameters for lights:
de: Es gibt drei Arten von Licht-Nodes: :ref:`class_DirectionalLight3D`, :ref:`class_OmniLight3D` und :ref:`class_SpotLight3D`. Werfen wir einen Blick auf die allgemeinen Parameter für Lichter:
zh_cn: 灯光节点有三种：\ :ref:`class_DirectionalLight3D`\ 、\ :ref:`class_OmniLight3D`\ 、\ :ref:`class_SpotLight3D`\ 。让我们来看看灯光的通用参数：

source: Each property has a specific function:
de: Jede Property hat eine bestimmte Funktion:
zh_cn: 每个属性都有特定的功能：

source: **Color:** Base color for emitted light.
de: **Farbe**: Grundfarbe für emittiertes Licht.
zh_cn: **Color：**\ 发光的基础颜色。

source: **Energy:** Energy multiplier. This is useful for saturating lights or working with :ref:`doc_high_dynamic_range`.
de: **Energie**: Energie-Multiplikator. Dies ist nützlich, um Lichter zu sättigen oder mit :ref:`doc_high_dynamic_range` zu bearbeiten.
zh_cn: **Energy：**\ 能量乘数。这对于使灯光饱和或使用 :ref:`doc_high_dynamic_range` 非常有用。

source: **Indirect Energy:** Secondary multiplier used with indirect light (light bounces). This works with :ref:`doc_using_lightmap_gi`, VoxelGI or SDFGI.
de: **Indirekte Energie**: Sekundärer Multiplikator, der bei indirektem Licht (Licht-Abprälle) verwendet wird. Dies funktioniert mit :ref:`doc_using_lightmap_gi`, VoxelGI oder SDFGI.
zh_cn: **Indirect Energy：**\ 间接能量。用于间接光（反弹的光）的次级乘数。适用于 :ref:`doc_using_lightmap_gi`\ 、VoxelGI 和 SDFGI。

source: **Volumetric Fog Energy:** Secondary multiplier used with volumetric fog. This only has an effect when volumetric fog is enabled.
de: **Volumetrische Nebel-Energie:** Sekundärer Multiplikator, der bei volumetrischem Nebel verwendet wird. Dies hat nur einen Effekt, wenn volumetrischer Nebel aktiviert ist.
zh_cn: **Volumetric Fog Energy：**\ 体积雾能量。用于体积雾的次级乘数。仅在启用体积雾时有效。

source: **Negative:** Light becomes subtractive instead of additive. It's sometimes useful to manually compensate some dark corners.
de: **Negativ:** Das Licht wird subtraktiv statt additiv. Manchmal ist es sinnvoll, dunkle Ecken manuell zu kompensieren.
zh_cn: **Negative：** （减色）光变为减色而不是添加。对于手动补偿一些黑暗角落有时很有用。

source: **Specular:** Affects the intensity of the specular blob in objects affected by this light. At zero, this light becomes a pure diffuse light.
de: **Specular**: Beeinflusst die Intensität des spiegelnden Flecks in Objekten, die von diesem Licht betroffen sind. Bei Null wird dieses Licht zu einem rein diffusen Licht.
zh_cn: **Specular：**\ 镜面反射。影响受此光影响的物体中镜面反射斑点的强度。值为零时，该光变为纯漫反射光。

source: **Bake Mode:** Sets the bake mode for the light. See :ref:`doc_using_lightmap_gi`.
de: **Backmodus:** Legt den Backmodus für das Licht fest. Siehe :ref:`doc_using_lightmap_gi`.
zh_cn: **Bake Mode：**\ 设置灯光的烘焙模式。见 :ref:`doc_using_lightmap_gi`\ 。

source: **Cull Mask:** Objects that are in the selected layers below will be affected by this light. Note that objects disabled via this cull mask will still cast shadows. If you don't want disabled objects to cast shadows, adjust the **Cast Shadow** property on the GeometryInstance3D to the desired value.
de: **Cull-Maske:** Objekte, die sich in den ausgewählten Ebenen darunter befinden, werden von diesem Licht beeinflusst. Beachten Sie, dass Objekte, die über diese Ausblendungsmaske deaktiviert werden, trotzdem Schatten werfen. Wenn Sie nicht möchten, dass deaktivierte Objekte Schatten werfen, stellen Sie die Property **Schatten werfen** der GeometryInstance3D auf den gewünschten Wert ein.
zh_cn: **Cull Mask：** （剔除遮罩）在下面选定的图层中的物体将受到此光的影响。请注意，通过这个剔除遮罩禁用的对象仍然会投射阴影。如果你不希望被禁用的物体投射阴影，请将 GeometryInstance3D上的 **Cast Shadow** 属性调整为所需的值。

source: See :ref:`doc_physical_light_and_camera_units` if you wish to use real world units to configure your lights' intensity and color temperature.
de: Siehe :ref:`doc_physical_light_and_camera_units`, wenn Sie die Intensität und Farbtemperatur Ihrer Lichter in Einheiten der realen Welt konfigurieren möchten.
zh_cn: 如果你希望使用真实世界的单位来配置灯光的强度和色温，请参阅 :ref:`doc_physical_light_and_camera_units`。

source: Light number limits
de: Grenzwerte für die Anzahl von Lichtern
zh_cn: 灯光数量限制

source: When using the Forward+ renderer, Godot uses a *clustering* approach for real-time lighting. As many lights as desired can be added (as long as performance allows). However, there's still a default limit of 512 *clustered elements* that can be present in the current camera view. A clustered element is an omni light, a spot light, a :ref:`decal <doc_using_decals>` or a :ref:`reflection probe <doc_reflection_probes>`. This limit can be increased by adjusting the **Rendering > Limits > Cluster Builder > Max Clustered Elements** advanced project setting.
de: Bei Verwendung des Forward+-Renderers verwendet Godot einen *Cluster*-Ansatz für die Echtzeitbeleuchtung. Es können so viele Lichter wie gewünscht hinzugefügt werden (solange die Performance dies zulässt). Es gibt jedoch immer noch eine Standardgrenze von 512 *Cluster-Elementen*, die in der aktuellen Kameraansicht vorhanden sein können. Ein Cluster-Element ist ein Rundumlicht, ein Spotlight, ein :ref:`Decal <doc_using_decals>` oder eine :ref:`Reflexions-Probe <doc_reflection_probes>`. Diese Grenze kann durch Anpassen der erweiterten Projekteinstellung **Rendering > Limits > Cluster Builder > Max. geclusterte Elemente** erhöht werden.
zh_cn: 在使用 Forward+ 渲染器时，Godot 采用*集群*方法进行实时照明。只要性能允许，可以添加任意数量的灯光。不过，默认情况下，当前摄像机视图中的 *集群元素* 上限仍为 512 个。集群元素是指全向光灯、聚光灯、 :ref:`贴花 <doc_using_decals>` 或 :ref:`反射探针 <doc_reflection_probes>`。可以通过调整 "**渲染 > 限制 > 群集生成器 > 最大群集元素**"高级项目设置来增加此限制。

source: When using the Forward Mobile renderer, there is a limitation of 8 OmniLights + 8 SpotLights per mesh resource. There is also a limit of 256 OmniLights + 256 SpotLights that can be rendered in the current camera view. These limits currently cannot be changed.
de: Wenn Sie den Forward Mobile Renderer verwenden, gibt es eine Begrenzung von 8 OmniLights + 8 SpotLights pro Mesh-Ressource. Es gibt auch eine Begrenzung von 256 OmniLights + 256 SpotLights, die in der aktuellen Kameraansicht gerendert werden können. Diese Grenzen können derzeit nicht geändert werden.
zh_cn: 使用 Forward 移动渲染器时，每个网格资源有 8 个 OmniLight 加 8 个 SpotLight 的限制。此外，在当前相机视图中可渲染的 OmniLight 和 SpotLight 数量限制为 256 个。这些限制目前无法更改。

source: When using the Compatibility renderer, up to 8 OmniLights + 8 SpotLights can be rendered per mesh resource. This limit can be increased in the advanced Project Settings by adjusting **Rendering > Limits > OpenGL > Max Renderable Lights** and/or **Rendering > Limits > OpenGL > Max Lights Per Object** at the cost of performance and longer shader compilation times. The limit can also be decreased to reduce shader compilation times and improve performance slightly.
de: Wenn Sie den Kompatibilitäts-Renderer verwenden, können bis zu 8 OmniLights + 8 SpotLights pro Mesh-Ressource gerendert werden. Diese Grenze kann in den erweiterten Projekteinstellungen durch Anpassen von **Rendering > Limits > OpenGL > Max. renderbare Lichter** und/oder **Rendering > Limits > OpenGL > Max Lichtinstanzen pro Object** auf Kosten der Performance und längerer Shader-Kompilierungszeiten erhöht werden. Der Grenzwert kann auch verringert werden, um die Shader-Kompilierungszeiten zu reduzieren und die Performance leicht zu verbessern.
zh_cn: 使用兼容渲染器时，每个网格资源最多可渲染 8 个 OmniLight 加 8 个 SpotLight。在高级项目设置中，可以通过调整 "**渲染 > 限制 > OpenGL > 最大可渲染光源数**"和/或 "**渲染 > 限制 > OpenGL > 单对象最大光源数**"来增加该限制，但代价是会影响性能并导致较长的着色器编译时间。也可以降低该限制，以减少着色器编译时间并略微提高性能。

source: With all rendering methods, up to 8 DirectionalLights can be visible at a time. However, each additional DirectionalLight with shadows enabled will reduce the effective shadow resolution of each DirectionalLight. This is because directional shadow atlas is shared between all lights.
de: Bei allen Rendering-Methoden können bis zu 8 DirectionalLights gleichzeitig sichtbar sein. Jedes zusätzliche DirectionalLight mit aktivierten Schatten reduziert jedoch die effektive Schattenauflösung jedes DirectionalLights. Dies liegt daran, dass der Shadow-Atlas für alle Lichter gemeinsam genutzt wird.
zh_cn: 在所有的渲染方法中，最多可以同时显示 8 个 DirectionalLight。但是，每增加一个启用阴影的 DirectionalLight，都会降低每个 DirectionalLight 的有效阴影分辨率。这是因为所有灯光共享方向阴影图集。

source: If the rendering limit is exceeded, lights will start popping in and out during camera movement, which can be distracting. Enabling **Distance Fade** on light nodes can help reduce this issue while also improving performance. Splitting your meshes into smaller portions can also help, especially for level geometry (which also improves culling efficiency).
de: Wenn die Rendering-Grenze überschritten wird, beginnen sich die Lichter während der Kamerabewegung an und auszuschalten, was ablenkend wirken kann. Die Aktivierung von **Fernausblendung** auf Light Nodes kann helfen, dieses Problem zu reduzieren und gleichzeitig die Leistung zu verbessern. Das Aufteilen von Meshes in kleinere Teile kann ebenfalls helfen, insbesondere bei der Level-Geometrie (was auch die Effizienz des Culling verbessert).
zh_cn: 如果超过了渲染限制，灯光就会在摄像机移动过程中跳进跳出，这可能会分散注意力。在灯光节点上启用 **Distance Fade** 有助于减少这一问题，同时还能提高性能。将网格分割成更小的部分也会有所帮助，尤其是关卡几何体（这也能提高剔除效率）。

source: If you need to render more lights than possible in a given rendering backend, consider using :ref:`baked lightmaps <doc_using_lightmap_gi>` with lights' bake mode set to **Static**. This allows lights to be fully baked, which also makes them much faster to render. You can also use emissive materials with any :ref:`global illumination <doc_introduction_to_global_illumination>` technique as a replacement for light nodes that emit light over a large area.
de: Wenn Sie mehr Lichter rendern müssen, als in einem bestimmten Rendering-Backend möglich ist, sollten Sie :ref:`gebackene Lightmaps <doc_using_lightmap_gi>` verwenden, wobei der Back-Modus der Lichter auf **Statisch** gesetzt ist. Dies ermöglicht es, Lichter vollständig zu backen, wodurch sie auch viel schneller gerendert werden können. Sie können auch emittierende Materialien mit jeder beliebigen Technik der :ref:`Global Illumination <doc_introduction_to_global_illumination>` als Ersatz für Licht-Nodes verwenden, die Licht über einen großen Bereich emittieren.
zh_cn: 如果你需要渲染的灯光数量超过了给定渲染后端所能提供的数量，请考虑使用 :ref:`baked lightmaps <doc_using_lightmap_gi>`\ ，并将灯光的烘焙模式设置为 **Static**\ 。这样就可以完全烘焙光照，从而加快渲染速度。你也可以使用任何\ :ref:`全局光照 <doc_introduction_to_global_illumination>`\ 技术的自发光材料来替代在大范围内发出光线的光节点。

source: Shadow mapping
zh_cn: 阴影贴图

source: Lights can optionally cast shadows. This gives them greater realism (light does not reach occluded areas), but it can incur a bigger performance cost. There is a list of generic shadow parameters, each also has a specific function:
de: Lichter können optional Schatten werfen. Dies verleiht ihnen mehr Realismus (das Licht erreicht keine verdeckten Bereiche), kann aber auch zu größeren Leistungseinbußen führen. Es gibt eine Liste allgemeiner Schattenparameter, von denen jeder auch eine spezifische Funktion hat:
zh_cn: 灯光可以可选地投射阴影. 这使它们具有更好的真实感(光线不会照到被遮挡的区域), 但它会带来更大的性能开销. 有一个通用阴影参数列表, 每个参数也有一个特定的功能:

source: **Enabled:** Check to enable shadow mapping in this light.
de: **Aktiviert:** Wählen Sie diese Option, um Shadow-Mapping bei diesem Licht zu aktivieren.
zh_cn: **Enabled：** 选中以启用此灯光下的阴影贴图。

source: **Opacity:** Areas occluded are darkened by this opacity factor. Shadows are fully opaque by default, but this can be changed to make shadows translucent for a given light.
de: **Deckkraft:** Verdeckte Bereiche werden mit diesem Deckkraftfaktor abgedunkelt. Schatten sind standardmäßig vollständig undurchsichtig, aber dies kann geändert werden, um Schatten für ein bestimmtes Licht durchsichtig zu machen.
zh_cn: **Opacity：** （不透明度）被遮挡的区域会因该不透明度系数而变暗。默认情况下，阴影是完全不透明的，但是可以更改此设置，以使阴影对于给定的光线来说是半透明的。

source: **Bias:** When this parameter is too low, self-shadowing occurs. When too high, shadows separate from the casters. Tweak to what works best for you.
de: **Bias:** Wenn dieser Parameter zu niedrig ist, kommt es zu Selbstschattenbildung. Wenn er zu hoch ist, trennen sich die Schatten von den Werfern. Tweaken Sie es so, wie es am besten für Sie funktioniert.
zh_cn: **Bias：**\ （偏置）当此参数太小时，阴影会打在物体自己身上。当太大时，阴影会与物体本体分开。请调整到最适合你的状态。

source: **Normal Bias:** When this parameter is too low, self-shadowing occurs. When too high, shadows appear misaligned from the casters. Tweak to what works best for you.
de: **Normalen-Bias:** Wenn dieser Parameter zu niedrig ist, kommt es zur Selbstabschattung. Wenn er zu hoch ist, erscheinen die Schatten von den Schattenwerfern falsch ausgerichtet. Tweaken Sie es so, wie es am besten für Sie funktioniert.
zh_cn: **Normal Bias：**\ 当此参数太小时，阴影会打在物体自己身上。当太大时，阴影会与物体本体分开。请调整到最适合你的状态。

source: **Transmittance Bias:** When this parameter is too low, self-shadowing occurs on materials that have transmittance enabled. When too high, shadows will not affect materials that have transmittance enabled consistently. Tweak to what works best for you.
de: **Transmittance-Bias:** Wenn dieser Parameter zu niedrig ist, tritt bei Materialien mit aktivierter Transmittance eine Selbstabschattung auf. Wenn er zu hoch ist, wirken sich Schatten nicht auf Materialien aus, bei denen die Transmittance durchgängig aktiviert ist. Tweaken Sie es so, wie es am besten für Sie funktioniert.
zh_cn: **Transmittance Bias：**\ （透射率偏置）当此参数太低时，启用透射率的材质上，阴影会打在物体自己身上。如果太高，阴影将不会影响始终启用透射率的材质。请调整到最适合你的状态。

source: **Reverse Cull Face:** Some scenes work better when shadow mapping is rendered with face-culling inverted.
de: **Face-Culling umkehren:** Einige Szenen funktionieren besser, wenn das Schatten-Mapping mit umgekehrtem Face-Culling gerendert wird.
zh_cn: **Reverse Cull Face：**\ 反转表面剔除，当阴影贴图使用反转表面剔除渲染时，在某些场景表现更好。

source: **Blur:** Multiplies the shadow blur radius for this light. This works with both traditional shadow mapping and contact-hardening shadows (lights with **Angular Distance** or **Size** greater than ``0.0``). Higher values result in softer shadows, which will also appear to be more temporally stable for moving objects. The downside of increasing shadow blur is that it will make the grainy pattern used for filtering more noticeable. See also :ref:`doc_lights_and_shadows_shadow_filter_mode`.
de: **Blur:** Multipliziert den Radius des Schatten-Blurs für dieses Licht. Dies funktioniert sowohl mit traditionellem Shadow-Mapping als auch mit kontakthärtenden Schatten (Lichter mit **Winkeldistanz** oder **Größe** größer als ``0.0``). Höhere Werte resultieren in weicheren Schatten, die auch bei sich bewegenden Objekten zeitlich stabiler zu sein scheinen. Der Nachteil einer Erhöhung der Schattenunschärfe ist, dass das körnige Muster, das für die Filterung verwendet wird, stärker auffällt. Siehe auch :ref:`doc_lights_and_shadows_shadow_filter_mode`.
zh_cn: **Blur：** （模糊）倍增此灯光的阴影模糊半径。它适用于传统阴影贴图和接触硬化阴影（ **Angular Distance** 或 **Size** 大于 ``0.0`` 的灯光）。数值越大，阴影越柔和，对于移动的物体来说，在时间上也会显得更加稳定。增加阴影模糊的缺点是，它会使用于滤波的颗粒图案更加明显。另请参阅 :ref:`doc_lights_and_shadows_shadow_filter_mode`。

source: Tweaking shadow bias
de: Optimieren des Schatten-Bias
zh_cn: 调整阴影偏置

source: Below is an image of what tweaking bias looks like. Default values work for most cases, but in general, it depends on the size and complexity of geometry.
de: Unten sehen Sie ein Bild, das zeigt, wie die Anpassung des Bias aussieht. Die Default-Werte funktionieren in den meisten Fällen, aber im Allgemeinen hängt es von der Größe und Komplexität der Geometrie ab.
zh_cn: 下图是调整偏置的图像。默认值适用于大多数情况，但通常来说，它取决于几何的大小和复杂程度。

source: If the **Shadow Bias** or **Shadow Normal Bias** is set too low for a given light, the shadow will be "smeared" onto the objects. This will cause the light's intended appearance to darken, and is called *shadow acne*:
de: Wenn der **Schattenbias** oder **Schattennormalen-Bias** für ein bestimmtes Licht zu niedrig eingestellt ist, wird der Schatten auf die Objekte "verschmiert". Dies führt dazu, dass das beabsichtigte Aussehen des Lichts verdunkelt wird, und wird als *Schattenakne* bezeichnet:
zh_cn: 如果给定灯光的 **Shadow Bias** 或 **Shadow Normal Bias** 设置得太低，阴影就会 "涂抹 "到物体上。这将导致光线的预期外观变暗，称为 *阴影失真* （shadow acne）：

source: On the other hand, if the **Shadow Bias** or **Shadow Normal Bias** is set too high for a given light, the shadow may appear to be disconnected from the object. This is called *peter-panning*:
de: Ist dagegen der **Schatten-Bias** oder **Schatten-Normalen-Bias** für ein bestimmtes Licht zu hoch eingestellt, kann der Schatten vom Objekt abgekoppelt erscheinen. Dies wird als *Peter-Panning* bezeichnet:
zh_cn: 另一方面，如果给定光线的 **Shadow Bias** 或 **Shadow Normal Bias** 设置得太高，阴影可能看起来与物体脱节。这被称为 *阴影悬浮* （peter-panning）：

source: In general, increasing **Shadow Normal Bias** is preferred over increasing **Shadow Bias**. Increasing **Shadow Normal Bias** does not cause as much peter-panning as increasing **Shadow Bias**, but it can still resolve most shadow acne issues efficiently. The downside of increasing **Shadow Normal Bias** is that it can make shadows appear thinner for certain objects.
de: Im Allgemeinen ist eine Erhöhung des **Schatten-Normalen-Bias** einer Erhöhung des **Schatten-Bias** vorzuziehen. Die Erhöhung von **Schatten-Normalen-Bias** verursacht nicht so viel Peter-Panning wie die Erhöhung von **Schatten-Bias**, kann aber immer noch die meisten Probleme mit Schattenakne effizient lösen. Der Nachteil einer Erhöhung des **Schatten-Normalen-Bias** ist, dass der Schatten bei bestimmten Objekten dünner erscheinen kann.
zh_cn: 一般来说，增加 **Shadow Normal Bias** 比增加 **Shadow Bias** 更可取。增大 **Shadow Normal Bias** 不会像增大 **Shadow Bias** 那样导致更多的阴影悬浮，但仍能有效解决大多数阴影失真问题。增加 **Shadow Normal Bias** 的缺点是会使某些物体的阴影看起来更薄。

source: Any sort of bias issues can be fixed by :ref:`increasing the shadow map resolution <doc_lights_and_shadows_balancing_performance_and_quality>`, at the cost of decreased performance.
de: Jede Art von Verzerrungsproblemen kann durch :ref:`Erhöhung der Auflösung der Shadow-Map <doc_lights_and_shadows_balancing_performance_and_quality>` behoben werden, allerdings auf Kosten einer geringeren Performance.
zh_cn: 任何偏置问题都可以通过 :ref:`提高阴影贴图分辨率 <doc_lights_and_shadows_balancing_performance_and_quality>` 来解决，尽管这可能会导致性能下降。

source: Tweaking shadow mapping settings is an art – there are no "one size fits all" settings. To achieve the best visuals, you may need to use different shadow bias values on a per-light basis.
de: Das Optimieren der Shadow-Mapping-Einstellungen ist eine Kunst - es gibt keine perfekten Einstellungen für alle Anwendungsfälle. Um ein optimales Ergebnis zu erzielen, müssen Sie möglicherweise für jedes einzelne Licht unterschiedliche Werte für den Schatten-Bias verwenden.
zh_cn: 调整阴影贴图设置是一门艺术，没有 "放之四海而皆准"的设置。为了获得最佳的视觉效果，你可能需要针对每个灯光使用不同的阴影偏置值。

source: Directional light
de: Gerichtetes Licht
zh_cn: 平行光

source: This is the most common type of light and represents a light source very far away (such as the sun). It is also the cheapest light to compute and should be used whenever possible (although it's not the cheapest shadow-map to compute, but more on that later).
de: Dies ist die häufigste Art von Licht und stellt eine sehr weit entfernte Lichtquelle dar (z. B. die Sonne). Es ist auch das am günstigsten zu berechnende Licht und sollte wann immer möglich verwendet werden (obwohl es nicht die am günstigsten zu berechnende Schatten hat, aber dazu später mehr).
zh_cn: 这是最常见的光线类型, 代表了很远的光源(如太阳). 它也是计算中最便宜的光, 应该尽可能使用(虽然它不是计算起来最便宜的阴影贴图, 但这点稍后再说).

source: Directional light models an infinite number of parallel light rays covering the whole scene. The directional light node is represented by a big arrow which indicates the direction of the light rays. However, the position of the node does not affect the lighting at all and can be anywhere.
de: Gerichtetes Licht modelliert eine unendliche Anzahl von parallelen Lichtstrahlen, von denen die gesamte Szene abgedeckt wird. Der Node für gerichtetes Licht wird durch einen großen Pfeil dargestellt, der die Richtung der Lichtstrahlen angibt. Die Position des Nodes hat jedoch keinerlei Einfluss auf die Beleuchtung und kann beliebig sein.
zh_cn: 平行光模拟覆盖整个场景的无限数量的平行光线。平行光节点由指示光线方向的大箭头表示。但是，节点的位置根本不会影响照明，它可以在任何地方。
