Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/mesh_lod.po
Languages: de, zh_cn, zh_tw

source: Mesh level of detail (LOD)
zh_cn: 网格的细节级别（LOD）
zh_tw: 網格的細節級別（LOD）

source: Level of detail (LOD) is one of the most important ways to optimize rendering performance in a 3D project, along with :ref:`doc_occlusion_culling`.
de: Level of Detail (LOD) ist neben :ref:`doc_occlusion_culling` eine der wichtigsten Methoden zur Optimierung der Render-Performance in einem 3D-Projekt.
zh_cn: 与 :ref:`doc_occlusion_culling` 一样，细节级别（LOD）是优化 3D 项目渲染性能的最重要方法之一。
zh_tw: 與 :ref:`doc_occlusion_culling` 一樣，細節級別（LOD）是優化 3D 專案算繪性能的最重要方法之一。

source: On this page, you'll learn:
de: Auf dieser Seite erfahren Sie:
zh_cn: 你会在这个页面中学习到：
zh_tw: 在本指南中，我們將學到：

source: How mesh LOD can improve your 3D project's rendering performance.
de: Wie Mesh-LOD die Performance Ihres 3D-Projekts verbessern kann.
zh_cn: 网格 LOD 如何提高 3D 项目的渲染性能。
zh_tw: 網格 LOD 如何提高 3D 專案的算繪性能。

source: How to set up mesh LOD in Godot.
de: Wie man Mesh-LOD in Godot einrichtet.
zh_cn: 如何在 Godot 中设置网格 LOD。
zh_tw: 如何在 Godot 中設定網格 LOD。

source: How to measure mesh LOD's effectiveness in your project (and alternatives you can explore if it doesn't meet your expectations).
de: Wie Sie die Effektivität von Mesh LOD in Ihrem Projekt messen können (und welche Alternativen Sie prüfen können, wenn es Ihre Erwartungen nicht erfüllt).
zh_cn: 如何衡量网格 LOD 在项目中的效果（如果达不到预期效果，还可以探索其他方法）。
zh_tw: 如何衡量網格 LOD 在專案中的效果（如果達不到預期效果，還可以探索其他方法）。

source: You can see how mesh LOD works in action using the `Occlusion Culling and Mesh LOD demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.
de: Wie Mesh-LOD in Aktion funktioniert, können Sie mit dem `Occlusion Culling and Mesh LOD Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__ sehen.
zh_cn: 你可以通过\ `遮挡剔除与网格 LOD 演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__\ 观察到网格 LOD 的工作原理。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: Historically, level of detail in 3D games involved manually authoring meshes with lower geometry density, then configuring the distance thresholds at which these lower-detailed meshes should be drawn. This approach is still used today when increased control is needed.
de: In der Vergangenheit wurden in 3D-Spielen Meshes mit geringerer Geometriedichte manuell erstellt und dann die Abstandsschwellen konfiguriert, bei denen diese Meshes mit geringerer Detailtiefe gezeichnet werden sollten. Dieser Ansatz wird auch heute noch verwendet, wenn eine bessere Kontrolle erforderlich ist.
zh_cn: 从历史上看，3D 游戏中的细节层次包括手动绘制几何密度较低的网格，然后配置距离阈值，在距离阈值上绘制这些细节较低的网格。如今，当需要加强控制时，这种方法仍在使用。
zh_tw: 從歷史上看，3D 遊戲中的細節層次包括手動繪製幾何密度較低的網格，然後配置距離閾值，在距離閾值上繪製這些細節較低的網格。如今，當需要加強控制時，這種方法仍在使用。

source: However, in projects that have a large amount of detailed 3D assets, setting up LOD manually can be a very time-consuming process. As a result, automatic mesh decimation and LOD configuration is becoming increasingly popular.
de: Bei Projekten mit einer großen Anzahl detaillierter 3D-Assets kann das manuelle Einrichten von LOD jedoch sehr zeitaufwändig sein. Daher wird die automatische Mesh-Dezimierung und LOD-Konfiguration immer beliebter.
zh_cn: 然而，在拥有大量详细 3D 资产的项目中，手动设置 LOD 可能是一个非常耗时的过程。因此，自动网格细分和 LOD 配置越来越受欢迎。
zh_tw: 然而，在擁有大量詳細 3D 素材的專案中，手動設定 LOD 可能是一個非常耗時的過程。因此，自動網格細分和 LOD 配置越來越受歡迎。

source: Godot provides a way to automatically generate less detailed meshes for LOD usage on import, then use those LOD meshes when needed automatically. This is completely transparent to the user. The `meshoptimizer <https://meshoptimizer.org/>`__ library is used for LOD mesh generation behind the scenes.
de: Godot bietet eine Möglichkeit, beim Import automatisch weniger detaillierte Meshes für die LOD-Nutzung zu erzeugen und diese LOD-Meshes dann bei Bedarf automatisch zu verwenden. Dies ist für den Benutzer völlig transparent. Die Bibliothek `meshoptimizer <https://meshoptimizer.org/>`__ wird für die LOD-Mesh-Generierung hinter den Kulissen verwendet.
zh_cn: Godot 提供了一种方法，可以在导入时自动生成细节较少的网格供 LOD 使用，然后在需要时自动使用这些 LOD 网格。这对用户完全透明。`meshoptimizer <https://meshoptimizer.org/>`__ 库用于幕后的 LOD 网格生成。
zh_tw: Godot 提供了一種方法，可以在匯入時自動生成細節較少的網格供 LOD 使用，然後在需要時自動使用這些 LOD 網格。這對使用者完全透明。`meshoptimizer <https://meshoptimizer.org/>`__ 庫用於幕後的 LOD 網格生成。

source: Mesh LOD works with any node that draws 3D meshes. This includes MeshInstance3D, MultiMeshInstance3D, GPUParticles3D and CPUParticles3D.
de: Mesh-LOD funktioniert mit jedem Node, der 3D Meshes zeichnet. Dazu gehören MeshInstance3D, MultiMeshInstance3D, GPUParticles3D und CPUParticles3D.
zh_cn: 网格 LOD 适用于任何绘制 3D 网格的节点。这包括 MeshInstance3D、MultiMeshInstance3D、GPUParticles3D 和 CPUParticles3D。
zh_tw: 網格 LOD 適用於任何繪製 3D 網格的節點。這包括 MeshInstance3D、MultiMeshInstance3D、GPUParticles3D 和 CPUParticles3D。

source: Visual comparison
de: Visueller Vergleich
zh_cn: 视觉比较
zh_tw: 視覺比較

source: Here is an example of LOD meshes generated on import. Lower detailed meshes will be used when the camera is far away from the object:
de: Hier ist ein Beispiel für LOD-Meshes, die beim Import erzeugt werden. Weniger detaillierte Meshes werden verwendet, wenn die Kamera weit vom Objekt entfernt ist:
zh_cn: 以下是导入时生成 LOD 网格的示例。当摄像机远离物体时，将使用细节较少的网格：
zh_tw: 以下是匯入時生成 LOD 網格的範例。當相機遠離物體時，將使用細節較少的網格：

source: From most detailed (left) to least detailed (right), shaded view
de: Von der detailliertesten (links) zur am wenigsten detaillierten (rechts), schattierte Ansicht
zh_cn: 从最详细（左）到最不详细（右），阴影视图
zh_tw: 從最詳細（左）到最不詳細（右），陰影視圖

source: Here's the same image with wireframe rendering to make the decimation easier to see:
de: Hier ist das gleiche Bild mit Drahtgitter-Rendering, um die Dezimierung besser zu erkennen:
zh_cn: 这是使用线框渲染的同一张图像，以使细分更容易被看到：
zh_tw: 這是使用線框算繪的同一張圖像，以使抽取更容易看到：

source: From most detailed (left) to least detailed (right), wireframe view
de: Vom detailliertesten (links) zum am wenigsten detaillierten (rechts), Drahtgitteransicht
zh_cn: 从最详细（左）到最不详细（右），线框视图
zh_tw: 從最詳細（左）到最不詳細（右），線框視圖

source: If you need to manually configure level of detail with artist-created meshes, use :ref:`doc_visibility_ranges` instead of automatic mesh LOD.
de: Wenn Sie den Detaillierungsgrad bei von Künstlern erstellten Meshes manuell konfigurieren müssen, verwenden Sie :ref:`doc_visibility_ranges` anstelle des automatischen Mesh-LOD.
zh_cn: 如果你需要使用艺术家创建的网格手动配置细节层次，请使用 :ref:`doc_visibility_ranges` 而不是自动网格 LOD。
zh_tw: 如果您需要使用藝術家建立的網格手動配置細節級別，請使用 doc_visibility_ranges 而不是自動網格 LOD。

source: Generating mesh LOD
de: Erzeugen von Mesh-LOD
zh_cn: 生成网格 LOD
zh_tw: 建立內容

source: By default, mesh LOD generation happens automatically for imported 3D scenes (glTF, .blend, Collada, FBX). Once LOD meshes are generated, they will automatically be used when rendering the scene. You don't need to configure anything manually.
de: Standardmäßig wird das Mesh-LOD automatisch für importierte 3D-Szenen (glTF, .blend, Collada, FBX) erzeugt. Sobald LOD-Meshes generiert sind, werden sie automatisch beim Rendern der Szene verwendet. Sie müssen nichts manuell konfigurieren.
zh_cn: 默认情况下，导入的 3D 场景（glTF、.blend、Collada、FBX）会自动生成网格 LOD。生成 LOD 网格后，将在渲染场景时自动使用它们。你无需手动配置任何内容。
zh_tw: 預設情況下，匯入的 3D 場景（glTF、.blend、Collada、FBX）會自動產生網格 LOD。 LOD 網格產生後，算繪場景時將自動使用它們。您無需手動配置任何內容。

source: However, mesh LOD generation does **not** automatically happen for imported 3D meshes (OBJ). This is because OBJ files are not imported as full 3D scenes by default, but only as individual mesh resources to load into a MeshInstance3D node (or GPUParticles3D, CPUParticles3D, ...).
de: Die Erzeugung von Mesh-LODs erfolgt jedoch **nicht** automatisch für importierte 3D-Meshes (OBJ). Das liegt daran, dass OBJ-Dateien standardmäßig nicht als vollständige 3D-Szenen importiert werden, sondern nur als einzelne Mesh-Ressourcen, die in einen MeshInstance3D-Node (oder GPUParticles3D, CPUParticles3D, ...) geladen werden.
zh_cn: 然而，对于导入的 3D 网格（OBJ），网格LOD生成 **不会** 自动启动。这是因为 OBJ 文件默认情况下不作为完整的 3D 场景导入，而仅作为单独的网格资源加载到MeshInstance3D 节点（或 GPUParticle3D，CPUParticles3D...）。
zh_tw: 但是，對於匯入的 3D 網格 (OBJ)，網格 LOD 產生**不會**自動發生。這是因為預設情況下，OBJ 檔案不會作為完整的 3D 場景匯入，而僅作為單獨的網格資源載入到 MeshInstance3D 節點（或 GPUParticles3D、CPUParticles3D...）中。

source: To make an OBJ file have mesh LOD generated for it, select it in the FileSystem dock, go to the Import dock, change its **Import As** option to **Scene** then click **Reimport**:
de: Um für eine OBJ-Datei ein Mesh-LOD zu generieren, wählen Sie sie im Dateisystem-Dock aus, gehen Sie zum Import-Dock, ändern Sie die Option **Importieren als** in **Szene** und klicken Sie dann auf **Neuimport**:
zh_cn: 为了使OBJ文件具有为其生成的网格LOD，在文件系统面板中选择它，去到导入面板，将其 **导入为** 选项更改为 **场景** ，然后单击 **重新导入** ：
zh_tw: 若要使OBJ 檔案為其產生網格LOD，請在檔案系統擴充座中選擇它，請前往匯入擴充塢，將其**匯入為** 選項變更為**場景**，然後按一下**重新匯入**：

source: Changing the import type on an OBJ file in the Import dock
de: Ändern des Importtyps für eine OBJ-Datei im Importdock
zh_cn: 更改导入面板中 OBJ 文件的导入类型
zh_tw: 在匯入塢中變更 OBJ 檔案的匯入型別

source: This will require restarting the editor after clicking **Reimport**.
de: Dies erfordert einen Neustart des Editors, nachdem Sie auf **Neuimport** geklickt haben.
zh_cn: 这需要在单击 **重新导入** 后重新启动编辑器。
zh_tw: 這將需要在單擊“**重新匯入**”後重新啟動編輯器。

source: The mesh LOD generation process is not perfect, and may occasionally introduce rendering issues (especially in skinned meshes). Mesh LOD generation can also take a while on complex meshes.
de: Der Prozess der Mesh-LOD-Generierung ist nicht perfekt und kann gelegentlich zu Rendering-Problemen führen (insbesondere bei Skinned Meshes). Die Mesh-LOD-Generierung kann bei komplexen Meshes auch eine Weile dauern.
zh_cn: 网格 LOD 生成过程并不完美，偶尔可能会出现渲染问题（尤其是在蒙皮网格中）。在复杂网格上生成网格 LOD 也可能需要一段时间。
zh_tw: 網格 LOD 生成過程並不完美，有時可能會引入算繪問題（尤其是在蒙皮網格中）。在複雜的網格上，網格 LOD 產生也可能需要一段時間。

source: If mesh LOD causes a specific mesh to look broken, you can disable LOD generation for it in the Import dock. This will also speed up resource importing. This can be done globally in the 3D scene's import options, or on a per-mesh basis using the Advanced Import Settings dialog.
de: Wenn Mesh-LOD ein bestimmtes Mesh fehlerhaft aussehen lässt, können Sie die LOD-Generierung für dieses Mesh im Import-Dock deaktivieren. Dadurch wird auch der Import von Ressourcen beschleunigt. Dies kann global in den Importoptionen der 3D-Szene oder auf Mesh-Basis über den Dialog Erweiterte Importeinstellungen erfolgen.
zh_cn: 如果网格 LOD 导致特定网格看起来已被损坏，则可以在导入面板中禁用该网格的 LOD 生成。这也将加快资源导入的速度。这可以在 3D 场景的导入选项中全局执行，也可以使用“高级导入设置”对话框在逐个网格完成。
zh_tw: 如果網格 LOD 導致特定網格看起來損壞，您可以在匯入塢中停用它的 LOD 產生。這也將加快資源匯入速度。這可以在 3D 場景的匯入選項中全域完成，也可以使用「進階匯入設定」對話方塊在每個網格上完成。

source: See :ref:`Importing 3D scenes <doc_importing_3d_scenes_using_the_import_dock>` for more information.
de: Siehe :ref:`Importieren von 3D-Szenen <doc_importing_3d_scenes_using_the_import_dock>` für weitere Informationen.
zh_cn: 详见\ :ref:`导入 3D 场景 <doc_importing_3d_scenes_using_the_import_dock>`\ 。
zh_tw: 請參考 :ref:`doc_running_code_in_the_editor` 以瞭解詳情。

source: Comparing mesh LOD visuals and performance
de: Vergleich von Mesh LOD-Darstellung und Performance
zh_cn: 比较网格 LOD 视觉效果和性能
zh_tw: 比較網格 LOD 視覺效果和性能

source: To disable mesh LOD in the editor for comparison purposes, use the **Disable Mesh LOD** advanced debug draw mode. This can be done using the menu in the top-left corner of the 3D viewport (labeled **Perspective** or **Orthogonal** depending on camera mode):
de: Um Mesh LOD im Editor zu Vergleichszwecken zu deaktivieren, verwenden Sie den erweiterten Debug-Zeichenmodus **Mesh-LOD deaktivieren**. Dies kann über das Menü in der oberen linken Ecke des 3D-Ansichtsfensters erfolgen (je nach Kameramodus mit **Perspektive** oder **Orthogonal** bezeichnet):
zh_cn: 要在编辑器中禁用网格 LOD 以进行比较，请使用 **禁用网格 LOD** 高级调试绘制模式。这可以使用 3D 视口左上角的菜单来完成（标记为 **透视** 或 **正交** ，具体取决于相机模式）：
zh_tw: 若要在編輯器中停用網格 LOD 以進行比較，請使用 **停用網格 LOD** 進階偵錯繪製模式。這可以使用 3D 視窗左上角的選單來完成（標記為 **透視** 或 **正交**，取決於相機模式）：

source: Disabling mesh LOD in the 3D viewport's top-left menu
de: Deaktivieren von Mesh-LOD im linken oberen Menü des 3D-Viewports
zh_cn: 在 3D 视口左上角的菜单中禁用网格 LOD
zh_tw: 在 3D 視口左上角的選單中禁用網格 LOD

source: Enable **View Frame Time** in the same menu to view FPS in the top-right corner. Also enable **View Information** in the same menu to view the number of primitives (vertices + indices) rendered in the bottom-right corner.
de: Aktivieren Sie **Frame-Zeit anzeigen** im gleichen Menü, um die FPS in der oberen rechten Ecke anzuzeigen. Aktivieren Sie außerdem **Informationen anzeigen** im selben Menü, um die Anzahl der gerenderten Primitive (Vertices+ Indizes) in der unteren rechten Ecke anzuzeigen.
zh_cn: 在同一菜单中启用 **查看帧时间** 以查看右上角的 FPS。同时在同一菜单中启用 **查看信息** ，以查看右下角渲染的图元（顶点+索引）的数量。
zh_tw: 在同一選單中啟用**查看影格時間**可在右上角查看 FPS。也可以在同一選單中啟用**查看資訊**，以查看右下角算繪的像素（頂點+索引）的數量。

source: If mesh LOD is working correctly in your scene and your camera is far away enough from the mesh, you should notice the number of drawn primitives decreasing and FPS increasing when mesh LOD is left enabled (unless you are CPU-bottlenecked).
de: Wenn Mesh-LOD in Ihrer Szene korrekt funktioniert und Ihre Kamera weit genug vom Mesh entfernt ist, sollten Sie feststellen, dass die Anzahl der gezeichneten Primitive sinkt und die FPS steigen, wenn Mesh-LOD aktiviert bleibt (es sei denn, Sie haben einen CPU-Bottleneck).
zh_cn: 如果网格 LOD 在场景中正常工作，并且摄影机离网格足够远时，你应注意到，当网格 LOD 处于启用状态时，绘制的图元数量会减少，而 FPS 会增加（除非遭遇 CPU 瓶颈）。
zh_tw: 如果網格LOD 在您的場景中正常工作，並且您的相機距離網格足夠遠，您應該會注意到，當網格LOD 保持啟用狀態時，繪製的像素數量會減少，而FPS 會增加（除非您遇到CPU 瓶頸）。

source: To see mesh LOD decimation in action, change the debug draw mode to **Display Wireframe** in the menu specified above, then adjust the **Rendering > Mesh LOD > LOD Change > Threshold Pixels** project setting.
de: Um die Mesh-LOD-Dezimierung in Aktion zu sehen, ändern Sie den Debug-Zeichenmodus im oben angegebenen Menü auf **Drahtgitter anzeigen** und passen Sie dann die Projekteinstellung **Rendern > Mesh-LOD > LOD-Änderung > Schwellenpixel** an.
zh_cn: 若要查看网格 LOD 抽取的操作，请在上面指定的菜单中将调试绘制模式更改为 **显示线框** ，然后调整 **渲染 > 网格 LOD > LOD 更改 > 阈值像素** 项目设置。
zh_tw: 若要查看網格LOD 抽取的實際效果，請在上面指定的選單中將偵錯繪製模式變更為**顯示線框**，然後調整**算繪> 網格LOD > LOD 變更> 閾值像素** 專案設定。

source: Configuring mesh LOD performance and quality
de: Konfigurieren der Performance und Qualität von Mesh-LOD
zh_cn: 配置网格 LOD 性能和质量
zh_tw: 配置網格 LOD 性能和質量

source: You can adjust how aggressive mesh LOD transitions should be in the root viewport by changing the **Rendering > Mesh LOD > LOD Change > Threshold Pixels** project setting. To change this value at run-time, set ``mesh_lod_threshold`` on the root viewport as follows:
de: Sie können einstellen, wie aggressiv Mesh-LOD-Übergänge im Root-Viewport sein sollen, indem Sie die Projekteinstellung **Rendern > Mesh-LOD > LOD-Änderung > Schwellen-Pixel** ändern. Um diesen Wert zur Laufzeit zu ändern, setzen Sie ``mesh_lod_threshold`` im Root-Viewport wie folgt:
zh_cn: 你可以通过更改 **渲染 > 网格 LOD > LOD 更改 > 阈值像素** 项目设置来调整根视口中网格 LOD 转换的变化程度。要在运行时更改此值，请在根视口上设置 ``Mesh_LOD_Threshold``\ ，如下所示：
zh_tw: 您可以透過變更 **算繪 > 網格 LOD > LOD 變更 > 閾值像素** 專案設定來調整根視窗中網格 LOD 過渡的激程序度。若要在執行時變更此值，請在根視窗上設定``mesh_lod_threshold``，如下所示：

source: Each viewport has its own ``mesh_lod_threshold`` property, which can be set independently from other viewports.
de: Jedes Ansichtsfenster hat seine eigene ``mesh_lod_threshold``-Property, die unabhängig von anderen Viewports eingestellt werden kann.
zh_cn: 每个视口都有自己的 ``mesh_lod_threshold`` 属性，可以独立于其他视口进行设置。
zh_tw: 每個視窗都有自己的「mesh_lod_threshold」屬性，可以獨立於其他視窗進行設定。

source: The default mesh LOD threshold of 1 pixel is tuned to look *perceptually* lossless; it provides a significant performance gain with an unnoticeable loss in quality. Higher values will make LOD transitions happen sooner when the camera moves away, resulting in higher performance but lower quality.
de: Der Default-Mesh-LOD-Schwellenwert von 1 Pixel ist so eingestellt, dass er *wahrnehmbar* verlustfrei ist; er bietet einen erheblichen Performance-Gewinn bei einem nicht wahrnehmbaren Qualitätsverlust. Höhere Werte führen dazu, dass die LOD-Übergänge früher stattfinden, wenn sich die Kamera entfernt, was zu höherer Performance, aber geringerer Qualität führt.
zh_cn: 默认网格 LOD 阈值 1 像素经过调整，看起来 *感知上* 无损；它提供了显着的性能提升，但质量却有不明显的损失。 当相机移开时，较高的值将使 LOD 过渡更快发生，从而导致更高的性能但质量较低。
zh_tw: 預設網格 LOD 閾值 1 像素經過調整，看起來「感知上」無損；它提供了顯著的性能提升，但品質卻有不明顯的損失。當相機移開時，較高的值將使 LOD 過渡更快發生，從而導致更高的性能但品質較低。

source: If you need to perform per-object adjustments to mesh LOD, you can adjust how aggressive LOD transitions should be by adjusting the **LOD Bias** property on any node that inherits from GeometryInstance3D. Values *above* ``1.0`` will make LOD transitions happen later than usual (resulting in higher quality but lower performance). Values *below* ``1.0`` will make LOD transitions happen sooner than usual (resulting in lower quality but higher performance).
de: Wenn Sie objektspezifische Anpassungen am Mesh-LOD vornehmen müssen, können Sie einstellen, wie aggressiv die LOD-Übergänge sein sollen, indem Sie die **LOD-Bias**-Property auf jedem Node, der von GeometryInstance3D erbt, anpassen. Werte *über* ``1.0`` bewirken, dass LOD-Übergänge später als üblich stattfinden (was zu höherer Qualität, aber geringerer Performance führt). Werte *unter* ``1.0`` bewirken, dass LOD-Übergänge früher als üblich stattfinden (was zu geringerer Qualität, aber höherer Performance führt).
zh_cn: 如果需要对网格 LOD 执行逐对象调整，则可以通过调整从 GeometryInstance3D 继承的任何节点上的 **LOD Bias** 属性来调整 LOD 过渡的激进程度。\ *高于* ``1.0`` 的值将使 LOD 转换发生得比通常晚（导致更高质量但更低的性能）。\ *低于* ``1.0`` 的值将使 LOD 转换比通常更快发生（导致更低的质量但更高的性能）。
zh_tw: 如果需要對網格 LOD 執行每個物件的調整，則可以透過調整繼承自 GeometryInstance3D 的任何節點上的 **LOD Bias** 屬性來調整 LOD 過渡的激程序度。 *高於*``1.0`` 的值將使 LOD 轉換比平常晚發生（導致品質更高但性能更低）。 *低於*``1.0`` 的值將使 LOD 轉換比平常更快發生（導致品質較低但效能較高）。

source: Additionally, ReflectionProbe nodes have their own **Mesh LOD Threshold** property that can be adjusted to improve rendering performance when the reflection probe updates. This is especially important for ReflectionProbes that use the **Always** update mode.
de: Darüber hinaus verfügen ReflectionProbe-Nodes über eine eigene **Mesh-LOD-Schwellenwert**-Property, die angepasst werden kann, um die Rendering-Performance zu verbessern, wenn die ReflectionProbe aktualisiert wird. Dies ist besonders wichtig für ReflectionProbes, die den Aktualisierungsmodus **Immer** verwenden.
zh_cn: 此外，ReflectionProbe 节点具有自己的 **Mesh LOD Threshold** 属性，当反射探针更新时，可以调整该属性以提高渲染性能。这对于使用 **Always** 更新模式的 ReflectionProbe 尤为重要。
zh_tw: 此外，ReflectionProbe 節點具有自己的 **網格 LOD 閾值** 屬性，可在反射探查更新時對其進行調整以提高算繪效能。這對於使用 **Always** 更新模式的 ReflectionProbes 尤其重要。

source: When rendering the scene, mesh LOD selection uses a screen-space metric. This means it automatically takes camera field of view and viewport resolution into account. Higher camera FOV and lower viewport resolutions will make LOD selection more aggressive; the engine will display heavily decimated models earlier when the camera moves away.
de: Beim Rendern der Szene verwendet die Mesh-LOD-Auswahl eine Screen-Space-Metrik. Das bedeutet, dass automatisch das Sichtfeld der Kamera und die Auflösung des Viewports berücksichtigt werden. Ein höheres Kamera-Sichtfeld und eine geringere Viewport-Auflösung machen die LOD-Auswahl aggressiver; die Engine zeigt stark dezimierte Modelle früher an, wenn sich die Kamera entfernt.
zh_cn: 渲染场景时，网格 LOD 会选择使用屏幕空间标尺。这意味着它会自动考虑相机视野和视口分辨率。更高的摄像机 FOV 和更低的视口分辨率将使 LOD 选择更加激进；当相机移开时，引擎将更早地显示严重破坏的模型。
zh_tw: 算繪場景時，網格 LOD 選擇使用螢幕空間度量。這意味著它會自動考慮相機視野和視口解析度。較高的相機 FOV 和較低的視口解析度將使 LOD 選擇更加積極；當相機移開時，引擎將提前顯示嚴重破壞的模型。

source: As a result, unlike :ref:`doc_visibility_ranges`, you don't need to do anything specific in your project to take camera FOV and viewport resolution into account.
de: Im Gegensatz zu :ref:`doc_visibility_ranges` müssen Sie also nichts Spezielles in Ihrem Projekt tun, um die Sichtweite der Kamera und die Auflösung des Ansichtsfensters zu berücksichtigen.
zh_cn: 因此，与 :ref:`doc_visibility_ranges` 不同，你无需在项目中执行任何特定操作，即可考虑相机 FOV 和视口分辨率。
zh_tw: 因此，與 doc_visibility_ranges 不同，您無需在專案中執行任何特定操作即可考慮相機 FOV 和視窗解析度。

source: Using mesh LOD with MultiMesh and particles
de: Verwendung von Mesh-LOD mit MultiMesh und Partikeln
zh_cn: 将网格 LOD 与 MultiMesh 和粒子结合使用
zh_tw: 將網格 LOD 與 MultiMesh 和粒子結合使用

source: For LOD selection, the point of the node's :abbr:`AABB (Axis-Aligned Bounding Box)` that is the closest to the camera is used as a basis. This applies to any kind of mesh LOD (including for individual MeshInstance3D)s, but this has some implications for nodes that display multiple meshes at once, such as MultiMeshInstance3D, GPUParticles3D and GPUParticles3D. Most importantly, this means that all instances will be drawn with the same LOD level at a given time.
de: Für die LOD-Auswahl wird der Punkt der :abbr:`AABB (Axis-Aligned Bounding Box)` des am dichtesten an der Kamera befindlichen Nodes als Basis verwendet. Dies gilt für jede Art von Mesh LOD (auch für einzelne MeshInstance3D), aber dies hat einige Auswirkungen auf Nodes, die mehrere Meshes gleichzeitig anzeigen, wie MultiMeshInstance3D, GPUParticles3D und GPUParticles3D. Vor allem bedeutet dies, dass alle Instanzen zu einem bestimmten Zeitpunkt mit demselben LOD-Level gezeichnet werden.
zh_cn: 对于 LOD 选择，节点的 :abbr:`AABB (Axis-Aligned Bounding Box, 轴对齐边界框)` 最接近相机的点被用作基础。这适用于任何类型的网格 LOD（包括单个 MeshInstance3D），但对于同时显示多个网格的节点（例如 MultiMeshInstance3D、GPUParticles3D 和 GPUParticles3D）有一些影响。最重要的是，这意味着在给定时间所有实例都将使用相同的 LOD 级别进行绘制。
zh_tw: 對於 LOD 選擇，節點的 AABB（軸對齊邊界框）最接近相機的點用作基礎。這適用於任何型別的網格 LOD（包括單一 MeshInstance3D），但這對於同時顯示多個網格的節點（例如 MultiMeshInstance3D、GPUParticles3D 和 GPUParticles3D）有一些影響。最重要的是，這意味著在給定時間所有實例都將使用相同的 LOD 層級進行繪製。

source: If you are noticing incorrect LOD selection with GPUParticles3D, make sure the node's visibility AABB is configured by selecting the GPUParticles3D node and using **GPUParticles3D > Generate AABB** at the top of the 3D viewport.
de: Wenn Sie eine falsche LOD-Auswahl mit GPUParticles3D bemerken, stellen Sie sicher, dass die AABB-Sichtbarkeit des Nodes konfiguriert ist, indem Sie den GPUParticles3D-Node auswählen und **GPUParticles3D > AABB generieren** oben im 3D-Ansichtsfenster verwenden.
zh_cn: 如果你发现 GPUParticles3D 的 LOD 选择不正确，请确保通过选择 GPUParticles3D 节点并使用 3D 视口顶部的 **GPUParticles3D > 生成 AABB** 来配置节点的可见性 AABB。
zh_tw: 如果您發現 GPUParticles3D 的 LOD 選擇不正確，請確保透過選擇 GPUParticles3D 節點並使用 3D 視窗頂部的 **GPUParticles3D > 產生 AABB** 來配置節點的可見性 AABB。

source: If you have instances in a MultiMesh that are far away from each other, they should be placed in a separate MultiMeshInstance3D node. Doing so will also improve rendering performance, as frustum and occlusion culling will be able to cull individual nodes (while they can't cull individual instances in a MultiMesh).
de: Wenn Sie Instanzen in einem MultiMesh haben, die weit voneinander entfernt sind, sollten sie in einem separaten MultiMeshInstance3D-Node platziert werden. Dadurch wird auch die Performance des Renderings verbessert, da Frustum und Occlusion Culling einzelne Nodes ausblenden können (während sie einzelne Instanzen in einem MultiMesh nicht ausblenden können).
zh_cn: 如果 MultiMesh 中的实例彼此距离较远，则应将它们放置在单独的 MultiMeshInstance3D 节点中。这样做还可以提高渲染性能，因为视锥体和遮挡剔除将能够剔除单个节点（尽管它们无法剔除 MultiMesh 中的单个实例）。
zh_tw: 如果 MultiMesh 中的執行個體彼此距離較遠，則應將它們放置在單獨的 MultiMeshInstance3D 節點中。這樣做還將提高算繪效能，因為視錐體和遮蔽剔除將能夠剔除單一節點（儘管它們無法剔除 MultiMesh 中的單一實例）。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
