Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/occlusion_culling.po
Languages: de, zh_cn, zh_tw

source: Toggling occlusion culling at run-time is useful to compare performance on a running project.
de: Das Umschalten des Occlusion Culling während der Laufzeit ist nützlich, um die Performance eines laufenden Projekts zu vergleichen.
zh_cn: 在运行时切换遮挡剔除，对于比较正在运行的项目的性能很相当有用。
zh_tw: 在運作時切換遮擋剔除對於比較正在運作的專案的效能很有用。

source: Performance considerations
de: Überlegungen zur Performance
zh_cn: 性能方面的考虑
zh_tw: 效能

source: Design your levels to take advantage of occlusion culling
de: Gestalten Sie Ihre Level so, dass Sie Occlusion Culling nutzen können
zh_cn: 在构建关卡时考虑遮挡
zh_tw: 在建構關卡時考慮遮擋

source: **This is the most important guideline.** A good level design is not just about what the gameplay demands; it should also be built with occlusion in mind.
de: **Dies ist die wichtigste Richtlinie** Bei einem guten Leveldesign geht es nicht nur darum, was das Gameplay erfordert, sondern es sollte auch die Occlusion berücksichtigt werden.
zh_cn: **这是最重要的指导原则。** 好的关卡设计并不只是满足游戏性的需求，也应该同时考虑遮挡。
zh_tw: 這就是很多專業人士的秘密。好的關卡設計並不只是滿足遊戲性的需求，也應該同時考慮遮擋。

source: For indoor environments, add opaque walls to "break" the line of sight at regular intervals and ensure not too much of the scene can be seen at once.
de: In Innenräumen sollten Sie undurchsichtige Wände hinzufügen, um die Sichtlinie in regelmäßigen Abständen zu "unterbrechen" und sicherzustellen, dass nicht zu viel von der Szene auf einmal zu sehen ist.
zh_cn: 对于室内环境，添加不透明的墙壁以定期“打断”视线，并确保一次不会看到太多场景。
zh_tw: 對於室內環境，新增不透明的牆壁以定期“打破”視線，並確保一次不會看到太多場景。

source: For large open scenes, use a pyramid-like structure for the terrain's elevation when possible. This provides the greatest culling opportunities compared to any other terrain shape.
de: Verwenden Sie bei großen offenen Szenen nach Möglichkeit eine pyramidenartige Struktur für die Geländeerhebung. Dies bietet im Vergleich zu jeder anderen Geländeform die besten Möglichkeiten für das Culling.
zh_cn: 对于大型开放场景，请尽可能使用类似金字塔的结构来确定地形的标高。与任何其他地形形状相比，这种设计提供了最大的剔除机会。
zh_tw: 對於大型開放場景，請盡可能使用類似金字塔的結構來確定地形的標高。與任何其他地形形狀相比，這提供了最大的剔除機會。

source: Avoid moving OccluderInstance3D nodes during gameplay
de: Vermeiden Sie das Verschieben von OccluderInstance3D-Nodes während des Spielens
zh_cn: 避免在游戏过程中移动 OcclusionInstance3D 节点
zh_tw: 避免在遊戲過程中移動 OcclusionInstance3D 節點

source: This includes moving the parents of OccluderInstance3D nodes, as this will cause the nodes themselves to move in global space, therefore requiring the :abbr:`BVH (Bounding Volume Hierarchy)` to be rebuilt.
de: Dies schließt das Verschieben der Parent-Nodes von OccluderInstance3D-Nodes ein, da dies dazu führt, dass die Nodes selbst im globalen Raum verschoben werden und somit die :abbr:`BVH (Bounding Volume Hierarchy)` neu aufgebaut werden muss.
zh_cn: 这包括移动 OccluderInstance3D 节点的父节点，因为这将导致节点本身在全局空间中移动，因此需要重建 :abbr:`BVH (Bounding Volume Hierarchy)`。
zh_tw: 這包括移動 OccluderInstance3D 節點的父節點，因為這將導致節點本身在全域空間中移動，因此需要重建 BVH（邊界體積層次結構）。

source: Toggling an OccluderInstance3D's visibility (or one of its parents' visibility) is not as expensive, as the update only needs to happen once (rather than continuously).
de: Das Umschalten der Sichtbarkeit einer OccluderInstance3D (oder der Sichtbarkeit eines ihrer Elternteile) ist weniger kostspielig, da die Aktualisierung nur einmal (und nicht ständig) erfolgen muss.
zh_cn: 切换 OccluderInstance3D 的可见性（或其父级之一的可见性）并不那么耗费性能，因为更新只需要发生一次（而不是连续发生）。
zh_tw: 切換 OccluderInstance3D 的可見性（或其父級之一的可見性）並不那麼昂貴，因為更新只需要發生一次（而不是連續發生）。

source: For example, if you have a sliding or rotating door, you can make the OccluderInstance3D node not be a child of the door itself (so that the occluder never moves), but you can hide the OccluderInstance3D visibility once the door starts opening. You can then reshow the OccluderInstance3D once the door is fully closed.
de: Wenn Sie beispielsweise eine Schiebe- oder Drehtür haben, können Sie dafür sorgen, dass der OccluderInstance3D-Node kein Child-Node der Tür selbst ist (so dass sich der Occluder nie bewegt), aber Sie können die Sichtbarkeit des OccluderInstance3D-Nodes ausblenden, sobald sich die Tür zu öffnen beginnt. Sie können den OccluderInstance3D-Node wieder einblenden, sobald die Tür vollständig geschlossen ist.
zh_cn: 举个例子，如果你有一扇滑动门或旋转门，则可以使 OccluderInstance3D 节点不是门本身的子节点（以便遮挡器永远不会移动），但可以在门开始打开后隐藏 OccluderInstance3D 可见性。一旦门完全关闭，你就可以重新显示 OcclusionrInstance3D。
zh_tw: 例如，如果您有一扇滑動門或旋轉門，則可以使 OccluderInstance3D 節點不是門本身的子節點（以便遮擋器永遠不會移動），但您可以在門開始打開後隱藏 OccluderInstance3D 可見性。一旦門完全關閉，您就可以重新顯示 OcclusionrInstance3D。

source: If you absolutely have to move an OccluderInstance3D node during gameplay, use a primitive Occluder3D shape for it instead of a complex baked shape.
de: Wenn Sie einen OccluderInstance3D-Node während des Spiels unbedingt verschieben müssen, verwenden Sie dafür eine primitive Occluder3D-Shape anstelle einer komplexen gebackenen Shape.
zh_cn: 如果你绝对必须在游戏过程中移动 OcclusionrInstance3D 节点，请为其使用原始 Occlusionr3D 形状，而不是复杂的烘焙形状。
zh_tw: 如果您絕對必須在遊戲過程中移動 OcclusionrInstance3D 節點，請為其使用原始 Occlusionr3D 形狀，而不是複雜的烘焙形狀。

source: Use the simplest possible occluder shapes
de: Verwenden Sie möglichst einfache Occluder-Shapes
zh_cn: 使用尽可能简单的遮挡器形状
zh_tw: 使用盡可能簡單的遮擋物形狀

source: If you notice low performance or stuttering in complex 3D scenes, it may mean that the CPU is overloaded as a result of rendering detailed occluders. Select the OccluderInstance3D node, increase the **Bake > Simplification** property then bake occluders again.
de: Wenn Sie in komplexen 3D-Szenen eine geringe Performance oder Stuttering feststellen, kann dies bedeuten, dass die CPU durch das Rendern detaillierter Occluder überlastet ist. Wählen Sie den OccluderInstance3D-Node, erhöhen Sie die Property **Backen > Vereinfachung** und backen Sie die Occluder erneut.
zh_cn: 如果发现复杂 3D 场景中性能低下或卡顿，则可能意味着 CPU 由于渲染（过于）详细的遮挡器而过载。请选择 OccluderInstance3D 节点，增加 **Bake > Simplification** 属性，然后再次烘焙遮挡器。
zh_tw: 如果您發現複雜 3D 場景中效能低或卡頓，則可能表示 CPU因算繪詳細遮蔽物而過載。選擇 OccluderInstance3D 節點，增加 **Bake > Simplification** 屬性，然後再次烘焙遮蔽物。

source: Remember to keep the simplification value reasonable. Values that are too high for the level's geometry may cause incorrect occlusion culling to occur, as in :ref:`doc_occlusion_culling_troubleshooting_false_negative`.
de: Achten Sie darauf, dass der Wert für die Vereinfachung angemessen ist. Werte, die für die Geometrie der Ebene zu hoch sind, können dazu führen, dass falsches Occlusion Culling auftritt, wie in :ref:`doc_occlusion_culling_troubleshooting_false_negative`.
zh_cn: 请记住，保持合理的简化值。对于关卡几何形状来说，太高的值可能会导致发生不正确的遮挡剔除，如 :ref:`doc_occlusion_culling_troubleshooting_false_negative` 中所示的那样。
zh_tw: 請記得保持簡化值合理。對於關卡幾何形狀來說太高的值可能會導致發生不正確的遮蔽剔除，如 :ref:`doc_occlusion_culling_troubleshooting_false_negative` 所示。

source: If this still doesn't lead to low enough CPU usage, you can try adjusting the **Rendering > Occlusion Culling > BVH Build Quality** project setting and/or decreasing **Rendering > Occlusion Culling > Occlusion Rays Per Thread**. You'll need to enable the **Advanced** toggle in the Project Settings dialog to see those settings.
de: Wenn dies immer noch nicht zu einer ausreichend niedrigen CPU-Auslastung führt, können Sie versuchen, die Projekteinstellung **Rendern > Occlusion Culling > BVH Build-Qualität** anzupassen und/oder **Rendern > Occlusion Culling > Occlusion-Strahlen pro Thread** zu verringern. Um diese Einstellungen zu sehen, müssen Sie die Option **Erweitert** im Dialogfeld Projekteinstellungen aktivieren.
zh_cn: 如果这仍然没有让 CPU 使用率低下来，你可以尝试调整 **渲染 > 遮挡剔除 > BVH 构建质量** 项目设置和/或减少 **渲染 > 遮挡剔除 > 每线程遮挡光线** 。你需要在“项目设置”对话框中启用 **高级设置** 开关才能查看这些设置。
zh_tw: 如果這仍然沒有導致足夠低的 CPU 使用率，您可以嘗試調整 **算繪 > 遮擋剔除 > BVH 建構品質** 專案設定和/或減少 **算繪 > 遮擋剔除 > 每線程遮擋光線**。您需要在「專案設定」對話方塊中啟用「進階」開關才能查看這些設定。

source: Troubleshooting
de: Fehlersuche
zh_cn: 故障排除
zh_tw: 疑難排解

source: My occludee isn't being culled when it should be
de: Mein Occludee wird nicht gecullt, wenn er es sollte
zh_cn: 我的被遮挡物在应该被剔除的时候却没有被剔除
zh_tw: 我的被遮蔽者在該被剔除的時候卻沒有被剔除

source: **On the occluder side:**
de: **Auf der Seite des Occluders:**
zh_cn: **在遮挡器一侧：**
zh_tw: **在遮擋器一側：**

source: First, double-check that the **Bake > Cull Mask** property in the OccluderInstance3D is set to allow baking the meshes you'd like. The visibility layer of the MeshInstance3D nodes must be present within the cull mask for the mesh to be included in the bake.
de: Vergewissern Sie sich zunächst, dass die Property **Backen > Cull-Maske** in der OccluderInstance3D so eingestellt ist, dass die gewünschten Meshes gebacken werden können. Die Sichtbarkeitsebene der MeshInstance3D-Nodes muss innerhalb der Cull-Maske liegen, damit das Mesh beim Backen berücksichtigt wird.
zh_cn: 首先，仔细检查 OccluderInstance3D 中的 **Bake > Cull Mask** 属性是否设置为允许烘焙你想要的网格。 MeshInstance3D 节点的可见性层必须存在于剔除遮罩中，网格才能包含在烘焙中。
zh_tw: 首先，仔細檢查 OccluderInstance3D 中的 **Bake > Cull Mask** 屬性是否設定為允許烘焙您想要的網格。 MeshInstance3D 節點的可見性層必須存在於剔除遮罩中，網格才能包含在烘焙中。

source: Also note that occluder baking only takes meshes with *opaque* materials into account. Surfaces will *transparent* materials will **not** be included in the bake, even if the texture applied on them is fully opaque.
de: Beachten Sie außerdem, dass beim Backen von Occludern nur Meshes mit *undurchsichtigen* Materialien berücksichtigt werden. Flächen mit *transparenten* Materialien werden **nicht** in das Backen einbezogen, selbst wenn die auf sie angewendete Textur vollständig undurchsichtig ist.
zh_cn: 此外请注意，遮挡器烘焙仅考虑具有 *不透明* 材质的网格。表面将 *透明* 材质将 **不** 包含在烘焙中，即使应用在其上的纹理是完全不透明的。
zh_tw: 另請注意，遮擋器烘焙僅考慮具有“不透明”材質的網格。表面將*透明*材質將**不**包含在烘焙中，即使應用在其上的紋理是完全不透明的。

source: Lastly, remember that MultiMeshInstance3D, GPUParticles3D, CPUParticles3D and CSG nodes are **not** taken into account when baking occluders. As a workaround, you can add OccluderInstance3D nodes for those manually.
de: Schließlich ist zu beachten, dass MultiMeshInstance3D, GPUParticles3D, CPUParticles3D und CSG-Nodes beim Backen von Occludern **nicht** berücksichtigt werden. Als Workaround können Sie OccluderInstance3D-Nodes für diese manuell hinzufügen.
zh_cn: 最后，请记住，烘焙遮挡器时 **不** 考虑 MultiMeshInstance3D、GPUParticles3D、CPUParticles3D 和 CSG 节点。作为一种解决方案，你可以手动为这些节点添加 OccluderInstance3D 节点。
zh_tw: 最後，請記住，烘焙遮擋物時**不**考慮 MultiMeshInstance3D、GPUParticles3D、CPUParticles3D 和 CSG 節點。作為解決方法，您可以手動為這些節點新增 OccluderInstance3D 節點。

source: **On the occludee side:**
de: **Auf der Seite des Occludees:**
zh_cn: **在被遮挡物一侧：**
zh_tw: **在被遮蔽方：**

source: Make sure **Extra Cull Margin** is set as low as possible (it should usually be ``0.0``), and that **Ignore Occlusion Culling** is disabled in the object's GeometryInstance3D section.
de: Vergewissern Sie sich, dass **Extra Cull Margin** so niedrig wie möglich eingestellt ist (normalerweise sollte es ``0.0`` sein), und dass **Ignore Occlusion Culling** im Abschnitt GeometryInstance3D des Objekts deaktiviert ist.
zh_cn: 确保 **Extra Cull Margin** 设置为尽可能低（通常应为 ``0.0`` ），并且在对象的 GeometryInstance3D 部分中禁用 **Ignore Occlusion Culling** 。
zh_tw: 確保**額外剔除餘裕**設定為盡可能低（通常應為``0.0``），並且在物件的 GeometryInstance3D 部分中停用**忽略遮蔽剔除**。

source: Also, check the AABB's size (which is represented by an orange box when selecting the node). This axis-aligned bounding box must be *fully* occluded by the occluder shapes for the occludee to be hidden.
de: Überprüfen Sie auch die Größe der AABB (die durch einen orangefarbenen Kasten dargestellt wird, wenn Sie den Node auswählen). Diese achsenparallele Bounding Box muss *vollständig* vom Umriss des Occluders verdeckt werden, damit der Occludee ausgeblendet werden kann.
zh_cn: 另外，检查 AABB 的大小（选择节点时由橙色框表示）。此轴对齐的边界框必须被遮挡器形状 *完全* 遮挡，才能隐藏被遮挡物。
zh_tw: 另外，檢查 AABB 的大小（選擇節點時以橘色框表示）。此軸對齊的邊界框必須被遮擋物形狀*完全*遮擋，才能隱藏被遮擋物。

source: My occludee is being culled when it shouldn't be
de: Mein Occludee wird gecullt, obwohl er es nicht sollte
zh_cn: 我的被遮挡物在不应该被剔除的情况下被剔除
zh_tw: 我的被遮蔽者在不該被剔除的情況下被剔除

source: The most likely cause for this is that objects that were included in the occluder bake have been moved after baking occluders. For instance, this can occur when moving your level geometry around or rearranging its layout. To fix this, select the OccluderInstance3D node and bake occluders again.
de: Die wahrscheinlichste Ursache dafür ist, dass Objekte, die in den Occluder-Backvorgang eingeschlossen waren, nach dem Backen der Occluder verschoben wurden. Dies kann zum Beispiel passieren, wenn Sie die Geometrie Ihrer Ebene verschieben oder das Layout neu anordnen. Um dies zu beheben, wählen Sie den OccluderInstance3D-Node aus und backen Sie die Occluder erneut.
zh_cn: 造成这种情况的最可能的原因是，遮挡器烘焙中包含的对象在烘焙遮挡器后已被移动。例如，当移动关卡几何体或重新排列其布局时，就可能会发生这种情况。要解决此问题，请选择 OccluderInstance3D 节点并再次烘焙遮挡物。
zh_tw: 造成這種情況的最可能的原因是，遮擋物烘焙中包含的物件在烘焙遮擋物後已被移動。例如，當行動關卡幾何圖形或重新排列其佈局時，可能會發生這種情況。要解決此問題，請選擇 OccluderInstance3D 節點並再次烘焙遮擋物。

source: This can also happen because dynamic objects were included in the bake, even though they shouldn't be. Use the :ref:`occlusion culling debug draw mode <doc_occlusion_culling_preview>` to look for occluder shapes that shouldn't be present, then :ref:`adjust the bake cull mask accordingly <doc_occlusion_culling_baking>`.
de: Das kann auch passieren, weil dynamische Objekte in den Backvorgang einbezogen wurden, obwohl sie es nicht sollten. Verwenden Sie den :ref:`Occlusion Culling-Debug-Zeichenmodus <doc_occlusion_culling_preview>`, um nach Occluder-Shapes zu suchen, die nicht vorhanden sein sollten, und passen Sie dann :ref:`die Back-Cull-Maske entsprechend an <doc_occlusion_culling_baking>`.
zh_cn: 这种情况也可能发生，因为动态对象包含在烘焙中，尽管它们不应该包含在内。请使用` :ref:`遮挡剔除调试绘制模式<doc_occlusion_culling_preview>` 查找不应出现的遮挡器形状，然后 :ref:`相应地调整烘焙剔除蒙版 <doc_occlusion_culling_baking>` 。
zh_tw: 這種情況也可能發生，因為動態物件包含在烘焙中，儘管它們不應該包含在內。使用遮蔽剔除除錯繪製模式 <doc_occlusion_culling_preview>` 尋找不應出現的遮蔽形狀，然後相應調整烘焙剔除蒙版 <doc_occlusion_culling_baking>`。

source: The last possible cause for this is overly aggressive mesh simplification during the occluder baking process. Select the OccluderInstance3D node, decrease the **Bake > Simplification** property then bake occluders again.
de: Die letzte mögliche Ursache für dieses Problem ist eine zu aggressive Vereinfachung des Meshes während des Backvorgangs der Occluder. Wählen Sie den OccluderInstance3D-Node aus, verringern Sie die Property **Backen > Vereinfachung** und backen Sie die Occluder erneut.
zh_cn: 最后一个可能的原因，是在遮挡器烘焙过程中使用了过于激进的网格简化。选择 OccluderInstance3D 节点，减少 **Bake > Simplification** 属性，然后再次烘焙遮挡器。
zh_tw: 最後一個可能的原因是在遮擋器烘焙過程中過於激進的網格簡化。選擇 OccluderInstance3D 節點，減少 **Bake > Simplification** 屬性，然後再次烘焙遮蔽物。

source: As a last resort, you can enable the **Ignore Occlusion Culling** property on the occludee. This will negate the performance improvements of occlusion culling for that object, but it makes sense to do this for objects that will never be culled (such as a first-person view model).
de: Als letzten Ausweg können Sie die Property **Occlusion Culling ignorieren** für den Occludee aktivieren. Dies hebt die Performance-Verbesserungen des Occlusion Culling für dieses Objekt auf, aber es ist sinnvoll, dies für Objekte zu tun, die nie gecullt werden (wie z. B. ein First-Person-View-Modell).
zh_cn: 作为最后的手段，你可以启用被遮挡者的 **Ignore Occlusion Culling** 属性。这将抵消该对象的遮挡剔除的性能改善，但对于永远不会被剔除的对象（例如第一人称视图模型）来说这样做是有意义的。
zh_tw: 作為最後的手段，您可以啟用被遮蔽者的 **忽略遮蔽剔除** 屬性。這將抵消該物件的遮蔽剔除的效能改進，但對於永遠不會被剔除的物件（例如第一人稱視圖模型）執行此操作是有意義的。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
