Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/occlusion_culling.po
Languages: de, zh_cn, zh_tw

source: Occlusion culling
zh_cn: 遮挡剔除
zh_tw: 遮擋剔除

source: In a 3D rendering engine, **occlusion culling** is the process of performing hidden geometry removal.
de: In einer 3D-Rendering-Engine ist **Occlusion Culling** der Prozess, bei dem verdeckte Geometrie entfernt wird.
zh_cn: 在3D渲染引擎中，**遮挡剔除** 是将被遮挡物体移除的过程。
zh_tw: 在 3D 算繪引擎中，**遮蔽剔除**是執行隱藏幾何體移除的過程。

source: On this page, you'll learn:
de: Auf dieser Seite erfahren Sie:
zh_cn: 你会在这个页面中学习到：
zh_tw: 在本指南中，我們將學到：

source: What are the advantages and pitfalls of occlusion culling.
de: Was sind die Vorteile und Fallstricke des Occlusion Culling?
zh_cn: 遮挡剔除的优缺点有哪些。
zh_tw: 什麼是遮擋剔除的優點缺點。

source: How to set up occlusion culling in Godot.
de: Wie man Occlusion Culling in Godot einrichtet.
zh_cn: 怎样在 Godot 中设置遮挡剔除。
zh_tw: 如何在 Godot 中設定遮擋剔除。

source: Troubleshooting common issues with occlusion culling.
de: Fehlerbehebung bei häufigen Problemen mit dem Occlusion Culling.
zh_cn: **解决 Godot 中控制器的问题** 。
zh_tw: **解決 Godot 中控制器的問題**。

source: You can see how occlusion culling works in action using the `Occlusion Culling and Mesh LOD demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.
de: Sie können sehen, wie Occlusion Culling in Aktion funktioniert, indem Sie das `Occlusion Culling and Mesh LOD Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__ verwenden.
zh_cn: 你可以使用 `遮挡剔除和网格 LOD 演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__ 来了解遮挡剔除的实际工作原理。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Why use occlusion culling
de: Warum Occlusion Culling verwenden?
zh_cn: 为什么要使用遮挡剔除
zh_tw: 遮擋模式

source: In this example scene with hundreds of rooms stacked next to each other, a dynamic object (red sphere) is hidden behind the wall in the lit room (on the left of the door):
de: In dieser Beispielszene mit Hunderten von nebeneinander liegenden Räumen ist ein dynamisches Objekt (rote Kugel) hinter der Wand im beleuchteten Raum (links von der Tür) versteckt:
zh_cn: 这个示例场景中有数百个房间相邻堆叠，一个动态物体（红色球体）隐藏在明亮房间的墙后面（门的左侧）：
zh_tw: 在這個有數百個房間相鄰堆疊的範例場景中，一個動態物件（紅色球體）隱藏在明亮房間的牆後面（在門的左側）：

source: Example scene with an occlusion culling-friendly layout
de: Beispielszene mit einem Occlusion Culling-freundlichen Layout
zh_cn: 布局对遮挡剔除友好的示例场景
zh_tw: 具有遮擋剔除友好佈局的範例場景

source: With occlusion culling disabled, all the rooms behind the lit room have to be rendered. The dynamic object also has to be rendered:
de: Wenn Occlusion Culling deaktiviert ist, müssen alle Räume hinter dem beleuchteten Raum gerendert werden. Das dynamische Objekt muss ebenfalls gerendert werden:
zh_cn: 遮挡剔除关闭后，光亮房间后的所有房间和动态物体都需要被渲染：
zh_tw: 停用遮擋剔除後，必須算繪照亮房間後方的所有房間。動態物件也必須被算繪：

source: Example scene with occlusion culling disabled (wireframe)
de: Beispielszene mit deaktiviertem Occlusion Culling (Drahtgitter)
zh_cn: 禁用遮挡剔除的示例场景（线框）
zh_tw: 停用遮擋剔除的範例場景（線框）

source: Example scene with occlusion culling **disabled** (wireframe)
de: Beispielszene mit **deaktiviertem** Occlusion Culling (Drahtgitter)
zh_cn: **禁用** 遮挡剔除的示例场景（线框）
zh_tw: 遮擋剔除**停用**的範例場景（線框）

source: With occlusion culling enabled, only the rooms that are actually visible have to be rendered. The dynamic object is also occluded by the wall, and therefore no longer has to be rendered:
de: Bei aktiviertem Occlusion Culling müssen nur die Räume gerendert werden, die tatsächlich sichtbar sind. Das dynamische Objekt wird ebenfalls von der Wand verdeckt und muss daher nicht mehr gerendert werden:
zh_cn: 遮挡剔除打开后，只有真正可见的房间被渲染，动态物体被墙遮挡住，因此也不用被渲染：
zh_tw: 啟用遮擋剔除後，只需算繪實際可見的房間。動態物件也被牆壁遮擋，因此不再需要算繪：

source: Example scene with occlusion culling enabled (wireframe)
de: Beispielszene mit aktiviertem Occlusion Culling (Drahtgitter)
zh_cn: 线框模式下启用遮挡剔除的范例场景
zh_tw: 啟用遮擋剔除的範例場景（線框）

source: Example scene with occlusion culling **enabled** (wireframe)
de: Beispielszene mit **aktiviertem** Occlusion Culling (Drahtgitter)
zh_cn: 线框模式下 *启用* 遮挡剔除的范例场景
zh_tw: **啟用**的遮蔽剔除範例場景（線框）

source: Since the engine has less work to do (fewer vertices to render and fewer draw calls), performance will increase as long as there are enough occlusion culling opportunities in the scene. This means occlusion culling is most effective in indoor scenes, preferably with many smaller rooms instead of fewer larger rooms. Combine this with :ref:`doc_mesh_lod` and :ref:`doc_visibility_ranges` to further improve performance gains.
de: Da die Engine weniger Arbeit hat (weniger zu rendernde Vertices und weniger Zeichenaufrufe), steigt die Performance, solange es genügend Occlusion Culling-Möglichkeiten in der Szene gibt. Das bedeutet, dass Occlusion Culling am effektivsten in Innenraumszenen ist, vorzugsweise mit vielen kleineren Räumen anstelle von wenigen größeren Räumen. Kombinieren Sie dies mit :ref:`doc_mesh_lod` und :ref:`doc_visibility_ranges`, um die Performance weiter zu verbessern.
zh_cn: 由于引擎只有更少的工作要做（更少的顶点和更少的 draw calls）,因此只要在场景中有足够多的遮挡剔除机会，性能就会提高。所以说遮挡剔除在室内场景中最有效，尤其是在很多较小的房间而不是较少更大的房间中。将此与 :ref:`doc_mesh_lod` 与 :ref:`doc_visibility_ranges` 结合起来可以进一步提高性能效益。
zh_tw: 由於引擎要做的工作較少（需要算繪的頂點較少，繪製呼叫也較少），因此只要場景中有足夠的遮擋剔除機會，效能就會提高。這意味著遮擋剔除在室內場景中最有效，最好有許多較小的房間，而不是較少的較大房間。將此與 doc_mesh_lod 和 doc_visibility_ranges 結合起來，可以進一步提高效能效益。

source: When using the Clustered Forward rendering backend, the engine already performs a *depth prepass*. This consists in rendering a depth-only version of the scene before rendering the scene's actual materials. This is used to ensure each opaque pixel is only shaded once, reducing the cost of overdraw significantly.
de: Bei Verwendung des Clustered Forward Rendering-Backends führt die Engine bereits einen *Tiefen-Vordurchlauf* durch. Dieser besteht darin, eine reine Tiefenversion der Szene zu rendern, bevor die eigentlichen Materialien der Szene gerendert werden. Dadurch wird sichergestellt, dass jedes undurchsichtige Pixel nur einen Shading-Durchlauf erfährt, was die Overdraw-Kosten erheblich reduziert.
zh_cn: 当使用集群 Forward 渲染后端时，引擎已经执行了 *深度预处理* 。这包括在渲染场景的实际材质之前渲染场景的仅深度（depth-only）版本。该技术用于确保每个不透明像素仅着色一次，从而显着降低过度绘制的成本。
zh_tw: 當使用叢集前向算繪後端時，引擎已經執行了*深度預通道*。這包括在算繪場景的實際材質之前算繪場景的僅深度版本。這用於確保每個不透明像素僅著色一次，從而顯著降低過度繪製的成本。

source: The greatest performance benefits can be observed when using the Forward Mobile rendering backend, as it does not feature a depth prepass for performance reasons. As a result, occlusion culling will actively decrease shading overdraw with that rendering backend.
de: Die größten Performance-Vorteile lassen sich bei Verwendung des Forward Mobile-Rendering-Backends beobachten, da es aus Performance-Gründen keinen Tiefen-Vordurchlauf enthält. Infolgedessen wird Occlusion Culling bei diesem Rendering-Backend das Shading-Overdrawing aktiv verringern.
zh_cn: 使用 Forward Mobile 渲染后端时可以观察到最大的性能优势，因为出于性能原因，它并没有深度预处理。因此，遮挡剔除将主动减少渲染后端的着色过度绘制。
zh_tw: 使用 Forward Mobile 算繪後端時可以觀察到最大的效能優勢，因為出於效能原因，它不具有深度預通道。因此，遮蔽剔除將主動減少算繪後端的著色過度繪製。

source: Nonetheless, even when using a depth prepass, there is still a noticeable benefit to occlusion culling in complex 3D scenes. However, in scenes with few occlusion culling opportunities, occlusion culling may not be worth the added setup and CPU usage.
de: Nichtsdestotrotz bietet Occlusion Culling in komplexen 3D-Szenen auch bei Verwendung eines Tiefenvordurchlaufs einen deutlichen Vorteil. In Szenen mit wenigen Occlusion Culling-Möglichkeiten lohnt sich das Occlusion Culling jedoch möglicherweise nicht wegen des zusätzlichen Einrichtungsaufwands und der CPU-Auslastung.
zh_cn: 尽管如此，即使使用深度预处理，复杂 3D 场景中的遮挡剔除仍然有明显优势。然而，在遮挡剔除机会很少的场景中，遮挡剔除可能不值得其增加的额外设定和 CPU 使用率。
zh_tw: 儘管如此，即使使用深度預通道，複雜 3D 場景中的遮蔽剔除仍然具有明顯的優勢。然而，在遮蔽剔除機會很少的場景中，遮蔽剔除可能不值得增加設定和 CPU 使用率。

source: How occlusion culling works in Godot
de: Wie Occlusion Culling in Godot funktioniert
zh_cn: Godot中的遮挡剔除如何运作
zh_tw: 遮擋模式

source: *"occluder" refers to the shape blocking the view, while "occludee" refers to the object being hidden.*
de: *"Occluder" bezieht sich auf den Umriss, der etwas verdeckt, während "Occludee" sich auf das Objekt bezieht, das verdeckt wird.*
zh_cn: * “遮挡物”是指遮挡视线的物体，而“被遮挡物”是指被遮挡的物体。*
zh_tw: *「遮擋物」是指遮擋視線的形狀，而「被遮擋物」是指被隱藏的物體。*

source: In Godot, occlusion culling works by rasterizing the scene's occluder geometry to a low-resolution buffer on the CPU. This is done using the software raytracing library `Embree <https://github.com/embree/embree>`__.
de: In Godot funktioniert Occlusion Culling, indem die Geometrie der Szene in einen niedrig aufgelösten Puffer auf der CPU gerastert wird. Dies geschieht mit der Software-Raytracing-Bibliothek `Embree <https://github.com/embree/embree>`__.
zh_cn: 在 Godot 中，遮挡剔除是通过将场景的遮挡几何体光栅化到低分辨率的缓存中实现的。这是使用了软光追库 `Embree <https://github.com/embree/embree>`__ 来完成的。
zh_tw: 在 Godot 中，遮蔽剔除的工作原理是將場景的遮蔽幾何圖形光柵化到 CPU 上的低解析度緩衝區。這是使用軟體光線追蹤庫 `Embree <https://github.com/embree/embree>`__ 完成的。

source: The engine then uses this low-resolution buffer to test occludees' :abbr:`AABB (Axis-Aligned Bounding Box)` against the occluder shapes. The occludee's :abbr:`AABB (Axis-Aligned Bounding Box)` must be *fully occluded* by the occluder shape to be culled.
de: Die Engine verwendet dann diesen niedrig aufgelösten Puffer, um die :abbr:`AABB (Axis-Aligned Bounding Box)` der Occludees gegen die Occluder-Umrisse zu testen. Die :abbr:`AABB (Axis-Aligned Bounding Box)` des Occluders muss *vollständig* vom Umriss des Occludees verdeckt werden, der aussortiert werden soll.
zh_cn: 然后，引擎使用低分辨率缓存来测试遮挡物的 :abbr:`AABB (Axis-Aligned Bounding Box，轴对齐边界框)` 与遮挡物的形状。被遮挡物的 :abbr:`AABB (Axis-Aligned Bounding Box，轴对齐边界框)` 必须被要剔除的遮挡物形状\ *完全遮挡*\ 。
zh_tw: 然後，引擎使用此低解析度緩衝區來測試遮擋物的 AABB（軸對齊邊界框）與遮擋物形狀。被遮擋物的 AABB（軸對齊邊界框）必須被要剔除的遮擋物形狀「完全遮擋」。

source: As a result, smaller objects are more likely to be effectively culled than larger objects. Larger occluders (such as walls) also tend to be much more effective than smaller ones (such as decoration props).
de: Daher ist die Wahrscheinlichkeit, dass kleinere Objekte effektiv verdeckt werden, höher als bei größeren Objekten. Größere Verdeckungen (z. B. Wände) sind in der Regel auch viel effektiver als kleinere (z. B. Dekorationsgegenstände).
zh_cn: 因此，较小的物体相较于较大的物体更可能被有效地剔除。较大的遮挡物（如墙壁）往往比较小的遮挡物（如装饰道具）更有效。
zh_tw: 因此，較小的物件比較大的物件更有可能被有效剔除。較大的遮蔽物（例如牆壁）也往往比較小的遮擋物（例如裝飾道具）更有效。

source: Setting up occlusion culling
de: Occlusion Culling einrichten
zh_cn: 设置遮挡剔除
zh_tw: 遮擋模式

source: The first step to using occlusion culling is to enable the **Rendering > **Occlusion Culling > Use Occlusion Culling** project setting. (Make sure the **Advanced** toggle is enabled in the Project Settings dialog to be able to see it.)
de: Der erste Schritt zur Verwendung von Occlusion Culling besteht darin, die Projekteinstellung **Rendern > **Occlusion Culling > Occlusion Culling verwenden** zu aktivieren. (Vergewissern Sie sich, dass die Option **Erweitert** im Dialogfeld Projekteinstellungen aktiviert ist, damit sie angezeigt wird).
zh_cn: 使用遮挡剔除的第一步是在项目设置中启用 **渲染>遮挡剔除>使用遮挡剔除**\。（确保在项目设置中启用 **高级设置** 选项，否则可能无法找到该设置。）
zh_tw: 使用遮蔽剔除的第一步是啟用 **算繪 > **遮蔽剔除 > 使用遮蔽剔除** 專案設定。 （確保在“專案設定”對話框中啟用“**高級**”開關才能看到它。）

source: This project setting applies immediately, so you don't need to restart the editor.
de: Diese Projekteinstellung wird sofort übernommen, so dass Sie den Editor nicht neu starten müssen.
zh_cn: 项目设置会立即应用，无需重启编辑器。
zh_tw: 專案設定會立即應用，無需重啟編輯器。

source: After enabling the project setting, you still need to create some occluders. For performance reasons, the engine doesn't automatically use all visible geometry as a basis for occlusion culling. Instead, the engine requires a simplified representation of the scene with only static objects to be baked.
de: Nachdem Sie die Projekteinstellung aktiviert haben, müssen Sie noch einige Occluder erstellen. Aus Gründen der Performance verwendet die Engine nicht automatisch die gesamte sichtbare Geometrie als Grundlage für Occlusion Culling. Stattdessen benötigt die Engine eine vereinfachte Darstellung der Szene mit nur statischen Objekten, die gebacken werden sollen.
zh_cn: 在启用项目设置后，你仍然需要创建一些遮挡物。出于性能原因，引擎不会自动将所有可见物体视为遮挡剔除的基础。相反，引擎需要只有静态物体被烘焙的简化场景表示。
zh_tw: 啟用專案設定後，您仍然需要建立一些遮蔽物。出於性能原因，引擎不會自動使用所有可見幾何體作為遮擋剔除的基礎。相反，引擎需要簡化的場景表示，僅需要烘焙靜態物件。

source: There are two ways to set up occluders in a scene:
de: Es gibt zwei Möglichkeiten, Occluder in einer Szene einzurichten:
zh_cn: 有两种方法可以在场景中设置遮挡器：
zh_tw: 有兩種方法可以為伺服器匯出專案：

source: Automatically baking occluders (recommended)
de: Automatisches Backen von Occludern (empfohlen)
zh_cn: 自动烘焙遮挡物（建议）
zh_tw: 自動烘焙遮擋物（建議）

source: Only MeshInstance3D nodes are currently taken into account in the *occluder* baking process. MultiMeshInstance3D, GPUParticles3D, CPUParticles3D and CSG nodes are **not** taken into account when baking occluders. If you wish those to be treated as occluders, you have to manually create occluder shapes that (roughly) match their geometry.
de: Nur MeshInstance3D-Nodes werden derzeit beim *Occluder* Back-Prozess berücksichtigt. MultiMeshInstance3D, GPUParticles3D, CPUParticles3D und CSG-Nodes werden beim Backen von Occludern **nicht** berücksichtigt. Wenn Sie möchten, dass diese als Occluder behandelt werden, müssen Sie manuell Occluder-Shapes erstellen, die (ungefähr) ihrer Geometrie entsprechen.
zh_cn: 当前 *遮挡物* 烘焙过程中仅考虑 MeshInstance3D 节点。烘焙遮挡物时， **不** 考虑 MultiMeshInstance3D、GPUParticles3D、CPUParticles3D 和 CSG 节点。如果你希望将它们也视为遮挡物，则必须手动建立以（大致）匹配其几何形状的遮挡物形状。
zh_tw: 目前*遮擋器*烘焙過程中僅考慮 MeshInstance3D 節點。烘焙遮蔽物時，**不**考慮 MultiMeshInstance3D、GPUParticles3D、CPUParticles3D 和 CSG 節點。如果您希望將它們視為遮擋物，則必須手動建立（大致）以配對其幾何形狀的遮擋物形狀。

source: This restriction does not apply to *occludees*. Any node type that inherits from GeometryInstance3D can be occluded.
de: Diese Einschränkung gilt nicht für *Occludees*. Jeder Node-Typ, der von GeometryInstance3D erbt, kann okkludiert werden.
zh_cn: 该限制不适用于 *被遮挡者*。任何继承自 GeometryInstance3D 的节点类型都可以被遮挡。
zh_tw: 此限制不適用於*被遮蔽者*。任何繼承自 GeometryInstance3D 的節點型別都可以被遮蔽。

source: After enabling the occlusion culling project setting mentioned above, add an OccluderInstance3D node to the scene containing your 3D level.
de: Nachdem Sie die oben erwähnte Occlusion Culling-Projekteinstellung aktiviert haben, fügen Sie einen OccluderInstance3D-Node zu der Szene hinzu, die Ihre 3D-Ebene enthält.
zh_cn: 启用上述遮挡剔除的项目设置后，向你包含 3D 关卡的场景中新增 OcclusionrInstance3D 节点。
zh_tw: 啟用上述遮擋剔除專案設定後，將 OcclusionrInstance3D 節點新增至包含 3D 關卡的場景。

source: Select the OccluderInstance3D node, then click **Bake Occluders** at the top of the 3D editor viewport. After baking, the OccluderInstance3D node will contain an Occluder3D resource that stores a simplified version of your level's geometry. This occluder geometry appears as purple wireframe lines in the 3D view (as long as **View Gizmos** is enabled in the **Perspective** menu). This geometry is then used to provide occlusion culling for both static and dynamic occludees.
de: Wählen Sie den OccluderInstance3D-Node aus und klicken Sie dann auf **Occluder backen** oben im 3D-Editor-Viewport. Nach dem Backen wird der OccluderInstance3D-Node eine Occluder3D-Ressource enthalten, die eine vereinfachte Version der Geometrie Ihres Levels speichert. Diese Occluder-Geometrie erscheint als violette Drahtgitterlinien in der 3D-Ansicht (sofern **View Gizmos** im Menü **Perspektive** aktiviert ist). Diese Geometrie wird dann verwendet, um Occlusion Culling sowohl für statische als auch für dynamische Occluder zu ermöglichen.
zh_cn: 选择 OccluderInstance3D 节点，然后单击 3D 编辑器视口顶部的 **烘焙遮挡器** 。在烘焙后，OccluderInstance3D 节点将包含一个 Occluder3D 资源，用于存储关卡几何体的简化版本。此遮挡物几何体在 3D 视图中显示为紫色线框线（只要在 **透视** 菜单中启用 **查看小工具** ）。然后使用该几何体为静态和动态被遮挡物提供遮挡剔除。
zh_tw: 選擇 OccluderInstance3D 節點，然後點擊 3D 編輯器視窗頂部的 **Bake Occlusionrs**。烘焙後，OccluderInstance3D 節點將包含一個 Occluder3D 資源，用於儲存關卡幾何的簡化版本。此遮擋物幾何體在 3D 視圖中顯示為紫色線框線（只要在 **透視** 選單中啟用 **查看 Gizmos**）。然後使用此幾何體為靜態和動態被遮蔽物提供遮蔽剔除。

source: After baking, you may notice that your dynamic objects (such as the player, enemies, etc…) are included in the baked mesh. To prevent this, set the **Bake > Cull Mask** property on the OccluderInstance3D to exclude certain visual layers from being baked.
de: Nach dem Backen werden Sie möglicherweise feststellen, dass Ihre dynamischen Objekte (z.B. Spieler, Gegner usw.) im gebackenen Mesh enthalten sind. Um dies zu verhindern, stellen Sie die Property **Backen > Cull-Maske** auf der OccluderInstance3D ein, um bestimmte visuelle Ebenen vom Backen auszuschließen.
zh_cn: 烘焙后，你可能会注意到动态对象（例如玩家、敌人等）也被包含到了烘焙的网格中。为了防止这种情况发生，请在 OccluderInstance3D 上设置 **Bake > Cull Mask** 属性，以排除某些视觉层的烘焙。
zh_tw: 烘焙後，您可能會注意到動態物件（例如玩家、敵人等）包含在烘焙的網格中。為了防止這種情況發生，請在 OccluderInstance3D 上設定 **Bake > Cull Mask** 屬性，以排除某些視覺層的烘焙。

source: For example, you can disable layer 2 on the cull mask, then configure your dynamic objects' MeshInstance3D nodes to be located on the visual layer 2 (instead of layer 1). To do so, select the MeshInstance3D node in question, then on the **VisualInstance3D > Layers** property, uncheck layer 1 then check layer 2. After configuring both cull mask and layers, bake occluders again by following the above process.
de: Sie können z.B. Ebene 2 in der Cull-Maske deaktivieren und dann die MeshInstance3D-Nodes Ihrer dynamischen Objekte so konfigurieren, dass sie sich auf der visuellen Ebene 2 (statt auf Ebene 1) befinden. Wählen Sie dazu den betreffenden MeshInstance3D-Node aus und deaktivieren Sie unter der Property **VisualInstance3D > Ebenen** die Option Ebene 1 und aktivieren Sie dann Ebene 2. Nachdem Sie sowohl die Cull-Maske als auch die Ebenen konfiguriert haben, backen Sie die Occluder erneut, indem Sie den oben beschriebenen Prozess durchführen.
zh_cn: 例如，你可以禁用剔除蒙版上的第 2 层，然后将动态对象的 MeshInstance3D 节点配置为位于可视层 2（而不是第 1 层）上。为此，请选择相关的 MeshInstance3D 节点，然后在 **VisualInstance3D > Layers** 属性上，取消选中图层 1，再选中图层 2。配置剔除蒙版和图层后，按照上述过程再次烘焙遮挡物。
zh_tw: 例如，您可以停用剔除蒙版上的第 2 層，然後將動態物件的 MeshInstance3D 節點配置為位於視覺層 2（而非第 1 層）上。為此，請選擇相關的MeshInstance3D 節點，然後在**VisualInstance3D > Layers** 屬性上，取消選取圖層1，然後選取圖層2。配置剔除遮罩和圖層後，依照上述流程再次烘焙遮擋物。

source: Manually placing occluders
de: Manuelles Platzieren von Occludern
zh_cn: 手动放置遮挡器
zh_tw: 多預留位置

source: This approach is more suited for specialized use cases, such as creating occlusion for MultiMeshInstance3D setups or CSG nodes (due to the aforementioned limitation).
de: Dieser Ansatz eignet sich eher für spezielle Anwendungsfälle, wie z. B. die Erstellung von Okklusion für MultiMeshInstance3D-Setups oder CSG-Nodes (aufgrund der oben genannten Einschränkung).
zh_cn: 这种方法更适合专门的用例，例如为 MultiMeshInstance3D 设置或 CSG 节点创建遮挡（由于上述限制）。
zh_tw: 這種方法更適合專門的用例，例如為 MultiMeshInstance3D 設定或 CSG 節點建立遮蔽（由於上述限制）。

source: After enabling the occlusion culling project setting mentioned above, add an OccluderInstance3D node to the scene containing your 3D level. Select the OccluderInstance3D node, then choose an occluder type to add in the **Occluder** property:
de: Nachdem Sie die oben erwähnte Occlusion Culling Projekteinstellung aktiviert haben, fügen Sie einen OccluderInstance3D Node zu der Szene hinzu, die Ihre 3D-Ebene enthält. Wählen Sie den OccluderInstance3D-Node aus und wählen Sie dann in der Property **Occluder** einen Occluder-Typ, den Sie hinzufügen möchten:
zh_cn: 启用上述遮挡剔除项目设置后，将 OcclusionrInstance3D 节点添加到包含 3D 关卡的场景中。选择 OccluderInstance3D 节点，然后选择要添加到 **Occlusionr** 属性中的遮挡器类型：
zh_tw: 啟用上述遮擋剔除專案設定後，將 OcclusionrInstance3D 節點新增至包含 3D 關卡的場景。選擇 OccluderInstance3D 節點，然後選擇要新增至 **Occlusionr** 屬性中的遮擋器型別：

source: QuadOccluder3D (a single plane)
de: QuadOccluder3D (eine einzelne Ebene)
zh_cn: QuadOccluder3D（一个单平面）
zh_tw: QuadOcclusionr3D（單平面）

source: BoxOccluder3D (a cuboid)
de: BoxOccluder3D (ein Quader)
zh_cn: BoxOccluder3D（一个立方体）
zh_tw: BoxOcclusionr3D（長方體）

source: SphereOccluder3D (a sphere-shaped occluder)
de: SphereOccluder3D (ein kugelförmiger Occluder)
zh_cn: SphereOccluder3D（一个球形遮挡器）
zh_tw: SphereOcclusionr3D（球狀遮擋器）

source: PolygonOccluder3D (a 2D polygon with as many points as you want)
de: PolygonOccluder3D (ein 2D-Polygon mit beliebig vielen Punkten)
zh_cn: PolygonOccluder3D（一个具有任意数量点的 2D 多边形）
zh_tw: PolygonOccluder3D（具有任意數量點的 2D 多邊形）

source: There is also ArrayOccluder3D, whose points can't be modified in the editor but can be useful for procedural generation from a script.
de: Es gibt auch ArrayOccluder3D, dessen Punkte im Editor nicht verändert werden können, aber für die prozedurale Erzeugung aus einem Skript nützlich sein können.
zh_cn: 此外还有 ArrayOccluder3D，其点无法在编辑器中修改，但可用于通过脚本进行程序生成。
zh_tw: 還有 ArrayOccluder3D，其點無法在編輯器中修改，但可用於從腳本進行程式產生。

source: Previewing occlusion culling
de: Vorschau für Occlusion Culling
zh_cn: 预览遮挡剔除
zh_tw: 遮擋模式

source: You can enable a debug draw mode to preview what the occlusion culling is actually "seeing". In the top-left corner of the 3D editor viewport, click the **Perspective** button (or **Orthogonal** depending on your current camera mode), then choose **Display Advanced… > Occlusion Culling Buffer**. This will display the low-resolution buffer that is used by the engine for occlusion culling.
de: Sie können einen Debug-Zeichenmodus aktivieren, um zu sehen, was das Occlusion Culling tatsächlich "sieht". Klicken Sie in der oberen linken Ecke des 3D-Editor-Viewport auf den Button **Perspektive** (oder **Orthogonal**, je nach aktuellem Kameramodus) und wählen Sie dann **Erweiterte Anzeige... > Occlusion Culling-Puffer**. Dadurch wird der niedrig aufgelöste Puffer angezeigt, der von der Engine für Occlusion Culling verwendet wird.
zh_cn: 可以启用调试绘制模式来预览遮挡剔除实际“看到”的内容。在 3D 编辑器视口的左上角，单击 **透视** 按钮（或 **正交** ，具体取决于当前的相机模式），然后选择 **显示高级... > 遮挡剔除缓冲** 。这将显示引擎用于遮挡剔除的低分辨率缓冲区。
zh_tw: 您可以啟用除錯繪製模式來預覽遮擋剔除實際「看到」的內容。在3D 編輯器視窗的左上角，按一下**透視** 按鈕（或**正交**，取決於您目前的相機模式），然後選擇**顯示進階... > 遮擋剔除緩衝區**。這將顯示引擎用於遮蔽剔除的低解析度緩衝區。

source: In the same menu, you can also enable **View Information** and **View Frame Time** to view the number of draw calls and rendered primitives (vertices + indices) in the bottom-right corner, along with the number of frames per second rendered in the top-right corner.
de: Im gleichen Menü können Sie auch **Informationen anzeigen** und **Frame-Zeit anzeigen** aktivieren, um die Anzahl der Zeichenaufrufe und gerenderten Primitive (Vertices + Indizes) in der unteren rechten Ecke sowie die Anzahl der gerenderten Frames pro Sekunde in der oberen rechten Ecke anzuzeigen.
zh_cn: 在同一菜单中，还可以启用 **查看信息** 和 **查看帧时间** 来查看右下角的绘制调用和渲染图元（顶点+索引）的数量，以及右上角渲染的每秒帧数。
zh_tw: 在同一選單中，您還可以啟用**查看資訊**和**查看影格時間**來查看右下角的繪製呼叫和算繪像素（頂點+索引）的數量，以及右上角算繪的每秒影格數。

source: If you toggle occlusion culling in the project settings while this information is displayed, you can see how much occlusion culling improves performance in your scene. Note that the performance benefit highly depends on the 3D editor camera's view angle, as occlusion culling is only effective if there are occluders in front of the camera.
de: Wenn Sie Occlusion Culling in den Projekteinstellungen einschalten, während diese Informationen angezeigt werden, können Sie sehen, wie sehr Occlusion Culling die Performance Ihrer Szene verbessert. Beachten Sie, dass der Performance-Vorteil stark vom Blickwinkel der 3D-Editor-Kamera abhängt, da Occlusion Culling nur dann wirksam ist, wenn sich vor der Kamera verdeckte Objekte befinden.
zh_cn: 如果在显示此信息时在项目设置中切换遮挡剔除，你可以看到遮挡剔除对场景性能的改善程度。请注意，性能优势在很大程度上取决于 3D 编辑器相机的视角，因为遮挡剔除仅在相机前面存在遮挡器时才有效。
zh_tw: 如果在顯示此資訊時在專案設定中切換遮擋剔除，您可以看到遮擋剔除對場景效能的改善程度。請注意，性能優勢在很大程度上取決於 3D 編輯器相機的視角，因為遮擋剔除僅在相機前面存在遮擋物時才有效。

source: To toggle occlusion culling at run-time, set ``use_occlusion_culling`` on the root viewport as follows:
de: Um Occlusion Culling zur Laufzeit einzuschalten, setzen Sie ``use_occlusion_culling`` im Root-Viewport wie folgt:
zh_cn: 要在运行时切换遮挡剔除，请在根视口上设置“use_occlusion_culling”，如下所示：
zh_tw: 若要在運作時切換遮蔽剔除，請在根視窗上設定“use_occlusion_culling”，如下所示：
