Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/physical_light_and_camera_units.po
Languages: de

source: Physical light and camera units
de: Physikalische Licht- und Kamera-Einheiten

source: Why use physical light and camera units?
de: Warum physikalische Licht- und Kamera-Einheiten verwenden?

source: Godot uses arbitrary units for many physical properties that apply to light like color, energy, camera field of view, and exposure. By default, these properties use arbitrary units, because using accurate physical units comes with a few tradeoffs that aren't worth it for many games. As Godot favors ease of use by default, physical light units are disabled by default.
de: Godot verwendet willkürliche Einheiten für viele physikalische Eigenschaften, die sich auf Licht beziehen, wie Farbe, Energie, Kamera-Field of View und Belichtung. Standardmäßig werden für diese Eigenschaften willkürliche Einheiten verwendet, da die Verwendung genauer physikalischer Einheiten mit einigen Kompromissen verbunden ist, die sich für viele Spiele nicht lohnen. Da Godot standardmäßig die Benutzerfreundlichkeit bevorzugt, sind physikalische Licht-Einheiten standardmäßig deaktiviert.

source: Advantages of physical units
de: Vorteile von physikalischen Einheiten

source: If you aim for photorealism in your project, using real world units as a basis can help make things easier to adjust. References for real world materials, lights and scene brightness are wildly available on websites such as `Physically Based <https://physicallybased.info/>`__.
de: Wenn Sie in Ihrem Projekt Fotorealismus anstreben, kann die Verwendung von Einheiten aus der realen Welt als Grundlage die Anpassung erleichtern. Referenzen für reale Materialien, Lichter und Szenenhelligkeit sind auf Websites wie `Physically Based <https://physicallybased.info/>`__ zu finden.

source: Using real world units in Godot can also be useful when porting a scene from other 3D software that uses physical light units (such as Blender).
de: Die Verwendung von Einheiten aus der echten Welt in Godot kann auch nützlich sein, wenn eine Szene aus einer anderen 3D-Software portiert wird, die physikalische Licht-Einheiten verwendet (z. B. Blender).

source: Disadvantages of physical units
de: Nachteile von physikalischen Einheiten

source: The biggest disadvantage of using physical light units is you will have to pay close attention to the dynamic range in use at a given time. You can run into floating point precision errors when mixing very high light intensities with very low light intensities.
de: Der größte Nachteil bei der Verwendung von physikalischen Licht-Einheiten ist, dass Sie genau auf den jeweils verwendeten Dynamikbereich achten müssen. Wenn Sie sehr hohe Lichtintensitäten mit sehr niedrigen Lichtintensitäten mischen, kann es zu Fehlern bei der Float-Genauigkeit kommen.

source: In practice, this means that you will have to manually manage your exposure settings to ensure that you aren't over-exposing or under-exposing your scene too much. Auto-exposure can help you balance the light in a scene to bring it into a normal range, but it can't recover lost precision from a dynamic range that is too high.
de: In der Praxis bedeutet dies, dass Sie Ihre Belichtungseinstellungen manuell verwalten müssen, um sicherzustellen, dass Sie Ihre Szene nicht zu stark über- oder unterbelichten. Die Belichtungsautomatik kann Ihnen helfen, das Licht in einer Szene auszugleichen, um es in einen normalen Bereich zu bringen, aber sie kann die verlorene Präzision eines zu hohen Dynamikbereichs nicht wiederherstellen.

source: Using physical light and camera units will not automatically make your project look *better*. Sometimes, moving away from realism can actually make a scene look better to the human eye. Also, using physical units requires a greater amount of rigor compared to non-physical units. Most benefits of physical units can only be obtained if the units are correctly set to match real world reference.
de: Die Verwendung physischer Licht- und Kameraeinheiten lässt Ihr Projekt nicht automatisch *besser* aussehen. Manchmal kann eine Abkehr vom Realismus eine Szene für das menschliche Auge sogar besser aussehen lassen. Außerdem erfordert die Verwendung physikalischer Einheiten ein höheres Maß an Strenge im Vergleich zu nicht-physikalischen Einheiten. Die meisten Vorteile physikalischer Einheiten können nur dann genutzt werden, wenn die Einheiten korrekt auf die reale Welt abgestimmt sind.

source: Physical light units are only available in 3D rendering, not 2D.
de: Physikalische Licht-Einheiten sind nur im 3D-Rendering verfügbar, nicht in 2D.

source: Setting up physical light units
de: Einrichtung von physischen Licht-Einheiten

source: Physical light units can be enabled separately from physical camera units.
de: Physikalische Licht-Einheiten können getrennt von physischen Kamera-Einheiten aktiviert werden.

source: To enable physical light units correctly, there are 4 steps required:
de: Um physikalische Licht-Einheiten korrekt zu aktivieren, sind 4 Schritte erforderlich:

source: Enable the project setting.
de: Aktivieren Sie die Projekteinstellung.

source: Configure the camera.
de: Konfigurieren Sie die Kamera.

source: Configure the environment.
de: Konfigurieren Sie die Environment.

source: Configure Light3D nodes.
de: Konfigurieren Sie Light3D-Nodes.

source: Since physical light and camera units only require a handful of calculations to handle unit conversion, enabling them doesn't have any noticeable performance impact on the CPU. However, on the GPU side, physical camera units currently enforce depth of field. This has a moderate performance impact. To alleviate this performance impact, depth of field quality can be decreased in the advanced Project Settings.
de: Da physikalische Licht- und Kamera-Einheiten nur eine Handvoll Berechnungen für die Umwandlung von Einheiten erfordern, hat ihre Aktivierung keine nennenswerten Auswirkungen auf die Leistung der CPU. Auf der GPU-Seite erzwingen die physikalischen Kamera-Einheiten jedoch derzeit die Schärfentiefe. Dies hat eine mäßige Auswirkung auf die Leistung. Um diese Auswirkungen auf die Leistung zu verringern, kann die Qualität der Schärfentiefe in den erweiterten Projekteinstellungen verringert werden.

source: Enable the project setting
de: Aktivieren Sie die Projekteinstellung

source: Open the Project Settings, enable the **Advanced** toggle then enable **Rendering > Lights And Shadows > Use Physical Light Units**. Restart the editor.
de: Öffnen Sie die Projekteinstellungen, aktivieren Sie den Schalter **Erweiterte Einstellungen** und aktivieren Sie dann **Rendern > Licht und Schatten > Physikalische Lichteinheiten verwenden**. Starten Sie den Editor neu.

source: Configure the camera
de: Konfigurieren der Kamera

source: When physical light units are enabled and if you have a WorldEnvironment node in your scene (i.e. the editor Environment is disabled), you **must** have a :ref:`class_CameraAttributes` resource assigned to the WorldEnvironment node. Otherwise, the 3D editor viewport will appear extremely bright if you have a visible DirectionalLight3D node.
de: Wenn physikalische Lichteinheiten aktiviert sind und wenn Sie einen WorldEnvironment-Node in Ihrer Szene haben (d.h. die Editor-Environment ist deaktiviert), **müssen** Sie eine :ref:`class_CameraAttributes`-Ressource dem WorldEnvironment-Node zugewiesen haben. Andernfalls wird das 3D-Editorfenster extrem hell erscheinen, wenn Sie einen sichtbaren DirectionalLight3D-Node haben.

source: On the Camera3D node, you can add a :ref:`class_CameraAttributes` resource to its **Attributes** property. This resource is used to control the camera's depth of field and exposure. When using :ref:`class_CameraAttributesPhysical`, its focal length property is also used to adjust the camera's field of view.
de: Im Camera3D-Node können Sie eine :ref:`class_CameraAttributes`-Ressource zu seiner **Attribute** Property hinzufügen. Diese Ressource wird verwendet, um die Schärfentiefe und die Belichtung der Kamera zu steuern. Bei Verwendung der Ressource :ref:`class_CameraAttributesPhysical` wird auch die Property Brennweite zur Einstellung des Field of View der Kamera verwendet.

source: When physical light units are enabled, the following additional properties become available in CameraAttributesPhysical's **Exposure** section:
de: Wenn physikalische Licht-Einheiten aktiviert sind, werden die folgenden zusätzlichen Propertys im Abschnitt **Belichtung** von CameraAttributesPhysical verfügbar:

source: **Aperture:** The size of the aperture of the camera, measured in f-stops. An f-stop is a unitless ratio between the focal length of the camera and the diameter of the aperture. A high aperture setting will result in a smaller aperture which leads to a dimmer image and sharper focus. A low aperture results in a wide aperture which lets in more light resulting in a brighter, less-focused image.
de: **Blende:** Die Größe der Blendenöffnung der Kamera, gemessen in Blendenstufen (F-Stops). Eine Blendenstufe ist ein einheitsloses Verhältnis zwischen der Brennweite der Kamera und dem Durchmesser der Blende. Eine hohe Blendeneinstellung führt zu einer kleineren Blendenöffnung, was zu einem dunkleren Bild und einer schärferen Schärfe führt. Eine kleine Blende ergibt eine große Blende, die mehr Licht durchlässt, was zu einem helleren, weniger scharfen Bild führt.

source: **Shutter Speed:** The time for shutter to open and close, measured in *inverse seconds* (``1/N``). A lower value will let in more light leading to a brighter image, while a higher value will let in less light leading to a darker image. *When getting or setting this property with a script, the unit is in seconds instead of inverse seconds.*
de: **Verschlusszeit:** Die Zeit für das Öffnen und Schließen des Verschlusses, gemessen in *inversen Sekunden* (``1/N``). Ein niedrigerer Wert lässt mehr Licht durch, was zu einem helleren Bild führt, während ein höherer Wert weniger Licht durchlässt, was zu einem dunkleren Bild führt. *Wenn diese Property mit einem Skript abgerufen oder gesetzt wird, ist die Einheit in Sekunden statt in inversen Sekunden.*

source: **Sensitivity:** The sensitivity of camera sensors, measured in ISO. A higher sensitivity results in a brighter image. When auto exposure is enabled, this can be used as a method of exposure compensation. Doubling the value will increase the exposure value (measured in EV100) by 1 stop.
de: **Sensitivität:** Die Empfindlichkeit von Kamerasensoren, gemessen in ISO. Eine höhere Sensitivität führt zu einem helleren Bild. Wenn die automatische Belichtung aktiviert ist, kann dieser Wert als Belichtungskorrektur verwendet werden. Eine Verdopplung des Wertes erhöht den Belichtungswert (gemessen in EV100) um 1 Stufe.

source: **Multiplier:** A *non-physical* exposure multiplier. Higher values will increase the scene's brightness. This can be used for post-processing adjustments or for animation purposes.
de: **Multiplikator:** Ein *nichtphysikalischer* Belichtungsmultiplikator. Höhere Werte erhöhen die Helligkeit der Szene. Dies kann für Nachbearbeitungsanpassungen oder für Animationszwecke verwendet werden.

source: The default **Aperture** value of 16 f-stops is appropriate for outdoors at daytime (i.e. for use with a default DirectionalLight3D). For indoor lighting, a value between 2 and 4 is more appropriate.
de: Der Default-**Blendenwert** von 16 Blendenstufen ist für Außenaufnahmen bei Tageslicht geeignet (d. h. für die Verwendung mit einem Default-DirectionalLight3D). Für die Beleuchtung in Innenräumen ist ein Wert zwischen 2 und 4 besser geeignet.

source: Typical shutter speed used in photography and movie production is 1/50 (0.02 seconds). Night-time photography generally uses a shutter around 1/10 (0.1 seconds), while sports photography uses a shutter speed between 1/250 (0.004 seconds) and 1/1000 (0.001 seconds) to reduce motion blur.
de: Die übliche Verschlusszeit in der Fotografie und Filmproduktion ist 1/50 (0,02 Sekunden). Bei Nachtaufnahmen wird im Allgemeinen eine Verschlusszeit von etwa 1/10 (0,1 Sekunden) verwendet, während bei Sportaufnahmen eine Verschlusszeit zwischen 1/250 (0,004 Sekunden) und 1/1000 (0,001 Sekunden) verwendet wird, um Bewegungsunschärfen zu reduzieren.

source: In real life, sensitivity is usually set between 50 ISO and 400 ISO for daytime outdoor photography depending on weather conditions. Higher values are used for indoor or night-time photography.
de: In der Realität wird die Sensitivität für Außenaufnahmen bei Tag je nach Wetterbedingungen in der Regel zwischen 50 ISO und 400 ISO eingestellt. Höhere Werte werden für Innenaufnahmen oder Nachtaufnahmen verwendet.

source: Unlike real life cameras, the adverse effects of increasing ISO sensitivity or decreasing shutter speed (such as visible grain or light trails) are not simulated in Godot.
de: Im Gegensatz zu realen Kameras werden die negativen Auswirkungen einer Erhöhung der ISO-Empfindlichkeit oder einer Verkürzung der Verschlusszeit (z. B. sichtbare Körnung oder Lichtspuren) in Godot nicht simuliert.

source: See :ref:`doc_physical_light_and_camera_units_setting_up_physical_camera_units` for a description of CameraAttributesPhysical properties that are also available when **not** using physical light units.
de: Siehe :ref:`doc_physical_light_and_camera_units_setting_up_physical_camera_units` für eine Beschreibung der CameraAttributesPhysical-Propertys, die auch verfügbar sind, wenn **nicht** physikalische Lichteinheiten verwendet werden.

source: Configure the environment
de: Konfigurieren der Environment

source: The default configuration is designed for daytime outdoor scenes. Night-time and indoor scenes will need adjustments to the DirectionalLight3D and WorldEnvironment background intensity to look correct. Otherwise, positional lights will be barely visible at their default intensity.
de: Die Default-Konfiguration ist für Tagszenen im Freien ausgelegt. Bei Nacht- und Innenraumszenen müssen die Intensität von DirectionalLight3D und WorldEnvironment angepasst werden, damit sie korrekt aussehen. Andernfalls sind die Positionslichter bei ihrer Default-Intensität kaum sichtbar.

source: If you haven't added a :ref:`class_WorldEnvironment` and :ref:`class_Camera3D` node to the current scene yet, do so now by clicking the 3 vertical dots at the top of the 3D editor viewport. Click **Add Sun to Scene**, open the dialog again then click **Add Environment to Scene**.
de: Wenn Sie der aktuellen Szene noch keinen :ref:`class_WorldEnvironment` und :ref:`class_Camera3D`-Node hinzugefügt haben, tun Sie dies jetzt, indem Sie auf die 3 vertikalen Punkte oben im 3D-Editor-Viewport klicken. Klicken Sie auf **Sonne zur Szene hinzufügen**, öffnen Sie den Dialog erneut und klicken Sie dann auf **Environment zur Szene hinzufügen**.

source: After enabling physical light units, a new property becomes available to edit in the :ref:`class_Environment` resource:
de: Nach der Aktivierung von physikalischen Licht-Einheiten steht eine neue Property zur Bearbeitung in der Ressource :ref:`class_Environment` zur Verfügung:

source: **Background Intensity:** The background sky's intensity in `nits <https://en.wikipedia.org/wiki/Candela_per_square_metre>`__ (candelas per square meter). This also affects ambient and reflected light if their respective modes are set to **Background**. If a custom **Background Energy** is set, this energy is multiplied by the intensity.
de: **Hintergrundintensität:** Die Intensität des Hintergrundhimmels in `Nits <https://de.wikipedia.org/wiki/Leuchtdichte#Ma%C3%9Feinheiten>`__ (Candela pro Quadratmeter). Dies wirkt sich auch auf das Umgebungs- und Reflexionslicht aus, wenn deren jeweilige Modi auf **Hintergrund** eingestellt sind. Wenn eine benutzerdefinierte **Hintergrund-Energie** eingestellt ist, wird diese Energie mit der Intensität multipliziert.

source: Configure the light nodes
de: Konfigurieren der Licht-Nodes

source: After enabling physical light units, 2 new properties become available in Light3D nodes:
de: Nach der Aktivierung von physikalischen Lichteinheiten werden 2 neue Propertys in Light3D-Nodes verfügbar:

source: **Intensity:** The light's intensity in `lux <https://en.wikipedia.org/wiki/Lux>`__ (DirectionalLight3D) or `lumens <https://en.wikipedia.org/wiki/Lumen_(unit)>`__ (OmniLight3D/SpotLight3D). If a custom **Energy** is set, this energy is multiplied by the intensity.
de: **Intensität:** Die Lichtintensität in `Lux <https://en.wikipedia.org/wiki/Lux>`__ (DirectionalLight3D) oder `Lumen <https://en.wikipedia.org/wiki/Lumen_(unit)>`__ (OmniLight3D/SpotLight3D). Wenn eine benutzerdefinierte **Energie** eingestellt ist, wird diese Energie mit der Intensität multipliziert.

source: **Temperature:** The light's *color temperature* defined in Kelvin. If a custom **Color** is set, this color is multiplied by the color temperature.
de: **Temperatur:** Die *Farbtemperatur* des Lichts wird in Kelvin angegeben. Wenn eine benutzerdefinierte **Farbe** eingestellt ist, wird diese Farbe mit der Farbtemperatur multipliziert.

source: **OmniLight3D/SpotLight3D intensity**
de: **OmniLight3D/SpotLight3D-Intensität**

source: Lumens are a measure of luminous flux, which is the total amount of visible light emitted by a light source per unit of time.
de: Lumen sind ein Maß für den Lichtstrom, d. h. die Gesamtmenge an sichtbarem Licht, die von einer Lichtquelle pro Zeiteinheit abgegeben wird.

source: For SpotLight3Ds, we assume that the area outside the visible cone is surrounded by a perfect light absorbing material. Accordingly, the apparent brightness of the cone area does *not* change as the cone increases and decreases in size.
de: Bei SpotLight3Ds gehen wir davon aus, dass der Bereich außerhalb des sichtbaren Kegels von einem perfekten lichtabsorbierenden Material umgeben ist. Dementsprechend ändert sich die scheinbare Helligkeit des Kegelbereichs *nicht*, wenn sich der Kegel vergrößert oder verkleinert.

source: A typical household lightbulb can range from around 600 lumens to 1200 lumens. A candle is about 13 lumens, while a streetlight can be approximately 60000 lumens.
de: Eine typische Haushaltsglühbirne kann zwischen 600 und 1200 Lumen haben. Eine Kerze hat etwa 13 Lumen, während eine Straßenlaterne etwa 60000 Lumen haben kann.

source: **DirectionalLight3D intensity**
de: **Intensität von DirectionalLight3D**

source: Lux is a measure pf luminous flux per unit area, it is equal to one lumen per square metre. Lux is the measure of how much light hits a surface at a given time.
de: Lux ist ein Maß für den Lichtstrom pro Flächeneinheit, es entspricht einem Lumen pro Quadratmeter. Lux ist das Maß dafür, wie viel Licht in einer bestimmten Zeit auf eine Fläche trifft.

source: With DirectionalLight3D, on a clear sunny day, a surface in direct sunlight may receive approximately 100000 lux. A typical room in a home may receive approximately 50 lux, while the moonlit ground may receive approximately 0.1 lux.
de: Mit DirectionalLight3D kann eine Oberfläche im direkten Sonnenlicht an einem klaren, sonnigen Tag etwa 100000 Lux empfangen. Ein typischer Raum in einem Haus kann etwa 50 Lux empfangen, während der mondbeschienene Boden etwa 0,1 Lux empfangen kann.

source: **Color temperature**
de: **Farbtemperatur**

source: 6500 Kelvin is white. Higher values result in colder (bluer) colors, while lower values result in warmer (more orange) colors.
de: 6500 Kelvin ist weiß. Höhere Werte führen zu kälteren (blaueren) Farben, während niedrigere Werte zu wärmeren (mehr orangefarbenen) Farben führen.

source: The sun on a cloudy day is approximately 6500 Kelvin. On a clear day, the sun is between 5500 to 6000 Kelvin. On a clear day at sunrise or sunset, the sun ranges to around 1850 Kelvin.
de: Die Sonne hat an einem bewölkten Tag etwa 6500 Kelvin. An einem klaren Tag hat die Sonne zwischen 5500 und 6000 Kelvin. An einem klaren Tag bei Sonnenaufgang oder Sonnenuntergang liegt die Sonne bei etwa 1850 Kelvin.

source: Color temperature chart from 1,000 Kelvin (left) to 12,500 Kelvin (right)
de: Farbtemperaturtabelle von 1.000 Kelvin (links) bis 12.500 Kelvin (rechts)

source: Other Light3D properties such as **Energy** and **Color** remain editable for animation purposes, and when you occasionally need to create lights with non-realistic properties.
de: Andere Light3D Properties wie **Energie** und **Farbe** bleiben für Animationszwecke und für den Fall, dass Sie gelegentlich Lichter mit nicht-realistischen Eigenschaften erstellen müssen, editierbar.

source: Setting up physical camera units
de: Einrichten der physikalischen Kameraeinheiten

source: Physical camera units can be enabled separately from physical light units.
de: Physikalische Kameraeinheiten können getrennt von physikalischen Lichteinheiten aktiviert werden.

source: After adding a :ref:`class_CameraAttributesPhysical` resource to the **Camera Attributes** property of a Camera3D nodes, some properties such as **FOV** will no longer be editable. Instead, these properties are now governed by the CameraAttributesPhysical's properties, such as focal length and aperture.
de: Nach dem Hinzufügen einer :ref:`class_CameraAttributesPhysical`-Ressource zur **Camera Attributes**-Property eines Camera3D-Nodes werden einige Propertys wie **FOV** nicht mehr editierbar sein. Stattdessen werden diese Propertys nun von den Propertys der CameraAttributesPhysical bestimmt, wie z.B. Brennweite und Blende.

source: CameraAttributesPhysical offers the following properties in its **Frustum** section:
de: CameraAttributesPhysical bietet in seinem Abschnitt **Frustum** die folgenden Propertys:

source: **Focus Distance:** Distance from camera of object that will be in focus, measured in meters. Internally, this will be clamped to be at least 1 millimeter larger than the **Focal Length**.
de: **Fokusdistanz:** Entfernung des Objekts von der Kamera, das fokussiert werden soll, gemessen in Metern. Intern wird dieser Wert so festgelegt, dass er mindestens 1 Millimeter größer ist als die **Brennweite**.

source: **Focal Length:** Distance between camera lens and camera aperture, measured in millimeters. Controls field of view and depth of field. A larger focal length will result in a smaller field of view and a narrower depth of field meaning fewer objects will be in focus. A smaller focal length will result in a wider field of view and a larger depth of field, which means more objects will be in focus. This property overrides the Camera3D's **FOV** and **Keep Aspect** properties, making them read-only in the inspector.
de: **Brennweite:** Abstand zwischen Kameraobjektiv und Kamerablende, gemessen in Millimetern. Steuert das Sichtfeld und die Schärfentiefe. Eine größere Brennweite führt zu einem kleineren Sichtfeld und einer geringeren Schärfentiefe, was bedeutet, dass weniger Objekte scharf abgebildet werden. Eine kleinere Brennweite führt zu einem größeren Sichtfeld und einer größeren Schärfentiefe, was bedeutet, dass mehr Objekte scharf abgebildet werden. Diese Property setzt die Camera3D-Eigenschaften **FOV** und **Seitenverhältnis beibehalten** außer Kraft und macht sie im Inspektor schreibgeschützt.
