Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/physical_light_and_camera_units.po
Languages: de

source: **Near/Far:** The near and far clip distances in meters. These behave the same as the Camera3D properties of the same name. Lower **Near** values allow the camera to display objects that are very close, at the cost of potential precision (Z-fighting) issues in the distance. Higher **Far** values allow the camera to see further away, also at the cost of potential precision (Z-fighting) issues in the distance.
de: **Near/Far:** Die Nah- und Fern-Clipping-Distanz in Metern. Diese verhalten sich genauso wie die gleichnamigen Camera3D-Propertys. Niedrigere **Near**-Werte erlauben der Kamera, Objekte darzustellen, die sehr nah sind, auf Kosten von möglichen Präzisionsproblemen (Z-fighting) in der Ferne. Höhere **Far**-Werte ermöglichen es der Kamera, weiter entfernte Objekte zu sehen, auch auf Kosten möglicher Präzisionsprobleme (Z-Kampf) in der Entfernung.

source: The default focal length of 35 mm corresponds to a wide angle lens. It still results in a field of view that is noticeably narrower compared to the default "practical" vertical FOV of 75 degrees. This is because non-gaming use cases such as filmmaking and photography favor using a narrower field of view for a more cinematic appearance.
de: Die Default-Brennweite von 35 mm entspricht einem Weitwinkelobjektiv. Dennoch ist das Sichtfeld im Vergleich zum Default-"praktischen" vertikalen Sichtfeld von 75 Grad deutlich schmaler. Dies liegt daran, dass bei anderen Anwendungsfällen als Spielen, z. B. beim Filmen und Fotografieren, ein engeres Sichtfeld für ein filmischeres Aussehen bevorzugt wird.

source: Common focal length values used in filmmaking and photography are:
de: Gängige Brennweitenwerte beim Film und in der Fotografie sind:

source: **Fisheye (ultrawide angle):** Below 15 mm. Nearly no depth of field visible.
de: **Fisheye (Ultraweitwinkel):** Unter 15 mm. Nahezu keine Schärfentiefe sichtbar.

source: **Wide angle:** Between 15 mm and 50 mm. Reduced depth of field.
de: **Weitwinkel:** Zwischen 15 mm und 50 mm. Reduzierte Schärfentiefe.

source: **Standard:** Between 50 mm and 100 mm. Standard depth of field.
de: **Standard:** Zwischen 50 mm und 100 mm. Standard-Schärfentiefe.

source: **Telephoto:** Greater than 100 mm. Increased depth of field.
de: **Telefoto:** Größer als 100 mm. Erhöhte Schärfentiefe.

source: Like when using the **Keep Height** aspect mode, the effective field of view depends on the viewport's aspect ratio, with wider aspect ratios automatically resulting in a wider *horizontal* field of view.
de: Wie bei der Verwendung des Seitenverhältnis-Modus **Höhe beibehalten** hängt das effektive Field of View vom Seitenverhältnis des Viewports ab, wobei größere Seitenverhältnisse automatisch zu einem größeren *horizontalen* Field of View führen.

source: Automatic exposure adjustment based on the camera's average brightness level can also be enabled in the **Auto Exposure** section, with the following properties:
de: Die automatische Belichtungsanpassung auf der Grundlage der durchschnittlichen Helligkeit der Kamera kann auch im Abschnitt **Automatische Belichtung** mit den folgenden Propertys aktiviert werden:

source: **Min Sensitivity:** The darkest brightness the camera is allowed to get to, measured in EV100.
de: **Min. Sensitivität:** Die niedrigste Helligkeit, die von der Kamera erreicht werden kann, gemessen in EV100.

source: **Max Sensitivity:** The brightest the camera is allowed to get to, measured in EV100.
de: **Max. Sensitivität:** Die höchste Helligkeit, die von der Kamera erreichen werden kann, gemessen in EV100.

source: **Speed:** The speed of the auto exposure effect. Affects the time needed for the camera to perform auto exposure. Higher values allow for faster transitions, but the resulting adjustments may look distracting depending on the scene.
de: **Geschwindigkeit:** Die Geschwindigkeit des automatischen Belichtungseffekts. Beeinflusst die Zeit der Kamera, um die automatische Belichtung durchzuführen. Höhere Werte ermöglichen schnellere Übergänge, aber die daraus resultierenden Anpassungen können je nach Szene störend wirken.

source: **Scale:** The scale of the auto exposure effect. Affects the intensity of auto exposure.
de: **Skalierung:** Die Skalierung für den automatischen Belichtungseffekt. Beeinflusst die Intensität der automatischen Belichtung.

source: EV100 is an exposure value (EV) measured at an ISO sensitivity of 100. See `this table <https://en.wikipedia.org/wiki/Exposure_value#Tabulated_exposure_values>`__ for common EV100 values found in real life.
de: EV100 ist ein Belichtungswert (EV), der bei einer ISO-Empfindlichkeit von 100 gemessen wird. In `dieser Tabelle <https://en.wikipedia.org/wiki/Exposure_value#Tabulated_exposure_values>`__ finden Sie gängige EV100-Werte aus der echten Welt.

source: Translation status
de: Übersetzungsstatus
