Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_decals.po
Languages: de, zh_cn

source: The way decals are rendered also has an impact on performance. The **Rendering > Textures > Decals > Filter** advanced project setting lets you control how decal textures should be filtered. **Nearest/Linear** does not use mipmaps. However, decals will look grainy at a distance. **Nearest/Linear Mipmaps** will look smoother at a distance, but decals will look blurry when viewed from oblique angles. This can be resolved by using **Nearest/Linear Mipmaps Anisotropic**, which provides the highest quality but is also slower to render.
de: Die Art und Weise, wie Decals gerendert werden, wirkt sich ebenfalls auf die Performance aus. Mit der erweiterten Projekteinstellung **Rendern > Texturen > Decals > Filter** können Sie steuern, wie Decal-Texturen gefiltert werden sollen. Bei **Nearest/Linear** werden keine Mipmaps verwendet. Allerdings sehen Decals aus der Entfernung körnig aus. **Nearest/Linear Mipmaps** sieht aus der Entfernung glatter aus, aber die Decals sehen aus schrägen Winkeln unscharf aus. Dies kann durch die Verwendung von **Nearest/Linear Mipmaps Anisotropic** gelöst werden, welches die höchste Qualität bietet, aber auch langsamer gerendert wird.
zh_cn: 贴花的渲染方式也会对性能产生影响。 **渲染 > 纹理 > 贴花 > 过滤** 高级项目设置可让你控制如何过滤贴花纹理。 **Nearest/Linear** 不使用 mipmap。 然而，贴花在远处看起来会有颗粒感。 **Nearest/Linear Mipmaps** 在远处看起来会更平滑，但从倾斜角度观看时贴花会看起来模糊。 这可以通过使用 **Nearest/Linear Mipmaps Anisotropic** 来解决，它提供最高的质量，但渲染速度也较慢。

source: If your project has a pixel art style, consider setting the filter to one of the **Nearest** values so that decals use nearest-neighbor filtering. Otherwise, stick to **Linear**.
de: Wenn Ihr Projekt einen Pixel-Art-Stil hat, sollten Sie den Filter auf einen der Werte **Nearest** einstellen, damit die Decals Nearest-Neighbor-Filtering verwenden. Bleiben Sie ansonsten bei **Linear**.
zh_cn: 如果你的项目具有像素艺术风格，请考虑将过滤设置为 **Nearest** 值之一（即具有 Nearest 属性的任意一个过滤），以便贴花使用最近邻过滤（nearest-neighbor filtering）。 否则，请继续使用 **Linear** 。

source: Limitations
de: Einschränkungen
zh_cn: 限制

source: Decals cannot affect material properties other than the ones listed above, such as height (for parallax mapping).
de: Decals können keine anderen als die oben aufgeführten Materialeigenschaften beeinflussen, wie z. B. die Höhe (für Parallax-Mapping).
zh_cn: 贴图不能影响除上面列出的材质特性之外的材质特性，例如高度（用于视差贴图）。

source: For performance reasons, decals use purely fixed rendering logic. This means decals cannot use custom shaders. However, custom shaders on the projected surfaces are able to read the information that is overridden by decals on top of them, such as roughness and metallic.
de: Aus Leistungsgründen verwenden Decals eine feste Rendering-Logik. Das bedeutet, dass Decals keine benutzerdefinierten Shader verwenden können. Benutzerdefinierte Shader auf den projizierten Oberflächen sind jedoch in der Lage, die Informationen zu lesen, die von den darüber liegenden Decals überschrieben werden, z. B. Rauheit und Metallisch.
zh_cn: 出于性能方面的考虑，贴花使用的是完全固定的渲染逻辑，也就是说贴花无法使用自定义着色器。然而，投影面上的自定义着色器能够读取被贴花覆盖的信息，例如表面的粗糙度和金属性。

source: When using the Forward+ renderer, Godot uses a *clustering* approach for decal rendering. As many decals as desired can be added (as long as performance allows). However, there's still a default limit of 512 *clustered elements* that can be present in the current camera view. A clustered element is an omni light, a spot light, a :ref:`decal <doc_using_decals>` or a :ref:`reflection probe <doc_reflection_probes>`. This limit can be increased by adjusting the **Rendering > Limits > Cluster Builder > Max Clustered Elements** advanced project setting.
de: Bei Verwendung des Forward+-Renderers verwendet Godot einen *Cluster*-Ansatz für die Darstellung von Decals. Es können so viele Decals wie gewünscht hinzugefügt werden (solange es die Leistung zulässt). Es gibt jedoch immer noch eine Standardgrenze von 512 *Cluster-Elementen*, die im aktuellen Kamera-View vorhanden sein können. Ein Clusterelement ist ein Omni-Licht, ein Spotlicht, ein :ref:`Decal <doc_using_decals>` oder eine :ref:`Reflexions-Probe <doc_reflection_probes>`. Diese Grenze kann durch Anpassen der erweiterten Projekteinstellung **Rendern > Limits > Cluster Builder > Max. geclusterte Elements** erhöht werden.
zh_cn: 在使用 Forward+ 渲染器时，Godot 采用 *集群* 方法进行贴花渲染。只要性能允许，可以添加任意数量的贴花。不过，默认情况下，当前摄像机视图中的 *集群元素* 上限仍为 512 个。集群元素是指全向灯、聚光灯、 :ref:`贴花 <doc_using_decals>` 或 :ref:`反射探针 <doc_reflection_probes>`。可以通过调整 "**渲染 > 限制 > 群集生成器 > 最大群集元素**"高级项目设置来增加此限制。

source: When using the Forward Mobile backend, only 8 decals can be applied on each individual Mesh *resource*. If there are more decals affecting a single mesh, not all of them will be rendered on the mesh.
de: Wenn Sie das Forward Mobile-Backend verwenden, können nur 8 Decals auf jede einzelne Mesh *Ressource* angewendet werden. Wenn ein einzelnes Mesh von mehr Decals betroffen ist, werden nicht alle auf dem Mesh gerendert.
zh_cn: 在使用 Forward 移动后端时，每个单独的 Mesh *资源* 上只能应用 8 个贴花。如果有更多贴花影响单个网格，则并非所有贴花都会渲染在网格上。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
