Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_decals.po
Languages: de, zh_cn

source: Using decals
de: Verwenden von Decals
zh_cn: 使用贴花

source: Decals are only supported in the Clustered Forward and Forward Mobile rendering backends, not the Compatibility backend.
de: Decals werden nur in den Rendering-Backends Clustered Forward und Forward Mobile unterstützt, nicht im Kompatibilität-Backend.
zh_cn: 贴花仅在集群Forward 和 Forward Mobile 渲染后端中受支持，在兼容性后端中则不受支持。

source: If using the Compatibility backend, consider using Sprite3D as an alternative for projecting decals onto (mostly) flat surfaces.
de: Wenn Sie das Kompatibilität-Backend verwenden, sollten Sie Sprite3D als Alternative für die Projektion von Decals auf (meist) flache Oberflächen in Betracht ziehen.
zh_cn: 如果使用兼容性后端，请考虑使用 Sprite3D 作为将贴花投影到（大部分）平坦表面的替代方案。

source: Decals are projected textures that apply on opaque or transparent surfaces in 3D. This projection happens in real-time and doesn't rely on mesh generation. This allows you to move decals every frame with only a small performance impact, even when applied on complex meshes.
de: Decals sind projizierte Texturen, die auf undurchsichtige oder transparente Oberflächen in 3D aufgebracht werden. Diese Projektion erfolgt in Echtzeit und ist nicht von der Mesh-Generierung abhängig. So können Sie Decals bei jedem Frame mit nur geringen Leistungseinbußen verschieben, selbst wenn sie auf komplexe Meshes angewendet werden.
zh_cn: 贴花是应用于 3D 不透明或透明表面的投影纹理。 该投影是实时生成的，不依赖于网格生成。 这允许你在每一帧移动贴花，即使在复杂的网格上应用时，也只会对性能产生很小的影响。

source: While decals cannot add actual geometry detail onto the projected surface, decals can still make use of physically-based rendering to provide similar properties to full-blown :abbr:`PBR (Physically-Based Rendering)` materials.
de: Decals können zwar keine tatsächlichen Geometriedetails auf der projizierten Oberfläche hinzufügen, aber Decals können das physikalisch basierte Rendering nutzen, um ähnliche Eigenschaften wie vollwertige :abbr:`PBR (Physically-Based Rendering)`-Materialien zu bieten.
zh_cn: 虽然贴花无法将实际的几何细节添加到投影表面上，但贴花仍然可以利用基于物理的渲染来提供与完整的 :abbr:`PBR (Physically-Based Rendering)`材质类似的属性。

source: On this page, you'll learn:
de: Auf dieser Seite erfahren Sie:
zh_cn: 你会在这个页面中学习到：

source: How to set up decals in the 3D editor.
de: Wie man Decals im 3D-Editor einrichtet.
zh_cn: 如何在 3D 编辑器中设置贴花。

source: How to create decals during gameplay in a 3D scene (such as bullet impacts).
de: Wie man Decals während des Spiels in einer 3D-Szene erstellt (z. B. Geschosseinschläge).
zh_cn: 如何在游戏过程中为 3D 场景创建贴花（例如弹孔）。

source: How to balance decal configuration between performance and quality.
de: Wie man bei der Konfiguration von Decals ein Gleichgewicht zwischen Performance und Qualität findet.
zh_cn: 如何为贴花的配置进行性能和质量之间的平衡。

source: The Godot demo projects repository contains a `3D decals demo <https://github.com/godotengine/godot-demo-projects/tree/4.0-dev/3d/decals>`__.
de: Das Godot-Demoprojekt-Repository enthält eine `3D-Decals-Demo <https://github.com/godotengine/godot-demo-projects/tree/4.0-dev/3d/decals>`__.
zh_cn: 如果想要参考一个示例项目, 可以参考该OS测试demo:https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test。

source: If you're looking to write arbitrary 3D text on top of a surface, use :ref:`doc_3d_text` placed close to a surface instead of a Decal node.
de: Wenn Sie einen beliebigen 3D-Text auf eine Oberfläche schreiben wollen, verwenden Sie :ref:`doc_3d_text`, der in der Nähe einer Oberfläche platziert wird, anstatt eines Decal Nodes.
zh_cn: 如果你想在表面上写入任意 3D 文本，请使用靠近表面放置的 :ref:`doc_3d_text` 而不是贴花节点。

source: Use cases
de: Anwendungsfälle
zh_cn: 使用案例

source: Static decoration
de: Statische Dekoration
zh_cn: 静态装饰

source: Sometimes, the fastest way to add texture detail to a scene is to use decals. This is especially the case for organic detail, such as patches of dirt or sand scattered on a large surface. Decals can help break up texture repetition in scenes and make patterns look more natural. On a smaller scale, decals can also be used to create detail variations for objects. For example, decals can be used to add nuts and bolts on top of hard-surface geometry.
de: Manchmal ist der schnellste Weg, einer Szene Texturdetails hinzuzufügen, die Verwendung von Decals. Dies gilt insbesondere für organische Details, wie z. B. Schmutz- oder Sandflecken, die auf einer großen Fläche verstreut sind. Decals können dazu beitragen, die Wiederholung von Texturen in Szenen aufzubrechen und Muster natürlicher aussehen zu lassen. In kleinerem Maßstab können Decals auch verwendet werden, um Detailvariationen für Objekte zu erstellen. Mit Decals lassen sich zum Beispiel Schrauben und Muttern auf einer harten Oberflächen-Geometrie anbringen.
zh_cn: 有时，向场景添加纹理细节的最快方法是使用贴花。 对于有机细节（organic detail）尤其如此，例如散布在大表面上的污垢或沙子。 贴花可以帮助打破场景中的纹理重复，并使图案看起来更自然。 在较小的规模上，贴花也可用于创建对象的细节变化。 例如，贴花可用于在硬表面几何体（hard-surface geometry）顶部添加螺母和螺栓。

source: Since decals can inject their own :abbr:`PBR (Physically-Based Rendering)` properties on top of the projected surfaces, they can also be used to create footprints or wet puddles.
de: Da Decals ihre eigenen :abbr:`PBR (Physically-Based Rendering)`-Eigenschaften auf die projizierten Oberflächen aufbringen können, lassen sich mit ihnen auch Fußabdrücke oder nasse Pfützen erzeugen.
zh_cn: 由于贴花可以在投影表面上注入自己的 :abbr:`PBR (Physically-Based Rendering)` 属性，因此它们也可以用于创建足迹或湿水坑。

source: Dirt added on top of level geometry using decals
de: Mit Decals auf die Level-Geometrie aufgetragene Verschmutzung
zh_cn: 使用贴花在关卡几何体（ level geometry ）顶部添加污垢

source: Dynamic gameplay elements
de: Dynamische Gameplay-Elemente
zh_cn: 动态游戏元素

source: Decals can represent temporary or persistent gameplay effects such as bullet impacts and explosion scorches.
de: Decals können temporäre oder dauerhafte Spieleffekte darstellen, wie z. B. Einschläge von Kugeln oder Brandflecken von Explosionen.
zh_cn: 贴花可以展现暂时或持久的游戏特效，例如子弹撞击和爆炸烧焦。

source: Using an AnimationPlayer node or a script, decals can be made to fade over time (and then be removed using ``queue_free()``) to improve performance.
de: Mit einem AnimationPlayer-Node oder einem Skript können Decals mit der Zeit verblassen (und dann mit ``queue_free()`` entfernt werden), um die Performance zu verbessern.
zh_cn: 使用 AnimationPlayer 节点或脚本，可以使贴花随着时间的推移而褪色（然后使用 ``queue_free()`` 删除）以提高性能。

source: Blob shadows
de: Blob-Schatten
zh_cn: 片面阴影

source: Blob shadows are frequently used in mobile projects (or to follow a retro art style), as real-time lighting tends to be too expensive on low-end mobile devices. However, when relying on baked lightmaps with fully baked lights, dynamic objects will not cast *any* shadow from those lights. This makes dynamic objects in lightmapped scenes look flat in comparison to real-time lighting, with dynamic objects almost looking like they're floating.
de: Blob-Schatten werden häufig in Projekten für mobile Geräte verwendet (oder um einen Retro-Art-Stil zu erreichen), da Echtzeit-Beleuchtung auf Low-End-Mobilgeräten tendenziell zu teuer ist. Wenn Sie sich jedoch auf gebackene Lightmaps mit vollständig gebackenen Lichtern verlassen, werfen dynamische Objekte *keinen* Schatten von diesen Lichtern. Dadurch sehen dynamische Objekte in Lightmapping-Szenen im Vergleich zur Echtzeit-Beleuchtung flach aus, und dynamische Objekte sehen fast so aus, als würden sie schweben.
zh_cn: 斑点阴影经常用于移动项目（或遵循复古艺术风格），因为实时照明在低端移动设备上往往耗费过大。 但是，当依赖具有完全烘焙灯光的烘焙光照贴图时，动态对象不会从这些灯光投射 *任何* 阴影。 与实时光照相比，这使得光照贴图场景中的动态对象看起来很平坦，动态对象几乎看起来像是漂浮的。

source: Thanks to blob shadows, dynamic objects can still cast an approximative shadow. Not only this helps with depth perception in the scene, but this can also be a gameplay element, especially in 3D platformers. The blob shadow's length can be extended to let the player know where they will land if they fall straight down.
de: Mithilfe von Blob-Schatten können dynamische Objekte dennoch einen annähernden Schatten werfen. Dies hilft nicht nur bei der Tiefenwahrnehmung in der Szene, sondern kann auch ein Gameplay-Element sein, insbesondere in 3D-Plattformern. Die Länge des Blob-Schatten kann verlängert werden, damit der Spieler weiß, wo er landen wird, wenn er gerade herunterfällt.
zh_cn: 由于斑点阴影，动态对象仍然可以投射近似阴影。 这不仅有助于场景中的深度感知，而且还可以成为一种游戏元素，尤其是在 3D 平台游戏中。 斑点阴影的长度可以延长，让玩家知道如果他们垂直落下时自己会落在哪里。

source: Even with real-time lighting, blob shadows can still be useful as a form of ambient occlusion for situations where SSAO is too expensive or too unstable due to its screen-space nature. For example, vehicles' underside shadows are well-represented using blob shadows.
de: Selbst bei Echtzeit-Beleuchtung können Blob-Schatten als eine Form der Umgebungsschattierung in Situationen nützlich sein, in denen SSAO zu teuer oder zu instabil ist, da es sich um einen Bildschirmschatten handelt. Zum Beispiel werden die Schatten der Unterseite von Fahrzeugen durch Blob-Schatten gut dargestellt.
zh_cn: 即使使用实时光照，斑点阴影仍然可以作为环境光遮挡的一种形式，适用于 SSAO 由于其屏幕空间性质而消耗过大或过于不稳定的情况。 例如，使用斑点阴影很好地表现了车辆的底部阴影。

source: Blob shadow under object comparison
de: Blob-Schatten unter Objektvergleich
zh_cn: 对象比较下的斑点阴影

source: Quick start guide
de: Schnellstart-Anleitung
zh_cn: 快速入门指南

source: Creating decals in the editor
de: Erstellen von Decals im Editor
zh_cn: 在编辑器中创建贴花

source: Create a Decal node in the 3D editor.
de: Erstellen Sie einen Decal-Node im 3D-Editor.
zh_cn: 在 3D 编辑器中创建贴花节点。

source: In the inspector, expand the **Textures** section and load a texture in **Textures > Albedo**.
de: Erweitern Sie im Inspektor den Bereich **Texturen** und laden Sie unter **Texturen > Albedo** eine Textur.
zh_cn: 在检查器中，展开 **Textures** 部分并在 **Textures > Albedo** 中加载纹理。

source: Move the Decal node towards an object, then rotate it so the decal is visible (and in the right orientation). If the decal appears mirrored, try to rotate it by 180 degrees. You can double-check whether it's in the right orientation by increasing **Parameters > Normal Fade** to 0.5. This will prevent the Decal from being projected on surfaces that are not facing the decal.
de: Bewegen Sie den Decal-Node in Richtung eines Objekts und drehen Sie ihn dann so, dass das Decal sichtbar ist (und die richtige Ausrichtung hat). Wenn das Decals gespiegelt erscheint, versuchen Sie, es um 180 Grad zu drehen. Sie können überprüfen, ob das Decal richtig ausgerichtet ist, indem Sie **Parameter > Normalen-Fading** auf 0,5 erhöhen. Dadurch wird verhindert, dass das Decal auf Oberflächen projiziert wird, die nicht auf das Decal ausgerichtet sind.
zh_cn: 将贴花节点移向对象，然后旋转它以使贴花可见（并且方向正确）。 如果贴花看起来是镜像的，请尝试将其旋转 180 度。 你可以通过将 **Parameters > Normal Fade** 增加到 0.5 来仔细检查其方向是否正确。 这将防止贴花投影到不面向贴花的表面上。

source: If your decal is meant to affect static objects only, configure it to prevent affecting dynamic objects (or vice versa). To do so, change the decal's **Cull Mask** property to exclude certain layers. After doing this, modify your dynamic objects' MeshInstance3D nodes to change their visibility layers. For instance, you can move them from layer 1 to layer 2, then disable layer 2 in the decal's **Cull Mask** property.
de: Wenn Ihr Decal nur statische Objekte beeinflussen soll, konfigurieren Sie es so, dass es dynamische Objekte nicht beeinflusst (oder umgekehrt). Ändern Sie dazu die Property **Cull Maske** des Decals, um bestimmte Ebenen auszuschließen. Ändern Sie anschließend die Nodes Ihrer dynamischen Objekte in MeshInstance3D, um ihre Sichtbarkeitsebenen zu ändern. Sie können sie zum Beispiel von Ebene 1 auf Ebene 2 verschieben und dann Ebene 2 in der **Cull Maske**-Property des Decals deaktivieren.
zh_cn: 如果你的贴花仅影响静态对象，请将其配置为防止影响动态对象（反之亦然）。 为此，请更改贴花的 **Cull Mask** （剔除蒙版）属性以排除某些图层。 执行此操作后，修改动态对象的 MeshInstance3D 节点以更改其可见性层。 例如，你可以将它们从第 1 层移动到第 2 层，然后在贴花的 **Cull Mask** 属性中禁用第 2 层。

source: Decal node properties
de: Decal-Node-Propertys
zh_cn: 贴花节点属性

source: **Extents:** The size of the decal. The Y axis determines the length of the decal's projection. Keep the projection length as short as possible to improve culling opportunities, therefore improving performance.
de: **Ausmaße:** Die Größe des Decals. Die Y-Achse bestimmt die Länge der Projektion des Decals. Halten Sie die Projektionslänge so kurz wie möglich, um die Auslesemöglichkeiten und damit die Performance zu verbessern.
zh_cn: **Extents：** （范围）贴花的大小。 Y 轴决定贴花投影的长度。 保持投影长度尽可能短，以增加剔除机会，从而提高性能。

source: Textures
de: Texturen
zh_cn: 纹理

source: **Albedo:** The albedo (diffuse/color) map to use for the decal. In most situations, this is the texture you want to set first. If using a normal or ORM map, an albedo map *must* be set to provide an alpha channel. This alpha channel will be used as a mask to determine how much the normal/ORM maps will affect the underlying surface.
de: **Albedo:** Die Albedo-Map (Diffus/Farbe), die für das Decal verwendet werden soll. In den meisten Fällen ist dies die Textur, die Sie zuerst festlegen möchten. Wenn Sie eine Normal- oder ORM-Map verwenden, *muss* eine Albedo-Map eingestellt werden, um einen Alphakanal zu erhalten. Dieser Alphakanal wird als Maske verwendet, um zu bestimmen, wie stark die Normal-/ORM-Maps die darunter liegende Oberfläche beeinflussen.
zh_cn: **Albedo：** （反照率）用于贴花的反照率（漫反射/颜色）贴图。 在大多数情况下，这是你要首先设置的纹理。 如果使用法线或 ORM 贴图，则 *必须* 设置反照率贴图以提供 Alpha 通道。 该 Alpha 通道将用作遮罩，以确定法线/ORM 贴图对底层表面的影响程度。

source: **Normal:** The normal map to use for the decal. This can be used to increase perceived detail on the decal by modifying how light reacts to it. The impact of this texture is multiplied by the albedo texture's alpha channel (but not **Albedo Mix**).
de: **Normal:** Die für das Decal zu verwendende Normal Map. Sie kann verwendet werden, um die Detailgenauigkeit des Decals zu erhöhen, indem die Reaktion des Lichts auf das Decal verändert wird. Die Wirkung dieser Textur wird mit dem Alpha-Kanal der Albedo-Textur multipliziert (jedoch nicht mit **Albedo Mix**).
zh_cn: **Normal：** （法线）用于贴花的法线贴图。 这可用于通过修改光对其的反应方式来增加贴花上的感知细节。 该纹理的影响会乘以反照率纹理的 Alpha 通道（但不是 **Albedo Mix** ）。

source: **ORM:** The Occlusion/Roughness/Metallic map to use for the decal. This is an optimized format for storing PBR material maps. Ambient Occlusion map is stored in the red channel, roughness map in the green channel, metallic map in the blue channel. The impact of this texture is multiplied by the albedo texture's alpha channel (but not **Albedo Mix**).
de: **ORM:** Die Occlusion/Rauheit/Metallisch Map, die für das Decal verwendet werden soll. Dies ist ein optimiertes Format für die Speicherung von PBR-Materialkarten. Die Ambient Occlusion-Map wird im roten Kanal gespeichert, die Rauhigkeitskarte im grünen Kanal, die Metallisch-Map im blauen Kanal. Die Wirkung dieser Textur wird mit dem Alpha-Kanal der Albedo-Textur multipliziert (jedoch nicht mit **Albedo Mix**).
zh_cn: **ORM：** 用于贴花的遮挡（Occlusion）/粗糙度（Roughness）/金属贴图（Metallic map）。 这是用于存储 PBR 材质贴图的优化格式。 环境光遮挡贴图存储在红色通道中，粗糙度贴图存储在绿色通道中，金属贴图存储在蓝色通道中。 该纹理的影响会乘以反照率纹理的 Alpha 通道（但不是 **Albedo Mix** ）。

source: **Emission:** The emission texture to use for the decal. Unlike **Albedo**, this texture will appear to glow in the dark.
de: **Emission:** Die für das Decal zu verwendende Emissionstextur. Im Gegensatz zu **Albedo** scheint diese Textur im Dunkeln zu leuchten.
zh_cn: **Emission：** （自发光）用于贴花的自发光纹理。与 **Albedo** 不同，此纹理看起来会在黑暗中发光。

source: Parameters
de: Parameter
zh_cn: 参数

source: **Emission Energy:** The brightness of the emission texture.
de: **Emissionsenergie:** Die Helligkeit der Emissionstextur.
zh_cn: **Emission Energy：** （自发光能量）自发光纹理的亮度。

source: **Modulate:** Multiplies the color of the albedo and emission textures. Use this to tint decals (e.g. for paint decals, or to increase variation by randomizing each decal's modulation).
de: **Modulieren:** Multipliziert die Farbe der Albedo- und Emissionstexturen. Verwenden Sie dies, um Decals zu färben (z.B. für Farbdecals, oder um die Variation zu erhöhen, indem Sie die Modulation jedes Decals zufällig wählen).
zh_cn: **Modulate：** （调制）将反射率和自发光贴图的颜色相乘。通过这种方式对贴花进行着色（例如，对于绘画贴花）或通过随机化每个贴花的调制来增加多样性。

source: **Albedo Mix:** The opacity of the albedo texture. Unlike using an albedo texture with a more transparent alpha channel, decreasing this value below ``1.0`` does *not* reduce the impact of the normal/ORM texture on the underlying surface. Set this to ``0.0`` when creating normal/ORM-only decals such as footsteps or wet puddles.
de: **Albedo Mix:** Die Deckkraft der Albedo-Textur. Im Gegensatz zur Verwendung einer Albedo-Textur mit einem transparenteren Alphakanal, reduziert eine Verringerung dieses Wertes unter ``1.0`` *nicht* die Auswirkung der Normal/ORM-Textur auf die darunterliegende Oberfläche. Setzen Sie diesen Wert auf ``0.0``, wenn Sie Decals erstellen, die nur normal/ORM-Texturen enthalten, wie z.B. Fußstapfen oder nasse Pfützen.
zh_cn: **Albedo Mix：** （反照率混合）反照率纹理的不透明度。与使用具有更透明 alpha 通道的反照率纹理不同，将该值降低到 ``1.0`` 以下 *不会* 减少法线/ORM 纹理对下表面的影响。在创建仅普通/ORM 贴花（如足迹或湿水坑）时，将此值设置为 ``0.0`` 。

source: **Normal Fade:** Fades the Decal if the angle between the Decal's :abbr:`AABB (Axis-Aligned Bounding Box)` and the target surface becomes too large. A value of ``0.0`` projects the decal regardless of angle, while a value of ``0.999`` limits the decal to surfaces that are nearly perpendicular. Setting **Normal Fade** to a value greater than ``0.0`` has a small performance cost due to the added normal angle computations.
de: **Normalen-Fading:** Blendet das Decal aus, wenn der Winkel zwischen der :abbr:`AABB (Axis-Aligned Bounding Box)` des Decals und der Zielfläche zu groß wird. Ein Wert von ``0.0`` projiziert das Decal unabhängig vom Winkel, während ein Wert von ``0.999`` das Decal auf Oberflächen begrenzt, die nahezu senkrecht sind. Die Einstellung **Normalen-Fading** auf einen Wert größer als ``0.0`` hat einen kleinen Leistungsverlust durch die zusätzlichen Berechnungen des Normalwinkels zur Folge.
zh_cn: **Normal Fade：** （法线衰减）当贴花的 :abbr:`AABB (Axis-Aligned Bounding Box, 轴对齐边界框)`与目标表面之间的角度变得过大时，贴花将会淡出。值为 ``0.0`` 时，不管角度如何都会投影出贴花，而值为 ``0.999`` 时，贴花将仅限于几乎垂直的表面。由于额外的法线角度计算，将 **Normal Fade** 设置为大于 ``0.0`` 的值会带来一些性能损耗。

source: Vertical Fade
de: Vertikales Fading
zh_cn: 垂直淡化（Vertical Fade）

source: **Upper Fade:** The curve over which the decal will fade as the surface gets further from the center of the :abbr:`AABB (Axis-Aligned Bounding Box)` (towards the decal's projection angle). Only positive values are valid.
de: **Oberes Fading:** Die Kurve, über die das Decal verblasst, wenn sich die Oberfläche weiter von der Mitte der :abbr:`AABB (Axis-Aligned Bounding Box)` entfernt (in Richtung des Projektionswinkels des Decals). Nur positive Werte sind gültig.
zh_cn: **Upper Fade：** （上部淡化）随着表面远离 :abbr:`AABB (Axis-Aligned Bounding Box 轴对齐边界框)`中心（朝向贴花的投影角），贴花将逐渐淡出的曲线。 只有正值才有效。

source: **Lower Fade:** The curve over which the decal will fade as the surface gets further from the center of the :abbr:`AABB (Axis-Aligned Bounding Box)` (away from the decal's projection angle). Only positive values are valid.
de: **Unteres Fading:** Die Kurve, über die das Decal verblasst, wenn sich die Oberfläche weiter vom Zentrum der :abbr:`AABB (Axis-Aligned Bounding Box)` (weg vom Projektionswinkel des Decals) entfernt. Nur positive Werte sind gültig.
zh_cn: **Lower Fade：** （下部淡化）随着表面远离 :abbr:`AABB (Axis-Aligned Bounding Box, 轴对齐边界框)`中心（远离贴花的投影角），贴花将逐渐淡出的曲线。 只有正值才有效。

source: Distance Fade
de: Fern-Fading
zh_cn: 距离淡出

source: **Enabled:** Controls whether distance fade (a form of :abbr:`LOD (Level of Detail)`) is enabled. The decal will fade out over **Begin + Length**, after which it will be culled and not sent to the shader at all. Use this to reduce the number of active decals in a scene and thus improve performance.
de: **Aktiviert:** Legt fest, ob die das Fern-Fading (eine Form von :abbr:`LOD (Level of Detail)`) aktiviert ist. Das Decal wird über **Beginn + Länge** ausgeblendet, danach wird es aussortiert und nicht mehr an den Shader gesendet. Verwenden Sie dies, um die Anzahl der aktiven Decals in einer Szene zu reduzieren und so die Performance zu verbessern.
zh_cn: **Enabled（启用）：**\ 控制是否启用距离淡出（\ :abbr:`LOD (Level of Detail)` 的一种形式）。 贴花将在 **Begin + Length** 内淡出，之后它将被剔除并且根本不会发送到着色器。 使用它可以减少场景中活动贴花的数量，从而提高性能。

source: **Begin:** The distance from the camera at which the decal begins to fade away (in 3D units).
de: **Beginn:** Die Entfernung von der Kamera, bei der das Decal zu verblassen beginnt (in 3D-Einheiten).
zh_cn: **Begin：** （开始）贴花开始淡出时距相机的距离（以 3D 单位表示）。

source: **Length:** The distance over which the decal fades (in 3D units). The decal becomes slowly more transparent over this distance and is completely invisible at the end. Higher values result in a smoother fade-out transition, which is more suited when the camera moves fast.
de: **Länge:** Die Entfernung, über die das Decals verblasst (in 3D-Einheiten). Das Decal wird über diese Strecke langsam transparenter und ist am Ende komplett unsichtbar. Höhere Werte bewirken einen sanfteren Fade-Out-Übergang, der besser geeignet ist, wenn sich die Kamera schnell bewegt.
zh_cn: **Length：** （长度）贴花淡出的距离（以 3D 单位表示）。 贴花在这段距离内逐渐变得透明，最后完全不可见。 值越高，淡出过渡越平滑，这在相机快速移动时更适合。

source: Cull Mask
de: Cull-Maske
zh_cn: Cull Mask（剔除遮罩）

source: **Cull Mask:** Specifies which VisualInstance3D layers this decal will project on. By default, decals affect all layers. This is used so you can specify which types of objects receive the decal and which do not. This is especially useful so you can ensure that dynamic objects don't accidentally receive a Decal intended for the terrain under them.
de: **Cull-Maske:** Gibt an, auf welche VisualInstance3D-Ebenen dieses Decal projiziert wird. Standardmäßig wirken sich Decals auf alle Ebenen aus. Damit können Sie festlegen, welche Arten von Objekten das Decal erhalten und welche nicht. Dies ist besonders nützlich, um sicherzustellen, dass dynamische Objekte nicht versehentlich ein Decal erhalten, das für das Terrain unter ihnen bestimmt ist.
zh_cn: **Cull Mask：** （剔除遮罩）指定此贴花将投影到哪些 VisualInstance3D 图层。 默认情况下，贴花会影响所有图层。 使用它可以指定哪些类型的对象接收贴花，哪些类型不接收贴花。 这个功能特别有用，你可以确保动态对象不会意外收到针对其下方地形的贴花。

source: Tweaking performance and quality
de: Optimierung von Leistung und Qualität
zh_cn: 调整性能和质量

source: Decal rendering performance is mostly determined by their screen coverage, but also their number. In general, a few large decals that cover up most of the screen will be more expensive to render than many small decals that are scattered around.
de: Die Render-Performance von Decals hängt hauptsächlich von ihrer Bildschirmabdeckung ab, aber auch von ihrer Anzahl. Im Allgemeinen sind einige große Decals, die den größten Teil des Bildschirms abdecken, teurer zu rendern als viele kleine Decals, die über den Bildschirm verstreut sind.
zh_cn: 贴花渲染性能主要取决于其屏幕覆盖范围及其数量。 一般来说，覆盖大部分屏幕的一些大贴花的渲染消耗，会比散布在各处的许多小贴花的渲染消耗更高。

source: To improve rendering performance, you can enable the **Distance Fade** property as described above. This will make distant decals fade out when they are far away from the camera (and may have little to no impact on the final scene rendering). Using node groups, you can also prevent non-essential decorative decals from spawning based on user configuration.
de: Um die Render-Performance zu verbessern, können Sie, wie oben beschrieben, die Property **Fern-Fading** aktivieren. Dadurch werden weit entfernte Decals ausgeblendet, wenn sie sich weit von der Kamera entfernt befinden (und haben möglicherweise nur geringe oder gar keine Auswirkungen auf das endgültige Rendern der Szene). Mit Hilfe von Node-Gruppen können Sie auch verhindern, dass nicht benötigte dekorative Decals basierend auf einer Benutzerkonfiguration erscheinen.
zh_cn: 要提高渲染性能，你可以如上所述启用 **Distance Fade** 属性。 这将使远处的贴花在远离相机时淡出（并且可能对最终场景渲染几乎没有影响）。 使用节点组，你还可以根据用户配置防止生成非必要的装饰贴花。
