Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_gridmaps.po
Languages: de

source: Using GridMaps
de: Verwenden von GridMaps

source: Introduction
de: Einführung

source: :ref:`Gridmaps <class_GridMap>` are a tool for creating 3D game levels, similar to the way :ref:`TileMap <doc_using_tilemaps>` works in 2D. You start with a predefined collection of 3D meshes (a :ref:`class_MeshLibrary`) that can be placed on a grid, as if you were building a level with an unlimited amount of Lego blocks.
de: :ref:`Gridmaps <class_GridMap>` sind ein Tool zum Erstellen von 3D-Spiel-Levels, ähnlich wie :ref:`TileMap <doc_using_tilemaps>` in 2D. Sie beginnen mit einer vordefinierten Sammlung von 3D-Meshes (:ref:`class_MeshLibrary`), die in einem Raster platziert werden können, als würden Sie ein Level mit unendlich vielen Lego-Steinen erstellen.

source: Collisions and navigation can also be added to the meshes, just like you would do with the tiles of a tilemap.
de: Kollisionen und Navigation können ebenfalls zu den Meshes hinzugefügt werden, genau wie Sie es mit den Tiles einer TileMap tun würden.

source: Example project
de: Beispielprojekt

source: To learn how GridMaps work, start by downloading the sample project: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.
de: Um zu erfahren, wie GridMaps funktionieren, laden Sie zunächst das Beispielprojekt herunter: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.

source: Unzip this project and add it to the Project Manager using the "Import" button.
de: Entpacken Sie dieses Projekt und fügen Sie es über den "Importieren"-Button dem Projektmanager hinzu.

source: Creating a MeshLibrary
de: Erstellen einer MeshLibrary

source: To begin, you need a :ref:`class_MeshLibrary`, which is a collection of individual meshes that can be used in the gridmap. Open the "mesh_library_source.tscn" scene to see an example of how to set up the mesh library.
de: Zu Beginn benötigen Sie eine :ref:`class_MeshLibrary`, eine Sammlung einzelner Meshes, die in der GridMap verwendet werden kann. Öffnen Sie die Szene "mesh_library_source.tscn", um ein Beispiel für das Einrichten der Mesh-Library zu sehen.

source: As you can see, this scene has a :ref:`class_Node3D` node as its root, and a number of :ref:`class_MeshInstance3D` node children.
de: Wie Sie sehen können, hat diese Szene einen Node :ref:`class_Node3D` als Root und eine Reihe von :ref:`class_MeshInstance3D`-Child-Nodes.

source: If you don't need any physics in your scene, then you're done. However, in most cases you'll want to assign collision bodies to the meshes.
de: Wenn Sie in Ihrer Szene keine Physik benötigen, sind Sie fertig. In den meisten Fällen möchten Sie den Meshes jedoch Collision Bodys zuweisen.

source: Collisions
de: Kollisionen

source: You can manually assign a :ref:`class_StaticBody3D` and :ref:`class_CollisionShape3D` to each mesh. Alternatively, you can use the "Mesh" menu to automatically create the collision body based on the mesh data.
de: Sie können jedem Mesh manuell ein :ref:`class_StaticBody3D` und :ref:`class_CollisionShape3D` zuweisen. Alternativ können Sie das Menü "Mesh" verwenden, um den Collision Body basierend auf den Mesh-Daten automatisch zu erstellen.

source: Note that a "Convex" collision body will work better for simple meshes. For more complex shapes, select "Create Trimesh Static Body". Once each mesh has a physics body and collision shape assigned, your mesh library is ready to be used.
de: Beachten Sie, dass ein "konvexer" Collision Body für einfache Meshes besser funktioniert. Wählen Sie für komplexere Geometrien "Statischen Trimesh-Body erzeugen". Sobald jedem Mesh ein Physik-Body und eine Collision Shape zugewiesen wurden, kann Ihre Mesh-Library verwendet werden.

source: Materials
de: Materialien

source: Only the materials from within the meshes are used when generating the mesh library. Materials set on the node will be ignored.
de: Beim Generieren der Mesh-Library werden nur die Materialien aus den Meshes verwendet. Materialien, die auf dem Node eingestellt sind, werden ignoriert.

source: Like all mesh instances, MeshLibrary items can be assigned a :ref:`class_NavigationMesh` resource, which can be created manually, or baked as described below.
de: Wie allen Mesh-Instanzen kann auch MeshLibrary-Elementen eine :ref:`class_NavigationMesh`-Ressource zugewiesen werden, die manuell erstellt oder wie unten beschrieben gebacken werden kann.

source: To create the NavigationMesh from a MeshLibrary scene export, place a :ref:`class_NavigationRegion3D` child node below the main MeshInstance3D for the GridMap item. Add a valid NavigationMesh resource to the NavigationRegion3D and some source geometry nodes below and bake the NavigationMesh.
de: Um das NavigationMesh aus einem MeshLibrary-Szenenexport zu erstellen, platzieren Sie einen Child-Node :ref:`class_NavigationRegion3D` unterhalb der Haupt-MeshInstance3D für das GridMap-Element. Fügen Sie eine gültige NavigationMesh-Ressource zur NavigationRegion3D und einige Quellgeometrie-Nodes darunter hinzu und backen Sie das NavigationMesh.

source: With small grid cells it is often necessary to reduce the NavigationMesh properties for agent radius and region minimum size.
de: Bei kleinen Rasterzellen ist es oft notwendig, die NavigationMesh-Propertys für den Agentenradius und die Mindestgröße der Region zu reduzieren.

source: Nodes below the NavigationRegion3D are ignored for the MeshLibrary scene export, so additional nodes can be added as source geometry just for baking the navmesh.
de: Nodes unterhalb der NavigationRegion3D werden für den MeshLibrary-Szenenexport ignoriert, so dass zusätzliche Nodes als Quellgeometrie nur zum Backen des Navmeshs hinzugefügt werden können.

source: The baked cell size of the NavigationMesh must match the NavigationServer map cell size to properly merge the navigation meshes of different grid cells.
de: Die Größe der gebackenen Zellen des Navigations-Meshes muss mit der Größe der Map-Zellen des Navigationsservers übereinstimmen, damit die Navigations-Meshes verschiedener Rasterzellen korrekt zusammengeführt werden können.

source: Exporting the MeshLibrary
de: Exportieren der MeshLibrary

source: To export the library, click on **Scene > Export As... > MeshLibrary...**, and save it as a resource.
de: Um die Library zu exportieren, klicken Sie auf Szene -> Exportieren als... -> MeshLibrary... und speichern Sie sie als Ressource.

source: You can find an already exported MeshLibrary in the project named "MeshLibrary.tres".
de: Sie finden eine bereits exportierte MeshLibrary im Projekt mit dem Namen "MeshLibrary.tres".

source: Using GridMap
de: Verwenden von GridMap

source: Create a new scene and add a GridMap node. Add the mesh library by dragging the resource file from the FileSystem dock and dropping it in the "Theme" property in the Inspector.
de: Erstellen Sie eine neue Szene und fügen Sie einen GridMap-Node hinzu. Fügen Sie die Mesh-Library hinzu, indem Sie die Ressourcendatei aus dem Dateisystem-Dock ziehen und in der Property "Theme" im Inspektor ablegen.

source: The "Cell/Size" property should be set to the size of your meshes. You can leave it at the default value for the demo. Set the "Center Y" property to "Off".
de: Die Eigenschaft "Zelle/Größe" sollte auf die Größe Ihrer Meshes festgelegt werden. Sie können den Defaultwert für das Beispiel beibehalten. Setzen Sie die Property "Center Y" auf "Off".

source: Now you can start designing the level by choosing a tile from the palette and placing it with Left-Click in the editor window. Use Right-click to remove a tile.
de: Jetzt können Sie mit dem Entwerfen des Levels beginnen indem Sie ein Tile aus der Palette auswählen und mit der linken Maustaste im Editorfenster platzieren. Klicken Sie mti der rechten Maustaste um ein Tile zu entfernen.

source: Use the arrows next to the "GridMap" menu to change the floor that you are working on.
de: Verwenden Sie die Pfeile neben dem Menü "GridMap", um die Ebene zu wechseln, auf der Sie arbeiten.

source: Click on the "GridMap" menu to see options and shortcuts. For example, pressing :kbd:`S` rotates a tile around the y-axis.
de: Klicken Sie auf das Menü "GridMap" um Optionen und Verknüpfungen anzuzeigen. Durch Drücken von :kbd:`S` wird beispielsweise eine Tile um die Y-Achse gedreht.

source: Holding :kbd:`Shift` and dragging with the left mouse button will draw a selection box. You can duplicate or clear the selected area using the respective menu options.
de: Halten Sie :kbd:`Umschalt` gedrückt und ziehen Sie mit der linken Maustaste, um eine Auswahlbox zu zeichnen. Sie können den ausgewählten Bereich über die entsprechenden Menüoptionen duplizieren oder löschen.

source: In the menu, you can also change the axis you're drawing on, as well as shift the drawing plane higher or lower on its axis.
de: Im Menü können Sie auch die Achse ändern entlang der Sie zeichnen und die Zeichnungsebene entlang ihrer Achse nach oben oder unten verschieben.

source: Using GridMap in code
de: Verwenden von GridMap im Code

source: See :ref:`class_GridMap` for details on the node's methods and member variables.
de: Siehe :ref:`class_GridMap` für Details zu den Methoden und Membervariablen des Nodes.

source: Translation status
de: Übersetzungsstatus
