Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_multi_mesh_instance.po
Languages: de, zh_tw

source: Using MultiMeshInstance3D
de: Verwenden von MultiMeshInstance3D
zh_tw: 使用 MultiMeshInstance3D

source: Introduction
de: Einführung
zh_tw: 前言

source: In a normal scenario, you would use a :ref:`MeshInstance3D <class_MeshInstance3D>` node to display a 3D mesh like a human model for the main character, but in some cases, you would like to create multiple instances of the same mesh in a scene. You *could* duplicate the same node multiple times and adjust the transforms manually. This may be a tedious process and the result may look mechanical. Also, this method is not conducive to rapid iterations. :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>` is one of the possible solutions to this problem.
de: In einem normalen Szenario würden Sie einen :ref:`MeshInstance3D <class_MeshInstance3D>`-Node verwenden, um ein 3D-Mesh wie ein menschliches Modell für den Hauptcharakter darzustellen, aber in manchen Fällen möchten Sie mehrere Instanzen desselben Mesh in einer Szene erstellen. Sie *könnten* denselben Node mehrfach duplizieren und die Transformationen manuell anpassen. Dies kann ein langwieriger Prozess sein und das Ergebnis kann mechanisch aussehen. Außerdem ist diese Methode für schnelle Iterationen nicht förderlich. :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>` ist eine der möglichen Lösungen für dieses Problem.
zh_tw: 在正常情況下, 使用一個 :ref:`MeshInstance <class_MeshInstance>` 節點來顯示一個3D網格, 比如主角的人體模型, 但在某些情況下, 會想在一個場景中建立同一個網格的多個實例. 你 *可以* 多次複製同一個節點, 並手動調整變換. 這可能是一個乏味的過程, 結果可能看起來很機械. :ref:`MultiMeshInstance <class_MultiMeshInstance>` 是解決這個問題的一種可能的方法.

source: MultiMeshInstance3D, as the name suggests, creates multiple copies of a MeshInstance over a surface of a specific mesh. An example would be having a tree mesh populate a landscape mesh with trees of random scales and orientations.
de: MultiMeshInstance3D erstellt, wie der Name schon sagt, mehrere Kopien einer MeshInstance über einer Oberfläche eines bestimmten Mesh. Ein Beispiel wäre ein Baum-Mesh, das ein Landschafts-Mesh mit Bäumen in zufälligen Größenordnungen und Ausrichtungen bevölkert.
zh_tw: MultiMeshInstance, 顧名思義, 在特定網格的表面上建立MeshInstance的多個副本. 一個範例是樹形網格用隨機比例和方向的樹填充景觀網格.

source: Setting up the nodes
de: Einrichten der Nodes
zh_tw: 設定節點

source: The basic setup requires three nodes: the MultiMeshInstance3D node and two MeshInstance3D nodes.
de: Die Grundeinstellung erfordert drei Nodes: den MultiMeshInstance3D-Node und zwei MeshInstance3D-Nodes.
zh_tw: 基本設定需要三個節點：MultiMeshInstance3D 節點和兩個MeshInstance3D 節點。

source: One node is used as the target, the surface mesh that you want to place multiple meshes on. In the tree example, this would be the landscape.
de: Ein Node wird als Ziel verwendet, das Oberflächen-Mesh, auf dem Sie mehrere Meshes platzieren möchten. Im Beispiel des Baums wäre dies die Landschaft.
zh_tw: 一個節點用作目標, 即要放置多個網格的網格. 在樹的範例中, 這將是景觀.

source: The other node is used as the source, the mesh that you want to have duplicated. In the tree case, this would be the tree itself.
de: Der andere Node wird als Quelle verwendet, also das Mesh, das dupliziert werden soll. Im Fall des Baums wäre dies der Baum selbst.
zh_tw: 另一個節點是作為源節點, 也就是你想複製的網格. 在樹的情況下, 這將是樹本身.

source: In our example, we would use a :ref:`Node3D <class_Node3D>` node as the root node of the scene. Your scene tree would look like this:
de: In unserem Beispiel würden wir einen :ref:`Node3D <class_Node3D>` Node als Root-Node der Szene verwenden. Ihr Szenenbaum würde wie folgt aussehen:
zh_tw: 在我們的範例中，將使用 :ref:`Node3D <class_Node3D>` 作為場景的根節點。場景樹看起來像這樣:

source: For simplicity's sake, this tutorial uses built-in primitives.
de: Der Einfachheit halber werden in diesem Tutorial Built-in-Primitive verwendet.
zh_tw: 出於簡化目的，本教學使用內建像素。

source: Now you have everything ready. Select the MultiMeshInstance3D node and look at the toolbar, you should see an extra button called ``MultiMesh`` next to ``View``. Click it and select *Populate surface* in the dropdown menu. A new window titled *Populate MultiMesh* will pop up.
de: Nun haben Sie alles vorbereitet. Wählen Sie den MultiMeshInstance3D-Node und schauen Sie sich die Toolbar an, Sie sollten einen zusätzlichen Button namens ``MultiMesh`` neben ``Ansicht`` sehen. Klicken Sie darauf und wählen Sie *Oberfläche füllen* im Dropdown-Menü. Es öffnet sich ein neues Fenster mit dem Titel *MultiMesh füllen*.
zh_tw: 現在您準備好了一切。選擇 MultiMeshInstance3D 節點並查看工具列，您應該在``視圖``旁邊看到一個名為 ``MultiMesh`` 的額外按鈕。按一下它並在下拉式功能表中選擇*填充表面*。將彈出一個名為*填充MultiMesh*的新視窗。

source: MultiMesh settings
de: MultiMesh-Einstellungen
zh_tw: MultiMesh 設定

source: Below are descriptions of the options.
de: Nachfolgend finden Sie Beschreibungen der Optionen.
zh_tw: 以下是選項說明.

source: Target Surface
de: Ziel-Oberfläche
zh_tw: 目標表面

source: The mesh used as the target surface on which to place copies of your source mesh.
de: Das Mesh, das als Ziel-Oberfläche für das Platzieren von Kopien Ihres Quell-Meshs verwendet wird.
zh_tw: 用來放置源網格副本的目標表面的網格.

source: Source Mesh
de: Quell-Mesh
zh_tw: 源網格

source: The mesh you want duplicated on the target surface.
de: Das Mesh, das Sie auf der Ziel-Oberfläche duplizieren möchten.
zh_tw: 要在目標曲面上複製的網格.

source: Mesh Up Axis
de: Aufwärts-Achse des Meshs
zh_tw: 網格向上軸

source: The axis used as the up axis of the source mesh.
de: Die Achse, die als Aufwärts-Achse des Quell-Meshes verwendet wird.
zh_tw: 軸用作源網格的上軸.

source: Random Rotation
de: Zufällige Rotation
zh_tw: 隨機旋轉

source: Randomizing the rotation around the up axis of the source mesh.
de: Zufällige Rotation um die Aufwärts-Achse des Quell-Meshes.
zh_tw: 隨機地圍繞源網格的向上軸旋轉.

source: Random Tilt
de: Zufälliges Kippen
zh_tw: 隨機磚塊

source: Randomizing the overall rotation of the source mesh.
de: Zufällige Gesamtrotation des Quell-Meshes.
zh_tw: 隨機化源網格的整體旋轉.

source: Random Scale
de: Zufälliges Skalieren
zh_tw: 隨機縮放

source: Randomizing the scale of the source mesh.
de: Zufällige Skalierung des Quell-Meshes.
zh_tw: 隨機化源網格的比例.

source: Scale
de: Skalierung
zh_tw: 縮放

source: The scale of the source mesh that will be placed over the target surface.
de: Die Skalierung des Quell-Meshes, das auf der Ziel-Oberfläche platziert wird.
zh_tw: 將放置在目標曲面上的源網格的比例.

source: Amount
de: Menge
zh_tw: 數量

source: The amount of mesh instances placed over the target surface.
de: Die Menge der auf der Ziel-Oberfläche platzierten Mesh-Instanzen.
zh_tw: 放置在目標曲面上的網格實例數量.

source: Select the target surface. In the tree case, this should be the landscape node. The source mesh should be the tree node. Adjust the other parameters according to your preference. Press ``Populate`` and multiple copies of the source mesh will be placed over the target mesh. If you are satisfied with the result, you can delete the mesh instance used as the source mesh.
de: Wählen Sie die Zielfläche aus. Im Fall der Bäume sollte dies der Landschafts-Node sein. Das Quell-Mesh sollte der Baum-Node sein. Passen Sie die anderen Parameter nach Ihren Wünschen an. Drücken Sie ``Füllen`` und mehrere Kopien des Quell-Mesh werden auf dem Ziel-Mesh platziert. Wenn Sie mit dem Ergebnis zufrieden sind, können Sie die als Quell-Mesh verwendete Mesh-Instanz löschen.
zh_tw: 選擇目標曲面. 在樹情況下, 這應該是橫向節點. 源網格應該是樹節點. 根據您的喜好調整其他參數. 按 ``Populate`` , 源網格的多個副本將放在目標網格上. 如果對結果滿意, 可以刪除用作源網格的網格實例.

source: The end result should look like this:
de: Das Endergebnis sollte folgendermaßen aussehen:
zh_tw: 最終結果應如下所示:

source: To change the result, repeat the previous steps with different parameters.
de: Um das Ergebnis zu ändern, wiederholen Sie die vorherigen Schritte mit verschiedenen Parametern.
zh_tw: 要更改結果, 請使用不同的參數重複相同的步驟.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
