Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/variable_rate_shading.po
Languages: de, zh_cn, zh_tw

source: Variable rate shading
zh_cn: 可变速率着色
zh_tw: 變數型別轉換

source: What is variable rate shading?
de: Was ist Variable Rate Shading?
zh_cn: 什么是可变速率着色？
zh_tw: 什麼是視覺腳本？

source: In modern 3D rendering engines, shaders are much more complex compared to before. The advent of physically-based rendering, real-time global illumination and screen-space effects has increased the number of *per-pixel* shading that must be performed to render each frame. Additionally, screen resolutions also have increased a lot, with 1440p and 4K now being common target resolutions. As a result, the total shading cost in scene rendering usually represents a significant amount of the time taken to render each frame.
de: In modernen 3D-Rendering-Engines sind die Shader viel komplexer als früher. Das Aufkommen von physikbasiertem Rendering, Global Illumination in Echtzeit und Screen-Space-Effekten hat die Anzahl der Shadings pro Pixel erhöht, die zum Rendern jedes Frames ausgeführt werden müssen. Außerdem sind die Bildschirmauflösungen stark angestiegen, wobei 1440p und 4K jetzt üblichen Zielauflösungen sind. Infolgedessen machen die Gesamtkosten für das Shading beim Rendern einer Szene in der Regel einen erheblichen Teil der Renderzeit für jedes Frame aus.
zh_cn: 在现代 3D 渲染引擎中，着色器比以前复杂得多。基于物理的渲染、实时全局照明和屏幕空间效果的出现，增加了渲染每帧时必须执行的 *每像素* 着色的数量。此外，屏幕分辨率也大幅提升，1440p 和 4K 已成为常见的目标分辨率。因此，场景渲染中的总着色成本通常代表着渲染每帧所花费的大量时间。
zh_tw: 在現代 3D 算繪引擎中，著色器比以前複雜得多。基於物理的算繪、即時全域照明和螢幕空間效果的出現增加了算繪每影格時必須執行的「每像素」著色的數量。此外，螢幕解析度也大幅提升，1440p 和 4K 已成為常見的目標解析度。因此，場景算繪中的總著色成本通常代表算繪每個畫面所花費的大量時間。

source: Variable rate shading (VRS) is a method of decreasing this shading cost by reducing the resolution of *per-pixel* shading (also called *fragment* shading), while keeping the original resolution for rendering geometry. This means geometry edges remain as sharp as they would without VRS. VRS can be combined with any :ref:`doc_3d_antialiasing` technique (MSAA, FXAA, TAA, SSAA).
de: Variable Rate Shading (VRS) ist eine Methode zur Verringerung dieser Shading-Kosten, indem die Auflösung des *Pixel*-Shadings (auch *Fragment*-Shading genannt) reduziert wird, während die ursprüngliche Auflösung für das Rendern der Geometrie beibehalten wird. Das bedeutet, dass die Kanten der Geometrie so scharf bleiben, wie sie es ohne VRS wären. VRS kann mit jeder :ref:`doc_3d_antialiasing`-Technik (MSAA, FXAA, TAA, SSAA) kombiniert werden.
zh_cn: 可变速率着色 (VRS，variable rate shading) 是一种通过降低 *每像素* 着色（也称为 *片段* 着色）的分辨率来降低着色成本的方法，同时保持渲染几何体的原始分辨率。这意味着几何边缘仍然像没有 VRS 时一样锋利。 VRS 可以与任何 :ref:`doc_3d_antialiasing` 技术（MSAA、FXAA、TAA、SSAA）结合使用。
zh_tw: 可變速率著色 (VRS) 是一種透過降低*每像素*著色（也稱為*片段*著色）的解析度來降低著色成本的方法，同時保持算繪幾何體的原始解析度。這意味著幾何邊緣仍然像沒有 VRS 時一樣鋒利。 VRS 可以與任何 doc_3d_antialiasing 技術（MSAA、FXAA、TAA、SSAA）結合使用。

source: VRS allows specifying the shading quality in a local manner, which makes it possible to have certain parts of the viewport receive more detailed shading than others. This is particularly useful in virtual reality (VR) to achieve *foveated rendering*, where the center of the viewport is more detailed than the edges.
de: Mit VRS kann die Shading-Qualität lokal festgelegt werden, so dass bestimmte Teile des Viewports ein detaillierteres Shading erhalten als andere. Dies ist besonders in der virtuellen Realität (VR) nützlich, um ein *Foveated Rendering* zu erreichen, bei dem die Mitte des Viewports detaillierter ist als die Ränder.
zh_cn: VRS 允许以本地方式指定着色质量，这使得视口的某些部分可以比其他部分接收更详细的着色。这在虚拟现实 (VR) 中特别有用，可实现 *注视点渲染* （foveated rendering），其中视口的中心比其边缘更详细。
zh_tw: VRS 允許以本地方式指定著色質量，這使得視口的某些部分可以比其他部分接收更詳細的著色。這在虛擬實境 (VR) 中特別有用，可實作“注視點算繪”，其中視口的中心比邊緣更詳細。

source: Here's a scene rendered with rate shading disabled then enabled, using the density map linked at the bottom of this page:
de: Hier ist eine Szene, die mit deaktiviertem und dann aktiviertem Rate Shading gerendert wurde, unter Verwendung der unten auf dieser Seite verlinkten Dichtekarte:
zh_cn: 这是使用本页底部链接的密度图，先禁用，然后启用速率着色渲染的场景：
zh_tw: 這是使用本頁底部連結的密度圖，先停用然後啟用速率著色算繪的場景：

source: Variable rate shading disabled in textured scene
de: Variable Rate Shading in texturierter Szene deaktiviert
zh_cn: 在纹理场景中禁用可变速率着色
zh_tw: 在紋理場景中停用可變速率著色

source: Variable rate shading enabled in textured scene (lower quality but higher performance)
de: Variable Rate Shading in texturierter Szene aktiviert (geringere Qualität, aber höhere Performance)
zh_cn: 在纹理场景中启用可变速率着色（质量较低但性能较高）
zh_tw: 在紋理場景中啟用可變速率著色（品質較低但效能較高）

source: When used in scenes with low-frequency detail (such as scenes with a stylized/low-poly aesthetic), it's possible to achieve similar performance gains but with less reduction in visual quality:
de: Bei der Verwendung in Szenen mit niederfrequenten Details (z. B. Szenen mit einer stilisierten/wenig plastischen Ästhetik) ist es möglich, ähnliche Performance-Gewinne zu erzielen, jedoch mit geringeren Einbußen bei der visuellen Qualität:
zh_cn: 当在具有低频细节的场景（例如具有风格化/低多边形艺术风格的场景）中使用时，可以实现类似的性能增益，但视觉质量的降低较小：
zh_tw: 當在具有低頻細節的場景（例如具有風格化/低多邊形美感的場景）中使用時，可以實作類似的性能增益，但視覺品質的降低較小：

source: Variable rate shading disabled in untextured scene
de: Variable Rate Shading in untexturierter Szene deaktiviert
zh_cn: 在无纹理场景中禁用可变速率着色
zh_tw: 在無紋理場景中停用可變速率著色

source: Variable rate shading enabled in untextured scene (lower quality but higher performance)
de: Variable Rate Shading in untexturierter Szene aktiviert (geringere Qualität, aber höhere Performance)
zh_cn: 在无纹理场景中启用可变速率着色（质量较低但性能较高）
zh_tw: 在無紋理場景中啟用可變速率著色（品質較低但效能較高）

source: Hardware support
de: Hardware-Unterstützung
zh_cn: 硬件支持
zh_tw: 提供 Mod 支援

source: Variable rate shading is only supported on specific GPUs:
de: Variable Rate Shading wird nur von bestimmten GPUs unterstützt:
zh_cn: 可变速率着色仅在特定 GPU 上受支持：
zh_tw: 可變速率著色僅在特定 GPU 上支援：

source: **Desktop:**
zh_cn: **桌面端：**
zh_tw: **描述**

source: NVIDIA Turing and newer (including GTX 1600 series)
de: NVIDIA Turing und neuere Modelle (einschließlich GTX 1600 Serie)
zh_cn: NVIDIA Turing 及更新版本（包括 GTX 1600 系列）
zh_tw: NVIDIA Turing 及更新版本（含 GTX 1600 系列）

source: AMD RDNA2 and newer (both integrated and dedicated GPUs – including Steam Deck)
de: AMD RDNA2 und neuer (sowohl integrierte Grafikchips als auch dedizierte GPUs - einschließlich Steam Deck)
zh_cn: AMD RDNA2 及更新版本（集成和专用 GPU – 包括 Steam Deck）
zh_tw: AMD RDNA2 及更新版本（整合與專用 GPU – 包括 Steam Deck）

source: Intel Arc Alchemist and newer **(dedicated GPUs only)**
de: Intel Arc Alchemist und neuer **(nur dedizierte GPUs)**
zh_cn: Intel Arc Alchemist 及更新版本 **（仅限专用 GPU）**
zh_tw: Intel Arc Alchemist 及更新版本 **（僅限專用 GPU）**

source: Intel integrated graphics do not support variable rate shading.
de: Die integrierten Intel-Grafikchips unterstützen kein Variable Rate Shading.
zh_cn: 英特尔集成显卡不支持可变速率着色。
zh_tw: 英特爾整合式顯示卡不支援可變速率著色。

source: Snapdragon 888 and newer
de: Snapdragon 888 und neuer
zh_cn: 骁龙（Snapdragon） 888 及更新版本
zh_tw: Snapdragon 888 及更新版本

source: MediaTek Dimensity 9000 and newer
de: MediaTek Dimensity 9000 und neuer
zh_cn: MediaTek 天玑 9000 及更新版本
zh_tw: MediaTek 天璣 9000 及更新版本

source: ARM Mali-G615 and newer
de: ARM Mali-G615 und neuer
zh_cn: ARM Mali-G615 及更新版本
zh_tw: ARM Mali-G615 及更新版本

source: As of January 2023, Apple and Raspberry Pi GPUs do not support variable rate shading.
de: Mit Stand vom Januar 2023 unterstützen die Grafikprozessoren von Apple und Raspberry Pi kein Variable Rate Shading.
zh_cn: 截至 2023 年 1 月，Apple 和 Raspberry Pi GPU 仍不支持可变速率着色。
zh_tw: 截至 2023 年 1 月，Apple 和 Raspberry Pi GPU 不支援可變速率著色。

source: Using variable rate shading in Godot
de: Variable Rate Shading in Godot verwenden
zh_cn: 在 Godot 中使用可变速率着色
zh_tw: 在 Godot 中使用 NuGet 套件

source: Both Forward Plus and Forward Mobile rendering methods support variable rate shading. VRS can be used in both pancake (non-XR) and XR display modes.
de: Sowohl Forward Plus als auch Forward Mobile Rendering-Methoden unterstützen Variable Rate Shading. VRS kann sowohl im Pancake- (nicht-XR) als auch im XR-Anzeigemodus verwendet werden.
zh_cn: Forward+ 和 Forward 移动渲染方法都支持可变速率着色。 VRS 可用于 pancake（非 XR）和 XR 显示模式。
zh_tw: Forward Plus 和 Forward Mobile 算繪方法都支援可變速率著色。 VRS 可用於薄餅（非 XR）和 XR 顯示模式。

source: The Compatibility rendering method does **not** support variable rate shading.
de: Die Kompatibilität-Rendering-Methode unterstützt **kein** Variable Rate Shading.
zh_cn: 兼容渲染方法\ **不支持**\ 可变速率着色。
zh_tw: 相容性算繪方法**不**支援可變速率著色。

source: In the advanced Project Settings, the **Rendering > VRS** section offers settings to control variable rate shading on the root viewport:
de: In den erweiterten Projekteinstellungen bietet der Abschnitt **Rendern > VRS** Einstellungen zur Steuerung des Variable Rate Shading im Root Viewport:
zh_cn: 在高级项目设置中， **渲染 > VRS** 部分提供了控制根视口上可变速率着色的设置：
zh_tw: 在進階專案設定中，**算繪 > VRS** 部分提供了控制根視口上可變速率著色的設定：

source: **Mode:** Controls the variable rate shading mode. **Disabled** disables variable rate shading. **Texture** uses a manually authored texture to set shading density (see the property below). **XR** automatically generates a texture suited for foveated rendering in virtual/augmented reality.
de: **Modus:** Steuert den Variable Rate Shading-Modus. **Deaktiviert** schaltet Variable Rate Shading aus. **Textur** verwendet eine manuell erstellte Textur, um die Shading-Dichte festzulegen (siehe Property unten). **XR** generiert automatisch eine Textur, die für Foveated Rendering in der Virtual/Augmented Reality geeignet ist.
zh_cn: **模式：** 控制可变速率着色模式。 **Disabled** 禁用可变速率着色。 **Texture** 使用手动创作的纹理来设置着色密度（请参阅下面的属性）。 **XR** 自动生成适合虚拟/增强现实中的注视点渲染的纹理。
zh_tw: **模式：** 控制可變速率著色模式。 **禁用** 停用可變速率著色。 **紋理** 使用手動建立的紋理來設定著色密度（請參閱下面的屬性）。 **XR** 自動產生適合虛擬/擴增實境中的注視點算繪的紋理。

source: **Texture:** The texture to use to control shading density on the root viewport. Only used if **Mode** is **Texture**.
de: **Textur:** Die Textur, die zur Steuerung der Shading-Dichte im Root Viewport verwendet wird. Wird nur verwendet, wenn **Modus** auf **Textur** eingestellt ist.
zh_cn: **纹理：** 用于控制根视口上的着色密度的纹理。仅当 **Mode** 为 **Texture** 时使用。
zh_tw: **紋理：** 用於控制根視口上的著色密度的紋理。僅當 **Mode** 為 **Texture** 時使用。

source: For custom viewports, the VRS mode and texture must be set manually to the :ref:`class_Viewport` node.
de: Für benutzerdefinierte Viewports müssen der VRS-Modus und die Textur manuell auf den Node :ref:`class_Viewport` gesetzt werden.
zh_cn: 对于自定义视口，必须手动将 VRS 模式和纹理设置到 :ref:`class_Viewport` 节点。
zh_tw: 對於自訂視口，必須手動將 VRS 模式和紋理設定為 class_Viewport 節點。

source: On unsupported hardware, there is no visual difference when variable rate shading is enabled. You can check whether hardware supports variable rate shading by running the editor or project with the ``--verbose`` :ref:`command line argument <doc_command_line_tutorial>`.
de: Auf nicht unterstützter Hardware gibt es keinen visuellen Unterschied, wenn Variable Rate Shading aktiviert ist. Sie können überprüfen, ob die Hardware Variable Rate Shading unterstützt, indem Sie den Editor oder das Projekt mit dem ``--verbose`` :ref:`Kommandozeilenargument <doc_command_line_tutorial>` ausführen.
zh_cn: 在不受支持的硬件上，启用可变速率着色时不会出现视觉差异。你可以通过使用 ``--verbose`` :ref:`命令行参数 <doc_command_line_tutorial>` 运行编辑器或项目来检查硬件是否支持可变速率着色。
zh_tw: 在不支援的硬體上，啟用可變速率著色時不會出現視覺差異。您可以透過使用「--verbose」:ref:`命令列參數 <doc_command_line_tutorial>` 執行編輯器或專案來檢查硬體是否支援可變速率著色。

source: Creating a VRS density map
de: Erstellen einer VRS-Dichtekarte
zh_cn: 创建 VRS 密度图
zh_tw: 建立內容

source: If using the **Texture** VRS mode, you *must* set a texture to be used as a density map. Otherwise, no effect will be visible.
de: Wenn Sie den VRS-Modus **Textur** verwenden, *müssen* Sie eine Textur festlegen, die als Dichtekarte verwendet werden soll. Andernfalls wird kein Effekt sichtbar sein.
zh_cn: 如果使用 **Texture** VRS 模式， *必须* 设置要用作密度贴图的纹理。否则，将看不到任何效果。
zh_tw: 如果使用**紋理** VRS 模式，您*必須*設定要用作密度貼圖的紋理。否則，將看不到任何效果。

source: You can create your own VRS density map manually using an image editor, or generate it using another method (e.g. on the CPU using the Image class, or on the GPU using a shader). However, beware of performance implications when generating a VRS image dynamically. If opting for dynamic generation, make sure the VRS image generation process is fast enough to avoid outweighing the performance gains from VRS.
de: Sie können Ihre eigene VRS-Dichtekarte manuell mit einem Bildbearbeitungsprogramm erstellen oder sie mit einer anderen Methode generieren (z.B. auf der CPU mit der Image-Klasse oder auf der GPU mit einem Shader). Achten Sie jedoch auf die Auswirkungen auf die Performance, wenn Sie ein VRS-Bild dynamisch erzeugen. Wenn Sie sich für die dynamische Generierung entscheiden, stellen Sie sicher, dass der Prozess der VRS-Bilderzeugung schnell genug ist, um die Performance-Gewinne durch VRS nicht aufzuwiegen.
zh_cn: 你可以使用图像编辑器手动创建自己的 VRS 密度图，或使用其他方法生成它（例如，在 CPU 上使用 Image 类，或在 GPU 上使用着色器）。但是，动态生成 VRS 图像时请注意其性能影响。如果选择动态生成，请确保 VRS 图像生成过程足够快，以避免超出 VRS 的性能增益。
zh_tw: 您可以使用影像編輯器手動建立自己的 VRS 密度圖，或使用其他方法產生它（例如，在 CPU 上使用 Image 類，或在 GPU 上使用著色器）。但是，動態產生 VRS 影像時請注意效能影響。如果選擇動態生成，請確保 VRS 影像生成過程足夠快，以避免超出 VRS 的效能提升。

source: The texture must follow these rules:
de: Die Textur muss diesen Regeln folgen:
zh_cn: 纹理必须遵循以下规则：
zh_tw: 文字內容如下：

source: The texture *must* use a lossless compression format so that colors can be matched precisely.
de: Die Textur *muss* ein verlustfreies Komprimierungsformat verwenden, damit die Farben genau angepasst werden können.
zh_cn: 纹理 *必须* 使用无损压缩格式，以便颜色可以精确匹配。
zh_tw: 紋理*必須*使用無損壓縮格式，以便顏色可以精確配對。

source: The following VRS densities are mapped to various colors, with brighter colors representing a lower level of shading precision:
de: Die folgenden VRS-Dichten werden verschiedenen Farben zugeordnet, wobei hellere Farben einen geringeren Grad an Shading-Präzision darstellen:
zh_cn: 以下 VRS 密度映射到各种颜色，较亮的颜色表示较低级别的着色精度：
zh_tw: 以下 VRS 密度對應到各種顏色，較亮的顏色表示較低的著色精度：

source: Density
de: Dichte
zh_cn: 密度
zh_tw: 密度

source: Color
de: Farbe
zh_tw: 顏色

source: Comment
de: Kommentar
zh_cn: 注释
zh_tw: Comment 註解

source: 1×1 (highest detail)
de: 1×1 (höchste Detailgenauigkeit)
zh_cn: 1×1（细节最高）
zh_tw: 1×1（細節最高）

source: Not supported on most hardware.
de: Wird von den meisten Geräten nicht unterstützt.
zh_cn: 大多数硬件不支持。
zh_tw: 大多數硬體不支援。

source: 8×8 (lowest detail)
de: 8×8 (niedrigste Detailstufe)
zh_cn: 8×8（细节最低）
zh_tw: 8×8（細節最低）

source: For example, this VRS density texture provides the highest shading density in the center of the viewport, and the lowest shading density in the corners:
de: Diese VRS-Dichte-Textur bietet zum Beispiel die höchste Shading-Dichte in der Mitte des Viewports und die niedrigste Shading-Dichte in den Ecken:
zh_cn: 例如，此 VRS 密度纹理在视口中心提供最高的着色密度，在角落提供最低的着色密度：
zh_tw: 例如，此 VRS 密度紋理在視窗中心提供最高的著色密度，在角落提供最低的著色密度：

source: Example VRS density map texture, simulating foveated rendering
de: Beispiel einer VRS-Dichtekartentextur, die Foveated Rendering simuliert
zh_cn: VRS 密度贴图纹理示例，模拟注视点渲染
zh_tw: VRS 密度貼圖紋理範例，模擬注視點算繪

source: There are no size or aspect ratio requirements for the VRS density texture. However, there is no benefit to using a VRS density map that is larger than the viewport resolution divided by the GPU's *tile size*. The tile size is what determines the smallest area of pixels where the shading density can be changed separately from other tiles. On most GPUs, this tile size is 8×8 pixels. You can view the tile size by running Godot with the ``--verbose`` command line argument, as it's printed in the VRS debugging information.
de: Für die VRS-Dichtetextur gibt es keine Anforderungen an Größe oder Seitenverhältnis. Es ist jedoch nicht sinnvoll, eine VRS-Dichtekarte zu verwenden, die größer ist als die Viewport-Auflösung geteilt durch die *Kachelgröße* der GPU. Die Kachelgröße bestimmt den kleinsten Pixelbereich, in dem die Shading-Dichte getrennt von anderen Kacheln geändert werden kann. Bei den meisten GPUs beträgt diese Kachelgröße 8×8 Pixel. Sie können die Kachelgröße anzeigen, indem Sie Godot mit dem Kommandozeilenargument ``--verbose`` ausführen, da sie in den VRS-Debugging-Informationen ausgegeben wird.
zh_cn: VRS 密度纹理没有尺寸或纵横比要求。但是，使用大于视口分辨率除以 GPU 的 *图块大小* 的 VRS 密度图并没有任何好处。切片大小决定了可以与其他切片分开更改着色密度的最小像素区域。在大多数 GPU 上，此图块大小为 8×8 像素。你可以通过使用 ``--verbose`` 命令行参数运行 Godot 来查看图块大小，正如 VRS 调试信息中打印的那样。
zh_tw: VRS 密度紋理沒有尺寸或縱橫比要求。但是，使用大於視窗解析度除以 GPU 的「圖塊大小」的 VRS 密度圖並沒有任何好處。切片大小決定了可以與其他切片分開更改著色密度的最小像素區域。在大多數 GPU 上，此圖塊大小為 8×8 像素。您可以透過使用「--verbose」命令列參數來執行 Godot 來查看圖塊大小，如 VRS 偵錯資訊中列印的那樣。

source: Therefore, sticking to a relatively low resolution such as 256×256 (square) or 480×270 (16:9) is recommended. Depending on your use cases, a square texture may be more suited compared to a texture that matches the most common viewport aspect ratio in your project (such as 16:9).
de: Daher wird empfohlen, eine relativ niedrige Auflösung wie 256×256 (quadratisch) oder 480×270 (16:9) zu wählen. Je nach Anwendungsfall kann eine quadratische Textur besser geeignet sein als eine Textur, die dem in Ihrem Projekt am häufigsten verwendeten Viewport-Seitenverhältnis entspricht (z. B. 16:9).
zh_cn: 因此，建议保持使用相对较低的分辨率，例如 256×256（方形）或 480×270（16:9）。根据你的使用案例，与项目中最常见的视口纵横比（例如 16:9）相匹配的纹理相比，方形纹理可能更合适。
zh_tw: 因此，建議堅持使用相對較低的分辨率，例如 256×256（方形）或 480×270（16:9）。根據您的使用案例，與專案中最常見的視口縱橫比（例如 16:9）相符的紋理相比，方形紋理可能更適合。

source: When using variable rate shading, you can use a negative :ref:`texture mipmap LOD bias <doc_resolution_scaling_mipmap_bias>` to reduce blurriness in areas with reduced shading rate.
de: Wenn Sie Variable Rate Shading verwenden, können Sie einen negativen :ref:`Textur-Mipmap LOD-Bias <doc_resolution_scaling_mipmap_bias>` verwenden, um die Unschärfe in Bereichen mit reduzierter Shading-Rate zu reduzieren.
zh_cn: 使用可变速率着色时，你可以使用负 :ref:`纹理 mipmap LOD 偏置 <doc_resolution_scaling_mipmap_bias>` 来减少着色率降低的区域的模糊度。
zh_tw: 使用可變速率著色時，您可以使用負紋理 mipmap LOD 偏差 <doc_resolution_scaling_mipmap_bias>` 來減少著色率降低的區域的模糊度。

source: Note that the texture LOD bias is set globally, so this will also affect areas of the viewport with full shading rate. Don't use values that are too low, or textures will appear grainy.
de: Beachten Sie, dass der LOD-Bias der Textur global eingestellt wird, so dass sich dies auch auf Bereiche des Viewports mit voller Shading-Rate auswirkt. Verwenden Sie keine zu niedrigen Werte, sonst wirken die Texturen körnig.
zh_cn: 请注意，纹理 LOD 偏置是全局设置的，因此这也会影响具有完整着色率的视口区域。不要使用太低的值，否则纹理将会显得有颗粒感。
zh_tw: 請注意，紋理 LOD 偏差是全域設定的，因此這也會影響具有完整著色率的視窗區域。不要使用太低的值，否則紋理會顯得有顆粒感。

source: Performance comparison
de: Performance-Vergleich
zh_cn: 性能比较
zh_tw: 效能

source: To give an idea of how much VRS can improve performance in theory, here's a performance comparison with the textured example scene shown at the top of this page. The VRS density map example present on this page is used.
de: Um eine Vorstellung davon zu vermitteln, wie sehr VRS die Performance theoretisch verbessern kann, hier ein Performance-Vergleich mit der texturierten Beispielszene, die oben auf dieser Seite gezeigt wird. Es wird das VRS-Dichtekartenbeispiel auf dieser Seite verwendet.
zh_cn: 为了了解 VRS 在理论上可以提高多少性能，以下是与本页顶部显示的纹理示例场景的性能比较。使用本页上提供的 VRS 密度图示例。
zh_tw: 為了了解 VRS 在理論上可以提高多少效能，以下是與本頁頂部顯示的紋理範例場景的效能比較。使用本頁上提供的 VRS 密度圖範例。

source: Results were captured on a GeForce RTX 4090 with the NVIDIA 525.60.11 driver.
de: Die Ergebnisse wurden auf einer GeForce RTX 4090 mit dem NVIDIA-Treiber 525.60.11 ermittelt.
zh_cn: 结果是在配备 NVIDIA 525.60.11 驱动程序的 GeForce RTX 4090 上收集的。
zh_tw: 結果是在配備 NVIDIA 525.60.11 驅動程式的 GeForce RTX 4090 上捕獲的。

source: Resolution
de: Auflösung
zh_tw: 解析度

source: VRS disabled
de: VRS deaktiviert
zh_cn: 启用 VRS
zh_tw: 禁用 3D

source: VRS enabled
de: VRS aktiviert
zh_cn: 禁用 VRS
zh_tw: 已啟用

source: Performance improvement
de: Verbesserung der Performance
zh_cn: 性能提升
zh_tw: 效能

source: 1920×1080 (Full HD)
zh_cn: 1920×1080（全高清）
zh_tw: 1920×1080（全高清）

source: In terms of performance improvements, variable rate shading is more beneficial at higher target resolutions. The reduction in visual quality is also less noticeable at high resolutions.
de: Was die Performance betrifft, so ist Variable Rate Shading bei höheren Auflösungen vorteilhafter. Auch die Verschlechterung der visuellen Qualität ist bei hohen Auflösungen weniger spürbar.
zh_cn: 在性能改进方面，可变速率着色在更高的目标分辨率下更有利。在高分辨率下，视觉质量的下降也不太明显。
zh_tw: 在效能改進方面，可變速率著色在更高的目標解析度下更有利。在高解析度下，視覺品質的下降也不太明顯。

source: For non-VR games, you will probably have to use a less aggressive VRS texture than what was used in this example. As a result, the effective performance gains will be lower.
de: Für Nicht-VR-Spiele müssen Sie wahrscheinlich eine weniger aggressive VRS-Textur als die in diesem Beispiel verwendete verwenden. Infolgedessen werden die effektiven Performance-Gewinne geringer ausfallen.
zh_cn: 对于非 VR 游戏，你可能需要使用比本示例中使用的更不激进的 VRS 纹理。因此，有效的性能提升将会降低。
zh_tw: 對於非 VR 遊戲，您可能需要使用比本範例中使用的侵略性較小的 VRS 紋理。結果，有效的性能增益將會降低。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: **Mobile SoCs:**
zh_cn: **移动端 SoC：**
