Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/visibility_ranges.po
Languages: de, zh_cn

source: Visibility ranges (HLOD)
de: Reichweitenbasierte Sichtbarkeit (HLOD)
zh_cn: 可见范围（HLOD）

source: Along with :ref:`doc_mesh_lod` and :ref:`doc_occlusion_culling`, visibility ranges are another tool to improve performance in large, complex 3D scenes.
de: Zusammen mit :ref:`doc_mesh_lod` und :ref:`doc_occlusion_culling` ist reichweitenbasierte Sichtbarkeit ein weiteres Tool zur Verbesserung der Performance in großen, komplexen 3D-Szenen.
zh_cn: 与 :ref:`doc_mesh_lod` 和 :ref:`doc_occlusion_culling` 一起，可见范围是提高大型复杂 3D 场景性能的另一个工具。

source: On this page, you'll learn:
de: Auf dieser Seite erfahren Sie:
zh_cn: 你会在这个页面中学习到：

source: What visibility ranges can do and which scenarios they are useful in.
de: Was reichweitenbasierte Sichtbarkeit leisten kann und in welchen Szenarien sie nützlich ist.
zh_cn: 可见范围可以做什么以及它们在哪些场景中有用。

source: How to set up visibility ranges (manual LOD) in Godot.
de: Einrichten von reichweitenbasierter Sichtbarkeit (manuelles LOD) in Godot.
zh_cn: 如何在 Godot 中设置可见范围（手动 LOD）。

source: How to tune visibility ranges for best performance and quality.
de: Wie man die reichweitenbasierter Sichtbarkeit für beste Performance und Qualität einstellt.
zh_cn: 如何调整可见范围以获得最佳性能及质量。

source: If you only need meshes to become less detailed over distance but don't have manually authored LOD meshes, consider relying on automatic :ref:`doc_mesh_lod` instead.
de: Wenn Sie nur Meshes benötigen, die mit zunehmender Entfernung weniger detailliert werden, aber keine manuell erstellten LOD-Meshes haben, sollten Sie sich stattdessen auf das automatische :ref:`doc_mesh_lod` verlassen.
zh_cn: 如果你只需要网格在距离上变得不那么详细，但并没有手动创建 LOD 网格，请考虑依赖自动 :ref:`doc_mesh_lod` 。

source: Note that automatic mesh LOD and visibility ranges can be used at the same time, even on the same mesh.
de: Beachten Sie, dass automatische Mesh-LOD- und reichweitenbasierte Sichtbarkeits gleichzeitig verwendet werden können, sogar für dasselbe Mesh.
zh_cn: 请注意，即使在同一网格上，依然可以同时使用自动网格 LOD 和可见范围。

source: How it works
de: Wie es funktioniert
zh_cn: 它的运作方式

source: Visibility ranges can be used with any node that inherits from GeometryInstance3D. This means they can be used not only with MeshInstance3D and MultiMeshInstance3D for artist-controlled :abbr:`HLOD (Hierarchical Level of Detail)`, but also GPUParticles3D, CPUParticles3D, Label3D, Sprite3D, AnimatedSprite3D and CSGShape3D.
de: Reichweitenbasierte Sichtbarkeit kann mit jedem Node verwendet werden, der von GeometryInstance3D erbt. Das bedeutet, dass sie nicht nur mit MeshInstance3D und MultiMeshInstance3D für von Künstlern gesteuertes :abbr:`HLOD (Hierarchisches Level of Detail)` verwendet werden können, sondern auch mit GPUParticles3D, CPUParticles3D, Label3D, Sprite3D, AnimatedSprite3D und CSGShape3D.
zh_cn: 可见范围可与继承自 GeometryInstance3D 的任何节点一起使用。这意味着它们不仅可以与 MeshInstance3D 和 MultiMeshInstance3D 一起使用以实现艺术家控制的 :abbr:`HLOD (Hierarchical Level of Detail，层次化细节层次)`，还可以与 GPUParticles3D、CPUParticles3D、Label3D、Sprite3D、AnimatedSprite3D 和 CSGShape3D 一起使用。

source: Since visibility ranges are configured on a per-node basis, this makes it possible to use different node types as part of a :abbr:`LOD (Level of Detail)` system. For example, you could display a MeshInstance3D representing a tree when up close, and replace it with a Sprite3D impostor in the distance to improve performance.
de: Da reichweitenbasierte Sichtbarkeit pro Node konfiguriert wird, ist es möglich, verschiedene Node-Typen als Teil eines :abbr:`LOD (Level of Detail)`-Systems zu verwenden. Zum Beispiel könnte man ein MeshInstance3D, das einen Baum darstellt, aus der Nähe anzeigen und es in der Ferne durch einen Sprite3D-Imitator ersetzen, um die Performance zu verbessern.
zh_cn: 由于可见范围是在每个节点的基础上配置的，因此可以使用不同的节点类型作为 :abbr:`LOD (Level of Detail、细节层次)` 系统的一部分。例如，可以在近距离时显示代表一棵树的 MeshInstance3D，并在远处将其替换为 Sprite3D 顶替物，以提高性能。

source: The benefit of :abbr:`HLOD (Hierarchical Level of Detail)` over a traditional :abbr:`LOD (Level of Detail)` system is its hierarchical nature. A single larger mesh can replace several smaller meshes, so that the number of draw calls can be reduced at a distance, but culling opportunities can be preserved when up close. For example, you can have a group of houses that uses individual MeshInstance3D nodes (one for each house) when up close, but turns into a single MeshInstance3D that represents a less detailed group of houses (or use a MultiMeshInstance3D).
de: Der Vorteil von :abbr:`HLOD (Hierarchisches Level of Detail)` gegenüber einem traditionellen :abbr:`LOD (Level of Detail)`-System ist sein hierarchischer Charakter. Ein einziges größeres Mesh kann mehrere kleinere Meshes ersetzen, so dass die Anzahl der Zeichenaufrufe in der Ferne reduziert werden kann, während in der Nähe die Möglichkeit des Culling erhalten bleibt. Beispielsweise kann eine Häusergruppe, die aus der Nähe betrachtet einzelne MeshInstance3D-Nodes (einen für jedes Haus) verwendet, in ein einziges MeshInstance3D umgewandelt werden, das eine weniger detaillierte Häusergruppe darstellt (oder ein MultiMeshInstance3D verwenden).
zh_cn: :abbr:`HLOD (Hierarchical Level of Detail，层次化细节层次)` 相对于传统 :abbr:`LOD (Level of Detail, 细节层次)` 系统的优势在于其层次性质。单个较大的网格可以替换多个较小的网格，因此可以减少远处的绘制调用数量，但可以在近距离时保留剔除机会。例如，可以设置一组房屋，在近距离时它们使用单独的 MeshInstance3D 节点（每个房屋一个），但会变成表现一组不太详细的房屋的单个 MeshInstance3D（或使用 MultiMeshInstance3D）。

source: Lastly, visibility ranges can also be used to fade certain objects entirely when the camera gets too close or too far. This can be used for gameplay purposes, but also to reduce visual clutter. For example, Label3D nodes can be faded using visibility ranges when they're too far away to be readable or relevant to the player.
de: Schließlich kann die reichweitenbasierte Sichtbarkeit auch dazu verwendet werden, bestimmte Objekte ganz auszublenden, wenn die Kamera zu nah oder zu weit weg ist. Dies kann für Gameplay-Zwecke verwendet werden, aber auch, um visuelle Vermüllung zu reduzieren. Zum Beispiel können Label3D-Nodes mit Hilfe reichweitenbasierter Sichtbarkeit ausgeblendet werden, wenn sie zu weit entfernt sind, um für den Spieler lesbar oder relevant zu sein.
zh_cn: 最后，当相机太近或太远时，可见范围也可用于使某些对象完全淡入淡出。这可以用于游戏玩法目的，也可以用来减少视觉混乱。例如，当 Label3D 节点离玩家太远而不可读或与玩家相关时，可以使用可见范围对其进行淡出。

source: Setting up visibility range
de: Einrichten des Sichtbarkeitsbereichs
zh_cn: 设置可见范围

source: This is a quick-start guide for configuring a basic LOD system. After following this guide, this LOD system will display a SphereMesh when up close and a BoxMesh when the camera is far away enough. A small hysteresis margin is also configured via the **Begin Margin** and **End Margin** properties. This prevents LODs from popping back and forth too quickly when the camera is moving at the "edge" of the LOD transition.
de: Dies ist eine Schnellstart-Anleitung für die Konfiguration eines einfachen LOD-Systems. Wenn Sie dieser Anleitung folgen, wird dieses LOD-System ein SphereMesh anzeigen, wenn Sie nah dran sind, und ein BoxMesh, wenn die Kamera weit genug entfernt ist. Über die Propertys **Abstand Beginn** und **Abstand Ende** wird außerdem eine kleiner Hysterese-Abstand konfiguriert. Dadurch wird verhindert, dass die LODs zu schnell hin und her springen, wenn sich die Kamera an der "Kante" des LOD-Übergangs bewegt.
zh_cn: 这是配置基本 LOD 系统的快速入门指南。遵循本指南，该 LOD 系统将在近距离时显示 SphereMesh，在相机足够远时显示 BoxMesh。还可以通过 **Begin Margin** 和 **End Margin** 属性配置较小的滞后边距（hysteresis margin）。当相机在 LOD 过渡的“边缘”移动时，这可以防止 LOD 来回快速出现和消失。

source: The visibility range properties can be found in the **Visibility Range** section of the GeometryInstance3D inspector after selecting the MeshInstance3D Node.
de: Die Propertys des Sichtbarkeitsbereichs sind im Abschnitt **Sichtbarkeitsbereich** des GeometryInstance3D-Inspektors nach Auswahl des MeshInstance3D-Node zu finden.
zh_cn: 选择 MeshInstance3D 节点后，可以在 GeometryInstance3D 检查器的 **Visibility Range** （可见范围） 部分中找到可见范围属性。

source: Add a Node3D node that will be used to group the two MeshInstance3D nodes together.
de: Fügen Sie einen Node3D-Node hinzu, der zur Gruppierung der beiden MeshInstance3D-Nodes verwendet wird.
zh_cn: 添加一个 Node3D 节点，用于将两个 MeshInstance3D 节点分组到一起。

source: Add a first MeshInstance3D node as a child of the Node3D. Assign a new SphereMesh to its Mesh property.
de: Fügen Sie einen ersten MeshInstance3D-Node als untergeordnetes Element des Node3D hinzu. Weisen Sie seiner Mesh-Property ein neues SphereMesh zu.
zh_cn: 添加第一个 MeshInstance3D 节点作为 Node3D 的子节点。将新的 SphereMesh 分配给其 Mesh 属性。

source: Set the first MeshInstance3D's visibility range **End** to ``10.0`` and **End Margin** to ``1.0``.
de: Setzen Sie den Sichtbarkeitsbereich **Ende** der ersten MeshInstance3D auf ``10.0`` und **Abstand Ende** auf ``1.0``.
zh_cn: 将第一个 MeshInstance3D 的可见范围 **End** 设置为 ``10.0`` ，将 **End Margin** 设置为 ``1.0`` 。

source: Add a second MeshInstance3D node as a child of the Node3D. Assign a new BoxMesh to its Mesh property.
de: Fügen Sie einen zweiten MeshInstance3D-Node als untergeordnetes Element von Node3D hinzu. Weisen Sie der Mesh-Property ein neues BoxMesh zu.
zh_cn: 添加第二个 MeshInstance3D 节点作为 Node3D 的子节点。将新的 BoxMesh 分配给其 Mesh 属性。

source: Set the second MeshInstance3D's visibility range **Begin** to ``10.0`` and **Begin Margin** to ``1.0``.
de: Setzen Sie den Sichtbarkeitsbereich **Beginn** der zweiten MeshInstance3D auf ``10.0`` und **Abstand Beginn** auf ``1.0``.
zh_cn: 将第二个 MeshInstance3D 的可见范围 **Begin** 设置为 ``10.0`` ，将 **Begin Margin** 设置为 ``1.0`` 。

source: Move the camera away and back towards the object. Notice how the object will transition from a sphere to a box as the camera moves away.
de: Bewegen Sie die Kamera von dem Objekt weg und wieder zu ihm hin. Beachten Sie, wie das Objekt von einer Kugel zu einem Kasten wird, wenn sich die Kamera entfernt.
zh_cn: 将相机移开并返回到物体。注意当相机移开时，对象如何从球体（即 SphereMesh）过渡到盒子（即 BoxMesh）。

source: Visibility range properties
de: Propertys des Sichtbarkeitsbereichs
zh_cn: 可见范围属性

source: In the inspector of any node that inherits from GeometryInstance3D, you can adjust the following properties in the GeometryInstance3D's **Visibility Range** section:
de: Im Inspektor eines jeden Nodes, der von GeometryInstance3D erbt, können Sie die folgenden Propertys im Abschnitt **Sichtbarkeitsbereich** von GeometryInstance3D anpassen:
zh_cn: 在继承自 GeometryInstance3D 的任何节点的检查器中，你都可以在 GeometryInstance3D 的 **Visibility Range** 部分中调整以下属性：

source: **Begin:** The instance will be hidden when the camera is closer to the instance's *origin* than this value (in 3D units).
de: **Beginn:** Die Instanz wird ausgeblendet, wenn die Kamera näher am *Ursprung* der Instanz ist als dieser Wert (in 3D-Einheiten).
zh_cn: **Begin（开始）：** 当相机比该值（以 3D 单位）更接近实例的 *原点* 时，实例将被隐藏。

source: **Begin Margin:** The hysteresis or alpha fade transition distance to use for the close-up transition (in 3D units). The behavior of this property depends on **Fade Mode**.
de: **Abstand Beginn:** Die Hysterese- oder Alpha-Fade-Übergangsdistanz, die für den Close-up-Übergang verwendet werden soll (in 3D-Einheiten). Das Verhalten dieser Property hängt vom **Fading-Modus** ab.
zh_cn: **Begin Margin（开始边距）：** 用于特写过渡的滞后（hysteresis）或 Alpha 淡入淡出过渡距离（以 3D 单位表示）。此属性的行为取决于 **Fade Mode** （淡入淡出模式）。

source: **End:** The instance will be hidden when the camera is further away from the instance's *origin* than this value (in 3D units).
de: **Ende:** Die Instanz wird ausgeblendet, wenn die Kamera weiter vom *Ursprung* der Instanz entfernt ist als dieser Wert (in 3D-Einheiten).
zh_cn: **End（结束）：** 当相机距离实例的 *原点* 远超过此值（以 3D 单位表示）时，实例将被隐藏。

source: **End Margin:** The hysteresis or alpha fade transition distance to use for the far-away transition (in 3D units). The behavior of this property depends on **Fade Mode**.
de: **Abstand Ende:** Der Hysterese- oder Alpha-Fade-Übergangsabstand, der für den Übergang in die Ferne verwendet werden soll (in 3D-Einheiten). Das Verhalten dieser Property hängt vom **Fading-Modus** ab.
zh_cn: **End Margin（结束边距）：** 用于远距离过渡的滞后或 alpha 淡入淡出过渡距离（以 3D 单位表示）。此属性的行为取决于 **Fade Mode** （淡入淡出模式）。

source: **Fade Mode:** Controls how the transition between LOD levels should be performed. See below for details.
de: **Fading-Modus:** Legt fest, wie der Übergang zwischen den LOD-Stufen erfolgen soll. Siehe unten für Details.
zh_cn: **Fade Mode（淡入淡出模式）：** 控制如何执行 LOD 级别之间的过渡。详情请参阅下文。

source: Fade mode
de: Fading-Modus
zh_cn: 淡入淡出模式

source: The fade mode chosen only has a visible impact if either **Visibility Range > Begin Margin** or **Visibility Range > End Margin** is greater than ``0.0``.
de: Der gewählte Fading-Modus hat nur dann eine sichtbare Auswirkung, wenn entweder **Sichtbarkeitsbereich > Abstand Beginn** oder **Sichtbarkeitsbereich > Abstand Ende** größer als ``0,0`` ist.
zh_cn: 仅当 **Visibility Range > Begin Margin** 或 **Visibility Range > End Margin** 大于 ``0.0`` 时，所选的淡入淡出模式才会产生可见的影响。

source: In the inspector's **Visibility Range** section, there are 3 fade modes to choose from:
de: Im Abschnitt **Sichtbarkeitsbereich** des Inspektors können Sie zwischen 3 Fading-Modi wählen:
zh_cn: 在检查器的 **Visibility Range** 部分中，有 3 种淡入淡出模式可供选择：

source: **Disabled:** Uses hysteresis to switch between LOD levels instantly. This prevents situations where LOD levels are switched back and forth quickly when the player moves forward and then backward at the LOD transition point. The hystereis distance is determined by **Visibility Range > Begin Margin** and **Visibility Range > End Margin**. This mode provides the best performance as it doesn't force rendering to become transparent during the fade transition.
de: **Deaktiviert:** Verwendet die Hysterese, um sofort zwischen den LOD-Ebenen zu wechseln. Dies verhindert Situationen, in denen die LOD-Ebenen schnell hin- und hergeschaltet werden, wenn sich der Spieler am LOD-Übergangspunkt vorwärts und dann rückwärts bewegt. Der Hystereseabstand wird durch **Sichtbarkeitsbereich > Abstand Anfang** und **Sichtbarkeitsbereich > Abstand Ende** bestimmt. Dieser Modus bietet die beste Performance, da er das Rendering nicht dazu zwingt, während des Fading-Übergangs transparent zu werden.
zh_cn: **Disabled（禁用）：** 使用滞后（hysteresis）在 LOD 级别之间即时切换。这可以防止当玩家在 LOD 过渡点向前和向后移动时，LOD 级别快速来回切换的情况。滞后距离（hystereis distance）由 **Visibility Range > Begin Margin** 和 **Visibility Range > End Margin** 确定。此模式可提供最佳性能，因为它不会强制渲染在淡入淡出过渡期间变得透明。

source: **Self:** Uses alpha blending to smoothly fade between LOD levels. The node will fade-out itself when reaching the limits of its own visibility range. The fade transition distance is determined by **Visibility Range > Begin Margin** and **Visibility Range > End Margin**. This mode forces transparent rendering on the object during its fade transition, so it has a performance impact.
de: **Selbst:** Verwendet Alpha-Blending, um sanft zwischen LOD-Ebenen zu überblenden. Der Node blendet sich selbst aus, wenn er die Grenzen seines eigenen Sichtbarkeitsbereichs erreicht. Die Fading-Übergangsdistanz wird durch **Sichtbarkeitsbereich > Abstand Beginn** und **Sichtbarkeitsbereich > Abstand Ende** bestimmt. Dieser Modus erzwingt ein transparentes Rendering des Objekts während des Fading-Übergangs und hat daher Auswirkungen auf die Performance.
zh_cn: **Self（自身）：** 使用 Alpha 混合在 LOD 级别之间平滑地淡入淡出。当达到其自身可见范围的极限时，节点将自行淡出。淡入淡出过渡距离由 **Visibility Range > Begin Margin** 和 **Visibility Range > End Margin** 确定。此模式在淡入淡出过渡期间，强制对对象进行透明渲染，因此会对性能产生一定影响。

source: **Dependencies:** Uses alpha blending to smoothly fade between LOD levels. The node will fade-in its dependencies when reaching the limits of its own visibility range. The fade transition distance is determined by **Visibility Range > Begin Margin** and **Visibility Range > End Margin**. This mode forces transparent rendering on the object during its fade transition, so it has a performance impact. This mode is intended for hierarchical LOD systems using :ref:`Visibility parent <doc_visibility_ranges_visibility_parent>`. It acts the same as **Self** if visibility ranges are used to perform non-hierarchical LOD.
de: **Abhängigkeiten:** Verwendet Alpha-Blending, um sanft zwischen LOD-Ebenen zu überblenden. Der Node blendet seine Abhängigkeiten ein, wenn er die Grenzen seines eigenen Sichtbarkeitsbereichs erreicht. Der Abstand des Fading-Übergangs wird durch **Sichtbarkeitsbereich > Abstand Beginn** und **Sichtbarkeitsbereich > Abstand Ende** bestimmt. Dieser Modus erzwingt ein transparentes Rendering des Objekts während des Fading-Übergangs und hat daher Auswirkungen auf die Performance. Dieser Modus ist für hierarchische LOD-Systeme gedacht, die :ref:`Sichtbarkeit Parent <doc_visibility_ranges_visibility_parent>` verwenden. Er verhält sich genauso wie **Sebst**, wenn reichweitenbasierte Sichtbarkeit verwendet wird, um nicht-hierarchische LOD durchzuführen.
zh_cn: **Dependencies：** （依赖项）使用 Alpha 混合在 LOD 级别之间平滑淡入淡出。当达到其自身可见范围的限制时，节点将淡入其依赖项。淡入淡出过渡距离由 **Visibility Range > Begin Margin** 和 **Visibility Range > End Margin** 确定。此模式在淡入淡出的过渡期间，强制对对象进行透明渲染，因此会对性能产生影响。此模式适用于使用 :ref:`可见性父级 <doc_visibility_ranges_visibility_parent>` 的分层 LOD 系统。如果可见性范围用于执行非分层 LOD，则它的作用与 **Self** 相同。

source: Visibility parent
de: Sichtbarkeit Parent
zh_cn: 可见性父级

source: The **Visibility Parent** property makes it easier to set up :abbr:`HLOD (Hierarchical Level of Detail)`. It allows automatically hiding child nodes if its parent is visible given its current visibility range properties.
de: Die **Sichtbarkeit Parent**-Property erleichtert die Einrichtung von :abbr:`HLOD (Hierarchisches Level of Detail)`. Sie ermöglicht es, untergeordnete Nodes automatisch auszublenden, wenn ihre übergeordneten Nodes aufgrund ihrer aktuellen Sichtbarkeitsbereichs-Propertys sichtbar sind.
zh_cn: **Visibility Parent** （可见性父级）属性让设置 :abbr:`HLOD (Hierarchical Level of Detail)`变得更加容易。如果给定其当前可见范围属性，其父节点可见，则它允许自动隐藏子节点。

source: The target of **Visibility Parent** *must* inherit from :ref:`class_GeometryInstance3D`.
de: Das Ziel von **Sichtbarkeit Parent** *muss* von :ref:`class_GeometryInstance3D` erben.
zh_cn: **Visibility Parent** 的目标 *必须* 继承自 :ref:`class_GeometryInstance3D`。

source: Despite its name, the **Visibility Parent** property *can* point to a node that is not a parent of the node in the scene tree. However, it is impossible to point **Visibility Parent** towards a child node, as this creates a dependency cycle which is not supported. You will get an error message in the Output panel if a dependency cycle occurs.
de: Trotz ihres Namens kann die Property **Sichtbarkeit Parent** auf einen Node verweisen, der kein Parent des Nodes im Szenenbaum ist. Es ist jedoch unmöglich, **Sichtbarkeit Parent** auf einen untergeordneten Node zu zeigen zu lassen, da dies einen Abhängigkeitszyklus erzeugt, der nicht unterstützt wird. Sie erhalten eine Fehlermeldung im Ausgabefenster, wenn ein Abhängigkeitszyklus auftritt.
zh_cn: 尽管它的名称如此， **Visibility Parent** 属性 *可以* 指向的不是场景树中节点的父级的节点。然而，也不可能将 **Visibility Parent** 指向子节点，因为这会创建不支持的依赖循环。如果发生依赖循环，你将在“输出”面板中收到一条错误消息。

source: Given the following scene tree (where all nodes inherit from GeometryInstance3D):
de: Gegeben sei der folgende Szenenbaum (bei dem alle Nodes von GeometryInstance3D erben):
zh_cn: 给定以下场景树（其中所有节点都继承自 GeometryInstance3D）：

source: In this example, *BatchOfHouses* is a large mesh designed to represent all child nodes when viewed at a distance. *House1* to *House4* are smaller MeshInstance3Ds representing individual houses. To configure HLOD in this example, we only need to configure two things:
de: In diesem Beispiel ist *BatchOfHouses* ein großes Mesh, das alle untergeordneten Nodes darstellen soll, wenn sie aus der Ferne betrachtet werden. *House1* bis *House4* sind kleinere MeshInstance3Ds, die einzelne Häuser darstellen. Um HLOD in diesem Beispiel zu konfigurieren, müssen wir nur zwei Dinge konfigurieren:
zh_cn: 在此示例中， *BatchOfHouses* 是一个大型网格，设计目标是用于在远处查看时展示所有的子节点。 *House1* 到 *House4* 是代表各个房屋的较小 MeshInstance3D。为了在本示例中配置 HLOD，我们只需要配置两条：

source: Set **Visibility Range Begin** to a number greater than `0.0` so that *BatchOfHouses* only appears when far away enough from the camera. Below this distance, we want *House1* to *House4* to be displayed instead.
de: Setzen Sie **Beginn Sichtbarkeitsbereich** auf eine Zahl größer als `0.0`, damit *BatchOfHouses* nur angezeigt wird, wenn es weit genug von der Kamera entfernt ist. Unterhalb dieser Entfernung sollen stattdessen *House1* bis *House4* angezeigt werden.
zh_cn: 将 **Visibility Range Begin** 设置为大于 ``0.0`` 的数字，以便 *BatchOfHouses* 仅在距相机足够远时出现。而低于这个距离，我们则希望显示 *House1* 到 *House4* 的较小的网格。

source: On *House1* to *House4*, assign the **Visibility Parent** property to *BatchOfHouses*.
de: Weisen Sie bei *House1* bis *House4* die Property **Sichtbarkeit Parent** der Property *BatchOfHouses* zu.
zh_cn: 把 *House1* 到 *House4* 上的 **Visibility Parent** 属性分配给 *BatchOfHouses* 。

source: This makes it easier to perform further adjustments, as you don't need to adjust the **Visibility Range Begin** of *BatchOfHouses* and **Visibility Range End** of *House1* to *House4*.
de: Dies erleichtert die Durchführung weiterer Anpassungen, da Sie **Beginn Sichtbarkeitsbereich** von *BatchOfHouses* und den **Ende Sichtbarkeitsbereich** von *House1* bis *House4* nicht anpassen müssen.
zh_cn: 这个设置可以让进一步调整变得更加容易，因为你再不需要调整 *BatchOfHouses* 的 **Visibility Range Begin** ，和从 *House1* 到 *House4* 的 **Visibility Range End** 。

source: Fade mode is automatically handled by the **Visibility Parent** property, so that the child nodes only become hidden once the parent node is fully faded out. This is done to minimize visible pop-in. Depending on your :abbr:`HLOD (Hierarchical Level of Detail)` setup, you may want to try both the **Self** and **Dependencies** :ref:`fade modes <doc_visibility_ranges_fade_mode>`.
de: Der Fading-Modus wird automatisch über die Property **Sichtbarkeit Parent** gesteuert, so dass die Child-Nodes erst ausgeblendet werden, wenn der Parent-Node vollständig ausgeblendet ist. Dies geschieht, um sichtbares Pop-In zu minimieren. Je nach :abbr:`HLOD (Hierarchisches Level of Detail)` können Sie sowohl die **Self** als auch die **Dependencies** :ref:`Fading-Modi <doc_visibility_ranges_fade_mode>` ausprobieren.
zh_cn: 淡入淡出模式由 **Visibility Parent** 属性自动处理，因此只有在父节点完全淡出时，子节点才会隐藏。这样做是为了尽量减少可视弹入。根据你的 :abbr:`HLOD (Hierarchical Level of Detail)`设置，可能需要尝试 **Self** 和 **Dependencies** :ref:`淡入淡出模式 <doc_visibility_ranges_fade_mode>`。

source: Nodes hidden via the **Visible** property are essentially removed from the visibility dependency tree, so dependent instances will not take the hidden node or its ancestors into account.
de: Nodes, die über die **Sichtbar**-Property ausgeblendet werden, werden im Wesentlichen aus dem Sichtbarkeits-Abhängigkeitsbaum entfernt, so dass abhängige Instanzen den ausgeblendeten Node oder seine übergeordneten Elemente nicht berücksichtigen.
zh_cn: 通过 **Visible** 属性隐藏的节点，本质上是从可见性依赖树中删除的，因此依赖实例不会考虑隐藏节点或其先祖节点。

source: In practice, this means that if the target of the **Visibility Parent** node is hidden by setting its **Visible** property to ``false``, the node will not be hidden according to the **Visibility Range Begin** value specified in the visibility parent.
de: In der Praxis bedeutet dies, dass, wenn das Ziel des Nodes **Sichtbarkeit Parent** durch Setzen seiner **Sichtbar** Property auf ``false`` ausgeblendet wird, der Node nicht entsprechend dem **Beginn Sichtbarkeitsbereich**-Wert, der im Sichtbarkeit Parent angegeben ist, ausgeblendet wird.
zh_cn: 实际上这意味着，如果通过将 **Visibility Parent** 节点的 **Visible** 属性设置为 ``false`` 来隐藏其目标，则该节点将不会根据可见性父级中指定的 **Visibility Range Begin** 值进行隐藏。

source: Configuration tips
de: Tipps zur Konfiguration
zh_cn: 配置建议

source: Use simpler materials at a distance to improve performance
de: Verwenden Sie einfachere Materialien in der Ferne, um die Performance zu verbessern
zh_cn: 在距离较远时使用更简单的材质以提高性能
