Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/visibility_ranges.po
Languages: de, zh_cn

source: One way to further improve performance is to use simpler materials for distant LOD meshes. While using LOD meshes will reduce the number of vertices that need to be rendered, the per-pixel shading load for materials remains identical. However, per-pixel shading load is regularly a bottleneck on the GPU in complex 3D scenes. One way to reduce this shading load on the GPU is to use simpler materials when they don't make much of a visual difference.
de: Eine Möglichkeit, die Performance weiter zu verbessern, besteht darin, einfachere Materialien für entfernte LOD-Meshes zu verwenden. Durch die Verwendung von LOD-Meshes wird zwar die Anzahl der zu rendernden Vertices reduziert, die Pro-Pixel-Shading-Last für Materialien bleibt jedoch identisch. In komplexen 3D-Szenen stellt die Shading-Belastung durch die Schattierung pro Pixel jedoch regelmäßig einen Bottleneck für die GPU dar. Eine Möglichkeit, diese Shading-Belastung auf der GPU zu reduzieren, besteht darin, einfachere Materialien zu verwenden, wenn sie keinen großen visuellen Unterschied machen.
zh_cn: 想要进一步提高性能的话，一种方法是对远处的 LOD 网格使用更简单的材质。虽然使用 LOD 网格会减少需要渲染的顶点数量，但材质的每像素着色负载保持不变。然而，在复杂的 3D 场景中，每像素着色负载通常是 GPU 的瓶颈。减少 GPU 着色负载的其中一种方法，就是在不会产生太大视觉差异时使用更简单的材质。

source: Performance gains when doing so should be carefully measured, as increasing the number of *unique* materials in a scene has a performance cost on its own. Still, using simpler materials for distant LOD meshes can still result in a net performance gain as a result of the fewer per-pixel calculations required.
de: Performancegewinne sollten dabei sorgfältig abgewogen werden, da die Erhöhung der Anzahl *eindeutiger* Materialien in einer Szene allein schon Performance-Kosten mit sich bringt. Dennoch kann die Verwendung von einfacheren Materialien für Meshes mit geringer LOD zu einem Netto-Performance-Gewinn führen, da weniger Berechnungen pro Pixel erforderlich sind.
zh_cn: 这样做时应仔细衡量性能增益，因为增加场景中 *独特* 材质的数量本身就会产生性能成本。尽管如此，对远处的 LOD 网格使用更简单的材质仍然可以带来净性能增益，因为这样做所需的每像素计算更少。

source: For example, on the materials used by distant LOD meshes, you can disable expensive material features such as:
de: Bei den Materialien, die von Meshes mit entferntem LOD verwendet werden, können Sie zum Beispiel teure Materialfunktionen deaktivieren:
zh_cn: 例如，在远处的 LOD 网格使用的材质上，可以禁用性能成本昂贵的材质功能，如：

source: Normal Map (especially on mobile platforms)
de: Normal Map (insbesondere auf mobilen Plattformen)
zh_cn: 法线贴图（尤其是在移动平台上）

source: Rim
de: Umrandung
zh_cn: Rim（边缘）

source: Clearcoat
de: Klarlack
zh_cn: Clearcoat（清漆）

source: Anisotropy
de: Anisotropie
zh_cn: Anisotropy（各向异性）

source: Height
de: Höhe
zh_cn: 高度

source: Subsurface Scattering
zh_cn: Subsurface Scattering（次表面散射）

source: Back Lighting
de: Hintergrundbeleuchtung
zh_cn: 背光照明

source: Refraction
de: Brechung
zh_cn: Refraction(折射)

source: Proximity Fade
de: Nah-Fading
zh_cn: 邻近淡出

source: Use dithering for LOD transitions
de: Dithering für LOD-Übergänge verwenden
zh_cn: 为 LOD 过渡使用抖动

source: Godot currently only supports alpha-based fading for visibility ranges. You can however use dithering instead by using several different materials for different LOD levels.
de: Godot unterstützt derzeit nur alphabasiertes Fading für reichweitenbasierte Sichtbarkeit. Sie können jedoch stattdessen Dithering verwenden, indem Sie mehrere verschiedene Materialien für verschiedene LOD-Stufen verwenden.
zh_cn: Godot 目前仅支持可见范围内基于alpha值的淡入淡出，但你可以以为不同 LOD 等级使用不同的材质来使用颜色抖动。

source: There are two advantages to using dithering over alpha blending for LOD transitions:
de: Die Verwendung von Dithering gegenüber Alpha-Blending für LOD-Übergänge hat zwei Vorteile:
zh_cn: 在进行LOD过渡时，相比使用 Alpha 混合，颜色抖动有两个优点：

source: Higher performance, as dithering transparency is faster to render compared to alpha blending.
de: Höhere Performance, da Dithering-Transparenz im Vergleich zu Alpha-Blending schneller gerendert werden kann.
zh_cn: 抖动透明的渲染速度比 Alpha 混合更快，性能更高。

source: No visual glitches due to :ref:`transparency sorting issues <doc_3d_rendering_limitations_transparency_sorting>` during LOD transitions.
de: Keine visuellen Störungen aufgrund von :ref:`Transparenzsortierungsproblemen <doc_3d_rendering_limitations_transparency_sorting>` bei LOD-Übergängen.
zh_cn: 在LOD转换期间不会由于 :ref:`透明度排序问题 <doc_3d_rendering_limitations_transparency_sorting>` 而发生视觉故障。

source: The downside of dithering is that a "noisy" pattern is visible during LOD fade transitions. This may not be as noticeable at higher viewport resolutions or when temporal antialiasing is enabled.
de: Der Nachteil des Dithering ist, dass bei LOD-Fading-Übergängen ein "verrauschtes" Muster sichtbar wird. Dies ist bei höheren Auflösungen des Ansichtsfensters oder bei aktiviertem temporalem Antialiasing möglicherweise nicht so auffällig.
zh_cn: 颜色抖动的缺点是LOD淡入淡出过渡时会出现噪点。但在使用较大的视口分辨率或者启用时间抗锯齿（TAA）时可能不会很明显。

source: Also, as distance fade in BaseMaterial3D only supports fading up close *or* fading when far away, this setup is best used with only two LODs as part of the setup.
de: Da das Fern-Fading in BaseMaterial3D nur das Fading in der Nähe *oder* das Fading in der Ferne unterstützt, wird diese Einstellung am besten mit nur zwei LODs als Teil der Einstellung verwendet.
zh_cn: 另外，由于 BaseMaterial3D 的距离淡入淡出只支持近距离淡出 *或者* 远距离淡入淡出，该设置最好只使用两个LOD作为设定的一部分。

source: Ensure **Begin Margin** and **End Margin** is set to ``0.0`` on both MeshInstance3D nodes, as hysteresis or alpha fade are not desired here.
de: Vergewissern Sie sich, dass **Abstand Beginn** und **Abstand Ende** auf beiden MeshInstance3D-Nodes auf ``0.0`` gesetzt ist, da Hysterese oder Alpha Fade hier nicht erwünscht sind.
zh_cn: 确保两个 MeshInstance3D 节点上的 **Begin Margin** 和 **End Margin** 属性都设置为 ``0.0`` ，因为此处不需要滞后或者 alpha 淡入淡出。

source: On both MeshInstance3D nodes, *decrease* **Begin** by the desired fade transition distance and *increase* **End** by the same distance. This is required for the dithering transition to actually be visible.
de: *Verringern* Sie auf beiden MeshInstance3D-Nodes **Beginn** um die gewünschte Distanz des Fading-Übergangs und erhöhen Sie **Ende** um dieselbe Distanz. Dies ist erforderlich, damit der Dithering-Übergang tatsächlich sichtbar ist.
zh_cn: 在两个 MeshInstance3D 节点上，在\ *减少* **Begin**\ 所需的淡入淡出过渡距离的同时，\ *增加* **End** 相同的距离是想要看见抖动过渡所必需的。

source: On the MeshInstance3D that is displayed up close, edit its material in the inspector. Set its **Distance Fade** mode to **Object Dither**. Set **Min Distance** to the same value as the visibility range **End**. Set **Max Distance** to the same value *minus* the fade transition distance.
de: Bearbeiten Sie bei der MeshInstance3D, die aus der Nähe angezeigt wird, das Material im Inspektor. Setzen Sie den Modus **Fern-Fading** auf **Objekt-Dither**. Setzen Sie **Min Distanz** auf denselben Wert wie den Sichtbarkeitsbereich **End**. Setzen Sie **Max Distanz** auf denselben Wert *minus* der Fading-Übergangsdistanz.
zh_cn: 打开近距离显示的 MeshInstance3D 的材质编辑面板，将 **距离淡入淡出（Distance fade) ** 模式设置为 **物体抖动**。将 *Min Distance* 属性设置为与可见范围 **End** 相同的值，将 **最大距离** 设置为相同的值 *减去* 淡入淡出过渡距离。

source: On the MeshInstance3D that is displayed far away, edit its material in the inspector. Set its **Distance Fade** mode to **Object Dither**. Set **Min Distance** to the same value as the visibility range **Begin**. Set **Max Distance** to the same value *plus* the fade transition distance.
de: Bearbeiten Sie das Material der MeshInstance3D, die in der Ferne angezeigt wird, im Inspektor. Setzen Sie seinen **Fern-Fading**-Modus auf **Objekt-Dither**. Setzen Sie **Min Distanz** auf denselben Wert wie den Sichtbarkeitsbereich **Beginn**. Setzen Sie **Max Distanz** auf denselben Wert *plus* die Fading-Übergangsdistanz.
zh_cn: 在远距离显示的 MeshInstance3D 的属性面板里编辑材质，将 **距离淡入淡出（Distance fade) ** 模式设置为 **物体抖动**。将 **Min Distance** 属性设置为与可见范围 **Begin** 相同的值，将 **Max Distance** 设置为相同的值 *加上* 淡入淡出过渡距离。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
