Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/volumetric_fog.po
Languages: de, zh_cn, zh_tw

source: Assign a new FogMaterial to the FogVolume node's **Material** property.
de: Weisen Sie der Property **Material** des FogVolume-Nodes ein neues FogMaterial zu.
zh_cn: 将新的 FogMaterial 分配给 FogVolume 节点的 **Material** 属性。
zh_tw: 將新的 FogMaterial 指派給 FogVolume 節點的 **Material** 屬性。

source: In the FogMaterial, set **Density** to a positive value to increase density within the FogVolume, or a negative value to subtract the density from global volumetric fog.
de: Setzen Sie **Dichte** im FogMaterial auf einen positiven Wert, um die Dichte im FogVolume zu erhöhen, oder auf einen negativen Wert, um die Dichte vom globalen volumetrischen Nebel zu subtrahieren.
zh_cn: 在 FogMaterial 中，将 **密度** 设置为正值以增加 FogVolume 内的密度，或设置为负值以从全局体积雾中减去密度。
zh_tw: 在 FogMaterial 中，將 **Density** 設定為正值以增加 FogVolume 內的密度，或設定為負值以從全域體積霧中減去密度。

source: Configure the FogVolume's extents and shape as needed.
de: Konfigurieren Sie die Ausdehnung und Form des FogVolumes nach Bedarf.
zh_cn: 根据需要配置 FogVolume 的范围和形状。
zh_tw: 根據需要配置 FogVolume 的範圍和形狀。

source: Thin fog volumes may appear to flicker when the camera moves or rotates. This can be alleviated by increasing the **Rendering > Environment > Volumetric Fog > Volume Depth** project setting (at a performance cost) or by decreasing **Length** in the Environment volumetric fog properties (at no performance cost, but at the cost of lower fog range). Alternatively, the FogVolume can be made thicker and use a lower density in the **Material**.
de: Dünne Nebelvolumen scheinen zu flackern, wenn sich die Kamera bewegt oder dreht. Dies kann durch Erhöhen der Projekteinstellung **Rendern > Environment > Volumetrischer Nebel > Volumentiefe** (auf Kosten der Performance) oder durch Verringern der **Länge** in den Propertys für volumetrischen Nebel in der Umgebung (ohne Kosten für die Performance, aber auf Kosten einer geringeren Nebelreichweite) gemildert werden. Alternativ kann das Nebelvolumen dicker gemacht werden und eine geringere Dichte im **Material** verwenden.
zh_cn: 当相机移动或旋转时，薄雾体积可能会出现闪烁。 这可以通过增加 **渲染 > 环境 > 体积雾 > 体积深度** 项目设置（以性能成本）或通过减少环境体积雾属性中的\ **长度**\ （没有性能成本，但以性能为代价）来缓解。或者，可以将 FogVolume 做得更厚，并在 **Material**\ （材质）中使用较低的密度。
zh_tw: 當相機移動或旋轉時，薄霧體積可能會出現閃爍。這可以透過增加**算繪> 環境> 體積霧> 體積深度** 專案設定（以效能成本）或透過減少環境體積霧屬性中的**長度**（沒有效能成本，但以效能為代價）來緩解。較低霧範圍的成本）。或者，可以將 FogVolume 做得更厚，並在**材質**中使用較低的密度。

source: FogVolume properties
de: FogVolume-Propertys
zh_cn: FogVolume 属性
zh_tw: 節點屬性

source: **Extents:** The size of the FogVolume when **Shape** is **Ellipsoid**, **Cone**, **Cylinder** or **Box**. If **Shape** is **Cone** or **Cylinder**, the cone/cylinder will be adjusted to fit within the extents. Non-uniform scaling of cone/cylinder shapes via the **Extents** property is not supported, but you can scale the FogVolume node instead.
de: **Ausdehnung:** Die Größe des FogVolume, wenn **Shape** **Ellipsoid**, **Kegel**, **Zylinder** oder **Box** ist. Wenn **Shape** **Kegel** oder **Zylinder** ist, wird der Kegel/Zylinder so angepasst, dass er in die Ausdehnung passt. Eine ungleichmäßige Skalierung von Kegel-/Zylinderformen über die **Ausdehnung**-Property wird nicht unterstützt, aber Sie können stattdessen den FogVolume-Node skalieren.
zh_cn: **Extents：** （范围）当 **Shape** 为 **Ellipsoid** 、 **Cone** 、 **Cylinder** 或 **Box** 时 FogVolume 的大小。 如果 **形状** 是 **圆锥体** 或 **圆柱体** ，圆锥体/圆柱体将被调整以适应范围。 不支持通过 **Extents** 属性对圆锥体/圆柱体形状进行非均匀缩放，但你可以改为缩放 FogVolume 节点。
zh_tw: **範圍：**當 **Shape** 為 **Ellipsoid**、**Cone**、**Cylinder** 或 **Box** 時 FogVolume 的大小。如果 **形狀** 是 **圓錐體** 或 **圓柱體**，圓錐體/圓柱體將被調整以適應範圍。不支援透過 **Extents** 屬性對圓錐體/圓柱體形狀進行非均勻縮放，但您可以改為縮放 FogVolume 節點。

source: **Shape:** The shape of the FogVolume. This can be set to **Ellipsoid**, **Cone**, **Cylinder**, **Box** or **World** (acts as global volumetric fog).
de: **Shape:** Die Form des FogVolumes. Diese kann auf **Ellipsoid**, **Kegel**, **Zylinder**, **Box** oder **Welt** (wirkt als globaler volumetrischer Nebel) eingestellt werden.
zh_cn: **Shape：** （形状）FogVolume 的形状。 可以设置为 **Ellipsoid** （椭球体）、 **Cone** （锥体）、 **Cylinder** （圆柱体）、 **Box** （盒子）或 **World** （充当全局体积雾）。
zh_tw: **形狀：** FogVolume 的形狀。可設定為 **Ellipsoid**、**Cone**、**Cylinder**、**Box** 或 **World** （作為全域體積霧）。

source: **Material:** The material used by the FogVolume. Can be either a built-in FogMaterial or a custom ShaderMaterial (:ref:`doc_fog_shader`).
de: **Material:** Das vom FogVolume verwendete Material. Kann entweder ein eingebautes FogMaterial oder ein benutzerdefiniertes ShaderMaterial sein (:ref:`doc_fog_shader`).
zh_cn: **Material：** FogVolume 使用的材质。 可以是内置 FogMaterial 或自定义 ShaderMaterial ( :ref:`doc_fog_shader` )。
zh_tw: **材質：** FogVolume 使用的材質。可以是內建 FogMaterial 或自訂 ShaderMaterial (:ref:`doc_fog_shader`)。

source: After choosing **New FogMaterial** in the **Material** property, you can adjust the following properties in FogMaterial:
de: Nachdem Sie **Neues FogMaterial** in der **Material**-Property gewählt haben, können Sie die folgenden Propertys in FogMaterial anpassen:
zh_cn: 在 **Material** 属性中选择 **新建 FogMaterial** 后，你可以在 FogMaterial 中调整以下属性：
zh_tw: 在**Material**屬性中選擇**New FogMaterial**後，您可以在FogMaterial中調整以下屬性：

source: **Density:** The density of the FogVolume. Denser objects are more opaque, but may suffer from under-sampling artifacts that look like stripes. Negative values can be used to subtract fog from other FogVolumes or global volumetric fog.
de: **Dichte:** Die Dichte des FogVolumes. Dichtere Objekte sind undurchsichtiger, können aber durch Unterabtastung Artefakte aufweisen, die wie Streifen aussehen. Negative Werte können verwendet werden, um Nebel von anderen FogVolumes oder globalem volumetrischen Nebel zu subtrahieren.
zh_cn: **Density：** FogVolume 的密度。 密度较大的对象更加不透明，但可能会出现看起来像条纹的采样不足的伪影。 负值可用于从其他 FogVolume 或全局体积雾中减去雾。
zh_tw: **密度：** FogVolume 的密度。密度較大的物件更加不透明，但可能會出現看起來像條紋的取樣不足的偽影。負值可用於從其他 FogVolume 或全域體積霧中減去霧氣。

source: **Albedo:** The single-scattering Color of the FogVolume. Internally, member albedo is converted into single-scattering, which is additively blended with other FogVolumes and global volumetric fog's **Albedo**.
de: **Albedo:** Die einfach streuende Farbe des FogVolumes. Intern wird das Member-Albedo in Einzelstreuung umgewandelt, die additiv mit anderen FogVolumes und der **Albedo** des globalen volumetrischen Nebels gemischt wird.
zh_cn: **Albedo：** （反照率）FogVolume 的单散射颜色。 在内部，成员反照率转换为单散射，与其他 FogVolume 和全局体积雾的 **Albedo** 相加混合。
zh_tw: **反照率：** FogVolume 的單散射顏色。在內部，成員反照率轉換為單一散射，與其他 FogVolume 和全域體積霧的 **反照率** 相加混合。

source: **Emission:** The Color of the light emitted by the FogVolume. Emitted light will not cast light or shadows on other objects, but can be useful for modulating the Color of the FogVolume independently from light sources.
de: **Emission:** Die Farbe des vom FogVolume emittierten Lichts. Das emittierte Licht wirft kein Licht oder Schatten auf andere Objekte, kann aber nützlich sein, um die Farbe des FogVolumes unabhängig von Lichtquellen zu modulieren.
zh_cn: **Emission：** （自发光）FogVolume 发出的光的颜色。 发射的光不会在其他对象上投射光或阴影，但可用于独立于光源调制 FogVolume 的颜色。
zh_tw: **發射：** FogVolume 發出的光的顏色。發射的光不會在其他物件上投射光或陰影，但可用於獨立於光源調變 FogVolume 的顏色。

source: **Height Falloff:** The rate by which the height-based fog decreases in density as height increases in world space. A high falloff will result in a sharp transition, while a low falloff will result in a smoother transition. A value of ``0.0`` results in uniform-density fog. The height threshold is determined by the height of the associated FogVolume.
de: **Höhenabfall:** Die Rate, mit der die Dichte des höhenbasierten Nebels mit zunehmender Höhe im World-Space abnimmt. Ein hoher Falloff-Wert führt zu einem scharfen Übergang, während ein niedriger Falloff-Wert einen sanfteren Übergang bewirkt. Ein Wert von ``0.0`` ergibt einen Nebel mit gleichmäßiger Dichte. Die Höhenschwelle wird durch die Höhe des zugehörigen FogVolumes bestimmt.
zh_cn: **Height Falloff：** （高度衰减）随着世界空间中高度的增加，基于高度的雾密度降低的速率。 高衰减将导致急剧的过渡，而低衰减将导致更平滑的过渡。 值 ``0.0`` 会产生均匀密度的雾。 高度阈值由关联的 FogVolume 的高度确定。
zh_tw: **高度衰減：** 隨著世界空間中高度的增加，基於高度的霧密度降低的速率。高衰減將導致急劇的過渡，而低衰減將導致更平滑的過渡。值“0.0”會產生均勻密度的霧。高度閾值由關聯的 FogVolume 的高度決定。

source: **Edge Fade:** The hardness of the edges of the FogVolume. A higher value will result in softer edges, while a lower value will result in harder edges.
de: **Kanten-Fading:** Die Härte der Kanten des FogVolume. Ein höherer Wert führt zu weicheren Kanten, während ein niedrigerer Wert zu härteren Kanten führt.
zh_cn: **Edge Fade：** （边缘淡入淡出）FogVolume 边缘的硬度。 较高的值将导致较柔和的边缘，而较低的值将导致较硬的边缘。
zh_tw: **邊緣淡入淡出：** FogVolume 邊緣的硬度。較高的值將導致較柔和的邊緣，而較低的值將導致較硬的邊緣。

source: **Density Texture:** The 3D texture that is used to scale the member density of the FogVolume. This can be used to vary fog density within the FogVolume with any kind of static pattern. For animated effects, consider using a custom :ref:`fog shader <doc_fog_shader>`. You can import any image as a 3D texture by :ref:`changing its import type in the Import dock <doc_importing_images_changing_import_type>`.
de: **Dichte-Textur:** Die 3D-Textur, die zur Skalierung der Memberdichte des FogVolumes verwendet wird. Dies kann verwendet werden, um die Nebeldichte innerhalb des FogVolumes mit jeder Art von statischem Muster zu variieren. Für animierte Effekte sollten Sie einen eigenen :ref:`Fog-Shader <doc_fog_shader>` verwenden. Sie können jedes Bild als 3D-Textur importieren, indem Sie :ref:`seinen Importtyp im Import-Dock ändern <doc_importing_images_changing_import_type>`.
zh_cn: **Density Texture：**\ （密度纹理）用于缩放 FogVolume 的成员密度的 3D 纹理。 这可用于通过任何类型的静态图案来改变 FogVolume 内的雾密度。 对于动画效果，请考虑使用自定义\ :ref:`雾着色器 <doc_fog_shader>`\ 。你可以\ :ref:`在“导入”面板中更改其导入类型 <doc_importing_images_changing_import_type>`\ ，将任何图像导入为 3D 纹理。
zh_tw: **密度紋理：** 用於縮放 FogVolume 的成員密度的 3D 紋理。這可用於透過任何型別的靜態圖案來改變 FogVolume 內的霧密度。對於動畫效果，請考慮使用自訂霧著色器 <doc_fog_shader>`。您可以透過在匯入塢 <doc_importing_images_changing_import_type> 中變更其匯入型別，將任何影像匯入為 3D 紋理。

source: Using 3D noise density textures
de: Verwendung von 3D-Rauschdichte-Texturen
zh_cn: 使用 3D 噪声密度纹理
zh_tw: 使用原型紋理

source: Since Godot 4.1, there is a NoiseTexture3D resource that can be used to procedurally generate 3D noise. This is well-suited to FogMaterial density textures, which can result in more detailed fog effects:
de: Seit Godot 4.1 gibt es eine NoiseTexture3D-Ressource, die zur prozeduralen Erzeugung von 3D-Rauschen verwendet werden kann. Dies ist gut geeignet für FogMaterial-Dichte-Texturen, die zu detaillierteren Nebeleffekten führen können:
zh_cn: 从 Godot 4.1 开始，有一个 NoiseTexture3D 资源可用于按程序生成 3D 噪声。 这非常适合 FogMaterial 密度纹理，可以产生更详细的雾效果：
zh_tw: 從 Godot 4.1 開始，有一個 NoiseTexture3D 資源可用於按程式產生 3D 雜訊。這非常適合 FogMaterial 密度紋理，可以產生更詳細的霧效果：

source: FogMaterial comparison (without and with density texture)
de: FogMaterial-Vergleich (ohne und mit Dichte-Textur)
zh_cn: FogMaterial 比较（没有和有密度纹理的情况）
zh_tw: 矩陣分量和單位矩陣

source: Screenshot taken with **Volume Size** project setting set to 192 to make high-frequency detail more visible in the fog.
de: Der Screenshot wurde mit der Projekteinstellung **Volumengröße** von 192 aufgenommen, um hochfrequente Details im Nebel besser sichtbar zu machen.
zh_cn: 屏幕截图是在 **体积大小** 项目设置设置为 192 时拍摄的，以使高频细节在雾中更加明显。
zh_tw: 螢幕截圖是在 **體積大小** 專案設定設為 192 時拍攝的，以使高頻細節在霧中更加明顯。

source: To do so, select the **Density Texture** property and choose **New NoiseTexture3D**. Edit this NoiseTexture3D by clicking it, then click **Noise** at the bottom of the NoiseTexture3D properties and choose **New FastNoiseLite**. Adjust the noise texture's width, height and depth according to your fog volume's dimensions.
de: Wählen Sie dazu die Property **Dichtentextur** und wählen Sie **Neue NoiseTexture3D**. Bearbeiten Sie diese NoiseTexture3D, indem Sie darauf klicken, dann klicken Sie auf **Rauschen** am unteren Rand der NoiseTexture3D-Propertys und wählen **Neues FastNoiseLite**. Passen Sie die Breite, Höhe und Tiefe der Rauschtextur an die Abmessungen Ihres Nebelvolumens an.
zh_cn: 为此，请选择 **Density Texture** 属性，然后选择 **New NoiseTexture3D** 。 单击此 NoiseTexture3D 对其进行编辑，然后单击 NoiseTexture3D 属性底部的 **Noise** 并选择 **New FastNoiseLite** 。 根据雾体积的尺寸调整噪波纹理的宽度、高度和深度。
zh_tw: 為此，請選擇“**密度紋理**”屬性，然後選擇“**新 NoiseTexture3D**”。按一下此 NoiseTexture3D 進行編輯，然後按一下 NoiseTexture3D 屬性底部的 **Noise** 並選擇 **New FastNoiseLite**。根據霧體積的尺寸調整噪波紋理的寬度、高度和深度。

source: To improve performance, it's recommended to use low texture sizes (64×64×64 or lower), as high-frequency detail is difficult to notice in a FogVolume. If you wish to represent more detailed density variations, you will need to increase **Rendering > Environment > Volumetric Fog > Volume Size** in the project settings, which has a performance cost.
de: Um die Performance zu verbessern, empfiehlt es sich, niedrige Texturgrößen zu verwenden (64×64×64 oder niedriger), da hochfrequente Details in einem FogVolume nur schwer zu erkennen sind. Wenn Sie detailliertere Dichtevariationen darstellen möchten, müssen Sie **Rendern > Environment > Volumetrischer Nebel > Volumengröße** in den Projekteinstellungen erhöhen, was mit Kosten für die Performance verbunden ist.
zh_cn: 为了提高性能，建议使用较小的纹理尺寸（64×64×64 或更低），因为在 FogVolume 中很难注意到高频细节。 如果你希望表示更详细的密度变化，则需要在项目设置中增加 **渲染 > 环境 > 体积雾 > 体积大小** ，这会产生性能成本。
zh_tw: 為了提高性能，建議使用較小的紋理尺寸（64×64×64 或更低），因為在 FogVolume 中很難注意到高頻細節。如果您希望表示更詳細的密度變化，則需要在專案設定中增加**算繪 > 環境 > 體積霧 > 體積大小**，這會產生效能成本。

source: NoiseTexture3D's **Color Ramp** affects FogMaterial density textures, but since only the texture's red channel is sampled, only the color ramp's red channel will affect the resulting density.
de: Der **Farbgradient** von NoiseTexture3D wirkt sich auf FogMaterial-Dichte-Texturen aus, aber da nur der Rotkanal der Textur abgetastet wird, wirkt sich nur der Rotkanal des Farbgradienten auf die resultierende Dichte aus.
zh_cn: NoiseTexture3D 的 **颜色渐变** 影响 FogMaterial 密度纹理，但由于仅对纹理的红色通道进行采样，因此只有颜色渐变的红色通道会影响生成的密度。
zh_tw: NoiseTexture3D 的 **顏色漸層** 會影響 FogMaterial 密度紋理，但由於僅對紋理的紅色通道進行取樣，因此只有顏色漸變的紅色通道會影響生成的密度。

source: However, using a color ramp will *not* tint the fog volume according to the texture. You would need to use a custom shader that reads a Texture3D to achieve this.
de: Bei Verwendung eines Farbgradienten wird das Nebelvolumen jedoch *nicht* entsprechend der Textur gefärbt. Sie müssten einen benutzerdefinierten Shader verwenden, der eine Texture3D liest, um dies zu erreichen.
zh_cn: 然而，使用颜色渐变将 *不会* 根据纹理对雾体积进行着色。 你需要使用读取 Texture3D 的自定义着色器来实现此目的。
zh_tw: 但是，使用顏色漸變將*不會*根據紋理對霧量進行著色。您需要使用讀取Texture3D 的自訂著色器來實作此目的。

source: Custom FogVolume shaders
de: Benutzerdefinierte FogVolume-Shader
zh_cn: 自定义 FogVolume 着色器
zh_tw: 自定功能

source: This page only covers the built-in settings offered by FogMaterial. If you need to customize fog behavior within a FogVolume node (such as creating animated fog), FogVolume nodes' appearance can be customized using :ref:`doc_fog_shader`.
de: Diese Seite behandelt nur die Built-in-Einstellungen von FogMaterial. Wenn Sie das Verhalten des Nebels innerhalb eines FogVolume-Nodes anpassen müssen (z.B. um animierten Nebel zu erzeugen), kann das Aussehen der FogVolume-Nodes mit :ref:`doc_fog_shader` angepasst werden.
zh_cn: 本页面仅涵盖 FogMaterial 提供的内置设置。 如果你需要在 FogVolume 节点内自定义雾行为（例如创建动画雾），可以使用 :ref:`doc_fog_shader` 自定义 FogVolume 节点的外观。
zh_tw: 本頁面僅涵蓋 FogMaterial 提供的內建設定。如果您需要在 FogVolume 節點內自訂霧行為（例如建立動畫霧），可以使用 doc_fog_shader 自訂 FogVolume 節點的外觀。

source: Faking volumetric fog using quads
de: Vortäuschen von volumetrischem Nebel mit Quads
zh_cn: 使用 Quad（四方形） 伪造体积雾
zh_tw: 使用四邊形偽造體積霧

source: In some cases, it may be better to use specially configured QuadMeshes as an alternative to volumetric fog:
de: In einigen Fällen kann es besser sein, speziell konfigurierte QuadMeshes als Alternative zu volumetrischem Nebel zu verwenden:
zh_cn: 在某些情况下，最好使用专门配置的 QuadMeshes 作为体积雾的替代方案：
zh_tw: 在某些情況下，最好使用專門配置的 QuadMeshes 作為體積霧的替代方案：

source: Quads work with any rendering method, including Forward Mobile and Compatibility.
de: Quads funktionieren mit jeder Rendering-Methode, einschließlich Forward Mobile und Kompatibilität.
zh_cn: Quads 可与任何渲染方法配合使用，包括Forward+，移动和兼容模式。
zh_tw: Quad 可與任何算繪方法搭配使用，包括前向移動和相容性。

source: Quads do not require temporal reprojection to look smooth, which makes them suited to fast-moving dynamic effects such as lasers. They can also represent small details which volumetric fog cannot do efficiently.
de: Quads benötigen keine zeitliche Reprojektion, um glatt auszusehen, was sie für sich schnell bewegende dynamische Effekte wie Laser geeignet macht. Sie können auch kleine Details darstellen, die volumetrischer Nebel nicht effizient darstellen kann.
zh_cn: Quads 不需要时间重投影即可看起来平滑，这使得它们适合快速移动的动态效果，例如激光。 它们还可以表示体积雾无法有效实现的小细节。
zh_tw: 四邊形不需要時間重投影即可看起來平滑，這使得它們適合快速移動的動態效果，例如雷射。它們還可以表示體積霧無法有效實作的小細節。

source: Quads generally have a lower performance cost than volumetric fog.
de: Quads haben im Allgemeinen geringere Performance-Kosten als volumetrischer Nebel.
zh_cn: Quads 通常比体积雾具有更低的性能成本。
zh_tw: 四邊形通常比體積霧具有更低的性能成本。

source: This approach has a few downsides though:
de: Dieser Ansatz hat allerdings auch einige Nachteile:
zh_cn: 但这种方法有一些缺点：
zh_tw: 雖然有一些不同的地方：

source: The fog effect has less realistic falloff, especially if the camera enters the fog.
de: Der Nebeleffekt hat einen weniger realistischen Abfall, insbesondere wenn die Kamera in den Nebel eintaucht.
zh_cn: 雾效果的衰减不太真实，尤其是当相机进入雾中时。
zh_tw: 霧效果的衰減不太真實，尤其是當相機進入霧中時。

source: Transparency sorting issues may occur when sprites overlap.
de: Transparenz-Sortierprobleme können auftreten, wenn sich Sprites überlappen.
zh_cn: 当精灵重叠时，可能会出现透明度排序问题。
zh_tw: 當精靈重疊時，可能會出現透明度排序問題。

source: Performance will not necessarily be better than volumetric fog if there are lots of sprites close to the camera.
de: Die Performance ist nicht unbedingt besser als volumetrischer Nebel, wenn sich viele Sprites in der Nähe der Kamera befinden.
zh_cn: 若相机附近有很多精灵，性能不一定比体积雾好。
zh_tw: 如果相機附近有很多精靈，效能不一定會比體積霧更好。

source: To create a QuadMesh-based fog sprite:
de: So erstellen Sie ein QuadMesh-basiertes Nebel-Sprite:
zh_cn: 创建一个基于 QuadMesh 的雾精灵：
zh_tw: 要建立基於 QuadMesh 的霧精靈：

source: Create a MeshInstance3D node with a QuadMesh resource in the **Mesh** property. Set the size as desired.
de: Erstellen Sie einen MeshInstance3D-Node mit einer QuadMesh-Ressource in der **Mesh**-Property. Legen Sie die Größe wie gewünscht fest.
zh_cn: 在 **Mesh** 属性中创建一个具有 QuadMesh 资源的 MeshInstance3D 节点。 根据需要设置尺寸。
zh_tw: 建立一個 MeshInstance 節點，將其 Mesh 屬性設為 PlaneMesh 或 QuadMesh。將該網格的大小調整到與影片的長寬比一致（否則看上去就會變形）。

source: Create a new StandardMaterial3D in the mesh's **Material** property.
de: Erstellen Sie ein neues StandardMaterial3D in der Property **Material** des Meshes.
zh_cn: 在网格的 **Material** 属性中创建一个新的 StandardMaterial3D。
zh_tw: 在 GeometryInstance 部分的 **Material Override** 屬性中新建一個 SpatialMaterial 資源。

source: In the StandardMaterial3D, set **Shading > Shading Mode** to **Unshaded**, **Billboard > Mode** to **Enabled**, enable **Proximity Fade** and set **Distance Fade** to **Pixel Alpha**.
de: Setzen Sie im StandardMaterial3D **Shading> Shading-Modus** auf **kein Shading**, **Billboard > Modus** auf **Aktiviert**, aktivieren Sie **Nah-Fading** und setzen Sie **Fern-Fading** auf **Pixel Alpha**.
zh_cn: 在 StandardMaterial3D 中，将 **着色> 着色模式** 设置为 **不着色** ， **公告板> 模式** 设置为 **启用** ，启用 **临近淡出** 并将 **距离淡出** 设置为 **像素Alpha** 。
zh_tw: 在StandardMaterial3D中，將**Shading > Shading Mode**設定為**Unshaded**，**Billboard > Mode**設定為**Enabled**，啟用**Proximity Fade**並將**Distance Fade* *設定為** **像素阿爾法**。

source: Set the **Albedo > Texture** to the texture below (right-click and choose **Save as…**):
de: Setzen Sie die **Albedo > Textur** auf die untenstehende Textur (Rechtsklick und **Speichern unter...**):
zh_cn: 将 **反照率 > 纹理** 设置为下面的纹理（右键单击并选择 **另存为...** ）：
zh_tw: 將 **反照率 > 紋理** 設定為下面的紋理（右鍵單擊並選擇 **另存為...**）：

source: *After* setting the albedo texture, go to the Import dock, select the texture and change its compression mode to **Lossless** to improve quality.
de: *Nachdem* Sie die Albedo-Textur festgelegt haben, gehen Sie zum Import-Dock, wählen Sie die Textur aus und ändern Sie den Kompressionsmodus auf **Verlustfrei**, um die Qualität zu verbessern.
zh_cn: 设置反照率纹理 *之后* ，转到导入面板，选择纹理并将其压缩模式更改为 **无损** 以提高质量。
zh_tw: *設定反照率紋理後，請前往匯入底座，選擇紋理並將其壓縮模式變更為**無損**以提高品質。

source: The fog's color is set using the **Albedo > Color** property; its density is set using the color's alpha channel. For best results, you will have to adjust **Proximity Fade > Distance** and **Distance Fade > Max Distance** depending on the size of your QuadMesh.
de: Die Farbe des Nebels wird über die Property **Albedo > Farbe** eingestellt, seine Dichte über den Alphakanal der Farbe. Um optimale Ergebnisse zu erzielen, müssen Sie **Nah-Fading > Distanz** und **Fern-Fading> Max Distanz** je nach Größe Ihres QuadMesh anpassen.
zh_cn: 雾的颜色使用 **反照率> 颜色** 属性设置； 它的密度是使用颜色的 Alpha 通道设置的。 为了获得最佳结果，你必须根据 QuadMesh 的大小调整 **临近淡出 > 距离** 和 **距离淡出 > 最大距离** 。
zh_tw: 霧的顏色使用 **Albedo > Color** 屬性設定；它的密度是使用顏色的 Alpha 通道設定的。為了獲得最佳結果，您必須根據 QuadMesh 的大小調整 **Proximity Fade > Distance** 和 **Distance Fade > Max Distance**。

source: Optionally, billboarding may be left disabled if you place the quad in a way where all of its corners are in solid geometry. This can be useful for fogging large planes that the camera cannot enter, such as bottomless pits.
de: Optional kann das Billboarding deaktiviert werden, wenn Sie das Quad so platzieren, dass alle seine Ecken in fester Geometrie sind. Dies kann nützlich sein, um große Flächen zu vernebeln, in die von der Kamera nicht durchdrungen werden können, wie z. B. bodenlose Gruben.
zh_cn: 或者，如果你将四边形放置在其所有角都处于实体几何形状中的方式，则可以禁用公告板。 这对于相机无法进入的大型平面（例如无底坑）中的雾效非常有用。
zh_tw: 或者，如果您將四邊形放置在其所有角落都處於實體幾何形狀中的方式，則可以停用廣告看板。這對於相機無法進入的大型平面（例如無底坑）的霧化非常有用。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
