Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/volumetric_fog.po
Languages: de, zh_cn, zh_tw

source: Volumetric fog and fog volumes
de: Volumetrischer Nebel und Nebelvolumen
zh_cn: 体积雾和雾体积
zh_tw: 體積霧和霧體積

source: Volumetric fog is only supported in the Clustered Forward rendering backend, not Forward Mobile or Compatibility.
de: Volumetrischer Nebel wird nur im Clustered Forward Rendering-Backend unterstützt, nicht aber in Forward Mobile oder Kompatibilität.
zh_cn: 只有“集群 Forward”渲染后端支持体积雾，“Forward 移动”和“兼容”不支持。
zh_tw: 只有“集群 Forward”算繪後端支援體積霧，“Forward 移動”和“相容”不支援。

source: As described in :ref:`doc_environment_and_post_processing`, Godot supports various visual effects including two types of fog: traditional (non-volumetric) fog and volumetric fog. Traditional fog affects the entire scene at once and cannot be customized with :ref:`doc_fog_shader`.
de: Wie in :ref:`doc_environment_and_post_processing` beschrieben, unterstützt Godot verschiedene visuelle Effekte, darunter zwei Arten von Nebel: traditionellen (nicht-volumetrischen) Nebel und volumetrischen Nebel. Traditioneller Nebel betrifft die gesamte Szene auf einmal und kann nicht mit :ref:`doc_fog_shader` angepasst werden.
zh_cn: :ref:`doc_environment_and_post_processing` 中已经介绍过，Godot 支持的各种视觉效果中包含两种雾：传统（非体积）雾和体积雾。传统雾会影响整个场景，无法使用 :ref:`doc_fog_shader` 进行自定义。
zh_tw: :ref:`doc_environment_and_post_processing` 中已經介紹過，Godot 支援的各種視覺效果中包含兩種霧：傳統（非體積）霧和體積霧。傳統霧會影響整個場景，無法使用 :ref:`doc_fog_shader` 進行自訂。

source: Volumetric fog can be used at the same time as non-volumetric fog if desired.
de: Volumetrischer Nebel kann auf Wunsch gleichzeitig mit nicht-volumetrischem Nebel verwendet werden.
zh_cn: 如果需要，体积雾可以和非体积雾一同使用。
zh_tw: 如果需要，體積霧可以和非體積霧一同使用。

source: On this page, you'll learn:
de: Auf dieser Seite erfahren Sie:
zh_cn: 你会在这个页面中学习到：
zh_tw: 在本指南中，我們將學到：

source: How to set up volumetric fog in Godot.
de: Wie man volumetrischen Nebel in Godot einrichtet.
zh_cn: 如何在 Godot 中设置体积雾。
zh_tw: 如何在 Godot 中設定體積霧。

source: What fog volumes are and how they differ from "global" volumetric fog.
de: Was Nebelvolumen sind und wie sie sich von "globalem" volumetrischem Nebel unterscheiden.
zh_cn: 雾体积是什么，和“全局”体积雾有什么区别。
zh_tw: 霧體積是什麼，和“全域”體積霧有什麼區別。

source: You can see how volumetric fog works in action using the `Volumetric Fog demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/volumetric_fog>`__.
de: Sie können sehen, wie volumetrischer Nebel in Aktion funktioniert, indem Sie das `Volumetric Fog demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/volumetric_fog>`__ benutzen.
zh_cn: 你可以使用 `体积雾演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/volumetric_fog>`__ 来查看体积雾的实际工作原理。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Here is a comparison between traditional fog (which does not interact with lighting) and volumetric fog, which is able to interact with lighting:
de: Hier ist ein Vergleich zwischen traditionellem Nebel (der nicht mit der Beleuchtung interagiert) und volumetrischem Nebel, der mit der Beleuchtung interagieren kann:
zh_cn: 以下是传统雾（不与光照交互）和体积雾（能够与光照交互）之间的比较：
zh_tw: 以下是傳統霧（不與光照互動）和體積霧（能夠與光照互動）之間的比較：

source: Volumetric fog properties
de: Propertys des volumetrischen Nebels
zh_cn: 体积雾属性
zh_tw: 建立屬性群組

source: After enabling volumetric fog in the WorldEnvironment node's Environment resource, you can edit the following properties:
de: Nachdem Sie den volumetrischen Nebel in der Environment-Ressource des WorldEnvironment-Nodes aktiviert haben, können Sie die folgenden Propertys bearbeiten:
zh_cn: 在 WorldEnvironment 节点的 Environment 资源中启用体积雾之后，可以编辑以下属性：
zh_tw: 在 WorldEnvironment 節點的 Environment 資源中啟用體積霧之後，可以編輯以下屬性：

source: **Density:** The base *exponential* density of the volumetric fog. Set this to the lowest density you want to have globally. FogVolumes can be used to add to or subtract from this density in specific areas. A value of ``0.0`` disables global volumetric fog while allowing FogVolumes to display volumetric fog in specific areas. Fog rendering is exponential as in real life.
de: **Dichte:** Die *exponentielle* Basisdichte des volumetrischen Nebels. Setzen Sie diesen Wert auf die niedrigste Dichte, die Sie global haben möchten. FogVolumes können verwendet werden, um diese Dichte in bestimmten Bereichen zu erhöhen oder zu verringern. Ein Wert von ``0.0`` deaktiviert globalen volumetrischen Nebel, während FogVolumes volumetrischen Nebel in bestimmten Bereichen anzeigen können. Der Nebel wird exponentiell gerendert, wie im wirklichen Leben.
zh_cn: **Density：**\ 密度。体积雾的基础\ *指数*\ 密度。请将这个值设置为你想要的全局最低密度。可以在特定区域中使用 FogVolume 来增加或减少这个密度。设为 ``0.0`` 会禁用全局体积雾，但仍然可以在特定区域中使用 FogVolume 来显示体积雾。雾的渲染呈指数效果，和现实生活中一致。
zh_tw: **Density：**密度。體積霧的基礎*指數*密度。請將這個值設定為你想要的全域最低密度。可以在特定區域中使用 FogVolume 來增加或減少這個密度。設為 ``0.0`` 會禁用全域體積霧，但仍然可以在特定區域中使用 FogVolume 來顯示體積霧。霧的算繪呈指數效果，和現實生活中一致。

source: **Albedo:** The Color of the volumetric fog when interacting with lights. Mist and fog have an albedo close to white (``Color(1, 1, 1, 1)``) while smoke has a darker albedo.
de: **Albedo:** Die Farbe des volumetrischen Nebels im Zusammenspiel mit Lichtern. Nebel und Dunst haben eine Albedo nahe an Weiß (``Farbe(1, 1, 1, 1)``), während Rauch eine dunklere Albedo hat.
zh_cn: **Albedo：**\ 反照率。体积雾在与灯光交互时的颜色。雾的反照率接近于白色（\ ``Color(1, 1, 1, 1)``\ ），而烟的反照率要更暗一些。
zh_tw: **Albedo：**反照率。體積霧在與燈光互動時的顏色。霧的反照率接近於白色（``Color(1, 1, 1, 1)``），而煙的反照率要更暗一些。

source: **Emission:** The emitted light from the volumetric fog. Even with emission, volumetric fog will not cast light onto other surfaces. Emission is useful to establish an ambient color. As the volumetric fog effect uses single-scattering only, fog tends to need a little bit of emission to soften the harsh shadows.
de: **Emission:** Das vom volumetrischen Nebel emittierte Licht. Auch mit Emission wirft der volumetrische Nebel kein Licht auf andere Oberflächen. Die Emission ist nützlich, um eine Umgebungsfarbe festzulegen. Da der volumetrische Nebeleffekt nur Einzelstreuung verwendet, benötigt der Nebel ein wenig Emission, um die harten Schatten zu mildern.
zh_cn: **Emission：**\ 自发光。体积雾发出的光。启用了自发光的体积雾并不会向其它表面发射光线。自发光常用于实现环境光。因为体积雾效果只使用单散射，所以雾需要有一点点自发光才能柔化阴影。
zh_tw: **Emission：**自發光。體積霧發出的光。啟用了自發光的體積霧並不會向其它表面發射光線。自發光常用於實作環境光。因為體積霧效果只使用單散射，所以霧需要有一點點自發光才能柔化陰影。

source: **Emission Energy:** The brightness of the emitted light from the volumetric fog.
de: **Emissionsenergie:** Die Helligkeit des vom volumetrischen Nebel ausgesandten Lichts.
zh_cn: **Emission Energy：**\ 自发光能量。体积雾发出的光的亮度。
zh_tw: **Emission Energy：**自發光能量。體積霧發出的光的亮度。

source: **GI Inject:** Scales the strength of Global Illumination used in the volumetric fog's albedo color. A value of ``0.0`` means that Global Illumination will not impact the volumetric fog. This has a small performance cost when set above ``0.0``.
de: **GI-Inject:** Skaliert die Stärke der Global Illumination, die für die Albedofarbe des volumetrischen Nebels verwendet wird. Ein Wert von ``0,0`` bedeutet, dass die Global Illumination keinen Einfluss auf den volumetrischen Nebel hat. Dies hat einen kleinen Performanceverlust zur Folge, wenn der Wert über ``0,0`` liegt.
zh_cn: **GI Inject：**\ GI 注入。对体积雾在全局光照中使用的反照率颜色强度进行缩放。设为 ``0.0`` 意味着全局光照不影响体积雾。设为大于 ``0.0`` 的值时对影响略有影响。
zh_tw: **GI Inject：**GI 注入。對體積霧在全域光照中使用的反照率顏色強度進行縮放。設為 ``0.0`` 意味著全域光照不影響體積霧。設為大於 ``0.0`` 的值時對影響略有影響。

source: **Anisotropy:** The direction of scattered light as it goes through the volumetric fog. A value close to ``1.0`` means almost all light is scattered forward. A value close to ``0.0`` means light is scattered equally in all directions. A value close to ``-1.0`` means light is scattered mostly backward. Fog and mist scatter light slightly forward, while smoke scatters light equally in all directions.
de: **Anisotropie:** Die Richtung des gestreuten Lichts, wenn es durch den volumetrischen Nebel geht. Ein Wert nahe ``1.0`` bedeutet, daß fast alles Licht nach vorne gestreut wird. Ein Wert nahe bei ``0.0`` bedeutet, daß das Licht gleichmäßig in alle Richtungen gestreut wird. Ein Wert nahe bei ``-1.0`` bedeutet, dass das Licht hauptsächlich nach hinten gestreut wird. Nebel und Dunst streuen das Licht leicht nach vorne, während Rauch das Licht gleichmäßig in alle Richtungen streut.
zh_cn: **各向异性(Anisotropy)：** 散射光穿过体积雾时的方向。 接近 ``1.0`` 的值意味着几乎所有光都向前散射。 接近 ``0.0`` 的值意味着光在各个方向上均匀散射。 接近 ``-1.0`` 的值意味着光大部分向后散射。 雾和薄雾将光线稍微向前散射，而烟雾则将光线均匀地向各个方向散射。
zh_tw: **各向異性：** 散射光穿過體積霧時的方向。接近“1.0”的值意味著幾乎所有光都向前散射。接近“0.0”的值意味著光在各個方向上均勻散射。接近“-1.0”的值意味著光大部分向後散射。霧和薄霧將光線稍微向前散射，而煙霧則將光線均勻地向各個方向散射。

source: **Length:** The distance over which the volumetric fog is computed. Increase to compute fog over a greater range, decrease to add more detail when a long range is not needed. For best quality fog, keep this as low as possible.
de: **Länge:** Die Entfernung, über die der volumetrische Nebel berechnet wird. Erhöhen Sie den Wert, um den Nebel über einen größeren Bereich zu berechnen, verringern Sie ihn, um mehr Details hinzuzufügen, wenn eine große Reichweite nicht benötigt wird. Für die beste Qualität des Nebels sollten Sie diesen Wert so niedrig wie möglich halten.
zh_cn: **长度(Length)：** 计算体积雾的距离。 增加以在更大范围内计算雾，减少以在不需要长范围时添加更多细节。 为了获得最佳质量的雾，请将其保持尽可能低。
zh_tw: **長度：** 計算體積霧的距離。增加以在更大範圍內計算霧，減少以在不需要長範圍時新增更多細節。為了獲得最佳品質的霧，請將其保持盡可能低。

source: **Detail Spread:** The distribution of size down the length of the froxel buffer. A higher value compresses the froxels closer to the camera and places more detail closer to the camera.
de: **Detailausbreitung:** Die Verteilung der Größe über die Länge des Froxel-Puffers. Ein höherer Wert komprimiert die Froxel näher an der Kamera und platziert mehr Details näher an der Kamera.
zh_cn: **细节分布(Detail Spread)：** froxel 缓冲区长度上的大小分布。 较高的值会压缩 Froxels 使其更靠近相机，并将更多细节放置在更靠近相机的位置。
zh_tw: **細節分佈：** froxel 緩衝區長度上的大小分佈。較高的值會壓縮 Froxels 使其更靠近相機，並將更多細節放置在更靠近相機的位置。

source: **Ambient Inject:** Scales the strength of ambient light used in the volumetric fog. A value of ``0.0`` means that ambient light will not impact the volumetric fog. This has a small performance cost when set above ``0.0``.
de: **Umgebungs-Inject:** Skaliert die Stärke des Umgebungslichts, das für den volumetrischen Nebel verwendet wird. Ein Wert von ``0.0`` bedeutet, dass das Umgebungslicht keinen Einfluss auf den volumetrischen Nebel hat. Dies hat einen kleinen Performanceverlust zur Folge, wenn der Wert über ``0.0`` liegt.
zh_cn: **环境注入(Ambient Inject)：** 缩放体积雾中使用的环境光的强度。 值 ``0.0`` 表示环境光不会影响体积雾。 当设置高于 ``0.0`` 时，性能成本很小。
zh_tw: **環境注入：** 縮放體積霧中使用的環境光的強度。值“0.0”表示環境光不會影響體積霧。當設定高於“0.0”時，效能成本很小。

source: **Sky Affect:** Controls how much volumetric fog should be drawn onto the background sky. If set to ``0.0``, volumetric fog won't affect sky rendering at all (including FogVolumes).
de: **Himmelseinfluss:** Steuert, wie viel volumetrischer Nebel auf den Hintergrundhimmel gezeichnet werden soll. Bei einem Wert von ``0.0`` hat der volumetrische Nebel keinen Einfluss auf die Darstellung des Himmels (einschließlich FogVolumes).
zh_cn: **天空影响(Sky Affect:)：** 控制应在背景天空上绘制多少体积雾。 如果设置为 ``0.0`` ，体积雾根本不会影响天空渲染（包括 FogVolumes）。
zh_tw: **天空影響：** 控制應在背景天空上繪製多少體積霧。如果設定為“0.0”，體積霧根本不會影響天空算繪（包括 FogVolumes）。

source: Two additional properties are offered in the **Temporal Reprojection** section:
de: Im Abschnitt **Zeitliche Reprojektion** werden zwei weitere Properties angeboten:
zh_cn: **时间重投影** 部分提供了两个附加属性：
zh_tw: **時間重投影**部分提供了兩個附加屬性：

source: **Temporal Reprojection > Enabled:** Enables temporal reprojection in the volumetric fog. Temporal reprojection blends the current frame's volumetric fog with the last frame's volumetric fog to smooth out jagged edges. The performance cost is minimal, however it does lead to moving FogVolumes and Light3Ds "ghosting" and leaving a trail behind them. When temporal reprojection is enabled, try to avoid moving FogVolumes or Light3Ds too fast. Short-lived dynamic lighting effects should have **Volumetric Fog Energy** set to ``0.0`` to avoid ghosting.
de: **Zeitliche Reprojektion > Aktiviert:** Aktiviert die zeitliche Reprojektion im volumetrischen Nebel. Zeitliche Reprojektion mischt den volumetrischen Nebel des aktuellen Frames mit dem volumetrischen Nebel des letzten Frames, um ausgefranste Kanten zu glätten. Die Kosten für die Performance sind minimal, aber es führt dazu, dass sich bewegende FogVolumes und Light3Ds Ghosting-Effekte erzeugen und eine Spur hinter ihnen hinterlassen. Wenn die zeitliche Reprojektion aktiviert ist, sollten Sie vermeiden, FogVolumes oder Light3Ds zu schnell zu bewegen. Bei kurzlebigen dynamischen Lichteffekten sollte **Volumetrische Nebelnergie** auf ``0,0`` gesetzt werden, um Geisterbilder zu vermeiden.
zh_cn: **时间重投影 > 已启用：** 在体积雾中启用时间重投影。 时间重投影将当前帧的体积雾与上一帧的体积雾混合以平滑锯齿状边缘。 性能成本很小，但它确实会导致移动 FogVolume 和 Light3D 出现“重影”并留下痕迹。 启用时间重投影时，尽量避免 FogVolume 或 Light3D 移动得太快。 短暂的动态照明效果应将**体积雾能量**设置为 ``0.0`` 以避免重影。
zh_tw: **時間重投影 > 已啟用：** 在體積霧中啟用時間重投影。時間重投影將目前影格的體積霧與上一格的體積霧混合以平滑鋸齒狀邊緣。性能成本很小，但它確實會導致移動 FogVolume 和 Light3D 出現「重影」並留下痕跡。啟用時間重投影時，盡量避免 FogVolume 或 Light3D 移動得太快。短暫的動態照明效果應將**體積霧能量**設為「0.0」以避免重影。

source: **Temporal Reprojection > Amount:** The amount by which to blend the last frame with the current frame. A higher number results in smoother volumetric fog, but makes "ghosting" much worse. A lower value reduces ghosting but can result in the per-frame temporal jitter becoming visible.
de: **Zeitliche Reprojektion > Betrag:** Der Betrag, um den das letzte Bild mit dem aktuellen Bild überblendet wird. Ein höherer Wert führt zu einem glatteren volumetrischen Nebel, verschlimmert aber das "Ghosting" erheblich. Ein niedrigerer Wert verringert die Ghosting, kann aber dazu führen, dass der zeitliche Jitter pro Frame sichtbar wird.
zh_cn: **时间重投影 > 数量：** 最后一帧与当前帧的混合量。 数值越高，体积雾越平滑，但“重影”会更严重。 较低的值可减少重影，但会导致每帧时间抖动变得可见。
zh_tw: **時間重投影 > 數量：** 最後一影格與目前影格的混合量。數值越高，體積霧越平滑，但「重影」會更嚴重。較低的值可減少重影，但會導致每個畫面時間抖動變得可見。

source: Unlike non-volumetric fog, volumetric fog has a *finite* range. This means volumetric fog cannot entirely cover a large world, as it will eventually stop being rendered in the distance.
de: Im Gegensatz zu nicht-volumetrischem Nebel hat volumetrischer Nebel eine *endliche* Reichweite. Das bedeutet, dass volumetrischer Nebel eine große Welt nicht vollständig abdecken kann, da er in der Ferne irgendwann nicht mehr gerendert wird.
zh_cn: 与非体积雾不同，体积雾具有 *有限* 范围。 这意味着体积雾无法完全覆盖一个大世界，因为它最终将停止在远处渲染。
zh_tw: 與非體積霧不同，體積霧具有“有限”範圍。這意味著體積霧無法完全覆蓋一個大世界，因為它最終將停止在遠處算繪。

source: If you wish to hide distant areas from the player, it's recommended to enable both non-volumetric fog and volumetric fog at the same time, and adjust their density accordingly.
de: Wenn Sie weit entfernte Bereiche vor dem Spieler verbergen möchten, empfiehlt es sich, sowohl nicht-volumetrischen Nebel als auch volumetrischen Nebel gleichzeitig zu aktivieren und die Dichte entsprechend anzupassen.
zh_cn: 如果你希望对玩家隐藏较远的区域，建议同时启用非体积雾和体积雾，并相应地调整其密度。
zh_tw: 如果您希望對玩家隱藏較遠的區域，建議同時啟用非體積霧和體積霧，並相應地調整其密度。

source: Light interaction with volumetric fog
de: Lichtinteraktion mit volumetrischem Nebel
zh_cn: 光与体积雾的交互
zh_tw: 與光互動

source: To simulate fog light scattering behavior in real life, all light types will interact with volumetric fog. How much each light will affect volumetric fog can be adjusted using the **Volumetric Fog Energy** property on each light. Enabling shadows on a light will also make those shadows visible on volumetric fog.
de: Um das Streuverhalten von Nebel-Licht in der Realität zu simulieren, interagieren alle Lichttypen mit volumetrischem Nebel. Wie stark sich jedes Licht auf den volumetrischen Nebel auswirkt, kann mit der Property **Volumetrische Nebelnergie** für jedes Licht eingestellt werden. Wenn Sie Schatten für ein Licht aktivieren, werden diese Schatten auch im volumetrischen Nebel sichtbar.
zh_cn: 为了模拟现实生活中的雾光散射行为，所有光类型都将与体积雾相互作用。 每个灯光对体积雾的影响程度可以使用每个灯光的 **体积雾能量** 属性进行调整。 在灯光上启用阴影也会使这些阴影在体积雾中可见。
zh_tw: 為了模擬現實生活中的霧光散射行為，所有光型別都將與體積霧相互作用。每個燈光對體積霧的影響程度可以使用每個燈光的 **體積霧能量** 屬性進行調整。在燈光上啟用陰影也會使這些陰影在體積霧中可見。

source: If fog light interaction is not desired for artistic reasons, this can be globally disabled by setting **Volumetric Fog > Albedo** to a pure black color in the Environment resource. Fog light interaction can also be disabled for specific lights by setting its **Volumetric Fog Energy** to ``0``. Doing so will also improve performance slightly by excluding the light from volumetric fog computations.
de: Wenn die Interaktion mit Nebel-Licht aus künstlerischen Gründen nicht erwünscht ist, kann sie global deaktiviert werden, indem **Volumetrischer Nebel > Albedo** in der Environment-Ressource auf eine rein schwarze Farbe gesetzt wird. Die Interaktion mit Nebel-Lichtern kann auch für bestimmte Lichter deaktiviert werden, indem die **Volumetrische Nebelnergie** auf ``0`` gesetzt wird. Dadurch wird auch die Performance leicht verbessert, da das Licht von den volumetrischen Nebelberechnungen ausgeschlossen wird.
zh_cn: 如果出于艺术原因不需要雾灯交互，可以通过在环境资源中将**体积雾 > 反照率**设置为纯黑色来全局禁用雾灯交互。 还可以通过将其**体积雾能量**设置为 ``0`` 来禁用特定灯光的雾灯交互。 这样做还可以通过从体积雾计算中排除光线来稍微提高性能。
zh_tw: 如果出於藝術原因不需要霧燈互動，可以透過在環境資源中將**體積霧 > 反照率**設定為純黑色來全域停用霧燈互動。也可以將其**體積霧能量**設為“0”來停用特定燈光的霧燈互動。這樣做還可以透過從體積霧計算中排除光線來稍微提高性能。

source: Using volumetric fog as a volumetric lighting solution
de: Verwendung von volumetrischem Nebel als volumetrische Beleuchtungslösung
zh_cn: 使用体积雾作为体积照明解决方案
zh_tw: 使用體積霧作為體積照明解決方案

source: While not physically accurate, it is possible to tune volumetric fog's settings to work as volumetric *lighting* solution. This means that unlit parts of the environment will not be darkened anymore by fog, but light will still be able to make fog brighter in specific areas.
de: Auch wenn es physikalisch nicht korrekt ist, ist es möglich, volumetrischen Nebel so einzustellen, dass er als volumetrische *Beleuchtungslösung* funktioniert. Das bedeutet, dass unbeleuchtete Teile der Umgebung nicht mehr durch Nebel verdunkelt werden, aber Licht kann den Nebel in bestimmten Bereichen immer noch heller machen.
zh_cn: 虽然物理上不准确，但可以调整体积雾的设置以用作体积 *照明* 解决方案。 这意味着环境中未照亮的部分将不再因雾而变暗，但光仍然能够使特定区域的雾变得更亮。
zh_tw: 雖然物理上不準確，但可以調整體積霧的設定以用作體積*照明*解決方案。這意味著環境中未照亮的部分將不再因霧而變暗，但光仍然能夠使特定區域的霧氣變得更亮。

source: This can be done by setting volumetric fog density to the lowest permitted value *greater than zero* (``0.0001``), then increasing the **Volumetric Fog Energy** property on lights to much higher values than the default to compensate. Values between ``10000`` and ``100000`` usually work well for this.
de: Dies kann erreicht werden, indem man die volumetrische Nebeldichte auf den niedrigsten erlaubten Wert, der *größer als Null* ist (``0.0001``) setzt und dann die Property **Volumetrische Nebelnergie** der Lichter auf viel höhere Werte als den Defaultwert erhöht, um dies auszugleichen. Werte zwischen ``10000`` und ``100000`` sind normalerweise gut geeignet.
zh_cn: 这可以通过将体积雾密度设置为最低允许值*大于零*（ ``0.0001`` ），然后将灯光的“体积雾能量”属性增加到比默认值高得多的值来进行补偿。 ``10000`` 和 ``100000`` 之间的值通常对此效果很好。
zh_tw: 這可以透過將體積霧密度設定為最低允許值*大於零*（「0.0001」），然後將燈光的「體積霧能量」屬性增加到比預設值高得多的值來進行補償。 ``10000`` 和``100000`` 之間的值通常對此效果很好。

source: Balancing performance and quality
de: Abwägung zwischen Performance und Qualität
zh_cn: 平衡性能与质量
zh_tw: 平衡性能與品質

source: There are a few project settings available to adjust volumetric fog performance and quality:
de: Es gibt einige Projekteinstellungen, mit denen Sie die Performance und Qualität des volumetrischen Nebels anpassen können:
zh_cn: 有一些项目设置可用于调整体积雾性能和质量：
zh_tw: 有一些專案設定可用於調整體積霧性能和品質：

source: **Rendering > Environment > Volumetric Fog > Volume Size:** Base size used to determine size of froxel buffer in the camera X-axis and Y-axis. The final size is scaled by the aspect ratio of the screen, so actual values may differ from what is set. Set a larger size for more detailed fog, set a smaller size for better performance.
de: **Rendern > Environment > Volumetrischer Nebel > Volumengröße:** Die Basisgröße wird verwendet, um die Größe des Froxelpuffers in der X- und Y-Achse der Kamera zu bestimmen. Die endgültige Größe wird durch das Seitenverhältnis des Bildschirms skaliert, so dass die tatsächlichen Werte von der Einstellung abweichen können. Stellen Sie eine größere Größe für detaillierteren Nebel ein oder stellen Sie eine kleinere Größe für bessere Performance ein.
zh_cn: **渲染 > 环境 > 体积雾 > 体积大小：** 用于确定相机 X 轴和 Y 轴中 froxel 缓冲区大小的基本大小。 最终尺寸会根据屏幕的宽高比进行缩放，因此实际值可能与设置值有所不同。 设置较大的尺寸以获得更详细的雾，设置较小的尺寸以获得更好的性能。
zh_tw: **算繪 > 環境 > 體積霧 > 體積大小：** 用於確定相機 X 軸和 Y 軸中 froxel 緩衝區大小的基本大小。最終尺寸會根據螢幕的寬高比進行縮放，因此實際值可能與設定值有所不同。設定較大的尺寸以獲得更詳細的霧，設定較小的尺寸以獲得更好的性能。

source: **Rendering > Environment > Volumetric Fog > Volume Depth:** Number of slices to use along the depth of the froxel buffer for volumetric fog. A lower number will be more efficient but may result in artifacts appearing during camera movement.
de: **Rendern > Environment > Volumetrischer Nebel > Volumentiefe:** Anzahl der Slices, die entlang der Tiefe des Froxel-Puffers für volumetrischen Nebel verwendet werden sollen. Eine niedrigere Zahl ist effizienter, kann aber zu Artefakten bei Kamerabewegungen führen.
zh_cn: **渲染 > 环境 > 体积雾 > 体积深度：** 沿着体积雾的 froxel 缓冲区深度使用的切片数量。 数字越低效率越高，但可能会导致相机移动期间出现伪影。
zh_tw: **算繪 > 環境 > 體積霧 > 體積深度：** 沿著體積霧的 froxel 緩衝區深度所使用的切片數量。數字越低效率越高，但可能會導致相機移動期間出現偽影。

source: **Rendering > Environment > Volumetric Fog > Use Filter:** Enables filtering of the volumetric fog effect prior to integration. This substantially blurs the fog which reduces fine details but also smooths out harsh edges and aliasing artifacts. Disable when more detail is required.
de: **Rendern > Environment > Volumetrischer Nebel > Filter verwenden:** Aktiviert die Filterung des volumetrischen Nebeleffekts vor der Integration. Dadurch wird der Nebel deutlich unschärfer, wodurch feine Details reduziert, aber auch harte Kanten und Aliasing-Artefakte geglättet werden. Deaktivieren Sie diese Option, wenn mehr Details erforderlich sind.
zh_cn: **渲染 > 环境 > 体积雾 > 使用过滤器：** 在集成之前启用体积雾效果的过滤。 这大大模糊了雾，减少了精细细节，但也平滑了粗糙的边缘和锯齿伪影。 当需要更多详细信息时禁用。
zh_tw: **算繪 > 環境 > 體積霧 > 使用濾鏡：** 在整合之前啟用體積霧效果的篩選。這大大模糊了霧，減少了精細細節，但也平滑了粗糙的邊緣和鋸齒偽影。當需要更多詳細資訊時禁用。

source: Using fog volumes for local volumetric fog
de: Verwendung von Nebelvolumen für lokalen volumetrischen Nebel
zh_cn: 使用雾体积进行局部体积雾
zh_tw: 使用霧體積進行局部體積霧

source: Sometimes, you want fog to be constrained to specific areas. Conversely, you may want to have global volumetric fog but fog should be excluded from certain areas. Both approaches can be followed using FogVolume nodes.
de: Manchmal soll der Nebel auf bestimmte Bereiche beschränkt sein. Umgekehrt kann es sein, dass Sie globalen volumetrischen Nebel haben möchten, der aber von bestimmten Bereichen ausgeschlossen werden soll. Beide Ansätze können mit FogVolume-Nodes verfolgt werden.
zh_cn: 有时，你希望将雾限制在特定区域。 相反地，你可能希望拥有全局体积雾，但应将雾排除在某些区域之外。 这两种方法都可以使用 FogVolume 节点来遵循。
zh_tw: 有時，您希望將霧限制在特定區域。相反，您可能希望擁有全域體積霧，但應將霧排除在某些區域之外。這兩種方法都可以使用 FogVolume 節點來遵循。

source: Here's a quick start guide to using FogVolumes:
de: Hier finden Sie eine Schnellstart-Anleitung für die Verwendung von FogVolumes:
zh_cn: 以下是使用 FogVolumes 的快速入门指南：
zh_tw: 以下是使用 FogVolumes 的快速入門指南：

source: Make sure **Volumetric Fog** is enabled in the Environment properties. If global volumetric fog is undesired, set its **Density** to ``0.0``.
de: Stellen Sie sicher, dass **Volumetrischer Nebel** in den Propertys der Umgebung aktiviert ist. Wenn globaler volumetrischer Nebel unerwünscht ist, setzen Sie seine **Dichte** auf ``0.0``.
zh_cn: 确保在环境属性中启用 **体积雾** 。 如果不需要全局体积雾，请将其 **密度** 设置为 ``0.0`` 。
zh_tw: 確保在環境屬性中啟用**體積霧**。如果不需要全域體積霧，請將其**密度**設為「0.0」。

source: Create a FogVolume node.
de: Erstellen Sie einen FogVolume-Node.
zh_cn: 创建自定义节点。
zh_tw: 建立自定節點
