Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/command_line_tutorial.po
Languages: de, zh_cn

source: Command line tutorial
de: Kommandozeilen-Tutorial
zh_cn: 命令行教程

source: Some developers like using the command line extensively. Godot is designed to be friendly to them, so here are the steps for working entirely from the command line. Given the engine relies on almost no external libraries, initialization times are pretty fast, making it suitable for this workflow.
de: Einige Entwickler verwenden gerne und ausgiebig die Befehlszeile. Godot ist so konzipiert, dass es mit ihnen kompatibel ist. Hier sind die Schritte, um vollständig über die Befehlszeile zu arbeiten. Da die Engine fast keine externen Bibliotheken benötigt, sind die Initialisierungszeiten recht kurz, was sie für diesen Workflow geeignet macht.
zh_cn: 一些开发人员喜欢广泛使用命令行.Godot被设计为对他们友好, 所以这里是完全用命令行工作的步骤. 由于引擎几乎不依赖外部库, 因此初始化时间非常快, 使其适合此工作流程.

source: On Windows and Linux, you can run a Godot binary in a terminal by specifying its relative or absolute path.
de: Unter Windows und Linux können Sie eine Godot-Binärdatei in einem Terminal ausführen, indem Sie den relativen oder absoluten Pfad angeben.
zh_cn: 在 Windows 和 Linux 上，你可以通过指定其相对或绝对路径在终端中运行 Godot 可执行文件。

source: On macOS, the process is different due to Godot being contained within an ``.app`` bundle (which is a *folder*, not a file). To run a Godot binary from a terminal on macOS, you have to ``cd`` to the folder where the Godot application bundle is located, then run ``Godot.app/Contents/MacOS/Godot`` followed by any command line arguments. If you've renamed the application bundle from ``Godot`` to another name, make sure to edit this command line accordingly.
de: Unter macOS ist der Prozess anders, da Godot in einem ``.app``-Bundle enthalten ist (was ein *Ordner* ist, keine Datei). Um eine Godot-Binärdatei von einem Terminal unter macOS aus zu starten, müssen Sie mit ``cd`` in den Ordner wechseln, in dem sich das Godot-Anwendungspaket befindet, und dann ``Godot.app/Contents/MacOS/Godot`` gefolgt von beliebigen Kommandozeilenargumenten ausführen. Wenn Sie das Anwendungspaket ``Godot`` umbenannt haben, stellen Sie sicher, dass Sie diese Kommandozeile entsprechend ändern.
zh_cn: 在 macOS 上，由于 Godot 包含在 ``.app`` 包中，它是一个 *文件夹*\ ，而不是文件，因此运行过程有所不同。要从 macOS 的终端运行 Godot 可执行文件，你必须 ``cd`` 到 Godot 应用程序包所在的文件夹，然后运行 ``Godot.app/Contents/MacOS/Godot``\ ，并在后面加上相关命令行参数。如果你把应用包从 ``Godot`` 改名为其他名称，则需相应地编辑这个命令行。

source: Command line reference
de: Kommandozeilen-Referenz
zh_cn: 命令行参考

source: **Legend**
de: **Legende**
zh_cn: **图例解释**

source: |release| Available in editor builds, debug export templates and release export templates.
de: |release| Verfügbar in Editor-Builds, Debug-Exportvorlagen und Release-Exportvorlagen.
zh_cn: |release| 仅适用于编辑器构建、调试导出模板和发布导出模板中。

source: |debug| Available in editor builds and debug export templates only.
de: |debug| Nur in Editor-Builds und Debug-Exportvorlagen verfügbar.
zh_cn: |debug| 仅适用于编辑器构建和调试导出模板。

source: |editor| Only available in editor builds.
de: |editor| Nur in Editor-Builds verfügbar.
zh_cn: |editor| 仅适用于编辑器构建。

source: Note that unknown command line arguments have no effect whatsoever. The engine will **not** warn you when using a command line argument that doesn't exist with a given build type.
de: Beachten Sie, dass unbekannte Kommandozeilenargumente keinerlei Auswirkungen haben. Die Engine wird Sie **nicht** warnen, wenn Sie ein Kommandozeilenargument verwenden, das für einen bestimmten Build-Typ nicht existiert.
zh_cn: 请注意，未知的命令行参数不会产生任何影响。当命令行中使用了不存在的构建类型时，引擎不会发出警告。

source: **General options**
de: **Allgemeine Optionen**
zh_cn: **常规选项**

source: Command
de: Befehl
zh_cn: 命令

source: Description
de: Beschreibung
zh_cn: 描述

source: |release| Display the list of command line options.
de: |release| Zeigt die Liste der Kommandozeilenoptionen an.
zh_cn: |release| 显示命令行选项列表。

source: |release| Display the version string.
de: |release| Zeigt den Versions-String an.
zh_cn: |release| 显示版本字符串。

source: |release| Use verbose stdout mode.
de: |release| Ausführlichen stdout-Modus verwenden.
zh_cn: |release| 使用冗长标准输出模式。

source: |release| Quiet mode, silences stdout messages. Errors are still displayed.
de: |release| Stummer Modus, unterdrückt stdout-Meldungen. Fehler werden weiterhin angezeigt.
zh_cn: |release| 安静模式，静默标准输出的信息。但错误仍然会显示。

source: **Run options**
de: **Ausführen-Optionen**
zh_cn: **运行选项**

source: |release| Separator for user-provided arguments. Following arguments are not used by the engine, but can be read from ``OS.get_cmdline_user_args()``.
de: |release| Trennzeichen für vom Benutzer bereitgestellte Argumente. Die folgenden Argumente werden nicht von der Engine verwendet, können aber von ``OS.get_cmdline_user_args()`` gelesen werden.
zh_cn: |release| 用户提供参数时使用的分隔符。引擎不会使用这些参数，但可以通过 ``OS.get_cmdline_user_args()`` 读取到。

source: |editor| Start the editor instead of running the scene.
de: |editor| Editor starten, anstatt die Szene ablaufen zu lassen.
zh_cn: |editor| 启动编辑器而不是运行场景。

source: |editor| Start the Project Manager, even if a project is auto-detected.
de: |editor| Projektmanager starten, auch wenn ein Projekt automatisch erkannt wird.
zh_cn: |editor| 即使已经自动检测到项目，仍然启动项目管理器。

source: |editor| Start the editor debug server (``<protocol>://<host/IP>[:<port>]``, e.g. ``tcp://127.0.0.1:6007``)
de: |editor| Debug-Server des Editors starten (``<protocol>://<host/IP>[:<port>]``, z.B. ``tcp://127.0.0.1:6007``)
zh_cn: |editor| 启动编辑器调试服务器（ ``<protocol>://<host/IP>[:<port>]``\ ，例如， ``tcp://127.0.0.1:6007``\ ）

source: |release| Quit after the first iteration.
de: |release| Nach der ersten Iteration beenden.
zh_cn: 第一次迭代后退出.

source: |release| Quit after the given number of iterations. Set to 0 to disable.
de: |release| Beenden nach der angegebenen Anzahl von Iterationen. Zum Deaktivieren auf 0 setzen.
zh_cn: |release| 指定迭代次数后退出。设置为 0 则禁用。

source: ``-l``, ``--language <locale>``
zh_cn: ``-l <locale>``, ``--language <locale>``

source: |release| Use a specific locale. ``<locale>`` follows the format ``language_Script_COUNTRY_VARIANT`` where language is a 2 or 3-letter language code in lowercase and the rest is optional. See :ref:`doc_locales` for more details.
de: |release| Ein bestimmtes Gebietsschema verwenden. ``<locale>`` folgt dem Format ``language_Script_COUNTRY_VARIANT``, wobei language ein 2- oder 3-stelliger Sprachcode in Kleinbuchstaben und der Rest optional ist. Siehe :ref:`doc_locales` für weitere Details.
zh_cn: |release| 使用特定本地语言。 ``<locale>`` 格式为 ``language_Script_COUNTRY_VARIANT``\ ，其中 language 为小写的 2 或 3 个字母组成的语言代码，其余为可选项。详情请参见 :ref:`doc_locales`\ 。

source: ``--path <directory>``
de: ``--path <Verzeichnis>``
zh_cn: ``--path <目录>``

source: |release| Path to a project (``<directory>`` must contain a 'project.godot' file).
de: |release| Pfad zu einem Projekt (``<Verzeichnis>`` muss eine 'project.godot'-Datei enthalten).
zh_cn: |release| 项目的路径（<directory> 目录中必须包含一个“project.godot”文件）。

source: |release| Scan folders upwards for 'project.godot' file.
de: |release| Ordner aufwärts nach der Datei "project.godot" durchsuchen.
zh_cn: |release| 向上扫描文件夹中的“project.godot”文件。

source: |release| Path to a pack (.pck) file to load.
de: |release| Pfad zu einer zu ladenden Pack-Datei (.pck).
zh_cn: |release| 要加载的包（.pck）文件的路径。

source: ``--render-thread <mode>``
zh_cn: ``--render-thread <模式>``

source: |release| Render thread mode ('unsafe', 'safe', 'separate'). See :ref:`Thread Model <class_ProjectSettings_property_rendering/driver/threads/thread_model>` for more details.
de: |release| Render-Thread-Modus ('unsafe', 'safe', 'separate'). Siehe :ref:`Thread-Modell <class_ProjectSettings_property_rendering/driver/threads/thread_model>` für weitere Details.
zh_cn: |release| 渲染线程模式（'unsafe'、'safe'、'separate'）。详见\ :ref:`线程模型 <class_ProjectSettings_property_rendering/driver/threads/thread_model>`\ 。

source: ``--remote-fs <address>``
zh_cn: ``--remote-fs <地址>``

source: |release| Remote filesystem (``<host/IP>[:<port>]`` address).
de: |release| Remote-Dateisystem (``<host/IP>[:<port>]``-Adresse).
zh_cn: |release| 远程文件系统（\ ``<主机名/IP>[:<端口号>]`` 地址）。

source: |release| Password for remote filesystem.
de: |release| Passwort für Remote-Dateisystem.
zh_cn: |release| 远程文件系统的密码。

source: ``--audio-driver <driver>``
zh_cn: ``--audio-driver <驱动>``

source: |release| Audio driver. Use ``--help`` first to display the list of available drivers.
de: |release| Audiotreiber. Verwenden Sie zuerst ``--help``, um die Liste der verfügbaren Treiber anzuzeigen.
zh_cn: |release| 音频驱动。使用 ``--help`` 来显示可用驱动列表。

source: |release| Display driver (and rendering driver). Use ``--help`` first to display the list of available drivers.
de: |release| Display-Treiber (und Rendering-Treiber). Verwenden Sie zuerst ``--help``, um die Liste der verfügbaren Treiber anzuzeigen.
zh_cn: 视频驱动。使用 ``--help`` 来显示可用驱动列表。

source: |release| Renderer name. Requires driver support.
de: |release| Renderer-Name. Erfordert Treiberunterstützung.
zh_cn: |release| 渲染器名称。需要驱动程序支持。

source: |release| Rendering driver (depends on display driver). Use ``--help`` first to display the list of available drivers.
de: |release| Rendering-Treiber (abhängig vom Display-Treiber). Verwenden Sie zuerst ``--help``, um die Liste der verfügbaren Treiber anzuzeigen.
zh_cn: 视频驱动。使用 ``--help`` 来显示可用驱动列表。

source: ``--gpu-index <device_index>``
zh_cn: ``--gpu-index <设备索引>``

source: |release| Use a specific GPU (run with ``--verbose`` to get available device list).
de: |release| Eine bestimmte GPU verwenden (mit ``--verbose`` ausführen, um eine Liste der verfügbaren Geräte zu erhalten).
zh_cn: |release| 使用特定 GPU（使用 ``--verbose`` 运行以获取可用设备列表）。

source: |release| Text driver (Fonts, BiDi, shaping).
de: |release| Texttreiber (Schriftarten, BiDi, Shaping).
zh_cn: |release| 文本驱动程序（字体、BiDi、整形）。

source: |release| Pen tablet input driver.
de: |release| Stifttablett-Eingabetreiber.
zh_cn: |release| 手写板输入驱动程序。

source: |release| Enable headless mode (``--display-driver headless --audio-driver Dummy``). Useful for servers and with ``--script``.
de: |release| Aktivieren Sie den Headless-Modus (``--display-driver headless --audio-driver Dummy``). Nützlich für Server und mit ``--script``.
zh_cn: |release| 启用无头模式（\ `--display-driver headless --audio-driver Dummy`\ ）。适用于服务器和 ``--script``\ 。

source: |release| Run the engine in a way that a movie is written (usually with .avi or .png extension). ``--fixed-fps`` is forced when enabled, but can be used to change movie FPS. ``--disable-vsync`` can speed up movie writing but makes interaction more difficult. ``--quit-after`` can be used to specify the number of frames to write.
de: |release| Führt die Engine so aus, dass ein Film geschrieben wird (normalerweise mit .avi oder .png-Erweiterung). ``--fixed-fps`` wird erzwungen, falls aktiviert, kann aber verwendet werden, um die FPS des Films zu ändern. ``--disable-vsync`` kann das Schreiben von Filmen beschleunigen, macht aber die Interaktion schwieriger. ``--quit-after`` kann verwendet werden, um die Anzahl der zu schreibenden Bilder festzulegen.
zh_cn: |release| 以写入影片（通常以 .avi 或 .png 为扩展名）的方式运行引擎。 ``-fixed-fps`` 在启用时是强制的，但可以用来改变影片的 FPS。 ``disable-vsync`` 可以加快影片的写入速度，但会增加交互难度。 ``--quit-after`` 可以用来指定要写入的帧数。

source: **Display options**
de: **Anzeige-Optionen**
zh_cn: **显示选项**

source: |release| Request fullscreen mode.
de: |release| Vollbildmodus anfordern.
zh_cn: 尝试使用全屏模式.

source: |release| Request a maximized window.
de: |release| Maximiertes Fenster anfordern.
zh_cn: 尝试最大化窗口。

source: |release| Request windowed mode.
de: |release| Fenstermodus anfordern.
zh_cn: 使用窗口模式。

source: |release| Request an always-on-top window.
de: |release| Fenster anfordern, das immer im Vordergrund ist.
zh_cn: 请求一个置顶窗口.

source: |release| Request window resolution.
de: |release| Fenster-Auflösung anfordern.
zh_cn: 窗口分辨率。

source: |release| Request window position.
de: |release| Fenster-Position anfordern.
zh_cn: 指定屏幕位置.

source: |release| Request window screen.
de: |release| Fenster-Bildschirm anfordern.
zh_cn: 请求窗口分辨率。

source: |release| Use a single window (no separate subwindows).
de: |release| Einzelnes Fenster verwenden (keine separaten Unterfenster).
zh_cn: |release| 使用单个窗口（没有单独的子窗口）。

source: |release| Select XR mode ('default', 'off', 'on').
de: |release| XR-Modus auswählen ("Standard", "Aus", "Ein").
zh_cn: |release| 选择 XR 模式（"默认"、"关闭"、"打开"）。

source: **Debug options**
de: **Debug-Optionen**
zh_cn: **调试选项**

source: |release| Debug (local stdout debugger).
de: |release| Debug (lokaler stdout-Debugger).
zh_cn: 调试(本地 stdout 调试器)。

source: |release| Breakpoint list as source::line comma-separated pairs, no spaces (use ``%20`` instead).
de: |release| Haltepunktliste als source::line Komma-getrennte Paare, keine Leerzeichen (stattdessen ``%20`` verwenden).
zh_cn: |release| 断点列表，形式为英文逗号分隔的“源文件::行号”，不带空格（空格用 ``%20`` 代替）。

source: |release| Enable profiling in the script debugger.
de: |release| Profiling im Skript-Debugger einschalten.
zh_cn: 在脚本调试器中启用分析。

source: |release| Show a GPU profile of the tasks that took the most time during frame rendering.
de: |release| GPU-Profil der Aufgaben anzeigen, die während des Frame-Renderings die meiste Zeit in Anspruch genommen haben.
zh_cn: |release| 显示帧渲染过程中耗时最长任务的 GPU 分析。

source: |release| Enable graphics API :ref:`validation layers <doc_vulkan_validation_layers>` for debugging.
de: |release| Grafik-API :ref:`Validation Layers <doc_vulkan_validation_layers>` zur Fehlersuche aktivieren.
zh_cn: |release| 启用图形 API :ref:`验证层 <doc_vulkan_validation_layers>` 以进行调试。

source: |debug| Abort on GPU errors (usually validation layer errors), may help see the problem if your system freezes.
de: |debug| Abbruch bei GPU-Fehlern (in der Regel Validation Layer-Fehler), kann helfen, das Problem zu erkennen, wenn Ihr System einfriert.
zh_cn: |debug| 在 GPU 出错时终止（通常是验证层错误），这有助于在系统冻结时发现问题。

source: |release| Remote debug (``<protocol>://<host/IP>[:<port>]``, e.g. ``tcp://127.0.0.1:6007``).
de: |release| Remote-Debug (``<protocol>://<host/IP>[:<port>]``, z.B. ``tcp://127.0.0.1:6007``).
zh_cn: |release| 远程调试（ ``<protocol>://<host/IP>[:<port>]``\ ，例如 ``tcp://127.0.0.1:6007``\ ）。

source: |release| Scene tree runs in single-threaded mode. Sub-thread groups are disabled and run on the main thread.
de: |release| Szenenbaum läuft im Single-Thread-Modus. Sub-Thread-Gruppen sind deaktiviert und laufen auf dem Haupt-Thread.
zh_cn: |release| 场景树以单线程模式运行。子线程组被禁用，在主线程上运行。

source: |debug| Show collision shapes when running the scene.
de: |debug| Kollisions-Shapes beim Ausführen der Szene anzeigen.
zh_cn: 运行场景时显示碰撞框形状。

source: |debug| Show path lines when running the scene.
de: |debug| Pfadlinien beim Ausführen der Szene anzeigen.
zh_cn: 运行场景时显示路径。

source: |debug| Show navigation polygons when running the scene.
de: |debug| Navigationspolygone beim Ausführen der Szene anzeigen.
zh_cn: 运行场景时显示多边形导航。

source: |debug| Show navigation avoidance debug visuals when running the scene.
de: |debug| Debug-Visualisierungen zur Navigationsvermeidung anzeigen, wenn die Szene ausgeführt wird.
zh_cn: 当运行场景时显示多边形导航.

source: |debug| Print all StringName allocations to stdout when the engine quits.
de: |debug| Alle StringName-Zuweisungen auf stdout ausgeben, wenn die Engine beendet wird.
zh_cn: |debug| 当引擎退出时，将所有 StringName 分配打印到 stdout。

source: |release| Simulate high CPU load (delay each frame by <ms> milliseconds).
de: |release| Hohe CPU-Last simulieren (verzögert jedes Bild um <ms> Millisekunden).
zh_cn: |release| 模拟高 CPU 负载（每帧延迟 <ms> 毫秒）。

source: ``--time-scale <scale>``
zh_cn: ``--time-scale <缩放>``

source: |release| Force time scale (higher values are faster, 1.0 is normal speed).
de: |release| Zeitskala erzwingen (höhere Werte sind schneller - 1,0 ist normale Geschwindigkeit).
zh_cn: |release| 强制时间缩放（值越大速度越快，1.0是正常速度）。

source: |release| Forces disabling of vertical synchronization, even if enabled in the project settings. Does not override driver-level V-Sync enforcement.
de: |release| Deaktivierung der vertikalen Synchronisation erzwingen, auch wenn sie in den Projekteinstellungen aktiviert ist. Die V-Sync-Erzwingung auf Treiberebene wird nicht außer Kraft gesetzt.
zh_cn: |release| 即使在项目设置中启用，也会强制禁用垂直同步。不会覆盖驱动程序级的 V-Sync 执行。

source: |release| Disable render loop so rendering only occurs when called explicitly from script.
de: |release| Rendering-Schleife deaktivieren, so dass das Rendering nur erfolgt, wenn es explizit vom Skript aufgerufen wird.
zh_cn: |release| 禁用渲染循环，以便仅在从脚本显式调用时才进行渲染。

source: |release| Disable crash handler when supported by the platform code.
de: |release| Crash-Handler deaktivieren, wenn vom Plattformcode unterstützt.
zh_cn: |release| 当平台代码支持时，禁用崩溃处理程序。

source: ``--fixed-fps <fps>``
zh_cn: ``--fixed-fps <帧率>``

source: |release| Force a fixed number of frames per second. This setting disables real-time synchronization.
de: |release| Feste Anzahl von Bildern pro Sekunde erzwingen. Mit dieser Einstellung wird die Echtzeitsynchronisation deaktiviert.
zh_cn: 每秒强制固定数量的帧。此设置禁用实时同步。

source: ``--delta-smoothing <enable>``
zh_cn: ``--delta-smoothing <启用>``

source: |release| Enable or disable frame delta smoothing ('enable', 'disable').
de: |release| Delta-Glättung aktivieren oder deaktivieren ('enable', 'disable').
zh_cn: |release| 启用或禁用帧间隔平滑（"启用"、"禁用"）。

source: |release| Print the frames per second to the stdout.
de: |release| Frames pro Sekunde auf stdout ausgeben.
zh_cn: |release| 将每秒帧数打印到标准输出上。

source: **Standalone tools**
de: **Eigenständige Tools**
zh_cn: **单独的工具**

source: |release| Run a script.
de: |release| Skript ausführen.
zh_cn: |release| 运行脚本。

source: |release| Only parse for errors and quit (use with ``--script``).
de: |release| Nur auf Fehler prüfen und beenden (mit ``--script`` verwenden).
zh_cn: |release| 仅解析错误并退出（与 ``--script`` 一起使用）。

source: |editor| Export the project using the given preset and matching release template. The preset name should match one defined in export_presets.cfg. ``<path>`` should be absolute or relative to the project directory, and include the filename for the binary (e.g. 'builds/game.exe'). The target directory should exist.
de: |editor| Projekt mit der angegebenen Vorgabe und der passenden Release-Vorlage exportieren. Der Name der Vorgabe sollte mit einem in export_presets.cfg definierten Namen übereinstimmen. ``<Pfad>`` sollte absolut oder relativ zum Projektverzeichnis sein und den Dateinamen für das Binary enthalten (z.B. 'builds/game.exe'). Das Zielverzeichnis sollte existieren.
zh_cn: |editor| 使用给定的预设和匹配的发布模板导出项目。预设名称应与 export_presets.cfg 中定义的名称一致。 ``<路径>`` 应为项目目录的绝对或相对路径，并包含二进制文件的文件名（例如 “builds/game.exe”）。并且目标目录应该存在。

source: |editor| Like ``--export-release``, but use debug template.
de: |editor| Wie ``--export-release``, aber mit Debug-Vorlage.
zh_cn: |editor| 与 ``--export-release`` 类似，但使用调试模板。

source: ``--export-pack <preset> <path>``
zh_cn: ``--export-pack <预设> <路径>``

source: |editor| Like ``--export-release``, but only export the game pack for the given preset. The ``<path>`` extension determines whether it will be in PCK or ZIP format.
de: |editor| Wie ``--export-release``, aber exportiert nur das Spielpaket für die angegebene Voreinstellung. Die ``<Pfad>``-Erweiterung bestimmt, ob es im PCK- oder ZIP-Format sein wird.
zh_cn: |editor| 与 ``--export-release`` 类似，但只会以预设参数导出游戏包。\ ``<path>`` 的扩展名决定它是 PCK 还是 ZIP 格式。

source: ``--convert-3to4 [<max_file_kb>] [<max_line_size>]``
zh_cn: ``--convert-3to4 [<最大文件kb值>] [<最大行数>]``

source: |editor| Convert project from Godot 3.x to Godot 4.x.
de: |editor| Projekt von Godot 3.x nach Godot 4.x konvertieren.
zh_cn: |editor| 将项目从 Godot 3.x 转换到 Godot 4.x。

source: ``--validate-conversion-3to4 [<max_file_kb>] [<max_line_size>]``
zh_cn: ``--validate-conversion-3to4 [<最大文件kb值>] [<最大行数>]``

source: |editor| Show what elements will be renamed when converting project from Godot 3.x to Godot 4.x.
de: |editor| Zeigt an, welche Elemente bei der Konvertierung eines Projekts von Godot 3.x nach Godot 4.x umbenannt werden.
zh_cn: |editor| 显示把项目从 Godot 3.x 转换到 Godot 4.x 时将重命名哪些元素。

source: |editor| Dump the engine API reference to the given ``<path>`` in XML format, merging if existing files are found.
de: |editor| Engine-API-Referenz auf den angegebenen ``<Pfad>`` im XML-Format ausgeben, Mergen, wenn vorhandene Dateien gefunden werden.
zh_cn: |editor| 将引擎 API 参考以 XML 格式转储到给定的 ``<path>`` 中，如果路径已有文件则进行合并。

source: |editor| Disallow dumping the base types (used with ``--doctool``).
de: |editor| Dumping der Basistypen verbieten (verwendet mit ``--doctool``).
zh_cn: |editor| 禁止转储基本类型（与 ``--doctool`` 一起使用）。

source: ``--gdscript-docs <path>``
zh_cn: ``--gdscript-docs <路径>``

source: |editor| Rather than dumping the engine API, generate API reference from the inline documentation in the GDScript files found in <path> (used with ``--doctool``).
de: |editor| API-Referenz aus der Inline-Dokumentation in den GDScript-Dateien in <Pfad> generieren (verwendet mit ``--doctool``), anstatt die Engine-API zu dumpen.
zh_cn: |editor| 不转储引擎 API，而是从 <路径> 找到 GDScript 文件（与 ``--doctool`` 一起使用）的内联文档生成 API 引用。

source: |editor| Build the scripting solutions (e.g. for C# projects). Implies ``--editor`` and requires a valid project to edit.
de: |editor| Bauen der Skripting-Solutions (z.B. für C# Projekte). Impliziert ``--editor`` und erfordert ein gültiges Projekt zum Bearbeiten.
zh_cn: |editor| 构建脚本解决方案（例如 C# 项目）。隐含 ``--editor`` 并需要一个有效的项目来编辑。

source: |editor| Generate GDExtension header file 'gdnative_interface.h' in the current folder. This file is the base file required to implement a GDExtension.
de: |editor| GDExtension-Header-Datei 'gdnative_interface.h' im aktuellen Ordner generieren. Diese Datei ist die Basisdatei, die zur Implementierung einer GDExtension benötigt wird.
zh_cn: |editor| 在当前文件夹下生成 GDExtension 头文件 “gdnative_interface.h”。该文件是实现 GDExtension 所需的基础文件。

source: |editor| Generate JSON dump of the Godot API for GDExtension bindings named 'extension_api.json' in the current folder.
de: |editor| JSON-Dump der Godot-API für GDExtension-Bindungen mit dem Namen 'extension_api.json' im aktuellen Ordner generieren.
zh_cn: |editor| 在当前文件夹中生成 GDExtension 绑定的 Godot API ，其名为“extension_api.json” 的JSON 转储。

source: ``--validate-extension-api <path>``
zh_cn: ``--validate-extension-api <路径>``

source: |editor| Validate an extension API file dumped (with the option above) from a previous version of the engine to ensure API compatibility. If incompatibilities or errors are detected, the return code will be non-zero.
de: |editor| Erweiterungs-API-Datei validieren, die (mit der obigen Option) aus einer früheren Version der Engine kopiert wurde, um die API-Kompatibilität sicherzustellen. Wenn Inkompatibilitäten oder Fehler entdeckt werden, ist der Rückgabewert ungleich Null.
zh_cn: |editor| 验证从上一版本引擎转储（使用上述选项）的扩展 API 文件，以确保 API 的兼容性。如果检测到不兼容或错误，返回代码将为非零。

source: |editor| Benchmark the run time and print it to console.
de: |editor| Benchmarking der Laufzeit und Ausgabe auf der Konsole.
zh_cn: |editor| 对运行时间进行基准测试，并将其打印到控制台。

source: ``--benchmark-file <path>``
zh_cn: ``--benchmark-file <路径>``

source: |editor| Benchmark the run time and save it to a given file in JSON format. The path should be absolute.
de: |editor| Benchmarking der Laufzeit und Speichern in einer angegebenen Datei im JSON-Format. Der Pfad sollte absolut sein.
zh_cn: |editor| 对运行时间进行基准测试，并以 JSON 格式保存到指定文件。路径应为绝对路径。

source: Path
de: Pfad
zh_cn: 路径
