Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/command_line_tutorial.po
Languages: de, zh_cn

source: It is recommended to place your Godot editor binary in your ``PATH`` environment variable, so it can be executed easily from any place by typing ``godot``. You can do so on Linux by placing the Godot binary in ``/usr/local/bin`` and making sure it is called ``godot`` (case-sensitive).
de: Es wird empfohlen, die Godot-Editor-Binärdatei in der ``PATH``-Umgebungsvariablen zu platzieren, so dass sie leicht von jedem Ort aus durch Eingabe von ``godot`` ausgeführt werden kann. Unter Linux können Sie dies tun, indem Sie die Godot-Binärdatei in ``/usr/local/bin`` ablegen und sicherstellen, dass sie ``godot`` heißt (Groß- und Kleinschreibung beachten).
zh_cn: 建议将 Godot 编辑器的二进制文件放在 ``PATH`` 环境变量中，这样就可以通过在任何地方键入 ``godot`` 来轻松地执行。在 Linux 上，就可以将 Godot 二进制文件放在 ``/usr/local/bin`` 中，请确保文件名为 ``godot``\ （注意大小写）。

source: To achieve this on Windows or macOS easily, you can install Godot using `Scoop <https://scoop.sh>`__ (on Windows) or `Homebrew <https://brew.sh>`__ (on macOS). This will automatically make the copy of Godot installed available in the ``PATH``:
de: Um dies unter Windows oder macOS einfach zu erreichen, können Sie Godot mit `Scoop <https://scoop.sh>`__ (unter Windows) oder `Homebrew <https://brew.sh>`__ (unter macOS) installieren. Dadurch wird die installierte Kopie von Godot automatisch im ``PATH`` verfügbar gemacht:
zh_cn: 要在 Windows 或 macOS 上轻松实现这一目标，可以使用 `Scoop <https://scoop.sh>`__\ （在 Windows 上）或 `Homebrew <https://brew.sh>`__\ （在 macOS 上）安装 Godot。这将自动在 ``PATH`` 中提供已安装的 Godot 副本：

source: Setting the project path
de: Projektpfad setzen
zh_cn: 设置项目路径

source: Depending on where your Godot binary is located and what your current working directory is, you may need to set the path to your project for any of the following commands to work correctly.
de: Je nachdem, wo sich Ihre Godot-Binärdatei befindet und welches Ihr aktuelles Arbeitsverzeichnis ist, müssen Sie möglicherweise den Pfad zu Ihrem Projekt festlegen, damit einer der folgenden Befehle korrekt funktioniert.
zh_cn: 根据Godot二进制文件的位置以及当前的工作目录, 你可能需要设置项目的路径, 以下任何命令才能正常工作.

source: For example, the full command for exporting your game (as explained below) might look like this:
de: Zum Beispiel, der vollständige Befehl zum exportieren Ihres Spiels (wie unten beschrieben) sieht in etwa so aus:
zh_cn: 例如, 用于导出游戏的完整命令(如下所述)可能如下所示:

source: Creating a project
de: Projekt erzeugen
zh_cn: 创建一个项目

source: Creating a project from the command line can be done by navigating the shell to the desired place and making a ``project.godot`` file.
de: Ein Projekt kann von der Kommandozeile aus erstellt werden, indem man in der Shell zum gewünschten Ort navigiert und eine ``project.godot``-Datei erstellt.
zh_cn: 要通过命令行创建项目，可以将 shell 导航至所需位置并创建 ``project.godot`` 文件。

source: The project can now be opened with Godot.
de: Das Projekt kann nun mit Godot geöffnet werden.
zh_cn: 现在可以使用Godot打开该项目.

source: Running the editor
de: Editor starten
zh_cn: 运行编辑器

source: If a scene has been created and saved, it can be edited later by running the same code with that scene as argument.
de: Wenn eine Szene erstellt und gespeichert wurde, kann sie später bearbeitet werden, indem derselbe Code mit dieser Szene als Argument ausgeführt wird.
zh_cn: 如果已经创建并保存了场景, 则可以稍后以该场景作为参数运行相同的代码来对其进行编辑.

source: Erasing a scene
de: Szene löschen
zh_cn: 删除一个场景

source: Godot is friends with your filesystem and will not create extra metadata files. Use ``rm`` to erase a scene file. Make sure nothing references that scene. Otherwise, an error will be thrown upon opening the project.
de: Godot ist mit wird Ihrem Dateisystem zuliebe keine zusätzlichen Metadaten-Dateien erstellen. Verwenden Sie ``rm``, um eine Szenendatei zu löschen. Stellen Sie sicher, dass nichts auf diese Szene verweist. Andernfalls wird beim Öffnen des Projekts ein Fehler ausgelöst.
zh_cn: Godot对你的文件系统非常友好，不会创建额外的元数据文件。你可以使用 ``rm`` 来删除场景文件，但是在这之前需要确定该场景被引用的情况，否则再打开该项目时会抛出错误。

source: Running the game
de: Spiel starten
zh_cn: 运行游戏

source: When a specific scene needs to be tested, pass that scene to the command line.
de: Wenn eine spezielle Szene getestet werden soll, fügen Sie diese Szene in die Eingabeaufforderung ein.
zh_cn: 当需要测试特定场景时, 将该场景传递给命令行.

source: Debugging
zh_cn: 调试

source: Catching errors in the command line can be a difficult task because they scroll quickly. For this, a command line debugger is provided by adding ``-d``. It works for running either the game or a single scene.
de: Das Auffinden von Fehlern in der Kommandozeile kann eine schwierige Aufgabe sein, da sie schnell durchlaufen. Zu diesem Zweck wird ein Kommandozeilen-Debugger durch Hinzufügen von ``-d`` bereitgestellt. Er funktioniert entweder für das Spiel oder eine einzelne Szene.
zh_cn: 捕获命令行中的错误可能是一项艰巨的任务，因为它们滚动得很快。为此，使用 ``-d`` 来启动命令行调试器。它适用于运行游戏或单个场景。

source: Exporting
de: Exportieren
zh_cn: 导出

source: Exporting the project from the command line is also supported. This is especially useful for continuous integration setups.
de: Das Exportieren des Projekts von der Kommandozeile aus wird ebenfalls unterstützt. Dies ist besonders nützlich für die Continuous Integration.
zh_cn: 也支持从命令行导出项目。这对持续集成设置特别有用。

source: Using the ``--headless`` command line argument is **required** on platforms that do not have GPU access (such as continuous integration). On platforms with GPU access, ``--headless`` prevents a window from spawning while the project is exporting.
de: Die Verwendung des Kommandozeilenarguments ``--headless`` ist **erforderlich** auf Plattformen, die keinen GPU-Zugriff haben (z.B. Continuous Integration). Auf Plattformen mit GPU-Zugriff verhindert ``--headless``, dass ein Fenster erscheint, während das Projekt exportiert wird.
zh_cn: 在没有 GPU 访问权限的平台上（如持续集成），必须使用 ``--headless`` 命令行参数。在有 GPU 访问权限的平台上， ``--headless`` 可阻止在导出项目时生成窗口。

source: The preset name must match the name of an export preset defined in the project's ``export_presets.cfg`` file. If the preset name contains spaces or special characters (such as "Windows Desktop"), it must be surrounded with quotes.
de: Der Name der Vorgabe muss mit dem Namen einer Exportvorgabe übereinstimmen, die in der Datei ``export_presets.cfg`` des Projekts definiert ist. Wenn der Vorgabenname Leerzeichen oder Sonderzeichen enthält (z. B. "Windows Desktop"), muss er mit Anführungszeichen umgeben werden.
zh_cn: 预设名称必须与项目的 ``export_presets.cfg`` 文件中定义的导出预设名称一致. 如果预设名称包含空格或特殊字符(如 "Windows Desktop"), 必须用引号引起来.

source: To export a debug version of the game, use the ``--export-debug`` switch instead of ``--export-release``. Their parameters and usage are the same.
de: Um eine Debug-Version des Spiels zu exportieren, verwenden Sie den Schalter ``--export-debug`` anstelle von ``--export-release``. Die Parameter und die Verwendung sind die gleichen.
zh_cn: 要导出游戏的调试版本，请使用 ``--export-debug`` 开关，而不是 ``--export-release``。它们的参数和用法是相同的。

source: To export only a PCK file, use the ``--export-pack`` option followed by the preset name and output path, with the file extension, instead of ``--export-release`` or ``--export-debug``. The output path extension determines the package's format, either PCK or ZIP.
de: Um nur eine PCK-Datei zu exportieren, verwenden Sie die Option ``--export-pack``, gefolgt von dem Vorgabenamen und dem Ausgabepfad, mit der Dateierweiterung, anstelle von ``--export-release`` oder ``--export-debug``. Die Erweiterung des Ausgabepfades bestimmt das Format des Pakets, entweder PCK oder ZIP.
zh_cn: 要仅导出 PCK 文件，请使用“--export-pack”选项，后跟预设名称和输出路径以及文件扩展名，而不是“--export-release”或“--export” -调试``。 输出路径扩展名决定包的格式：PCK 或ZIP。

source: When specifying a relative path as the path for ``--export-release``, ``--export-debug`` or ``--export-pack``, the path will be relative to the directory containing the ``project.godot`` file, **not** relative to the current working directory.
de: Wenn ein relativer Pfad als Pfad für ``--export-release``, ``--export-debug`` oder ``--export-pack`` angegeben wird, ist der Pfad relativ zu dem Verzeichnis, das die Datei ``project.godot`` enthält, **nicht** relativ zum aktuellen Arbeitsverzeichnis.
zh_cn: 当指定相对路径作为“--export-release”、“--export-debug”或“--export-pack”的路径时，该路径将相对于包含“ `project.godot`` 文件， 而，不，是，相对于当前工作目录。

source: Running a script
de: Ein Skript ausführen
zh_cn: 运行脚本

source: It is possible to run a ``.gd`` script from the command line. This feature is especially useful in large projects, e.g. for batch conversion of assets or custom import/export.
de: Es ist möglich, ein ``.gd``-Skript über die Befehlszeile auszuführen. Diese Funktion ist besonders bei großen Projekten nützlich, z.B. für die Batch-Konvertierung von Assets oder den benutzerdefinierten Import/Export.
zh_cn: 可以从命令行运行 ``.gd`` 脚本。此功能在大型项目中特别有用，例如，用于资产的批量转换或自定义导入/导出。

source: The script must inherit from ``SceneTree`` or ``MainLoop``.
de: Das Skript muss von ``SceneTree`` oder ``MainLoop`` erben.
zh_cn: 该脚本必须继承自 ``SceneTree`` 或 ``MainLoop``\ 。

source: Here is an example ``sayhello.gd``, showing how it works:
de: Hier ist ein Beispiel ``sayhello.gd``, das zeigt, wie es funktioniert:
zh_cn: 下面的 ``sayhello.gd`` 是一个简单的用法示例：

source: And how to run it:
de: Und so wird es ausgeführt:
zh_cn: 以及如何运行它：

source: If no ``project.godot`` exists at the path, current path is assumed to be the current working directory (unless ``--path`` is specified).
de: Wenn kein ``project.godot`` im Pfad existiert, wird der aktuelle Pfad als das aktuelle Arbeitsverzeichnis angenommen (es sei denn, ``--path`` ist angegeben).
zh_cn: 如果路径中不存在 ``project.godot``\ ，则假定当前路径为当前工作目录（除非指定了 ``--path``\ ）。

source: The first line of ``sayhello.gd`` above is commonly referred to as a *shebang*. If the Godot binary is in your ``PATH`` as ``godot``, it allows you to run the script as follows in modern Linux distributions, as well as macOS:
de: Die erste Zeile von ``sayhello.gd`` oben wird allgemein als *shebang* bezeichnet. Wenn sich die Godot-Binärdatei in Ihrem ``PATH`` als ``godot`` befindet, können Sie das Skript in modernen Linux-Distributionen sowie unter MacOS wie folgt ausführen:
zh_cn: 以上 ``sayhello.gd`` 的第一行通常被称为 *shebang*\ 。如果 Godot 二进制文件在你的 ``PATH`` 中，名为 ``godot``\ ，则它允许你在现代 Linux 发行版以及 macOS 中按以下方式运行脚本：

source: If the above doesn't work in your current version of Linux or macOS, you can always have the shebang run Godot straight from where it is located as follows:
de: Wenn das oben genannte unter Ihrer aktuellen Linux- oder MacOS-Version nicht funktioniert, können Sie den "Shebang" immer wie folgt direkt von Godot ausführen lassen:
zh_cn: 如果上述方法在你当前版本的 Linux 或 macOS 中不起作用，你可以随时让 shebang 直接从它所在的位置运行 Godot：

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态

source: debug
de: Debuggen
