Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/customizing_editor.po
Languages: de, zh_cn, zh_tw

source: Customizing the interface
de: Anpassen der Benutzeroberfläche
zh_cn: 自定义界面
zh_tw: 自定建置

source: Godot's interface lives in a single window by default. Since Godot 4.0, you can split several elements to separate windows to better make use of multi-monitor setups.
de: Die Godot-Oberfläche wird standardmäßig in einem einzigen Fenster angezeigt. Seit Godot 4.0 können Sie mehrere Elemente in separate Fenster aufteilen, um mehrere Monitore besser nutzen zu können.
zh_cn: 默认情况下，Godot 的界面位于单个窗口中。 从 Godot 4.0 开始，你可以将多个元素拆分到多个单独的窗口中，以更好地利用多显示器的配置。
zh_tw: 預設情況下，Godot 的介面位於單個視窗中。 從 Godot 4.0 開始，您可以將多個元素拆分到多個單獨的視窗中，以更好地利用多顯示器的配置。

source: Moving and resizing docks
de: Docks verschieben und ihre Größe ändern
zh_cn: 面板的移动和大小调整
zh_tw: 面板的移動和大小調整

source: Click and drag on the edge of any dock or panel to resize it horizontally or vertically:
de: Klicken Sie auf den Rand eines Docks oder Bedienfelds und ziehen Sie es, um seine Größe horizontal oder vertikal zu ändern:
zh_cn: 点击并拖拽任何停靠面板或面板的边缘以水平或垂直地调整它们的大小：
zh_tw: 點擊並拖拽任何停靠面板或面板的邊緣以水平或垂直地調整它們的大小：

source: Resizing a dock in the editor
de: Größe eines Docks im Editor ändern
zh_cn: 在编辑器中调整面板大小
zh_tw: 使用程式碼來連接訊號

source: Click the "3 vertical dots" icon at the top of any dock to change its location, or split it to a separate window by choosing **Make Floating** in the submenu that appears:
de: Klicken Sie auf das Icon mit den "3 vertikalen Punkten" am oberen Rand eines beliebigen Docks, um seine Position zu ändern, oder teilen Sie es in ein separates Fenster auf, indem Sie im angezeigten Untermenü **Schwebend machen** wählen:
zh_cn: 点击停靠面板顶端的“垂直排列的三个点”图标会弹出用于改变它们的位置，或通过选择\**浮动**\来将其拆分成独立的窗口的子菜单：
zh_tw: 點擊任何停靠面板頂端的“垂直排列的三個點”圖示以改變它們的位置，或通過在出現的子功能表中選擇\\\\**浮動**\\\\來將它拆分成獨立的視窗：

source: Moving a dock in the editor
de: Verschieben eines Docks im Editor
zh_cn: 在编辑器中移动面板
zh_tw: 使用程式碼來連接訊號

source: To move a floating dock back to the editor window, close the dock window using the **×** button in the top-right corner of the window (or in the top-left corner on macOS). Alternatively, you can press :kbd:`Alt + F4` while the split window is focused.
de: Um ein schwebendes Dock wieder in das Editor-Fenster zu verschieben, schließen Sie das Dock-Fenster mit dem **×**-Button in der oberen rechten Ecke des Fensters (oder in der oberen linken Ecke unter macOS). Alternativ können Sie auch :kbd:`Alt + F4` drücken, während das geteilte Fenster fokussiert ist.
zh_cn: 如果要将浮动面板移回编辑器窗口，请使用窗口右上角（或 macOS 左上角）的 **×** 按钮关闭面板窗口。聚焦分割窗口时也可以按 :kbd:`Alt + F4`\ 。
zh_tw: 如果要將一個浮動面板移回編輯器視窗，請使用視窗右上角（或 macOS 左上角）的 **x** 按鈕關閉停靠面板視窗。 或者，你可以在分割視窗被聚焦時按 :kbd:`Alt + F4` 。

source: Splitting the script or shader editor to its own window
de: Aufteilung des Skript- oder Shader-Editors in ein eigenes Fenster
zh_cn: 将脚本或着色器编辑器拆分为独立窗口
zh_tw: 將腳本或著色器編輯器拆分為獨立視窗

source: This feature is only available on platforms that support spawning multiple windows: Windows, macOS and Linux.
de: Dieses Feature ist nur auf Plattformen verfügbar, die das Erzeugen mehrerer Fenster unterstützen: Windows, macOS und Linux.
zh_cn: 这个功能仅在支持生成多窗口的平台可用：Windows、macOS、Linux。
zh_tw: 這個功能僅在支援生成多視窗的平臺可用：Windows、macOS、Linux。

source: This feature is also not available if **Single Window Mode** is enabled in the Editor Settings.
de: Dieses Feature ist auch nicht verfügbar, wenn der **Einzelfenster-Modus** in den Editoreinstellungen aktiviert ist.
zh_cn: 如果编辑器设置中启用了\ **单窗口模式**\ ，则这个功能不可用。
zh_tw: 如果編輯器設定中啟用了**單視窗模式**，則這個功能不可用。

source: Since Godot 4.1, you can split the script or shader editor to its own window.
de: Seit Godot 4.1 können Sie den Skript- oder Shader-Editor in ein eigenes Fenster aufteilen.
zh_cn: 从 Godot 4.1 开始，你可以将脚本或着色器编辑器拆分为独立窗口。
zh_tw: 從 Godot 4.1 開始，你可以將腳本或著色器編輯器拆分為獨立視窗。

source: To split the script editor to its own window, click the corresponding button in the top-right corner of the script editor:
de: Um den Skript-Editor in ein eigenes Fenster zu teilen, klicken Sie auf den entsprechenden Button in der oberen rechten Ecke des Skript-Editors:
zh_cn: 要将脚本编辑器拆分为独立窗口，请点击脚本编辑器右上角的对应按钮：
zh_tw: 要將腳本編輯器拆分為獨立視窗，請點擊腳本編輯器右上角的對應按鈕：

source: Splitting the script editor to its own window
de: Aufteilung des Skript-Editors in ein eigenes Fenster
zh_cn: 将脚本编辑器拆分为独立窗口
zh_tw: 將腳本編輯器拆分為獨立視窗

source: To split the shader editor to its own window, click the corresponding button in the top-right corner of the script editor:
de: Um den Shader-Editor in ein eigenes Fenster zu teilen, klicken Sie auf den entsprechenden Button in der oberen rechten Ecke des Skript-Editors:
zh_cn: 要将着色器编辑器拆分为独立窗口，请点击脚本编辑器右上角的对应按钮：
zh_tw: 要將著色器編輯器拆分為獨立視窗，請點擊腳本編輯器右上角的對應按鈕：

source: Splitting the shader editor to its own window
de: Aufteilung des Shader-Editors in ein eigenes Fenster
zh_cn: 将着色器编辑器拆分为独立窗口
zh_tw: 將著色器編輯器拆分為獨立視窗

source: To go back to the previous state (with the script/shader editor embedded in the editor window), close the split window using the **×** button in the top-right corner of the window (or in the top-left corner on macOS). Alternatively, you can press :kbd:`Alt + F4` while the split window is focused.
de: Um zum vorherigen Zustand zurückzukehren (so dass der Skript/Shader-Editor in das Editor-Fenster eingebettet ist), schließen Sie das geteilte Fenster mit der Schaltfläche **×** in der oberen rechten Ecke des Fensters (oder in der oberen linken Ecke unter macOS). Alternativ können Sie auch :kbd:`Alt + F4` drücken, während das geteilte Fenster fokussiert ist.
zh_cn: 要重新在编辑器窗口中嵌入 script/shader 编辑器，请关闭分割窗口。
zh_tw: 要返回到之前的狀態（在編輯器視窗中嵌入 script/shader 編輯器），請使用視窗右上角的 **x** 按鈕（或在 macOS 左上角）關閉分割視窗。 或者，你可以在分割視窗被聚焦時時按 :kbd:` Alt + F4`。

source: Customizing editor layouts
de: Benutzerdefinierte Editor-Layouts
zh_cn: 自定义编辑器布局
zh_tw: 自定建置

source: You may want to save and load a dock configuration depending on the kind of task you're working on. For instance, when working on animating a character, it may be more convenient to have docks laid out in a different fashion compared to when you're designing a level.
de: Je nach Art der Aufgabe, an der Sie arbeiten, möchten Sie vielleicht eine Dock-Konfiguration speichern und laden. Wenn Sie z. B. an der Animation eines Charakters arbeiten, kann es sinnvoller sein, die Docks anders anzuordnen, als wenn Sie ein Level entwerfen.
zh_cn: 有时需要根据任务类型保存或加载停靠面板配置，例如，在制作角色动画时更换窗口设置可能更方便。
zh_tw: 你也許想要保存和載入停靠面板配置，具體取決於你正在處理的工作型別。例如，在製作角色動畫時，與設計關卡時相比，以不同的方式佈置停靠面板可能會更方便。

source: For this purpose, Godot provides a way to save and restore editor layouts. Before saving a layout, make changes to the docks you'd like to save. The following changes are persisted to the saved layout:
de: Zu diesem Zweck bietet Godot eine Möglichkeit zum Speichern und Wiederherstellen von Editor-Layouts. Bevor Sie ein Layout speichern, nehmen Sie Änderungen an den Docks vor, die Sie speichern möchten. Die folgenden Änderungen werden in dem gespeicherten Layout beibehalten:
zh_cn: 为此，Godot 提供了一种可以保存或恢复编辑器布局的方法。 在保存布局之前，请更改要保存的停靠面板。 以下更改将保留到已保存的布局中：
zh_tw: 為此，Godot 提供了一種可以保存和恢復編輯器佈局的方法。 在保存佈局之前，請對要保存的停靠面板進行更改。 以下更改將保留到已保存的佈局中：

source: Moving a dock.
de: Ein Dock verschieben.
zh_cn: 移动面板。
zh_tw: 下一頁

source: Resizing a dock.
de: Größe eines Docks ändern.
zh_cn: 调整面板大小。
zh_tw: 調整面板大小。

source: Making a dock floating.
de: Ein Dock schwebend machen.
zh_cn: 浮动面板。
zh_tw: Fork 與 Clone

source: Changing a floating dock's position or size.
de: Ändern der Position oder Größe eines schwebenden Docks.
zh_cn: 修改浮动面板的位置或大小。
zh_tw: 修改浮動面板的位置或大小。

source: FileSystem dock properties: split mode, display mode, sorting order, file list display mode, selected paths and unfolded paths.
de: Dateisystem-Dock-Propertys: Teilungsmodus, Anzeigemodus, Sortierreihenfolge, Anzeigemodus der Dateiliste, ausgewählte Pfade und aufgeklappte Pfade.
zh_cn: 文件系统面板的属性：拆分模式、显示模式、排序、文件列表显示模式、选中路径、展开路径。
zh_tw: 檔案系統面板的屬性：拆分模式、顯示模式、排序、檔列表顯示模式、選中路徑、展開路徑。

source: Splitting the script or shader editor to its own window is *not* persisted as part of a layout.
de: Die Aufteilung des Skript- oder Shader-Editors in ein eigenes Fenster wird *nicht* als Teil eines Layouts beibehalten.
zh_cn: 脚本或着色器面板是否拆分为独立窗口\ *不会*\ 在布局中记录。
zh_tw: 腳本或著色器面板是否拆分為獨立視窗*不會*在佈局中記錄。

source: After making changes, open the **Editor** menu at the top of the editor then choose **Editor Layouts > Save**. Enter a name for the layout, then click **Save**. If you've already saved an editor layout, you can choose to override an existing layout using the list.
de: Nachdem Sie Änderungen vorgenommen haben, öffnen Sie das **Editor**-Menü am oberen Rand des Editors und wählen Sie **Editorlayout > Speichern**. Geben Sie einen Namen für das Layout ein, und klicken Sie dann auf **Speichern**. Wenn Sie bereits ein Editorlayout gespeichert haben, können Sie über die Liste ein vorhandenes Layout überschreiben.
zh_cn: 在完成更改之后，然后选择**编辑器 > 编辑器布局 > 保存布局**。给这个布局起一个名字并点击**保存**，或覆盖已经存在的布局。
zh_tw: 在做完更改之後，在編輯器的頂部打開**編輯器**功能表，然後選擇**編輯器佈局 > 保存佈局**。給這個佈局起一個名字，然後點擊**保存**。如果你已經保存了一個編輯器佈局，你可以選擇使用那個列表去覆蓋一個已經存在的佈局。

source: After making changes, open the **Editor** menu at the top of the editor then choose **Editor Layouts**. In the dropdown list, you will see a list of saved editor layouts, plus **Default** which is a hardcoded editor layout that can't be removed. The default layout matches a fresh Godot installation with no changes made to the docks' position and size, and no floating docks.
de: Nachdem Sie Änderungen vorgenommen haben, öffnen Sie das Menü **Editor** am oberen Rand des Editors und wählen Sie **Editorlayouts**. In der Dropdown-Liste sehen Sie eine Liste der gespeicherten Editorlayouts sowie **Default**, ein fest codiertes Editor-Layout, das nicht entfernt werden kann. Das Default-Layout entspricht einer neuen Godot-Installation, bei der keine Änderungen an der Position und Größe der Docks vorgenommen wurden und die Docks nicht schweben.
zh_cn: 在做完更改之后，在编辑器顶部打开**编辑器**菜单，然后选择**编辑器布局**。在下拉菜单中，你会看到一个已经保存的编辑器布局的列表，和**默认**。默认布局是一个硬编码的编辑器布局，并且不能被移除。默认布局对应的布局是一个刚安装后，没有对面板位置和大小，并且没有悬空面板的 Godot 的布局。
zh_tw: 在做完更改之後，在編輯器頂部打開**編輯器**功能表，然後選擇**編輯器佈局**。在下拉式功能表中，你會看到一個已經保存的編輯器佈局的列表，和**預設**。預設佈局是一個硬編碼的編輯器佈局，並且不能被移除。預設佈局對應的佈局是一個剛安裝後，沒有對面板位置和大小，並且沒有懸空面板的 Godot 的佈局。

source: You can remove a layout using the **Delete** option in the **Editor Layouts** dropdown.
de: Sie können ein Layout mit der Option **Löschen** in der Dropdown-Liste **Editorlayouts** entfernen.
zh_cn: 你可在**编辑器布局**下拉菜单中使用**删除布局**选项来移除一个布局。
zh_tw: 你可在**編輯器佈局**下拉式功能表中使用**刪除佈局**選項來移除一個佈局。

source: If you name the saved layout ``Default`` (case-sensitive), the default editor layout will be overwritten. Note that the ``Default`` does not appear in the list of layouts to overwrite until you overwrite it once, but you can still write its name manually.
de: Wenn Sie das gespeicherte Layout ``Default`` nennen (Groß- und Kleinschreibung wird beachtet), wird das Default-Editor-Layout überschrieben. Beachten Sie, dass ``Default`` erst dann in der Liste der zu überschreibenden Layouts erscheint, wenn Sie es einmal überschreiben, aber Sie können den Namen trotzdem manuell eingeben.
zh_cn: 如果你在保存布局时将布局命名成了``默认``，编辑器的默认布局会被覆盖。需要注意的是``默认``在你覆盖一次之前是不会出现在覆盖布局使用的链表中，但你依然可以手动输入它的名字。
zh_tw: 如果你在保存佈局時將佈局命名成了``預設``，編輯器的預設佈局會被覆蓋。需要注意的是``預設``在你覆蓋一次之前是不會出現在覆蓋佈局使用的鏈表中，但你依然可以手動輸入它的名字。

source: You can go back to the standard default layout by removing the ``Default`` layout after overriding it. (This option does not appear if you haven't overridden the default layout yet.)
de: Sie können zum Default-Layout zurückkehren, indem Sie die Option ``Default`` entfernen, nachdem Sie das Layout überschrieben haben. (Diese Option erscheint nicht, wenn Sie das Default-Layout noch nicht überschrieben haben).
zh_cn: 你可以在覆盖过默认布局之后通过移除``默认``布局来回到标准的默认布局。（在你未覆盖默认布局的时候这个选项将不会出现。）
zh_tw: 你可以在覆蓋過預設佈局之後通過移除``預設``佈局來回到標準的預設佈局。（在你未覆蓋預設佈局的時候這個選項將不會出現。）

source: Editor layouts are saved to a file named ``editor_layouts.cfg`` in the configuration path of the :ref:`doc_data_paths_editor_data_paths`.
de: Editor-Layouts werden in einer Datei namens ``editor_layouts.cfg`` im Konfigurationspfad der :ref:`doc_data_paths_editor_data_paths` gespeichert.
zh_cn: 编辑器布局会保存在一个在配置的路径 :ref:`doc_data_paths_editor_data_paths` 中一个叫 ``editor_layouts.cfg`` 的文件中。
zh_tw: 編輯器佈局會保存在一個在配置的路徑 :ref:`doc_data_paths_editor_data_paths` 中一個叫 ``editor_layouts.cfg`` 的檔案中。

source: Customizing editor settings
de: Benutzerdefinierte Editor-Einstellungen
zh_cn: 自定义编辑器设置
zh_tw: 編輯器設定

source: In the **Editor** menu at the top of the editor, you can find an **Editor Settings** option. This opens a window similar to the Project Settings, but with settings used by the editor. These settings are shared across all projects and are not saved in the project files.
de: Im Menü **Editor** am oberen Rand des Editors finden Sie die Option **Editoreinstellungen**. Damit wird ein Fenster geöffnet, das den Projekteinstellungen ähnelt, aber Einstellungen enthält, die vom Editor verwendet werden. Diese Einstellungen sind für alle Projekte gemeinsam und werden nicht in den Projektdateien gespeichert.
zh_cn: 在编辑器顶部的**编辑器**菜单中，你可以找到一个**编辑器设置**选项。这个选项会打开一个类似于项目设置的菜单，只不过都是编辑器使用的设置。这些设置会在所有的项目中共享，并且不会被保存在项目文件中。
zh_tw: 在編輯器頂部的**編輯器**功能表中，你可以找到一個**編輯器設定**選項。這個選項會打開一個類似於專案設定的功能表，只不過都是編輯器使用的設定。這些設定會在所有的專案中共用，並且不會被保存在專案檔案中。

source: The Editor Settings window
de: Das Fenster Editoreinstellungen
zh_cn: 编辑器设置窗口
zh_tw: 編輯器設定

source: Some commonly changed settings are:
de: Einige häufig geänderte Einstellungen sind:
zh_cn: 通常会修改的设置有：
zh_tw: 通常會修改的設定有：

source: **Interface > Editor > Editor Language:** Controls the language the editor displays in. To make English tutorials easier to follow, you may want to change this to English so that menu names are identical to names referred to by tutorials. The language can also be changed in the top-right corner of the project manager.
de: **Oberfläche > Editor > Editorsprache:** Legt die Sprache des Editors fest. Um englischen Tutorials leichter folgen zu können, sollten Sie die Sprache auf Englisch umstellen, damit die Menünamen mit den Namen in den Tutorials übereinstimmen. Die Sprache kann auch in der oberen rechten Ecke des Projektmanagers geändert werden.
zh_cn: **界面 > 编辑器 > 编辑器语言：**\ 控制编辑器显示的语言。如果要跟着英文教程一步步做，你可能会想要把这个选项改成 English，这样菜单的名称就会和教程中使用的名称一致。项目管理器的右上角也能更改语言。
zh_tw: **介面 > 編輯器 > 編輯器語言：**控制編輯器顯示的語言。如果要跟著英文教學一步步做，你可能會想要把這個選項改成 English，這樣功能表的名稱就會和教學中使用的名稱一致。專案管理器的右上角也能更改語言。

source: **Interface > Editor > Display Scale:** Controls how large UI elements display on screen. The default **Auto** setting finds a suitable value based on your display's DPI and resolution. Due to engine limitations, it only takes the display-provided scaling factor on macOS, not on Windows or Linux.
de: **Oberfläche > Editor > Anzeigeskalierung:** Steuert, wie groß UI-Elemente auf dem Bildschirm angezeigt werden. Die Standardeinstellung **Auto** findet einen geeigneten Wert auf der Grundlage der DPI und Auflösung Ihres Bildschirms. Aufgrund von Beschränkungen der Engine wird der vom Bildschirm bereitgestellte Skalierungsfaktor nur unter macOS übernommen, nicht unter Windows oder Linux.
zh_cn: **界面 > 编辑器 > 显示缩放** 控制 UI 元素显示在屏幕上的大小。默认值 **Auto** 会根据你的显示器的 DPI 和分辨率找到一个合适的值。由于引擎的限制，它只能在 macOS 中获取到显示器提供的缩放比例，而不能在 Windows 或者 Linux 系统中获取。
zh_tw: **介面 > 編輯器 > 顯示縮放** 控制 UI 元素顯示在螢幕上的大小。預設值 **Auto** 會根據你的顯示器的 DPI 和解析度找到一個合適的值。由於引擎的限制，它只能在 macOS 中獲取到顯示器提供的縮放比例，而不能在 Windows 或者 Linux 系統中獲取。

source: **Interface > Editor > Single Window Mode:** If enabled, this forces the editor to use a single window. This disables certain features such as splitting the script/shaders editor to their own window. Single-window mode can be more stable, especially on Linux when using Wayland.
de: **Oberfläche > Editor > Einzelfenster-Modus:** Wenn diese Option aktiviert ist, wird der Editor gezwungen, ein einziges Fenster zu verwenden. Dadurch werden bestimmte Funktionen wie die Aufteilung des Skript-/Shader-Editors in ein eigenes Fenster deaktiviert. Der Einzelfenster-Modus kann stabiler sein, besonders unter Linux, wenn Wayland verwendet wird.
zh_cn: **界面 > 编辑器 > 单窗口模式：** 如果启用，将强制编辑器使用单窗口。这将禁用某些功能，例如将脚本和着色器编辑器分割到各自的窗口。单窗口模式可能更稳定，尤其是在 Linux 下使用 Wayland 时。
zh_tw: **介面 > 編輯器 > 單視窗模式：** 如果啟用，將強制編輯器使用單視窗。這將禁用某些功能，例如將腳本和著色器編輯器分割到各自的視窗。單視窗模式可能更穩定，尤其是在 Linux 下使用 Wayland 時。

source: **Interface > Theme > Preset:** The editor theme preset to use. The **Light** theme preset may be easier to read if you're outdoors or in a room with sunlight. The **Black (OLED)** preset can reduce power consumption on OLED displays, which are increasingly common in laptops and phones/tablets.
de: **Oberfläche > Theme > Vorgabe:** Die zu verwendende Voreinstellung für das Editor-Theme. Die Voreinstellung **Hell** ist möglicherweise besser lesbar, wenn Sie sich im Freien oder in einem Raum mit Sonnenlicht befinden. Die Voreinstellung **Black (OLED)** kann den Stromverbrauch von OLED-Displays reduzieren, die immer häufiger in Laptops und Handys/Tablets verwendet werden.
zh_cn: **界面 > 主题 > 预设：** 编辑器使用的主题预设。如果你在户外或有阳光的房间里， **Light** 主题预设可能更容易阅读。 **Black（OLED）** 预设可以降低 OLED 显示屏的功耗，这种显示屏在笔记本电脑、手机和平板电脑中越来越常见。
zh_tw: **介面 > 主題 > 預設：** 編輯器使用的主題預設。如果您在戶外或有陽光的房間裡，**Light** 主題預設可能更容易閱讀。**Black（OLED）** 預設可以降低 OLED 顯示幕的功耗，這種顯示幕在筆記型電腦、手機和平板電腦中越來越常見。

source: **FileSystem > Directories > Autoscan Project Path:** This can be set to a folder path that will be automatically scanned for projects in the project manager every time it starts.
de: **Dateisystem > Verzeichnisse > Projektpfad automatisch durchsuchen:** Hier kann ein Ordnerpfad angegeben werden, der bei jedem Start des Projektmanagers automatisch nach Projekten durchsucht wird.
zh_cn: **文件系统 > 目录 > 自动扫描项目路径：** 可将其设置为每次启动项目管理器时自动扫描的项目文件夹路径。
zh_tw: **檔案系統 > 目錄 > 自動掃描專案路徑：** 可將其設定為每次啟動專案管理器時自動掃描的專案檔案夾路徑。

source: **FileSystem > Directories > Default Project Path:** Controls the default location where new projects are created in the project manager.
de: **Dateisystem > Verzeichnisse > Default-Projektpfad:** Steuert den Default-Speicherort, an dem neue Projekte im Projektmanager erstellt werden.
zh_cn: **文件系统 > 目录 > 默认项目路径：** 控制在项目管理器中创建新项目的默认路径。
zh_tw: **檔案系統 > 目錄 > 預設專案路徑：** 控制在專案管理器中建立新專案的預設路徑。

source: **Editors > 3D > Emulate Numpad:** This allows using the top row 0-9 keys in the 3D editor as their equivalent numpad keys. It's recommended to enable this option if you don't have a number pad on your keyboard.
de: **Editoren > 3D > Numpad emulieren:** Dies ermöglicht die Verwendung der obersten Tastenreihe 0-9 im 3D-Editor als entsprechende Ziffernblock-Tasten. Es wird empfohlen, diese Option zu aktivieren, wenn Sie keinen Ziffernblock auf Ihrer Tastatur haben.
zh_cn: **编辑器 > 3D > 模拟数字键盘：** 此选项允许键盘上方行排列形式的 0-9 键充当数字小键盘在3 D编辑器中的作用。如果键盘上没有数字小键盘，建议启用此选项。
zh_tw: **編輯器 > 3D > 類比數位鍵盤：** 此選項允許鍵盤上方行排列形式的 0-9 鍵充當數位小鍵盤在3 D編輯器中的作用。如果鍵盤上沒有數位小鍵盤，建議啟用此選項。

source: **Editors > 3D > Emulate 3 Button Mouse:** This allows using the pan, zoom and orbit modifiers in the 3D editor even when not holding down any mouse button. It's recommended to enable this option if you're using a trackpad.
de: **Editoren > 3D > Dreitastenmaus emulieren:** Dies ermöglicht die Verwendung der Pan-, Zoom- und Orbit-Modifikatoren im 3D-Editor, auch wenn Sie keine Maustaste gedrückt halten. Es wird empfohlen, diese Option zu aktivieren, wenn Sie ein Trackpad verwenden.
zh_cn: **编辑器"> 3D > 模拟三键鼠标：** 即使不按住任何鼠标键，也可使用 3D 编辑器中的平移、缩放和轨道修改器。如果使用触控板，建议启用此选项。
zh_tw: **編輯器"> 3D > 類比三鍵滑鼠：** 即使不按住任何滑鼠鍵，也可使用 3D 編輯器中的平移、縮放和軌道修改器。如果使用觸控板，建議啟用此選項。

source: See the :ref:`class_EditorSettings` class reference for a complete description of most editor settings. You can also hover an editor setting's name with the mouse in the Editor Settings to show its description.
de: In der Klassenreferenz :ref:`class_EditorSettings` finden Sie eine vollständige Beschreibung der meisten Editoreinstellungen. Sie können auch mit der Maus über den Namen einer Editor-Einstellung in den Editor-Einstellungen fahren, um ihre Beschreibung anzuzeigen.
zh_cn: 有关大多数编辑器设置的完整说明，请看 :ref:`class_EditorSettings` 类参考。在编辑器设置中将鼠标悬停在编辑器设置名称上，你可以看见其说明。
zh_tw: 有關大多數編輯器設定的完整說明，請看 :ref:`class_EditorSettings` 類參考。在編輯器設定中將滑鼠懸停在編輯器設定名稱上，你可以看見其說明。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
