Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/index.po
Languages: de, zh_cn, zh_tw

source: Editor introduction
de: Einführung in den Editor
zh_cn: 编辑器简介
zh_tw: 編輯器整合

source: In this section, we cover the Godot editor in general, from its interface to using it with the command line.
de: In diesem Abschnitt wird der Godot-Editor allgemein behandelt, von seiner Benutzeroberfläche bis zur Verwendung mit der Kommandozeile.
zh_cn: 在本节中，我们将大体上地介绍 Godot 编辑器，从它的界面到如何通过命令行使用它。
zh_tw: 在本節中，我們將大體上地介紹 Godot 編輯器，從它的介面到如何通過命令行使用它。

source: Editor's interface
de: Benutzeroberfläche des Editors
zh_cn: 编辑器的界面
zh_tw: 編輯器界面 (C++)

source: The following pages explain how to use the various windows, workspaces, and docks that make up the Godot editor. We cover some specific editors' interface in other sections where appropriate. For example, the :ref:`animation editor <doc_introduction_animation>`.
de: Die folgenden Seiten erklären die Benutzung der verschiedenen Fenster, Arbeitsumgebungen und Docks, die den Godot-Editor ausmachen. Einige spezifische Benutzeroberflächen werden in anderen Abschnitten behandelt, wenn es sich anbietet. Zum Beispiel der :ref:`Animations-Editor <doc_introduction_animation>`.
zh_cn: 以下页面介绍了如何使用 Godot 编辑器的各种窗口、工作区和面板。我们也会在其他合适的章节中介绍特定的编辑器界面。例如\ :ref:`动画编辑器 <doc_introduction_animation>`\ 。
zh_tw: 在這一部分中，我們將介紹 Godot 編輯器的大體情況，從介面到如何在命令列中使用。我們也會在合適的時候在其他章節中介紹特定的編輯器介面。例如:ref:`動畫編輯器 <doc_introduction_animation>`。

source: Android editor
zh_cn: Android 编辑器
zh_tw: Android Studio

source: Godot offers a native port of the editor running entirely on Android devices. The Android port can be downloaded from the `Android Downloads page <https://godotengine.org/download/android/>`__. While we strive for feature parity with the Desktop version of the editor, the Android port has a certain amount of caveats you should be aware of.
de: Godot bietet einen komplett nativen Port des Editors für Android-Geräte an. Der Android-Port kann von der `Android Download-Seite <https://godotengine.org/download/android/>`__ heruntergeladen werden. Wir bemühen uns zwar um Featuregleichheit mit der Desktop-Version des Editors, aber der Android-Port hat eine Reihe von Einschränkungen, die Sie beachten sollten.
zh_cn: Godot 提供了一个完全在 Android 设备上运行的编辑器本地端口。Android 端口可以从 `Android 下载页面 <https://godotengine.org/download/android/>`__\ 下载。在我们努力实现与桌面版本的编辑器特性对等的同时，Android 端口仍有一些你应当注意的警告。
zh_tw: Godot 提供了一個完全在 Android 裝置上運作的編輯器本地埠。Android 埠可以從 `Android 下載頁面<https://godotengine.org/download/android/>`__下載。在我們努力實作與桌上出版本的編輯器功能對等的同時，Android 埠仍有一些您應當注意的警告。

source: Web editor
zh_cn: Web 编辑器
zh_tw: 執行編輯器

source: Godot offers an HTML5 version of the editor running entirely in your browser. No download is required to use it, but it has a certain amount of caveats you should be aware of.
de: Godot bietet eine HTML5-Version des Editors, die vollständig in Ihrem Browser läuft. Für die Nutzung ist kein Download erforderlich, aber es gibt eine Reihe von Einschränkungen, die Sie beachten sollten.
zh_cn: Godot 提供了可完全在浏览器中运行的 HTML5 版本的编辑器。 无需下载即可使用，但使用这个编辑器仍有一些你应该注意的警告。
zh_tw: Godot 提供了可完全在瀏覽器中運作的 HTML5 版本的編輯器。 無需下載即可使用，但使用這個編輯器仍有一些你應該注意的警告。

source: Advanced features
de: Erweiterte Features
zh_cn: 高级功能
zh_tw: 進階匯出

source: The articles below focus on advanced features useful for experienced developers, such as calling Godot from the command line and using an external text editor like Visual Studio Code or Emacs.
de: Die folgenden Artikel beschäfigen sich mit erweiterten Features, die für erfahrene Entwickler hilfreich sein können. Zum Beispiel das Ausführen von Godot über die Kommandozeile oder die Benutzung von externen Texteditoren, wie Visual Studio Code oder Emacs.
zh_cn: 下面的文章重点介绍对经验丰富的开发人员有帮助的高级功能，例如从命令行调用 Godot 以及使用 Visual Studio Code 或 Emacs 等外部文本编辑器。
zh_tw: 下面的文章重點介紹對經驗豐富的開發人員有幫助的高級功能，例如從命令列呼叫 Godot 以及使用 Visual Studio Code 或 Emacs 等外部文字編輯器。

source: Managing editor features
de: Editor-Features verwalten
zh_cn: 管理编辑器功能
zh_tw: 功能列表

source: Godot allows you to remove features from the editor. This may be useful if you're an educator trying to ease students into the editor slowly, or if you're working on a project that's only 2D or only 3D and don't want to see what you don't need.
de: Godot erlaubt Ihnen, Features aus dem Editor zu entfernen. Dies kann nützlich sein, wenn Sie als Lehrkraft versuchen, Ihre Schüler langsam an den Editor heranzuführen, oder wenn Sie an einem Projekt arbeiten, das nur 2D oder nur 3D verwendet, und nicht sehen wollen, was Sie nicht brauchen.
zh_cn: Godot 允许你从编辑器中移除功能。 如果你是一名教育工作者，试图让学生一点一点地熟悉编辑器，或者你正在处理只有 2D 或 3D 的项目并且不想看到不需要的功能，移除功能的操作可能会很有用。
zh_tw: Godot 允許你從編輯器中移除功能。 如果你是一名教育工作者，試圖讓學生一點一點地熟悉編輯器，或者你正在處理只有 2D 或 3D 的專案並且不想看到不需要的功能，移除功能的操作可能會很有用。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
