Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/inspector_dock.po
Languages: de, zh_cn, zh_tw

source: The Inspector
de: Der Inspektor
zh_cn: 检查器
zh_tw: 遠端屬性面板。

source: This page explains how the Inspector dock works in-depth. You will learn how to edit properties, fold and unfold areas, use the search bar, and more.
de: Auf dieser Seite wird die Funktionsweise des Inspektor-Docks eingehend erläutert. Sie erfahren, wie Sie Propertys bearbeiten, Bereiche ein- und ausklappen, die Suchleiste verwenden und vieles mehr.
zh_cn: 本页详细介绍了检查器面板的工作原理。 你将学习如何编辑属性、折叠和展开区域、使用搜索栏等等。
zh_tw: 本頁詳細介紹了屬性面板面板的工作原理。 你將學習如何編輯屬性、折疊和展開區域、使用搜索欄等等。

source: This page is a work-in-progress.
de: Diese Seite ist noch in Arbeit.
zh_cn: 本页面仍在制作中。
zh_tw: 本頁面仍在製作中。

source: Overview of the interface
de: Überblick über die Benutzeroberfläche
zh_cn: 界面概述
zh_tw: 界面概覽與常用詞彙

source: Let's start by looking at the dock's main parts.
de: Schauen wir uns zunächst die Hauptbestandteile des Docks an.
zh_cn: 让我们先来看看停靠面板的主要部件。
zh_tw: 讓我們先來看看停靠面板的主要元件。

source: At the top are the file and navigation buttons.
de: Oben befinden sich die Datei- und Navigationsschaltflächen.
zh_cn: 顶部是文件和导航按钮。
zh_tw: 頂部是檔和導覽按鈕。

source: Below it, you can find the selected node's name, its type, and the tools menu on the right side.
de: Darunter finden Sie den Namen des ausgewählten Nodes, seinen Typ und das Tool-Menü auf der rechten Seite.
zh_cn: 在它的下方，你可以找到所选节点的名称、类型及其右侧的工具菜单。
zh_tw: 在它的下方，你可以找到所選節點的名稱、型別及其右側的工具功能表。

source: If you click the tool menu icon, a drop-down menu offers some view and edit options.
de: Wenn Sie auf das Icon für das Tool-Menü klicken, bietet ein Dropdown-Menü einige Anzeige- und Bearbeitungsoptionen.
zh_cn: 如果你点击工具菜单图标，会显示一个下拉菜单，该菜单可以提供一些视图和编辑选项。
zh_tw: 如果你點擊工具功能表圖示，會顯示一個下拉式功能表，該功能表可以提供一些視圖和編輯選項。

source: Then comes the search bar. Type anything in it to filter displayed properties. Delete the text to clear the search.
de: Dann kommt die Suchleiste. Geben Sie hier etwas ein, um die angezeigten Propertys zu filtern. Löschen Sie den Text, um die Suche zurückzusetzen.
zh_cn: 接下来是搜索栏。输入的内容可以用来过滤显示的属性。删除文本就会清空搜索。
zh_tw: 接下來是搜索欄。輸入的內容可以用來篩選顯示的屬性。刪除文字就會清空搜索。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
