Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/managing_editor_features.po
Languages: de, zh_tw

source: Managing editor features
de: Editor-Features verwalten
zh_tw: 功能列表

source: Introduction
de: Einführung
zh_tw: 前言

source: In certain situations, it may be desirable to limit what features can be used in the Godot editor. For example, a UI designer on a team who doesn't need to see 3D features, or an educator slowly introducing features to students. Godot has a built in system called "feature profiles" to do this.
de: In bestimmten Situationen kann es wünschenswert sein, die Verwendung von Features im Godot-Editor einzuschränken. Zum Beispiel ein UI-Designer in einem Team, der keine 3D-Features sehen muss, oder eine Lehrkraft, der Schüler langsam an Features heranführt. Godot verfügt über ein eingebautes System namens "Feature-Profile", um dies zu ermöglichen.
zh_tw: 某些情況下，我們可能會想要限制 Godot 編輯器所能使用的功能。例如，團隊中的 UI 設計師無需見到 3D 功能，而老師會想要逐步向學生介紹功能。Godot 內建的“功能配置”系統可以實作這樣的需求。

source: With feature profiles, major features and nodes can be hidden from the editor. This only hides parts of the interface and does not actually remove support for these features, so scenes and scripts relying on those features will still work fine. This also means feature profiles are not an optimization technique. For information on how to optimize Godot see :ref:`doc_performance`.
de: Mit Feature-Profilen können wichtige Features und Nodes aus dem Editor ausgeblendet werden. Dadurch werden nur Teile der Benutzeroberfläche ausgeblendet, die Unterstützung für diese Features wird jedoch nicht entfernt, so dass Szenen und Skripte, die auf diese Features angewiesen sind, weiterhin problemlos funktionieren. Das bedeutet auch, dass Feature-Profile keine Optimierungsmethode sind. Für Informationen über die Optimierung von Godot siehe :ref:`doc_performance`.
zh_tw: 使用功能配置，主要的功能和節點都可以在編輯器中隱藏。只會隱藏部分介面，不會真正移除對這些功能的支援，所以依賴於那些功能的場景和腳本仍然可以正常工作。這同時也意味著，功能配置並不是一種優化技巧。要瞭解如何對 Godot 進行優化，請參閱 :ref:`doc_optimization`。

source: Creating a profile
de: Ein Profil erstellen
zh_tw: 建立內容

source: To manage editor features go to **Editor > Manage Editor Features**. This will open the **Manage Editor Feature Profiles** window. By default there will be no profile. Click on **Create Profile** and give it a name. You will then see a list of all the features in the Godot editor.
de: Um Editor-Funktionen zu verwalten, gehen Sie zu **Editor > Editor-Features verwalten**. Daraufhin wird das Fenster **Editor-Feature-Profile verwalten** geöffnet. Standardmäßig ist noch kein Profil vorhanden. Klicken Sie auf **Profil erstellen** und geben Sie ihm einen Namen. Sie sehen dann eine Liste aller Features im Godot-Editor.
zh_tw: 要管理編輯器功能，請前往**編輯器 > 管理編輯器功能**。這樣就打開了**管理編輯器功能配置**視窗。預設是沒有配置的。請點擊**建立配置文件**並為其命名。然後你就會看到 Godot 編輯器中所有功能的列表了。

source: The first section allows major editor features to be removed, such as the 3D editor or scripting editor. Below the main features is every class and node in Godot, which can be disabled as well. Click on a node and all of its properties and options will be listed in the **Extra Items** box, these can all be individually disabled.
de: Im ersten Abschnitt können wichtige Editor-Funktionen, wie der 3D-Editor oder der Skript-Editor, entfernt werden. Unterhalb der Hauptfunktionen befinden sich alle Klassen und Nodes in Godot, die ebenfalls deaktiviert werden können. Wenn Sie auf einen Node klicken, werden alle seine Propertys und Optionen im Feld **Zusatzoptionen** aufgelistet, die alle einzeln deaktiviert werden können.
zh_tw: 第一個部分可以移除主要的編輯器功能，比如 3D 編輯器或腳本編輯器。主要功能的下方是 Godot 中的所有類，也可以禁用。點擊節點後，會在**額外專案**中列出其屬性和選項，可以單獨禁用。

source: Sharing a profile
de: Ein Profil teilen
zh_tw: 使用檔案

source: To share profiles between editors click on the **Export** button. Save the custom profile somewhere as a ``.profile`` file. To use this in another editor open that editor's **Manage Editor Feature Profiles** window and click import, then select the ``.profile`` file.
de: Um Profile zwischen Editoren auszutauschen, klicken Sie auf den **Exportieren**-Button. Speichern Sie das benutzerdefinierte Profil irgendwo als eine ``.profile`` Datei. Um es in einem anderen Editor zu verwenden, öffnen Sie das Fenster **Editor-Features verwalten** dieses Editors und klicken Sie auf importieren, dann wählen Sie die Datei ``.profile``.
zh_tw: 要在編輯器之間分享配置，請點擊**匯出**按鈕。請將自訂配置保存為 ``.profile`` 檔案。要在其他編輯器中使用，請打開其**管理編輯器配置**視窗並點擊匯入，然後選擇該 ``.profile`` 檔案。

source: This process is potentially cumbersome however if a large amount of computers need custom profiles. As an alternative, you can enable self-contained mode for Godot, which allows putting all editor configuration in the same folder as the editor binary. See :ref:`doc_data_paths_self_contained_mode` for details.
de: Dieser Prozess ist jedoch potenziell mühsam, wenn eine große Anzahl von Computern benutzerdefinierte Profile benötigt. Als Alternative können Sie den "self-contained mode" für Godot aktivieren, der es erlaubt, die gesamte Editor-Konfiguration in denselben Ordner zu legen wie die Editor-Binärdatei. Siehe :ref:`doc_data_paths_self_contained_mode` für Details.
zh_tw: 如果大量電腦都需要自訂配置，這個過程可能會比較繁瑣。另一種辦法是啟用 Godot 的自包含模式，可以將所有編輯器配置放在與編輯器二進位檔案同一資料夾中。詳情請參閱 :ref:`doc_data_paths_self_contained_mode`。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
