Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/using_the_android_editor.po
Languages: de

source: Using the Android editor
de: Verwendung des Android-Editors

source: In 2023, `we added <https://godotengine.org/article/android_godot_editor_play_store_beta_release/>`__ a `Android port of the editor <https://godotengine.org/download/android/>`__ that can be used to work on new or existing projects on Android devices.
de: Im Jahr 2023 `haben wir <https://godotengine.org/article/android_godot_editor_play_store_beta_release/>`__ eine `Android-Portierung des Editors <https://godotengine.org/download/android/>`__ hinzugefügt, die für die Arbeit an neuen oder bestehenden Projekten auf Android-Geräten verwendet werden kann.

source: The Android editor is in beta testing stage, while we continue to refine the experience, and bring it up to parity with the Desktop version of the editor. See :ref:`doc_using_the_android_editor_limitations` below.
de: Der Android-Editor befindet sich in der Beta-Phase, während wir weiter daran arbeiten, ihn zu verfeinern und an die Desktop-Version des Editors anzugleichen. Siehe :ref:`doc_using_the_android_editor_limitations` unten.

source: Android devices support
de: Unterstützung von Android-Geräten

source: The Android editor requires devices running Android 5 Lollipop or higher, with at least OpenGL 3 support. This includes (not exhaustive):
de: Der Android-Editor erfordert Geräte mit Android 5 Lollipop oder höher, die mindestens OpenGL 3 unterstützen. Dies beinhaltet folgende Geräte (eine Auswahl):

source: Android tablets, foldables and large phones
de: Android-Tablets, faltbare Geräte und große Smartphones

source: Android-powered netbooks
de: Netbooks mit Android-Betriebssystem

source: Chromebooks supporting Android apps
de: Chromebooks mit Unterstützung für Android-Anwendungen

source: Required Permissions
de: Erforderliche Berechtigungen

source: The Android editor requires the `All files access permission <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__. The permission allows the editor to create / import / read project files from any file locations on the device. Without the permission, the editor is still functional, but has limited access to the device's files and directories.
de: Der Android-Editor benötigt die `Zugriffsberechtigung für alle Dateien <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__ . Mit dieser Berechtigung kann der Editor Projektdateien von beliebigen Dateispeicherorten auf dem Gerät erstellen / importieren / lesen. Ohne diese Berechtigung ist der Editor immer noch funktionsfähig, hat aber nur begrenzten Zugriff auf die Dateien und Verzeichnisse des Geräts.

source: Limitations & known issues
de: Beschränkungen und bekannte Probleme

source: Here are the known limitations and issues of the Android editor:
de: Hier sind die bekannten Einschränkungen und Probleme des Android-Editors:

source: No C#/Mono support
de: Keine C#/Mono Unterstützung

source: No support for external script editors
de: Keine Unterstützung für externe Skript-Editoren

source: While available, the *Vulkan Forward+* renderer is not recommended due to severe performance issues
de: Der Renderer *Vulkan Forward+* ist zwar verfügbar, wird aber aufgrund von Leistungsproblemen nicht empfohlen

source: No support for building and exporting an Android APK binary. As a workaround, you can generate and export a `Godot PCK or ZIP file <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`__
de: Keine Unterstützung für das Erstellen und Exportieren einer Android APK-Binärdatei. Als Abhilfe können Sie eine `Godot PCK- oder ZIP-Datei <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`__ erzeugen und exportieren

source: No support for building and exporting binaries for other platforms
de: Keine Unterstützung für die Erstellung und den Export von Binärdateien für andere Plattformen

source: Performance and stability issues when using the *Vulkan Mobile* renderer for a project
de: Leistungs- und Stabilitätsprobleme bei der Verwendung des *Vulkan Mobile*-Renderers für ein Projekt

source: UX not optimized for Android phones form-factor
de: UX nicht für den Formfaktor von Android-Smartphones optimiert

source: `Android Go devices <https://developer.android.com/guide/topics/androidgo>`__ lacks the *All files access* permission required for device read/write access. As a workaround, when using a Android Go device, it's recommended to create new projects only in the Android *Documents* or *Downloads* directories.
de: `Android Go-Geräten <https://developer.android.com/guide/topics/androidgo>`__ fehlt die Berechtigung *All files access*, die für den Lese-/Schreibzugriff auf das Gerät erforderlich ist. Als Abhilfe wird bei der Verwendung eines Android Go-Geräts empfohlen, neue Projekte nur in den Android-Verzeichnissen *Documents* oder *Downloads* zu erstellen.

source: The editor doesn't properly resume when *Don't keep activities* is enabled in the *Developer Options*
de: Der Editor wird nicht richtig fortgesetzt, wenn *Don't keep activities* in den *Developer Options* aktiviert ist

source: See the `list of open issues on GitHub related to the Android editor <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Aandroid+label%3Atopic%3Aeditor>`__ for a list of known bugs.
de: Siehe die `Liste der offenen Issues auf GitHub im Zusammenhang mit dem Android-Editor <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Aandroid+label%3Atopic%3Aeditor>`__ für eine Liste der bekannten Fehler.

source: Translation status
de: Übersetzungsstatus
