Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/web/html5_shell_classref.po
Languages: de, zh_tw

source: HTML5 shell class reference
de: HTML5 Shell-Klassenreferenz
zh_tw: HTML5 shell 類參考

source: Projects exported for the Web expose the :js:class:`Engine` class to the JavaScript environment, that allows fine control over the engine's start-up process.
de: Projekte, die für das Web exportiert werden, stellen der JavaScript-Umgebung die Klasse :js:class:`Engine` zur Verfügung, die eine genaue Kontrolle über den Startvorgang der Engine ermöglicht.
zh_tw: 為 Web 匯出的專案向 JavaScript 環境暴露了 :js:class:`Engine` 類，從而可以更好地控制引擎的啟動過程。

source: This API is built in an asynchronous manner and requires basic understanding of `Promises <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Using_promises>`__.
de: Diese API ist asynchron aufgebaut und erfordert ein grundlegendes Verständnis von `Promises <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Using_promises>`__.
zh_tw: 這個API是以非同步的方式建立的, 需要對 `Promises <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Using_promises>`__ 的基本理解.

source: Engine
de: Die Engine
zh_tw: 關於 Godot Engine

source: The ``Engine`` class provides methods for loading and starting exported projects on the Web. For default export settings, this is already part of the exported HTML page. To understand practical use of the ``Engine`` class, see :ref:`Custom HTML page for Web export <doc_customizing_html5_shell>`.
de: Die Klasse ``Engine`` bietet Methoden zum Laden und Starten exportierter Projekte im Web. Bei den Default-Export-Einstellungen ist dies bereits Teil der exportierten HTML-Seite. Um die praktische Verwendung der Klasse ``Engine`` zu verstehen, siehe :ref:`Benutzerdefinierte HTML-Seite für Web-Export <doc_customizing_html5_shell>`.
zh_tw: ``Engine`` 類提供了在Web上載入和啟動匯出專案的方法. 對於預設的匯出設定, 這已經是匯出的HTML頁面的一部分. 要瞭解 ``Engine`` 類的實際使用, 請參見 :ref:`自訂Web匯出的HTML 頁面 <doc_customizing_html5_shell>` .

source: Static Methods
de: Statische Methoden
zh_tw: 靜態方法

source: Instance Methods
de: Instanzmethoden
zh_tw: 實例方法

source: Create a new Engine instance with the given configuration.
de: Erzeugt eine neue Engine-Instanz mit der angegebenen Konfiguration.
zh_tw: 用給定的配置建立一個新的引擎實例.

source: Arguments
de: Argumente
zh_tw: 參數

source: The initial config for this instance.
de: Die initiale Konfiguration für diese Instanz.
zh_tw: 此實例的初始配置.

source: **Static Methods**
de: **Statische Methoden**
zh_tw: 靜態形體。

source: Load the engine from the specified base path.
de: Lädt die Engine aus dem angegebenen Basispfad.
zh_tw: 從指定的基本路徑載入引擎.

source: Base path of the engine to load.
de: Basispfad der zu ladenden Engine.
zh_tw: 引擎載入的底層路徑.

source: Returns
de: Rückgabe
zh_tw: 返回

source: A Promise that resolves once the engine is loaded.
de: Ein Promise, das sich einlöst, sobald die Engine geladen ist.
zh_tw: 一個一旦載入引擎就會解析的Promise.

source: Return type
de: Rückgabetyp
zh_tw: Return 回傳

source: Unload the engine to free memory.
de: Entlädt die Engine, um Speicher freizugeben.
zh_tw: 解除安裝引擎以釋放記憶體.

source: This method will be called automatically depending on the configuration. See :js:attr:`unloadAfterInit`.
de: Diese Methode wird je nach Konfiguration automatisch aufgerufen. Siehe :js:attr:`unloadAfterInit`.
zh_tw: 接著會自動使用樣板建置，不需要進一步設定。

source: Check whether WebGL is available. Optionally, specify a particular version of WebGL to check for.
de: Prüfen Sie, ob WebGL verfügbar ist. Geben Sie optional eine bestimmte Version von WebGL an, auf die geprüft werden soll.
zh_tw: 檢查 WebGL 是否可用.(可選)指定要檢查的特定 WebGL 版本.

source: The major WebGL version to check for.
de: Die Haupt-WebGL-Version, auf die geprüft werden soll.
zh_tw: 要檢查的主要WebGL版本.

source: If the given major version of WebGL is available.
de: Wenn die angegebene Hauptversion von WebGL verfügbar ist.
zh_tw: 如果給定的WebGL的主要版本是可用的.

source: **Instance Methods**
de: **Instanzmethoden**
zh_tw: **使用泛型方法**

source: Initialize the engine instance. Optionally, pass the base path to the engine to load it, if it hasn't been loaded yet. See :js:meth:`Engine.load`.
de: Initialisierung der Engine-Instanz. Optional kann der Basispfad zur Engine übergeben werden, um sie zu laden, falls sie noch nicht geladen wurde. Siehe :js:meth:`Engine.load`.
zh_tw: 初始化引擎實例. 如果引擎還沒有被載入, 可以選擇將基本路徑傳遞給引擎來載入它. 參見 :js:meth:`Engine.load` .

source: A ``Promise`` that resolves once the engine is loaded and initialized.
de: Ein ``Promise``, das sich einlöst, sobald die Engine geladen und initialisiert ist.
zh_tw: 一旦引擎被載入和初始化, 一個 ``Promise`` 就會被解析.

source: Load a file so it is available in the instance's file system once it runs. Must be called **before** starting the instance.
de: Lädt eine Datei, damit sie im Dateisystem der Instanz verfügbar ist, sobald diese läuft. Muss **vor** dem Start der Instanz aufgerufen werden.
zh_tw: 載入一個檔, 這樣一旦運作, 它就可以在實例的檔案系統中使用. 必須在啟動實例 **之前** 呼叫.

source: If not provided, the ``path`` is derived from the URL of the loaded file.
de: Wenn nicht angegeben, wird der ``Pfad`` von der URL der geladenen Datei abgeleitet.
zh_tw: 如果沒有提供, ``path`` 是從載入檔的URL中匯出的.

source: The file to preload. If a ``string`` the file will be loaded from that path. If an ``ArrayBuffer`` or a view on one, the buffer will used as the content of the file.
de: Die Datei, die vorgeladen werden soll. Wenn es ein ``String`` ist, wird die Datei von diesem Pfad geladen. Wenn es ein ``ArrayBuffer`` oder ein View auf einen solchen ist, wird der Buffer als Inhalt der Datei verwendet.
zh_tw: 要預裝的檔, 如果是一個 ``string`` , 檔將從該路徑載入. 如果是一個 ``ArrayBuffer`` 或一個視圖, 該緩衝區將被用作檔的內容.

source: The file to preload.
de: Die Datei, die vorgeladen werden soll.
zh_tw: 最終結果

source: If a ``string`` the file will be loaded from that path.
de: Wenn es ein ``String`` ist, dann wird die Datei aus diesem Pfad geladen.
zh_tw: 如果是 ``string`` , 檔將從該路徑載入.

source: If an ``ArrayBuffer`` or a view on one, the buffer will used as the content of the file.
de: Wenn es ein ``ArrayBuffer`` oder ein View auf einen solchen ist, wird der Buffer als Inhalt der Datei verwendet.
zh_tw: 如果是一個 ``ArrayBuffer`` 或一個視圖, 該緩衝區將被用作檔的內容.

source: Path by which the file will be accessible. Required, if ``file`` is not a string.
de: Pfad, unter dem die Datei zugänglich sein wird. Erforderlich, wenn ``file`` kein String ist.
zh_tw: 用於存取檔的路徑. 如果 ``file`` 不是一個字串, 則為必需的.

source: A Promise that resolves once the file is loaded.
de: Ein Promise, das aufgelöst wird, sobald die Datei geladen ist.
zh_tw: 一個一旦檔被載入就會解析的Promise.

source: Start the engine instance using the given override configuration (if any). :js:meth:`startGame <Engine.prototype.startGame>` can be used in typical cases instead.
de: Startet die Engine-Instanz unter Verwendung der angegebenen Override-Konfiguration (falls vorhanden). :js:meth:`startGame <Engine.prototype.startGame>` kann in typischen Fällen stattdessen verwendet werden.
zh_tw: 使用給定的覆蓋配置(如果有的話)啟動引擎實例. :js:meth:`startGame <Engine.prototype.startGame>` 可以在典型情況下代替使用.

source: This will initialize the instance if it is not initialized. For manual initialization, see :js:meth:`init <Engine.prototype.init>`. The engine must be loaded beforehand.
de: Dadurch wird die Instanz initialisiert, wenn sie nicht bereits initialisiert ist. Für die manuelle Initialisierung siehe :js:meth:`init <Engine.prototype.init>`. Die Engine muss vorher geladen werden.
zh_tw: 如果實例沒有被初始化, 它將初始化它. 對於手動初始化, 請參閱 :js:meth:`init <Engine.prototype.init>` . 引擎必須事先載入.

source: Fails if a canvas cannot be found on the page, or not specified in the configuration.
de: Schlägt fehl, wenn ein Canvas auf der Seite nicht gefunden werden kann oder nicht in der Konfiguration angegeben ist.
zh_tw: 如果在頁面上找不到畫布, 或者沒有在配置中指定, 則失敗.

source: An optional configuration override.
de: Eine optionale Konfigurations-Override.
zh_tw: 一個可選的配置重寫.

source: Promise that resolves once the engine started.
de: Ein Promise, das nach dem Starten der Engine aufgelöst wird.
zh_tw: 引擎啟動後解析的Promise.

source: Start the game instance using the given configuration override (if any).
de: Startet die Spielinstanz mit dem angegebenen Konfigurations-Override (falls vorhanden).
zh_tw: 使用給定的配置覆蓋(如果有的話)啟動遊戲實例.

source: This will initialize the instance if it is not initialized. For manual initialization, see :js:meth:`init <Engine.prototype.init>`.
de: Dadurch wird die Instanz initialisiert, wenn sie nicht initialisiert ist. Für die manuelle Initialisierung, siehe :js:meth:`init <Engine.prototype.init>`.
zh_tw: 如果實例沒有被初始化, 將初始化它. 對於手動初始化, 見 :js:meth:`init <Engine.prototype.init>` .

source: This will load the engine if it is not loaded, and preload the main pck.
de: Dadurch wird die Engine geladen, falls sie noch nicht geladen ist, und das Hauptpaket wird vorgeladen.
zh_tw: 如果未載入引擎, 則將載入引擎, 並預載入主pck.

source: This method expects the initial config (or the override) to have both the :js:attr:`executable` and :js:attr:`mainPack` properties set (normally done by the editor during export).
de: Diese Methode erwartet, dass die initiale Konfiguration (oder das Override) sowohl die :js:attr:`executable` als auch die :js:attr:`mainPack`-Property gesetzt hat (normalerweise geschieht dies durch den Editor während des Exports).
zh_tw: 該方法將初始配置(或重寫)時同時設定 :js:attr:`executable` 和 :js:attr:`mainPack` 屬性(通常由編輯器在匯出過程中完成).

source: Promise that resolves once the game started.
de: Ein Promise, das sich auflöst, sobald das Spiel begonnen hat.
zh_tw: 一旦遊戲開始就會解析Promise.

source: Create a file at the specified ``path`` with the passed as ``buffer`` in the instance's file system.
de: Erzeugt eine Datei im angegebenen ``path`` mit dem als ``buffer`` übergebenen Inhalt im Dateisystem der Instanz.
zh_tw: 在指定的 ``path`` 上建立一個檔, 在實例的檔案系統中將通過該檔建立為 ``buffer`` .

source: The location where the file will be created.
de: Der Ort, an dem die Datei erstellt werden soll.
zh_tw: 將建立檔的位置.

source: The content of the file.
de: Der Inhalt der Datei.
zh_tw: 檔案的絕對路徑

source: Request that the current instance quit.
de: Anforderung, dass die aktuelle Instanz beendet wird.
zh_tw: 參照目前的類別實體。

source: This is akin the user pressing the close button in the window manager, and will have no effect if the engine has crashed, or is stuck in a loop.
de: Dies ist vergleichbar mit dem Drücken des "Schließen"-Buttons im Fenstermanager und hat keine Auswirkungen, wenn die Engine abgestürzt ist oder in einer Schleife feststeckt.
zh_tw: 這就類似使用者在視窗管理器中按下關閉按鈕, 如果引擎已經當機, 或者卡在迴圈中, 就不會有任何效果.

source: Engine configuration
de: Engine-Konfiguration
zh_tw: 程式碼樣式設定

source: An object used to configure the Engine instance based on godot export options, and to override those in custom HTML templates if needed.
de: Ein Objekt, das dazu dient, die Engine-Instanz auf der Grundlage der Godot-Exportoptionen zu konfigurieren und diese bei Bedarf in benutzerdefinierten HTML-Vorlagen außer Kraft zu setzen.
zh_tw: 用於根據 Godot 匯出選項配置引擎實例的物件, 如果需要, 可重寫自訂 HTML 範本中的物件.

source: Properties
de: Propertys
zh_tw: 屬性

source: name
zh_tw: 名稱

source: string
zh_tw: 字串

source: number
de: Zahl
zh_tw: 數字

source: Array.<string>
zh_tw: 字串

source: function
de: Funktion
zh_tw: 函式

source: The Engine configuration object. This is just a typedef, create it like a regular object, e.g.:
de: Das Konfigurationsobjekt der Engine. Dies ist nur ein Typedef, erstellen Sie es wie ein normales Objekt, z.B.:
zh_tw: 引擎配置物件. 這只是一個型別, 像建立一個普通物件一樣建立它, 例如:

source: **Property Descriptions**
de: **Property-Beschreibungen**
zh_tw: **描述**

source: Whether the unload the engine automatically after the instance is initialized.
de: Ob die Engine automatisch entladen werden soll, nachdem die Instanz initialisiert wurde.
zh_tw: 在實例被初始化後, 是否自動解除安裝引擎.

source: value
de: Wert
zh_tw: 值

source: The HTML DOM Canvas object to use.
de: Das zu verwendende HTML DOM Canvas-Objekt.
zh_tw: 要使用的 HTML DOM Canvas 物件。

source: By default, the first canvas element in the document will be used is none is specified.
de: Standardmäßig wird das erste Canvas-Element im Dokument verwendet, wenn keines angegeben ist.
zh_tw: 預設情況下, 如果沒有指定任何元素, 將使用文件中的第一個畫布元素.

source: The name of the WASM file without the extension. (Set by Godot Editor export process).
de: Der Name der WASM-Datei ohne Erweiterung. (Wird durch den Exportvorgang des Godot-Editors festgelegt).
zh_tw: WASM 檔的名稱，不含副檔名。（由 Godot 編輯器的匯出過程設定）。

source: An alternative name for the game pck to load. The executable name is used otherwise.
de: Ein alternativer Name für das zu ladende Spiel-pck. Ansonsten wird der Name der ausführbaren Datei verwendet.
zh_tw: 要載入的遊戲pck的更換名稱. 否則使用可執行檔名.

source: Specify a language code to select the proper localization for the game.
de: Geben Sie einen Sprachcode an, um die richtige Lokalisierung für das Spiel auszuwählen.
zh_tw: 指定語言程式碼，為遊戲選擇合適的當地語系化。

source: The browser locale will be used if none is specified. See complete list of :ref:`supported locales <doc_locales>`.
de: Die Browser-Sprachumgebung wird verwendet, wenn keine angegeben ist. Siehe vollständige Liste der :ref:`unterstützten Gebietsschemata <doc_locales>`.
zh_tw: 如果沒有指定，將使用瀏覽器的區域設定。請參閱完整的:ref:`支援的區域設定 <doc_locales>`列表。

source: The canvas resize policy determines how the canvas should be resized by Godot.
de: Die Richtlinie zur Größenänderung des Canvas legt fest, wie die Größe des Canvas durch Godot geändert werden soll.
zh_tw: 畫布大小調整策略決定 Godot 應當如何調整畫布的大小。

source: ``0`` means Godot won't do any resizing. This is useful if you want to control the canvas size from javascript code in your template.
de: ``0`` bedeutet, dass Godot keine Größenänderung vornimmt. Dies ist nützlich, wenn Sie die Größe des Canvas über Javascript-Code in Ihrer Vorlage steuern möchten.
zh_tw: ``0`` 意味著 Godot 不做任何大小調整。如果您想通過範本中的 javascript 程式碼來控制畫布的大小，這將很有用。

source: ``1`` means Godot will resize the canvas on start, and when changing window size via engine functions.
de: ``1`` bedeutet, dass Godot die Größe des Canvas beim Start und beim Ändern der Fenstergröße über Engine-Funktionen ändert.
zh_tw: ``1`` 意味著 Godot 在啟動時，以及通過引擎功能改變視窗大小時，會調整畫布的大小。

source: ``2`` means Godot will adapt the canvas size to match the whole browser window.
de: ``2`` bedeutet, dass Godot die Größe des Canvas an die Größe des gesamten Browserfensters anpasst.
zh_tw: ``2`` 意味著 Godot 將調整畫布的大小以配對整個瀏覽器視窗。

source: The arguments to be passed as command line arguments on startup.
de: Die Argumente, die beim Starten als Befehlszeilenargumente übergeben werden.
zh_tw: 解析自定命令行參數。

source: See :ref:`command line tutorial <doc_command_line_tutorial>`.
de: Siehe :ref:`Kommandzeilen-Tutorial <doc_command_line_tutorial>`.
zh_tw: 更多有關命令行參數的資訊，請參考 :ref:`命令行教學 <doc_command_line_tutorial>` 。

source: **Note**: :js:meth:`startGame <Engine.prototype.startGame>` will always add the ``--main-pack`` argument.
de: **Hinweis**: :js:meth:`startGame <Engine.prototype.startGame>` fügt immer das ``--main-pack``-Argument hinzu.
zh_tw: **注意**：:js:meth:`startGame <Engine.prototype.startGame>` 將始終新增 ``--main-pack`` 參數。

source: A callback function for handling Godot's ``OS.execute`` calls.
de: Eine Callback-Funktion für die Behandlung von Godots ``OS.execute``-Aufrufen.
zh_tw: 用於處理 Godot 的 ``OS.execute`` 呼叫的回呼函式。

source: This is for example used in the Web Editor template to switch between Project Manager and editor, and for running the game.
de: Dies wird zum Beispiel in der Web-Editor-Vorlage verwendet, um zwischen Projektmanager und Editor zu wechseln und um das Spiel zu starten.
zh_tw: 例如在Web Editor範本中使用, 用於在專案管理器和編輯器之間切換, 以及運作遊戲.

source: The path that Godot's wants executed.
de: Der Pfad, den Godot ausführen möchte.
zh_tw: Godot想要執行的路徑.

source: The arguments of the "command" to execute.
de: Die Argumente des auszuführenden "Befehls".
zh_tw: 要執行的 "command" 的參數.

source: A callback function for being notified when the Godot instance quits.
de: Eine Callback-Funktion, um benachrichtigt zu werden, wenn die Godot-Instanz beendet wird.
zh_tw: 當Godot實例退出時, 用於通知的回呼函式.

source: **Note**: This function will not be called if the engine crashes or become unresponsive.
de: **Hinweis**: Diese Funktion wird nicht aufgerufen, wenn die Engine abstürzt oder nicht mehr reagiert.
zh_tw: **注意**：如果引擎當機或無回應，該函式不會被呼叫。

source: The status code returned by Godot on exit.
de: Der von Godot beim Beenden zurückgegebene Statuscode.
zh_tw: Godot 退出時返回的狀態碼。

source: A callback function for displaying download progress.
de: Eine Callback-Funktion zur Anzeige des Download-Fortschritts.
zh_tw: 回呼函式，用於顯示下載進度。

source: The function is called once per frame while downloading files, so the usage of ``requestAnimationFrame()`` is not necessary.
de: Die Funktion wird einmal pro Frame beim Herunterladen von Dateien aufgerufen, so dass die Verwendung von ``requestAnimationFrame()`` nicht notwendig ist.
zh_tw: 該函式在下載檔案時每影格被呼叫一次, 所以沒有必要使用 ``requestAnimationFrame()`` .

source: If the callback function receives a total amount of bytes as 0, this means that it is impossible to calculate. Possible reasons include:
de: Wenn die Callback-Funktion eine Gesamtanzahl von Bytes als 0 erhält, bedeutet dies, dass sie nicht berechnet werden kann. Mögliche Gründe sind:
zh_tw: 如果回呼函式接收到的位元組總數為0, 這意味著無法計算. 可能的原因包括:

source: Files are delivered with server-side chunked compression
de: Dateien werden mit serverseitiger Blockkomprimierung geliefert
zh_tw: 檔隨伺服器端分塊壓縮一起提供

source: Files are delivered with server-side compression on Chromium
de: Dateien werden mit serverseitiger Komprimierung auf Chromium geliefert
zh_tw: 檔在Chromium上通過伺服器端壓縮提供

source: Not all file downloads have started yet (usually on servers without multi-threading)
de: Es wurden noch nicht alle Dateidownloads gestartet (normalerweise auf Servern ohne Multithreading)
zh_tw: 並非所有檔下載都已開始(通常在沒有多執行緒的伺服器上)

source: The current amount of downloaded bytes so far.
de: Die aktuelle Anzahl der bisher heruntergeladenen Bytes.
zh_tw: 到目前為止, 已下載的位元組數.

source: The total amount of bytes to be downloaded.
de: Die Gesamtmenge der herunterzuladenden Bytes.
zh_tw: 要下載的總位元組數.

source: A callback function for handling the standard output stream. This method should usually only be used in debug pages.
de: Eine Callback-Funktion für die Behandlung des Default-Ausgabestroms. Diese Methode sollte normalerweise nur in Debug-Seiten verwendet werden.
zh_tw: 用於處理標準輸出流的回呼函式. 這個方法通常應該只在除錯頁面使用.

source: By default, ``console.log()`` is used.
de: Standardmäßig wird ``console.log()`` verwendet.
zh_tw: 預設情況下，使用的是 ``console.log()``。

source: A variadic number of arguments to be printed.
de: Eine variadische Menge von Argumenten, die ausgegeben werden sollen.
zh_tw: 將要輸出的可變數量的參數.

source: A callback function for handling the standard error stream. This method should usually only be used in debug pages.
de: Eine Callback-Funktion für die Behandlung des Default-Fehlerstroms. Diese Methode sollte normalerweise nur in Debug-Seiten verwendet werden.
zh_tw: 用於處理標準錯誤流的回呼函式. 這個方法通常應該只在除錯頁面使用.

source: By default, ``console.error()`` is used.
de: Standardmäßig wird ``console.error()`` verwendet.
zh_tw: 預設情況下，使用的是 ``console.error()``。

source: A variadic number of arguments to be printed as errors.
de: Eine variable Menge von Argumenten, die als Fehler ausgegeben werden.
zh_tw: 將要輸出的可變數量的參數.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: type
de: Typ
