Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_introduction_2d.po
Languages: de, zh_cn, zh_tw

source: 2D navigation overview
de: Übersicht 2D-Navigation
zh_cn: 2D 导航概述

source: Godot provides multiple objects, classes and servers to facilitate grid-based or mesh-based navigation and pathfinding for 2D and 3D games. The following section provides a quick overview over all available navigation related objects in Godot for 2D scenes and their primary use.
de: Godot bietet eine Vielzahl von Objekten, Klassen und Servern, die eine raster- oder meshbasierte Navigation und Wegfindung für 2D- und 3D-Spiele ermöglichen. Der folgende Abschnitt gibt einen schnellen Überblick über alle in Godot verfügbaren Navigationsobjekte für 2D-Szenen und ihre primäre Verwendung.
zh_cn: Godot 提供了多种对象、类和服务器，可帮助 2D 和 3D 游戏实现基于栅格（Grid）或网格（Mesh）的导航和寻路。下文将对 Godot 中与 2D 场景导航相关的对象及其主要用途进行概述。
zh_tw: Godot 提供了多種物件、類和伺服器，可幫助 2D 和 3D 遊戲實作基於柵格（Grid）或網格（Mesh）的導覽和尋路。下文將對 Godot 中與 2D 場景導覽相關的對象及其主要用途進行概述。

source: Godot provides the following objects and classes for 2D navigation:
de: Godot bietet die folgenden Objekte und Klassen für die 2D-Navigation:
zh_cn: Godot 为 2D 导航提供了如下对象和类：
zh_tw: Godot 可匯入下列圖片格式：

source: ``Astar2D`` objects provide an option to find the shortest path in a graph of weighted **points**.
de: Die ``Astar2D``-Objekte bieten die Möglichkeit, den kürzesten Weg in einem Graphen aus gewichteten **Punkten** zu finden.
zh_cn: ``Astar2D`` 对象能够在由具有权重的\ **点**\ 构成的图中查找最短路径。
zh_tw: ``Astar2D`` 物件能夠在由具有權重的**點**構成的圖中搜尋最短路徑。

source: The AStar2D class is best suited for cell-based 2D gameplay that does not require actors to reach any possible position within an area but only predefined, distinct positions.
de: Die Klasse AStar2D eignet sich am besten für zellbasierte 2D-Spiele, bei denen die Akteure nicht jede mögliche Position innerhalb eines Bereichs erreichen müssen, sondern nur vordefinierte, eindeutige Positionen.

source: ``NavigationServer2D`` provides a powerful server API to find the shortest path between two positions on a area defined by a navigation mesh.
de: Der ``NavigationServer2D`` stellt eine leistungsfähige Server-API zur Verfügung, um den kürzesten Weg zwischen zwei Positionen auf einer durch ein Navigations-Mesh definierten Fläche zu finden.
zh_cn: ``NavigationServer2D`` 提供了强大的服务器 API，能够在区域中查找两个位置之间的最短路径，区域由导航网格定义。
zh_tw: ``NavigationServer2D`` 提供了強大的伺服器 API，能夠在區域中搜尋兩個位置之間的最短路徑，區域由導覽網格定義。

source: The NavigationServer is best suited for 2D realtime gameplay that does require actors to reach any possible position within a navigation mesh defined area. Mesh-based navigation scales well with large game worlds as a large area can often be defined with a single polygon when it would require many, many grid cells.
de: Der NavigationServer eignet sich am besten für 2D-Echtzeitspiele, bei denen die Akteure jede mögliche Position innerhalb eines durch ein Mesh definierten Navigationsbereichs erreichen müssen. Mesh-basierte Navigation skaliert gut mit großen Spielwelten, da ein großer Bereich oft mit einem einzigen Polygon definiert werden kann, während dafür viele, viele Rasterzellen benötigt würden.

source: The NavigationServer holds different navigation maps that each consist of regions that hold navigation mesh data. Agents can be placed on a map for avoidance calculation. RIDs are used to reference internal maps, regions, and agents when communicating with the server.
de: Der NavigationServer enthält verschiedene Navigations-Maps, die jeweils aus Regionen mit Navigations-Mesh-Daten bestehen. Agenten können zur Ausweichberechnung auf einer Map platziert werden. RIDs werden verwendet, um bei der Kommunikation mit dem Server auf interne Maps, Regionen und Agenten zu verweisen.

source: The following NavigationServer RID types are available.
de: Die folgenden NavigationServer-RID-Typen sind verfügbar.
zh_cn: NavigationServer 中可用的 RID 类型如下。
zh_tw: NavigationServer 中可用的 RID 型別如下。

source: Reference to a specific navigation map that holds regions and agents. The map will attempt to join the navigation meshes of the regions by proximity. The map will synchronize regions and agents each physics frame.
de: Referenz auf eine bestimmte Navigations-Map, die Regionen und Agenten enthält. Die Map versucht, die Navigations-Meshes der Regionen nach Entfernung zueinander zu verbinden. Die Map synchronisiert Regionen und Agenten in jedem Physik-Frame.

source: Reference to a specific navigation region that can hold navigation mesh data. The region can be enabled / disabled or the use restricted with a navigation layer bitmask.
de: Referenz auf eine bestimmte Navigationsregion, die Navigations-Mesh-Daten enthalten kann. Die Region kann mit einer Navigations-Ebenen-Bitmaske aktiviert / deaktiviert oder ihre Verwendung eingeschränkt werden.

source: Reference to a specific navigation link that connects two navigation mesh positions over arbitrary distances.
de: Referenz auf eine bestimmte Navigationsverknüpfung, die zwei Mesh-Positionen über beliebige Entfernungen miteinander verbindet.
zh_cn: 引用指定的导航链接，能够将两个导航网格上的位置进行连接，无视距离。
zh_tw: 引用指定的導覽連結，能夠將兩個導覽網格上的位置進行連接，無視距離。

source: Reference to a specific avoidance agent. The avoidance is specified by a radius value.
de: Referenz auf einen bestimmten Ausweichagenten. Die Art des Ausweichens wird durch einen Radiuswert angegeben.

source: Reference to a specific avoidance obstacle used to affect and constrain the avoidance velocity of agents.
de: Referenz auf ein bestimmtes Ausweichhindernis, um die Ausweichgeschwindigkeit der Agenten zu beeinflussen und einzuschränken.

source: The following scene tree nodes are available as helpers to work with the NavigationServer2D API.
de: Die folgenden Nodes des Szenenbaums sind als Hilfsmittel für die Arbeit mit der NavigationServer2D-API verfügbar.

source: A Node that holds a NavigationPolygon resource that defines a navigation mesh for the NavigationServer2D.
de: Ein Node, der eine NavigationPolygon-Ressource enthält, die ein Navigations-Mesh für den NavigationServer2D definiert.
zh_cn: 存放 NavigationPolygon 资源的节点，该资源定义的是 NavigationServer2D 中的导航网格。
zh_tw: 存放 NavigationPolygon 資源的節點，該資源定義的是 NavigationServer2D 中的導覽網格。

source: The region can be enabled / disabled.
de: Die Region kann aktiviert / deaktiviert werden.
zh_cn: 区块可以启用/禁用。
zh_tw: 區塊可以啟用/禁用。

source: The use in pathfinding can be further restricted through the ``navigation_layers`` bitmask.
de: Die Verwendung in der Wegfindung kann durch die Bitmaske ``navigation_layers`` weiter eingeschränkt werden.
zh_cn: 通过 ``navigation_layers`` 掩码，可以对其在寻路中的使用做进一步的限制。

source: The NavigationServer2D will join the navigation meshes of regions by proximity for a combined navigation mesh.
de: Der NavigationServer2D fügt die Navigations-Meshes der Regionen nach ihrer Nähe zu einem kombinierten Mesh zusammen.

source: A Node that connects two positions on navigation meshes over arbitrary distances for pathfinding.
de: Ein Node, der zwei Positionen auf Navigations-Meshes über beliebige Entfernungen zur Wegfindung verbindet.

source: The link can be enabled / disabled.
de: Die Verknüpfung kann aktiviert/deaktiviert werden.
zh_cn: 链接可以启用/禁用。
zh_tw: 連結可以啟用/禁用。

source: The link can be made one-way or bidirectional.
de: Die Verknüpfung kann in eine Richtung oder in beide Richtungen erfolgen.
zh_cn: 链接可以设为单向或双向。
zh_tw: 連結可以設為單向或雙向。

source: Links tell the pathfinding that a connection exists and at what cost. The actual agent handling and movement needs to happen in custom scripts.
de: Verknüpfungen teilen der Wegfindung mit, dass eine Verbindung besteht und mit welchen Kosten. Die eigentliche Agentenbehandlung und -bewegung muss in benutzerdefinierten Skripten erfolgen.
zh_cn: 链接会告诉寻路存在这样的连接、相关的消耗如何。实际的代理处理以及移动需要在自定义脚本中实现。
zh_tw: 連結會告訴尋路存在這樣的連接、相關的消耗如何。實際的代理處理以及移動需要在自訂腳本中實作。

source: A helper Node used to facilitate common NavigationServer2D API calls for pathfinding and avoidance. Use this Node with a Node2D inheriting parent Node.
de: Ein Helfer-Node, der allgemeine NavigationServer2D-API-Aufrufe für Wegfindung und -vermeidung erleichtert. Verwenden Sie diesen Node mit einem Parent-Node, der von Node2D abgeleitet ist.

source: A Node that can be used to affect and constrain the avoidance velocity of avoidance enabled agents. This Node does NOT affect the pathfinding of agents. You need to change the navigation meshes for that instead.
de: Ein Node, der verwendet werden kann, um die Ausweichgeschwindigkeit von ausweichfähigen Agenten zu beeinflussen und einzuschränken. Dieser Node hat KEINEN Einfluss auf die Wegfindung von Agenten. Sie müssen stattdessen die Navigations-Meshes für diese ändern.

source: The 2D navigation meshes are defined with the following resources:
de: Die 2D-Navigationsmeshes werden mit den folgenden Ressourcen definiert:
zh_cn: 2D 导航网格由以下资源定义：
zh_tw: 填寫下列設定：

source: :ref:`NavigationPolygon<class_NavigationPolygon>` Resource
de: :ref:`NavigationPolygon<class_NavigationPolygon>`-Ressource
zh_cn: :ref:`NavigationPolygon<class_NavigationPolygon>` 资源
zh_tw: :ref:`String <class_String>`

source: A resource that holds 2D navigation mesh data. It provides polygon drawing tools to allow defining navigation areas inside the Editor as well as at runtime.
de: Eine Ressource, die 2D-Navigations-Mesh-Daten enthält. Sie bietet Tools zum Zeichnen von Polygonen, um die Definition von Navigationsbereichen sowohl im Editor als auch zur Laufzeit zu ermöglichen.

source: The NavigationRegion2D Node uses this resource to define its navigation area.
de: Der NavigationRegion2D-Node verwendet diese Ressource, um seinen Navigationsbereich zu definieren.
zh_cn: NavigationRegion2D 节点使用该资源定义其导航区域。
zh_tw: NavigationRegion2D 節點使用該資源定義其導覽區域。

source: The NavigationServer2D uses this resource to update the navigation mesh of individual regions.
de: Der NavigationServer2D verwendet diese Ressource, um das Navigations-Mesh einzelner Regionen zu aktualisieren.
zh_cn: NavigationServer2D 使用该资源更新各个区块的导航网格。

source: The TileSet Editor creates and uses this resource internally when defining tile navigation areas.
de: Der TileSet-Editor erstellt und verwendet diese Ressource intern, wenn er Tile-Navigationsbereiche definiert.
zh_cn: TileSet 编辑器会定义图块的导航区域时在内部创建并使用该资源。
zh_tw: TileSet 編輯器會定義圖塊的導覽區域時在內部建立並使用該資源。

source: You can see how 2D navigation works in action using the `2D Navigation Polygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ and `Grid-based Navigation with AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ demo projects.
de: Wie die 2D-Navigation in Aktion funktioniert, können Sie anhand der Demoprojekte `2D-Navigationspolygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ und `Rasterbasierte Navigation mit AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ sehen.
zh_cn: 可以使用 `2D 导航演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__\ 和\ `使用 AStarGrid2D 进行基于栅格的导航 <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ 演示项目了解 2D 导航如何运作。
zh_tw: 可以使用 `2D 導覽演示專案 <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__和`使用 AStarGrid2D 進行基於柵格的導覽 <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ 演示專案瞭解 2D 導覽如何運作。

source: Setup for 2D scene
de: Einrichtung für 2D-Szenen
zh_cn: 2D 场景的设置
zh_tw: 2D 場景的設定

source: The following steps show the basic setup for minimal viable navigation in 2D. It uses the NavigationServer2D and a NavigationAgent2D for path movement.
de: Die folgenden Schritte zeigen den grundlegenden Aufbau einer minimal funktionsfähigen Navigation in 2D. Es verwendet den NavigationServer2D und einen NavigationAgent2D für die Pfadbewegung.

source: Add a NavigationRegion2D Node to the scene.
de: Fügen Sie einen NavigationRegion2D-Node zur Szene hinzu.
zh_cn: 在场景中添加一个 NavigationRegion2D 节点。
zh_tw: 在場景中新增一個 NavigationRegion2D 節點。

source: Click on the region node and add a new NavigationPolygon Resource to the region node.
de: Klicken Sie auf den Regions-Node und fügen Sie eine neue NavigationPolygon-Resource zum Regions-Node hinzu.
zh_cn: 单击该区块节点，向该节点添加一个新的 NavigationPolygon 资源。
zh_tw: 按一下該區塊節點，向該節點新增一個新的 NavigationPolygon 資源。

source: Define the moveable navigation area with the NavigationPolygon draw tool.
de: Definieren Sie den beweglichen Navigationsbereich mit dem Zeichenwerkzeug von NavigationPolygon.
zh_cn: 使用 NavigationPolygon 绘制工具定义可移动导航区域。
zh_tw: 使用 NavigationPolygon 繪製工具定義可移動導覽區域。

source: The navigation mesh defines the area where an actor can stand and move with its center. Leave enough margin between the navigation polygon edges and collision objects to not get path following actors repeatedly stuck on collision.
de: Das Navigations-Mesh definiert den Bereich, in dem ein Akteur stehen und sich mit seinem Zentrum bewegen kann. Lassen Sie genügend Spielraum zwischen den Kanten des Navigationspolygons und den Kollisionsobjekten, damit Akteure, die einem Pfad folgen, nicht wiederholt an Kollisionen hängen bleiben.

source: Add a CharacterBody2D node in the scene with a basic collision shape and a sprite or mesh for visuals.
de: Fügen Sie einen CharacterBody2D-Node in der Szene mit einer einfachen Kollisions-Shape und einem Sprite oder Mesh für die visuelle Darstellung hinzu.
zh_cn: 在场景中添加一个 CharacterBody2D 节点，设置基础的碰撞形状，添加一个精灵或网格方便观察。
zh_tw: 在場景中新增一個 CharacterBody2D 節點，設定基礎的碰撞形狀，新增一個精靈或網格方便觀察。

source: Add a NavigationAgent2D node below the character node.
de: Fügen Sie einen NavigationAgent2D-Node unterhalb des Charakter-Nodes hinzu.
zh_cn: 在该角色节点下添加一个 NavigationAgent2D 节点。
zh_tw: 在該角色節點下新增一個 NavigationAgent2D 節點。

source: Add the following script to the CharacterBody2D node. We make sure to set a movement target after the scene has fully loaded and the NavigationServer had time to sync.
de: Fügen Sie das folgende Skript zum CharacterBody2D-Node hinzu. Wir stellen sicher, dass wir ein Bewegungsziel festlegen, nachdem die Szene vollständig geladen wurde und der NavigationServer Zeit hatte, sich zu synchronisieren.
zh_cn: 为 CharacterBody3D 节点添加下面的脚本。场景完全加载后，我们确保设置移动目标，NavigationServer 有时间进行同步。
zh_tw: 為 CharacterBody3D 節點新增下面的腳本。場景完全載入後，我們確保設定移動目標，NavigationServer 有時間進行同步。

source: On the first frame the NavigationServer map has not synchronized region data and any path query will return empty. Wait for the NavigationServer synchronization by awaiting one frame in the script.
de: Beim ersten Frame hat die NavigationServer-Map die Regionsdaten noch nicht synchronisiert und jede Pfadabfrage liefert "leer" zurück. Warten Sie auf die NavigationServer-Synchronisierung, indem Sie im Skript ein Frame abwarten.

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: NavMap RID
zh_cn: 导航地图 RID
zh_tw: 導覽地圖 RID

source: NavRegion RID
zh_cn: 导航区块 RID
zh_tw: 導覽區塊 RID

source: NavLink RID
zh_cn: 导航链接 RID
zh_tw: 導覽連結 RID

source: NavAgent RID
zh_cn: 导航代理 RID
zh_tw: 導覽代理 RID

source: NavObstacle RID
zh_cn: 导航障碍物 RID

source: :ref:`NavigationRegion2D<class_NavigationRegion2D>` Node
zh_cn: :ref:`NavigationRegion2D<class_NavigationRegion2D>` 节点
zh_tw: :ref:`String <class_String>`

source: :ref:`NavigationLink2D<class_NavigationLink2D>` Node
zh_cn: :ref:`NavigationLink2D<class_NavigationLink2D>` 节点
zh_tw: :ref:`String <class_String>`

source: :ref:`NavigationAgent2D<class_NavigationAgent2D>` Node
zh_cn: :ref:`NavigationAgent2D<class_NavigationAgent2D>` 节点
zh_tw: :ref:`String <class_String>`

source: :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` Node
zh_cn: :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` 节点
zh_tw: :ref:`Dictionary <class_Dictionary>`

source: :ref:`Astar2D<class_Astar2D>`
zh_tw: :ref:`Vector2 <class_Vector2>`

source: :ref:`NavigationServer2D<class_NavigationServer2D>`
zh_tw: :ref:`String <class_String>`
