Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationlinks.po
Languages: de, zh_tw

source: Using NavigationLinks
de: Verwenden von NavigationLinks
zh_tw: 使用 NavigationLink

source: NavigationLinks are used to connect navigation mesh polygons from :ref:`NavigationRegion2D<class_NavigationRegion2D>` and :ref:`NavigationRegion3D<class_NavigationRegion3D>` over arbitrary distances for pathfinding.
de: NavigationLinks werden verwendet, um Navigations-Mesh-Polygone aus :ref:`NavigationRegion2D<class_NavigationRegion2D>` und :ref:`NavigationRegion3D<class_NavigationRegion3D>` über beliebige Entfernungen für die Wegfindung zu verbinden.
zh_tw: NavigationLink 可以將相隔任意距離的導覽網格多邊形連接起來，參與尋路，多邊形來自 :ref:`NavigationRegion2D<class_NavigationRegion2D>` 和 :ref:`NavigationRegion3D<class_NavigationRegion3D>`。

source: NavigationLinks are also used to consider movement shortcuts in pathfinding available through interacting with gameplay objects e.g. ladders, jump pads or teleports.
de: NavigationLinks werden auch verwendet, um Bewegungsabkürzungen bei der Wegfindung zu berücksichtigen, die durch die Interaktion mit Spielobjekten verfügbar sind, z. B. Leitern, Jump-Pads oder Teleporter.
zh_tw: NavigationLink 也可以用來實作尋路過程中需要與遊戲中的物件互動才能使用的捷徑，例如梯子、跳板、傳送門等。

source: 2D and 3D versions of NavigationJumplinks nodes are available as :ref:`NavigationLink2D<class_NavigationLink2D>` and :ref:`NavigationLink3D<class_NavigationLink3D>` respectively.
de: 2D- und 3D-Versionen von NavigationJumplinks-Nodes sind als :ref:`NavigationLink2D<class_NavigationLink2D>` bzw. :ref:`NavigationLink3D<class_NavigationLink3D>` verfügbar.
zh_tw: 2D 和 3D 版本的 NavigationJumplinks 節點分別可用作:ref:`NavigationLink2D<class_NavigationLink2D>` 和:ref:`NavigationLink3D<class_NavigationLink3D>`。

source: Different NavigationRegions can connect their navigation meshes without the need for a NavigationLink as long as they are within navigation map ``edge_connection_margin`` and have compatible ``navigation_layers``. As soon as the distance becomes too large, building valid connections becomes a problem - a problem that NavigationLinks can solve.
de: Verschiedene NavigationRegions können ihre Navigations-Meshes miteinander verbinden, ohne dass ein NavigationLink erforderlich ist, solange sie innerhalb der ``edge_connection_margin`` der Navigations-Map liegen und kompatible ``navigation_layers`` haben. Sobald die Distanz zu groß wird, wird der Aufbau gültiger Verbindungen zu einem Problem - ein Problem, das NavigationLinks lösen können.
zh_tw: 不同的 NavigationRegions 可以連接它們的導覽網格，無需使用 NavigationLink，只要它們位於導覽地圖「edge_connection_margin」內並且具有相容的「navigation_layers」即可。一旦距離變得太大，建立有效的連線就會成為一個問題——NavigationLinks 可以解決這個問題。

source: See :ref:`doc_navigation_using_navigationregions` to learn more about the use of navigation regions. See :ref:`doc_navigation_connecting_navmesh` to learn more about how to connect navigation meshes.
de: Siehe :ref:`doc_navigation_using_navigationregions` um mehr über die Verwendung von Navigationsregionen zu erfahren. Siehe :ref:`doc_navigation_connecting_navmesh`, um mehr darüber zu erfahren, wie man Navigations-Meshes verbindet.
zh_tw: 請參閱 doc_navigation_using_navigationregions 以了解更多有關導覽區域使用的資訊。請參閱 doc_navigation_connecting_navmesh 以了解有關如何連接導覽網格的更多資訊。

source: NavigationLinks share many properties with NavigationRegions like ``navigation_layers``. NavigationLinks add a single connection between two positions over an arbitrary distance compared to NavigationRegions that add a more local traversable area with a navigation mesh resource.
de: NavigationLinks haben viele Propertys mit NavigationRegions gemeinsam, wie zum Beispiel ``navigation_layers``. NavigationLinks fügen eine einzelne Verbindung zwischen zwei Positionen über eine beliebige Distanz hinzu, im Gegensatz zu NavigationRegions, die einen eher lokal durchquerbaren Bereich mit einer Navigationsnetzressource hinzufügen.
zh_tw: NavigationLinks 與 NavigationRegions 共享許多屬性，例如「navigation_layers」。與使用導覽網格資源新增更多本地可走訪區域的 NavigationRegions 相比，NavigationLink 在任意距離的兩個位置之間新增單一連線。

source: NavigationLinks have a ``start_position`` and ``end_position`` and can go in both directions when ``bidirectional`` is enabled. When placed a navigationlink connects the navigation mesh polygons closest to its ``start_position`` and ``end_position`` within search radius for pathfinding.
de: Navigationslinks haben eine ``start_position`` und eine ``end_position`` und können in beide Richtungen gehen, wenn ``bidirectional`` aktiviert ist. Wenn ein Navigationslink platziert wird, verbindet er die Polygone des Navigations-Meshes, die seiner ``start_position`` und ``end_position`` am nächsten liegen, innerhalb des Suchradius für die Wegfindung.
zh_tw: NavigationLinks 有一個“start_position”和“end_position”，並且當啟用“雙向”時可以雙向移動。放置時，導覽連結會連接搜尋半徑內最接近其「start_position」和「end_position」的導覽網格多邊形以進行尋路。

source: The polygon search radius can be configured globally in the ProjectSettings under ``navigation/2d_or_3d/default_link_connection_radius`` or set for each navigation **map** individually using the ``NavigationServer.map_set_link_connection_radius()`` function.
de: Der Polygonsuchradius kann global in den Projekteinstellungen unter ``navigation/2d_or_3d/default_link_connection_radius`` konfiguriert werden oder für jede Navigation-**Map** einzeln mit der Funktion ``NavigationServer.map_set_link_connection_radius()`` gesetzt werden.

source: Both ``start_position`` and ``end_position`` have debug markers in the Editor. The visible radius of a position shows the polygon search radius. All navigation mesh polygons inside are compared and the closest is picked for the edge connection. If no valid polygon is found within the search radius the navigation link gets disabled.
de: Sowohl ``start_position`` als auch ``end_position`` haben Debug-Marker im Editor. Der sichtbare Radius einer Position zeigt den Polygonsuchradius an. Alle darin befindlichen Polygone des Navigations-Meshs werden verglichen und das nächstgelegene wird für die Kantenverbindung ausgewählt. Wenn kein gültiges Polygon innerhalb des Suchradius gefunden wird, wird der Navigations-Link deaktiviert.
zh_tw: “start_position”和“end_position”在編輯器中都有偵錯標記。位置的可見半徑顯示多邊形搜尋半徑。比較內部的所有導覽網格多邊形，並選擇最接近的作為邊緣連接。如果在搜尋半徑內找不到有效的多邊形，導覽連結將被停用。

source: The link debug visuals can be changed in the Editor :ref:`ProjectSettings<class_ProjectSettings>` under ``debug/shapes/navigation``. The visibility of the debug can also be controlled in the Editor 3D Viewport gizmo menu.
de: Die Debug-Visualisierung der Links kann im Editor :ref:`ProjectSettings<class_ProjectSettings>` unter ``debug/shapes/navigation`` geändert werden. Die Sichtbarkeit des Debugs kann auch im Editor 3D-Viewport-Gizmo-Menü gesteuert werden.
zh_tw: 可以在「debug/shapes/navigation」下的編輯器中更改連結除錯視覺效果:ref:`ProjectSettings<class_ProjectSettings>`。除錯的可見性也可以在編輯器 3D 視口小控制功能表中控制。

source: NavigationLinks do not move agents between the two link positions by themselves.
de: Navigationslinks bewegen Agenten nicht von sich aus zwischen den beiden Verbindungspositionen.
zh_tw: 導覽連結本身不會在兩個連結位置之間移動代理。

source: A navigation link does not provide any automated movement through the link. Instead, when an agent reaches the position of a link, game code needs to react (e.g. through area triggers) and provide means for the agent to move through the link to end up at the links other position (e.g. through teleport or animation) to continue along the path.
de: Ein Navigations-Link bietet keine automatische Bewegung durch den Link. Wenn ein Agent die Position eines Links erreicht, muss der Spielcode reagieren (z. B. durch Bereichs-Trigger) und Mittel bereitstellen, mit denen sich der Agent durch den Link bewegen kann, um an der anderen Position des Links zu landen (z. B. durch Teleport oder Animation), und den Weg fortzusetzen.
zh_tw: 導覽連結不提供通過連結的任何自動移動。相反，當代理到達連結的位置時，遊戲程式碼需要做出反應（例如通過區域觸發器）並為代理提供通過鏈接移動以最終到達鏈接其他位置（例如通過傳送或動畫）的方法。繼續沿著小路走。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
