Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationregions.po
Languages: de, zh_tw

source: Using NavigationRegions
de: Verwendung von NavigationRegions
zh_tw: 使用 NavigationRegion

source: NavigationRegions are the visual Node representation of a **region** of the navigation **map** on the NavigationServer. Each NavigationRegion node holds a resource for the navigation mesh data.
de: NavigationRegions sind die visuelle Node-Repräsentation einer **Region** der Navigations-Map **auf dem NavigationServer**. Jeder NavigationRegion-Node enthält eine Ressource für die Daten des Navigation Mesh.

source: Both 2D and 3D version are available as :ref:`NavigationRegion2D<class_NavigationRegion2D>` and :ref:`NavigationRegion3D<class_NavigationRegion3D>` respectively.
de: Sowohl die 2D- als auch die 3D-Version sind als :ref:`NavigationRegion2D<class_NavigationRegion2D>` bzw. :ref:`NavigationRegion3D<class_NavigationRegion3D>` verfügbar.
zh_tw: 2D 和 3D 版本分別為 :ref:`NavigationRegion2D<class_NavigationRegion2D>` 和 :ref:`NavigationRegion3D<class_NavigationRegion3D>`。

source: Individual NavigationRegions upload their 2D NavigationPolygon or 3D NavigationMesh resource data to the NavigationServer. The NavigationServer map turns this information into a combined navigation map for pathfinding.
de: Die einzelnen NavigationRegions laden ihre 2D-Navigationspolygon- oder 3D-Navigations-Mesh-Ressourcendaten auf den Navigationsserver hoch. Die NavigationServer-Map verwandelt diese Informationen in eine kombinierte Navigations-Map für die Wegfindung.
zh_tw: 各個NavigationRegions將其2D NavigationPolygon或3D NavigationMesh資源資料上傳到NavigationServer。導覽伺服器地圖將這些資訊轉換為組合導覽地圖以供尋路。

source: To create a navigation region using the scene tree add a ``NavigationRegion2D`` or ``NavigationRegion3D`` node to the scene. All regions require a navigation mesh resource to function. See :ref:`doc_navigation_using_navigationmeshes` to learn how to create and apply navigation meshes.
de: Um eine Navigationsregion über den Szenenbaum zu erstellen, fügen Sie einen ``NavigationRegion2D`` oder ``NavigationRegion3D``-Node zur Szene hinzu. Alle Regionen benötigen ein Navigation-Mesh, um zu funktionieren. Siehe :ref:`doc_navigation_using_navigationmeshes` um zu lernen, wie man Navigations-Meshes erstellt und anwendet.

source: NavigationRegions will automatically push ``global_transform`` changes to the region on the NavigationServer which makes them suitable for moving platforms. The NavigationServer will attempt to connect the navigation meshes of individual regions when they are close enough. For more details see :ref:`doc_navigation_connecting_navmesh`. To connect NavigationRegions over arbitrary distances see :ref:`doc_navigation_using_navigationlinks` to learn how to create and use ``NavigationLinks``.
de: NavigationRegions werden automatisch ``global_transform``-Änderungen an die Region auf dem NavigationServer weitergeben, was sie für bewegte Plattformen geeignet macht. Der NavigationServer wird versuchen, die Meshes der einzelnen Regionen zu verbinden, wenn sie nahe genug beieinander liegen. Für weitere Details siehe :ref:`doc_navigation_connecting_navmesh`. Um Navigationsregionen über beliebige Entfernungen zu verbinden, siehe :ref:`doc_navigation_using_navigationlinks`, um zu lernen, wie man ``NavigationLinks`` erzeugt und benutzt.

source: While changing the transform of a NavigationRegion node does update the region position on the NavigationServer, changing the scale does not. A navigation mesh resource has no scale and needs to be fully updated when source geometry changes scale.
de: Wenn die Transformation eines NavigationRegion-Nodes geändert wird, wird zwar die Position der Region auf dem NavigationServer aktualisiert, nicht aber die Skalierung. Eine Navigation-Mesh-Ressource hat keine Skalierung und muss vollständig aktualisiert werden, wenn die Quellgeometrie die Skalierung ändert.

source: Regions can be enabled / disabled and if disabled will not contribute to future pathfinding queries.
de: Regionen können aktiviert/deaktiviert werden, und wenn sie deaktiviert sind, tragen sie nicht zu zukünftigen Pfadfindungsanfragen bei.
zh_tw: 可以啟用/停用區域，如果停用，將不會對未來的尋路查詢做出貢獻。

source: Existing paths will not be automatically updated when a region gets enabled / disabled.
de: Bestehende Pfade werden nicht automatisch aktualisiert, wenn eine Region aktiviert/deaktiviert wird.
zh_tw: 當區域啟用/停用時，現有路徑不會自動更新。

source: Creating new navigation regions
de: Neue Navigationsregionen erstellen
zh_tw: 建立內容

source: New NavigationRegion nodes will automatically register to the default world navigation map for their 2D/3D dimension.
de: Neue NavigationRegion-Nodes werden automatisch in der Default-Weltnavigations-Map für ihre 2D/3D-Dimension registriert.
zh_tw: 新的 NavigationRegion 節點將自動註冊到其 2D/3D 維度的預設世界導覽地圖。

source: The region RID can then be obtained from NavigationRegion Nodes with ``get_region_rid()``.
de: Die Regions-RID kann dann von NavigationRegion-Nodes mit ``get_region_rid()`` erhalten werden.
zh_tw: 然後可以使用 get_region_rid() 從 NavigationRegion 節點取得區域 RID。

source: New regions can also be created with the NavigationServer API and added to any existing map.
de: Neue Regionen können auch mit der NavigationServer-API erstellt und zu jeder bestehenden Map hinzugefügt werden.
zh_tw: 也可以使用 NavigationServer API 建立新區域並將其新增到任何現有地圖中。

source: If regions are created with the NavigationServer API directly they need to be assigned a navigation map manually.
de: Wenn Regionen direkt mit der NavigationServer-API erstellt werden, muss ihnen manuell eine Navigations-Map zugewiesen werden.
zh_tw: 如果直接使用 NavigationServer API 建立區域，則需要手動為其指派導覽地圖。

source: NavigationRegions can only be assigned to a single NavigationMap. If an existing region is assigned to a new map it will leave the old map.
de: NavigationRegions können nur einer einzigen NavigationMap zugewiesen werden. Wenn eine bestehende Region einer neuen Map zugewiesen wird, verlässt sie die alte Map.
zh_tw: NavigationRegions 只能分配給單一 NavigationMap。如果將現有區域分配給新地圖，它將保留舊地圖。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
