Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationobstacles.po
Languages: de, zh_tw

source: Using NavigationObstacles
de: Verwenden von NavigationObstacles
zh_tw: 使用 NavigationObstacle

source: NavigationObstacles can be used either as static or dynamic obstacles to affect avoidance controlled agents.
de: NavigationObstacles können entweder als statische oder dynamische Hindernisse verwendet werden, um ausweichgesteuerte Agenten zu beeinflussen.
zh_tw: 導覽障礙物可以用作靜態或動態障礙物來影響迴避控制代理。

source: When used statically NavigationObstacles constrain avoidance controlled agents outside or inside a polygon defined area.
de: Bei statischer Verwendung von NavigationObstacles werden ausweichgesteuerte Agenten außerhalb oder innerhalb eines durch ein Polygon definierten Bereichs eingeschränkt.
zh_tw: 當靜態使用時，導覽障礙會限制多邊形定義區域外部或內部的迴避控制代理。

source: When used dynamically NavigationObstacles push away avoidance controlled agents in a radius around them.
de: Wenn sie dynamisch eingesetzt werden, stoßen Navigationshindernisse die ausweichgesteuerten Agenten in einem Radius um sie herum weg.
zh_tw: 當動態使用時，導覽障礙會推開其周圍半徑範圍內的迴避控制代理。

source: 2D and 3D versions of NavigationObstacles nodes are available as :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` and :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` respectively.
de: 2D- und 3D-Versionen von NavigationObstacle-Nodes sind als :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` bzw. :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` verfügbar.
zh_tw: 2D 和 3D 版本的 NavigationObstacles 節點分別可用作:ref:`NavigationObstacle2D<class_NavigationObstacle2D>` 和:ref:`NavigationObstacle3D<class_NavigationObstacle3D>`。

source: NavigationObstacles do not change or influence the pathfinding in any way. NavigationObstacles only affect the avoidance velocities of agents controlled by avoidance.
de: NavigationObstacles verändern oder beeinflussen die Wegfindung in keiner Weise. Navigationshindernisse wirken sich nur auf die Ausweichgeschwindigkeiten von ausweichgesteuerten Agenten aus.
zh_tw: 導覽障礙不會以任何方式改變或影響尋路。導覽障礙僅影響受迴避控制的代理的迴避速度。

source: Static obstacles
de: Statische Hindernisse
zh_tw: 靜態形體。

source: A NavigationObstacle is considered static when its ``vertices`` property is populated with an outline array of positions to form a polygon.
de: Ein NavigationObstacle wird als statisch angesehen, wenn seine ``vertices``-Property mit einem Array von Positionen gefüllt ist, um ein Polygon zu bilden.
zh_tw: 當 NavigationObstacle 的「vertices」屬性填入有位置的輪廓陣列以形成多邊形時，該 NavigationObstacle 被認為是靜態的。

source: Static obstacles act as hard do-not-cross boundaries for avoidance using agents, e.g. similar to physics collision but for avoidance.
de: Statische Hindernisse fungieren als harte nicht zu überquerende Grenzen für die Vermeidung durch Agenten, z.B. ähnlich wie physikalische Kollisionen, aber für das Ausweichen.
zh_tw: 靜態障礙物充當硬性請勿跨越邊界，以使用代理進行迴避，例如類似於物理碰撞，但用於迴避。

source: Static obstacles define their boundaries with an array of outline ``vertices`` (positions), and in case of 3D with an additional ``height`` property.
de: Statische Hindernisse definieren ihre Grenzen mit einem Array von ``Vertices`` (Positionen), und im Falle von 3D mit einer zusätzlichen ``Höhe``-Property.
zh_tw: 靜態障礙物使用一系列輪廓「頂點」（位置）定義其邊界，如果是 3D，則具有附加的「高度」屬性。

source: Static obstacles only work for agents that use the 2D avoidance mode.
de: Statische Hindernisse funktionieren nur bei Agenten, die den 2D-Ausweichmodus verwenden.
zh_tw: 靜態障礙物僅適用於使用 2D 迴避模式的代理。

source: Static obstacles define through winding order of the vertices if agents are pushed out or sucked in.
de: Statische Hindernisse definieren sich durch die Wicklungsrichtung der Vertices, wenn Agenten herausgeschoben oder hineingesaugt werden.
zh_tw: 如果代理人被推出或吸入，靜態障礙物透過頂點的纏繞順序來定義。

source: Static obstacles can not change their position. They can only be warped to a new position and rebuild from scratch. Static obstacles as a result are ill-suited for usages where the position is changed every frame as the constant rebuild has a high performance cost.
de: Statische Hindernisse können ihre Position nicht verändern. Sie können nur an eine neue Position gesetzt und von Grund auf neu aufgebaut werden. Statische Hindernisse sind daher für Anwendungen, bei denen die Position in jedem Frame geändert wird, schlecht geeignet, da der ständige Neuaufbau mit hohen Performance-Kosten verbunden ist.
zh_tw: 靜態障礙物不能改變其位置。它們只能扭曲到新的位置並從頭開始重建。因此，靜態障礙物不適合每影格位置都會改變的用途，因為不斷重建會產生很高的效能成本。

source: Static obstacles that are warped to another position can not be predicted by agents. This creates the risk of getting agents stuck should a static obstacle be warped on top of agents.
de: Statische Hindernisse, die an eine andere Position gesetzt werden, können von den Agenten nicht vorhergesagt werden. Dadurch besteht die Gefahr, dass die Agenten stecken bleiben, wenn ein statisches Hindernis über den Agenten gesetzt wird.
zh_tw: 代理無法預測扭曲到另一個位置的靜態障礙物。如果靜態障礙物扭曲到代理頂部，這就會產生代理被卡住的風險。

source: When the 2D avoidance is used in 3D the y-axis of Vector3 vertices is ignored. Instead, the global y-axis position of the obstacle is used as the elevation level. Agents will ignore static obstacles in 3D that are below or above them. This is automatically determined by global y-axis position of both obstacle and agent as the elevation level as well as their respective height properties.
de: Wenn das 2D-Ausweichen in 3D verwendet wird, wird die y-Achse der Vector3-Vertices ignoriert. Stattdessen wird die globale y-Achsen-Position des Hindernisses als Höhenebene verwendet. Agenten ignorieren statische Hindernisse in 3D, die sich unter oder über ihnen befinden. Dies wird automatisch durch die globale y-Achsenposition des Hindernisses und des Agenten als Höhenebene sowie durch ihre jeweiligen Höheneigenschaften bestimmt.
zh_tw: 當在 3D 中使用 2D 迴避時，Vector3 頂點的 y 軸將被忽略。相反，障礙物的全局 y 軸位置用作海拔高度。代理將忽略 3D 中低於或高於其的靜態障礙物。這是由障礙物和代理的全局 y 軸位置自動確定為海拔高度以及它們各自的高度屬性。

source: Dynamic obstacles
de: Dynamische Objekte
zh_tw: 動態性

source: A NavigationObstacle is considered dynamic when its ``radius`` property is greater than zero.
de: Ein NavigationObstacle wird als dynamisch angesehen, wenn seine Property ``Radius`` größer als Null ist.
zh_tw: NavigationObstacle 的 ``radius`` 屬性大於零時就會被認為是動態障礙物。

source: Dynamic obstacles act as a soft please-move-away-from-me object for avoidance using agents, e.g. similar to how they avoid other agents.
de: Dynamische Hindernisse fungieren als weiches "Bitte-weg-von-mir"-Objekt, dem Agenten ausweichen, z.B. ähnlich wie sie anderen Agenten ausweichen.
zh_tw: 對於啟用了避障的代理而言，動態障礙物就是一個“請離我遠點”的物件，類似於它們自己躲避其他代理的行為。

source: Dynamic obstacles define their boundaries with a single ``radius`` for a 2D circle, or in case of 3D avoidance a sphere shape.
de: Dynamische Hindernisse definieren ihre Grenzen mit einem einzigen ``Radius`` für einen 2D-Kreis, oder im Falle der 3D-Umgehung einer Kugel.
zh_tw: 動態障礙物使用 ``radius`` 半徑來定義邊界，2D 中是圓形，3D 中是球形。

source: Dynamic obstacles can change their position every frame without additional performance cost.
de: Dynamische Hindernisse können ihre Position bei jedem Bild ohne zusätzliche Performance-Kosten ändern.
zh_tw: 動態障礙物每一影格都可以改變位置，不會有額外的性能開銷。

source: Dynamic obstacles with a set velocity can be predicted in their movement by agents.
de: Dynamische Hindernisse mit einer bestimmten Geschwindigkeit können in ihrer Bewegung von Agenten vorhergesagt werden.
zh_tw: 動態障礙物設定速度後，其他代理就能夠預測移動。

source: Dynamic obstacles are not a reliable way to constrain agents in crowded or narrow spaces.
de: Dynamische Hindernisse sind kein zuverlässiges Mittel, um Agenten in überfüllten oder engen Räumen einzuschränken.
zh_tw: 動態障礙物不適合用來將代理限制在擁擠、狹窄的空間中。

source: While both static and dynamic properties can be active at the same time on the same obstacle this is not recommended for performance. Ideally when an obstacle is moving the static vertices are removed and instead the radius activated. When the obstacle reaches the new final position it should gradually enlarge its radius to push all other agents away. With enough created save space around the obstacle it should add the static vertices again and remove the radius. This helps to avoid getting agents stuck in the suddenly appearing static obstacle when the rebuild static boundary is finished.
de: Obwohl sowohl statische als auch dynamische Propertys gleichzeitig für ein und dasselbe Hindernis aktiv sein können, ist dies aus Performance-Gründen nicht empfehlenswert. Wenn sich ein Hindernis bewegt, werden idealerweise die statischen Vertices entfernt und stattdessen der Radius aktiviert. Wenn das Hindernis die neue Endposition erreicht, sollte es seinen Radius allmählich vergrößern, um alle anderen Agenten wegzuschieben. Wenn genug Platz um das Hindernis herum geschaffen wurde, sollte es die statischen Vertices wieder hinzufügen und den Radius entfernen. Dies hilft zu vermeiden, dass Agenten in dem plötzlich auftauchenden statischen Hindernis stecken bleiben, wenn der Wiederaufbau der statischen Begrenzung abgeschlossen ist.
zh_tw: 雖然障礙物可以同時啟動靜態和動態屬性，但是出於性能的考慮不建議這麼做。理想情況下，障礙物移動時，應該把靜態頂點移除、啟動半徑。障礙物到達目的地後，應該逐步增大半徑，將其他代理推開。在障礙物的周圍創造出足夠大的安全區域後，就應該把靜態頂點新增回來、移除半徑。這樣就能夠避免重建靜態邊界後，代理因為靜態障礙物的突然出現而被卡住。

source: Similar to agents the obstacles can make use of the ``avoidance_layers`` bitmask. All agents with a matching bit on their own avoidance mask will avoid the obstacle.
de: Ähnlich wie die Agenten können die Hindernisse die Bitmaske ``avoidance_layers`` verwenden. Alle Agenten mit einem passenden Bit auf ihrer eigenen Ausweichmaske werden das Hindernis meiden.
zh_tw: 和代理類似，障礙物也能夠使用 ``avoidance_layers`` 位元遮罩。自身的避障遮罩中與之存在配對位元的代理都會躲避這個障礙物。

source: Procedual obstacles
de: Prozedurale Hindernisse
zh_tw: 程式性天空。

source: New obstacles can be created without a Node directly on the NavigationServer.
de: Neue Hindernisse können ohne einen Node direkt auf dem NavigationServer erstellt werden.
zh_tw: 可以不借助節點，直接在 NavigationServer 上新建障礙物。

source: Obstacles created with scripts require at least a ``map`` and a ``position``. For dynamic use a ``radius`` is required. For static use an array of ``vertices`` is required.
de: Hindernisse, die mit Skripten erstellt werden, benötigen mindestens eine ``Map`` und eine ``Position``. Für die dynamische Verwendung wird ein ``Radius`` benötigt. Für die statische Verwendung wird ein Array von ``Vertices`` benötigt.
zh_tw: 使用腳本建立的障礙物至少需要有一個 ``map`` 和一個 ``position``。動態障礙物還需要 ``radius``。靜態障礙物還需要 ``vertices`` 屬性。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
