Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_debug_tools.po
Languages: de

source: Navigation debug tools
de: Debug-Tools für Navigation

source: The debug tools, properties and functions are only available in Godot debug builds. Do not use any of them in code that will be part of a release build.
de: Die Debug-Tools, Propertys und Funktionen sind nur in Godot-Debug-Builds verfügbar. Verwenden Sie sie nicht in Code, der Teil eines Release-Builds sein soll.

source: Enabling navigation debug
de: Navigations-Debugging aktivieren

source: The navigation debug visualizations are enabled by default inside the editor. To visualize navigation meshes and connections at runtime too, enable the option **Visible Navigation** in the editor **Debug** menu.
de: Die Navigations-Debug-Visualisierungen sind im Editor standardmäßig aktiviert. Um Navigations-Meshes und -verbindungen auch zur Laufzeit zu visualisieren, aktivieren Sie die Option **Sichtbare Navigation** im Editormenü **Debug**.

source: In Godot debug builds the navigation debug can also be toggled through the NavigationServer singletons from scripts.
de: In Godot-Debug-Builds kann das Navigations-Debugging auch über die NavigationServer-Singletons von Skripten aus ein- und ausgeschaltet werden.

source: Navigation debug settings
de: Einstellungen zum Navigations-Debugging

source: The appearance of navigation debug can be changed in the ProjectSettings under ``debug/shapes/navigation``. Certain debug features can also be enabled or disabled at will but may require a scene restart to take effect.
de: Das Aussehen des Navigations-Debugging kann in den Projekteinstellungen unter ``debug/shapes/navigation`` geändert werden. Bestimmte Debug-Funktionen können auch nach Belieben aktiviert oder deaktiviert werden, erfordern aber möglicherweise einen Neustart der Szene, um wirksam zu werden.

source: Debug navigation mesh polygons
de: Polygone des Navigations-Meshes debuggen

source: If ``enable_edge_lines`` is enabled, the edges of navigation mesh polygons will be highlighted. If ``enable_edge_lines_xray`` is also enabled, the edges of navigation meshes will be visible through geometry.
de: Wenn ``enable_edge_lines`` aktiviert ist, werden die Kanten von Navigations-Mesh-Polygonen hervorgehoben. Wenn ``enable_edge_lines_xray`` ebenfalls aktiviert ist, werden die Kanten von Navigations-Meshes durch die Geometrie sichtbar.

source: If ``enable_geometry_face_random_color`` is enabled, the color of each navigation mesh face will be mixed with a random color that is itself mixed with the color specified in ``geometry_face_color``.
de: Wenn ``enable_geometry_face_random_color`` aktiviert ist, wird die Farbe jeder Fläche des Meshs mit einer zufälligen Farbe gemischt, die wiederum mit der in ``geometry_face_color`` angegebenen Farbe gemischt wird.

source: Debug edge connections
de: Debuggen von Kantenverbindungen

source: When two navigation meshes are connected within ``edge_connection_margin`` distance, the connection is overlaid. The color of the overlay is controlled by ``edge_connection_color``. The connections can be made visible through geometry with ``enable_edge_connections_xray``.
de: Wenn zwei Navigations-Meshes innerhalb der ``edge_connection_margin``-Distanz verbunden sind, wird die Verbindung überlagert. Die Farbe der Überlagerung wird durch ``edge_connection_color`` gesteuert. Die Verbindungen können durch Geometrie mit ``enable_edge_connections_xray`` sichtbar gemacht werden.

source: Edge connections are only visible when the NavigationServer is active.
de: Kantenverbindungen sind nur sichtbar, wenn der NavigationServer aktiv ist.

source: To measure NavigationServer performance a dedicated monitor exists that can be found within the Editor Debugger under *Debugger->Monitors->Navigation Process*.
de: Um die Performance des Navigationsservers zu messen, gibt es einen eigenen Monitor, der im Editor-Debugger unter *Debugger->Monitore->Navigationsprozess* zu finden ist.

source: Navigation Process shows how long the NavigationServer spends updating its internals this update frame in milliseconds. Navigation Process works similar to Process for visual frame rendering and Physics Process for collision and fixed updates.
de: Navigation Process zeigt in Millisekunden an, wie lange der NavigationServer mit der Aktualisierung seiner Interna in diesem Aktualisierungsframe verbringt. Navigation Process funktioniert ähnlich wie Process für visuelles Frame-Rendering und wie Physics Process für Kollisions- und feste Updates.

source: Navigation Process accounts for all updates to **navigation maps**, **navigation regions** and **navigation agents** as well as all the **avoidance calculations** for the update frame.
de: Navigation Process berücksichtigt alle Aktualisierungen von **Navigations-Maps**, **Navigationsregionen** und **Navigationsagenten** sowie alle **Ausweichberechnungen** für den Aktualisierungs-Frame.

source: Navigation Process does NOT include pathfinding performance cause pathfinding operates on the navigation map data independently from the server process update.
de: Der Navigationsprozess umfasst NICHT die Performance der Wegfindung, da die Wegfindung unabhängig von der Aktualisierung des Serverprozesses auf den Navigations-Map-Daten basiert.

source: Navigation Process should be in general kept as low and as stable as possible for runtime performance to avoid frame rate issues. Note that since the NavigationServer process update happens in the middle of the physics update an increase in Navigation Process will automatically increase Physics Process by the same amount.
de: Der Navigationsprozess sollte im Allgemeinen so niedrig und stabil wie möglich gehalten werden, um Probleme mit der Framerate zu vermeiden. Da die Aktualisierung des Navigationsserver-Prozesses in der Mitte des Physik-Updates stattfindet, wird eine Erhöhung des Navigationsprozesses automatisch den Physikprozess um den gleichen Betrag erhöhen.

source: Navigation also provides more detailed statistics about the current navigation related objects and navigation map composition on the NavigationServer.
de: Die Navigation liefert auch detailliertere Statistiken über die aktuellen navigationsbezogenen Objekte und die Zusammensetzung der Navigations-Map auf dem NavigationServer.

source: Navigation statistics shown here can not be judged as good or bad for performance as it depends entirely on the project what can be considered as reasonable or horribly excessive.
de: Die hier gezeigten Navigationsstatistiken können nicht als gut oder schlecht für die Performance bewertet werden, da es ganz vom jeweiligen Projekt abhängt, was als angemessen oder fürchterlich übertrieben angesehen werden kann.

source: Navigation statistics help with identifying performance bottlenecks that are less obvious because the source might not always have a visible representation. E.g. pathfinding performance issues created by overly detailed navigation meshes with thousand of edges / polygons or problems caused by procedural navigation gone wrong.
de: Navigationsstatistiken helfen bei der Identifizierung von Performance-Bottlenecks, die weniger offensichtlich sind, weil die Quelle nicht immer eine sichtbare Darstellung hat. Z.B. Performance-Probleme bei der Wegfindung, die durch zu detaillierte Navigations-Meshes mit Tausenden von Kanten/Polygonen entstehen, oder Probleme, die durch schiefgelaufene prozedurale Navigation verursacht werden.

source: Translation status
de: Übersetzungsstatus
