Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_introduction_3d.po
Languages: de, zh_cn, zh_tw

source: 3D navigation overview
de: Übersicht 3D-Navigation
zh_cn: 3D 导航概述

source: Godot provides multiple objects, classes and servers to facilitate grid-based or mesh-based navigation and pathfinding for 2D and 3D games. The following section provides a quick overview over all available navigation related objects in Godot for 3D scenes and their primary use.
de: Godot bietet eine Vielzahl von Objekten, Klassen und Servern, die eine raster- oder mesh-basierte Navigation und Wegfindung für 2D- und 3D-Spiele ermöglichen. Der folgende Abschnitt bietet einen schnellen Überblick über alle in Godot für 3D-Szenen verfügbaren navigationsbezogenen Objekte und ihre primäre Verwendung.
zh_cn: Godot 提供了多种对象、类和服务器，可帮助 2D 和 3D 游戏实现基于栅格（Grid）或网格（Mesh）的导航和寻路。下文将对 Godot 中与 3D 场景导航相关的对象及其主要用途进行概述。
zh_tw: Godot 提供了多種物件、類和伺服器，可幫助 2D 和 3D 遊戲實作基於柵格（Grid）或網格（Mesh）的導覽和尋路。下文將對 Godot 中與 3D 場景導覽相關的對象及其主要用途進行概述。

source: Godot provides the following objects and classes for 3D navigation:
de: Godot bietet die folgenden Objekte und Klassen für die 3D-Navigation:
zh_cn: Godot 为 3D 导航提供了如下对象和类：
zh_tw: Godot 可匯入下列圖片格式：

source: ``Astar3D`` objects provide an option to find the shortest path in a graph of weighted **points**.
de: ``Astar3D``-Objekte bieten die Möglichkeit, den kürzesten Weg in einem Graphen aus gewichteten **Punkten** zu finden.
zh_cn: ``Astar3D`` 对象能够在由具有权重的\ **点**\ 构成的图中查找最短路径。
zh_tw: ``Astar3D`` 物件能夠在由具有權重的**點**構成的圖中搜尋最短路徑。

source: The AStar3D class is best suited for cell-based 3D gameplay that does not require actors to reach any possible position within an area but only predefined, distinct positions.
de: Die Klasse AStar3D eignet sich am besten für zellbasierte 3D-Spiele, bei denen die Akteure nicht jede mögliche Position innerhalb eines Bereichs erreichen müssen, sondern nur vordefinierte, eindeutige Positionen.

source: ``NavigationServer3D`` provides a powerful server API to find the shortest path between two positions on an area defined by a navigation mesh.
de: Der ``NavigationServer3D`` bietet eine leistungsfähige Server-API, um den kürzesten Weg zwischen zwei Positionen auf einem durch ein Navigations-Mesh definierten Gebiet zu finden.

source: The NavigationServer is best suited for 3D realtime gameplay that does require actors to reach any possible position within a navigation mesh defined area. Mesh-based navigation scales well with large game worlds as a large area can often be defined with a single polygon when it would require many, many grid cells.
de: Der NavigationServer eignet sich am besten für 3D-Echtzeitspiele, bei denen die Akteure jede mögliche Position innerhalb eines durch ein Navigations-Mesh definierten Bereichs erreichen müssen. Mesh-basierte Navigation skaliert gut mit großen Spielwelten, da ein großer Bereich oft mit einem einzigen Polygon definiert werden kann, während dafür sehr viele Rasterzellen erforderlich wären.

source: The NavigationServer holds different navigation maps that each consist of regions that hold navigation mesh data. Agents can be placed on a map for avoidance calculation. RIDs are used to reference internal maps, regions, and agents when communicating with the server.
de: Der NavigationServer enthält verschiedene Navigations-Maps, die jeweils aus Regionen mit Navigations-Mesh-Daten bestehen. Agenten können zur Ausweichberechnung auf einer Map platziert werden. RIDs werden verwendet, um bei der Kommunikation mit dem Server auf interne Maps, Regionen und Agenten zu verweisen.

source: The following NavigationServer RID types are available.
de: Die folgenden NavigationServer-RID-Typen sind verfügbar.
zh_cn: NavigationServer 中可用的 RID 类型如下。
zh_tw: NavigationServer 中可用的 RID 型別如下。

source: Reference to a specific navigation map that holds regions and agents. The map will attempt to join the navigation meshes of the regions by proximity. The map will synchronize regions and agents each physics frame.
de: Referenz auf eine bestimmte Navigations-Map, die Regionen und Agenten enthält. Die Map versucht, die Navigations-Meshes der Regionen nach Entfernung zueinander zu verbinden. Die Map synchronisiert Regionen und Agenten in jedem Physik-Frame.

source: Reference to a specific navigation region that can hold navigation mesh data. The region can be enabled / disabled or the use restricted with a navigation layer bitmask.
de: Referenz auf eine bestimmte Navigationsregion, die Navigations-Mesh-Daten enthalten kann. Die Region kann mit einer Navigations-Ebenen-Bitmaske aktiviert / deaktiviert oder ihre Verwendung eingeschränkt werden.

source: Reference to a specific navigation link that connects two navigation mesh positions over arbitrary distances.
de: Referenz auf eine bestimmte Navigationsverknüpfung, die zwei Mesh-Positionen über beliebige Entfernungen miteinander verbindet.
zh_cn: 引用指定的导航链接，能够将两个导航网格上的位置进行连接，无视距离。
zh_tw: 引用指定的導覽連結，能夠將兩個導覽網格上的位置進行連接，無視距離。

source: Reference to a specific avoidance agent. The avoidance is defined by a radius value.
de: Verweis auf einen bestimmten Ausweichagenten. Das Ausweichverhalten wird durch einen Radiuswert definiert.

source: Reference to a specific avoidance obstacle used to affect and constrain the avoidance velocity of agents.
de: Referenz auf ein bestimmtes Ausweichhindernis, um die Ausweichgeschwindigkeit der Agenten zu beeinflussen und einzuschränken.

source: The following scene tree nodes are available as helpers to work with the NavigationServer3D API.
de: Die folgenden Nodes des Szenenbaums sind als Hilfsmittel für die Arbeit mit der NavigationServer3D API verfügbar.

source: A Node that holds a Navigation Mesh resource that defines a navigation mesh for the NavigationServer3D.
de: Ein Node, der eine Navigation Mesh-Ressource enthält, die ein Navigations-Mesh für den NavigationServer3D definiert.
zh_cn: 存放 Navigation Mesh 资源的节点，该资源定义的是 NavigationServer3D 中的导航网格。
zh_tw: 存放 Navigation Mesh 資源的節點，該資源定義的是 NavigationServer3D 中的導覽網格。

source: The region can be enabled / disabled.
de: Die Region kann aktiviert / deaktiviert werden.
zh_cn: 区块可以启用/禁用。
zh_tw: 區塊可以啟用/禁用。

source: The use in pathfinding can be further restricted through the ``navigation_layers`` bitmask.
de: Die Verwendung in der Wegfindung kann durch die Bitmaske ``navigation_layers`` weiter eingeschränkt werden.
zh_cn: 通过 ``navigation_layers`` 掩码，可以对其在寻路中的使用做进一步的限制。

source: The NavigationServer3D will join the navigation meshes of regions by proximity for a combined navigation mesh.
de: Der NavigationServer3D verbindet die Navigations-Meshes der Regionen nach ihrer Nähe zu einem kombinierten Navigations-Mesh.

source: A Node that connects two positions on navigation meshes over arbitrary distances for pathfinding.
de: Ein Node, der zwei Positionen auf Navigations-Meshes über beliebige Entfernungen zur Wegfindung verbindet.

source: The link can be enabled / disabled.
de: Die Verknüpfung kann aktiviert/deaktiviert werden.
zh_cn: 链接可以启用/禁用。
zh_tw: 連結可以啟用/禁用。

source: The link can be made one-way or bidirectional.
de: Die Verknüpfung kann in eine Richtung oder in beide Richtungen erfolgen.
zh_cn: 链接可以设为单向或双向。
zh_tw: 連結可以設為單向或雙向。

source: Links tell the pathfinding that a connection exists and at what cost. The actual agent handling and movement needs to happen in custom scripts.
de: Verknüpfungen teilen der Wegfindung mit, dass eine Verbindung besteht und mit welchen Kosten. Die eigentliche Agentenbehandlung und -bewegung muss in benutzerdefinierten Skripten erfolgen.
zh_cn: 链接会告诉寻路存在这样的连接、相关的消耗如何。实际的代理处理以及移动需要在自定义脚本中实现。
zh_tw: 連結會告訴尋路存在這樣的連接、相關的消耗如何。實際的代理處理以及移動需要在自訂腳本中實作。

source: A helper Node used to facilitate common NavigationServer3D API calls for pathfinding and avoidance. Use this Node with a Node3D inheriting parent Node.
de: Ein Helfer-Node, der verwendet wird, um allgemeine NavigationServer3D API-Aufrufe für Pfadfindung und -ausweichen zu erleichtern. Verwenden Sie diesen Node mit einem Parent-Node der von Node3D erbt.

source: A Node that can be used to affect and constrain the avoidance velocity of avoidance enabled agents. This Node does NOT affect the pathfinding of agents. You need to change the navigation meshes for that instead.
de: Ein Node, der verwendet werden kann, um die Ausweichgeschwindigkeit von ausweichfähigen Agenten zu beeinflussen und einzuschränken. Dieser Node hat KEINEN Einfluss auf die Wegfindung von Agenten. Sie müssen stattdessen die Navigations-Meshes für diese ändern.

source: The 3D navigation meshes are defined with the following resources:
de: Die 3D-Navigationsmeshes werden mit den folgenden Ressourcen definiert:
zh_cn: 3D 导航网格由以下资源定义：
zh_tw: 填寫下列設定：

source: :ref:`NavigationMesh<class_NavigationMesh>` Resource
de: :ref:`NavigationMesh<class_NavigationMesh>`-Ressource
zh_cn: :ref:`NavigationMesh<class_NavigationMesh>` 资源
zh_tw: :ref:`String <class_String>`

source: A resource that holds 3D navigation mesh data. It provides 3D geometry baking options to define navigation areas inside the Editor as well as at runtime.
de: Eine Ressource, die 3D-Navigations-Mesh-Daten enthält. Sie bietet Optionen zum Backen von 3D-Geometrie, um Navigationsbereiche sowohl im Editor als auch zur Laufzeit zu definieren.

source: The NavigationRegion3D Node uses this resource to define its navigation area.
de: Der NavigationRegion3D-Node verwendet diese Ressource, um seinen Navigationsbereich zu definieren.
zh_cn: NavigationRegion3D 节点使用该资源定义其导航区域。
zh_tw: NavigationRegion3D 節點使用該資源定義其導覽區域。

source: The NavigationServer3D uses this resource to update the navigation mesh of individual regions.
de: Der NavigationServer3D verwendet diese Ressource, um das Navigations-Mesh einzelner Regionen zu aktualisieren.
zh_cn: NavigationServer3D 使用该资源更新各个区块的导航网格。

source: The GridMap Editor uses this resource when specific navigation meshes are defined for each grid cell.
de: Der GridMap-Editor verwendet diese Ressource, wenn für jede Rasterzelle spezifische Meshes für die Navigation definiert werden.

source: You can see how 3D navigation works in action using the `3D Navigation demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navigation>`__.
de: Sie können sehen, wie die 3D-Navigation in Aktion funktioniert, indem Sie das `3D Navigation-Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navigation>`__ verwenden.
zh_cn: 可以使用 `3D 导航演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navigation>`__\ 了解 3D 导航如何运作。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Setup for 3D scene
de: Einrichtung für 3D-Szenen
zh_cn: 3D 场景的设置
zh_tw: 匯入 3D 場景

source: The following steps show a basic setup for minimal viable navigation in 3D. It uses the NavigationServer3D and a NavigationAgent3D for path movement.
de: Die folgenden Schritte zeigen einen grundlegenden Aufbau für eine minimal funktionsfähige Navigation in 3D. Es verwendet den NavigationServer3D und einen NavigationAgent3D für die Pfadbewegung.

source: Add a NavigationRegion3D Node to the scene.
de: Fügen Sie einen NavigationRegion3D-Node zur Szene hinzu.
zh_cn: 在场景中添加一个 NavigationRegion3D 节点。
zh_tw: 在場景中新增一個 NavigationRegion3D 節點。

source: Click on the region node and add a new :ref:`NavigationMesh<class_NavigationMesh>` Resource to the region node.
de: Klicken Sie auf den Regions-Node und fügen Sie eine neue :ref:`NavigationMesh<class_NavigationMesh>`-Ressource zu dem Regions-Node hinzu.
zh_cn: 单击该区块节点，向该节点添加一个新的 :ref:`NavigationMesh<class_NavigationMesh>` 资源。
zh_tw: 按一下該區塊節點，向該節點新增一個新的 :ref:`NavigationMesh<class_NavigationMesh>` 資源。

source: Add a new MeshInstance3D node as a child of the region node.
de: Fügen Sie einen neuen MeshInstance3D-Node als Child des Regions-Nodes hinzu.
zh_cn: 将一个新的 MeshInstance3D 节点添加为该区块节点的子节点。
zh_tw: 將腳本附加到節點。

source: Select the MeshInstance3D node and add a new PlaneMesh and increase the xy size to 10.
de: Wählen Sie den Node MeshInstance3D, fügen Sie ein neues PlaneMesh hinzu und erhöhen Sie die xy-Größe auf 10.
zh_cn: 选中该 MeshInstance3D 节点，添加一个新的 PlaneMesh 并将其 XY 大小设为 10。
zh_tw: 選中該 MeshInstance3D 節點，新增一個新的 PlaneMesh 並將其 XY 大小設為 10。

source: Select the region node again and press the "Bake Navmesh" button on the top bar.
de: Wählen Sie den Node der Region erneut aus und drücken Sie die Schaltfläche "Navmesh backen" in der oberen Leiste.
zh_cn: 再次选中该区块节点，点击顶栏中的“烘焙导航网格”按钮。
zh_tw: 再次選中該區塊節點，點擊頂欄中的“烘焙導覽網格”按鈕。

source: Now a transparent navigation mesh appears that hovers some distance on top of the PlaneMesh.
de: Jetzt erscheint ein transparentes Navigations-Mesh, das in einiger Entfernung über dem PlaneMesh schwebt.

source: Add a CharacterBody3D node in the scene with a basic collision shape and some mesh for visuals.
de: Fügen Sie einen CharacterBody3D-Node in der Szene mit einer einfachen Collision Shape und einem Mesh zur Visualisierung hinzu.
zh_cn: 在场景中添加一个 CharacterBody3D 节点，设置基础的碰撞形状，添加一些网格方便观察。
zh_tw: 在場景中新增一個 CharacterBody3D 節點，設定基礎的碰撞形狀，新增一些網格方便觀察。

source: Add a NavigationAgent3D node below the character node.
de: Fügen Sie einen NavigationAgent3D-Node unterhalb des Charakter-Nodes hinzu.
zh_cn: 在该角色节点下添加一个 NavigationAgent3D 节点。
zh_tw: 在該角色節點下新增一個 NavigationAgent3D 節點。

source: Add a script to the CharacterBody3D node with the following content. We make sure to set a movement target after the scene has fully loaded and the NavigationServer had time to sync. Also, add a Camera3D and some light and environment to see something.
de: Fügen Sie dem CharacterBody3D-Node ein Skript mit dem folgenden Inhalt hinzu. Wir stellen sicher, dass wir ein Bewegungsziel setzen, nachdem die Szene vollständig geladen wurde und der NavigationServer Zeit hatte, sich zu synchronisieren. Füge auch eine Camera3D und etwas Licht und Umgebung hinzu, um etwas zu sehen.
zh_cn: 为 CharacterBody3D 节点添加一个脚本，内容如下。场景完全加载后，我们确保设置移动目标，NavigationServer 有时间进行同步。另外，添加一个 Camera3D、一些灯光以及环境，这样才能够看到东西。
zh_tw: 為 CharacterBody3D 節點新增一個腳本，內容如下。場景完全載入後，我們確保設定移動目標，NavigationServer 有時間進行同步。另外，新增一個 Camera3D、一些燈光以及環境，這樣才能夠看到東西。

source: On the first frame the NavigationServer map has not synchronized region data and any path query will return empty. Wait for the NavigationServer synchronization by awaiting one frame in the script.
de: Beim ersten Frame hat die NavigationServer-Map die Regionsdaten noch nicht synchronisiert und jede Pfadabfrage liefert "leer" zurück. Warten Sie auf die NavigationServer-Synchronisierung, indem Sie im Skript ein Frame abwarten.

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: NavMap RID
zh_cn: 导航地图 RID
zh_tw: 導覽地圖 RID

source: NavRegion RID
zh_cn: 导航区块 RID
zh_tw: 導覽區塊 RID

source: NavLink RID
zh_cn: 导航链接 RID
zh_tw: 導覽連結 RID

source: NavAgent RID
zh_cn: 导航代理 RID
zh_tw: 導覽代理 RID

source: NavObstacle RID
zh_cn: 导航障碍物 RID

source: :ref:`NavigationRegion3D<class_NavigationRegion3D>` Node
zh_cn: :ref:`NavigationRegion3D<class_NavigationRegion3D>` 节点
zh_tw: :ref:`String <class_String>`

source: :ref:`NavigationLink3D<class_NavigationLink3D>` Node
zh_cn: :ref:`NavigationLink3D<class_NavigationLink3D>` 节点
zh_tw: :ref:`String <class_String>`

source: :ref:`NavigationAgent3D<class_NavigationAgent3D>` Node
zh_cn: :ref:`NavigationAgent3D<class_NavigationAgent3D>` 节点
zh_tw: :ref:`String <class_String>`

source: :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` Node
zh_cn: :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` 节点
zh_tw: :ref:`Dictionary <class_Dictionary>`

source: :ref:`Astar3D<class_Astar3D>`
zh_tw: :ref:`Vector3 <class_Vector3>`

source: :ref:`NavigationServer3D<class_NavigationServer3D>`
zh_tw: :ref:`String <class_String>`
