Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationservers.po
Languages: de

source: Using NavigationServer
de: Verwendung des NavigationServer

source: 2D and 3D version of the NavigationServer are available as :ref:`NavigationServer2D<class_NavigationServer2D>` and :ref:`NavigationServer3D<class_NavigationServer3D>` respectively.
de: 2D und 3D Versionen des NavigationServers sind als :ref:`NavigationServer2D<class_NavigationServer2D>` und :ref:`NavigationServer3D<class_NavigationServer3D>` verfügbar.

source: Both 2D and 3D use the same NavigationServer with NavigationServer3D being the primary server. The NavigationServer2D is a frontend that converts 2D positions into 3D positions and back. Hence it is entirely possible (if not a little cumbersome) to exclusively use the NavigationServer3D API for 2D navigation.
de: Sowohl 2D als auch 3D verwenden denselben NavigationServer, wobei der NavigationServer3D der primäre Server ist. Der NavigationServer2D ist ein Frontend, das 2D-Positionen in 3D-Positionen und zurück konvertiert. Daher ist es durchaus möglich (wenn auch etwas umständlich), ausschließlich die NavigationServer3D-API für die 2D-Navigation zu verwenden.

source: Communicating with the NavigationServer
de: Kommunikation mit dem NavigationServer

source: To work with the NavigationServer means to prepare parameters for a **query** that can be sent to the NavigationServer for updates or requesting data.
de: Mit dem NavigationServer zu arbeiten bedeutet, Parameter für eine **Abfrage** vorzubereiten, die an den NavigationServer gesendet werden kann, um Daten zu aktualisieren oder abzufragen.

source: To reference the internal NavigationServer objects like maps, regions and agents RIDs are used as identification numbers. Every navigation related node in the scene tree has a function that returns the RID for this node.
de: Um die internen NavigationServer-Objekte wie Karten, Regionen und Agenten zu referenzieren, werden RIDs als Identifikationsnummern verwendet. Jeder navigationsbezogene Node im Szenenbaum hat eine Funktion, um die RID für diesen Node zurückzugeben.

source: Threading and Synchronization
de: Threading und Synchronisierung

source: The NavigationServer does not update every change immediately but waits until the end of the **physics frame** to synchronize all the changes together.
de: Der NavigationServer aktualisiert nicht jede Änderung sofort, sondern wartet bis zum Ende des **Physik-Frames**, um alle Änderungen zusammen zu synchronisieren.

source: Waiting for synchronization is required to apply changes to all maps, regions and agents. Synchronization is done because some updates like a recalculation of the entire navigation map are very expensive and require updated data from all other objects. Also the NavigationServer uses a **threadpool** by default for some functionality like avoidance calculation between agents.
de: Das Warten auf die Synchronisierung ist erforderlich, um Änderungen auf alle Maps, Regionen und Agenten anzuwenden. Die Synchronisation wird durchgeführt, weil einige Aktualisierungen wie die Neuberechnung der gesamten Navigations-Map sehr teuer sind und aktualisierte Daten von allen anderen Objekten erfordern. Außerdem verwendet der NavigationServer standardmäßig einen **Threadpool** für einige Funktionen wie die Ausweichberechnung zwischen Agenten.

source: Waiting is not required for most ``get()`` functions that only request data from the NavigationServer without making changes. Note that not all data will account for changes made in the same frame. E.g. if an avoidance agent changed the navigation map this frame the ``agent_get_map()`` function will still return the old map before the synchronization. The exception to this are nodes that store their values internally before sending the update to the NavigationServer. When a getter on a node is used for a value that was updated in the same frame it will return the already updated value stored on the node.
de: Für die meisten ``get()`` Funktionen, die nur Daten vom NavigationServer abfragen, ohne Änderungen vorzunehmen, ist eine Wartezeit nicht erforderlich. Beachten Sie, dass nicht alle Daten Änderungen berücksichtigen, die im selben Frame gemacht wurden. Wenn z.B. ein Ausweichagent die Navigations-Map in diesem Frame geändert hat, wird die ``agent_get_map()`` Funktion immer noch die alte Map vor der Synchronisation zurückgeben. Die Ausnahme hiervon sind Nodes, die ihre Werte intern speichern, bevor sie die Aktualisierung an den NavigationServer senden. Wenn ein Getter auf einem Node für einen Wert verwendet wird, der im selben Frame aktualisiert wurde, wird er den bereits aktualisierten Wert zurückgeben, der auf dem Node gespeichert ist.

source: The NavigationServer is **thread-safe** as it places all API calls that want to make changes in a queue to be executed in the synchronization phase. Synchronization for the NavigationServer happens in the middle of the physics frame after scene input from scripts and nodes are all done.
de: Der NavigationServer ist **thread-safe**, da er alle API-Aufrufe, die Änderungen vornehmen wollen, in eine Warteschlange stellt, die in der Synchronisierungsphase ausgeführt wird. Die Synchronisierung für den NavigationServer erfolgt in der Mitte des Physik-Frames, nachdem die Szeneneingabe von Skripten und Nodes abgeschlossen ist.

source: The important takeaway is that most NavigationServer changes take effect after the next physics frame and not immediately. This includes all changes made by navigation related nodes in the scene tree or through scripts.
de: Wichtig ist, dass die meisten NavigationServer-Änderungen nicht sofort, sondern erst nach dem nächsten Physik-Frame wirksam werden. Dies gilt auch für alle Änderungen, die durch navigationsbezogene Nodes im Szenenbaum oder durch Skripte vorgenommen werden.

source: The following functions will be executed in the synchronization phase only:
de: Die folgenden Funktionen werden nur in der Synchronisationsphase ausgeführt:

source: 2D and 3D NavigationServer differences
de: Unterschiede zwischen 2D- und 3D-NavigationServern

source: NavigationServer2D and NavigationServer3D are equivalent in functionality for their dimension and both use the same NavigationServer behind the scene.
de: NavigationServer2D und NavigationServer3D sind in ihrer Funktionalität für ihre Dimension gleichwertig und verwenden beide den gleichen NavigationServer hinter der Bühne.

source: Strictly technical a NavigationServer2D is a myth. The NavigationServer2D is a frontend to facilitate conversions of ``Vector2(x, y)`` to ``Vector3(x, 0.0, z)`` and back for the NavigationServer3D API. 2D uses a flat 3D mesh pathfinding and the NavigationServer2D facilitates the conversions. When a guide uses just NavigationServer without the 2D or 3D suffix it usually works for both servers by exchange ``Vector2(x, y)`` with ``Vector3(x, 0.0, z)`` or reverse.
de: Streng technisch gesehen ist ein NavigationServer2D ein Mythos. Der NavigationServer2D ist ein Frontend, das die Konvertierung von ``Vector2(x, y)`` nach ``Vector3(x, 0.0, z)`` und zurück für die NavigationServer3D API erleichtert. 2D benutzt eine flache 3D Mesh-Wegfindung und der NavigationServer2D erleichtert die Konvertierungen. Wenn ein Guide nur NavigationServer ohne das 2D oder 3D Suffix benutzt, funktioniert es normalerweise für beide Server, indem ``Vector2(x, y)`` mit ``Vector3(x, 0.0, z)`` oder umgekehrt ausgetauscht wird.

source: Technically it is possible to use the tools for creating navigation meshes in one dimension for the other dimension, e.g. baking a 2D navigation mesh with the 3D NavigationMesh when using flat 3D source geometry or creating 3D flat navigation meshes with the polygon outline draw tools of NavigationRegion2D and NavigationPolygons.
de: Technisch ist es möglich, die Tools zur Erstellung von Navigationsmeshes in einer Dimension für die andere Dimension zu verwenden, z.B. das Backen eines 2D-Navigationsmeshes mit dem 3D NavigationMesh bei Verwendung von flacher 3D-Quellgeometrie oder die Erstellung von flachen 3D-Navigationsmeshes mit den Polygonumriss-Zeichentools von NavigationRegion2D und NavigationPolygons.

source: Any RID created with the NavigationServer2D API works on the NavigationServer3D API as well and both 2D and 3D avoidance agents can exist on the same map.
de: Jede mit der NavigationServer2D-API erstellte RID funktioniert auch mit der NavigationServer3D-API, und sowohl 2D- als auch 3D-Ausweichagenten können auf derselben Map existieren.

source: Regions created in 2D and 3D will merge their navigation meshes when placed on the same map and merge conditions apply. The NavigationServer does not discriminate between NavigationRegion2D and NavigationRegion3D nodes as both are regions on the server. By default those nodes register on different navigation maps so this merge can only happen when maps are changed manually e.g. with scripts.
de: Regionen, die in 2D und 3D erstellt wurden, verschmelzen ihre Navigations-Meshes, wenn sie auf derselben Map platziert werden und die Verschmelzungsbedingungen gelten. Der NavigationServer unterscheidet nicht zwischen NavigationRegion2D und NavigationRegion3D-Nodes, da beide Regionen auf dem Server sind. Standardmäßig werden diese Nodes auf verschiedenen Navigations-Maps registriert, so dass die Zusammenführung nur dann erfolgen kann, wenn die Maps manuell geändert werden, z. B. mit Skripten.

source: Actors with avoidance enabled will avoid both 2D and 3D avoidance agents when placed on the same map.
de: Akteure mit aktivierter Ausweichfunktion meiden sowohl 2D- als auch 3D-Ausweichagenten, wenn sie sich auf der gleichen Map befinden.

source: It is not possible to use NavigationServer2D while disabling 3D on a Godot custom build.
de: Es ist nicht möglich, NavigationServer2D zu verwenden, während 3D auf einem Godot Custom Build deaktiviert ist.

source: Waiting for synchronization
de: Warten auf die Synchronisierung

source: At the start of the game, a new scene or procedural navigation changes any path query to a NavigationServer will return empty or wrong.
de: Beim Start des Spiels, einer neuen Szene oder einer prozeduralen Navigationsänderung gibt jede Pfadabfrage an einen NavigationServer "leer" oder "falsch" zurück.

source: The navigation map is still empty or not updated at this point. All nodes from the scene tree need to first upload their navigation related data to the NavigationServer. Each added or changed map, region or agent need to be registered with the NavigationServer. Afterward the NavigationServer requires a **physics frame** for synchronization to update the maps, regions and agents.
de: Die Navigations-Map ist zu diesem Zeitpunkt noch leer oder nicht aktualisiert. Alle Nodes aus dem Szenenbaum müssen zunächst ihre navigationsbezogenen Daten auf den NavigationServer hochladen. Jede hinzugefügte oder geänderte Map, Region oder Agent muss beim NavigationServer registriert werden. Danach benötigt der NavigationServer einen **Physik-Frame** zur Synchronisation, um die Maps, Regionen und Agenten zu aktualisieren.

source: One workaround is to make a deferred call to a custom setup function (so all nodes are ready). The setup function makes all the navigation changes, e.g. adding procedural stuff. Afterwards the function waits for the next physics frame before continuing with path queries.
de: Ein Workaround besteht darin, eine benutzerdefinierte Setup-Funktion zeitversetzt aufzurufen (damit alle Nodes bereit sind). Die Setup-Funktion nimmt alle Navigationsänderungen vor, z.B. das Hinzufügen von prozeduralen Elementen. Danach wartet die Funktion auf den nächsten Physik-Frame, bevor sie mit der Pfadabfrage fortfährt.

source: Server Avoidance Callbacks
de: Server-Ausweich-Callbacks

source: If RVO avoidance agents are registered for avoidance callbacks the NavigationServer dispatches their ``velocity_computed`` signals just before the PhysicsServer synchronization.
de: Wenn RVO-Vermeidungsagenten für Ausweich-Callbacks registriert sind, sendet der NavigationServer ihre ``velocity_computed``-Signale kurz vor der Synchronisation mit dem PhysicsServer.

source: To learn more about NavigationAgents see :ref:`doc_navigation_using_navigationagents`.
de: Weitere Informationen zu NavigationAgents finden Sie unter :ref:`doc_navigation_using_navigationagents`.

source: The simplified order of execution for NavigationAgents that use avoidance:
de: Die vereinfachte Ausführungsreihenfolge für NavigationAgents, die Ausweichmanöver verwenden:

source: physics frame starts.
de: Physik-Frame beginnt.

source: ``set_velocity()`` on NavigationAgent Node.
de: ``set_velocity()`` auf NavigationAgent-Node.

source: Agent sends velocity and position to NavigationServer.
de: Der Agent sendet Geschwindigkeit und Position an den NavigationServer.

source: NavigationServer waits for synchronization.
de: Der NavigationServer wartet auf die Synchronisierung.

source: NavigationServer synchronizes and computes avoidance velocities for all registered avoidance agents.
de: Der NavigationServer synchronisiert und berechnet die Ausweichgeschwindigkeiten für alle registrierten Ausweichagenten.

source: NavigationServer sends safe velocity vector with signals for each registered avoidance agents.
de: Der Navigationsserver sendet einen sicheren Geschwindigkeitsvektor mit Signalen für jeden registrierten Ausweichagenten.

source: Agents receive the signal and move their parent e.g. with ``move_and_slide`` or ``linear_velocity``.
de: Agenten empfangen das Signal und bewegen ihren Parent z.B. mit ``move_and_slide`` oder ``linear_velocity``.

source: PhysicsServer synchronizes.
de: PhysicsServer synchronisiert.

source: physics frame ends.
de: Physik-Frame endet.

source: Therefore moving a physicsbody actor in the callback function with the safe velocity is perfectly thread- and physics-safe as all happens inside the same physics frame before the PhysicsServer commits to changes and does its own calculations.
de: Daher ist das Bewegen eines Physik-Body-Akteurs in der Callback-Funktion mit der sicheren Geschwindigkeit vollkommen thread- und physik-safe, da alles innerhalb desselben Physik-Frames geschieht, bevor der PhysicsServer die Änderungen festlegt und seine eigenen Berechnungen durchführt.

source: Translation status
de: Übersetzungsstatus
