Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_connecting_navmesh.po
Languages: de, zh_tw

source: Connecting navigation meshes
de: Verbinden von Navigations-Meshes

source: Different NavigationMeshes are automatically merged by the NavigationServer when at least two vertex positions of one edge exactly overlap.
de: Verschiedene NavigationMeshes werden vom NavigationServer automatisch zusammengeführt, wenn sich mindestens zwei Vertex-Positionen einer Kante genau überschneiden.
zh_tw: 當一邊的至少兩個頂點位置完全重疊時，導覽伺服器會自動合併不同的導覽網格。

source: To connect over arbitrary distances see :ref:`doc_navigation_using_navigationlinks`.
de: Für Verbindungen über beliebige Entfernungen siehe :ref:`doc_navigation_using_navigationlinks`.
zh_tw: 若要連接任意距離，請參閱 :ref:`doc_navigation_using_navigationlinks`。

source: The same is true for multiple NavigationPolygon resources. As long as their outline points overlap exactly the NavigationServer will merge them. NavigationPolygon outlines must be from different NavigationPolygon resources to connect.
de: Das gleiche gilt für mehrere NavigationPolygon-Ressourcen. Solange sich ihre Umrisspunkte genau überschneiden, wird der NavigationServer sie zusammenführen. NavigationPolygon-Umrisse müssen aus verschiedenen NavigationPolygon-Ressourcen stammen, um verbunden werden zu können.
zh_tw: 對於多個 NavigationPolygon 資源也是如此。只要它們的輪廓點完全重疊，導覽伺服器就會合併它們。 NavigationPolygon 輪廓必須來自不同的 NavigationPolygon 資源才能連接。

source: Overlapping or intersecting outlines on the same NavigationPolygon will fail the navigation mesh creation. Overlapping or intersecting outlines from different NavigationPolygons will often fail to create the navigation region edge connections on the NavigationServer and should be avoided.
de: Überlappende oder sich schneidende Umrisse auf demselben NavigationPolygon führen zu einem Fehlschlag bei der Erstellung des Meshs. Überlappende oder sich überschneidende Umrisse von verschiedenen NavigationsPolygonen führen häufig dazu, dass die Randverbindungen der Navigationsregion auf dem NavigationServer nicht erstellt werden können, und sollten vermieden werden.
zh_tw: 同一 NavigationPolygon 上的重疊或相交輪廓將導致導覽網格建立失敗。來自不同導覽多邊形的重疊或相交輪廓通常無法在導覽伺服器上建立導覽區域邊緣連接，因此應避免。

source: Exactly means exactly for the vertex position merge. Small float errors that happen quite regularly with imported meshes will prevent a successful vertex merge.
de: Exakt bedeutet exakt für die Zusammenführung der Vertexpositionen. Kleine Float-Fehler, die bei importierten Meshes regelmäßig auftreten, verhindern ein erfolgreiches Zusammenführen von Vertices.
zh_tw: 精確意味著精確地進行頂點位置合併。匯入的網格經常發生的小浮動錯誤將阻止成功的頂點合併。

source: Alternatively navigation meshes are not merged but still considered as **connected** by the NavigationServer when their edges are nearly parallel and within distance to each other. The connection distance is defined by the ``edge_connection_margin`` for each navigation map. In many cases navigation mesh edges cannot properly connect when they partly overlap. Better avoid any navigation mesh overlap at all time for a consistent merge behavior.
de: Alternativ werden Meshes nicht zusammengeführt, sondern vom NavigationServer als **verbunden** betrachtet, wenn ihre Kanten nahezu parallel und in einem gewissen Abstand zueinander verlaufen. Der Verbindungsabstand wird durch den ``edge_connection_margin`` für jede Navigations-Map definiert. In vielen Fällen können die Kanten des Navigations-Mesh nicht richtig verbunden werden, wenn sie sich teilweise überlappen. Um ein konsistentes Zusammenführungsverhalten zu erreichen, sollte eine Überlappung der Mesh-Kanten immer vermieden werden.

source: If navigation debug is enabled and the NavigationServer active the established navigation mesh connections will be visualized. See :ref:`doc_navigation_debug_tools` for more info about navigation debug options.
de: Wenn Navigations-Debugging aktiviert und der NavigationServer aktiv ist, werden die hergestellten Mesh-Verbindungen visualisiert. Siehe :ref:`doc_navigation_debug_tools` für weitere Informationen über Navigations-Debug-Optionen.
zh_tw: 如果啟用了導覽偵錯並且導覽伺服器處於活動狀態，則已建立的導覽網格連線將視覺化。有關導覽偵錯選項的更多信息，請參閱 doc_navigation_debug_tools。

source: The default 2D ``edge_connection_margin`` can be changed in the ProjectSettings under ``navigation/2d/default_edge_connection_margin``.
de: Die Default-2D-``edge_connection_margin`` kann in den Projekteinstellungen unter ``navigation/2d/default_edge_connection_margin`` geändert werden.
zh_tw: “navigation/2d/default_edge_connection_margin”下的 ProjectSettings 中變更。

source: The default 3D ``edge_connection_margin`` can be changed in the ProjectSettings under ``navigation/3d/default_edge_connection_margin``.
de: Die Default-3D-``edge_connection_margin`` kann in den Projekteinstellungen unter ``navigation/3d/default_edge_connection_margin`` geändert werden.
zh_tw: 預設的 3D “edge_connection_margin” 可以在“navigation/3d/default_edge_connection_margin”下的 ProjectSettings 中變更。

source: The edge connection margin value of any navigation map can also be changed at runtime with the NavigationServer API.
de: Der Abstandswert der Kantenverbindung einer beliebigen Navigationskarte kann auch zur Laufzeit mit der NavigationServer API geändert werden.
zh_tw: 任何導覽地圖的邊緣連線邊距值也可以在執行時使用 NavigationServer API 進行變更。

source: Changing the edge connection margin will trigger a full update of all navigation mesh connections on the NavigationServer.
de: Eine Änderung des Abstands einer Kantenverbindung löst eine vollständige Aktualisierung aller Mesh-Verbindungen auf dem Navigationsserver aus.
zh_tw: 更改邊緣連接邊距將觸發導覽伺服器上所有導覽網格連接的完整更新。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
