Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationagents.po
Languages: de, zh_tw

source: Avoidance exists in its own space and has no information from navigation meshes or physics collision. Behind the scene avoidance agents are just circles with different radius on a flat 2D plane or spheres in an otherwise empty 3D space. NavigationObstacles can be used to add some environment constrains to the avoidance simulation, see :ref:`doc_navigation_using_navigationobstacles`.
de: Ausweichmanöver existieren in ihrem eigenen Raum und haben keine Informationen von Navigations-Meshes oder physikalischen Kollisionen. Unter der Haube sind Ausweichagenten einfach Kreise mit verschiedenen Radien auf einer flachen 2D-Ebene oder Kugeln in einem ansonsten leeren 3D-Raum. NavigationObstacles können verwendet werden, um einige Umgebungseinschränkungen zur Ausweichsimulation hinzuzufügen, siehe :ref:`doc_navigation_using_navigationobstacles`.
zh_tw: 迴避存在於自己的空間中，並且沒有來自導覽網格或物理碰撞的資訊。幕後迴避代理只是平坦 2D 平面上不同半徑的圓或空的 3D 空間中的球體。 NavigationObstacles 可用於為迴避模擬新增一些環境約束，請參閱 :ref:`doc_navigation_using_navigationobstacles`。

source: Avoidance does not affect the pathfinding. It should be seen as an additional option for constantly moving objects that cannot be (re)baked to a navigation mesh efficiently in order to move around them.
de: Das Ausweichen hat keinen Einfluss auf die Wegfindung. Es sollte als zusätzliche Option für sich ständig bewegende Objekte betrachtet werden, die nicht effizient in ein Navigations-Mesh (um)gebacken werden können, um sich um sie herum zu bewegen.
zh_tw: 迴避不影響尋路。它應該被視為不斷移動的物件的附加選項，這些物件無法有效地（重新）烘焙到導覽網格以便在它們周圍移動。

source: Using the NavigationAgent ``enable_avoidance`` property is the preferred option to toggle avoidance. The following code snippets can be used to toggle avoidance on agents, create or delete avoidance callbacks or switch avoidance modes.
de: Die Verwendung der NavigationAgent-Property ``enable_avoidance`` ist die bevorzugte Option zum Ein- und Ausschalten des Ausweichmodus. Die folgenden Codeschnipsel können verwendet werden, um das Ausweichen bei Agenten zu aktivieren, Ausweich-Callbacks zu erstellen oder zu löschen oder den Ausweichmodus zu wechseln.
zh_tw: 使用 NavigationAgent ``enable_avoidance`` 屬性是切換迴避的首選選項。以下程式碼片段可用於切換代理程式上的迴避、建立或刪除迴避回呼或切換迴避模式。

source: NavigationAgent Script Templates
de: NavigationAgent-Skriptvorlagen
zh_tw: 建立腳本樣板

source: The following sections provides script templates for nodes commonly used with NavigationAgents.
de: Die folgenden Abschnitte enthalten Skriptvorlagen für Nodes, die häufig mit NavigationAgents verwendet werden.
zh_tw: 以下部分提供了通常與NavigationAgents 一起使用的節點的腳本模板。

source: Actor as Node3D
de: Akteur als Node3D
zh_tw: 角色為 Node3D

source: This script adds basic navigation movement to a :ref:`Node3D <class_Node3D>` with a :ref:`NavigationAgent3D <class_NavigationAgent3D>` child node.
de: Dieses Skript fügt grundlegende Navigationsbewegungen zu einem :ref:`Node3D <class_Node3D>` mit einem :ref:`NavigationAgent3D <class_NavigationAgent3D>`-Node hinzu.

source: Actor as CharacterBody3D
de: Akteur als CharacterBody3D
zh_tw: 角色為 CharacterBody3D

source: This script adds basic navigation movement to a :ref:`CharacterBody3D <class_CharacterBody3D>` with a :ref:`NavigationAgent3D <class_NavigationAgent3D>` child node.
de: Dieses Skript fügt grundlegende Navigationsbewegungen zu einem :ref:`CharacterBody3D <class_CharacterBody3D>` mit einem :ref:`NavigationAgent3D <class_NavigationAgent3D>`-Child-Node hinzu.

source: Actor as RigidBody3D
de: Akteur als RigidBody3D
zh_tw: 角色為 RigidBody3D

source: This script adds basic navigation movement to a :ref:`RigidBody3D <class_RigidBody3D>` with a :ref:`NavigationAgent3D <class_NavigationAgent3D>` child node.
de: Dieses Skript fügt grundlegende Navigationsbewegungen zu einem :ref:`RigidBody3D <class_RigidBody3D>` mit einem :ref:`NavigationAgent3D <class_NavigationAgent3D>`-Child-Node hinzu.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
