Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationagents.po
Languages: de, zh_tw

source: Using NavigationAgents
de: Verwenden von NavigationAgents
zh_tw: 使用 NavigationAgent

source: NavigationsAgents are helper nodes that combine functionality for pathfinding, path following and agent avoidance for a Node2D/3D inheriting parent node. They facilitate common calls to the NavigationServer API on behalf of the parent actor node in a more convenient manner for beginners.
de: NavigationsAgents sind Hilfs-Nodes, die Funktionalität für Wegfindung, Wegverfolgung und Agentenvermeidung für einen von Node2D/3D erbenden Parent-Node kombinieren. Sie erleichtern Anfängern gemeinsame Aufrufe der NavigationServer-API im Auftrag des übergeordneten Node-Akteurs auf bequemere Weise.
zh_tw: NavigationsAgents 是輔助節點，它結合了 Node2D/3D 繼承父節點的尋路、路徑追蹤和代理迴避功能。對於初學者來說，它們以更方便的方式代表父參與者節點促進對 NavigationServer API 的常見呼叫。

source: 2D and 3D version of NavigationAgents are available as :ref:`NavigationAgent2D<class_NavigationAgent2D>` and :ref:`NavigationAgent3D<class_NavigationAgent3D>` respectively.
de: 2D und 3D-Versionen von NavigationAgents sind als :ref:`NavigationAgent2D<class_NavigationAgent2D>` bzw. :ref:`NavigationAgent3D<class_NavigationAgent3D>` verfügbar.
zh_tw: 2D 和 3D 版本的 NavigationAgent 分別可用作:ref:`NavigationAgent2D<class_NavigationAgent2D>` 和:ref:`NavigationAgent3D<class_NavigationAgent3D>`。

source: New NavigationAgent nodes will automatically join the default navigation map on the :ref:`World2D<class_World2D>`/:ref:`World3D<class_World3D>`.
de: Neue NavigationAgent-Nodes werden automatisch der Standard-Navigations-Map auf der :ref:`World2D<class_World2D>`/:ref:`World3D<class_World3D>` hinzugefügt.

source: NavigationsAgent nodes are optional and not a hard requirement to use the navigation system. Their entire functionality can be replaced with scripts and direct calls to the NavigationServer API.
de: NavigationsAgent Nodes sind optional und keine zwingende Voraussetzung für die Nutzung des Navigationssystems. Ihre gesamte Funktionalität kann durch Skripte und direkte Aufrufe zur NavigationServer API ersetzt werden.
zh_tw: NavigationsAgent 節點是可選的，並不是使用導覽系統的硬性需求。它們的全部功能可以替換為腳本和對 NavigationServer API 的直接呼叫。

source: NavigationAgent Pathfinding
de: NavigationAgent Wegfindung
zh_tw: 導覽

source: NavigationAgents query a new navigation path on their current navigation map when their ``target_position`` is set with a global position.
de: NavigationAgents fragen einen neuen Navigationspfad auf ihrer aktuellen Navigations-Map ab, wenn ihre ``target_position`` auf eine globale Position gesetzt wird.
zh_tw: 當導覽代理程式的「target_position」設定為全域位置時，它們會在目前導覽地圖上查詢新的導覽路徑。

source: The result of the pathfinding can be influenced with the following properties.
de: Das Ergebnis der Wegfindung kann mit den folgenden Propertys beeinflusst werden.
zh_tw: 填寫下列設定：

source: The ``navigation_layers`` bitmask can be used to limit the navigation meshes that the agent can use.
de: Die Bitmaske ``navigation_layers`` kann verwendet werden, um die Navigations-Meshes einzuschränken, die der Agent verwenden kann.
zh_tw: 「navigation_layers」位元遮罩可用於限制代理可以使用的導覽網格。

source: The ``pathfinding_algorithm`` controls how the pathfinding travels through the navigation mesh polygons in the path search.
de: Der ``Wegfindung-Algorithmus`` steuert, wie die Wegfindung durch die Polygone des Navigation-Meshs bei der Wegfindung abläuft.
zh_tw: “pathfinding_algorithm” 控制路徑搜尋如何在路徑搜尋中穿過導覽網格多邊形。

source: The ``path_postprocessing`` sets if or how the raw path corridor found by the pathfinding is altered before it is returned.
de: ``path_postprocessing`` legt fest, ob oder wie der rohe Pfadkorridor, der durch die Wegfindung gefunden wurde, verändert wird, bevor er zurückgegeben wird.
zh_tw: “path_postprocessing”設定在返回之前是否或如何更改尋路找到的原始路徑走廊。

source: The ``path_metadata_flags`` enable the collection of additional path point meta data returned by the path.
de: Die ``path_metadata_flags`` ermöglichen das Sammeln zusätzlicher Metadaten des Pfadpunktes, die vom Pfad zurückgegeben werden.
zh_tw: ``path_metadata_flags`` 允許收集路徑返回的附加路徑點元資料。

source: Disabling path meta flags will disable related signal emissions on the agent.
de: Durch die Deaktivierung von Pfad-Meta-Flags werden die entsprechenden Signalemissionen auf dem Agenten deaktiviert.
zh_tw: 禁用路徑元旗標將禁用代理上的相關訊號發射。

source: NavigationAgent Pathfollowing
de: NavigationAgent Wegverfolgung
zh_tw: 導覽

source: After a ``target_position`` has been set for the agent, the next position to follow in the path can be retrieved with the ``get_next_path_position()`` function.
de: Nachdem eine ``Zielposition`` für den Agenten festgelegt wurde, kann die nächste Position, die auf dem Pfad zu verfolgen ist, mit der Funktion ``get_next_path_position()`` ermittelt werden.
zh_tw: 為代理程式設定「target_position」後，可以使用「get_next_path_position()」函式來擷取路徑中要遵循的下一個位置。

source: Once the next path position is received move the parent actor node of the agent towards this path position with your own movement code.
de: Sobald die nächste Pfadposition empfangen wurde, bewegen Sie den übergeordneten Node des Agenten mit Ihrem eigenen Bewegungscode zu dieser Pfadposition.
zh_tw: 收到下一個路徑位置後，使用您自己的移動程式碼將代理程式的父角色節點移向該路徑位置。

source: The navigation system never moves the parent node of a NavigationAgent. The movement is entirely in the hands of users and their custom scripts.
de: Das Navigationssystem verschiebt niemals den übergeordneten Node eines NavigationAgent. Die Bewegung liegt vollständig in den Händen der Benutzer und ihrer benutzerdefinierten Skripte.
zh_tw: 導覽系統永遠不會移動 NavigationAgent 的父節點。該動作完全掌握在使用者及其自訂腳本的手中。

source: NavigationAgents have their own internal logic to proceed with the current path and call for updates.
de: NavigationAgents haben ihre eigene interne Logik, um mit dem aktuellen Pfad fortzufahren und Aktualisierungen anzufordern.
zh_tw: 導覽代理有自己的內部邏輯來繼續目前路徑並呼叫更新。

source: The ``get_next_path_position()`` function is responsible for updating many of the agent's internal states and properties. The function should be repeatedly called *once* every ``physics_process`` until ``is_navigation_finished()`` tells that the path is finished. The function should not be called after the target position or path end has been reached as it can make the agent jitter in place due to the repeated path updates. Always check very early in script with ``is_navigation_finished()`` if the path is already finished.
de: Die Funktion ``get_next_path_position()`` ist für die Aktualisierung vieler interner Zustände und Propertys des Agenten verantwortlich. Die Funktion sollte wiederholt *einmal* in jedem ``physics_process`` aufgerufen werden, bis ``is_navigation_finished()`` mitteilt, dass der Pfad beendet ist. Die Funktion sollte nicht aufgerufen werden, nachdem die Zielposition oder das Pfadende erreicht wurde, da es den Agenten aufgrund der wiederholten Pfadaktualisierungen zum Jittern bringen kann. Prüfen Sie immer sehr früh im Skript mit ``is_navigation_finished()``, ob der Pfad bereits beendet ist.

source: The following properties influence the path following behavior.
de: Die folgenden Propertys beeinflussen das Wegverfolgungsverhalten.
zh_tw: 這個節點有如下屬性可供設定。

source: The ``path_desired_distance`` defines the distance at which the agent advances its internal path index to the next path position.
de: ``path_desired_distance`` definiert die Distanz, um die der Agent seinen internen Pfadindex zur nächsten Pfadposition vorrückt.
zh_tw: “path_desired_distance”定義了代理程式將其內部路徑索引推進到下一個路徑位置的距離。

source: The ``target_desired_distance`` defines the distance at which the agent considers the target position to be reached and the path at its end.
de: ``target_desired_distance`` definiert die Entfernung, für die der Agent die Zielposition erreicht und den Pfad als beendet ansieht.
zh_tw: 「target_desired_distance」定義了代理認為要到達的目標位置及其終點的路徑的距離。

source: The ``path_max_distance`` defines when an agent requests a new path cause it was moved too far away from the current path point segment.
de: ``path_max_distance`` definiert, wann ein Agent einen neuen Pfad anfordert, weil er sich zu weit vom aktuellen Pfadpunktsegment entfernt hat.
zh_tw: 「path_max_distance」定義代理程式何時要求新路徑，因為它距離目前路徑點段太遠。

source: The important updates are all triggered with the ``get_next_path_position()`` function when called in ``_physics_process()``.
de: Die wichtigen Aktualisierungen werden alle mit der Funktion ``get_next_path_position()`` ausgelöst, wenn sie in ``_physics_process()`` aufgerufen wird.
zh_tw: 當在 _physical_process() 中呼叫時，重要的更新都是由 get_next_path_position() 函式觸發的。

source: NavigationAgents can be used with ``process`` but are still limited to a single update that happens in ``physics_process``.
de: NavigationAgents können mit ``process`` verwendet werden, sind aber immer noch auf eine einzige Aktualisierung beschränkt, die in ``physics_process`` stattfindet.
zh_tw: NavigationAgents 可以與「process」一起使用，但仍僅限於「physical_process」中發生的單一更新。

source: Script examples for various nodes commonly used with NavigationAgents can be found further below.
de: Skriptbeispiele für verschiedene Nodes, die häufig mit NavigationAgents verwendet werden, finden Sie weiter unten.
zh_tw: 下面可以找到通常與 NavigationAgents 一起使用的各種節點的腳本範例。

source: Pathfollowing common problems
de: Häufige Probleme bei der Wegverfolgung
zh_tw: 在下方範例中：

source: There are some common user problems and important caveats to consider when writing agent movement scripts.
de: Beim Schreiben von Skripten für Agentenbewegungen gibt es einige häufige Benutzerprobleme und wichtige Hinweise zu beachten.
zh_tw: 編寫代理程式移動腳本時需要考慮一些常見的使用者問題和重要注意事項。

source: The path is returned empty
de: Der Pfad wird leer zurückgegeben
zh_tw: 回程的路徑為空

source: If an agent queries a path before the navigation map synchronisation, e.g. in a ``_ready()`` function, the path might return empty. In this case the ``get_next_path_position()`` function will return the same position as the agent parent node and the agent will consider the path end reached. This is fixed by making a deferred call or using a callback e.g. waiting for the navigation map changed signal.
de: Wenn ein Agent einen Pfad vor der Synchronisation der Navigations-Map abfragt, z.B. in einer ``_ready()`` Funktion, könnte der Pfad leer zurückkommen. In diesem Fall wird die Funktion ``get_next_path_position()`` die gleiche Position wie der übergeordnete Node des Agenten zurückgeben und der Agent wird das Ende des Pfades als erreicht betrachten. Dies kann durch einen verzögerten Aufruf oder einen Callback behoben werden, z.B. durch Warten auf das Signal "Navigations-Map geändert".

source: The agent is stuck dancing between two positions
de: Der Agent zappelt zwischen zwei Positionen
zh_tw: 特工被困在兩個位置之間跳舞

source: This is usually caused by very frequent path updates every single frame, either deliberate or by accident (e.g. max path distance set too short). The pathfinding needs to find the closest position that are valid on navigation mesh. If a new path is requested every single frame the first path positions might end up switching constantly in front and behind the agent's current position, causing it to dance between the two positions.
de: Dies wird in der Regel durch sehr häufige Pfadaktualisierungen in jedem einzelnen Frame verursacht, entweder absichtlich oder aus Versehen (z.B. wenn die maximale Pfaddistanz zu kurz eingestellt ist). Die Wegfindung muss die nächstgelegene Position im Mesh finden, die für die Navigation gültig ist. Wird bei jedem Einzelbild ein neuer Pfad angefordert, kann es passieren, dass die ersten Pfadpositionen ständig vor und hinter der aktuellen Position des Agenten wechseln, so dass dieser zwischen den beiden Positionen hin und her zappelt.
zh_tw: 這通常是由於每個影格非常頻繁的路徑更新造成的，無論是有意還是無意（例如，最大路徑距離設定得太短）。尋路需要找到導覽網格上有效的最近位置。如果每個影格都請求新路徑，則第一個路徑位置可能最終會在代理目前位置的前後不斷切換，導致其在兩個位置之間跳舞。

source: The agent is backtracking sometimes
de: Der Agent bewegt sich manchmal rückwärts
zh_tw: 代理有時會回溯

source: If an agent moves very fast it might overshoot the path_desired_distance check without ever advancing the path index. This can lead to the agent backtracking to the path point now behind it until it passes the distance check to increase the path index. Increase the desired distances accordingly for your agent speed and update rate usually fixes this as well as a more balanced navigation mesh polygon layout with not too many polygon edges cramped together in small spaces.
de: Wenn sich ein Agent sehr schnell bewegt, kann es passieren, dass er über den path_desired_distance-Check hinausschießt, ohne jemals den Pfadindex zu erhöhen. Dies kann dazu führen, dass der Agent zu dem Wegpunkt zurückgeht, der nun hinter ihm liegt, bis er die Distanzprüfung besteht, um den Pfadindex zu erhöhen. Erhöhen Sie die gewünschten Entfernungen entsprechend Ihrer Agentengeschwindigkeit und Aktualisierungsrate, um dieses Problem zu beheben, und sorgen Sie für ein ausgewogeneres Mesh-Polygon-Layout mit nicht zu vielen Polygonkanten, die auf engem Raum zusammengepfercht sind.
zh_tw: 如果代理程式移動得非常快，它可能會超出 path_desired_distance 檢查，而不會推進路徑索引。這可能導致代理回溯到它後面的路徑點，直到它通過距離檢查以增加路徑索引。根據代理速度和更新速率相應地增加所需距離通常可以解決此問題，並且可以使用更平衡的導覽網格多邊形佈局，而不會在小空間內擠在一起太多的多邊形邊緣。

source: The agent is sometimes looking backwards for a frame
de: Der Agent schaut manchmal für die Dauer eines Frames rückwärts
zh_tw: 代理有時會向後尋找影格

source: Same as with stuck dancing agents between two positions, this is usually caused by very frequent path updates every single frame. Depending on your navigation mesh layout, and especially when an agent is directly placed over a navigation mesh edge or edge connection, expect path positions to be sometimes slightly "behind" your actors current orientation. This happens due to precision issues and can not always be avoided. This is usually only a visible problem if actors are instantly rotated to face the current path position.
de: Ähnlich wie bei Agenten, die zwischen zwei Positionen zappeln, wird dies normalerweise durch sehr häufige Pfadaktualisierungen in jedem einzelnen Frame verursacht. Abhängig vom Layout des Navigations-Meshs und insbesondere wenn ein Agent direkt über einer Kante oder einer Kantenverbindung des Navigations-Meshs platziert ist, kann es vorkommen, dass die Pfadpositionen etwas "hinter" der aktuellen Ausrichtung des Agenten liegen. Dies geschieht aufgrund von Präzisionsproblemen und kann nicht immer vermieden werden. Dies ist in der Regel nur dann ein sichtbares Problem, wenn die Akteure sofort in Richtung der aktuellen Pfadposition gedreht werden.
zh_tw: 與在兩個位置之間卡住的跳舞代理相同，這通常是由每個影格非常頻繁的路徑更新引起的。根據您的導覽網格佈局，尤其是當代理直接放置在導覽網格邊緣或邊緣連接上時，預計路徑位置有時會稍微「落後」角色目前方向。這種情況的發生是由於精度問題，並且並非總是能夠避免。如果演員立即旋轉以面向目前路徑位置，這通常只是一個可見的問題。

source: NavigationAgent Avoidance
de: NavigationAgent-Vermeidung
zh_tw: 導覽

source: This section explains how to use the navigation avoidance specific to NavigationAgents.
de: In diesem Abschnitt wird erklärt, wie Sie die Navigationsvermeidung für NavigationAgents nutzen können.
zh_tw: 本節介紹如何使用特定於 NavigationAgent 的導覽迴避。

source: In order for NavigationAgents to use the avoidance feature the ``enable_avoidance`` property must be set to ``true``.
de: Damit NavigationAgents das Ausweich-Feature nutzen können, muss das Property ``enable_avoidance`` auf ``true`` gesetzt werden.
zh_tw: 為了使 NavigationAgents 使用迴避功能，「enable_avoidance」屬性必須設定為「true」。

source: The ``velocity_computed`` signal of the NavigationAgent node must be connected to receive the safe velocity calculation result.
de: Das Signal ``velocity_computed`` des Nodes NavigationAgent muss verbunden sein, um das Ergebnis der sicheren Geschwindigkeitsberechnung zu erhalten.

source: Use ``set_velocity()`` on the NavigationAgent node in ``_physics_process()`` to update the agent with the current velocity of the agent's parent node.
de: Verwenden Sie ``set_velocity()`` auf dem NavigationAgent-Node in ``_physics_process()``, um den Agenten mit der aktuellen Geschwindigkeit des Parent-Node zu aktualisieren.
zh_tw: 在 _physical_process() 中的 NavigationAgent 節點上使用 set_velocity() 來使用代理父節點的目前速度來更新代理程式。

source: While avoidance is enabled on the agent the ``safe_velocity`` vector will be received with the velocity_computed signal every physics frame. This velocity vector should be used to move the NavigationAgent's parent node in order to avoidance collision with other avoidance using agents or avoidance obstacles.
de: Solange das Ausweich-Feature für den Agenten aktiviert ist, wird der Vektor ``safe_velocity`` zusammen mit dem velocity_computed-Signal in jedem Physik-Frame empfangen. Dieser Geschwindigkeitsvektor sollte verwendet werden, um den Parent-Node des NavigationAgent zu bewegen, um Kollisionen mit anderen ausweichenden Agenten oder Ausweich-Hindernissen zu vermeiden.
zh_tw: 當代理啟用迴避時，每個物理訊框都會收到「safe_velocity」向量以及velocity_compulated訊號。此速度向量應用於移動導覽代理的父節點，以避免與其他使用代理或迴避障礙物的迴避發生碰撞。

source: Only other agents on the same map that are registered for avoidance themself will be considered in the avoidance calculation.
de: Nur andere Agenten auf der gleichen Map, die selbst zum Ausweichen eingetragen sind, werden bei der Ausweichberechnung berücksichtigt.
zh_tw: 只有在同一地圖上註冊為迴避的其他代理才會被考慮在迴避計算中。

source: The following NavigationAgent properties are relevant for avoidance:
de: Die folgenden Propertys von NavigationAgent sind für zum Ausweichen relevant:
zh_tw: 這個節點有如下屬性可供設定：

source: The property ``height`` is available in 3D only. The height together with the current global y-axis position of the agent determines the vertical placement of the agent in the avoidance simulation. Agents using the 2D avoidance will automatically ignore other agents or obstacles that are below or above them.
de: Die Property ``Höhe`` ist nur in 3D verfügbar. Die Höhe bestimmt zusammen mit der aktuellen globalen y-Achsenposition des Agenten die vertikale Platzierung des Agenten in der Ausweichsimulation. Agenten, die das 2D-Ausweichverfahren verwenden, ignorieren automatisch andere Agenten oder Hindernisse, die sich unter oder über ihnen befinden.
zh_tw: 屬性“height”僅在 3D 中可用。高度與智慧體目前的全局 y 軸位置一起決定了智慧體在迴避模擬中的垂直位置。使用 2D 迴避的智慧體將自動忽略位於其下方或上方的其他智慧體或障礙物。

source: The property ``radius`` controls the size of the avoidance circle, or in case of 3D sphere, around the agent. This area describes the agents body and not the avoidance maneuver distance.
de: Das Property ``Radius`` steuert die Größe des Ausweichkreises (in 3D-Fall einer Kugel) um den Agenten. Dieser Bereich beschreibt den Body des Agenten und nicht die Distanz des Ausweichmanövers.
zh_tw: 屬性「radius」控制迴避圓的大小，或在 3D 球體的情況下，控制代理人周圍的迴避圓的大小。該區域描述了代理的身體，而不是迴避機動距離。

source: The property ``neighbor_distance`` controls the search radius of the agent when searching for other agents that should be avoided. A lower value reduces processing cost.
de: Die Property ``neighbor_distance`` steuert den Suchradius des Agenten bei der Suche nach anderen Agenten, denen ausgewichen werden soll. Ein kleinerer Wert verringert die Berechnungskosten.
zh_tw: 當搜尋應避免的其他代理程式時，屬性「neighbor_distance」控制代理程式的搜尋半徑。較低的值可降低處理成本。

source: The property ``max_neighbors`` controls how many other agents are considered in the avoidance calculation if they all have overlapping radius. A lower value reduces processing cost but a too low value may result in agents ignoring the avoidance.
de: Die Property ``max_neighbors`` steuert, wie viele andere Agenten bei der Ausweichberechnung berücksichtigt werden, wenn sie alle einen überlappenden Radius haben. Ein niedriger Wert reduziert die Verarbeitungskosten, aber ein zu niedriger Wert kann dazu führen, dass Agenten as Ausweichen ignorieren.
zh_tw: 屬性「max_neighbors」控制在迴避計算中考慮多少其他代理（如果它們都具有重疊半徑）。較低的值會降低處理成本，但太低的值可能會導致代理忽略迴避。

source: The properties ``time_horizon_agents`` and ``time_horizon_obstacles`` control the avoidance prediction time for other agents or obstacles in seconds. When agents calculate their safe velocities they choose velocities that can be kept for this amount of seconds without colliding with another avoidance object. The prediction time should be kept as low as possible as agents will slow down their velocities to avoid collision in that timeframe.
de: Die Propertys ``time_horizon_agents`` und ``time_horizon_obstacles`` steuern die Ausweichvorhersagezeit für andere Agenten oder Hindernisse in Sekunden. Wenn Agenten ihre sicheren Geschwindigkeiten berechnen, wählen sie Geschwindigkeiten, die für diese Anzahl von Sekunden gehalten werden können, ohne mit einem anderen Ausweichobjekt zu kollidieren. Die Vorhersagezeit sollte so niedrig wie möglich gehalten werden, da die Agenten ihre Geschwindigkeit verlangsamen werden, um eine Kollision innerhalb dieses Zeitrahmens zu vermeiden.
zh_tw: 屬性“time_horizon_agents”和“time_horizon_obstacles”控制其他代理或障礙物的迴避預測時間（以秒為單位）。當代理人計算他們的安全速度時，他們選擇可以保持這一秒鐘而不會與另一個迴避物件發生碰撞的速度。預測時間應盡可能短，因為代理會減慢速度以避免在該時間範圍內發生碰撞。

source: The property ``max_speed`` controls the maximum velocity allowed for the agents avoidance calculation. If the agents parents moves faster than this value the avoidance ``safe_velocity`` might not be accurate enough to avoid collision.
de: Die Property ``max_speed`` steuert die maximale Geschwindigkeit, die für die Ausweichberechnung des Agenten erlaubt ist. Wenn sich die Parents des Agenten schneller als dieser Wert bewegen, könnte die Ausweichberechnung ``safe_velocity`` nicht genau genug sein, um eine Kollision zu vermeiden.
zh_tw: 屬性“max_speed”控制代理迴避計算所允許的最大速度。如果智慧體父母的移動速度快於該值，則避免「safe_velocity」可能不夠準確，無法避免碰撞。

source: The property ``use_3d_avoidance`` switches the agent between the 2D avoidance (xz axis) and the 3D avoidance (xyz axis) on the next update. Note that 2D avoidance and 3D avoidance run in separate avoidance simulations so agents split between them do not affect each other.
de: Die Property ``use_3d_avoidance`` schaltet den Agenten bei der nächsten Aktualisierung zwischen der 2D-Ausweichen (xz-Achse) und der 3D-Ausweichen (xyz-Achse) um. Beachten Sie, dass das 2D-Ausweichen und das 3D-Ausweichen in separaten Ausweichsimulationen ablaufen, so dass sich Agenten, die zwischen diesen beiden Methoden wechseln, nicht gegenseitig beeinflussen.
zh_tw: 屬性「use_3d_avoidance」在下次更新時在 2D 迴避（xz 軸）和 3D 迴避（xyz 軸）之間切換代理。請注意，2D 迴避和 3D 迴避在單獨的迴避模擬中運作，因此在它們之間分配的代理不會相互影響。

source: The properties ``avoidance_layers`` and ``avoidance_mask`` are bitmasks similar to e.g. physics layers. Agents will only avoid other avoidance objects that are on an avoidance layer that matches at least one of their own avoidance mask bits.
de: Die Propertys ``avoidance_layers`` und ``avoidance_mask`` sind Bitmasken, ähnlich wie z.B. bei physikalischen Ebenen. Agenten weichen nur anderen Ausweichobjekten aus, die sich auf einem Ausweich-Layer befinden, der mit mindestens einem ihrer eigenen Ausweichmasken-Bits übereinstimmt.
zh_tw: 屬性「avoidance_layers」和「avoidance_mask」是類似物理層的位元遮罩。代理人只會避開位於至少與其自己的迴避遮罩位元之一所配對的迴避層上的其他迴避物件。

source: The ``avoidance_priority`` makes agents with a higher priority ignore agents with a lower priority. This can be used to give certain agents more importance in the avoidance simulation, e.g. important npcs characters, without constantly changing their entire avoidance layers or mask.
de: ``avoidance_priority`` bewirkt, dass Agenten mit einer höheren Priorität Agenten mit einer niedrigeren Priorität ignorieren. Dies kann verwendet werden, um bestimmten Agenten in der Ausweichsimulation mehr Bedeutung zu geben, z.B. wichtigen NPC-Charakteren, ohne ständig ihren gesamten Ausweich-Layer oder ihre Maske zu ändern.
zh_tw: 「avoidance_priority」使具有較高優先權的代理忽略具有較低優先權的代理。這可用於在迴避模擬中賦予某些代理更重要的作用，例如重要的NPC角色，而無需不斷更改其整個迴避層或掩模。
