Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationpaths.po
Languages: de

source: Using NavigationPaths
de: Verwenden von NavigationPaths

source: Obtaining a NavigationPath
de: Ermittlung eines NavigationPaths

source: Navigation paths can be directly queried from the NavigationServer and do not require any additional nodes or objects as long as the navigation map has a navigation mesh to work with.
de: Navigationspfade können direkt vom NavigationServer abgefragt werden und benötigen keine zusätzlichen Nodes oder Objekte, solange die Navigations-Map über ein Navigations-Mesh verfügt, mit dem gearbeitet werden kann.

source: To obtain a 2D path, use ``NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)``.
de: Um einen 2D-Pfad zu erhalten, verwenden Sie ``NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)``.

source: To obtain a 3D path, use ``NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)``.
de: Um einen 3D-Pfad zu erhalten, verwenden Sie ``NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)``.

source: For more customizable navigation path queries that require additional setup see :ref:`doc_navigation_using_navigationpathqueryobjects`.
de: Für weitere anpassbare Navigationspfad-Abfragen, die zusätzliche Einstellungen erfordern, siehe :ref:`doc_navigation_using_navigationpathqueryobjects`.

source: One of the required parameters for the query is the RID of the navigation map. Each game world has a default navigation map automatically created. The default navigation maps can be retrieved with ``get_world_2d().get_navigation_map()`` from any Node2D inheriting node or ``get_world_3d().get_navigation_map()`` from any Node3D inheriting node. The second and third parameters are the starting position and the target position as Vector2 for 2D or Vector3 for 3D.
de: Einer der erforderlichen Parameter für die Abfrage ist die RID der Navigations-Map. Jede Spielwelt hat eine automatisch erstellte Default-Navigations-Map. Die Default-Navigations-Maps können mit ``get_world_2d().get_navigation_map()`` von jedem von Node2D-erbenden Node oder ``get_world_3d().get_navigation_map()`` von jedem von Node3D-erbenden Node abgefragt werden. Der zweite und dritte Parameter sind die Startposition und die Zielposition als Vector2 für 2D oder Vector3 für 3D.

source: If the ``optimized`` parameter is ``true``, path positions will be shortened along polygon corners with an additional funnel algorithm pass. This works well for free movement on navigation meshes with unequally sized polygons as the path will hug around corners along the polygon corridor found by the A* algorithm. With small cells the A* algorithm creates a very narrow funnel corridor that can create ugly corner paths when used with grids.
de: Wenn der Parameter ``optimized`` auf ``true`` steht, werden die Pfadpositionen entlang der Polygonecken mit einem zusätzlichen Trichteralgorithmus-Durchlauf verkürzt. Dies funktioniert gut für die freie Bewegung auf Meshes mit ungleich großen Polygonen, da der Pfad sich um die Ecken entlang des vom A*-Algorithmus gefundenen Polygonkorridors schmiegt. Bei kleinen Zellen erzeugt der A*-Algorithmus einen sehr schmalen Trichterkorridor, der bei der Verwendung mit Rastern hässliche Eckpfade erzeugen kann.

source: If the ``optimized`` parameter is ``false``, path positions will be placed at the center of each polygon edge. This works well for pure grid movement on navigation meshes with equally sized polygons as the path will go through the center of the grid cells. Outside of grids due to polygons often covering large open areas with a single, long edge this can create paths with unnecessary long detours.
de: Wenn der Parameter ``optimized`` auf ``false`` gesetzt ist, werden die Pfadpositionen in der Mitte jeder Polygonkante platziert. Dies funktioniert gut bei reinen Rasterbewegungen auf Meshes mit gleichgroßen Polygonen, da der Pfad durch die Mitte der Rasterzellen verläuft. Außerhalb von Rastern kann dies aufgrund der Tatsache, dass Polygone oft große offene Flächen mit einer einzigen langen Kante abdecken, Pfade mit unnötig langen Umwegen erzeugen.

source: A returned ``path`` by the NavigationServer will be a ``PackedVector2Array`` for 2D or a ``PackedVector3Array`` for 3D. These are just a memory-optimized ``Array`` of vector positions. All position vectors inside the array are guaranteed to be inside a NavigationPolygon or NavigationMesh. The path array, if not empty, has the navigation mesh position closest to the starting position at the first index ``path[0]`` position. The closest available navigation mesh position to the target position is the last index ``path[path.size()-1]`` position. All indexes between are the path points that an actor should follow to reach the target without leaving the navigation mesh.
de: Ein vom NavigationServer zurückgegebener ``Pfad`` ist ein ``PackedVector2Array`` für 2D oder ein ``PackedVector3Array`` für 3D. Diese sind lediglich ein speicheroptimiertes ``Array`` von Vektorpositionen. Alle Positionsvektoren innerhalb des Arrays befinden sich garantiert innerhalb eines NavigationPolygons oder NavigationMesh. Das Pfad-Array enthält, wenn es nicht leer ist, die Position des Navigations-Meshes, die der Startposition am nächsten liegt, an der ersten ``path[0]``-Position. Die der Zielposition nächstgelegene verfügbare Position des Navigation Mesh ist die Position mit dem letzten Index ``path[path.size()-1]``. Alle Indizes dazwischen sind die Pfadpunkte, denen ein Akteur folgen sollte, um das Ziel zu erreichen, ohne das Navigations-Mesh zu verlassen.

source: If the target position is on a different navigation mesh that is not merged or connected the navigation path will lead to the closest possible position on the starting position navigation mesh.
de: Befindet sich die Zielposition auf einem anderen Navigations-Mesh, das nicht zusammengeführt oder verbunden ist, führt der Navigationspfad zur nächstmöglichen Position auf dem Navigations-Mesh der Startposition.

source: The following script moves a Node3D inheriting node along a navigation path using the default navigation map by setting the target position with ``set_movement_target()``.
de: Das folgende Skript verschiebt einen von Node3D geerbten Node entlang eines Navigationspfades unter Verwendung der Default-Navigations-Map, indem es die Zielposition mit ``set_movement_target()`` setzt.

source: Translation status
de: Übersetzungsstatus
