Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationmaps.po
Languages: de

source: Using NavigationMaps
de: Verwendung von NavigationMaps

source: A NavigationMap is an abstract navigation world on the NavigationServer identified by a NavigationServer :ref:`RID<class_RID>`.
de: Eine NavigationMap ist eine abstrakte Navigationswelt auf dem NavigationServer, die durch eine NavigationServer-:ref:`RID<class_RID>` identifiziert wird.

source: A map can hold and connect a near infinite number of navigation regions with navigation meshes to build the traversable areas of a game world for pathfinding.
de: Eine Map kann eine nahezu unendliche Anzahl von Navigationsregionen enthalten und mit Navigations-Meshes verbinden, um die durchquerbaren Bereiche einer Spielwelt für die Pfadfindung zu bilden.

source: A map can contain avoidance agents. Collision avoidance will be calculated based on the agents present in the map.
de: Eine Map kann Ausweichagenten enthalten. Die Kollisionsvermeidung wird auf der Grundlage der in der Karte vorhandenen Agenten berechnet.

source: Different NavigationMaps are completely isolated from each other but navigation regions and avoidance agents can switch between different maps. Switches will become effective on NavigationServer synchronization.
de: Verschiedene NavigationMaps sind vollständig voneinander isoliert, aber Navigationsregionen und Ausweichagenten können zwischen verschiedenen Maps wechseln. Der Wechsel wird bei der Synchronisation des Navigationsservers wirksam.

source: Default navigation maps
de: Default-Navigations-Maps

source: By default Godot creates a navigation map for each :ref:`World2D<class_World2D>` and :ref:`World3D<class_World3D>` of the root viewport.
de: Standardmäßig erstellt Godot eine Navigations-Map für jeden :ref:`World2D<class_World2D>` und :ref:`World3D<class_World3D>` des Root-Viewports.

source: The 2D default navigation map RID can be obtained with ``get_world_2d().get_navigation_map()`` from any :ref:`Node2D<class_Node2D>` inheriting Node.
de: Die 2D-Default-Navigations-Map-RID kann mit ``get_world_2d().get_navigation_map()`` von jedem von :ref:`Node2D<class_Node2D>` erbenden Node erhalten werden.

source: The 3D default navigation map RID can be obtained with ``get_world_3d().get_navigation_map()`` from any :ref:`Node3D<class_Node3D>` inheriting Node.
de: Die 3D-Default-Navigations-Map-RID kann mit ``get_world_3d().get_navigation_map()`` von jedem von :ref:`Node3D<class_Node3D>` erbenden Node erhalten werden.

source: Creating new navigation maps
de: Neue Navigations-Maps erstellen

source: The NavigationServer can create and support as many navigation maps as required for specific gameplay. Additional navigation maps are created and handled by using the NavigationServer API directly e.g. to support different avoidance agent or actor locomotion types.
de: Der NavigationServer kann so viele Navigations-Maps erstellen und unterstützen, wie für ein bestimmtes Gameplay erforderlich sind. Zusätzliche Navigations-Maps werden direkt über die NavigationServer-API erstellt und verwaltet, z.B. um verschiedene Ausweichagenten oder Fortbewegungsarten von Akteuren zu unterstützen.

source: For example uses of different navigation maps see :ref:`doc_navigation_different_actor_types` and :ref:`doc_navigation_different_actor_locomotion`.
de: Für Beispiele für die Verwendung verschiedener Navigations-Maps siehe :ref:`doc_navigation_different_actor_types` und :ref:`doc_navigation_different_actor_locomotion`.

source: Each navigation map individually synchronizes queued changes to its navigation regions and avoidance agents. A navigation map that has not received changes will consume little to no processing time. Navigation regions and avoidance agents can only be part of a single navigation map but they can switch map at any time.
de: Jede Navigations-Map synchronisiert einzeln die in der Warteschlange stehenden Änderungen mit ihren Navigationsregionen und Ausweichagenten. Eine Navigationskarte, die keine Änderungen erhalten hat, verbraucht wenig bis gar keine Verarbeitungszeit. Navigationsregionen und Ausweichagenten können nur Teil einer einzigen Navigations-Map sein, aber sie können jederzeit die Map wechseln.

source: A navigation map switch will take effect only after the next NavigationServer synchronization.
de: Ein Wechsel der Navigations-Map wird erst nach der nächsten Synchronisation des NavigationServers wirksam.

source: There is no difference between navigation maps created with the NavigationServer2D API or the NavigationServer3D API.
de: Es gibt keinen Unterschied zwischen Navigations-Maps, die mit der NavigationServer2D-API oder der NavigationServer3D-API erstellt wurden.

source: Translation status
de: Übersetzungsstatus
