Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_optimizing_performance.po
Languages: de, zh_tw

source: Optimizing Navigation Performance
de: Optimieren der Navigations-Performance
zh_tw: 最佳化建置檔案大小

source: Common Navigation related performance problems can be categorized into the following topics:
de: Häufige Performance-Probleme im Zusammenhang mit der Navigation lassen sich in die folgenden Kategorien einteilen:
zh_tw: 常見的導覽相關效能問題可分為以下主題：

source: Performance problems with parsing scene tree nodes for navigation mesh baking.
de: Performance-Probleme bei der Analyse von Nodes des Szenenbaums für das Backen von Navigations-Meshes.

source: Performance problems with baking the actual navigation mesh.
de: Performance-Probleme beim Backen des eigentlichen Navigations-Meshs.
zh_tw: 烘焙實際導覽網格時的性能問題。

source: Performance problems with NavigationAgent path queries.
de: Performance-Probleme mit NavigationAgent-Pfadabfragen.
zh_tw: NavigationAgent 路徑查詢的性能問題。

source: Performance problems with the actual path search.
de: Performance-Probleme bei der eigentlichen Pfadsuche.
zh_tw: 實際路徑搜索的性能問題。

source: Performance problems with synchronizing the navigation map.
de: Performance-Probleme bei der Synchronisierung der Navigations-Map.
zh_tw: 同步導覽地圖的性能問題。

source: In the following sections information can be found on how to identify and fix or at least mitigate their impact on framerates.
de: In den folgenden Abschnitten finden Sie Informationen darüber, wie Sie deren Auswirkungen auf die Framerate erkennen und beheben oder zumindest abmildern können.
zh_tw: 在以下部分中可以找到有關如何識別和修復或至少減輕其對影格速率的影響的資訊。

source: Performance problems with parsing scene tree nodes
de: Performance-Probleme beim Parsen von Nodes in Szenenbäumen

source: Prefer using simple shapes with as few edges as possible e.g. nothing rounded like a circle, sphere or torus.
de: Verwenden Sie vorzugsweise einfache Formen mit möglichst wenigen Kanten, z. B. keine runden Formen wie Kreise, Kugeln oder Torus.
zh_tw: 喜歡使用邊緣盡可能少的簡單形狀，例如，不要像圓形、球體或圓環那樣呈圓形。

source: Prefer using physics collision shapes over complex visual meshes as source geometry as meshes need to be copied from the GPU and are commonly much more detailed than necessary.
de: Bevorzugen Sie physikalische Collision Shapes gegenüber komplexen visuellen Meshes als Ausgangsgeometrie, da Meshes von der GPU kopiert werden müssen und in der Regel viel detaillierter sind als nötig.
zh_tw: 優先使用物理碰撞形狀而不是複雜的視覺網格作為來源幾何體，因為網格需要從 GPU 複製，並且通常比必要的詳細得多。

source: In general avoid using very complex geometry as source geometry for baking navigation meshes. E.g. never use a very detailed visual mesh, as parsing its shape to data arrays and voxelizing it for the navigation mesh baking will take a long time for no real quality gain on the final navigation mesh. Instead, use a very simplified level of detail version of a shape. Even better, use very primitive shapes like boxes and rectangles that only roughly cover the same geometry but still yield a baked result good enough for pathfinding.
de: Vermeiden Sie im Allgemeinen die Verwendung sehr komplexer Geometrie als Ausgangsgeometrie für das Backen von Navigationsmeshes. Verwenden Sie z.B. niemals ein sehr detailliertes visuelles Mesh, da das Parsen seiner Form in Datenarrays und die Voxelisierung für das Backen des Navigationsmeshs viel Zeit in Anspruch nehmen wird, ohne dass das endgültige Navigationsmesh dadurch an Qualität gewinnt. Verwenden Sie stattdessen eine sehr detailarme Version einer Geometrie. Noch besser ist es, sehr primitive Geometrien wie Kästchen und Rechtecke zu verwenden, die nur grob die gleiche Geometrie abdecken, aber dennoch ein Ergebnis liefern, das gut genug für die Wegfindung ist.
zh_tw: 一般來說，避免使用非常複雜的幾何體作為烘焙導覽網格的來源幾何體。例如，永遠不要使用非常詳細的視覺網格，因為將其形狀解析為資料陣列並將其體素化以進行導覽網格烘焙將花費很長時間，而不會在最終導覽網格上獲得真正的質量增益。相反，請使用形狀的非常簡化的細節等級版本。更好的是，使用非常原始的形狀，例如盒子和矩形，它們僅大致覆蓋相同的幾何形狀，但仍然會產生足夠好的路徑搜尋烘焙結果。

source: Prefer using simple physics collision shapes over visual meshes, as the source geometry for baking navigation meshes. Physics shapes are by default very limited and optimized shapes that are easy and quick to parse. A visual mesh on the other hand can range from simple to complex. On top, to gain access to visual mesh data the parser needs to request the mesh data arrays from the RenderingServer as visual mesh data is stored directly on the GPU and is not cached on the CPU. This requires locking the RenderingServer thread and can severely impact framerate at runtime while the rendering runs multi-threaded. If the rendering runs single-threaded, the framerate impact might be even worse and the mesh parsing might freeze the entire game for a few seconds on complex meshes.
de: Bevorzugen Sie einfache Physik-Collision Shapes gegenüber visuellen Meshes als Ausgangsgeometrie für das Backen von Navigationsmeshes. Physik-Shapes sind standardmäßig sehr begrenzte und optimierte Geometrien, die einfach und schnell zu analysieren sind. Ein visuelles Mesh hingegen kann von einfach bis komplex reichen. Um Zugriff auf visuelle Mesh-Daten zu erhalten, muss der Parser die Mesh-Daten-Arrays vom RenderingServer anfordern, da visuelle Mesh-Daten direkt auf der GPU gespeichert werden und nicht auf der CPU zwischengespeichert sind. Dies erfordert das Sperren des RenderingServer-Threads und kann die Framerate zur Laufzeit stark beeinträchtigen, wenn das Rendering in mehreren Threads ausgeführt wird. Wenn das Rendering als Single-Thread läuft, kann die Auswirkung auf die Framerate noch schlimmer sein und das Mesh-Parsing kann bei komplexen Meshes das gesamte Spiel für ein paar Sekunden einfrieren.
zh_tw: 喜歡使用簡單的物理碰撞形狀而不是視覺網格，作為烘焙導覽網格的來源幾何。預設情況下，物理形狀是非常有限且經過最佳化的形狀，可以輕鬆快速地解析。另一方面，視覺網格的範圍可以從簡單到複雜。最重要的是，為了存取視覺網格資料，解析器需要從算繪伺服器請求網格資料陣列，因為視覺網格資料直接儲存在 GPU 上，而不是快取在 CPU 上。這需要鎖定 RenderingServer 線程，並且在算繪以多線程運作時會嚴重影響運作時的影格速率。如果算繪運作單線程，影格率影響可能會更嚴重，並且網格解析可能會在複雜網格上凍結整個遊戲幾秒鐘。

source: Performance problems with navigation mesh baking
de: Performance-Probleme beim Backen von Navigations-Meshes
zh_tw: 烘焙導覽網格的性能問題

source: At runtime, always prefer to use a background thread for baking navigation meshes.
de: Zur Laufzeit sollte immer ein Hintergrund-Thread für das Backen von Navigations-Meshes verwendet werden.
zh_tw: 在運作時，總是更喜歡使用後台執行緒來烘焙導覽網格。

source: Increase NavigationMesh ``cell_size`` and ``cell_height`` to create less voxels.
de: NavigationMesh ``cell_size`` und ``cell_height`` erhöhen, um weniger Voxel zu erzeugen.
zh_tw: 增加 NavigationMesh ``cell_size`` 和 ``cell_height`` 以建立較少的體素。

source: Change the ``SamplePartitionType`` from watershed to monotone or layers to gain baking performance.
de: Ändern Sie den ``SamplePartitionType`` von Watershed auf Monotone oder Layers, um die Performance beim Backen zu erhöhen.
zh_tw: 將“SamplePartitionType”從分水嶺更改為單調或分層以獲得烘焙性能。

source: NEVER scale source geometry with nodes to avoid precision errors. Most scale applies only visually and shapes that are very large at their base scale require still a lot of extra processing even while downscaled.
de: Skalieren Sie Quellgeometrie NIEMALS mit Nodes, um Präzisionsfehler zu vermeiden. Die meisten Skalierungen gelten nur visuell und Geometrien, die in ihrem Grundmaßstab sehr groß sind, erfordern auch bei einer Verkleinerung noch eine Menge zusätzlicher Bearbeitung.
zh_tw: 切勿使用節點縮放源幾何體以避免精度錯誤。大多數比例僅適用於視覺，即使縮小比例，在基本比例下非常大的形狀仍然需要大量額外的處理。

source: Baking navigation meshes at runtime should always be done in a background thread if possible. Even small sized navigation meshes can take far longer to bake than what is possible to squeeze into a single frame, at least if the framerate should stay at a bearable level.
de: Das Backen von Navigations-Meshes zur Laufzeit sollte nach Möglichkeit immer in einem Hintergrund-Thread erfolgen. Selbst kleine Meshes können weitaus mehr Zeit in Anspruch nehmen, als man in ein einzelnes Frame quetschen kann, zumindest wenn die Framerate auf einem erträglichen Niveau bleiben soll.
zh_tw: 如果可能的話，在運作時烘焙導覽網格應該始終在後台執行緒中完成。即使是小尺寸的導覽網格物體的烘焙時間也可能比擠入單個影格所需的時間長得多，至少在影格率保持在可忍受的水平的情況下是如此。

source: Complexity of source geometry data parsed from scene tree nodes has big impact on baking performance as everything needs to be mapped to a grid / voxels. For runtime baking performance the NavigationMesh cell size and cell height should be set as high as possible without causing navigation mesh quality problems for a game. If cell size or cell height is set too low the baking is forced to create an excessive amount of voxels to process the source geometry. If the source geometry spans over a very large game world it is even possible that the baking process runs out off memory in the middle and crashes the game. The partition type can also be lowered depending on how complex the games source geometry is to gain some performance. E.g. games with mostly flat surfaces with blocky geometry can get away with the monotone or layers mode that are a lot faster to bake (e.g. because they require no distance field pass).
de: Die Komplexität der Quellgeometriedaten, die aus den Nodes des Szenenbaums geparst werden, hat große Auswirkungen auf die Performance beim Backen, da alles auf ein Raster / Voxel abgebildet werden muss. Für die Performance des Backens zur Laufzeit sollten die Zellengröße und -höhe des NavigationMeshs so hoch wie möglich eingestellt werden, ohne dass die Qualität des Meshs für ein Spiel beeinträchtigt wird. Wenn die Zellgröße oder Zellhöhe zu niedrig eingestellt ist, ist das Backen gezwungen, eine übermäßige Anzahl von Voxeln zu erzeugen, um die Quellgeometrie zu verarbeiten. Wenn sich die Quellgeometrie über eine sehr große Spielwelt erstreckt, ist es sogar möglich, dass dem Back-Prozess in der Mitte der Speicher ausgeht und das Spiel abstürzt. Der Partitionstyp kann auch herabgesetzt werden, je nachdem wie komplex die Ausgangsgeometrie des Spiels ist, um etwas Performance zu gewinnen. Spiele mit überwiegend flachen Oberflächen und blockartiger Geometrie können z.B. mit dem Monotone- oder Layer-Modus auskommen, die viel schneller zu backen sind (z.B. weil sie keinen Distance Field-Durchlauf benötigen).

source: Never scale source geometry with nodes. Not only can it result in a lot of precision errors with wrongly matched vertices and edges but also some scaling only exists as visuals and not in the actual parsed data. E.g. if a mesh is downscaled visually in the Editor, e.g. the scale set to 0.001 on a MeshInstance, the mesh still requires a gigantic and very complex voxel grid to be processed for the baking.
de: Skalieren Sie niemals die Quellgeometrie mit Nodes. Dies kann nicht nur zu vielen Präzisionsfehlern mit falsch angepassten Vertices und Kanten führen, sondern auch dazu, dass manche Skalierungen nur visuell und nicht in den tatsächlich geparsten Daten vorhanden sind. Wenn z.B. ein Mesh im Editor visuell herunterskaliert wird, z.B. die Skalierung auf 0.001 bei einer MeshInstance, benötigt das Mesh immer noch ein gigantisches und sehr komplexes Voxel-Gitter, um für das Baking verarbeitet zu werden.
zh_tw: 切勿使用節點縮放源幾何。它不僅會導致大量精確度錯誤（頂點和邊配對錯誤），而且某些縮放僅以視覺形式存在，而不存在於實際解析的資料中。例如，如果網格在編輯器中以視覺方式縮小，例如在 MeshInstance 上將比例設為 0.001，則網格仍然需要巨大且非常複雜的體素網格來處理烘焙。

source: Performance problems with NavigationAgent path queries
de: Performance-Probleme mit NavigationAgent-Pfadabfragen
zh_tw: NavigationAgent 路徑查詢的性能問題

source: Avoid unnecessary path resets and queries every frame in NavigationAgent scripts.
de: Vermeiden Sie unnötige Pfadrücksetzungen und Abfragen bei jedem Frame in NavigationAgent-Skripten.
zh_tw: 避免不必要的路徑重設並查詢 NavigationAgent 腳本中的每一影格。

source: Avoid updating all NavigationAgent paths in the same frame.
de: Vermeiden Sie es, alle NavigationAgent-Pfade im selben Frame zu aktualisieren.
zh_tw: 避免更新同一影格中的所有 NavigationAgent 路徑。

source: Logical errors and wasteful operations in the custom NavigationAgent scripts are very common causes of performance issues, e.g. watch out for resetting the path every single frame. By default NavigationAgents are optimized to only query new paths when the target position changes, the navigation map changes or they are forced too far away from the desired path distance.
de: Logische Fehler und verschwenderische Operationen in den benutzerdefinierten NavigationAgent-Skripten sind sehr häufige Ursachen für Performance-Probleme, z.B. das Zurücksetzen des Pfades in jedem einzelnen Frame. Standardmäßig sind NavigationAgents so optimiert, dass sie nur dann neue Pfade abfragen, wenn sich die Zielposition ändert, die Navigations-Map sich ändert oder sie zu weit von der gewünschten Pfaddistanz entfernt sind.
zh_tw: 自訂NavigationAgent 腳本中的邏輯錯誤和浪費性操作是導致效能問題的常見原因，例如，請注意每影格重設路徑。預設情況下，NavigationAgents 經過最佳化，僅在目標位置變更、導覽地圖變更或被迫遠離所需路徑距離時查詢新路徑。

source: E.g. when AI should move to the player, the target position should not be set to the player position every single frame as this queries a new path every frame. Instead, the distance from the current target position to the player position should be compared and only when the player has moved too far away a new target position should be set.
de: Wenn sich z.B. die KI auf den Spieler zubewegen soll, sollte die Zielposition nicht in jedem einzelnen Frame auf die Spielerposition gesetzt werden, da dies in jedem Frame einen neuen Pfad abfragt. Stattdessen sollte die Distanz zwischen der aktuellen Zielposition und der Spielerposition verglichen werden, und nur wenn sich der Spieler zu weit entfernt hat, sollte eine neue Zielposition festgelegt werden.
zh_tw: 例如，當 AI 應移動到玩家時，目標位置不應每影格都設定為玩家位置，因為這會每影格查詢新路徑。相反，應該比較從目前目標位置到玩家位置的距離，並且只有當玩家移動得太遠時才應該設定新的目標位置。

source: Do not check beforehand if a target position is reachable every frame. What looks like an innocent check is the equivalent of an expensive path query behind the scene. If the plan is to request a new path anyway should the position be reachable, a path should be queried directly. By looking at the last position of the returned path and if that position is in a "reachable" distance to the checked position it answers the "is this position reachable?" question. This avoids doing the equivalent of two full path queries every frame for the same NavigationAgent.
de: Prüfen Sie nicht in jedem Frame, ob eine Zielposition erreichbar ist. Was wie eine harmlose Prüfung aussieht, ist das Äquivalent einer teuren Pfadabfrage hinter den Kulissen. Wenn der Plan ist, einen neuen Pfad anzufordern, falls die Position erreichbar ist, sollte ein Pfad direkt abgefragt werden. Die Frage "Ist diese Position erreichbar?" wird beantwortet, indem man die letzte Position des zurückgegebenen Pfades betrachtet und prüft, ob diese Position in einer "erreichbaren" Entfernung zur geprüften Position liegt. Dadurch wird vermieden, dass für jedes Frame zwei vollständige Pfadabfragen für denselben NavigationAgent durchgeführt werden.
zh_tw: 不要預先檢查每個畫面是否可以到達目標位置。看似無害的檢查實際上相當於幕後昂貴的路徑查詢。如果計劃無論如何都要請求新路徑（如果位置可達），則應直接查詢路徑。透過查看返迴路徑的最後一個位置，如果該位置距檢查位置處於“可到達”距離，則它會回答“該位置是否可到達？”問題。這避免了對同一個 NavigationAgent 每影格執行兩次完整路徑查詢的等效操作。

source: Divide the total number of NavigationAgents into update groups or use random timers so that they do not all request new paths in the same frame.
de: Teilen Sie die Gesamtzahl der NavigationAgents in Update-Gruppen ein oder verwenden Sie zufällige Timer, damit sie nicht alle im selben Frame neue Pfade anfordern.
zh_tw: 將導覽代理程式的總數分割為更新組或使用隨機計時器，以便它們不會在同一影格中全部請求新路徑。

source: Performance problems with the actual path search
de: Performance-Probleme bei der eigentlichen Pfadsuche
zh_tw: 實際路徑搜索的性能問題

source: Optimize overdetailed navigation meshes by reducing the amount of polygons and edges.
de: Optimieren Sie überdetaillierte Navigations-Meshes, indem Sie die Anzahl der Polygone und Kanten reduzieren.
zh_tw: 透過減少多邊形和邊的數量來優化過於詳細的導覽網格。

source: The cost of the actual path search correlates directly with the amount of navigation mesh polygons and edges and not the real size of a game world. If a giant game world uses very optimized navigation meshes with only few polygons that cover large areas, performance should be acceptable. If the game world is splintered into very small navigation meshes that each have tiny polygons (like for TileMaps) pathfinding performance will be reduced.
de: Die Kosten der eigentlichen Pfadsuche korrelieren direkt mit der Anzahl der Polygone und Kanten des Navigations-Meshs und nicht mit der tatsächlichen Größe der Spielwelt. Wenn eine riesige Spielwelt sehr optimierte Navigations-Meshes mit nur wenigen Polygonen verwendet, die große Bereiche abdecken, sollte die Performance akzeptabel sein. Wenn die Spielwelt in sehr kleine Meshes mit winzigen Polygonen aufgeteilt ist (wie bei TileMaps), wird die Performance der Pfadfindung reduziert.
zh_tw: 實際路徑搜尋的成本與導覽網格多邊形和邊緣的數量直接相關，而不是與遊戲世界的實際大小相關。如果一個巨大的遊戲世界使用非常優化的導覽網格，只有少數多邊形覆蓋大面積，那麼效能應該是可以接受的。如果遊戲世界被分割成非常小的導覽網格，每個導覽網格都有微小的多邊形（如 TileMap），則尋路效能將會降低。

source: A common problem is a sudden performance drop when a target position is not reachable in a path query. This performance drop is "normal" and the result of a too large, too unoptimized navigation mesh with way to much polygons and edges to search through. In normal path searches where the target position can be reached quickly the pathfinding will do an early exit as soon as the position is reached which can hide this lack of optimization for a while. If the target position can not be reached the pathfinding has to do a far longer search through the available polygons to confirm that the position is absolutely not reachable.
de: Ein häufiges Problem ist ein plötzlicher Performance-Einbruch, wenn eine Zielposition bei einer Pfadabfrage nicht erreichbar ist. Dieser Performance-Einbruch ist "normal" und das Ergebnis eines zu großen, nicht optimierten Navigations-Meshs mit viel zu vielen Polygonen und Kanten, die durchsucht werden müssen. Bei normalen Pfadsuchen, bei denen die Zielposition schnell erreicht werden kann, wird die Wegfindung einen vorzeitigen Abbruch vornehmen, sobald die Position erreicht ist, was diesen Mangel an Optimierung für eine Weile verbergen kann. Wenn die Zielposition nicht erreicht werden kann, muss die Pfadsuche eine viel längere Suche durch die verfügbaren Polygone durchführen, um zu bestätigen, dass die Position absolut nicht erreichbar ist.
zh_tw: 一個常見問題是當路徑查詢中無法到達目標位置時效能突然下降。這種性能下降是“正常的”，是導覽網格太大、未優化的結果，需要搜尋大量多邊形和邊緣。在可以快速到達目標位置的正常路徑搜尋中，一旦到達該位置，尋路就會提前退出，這可以暫時隱藏這種優化不足的情況。如果無法到達目標位置，則尋路必須對可用多邊形進行更長的搜索，以確認該位置絕對無法到達。

source: Performance problems with navigation map synchronization
de: Performance-Probleme bei der Synchronisierung von Navigations-Maps
zh_tw: 導覽地圖同步的性能問題

source: Merge navigation meshes polygons by vertex instead of by edge connection wherever possible.
de: Fügen Sie die Polygone von Navigations-Meshes per Vertex statt per Kantenverbindung zusammen, wo immer dies möglich ist.
zh_tw: 合併導覽盡可能透過頂點而不是邊連接來網格化多邊形。

source: When changes are made to e.g. navigation meshes or navigation regions, the NavigationServer needs to synchronize the navigation map. Depending on the complexity of navigation meshes, this can take a significant amount of time which may impact the framerate.
de: Wenn Änderungen z.B. an Navigations-Meshes oder Navigationsregionen vorgenommen werden, muss der NavigationServer die Navigation-Map synchronisieren. Je nach Komplexität der Meshes kann dies sehr viel Zeit in Anspruch nehmen, was sich auf die Framerate auswirken kann.
zh_tw: 當對導覽網格或導覽區域進行變更時，導覽伺服器需要同步導覽地圖。根據導覽網格的複雜性，這可能需要大量時間，這可能會影響影格速率。

source: The NavigationServer merges navigation meshes either by vertex or by edge connection. The merge by vertex happens when the two vertex of two different edges land in the same map grid cells. This is a rather quick and low-cost operation. The merge by edge connection happens in a second pass for all still unmerged edges. All the free edges are checked for possible edge connections by both distance and angle which is rather costly.
de: Der NavigationServer vereinigt Navigations-Meshes entweder per Vertex oder per Kantenverbindung. Die Vereinigung per Vertex erfolgt, wenn die beiden Vertices zweier unterschiedlicher Kanten in denselben Map-Rasterzellen landen. Dies ist ein relativ schneller und kostengünstiger Vorgang. Die Vereinigung per Kantenverbindung erfolgt in einem zweiten Durchgang für alle noch nicht vereinigten Kanten. Dabei werden alle freien Kanten auf mögliche Kantenverbindungen anhand von Abstand und Winkel geprüft, was recht aufwändig ist.
zh_tw: 導覽伺服器透過頂點或邊連接合併導覽網格。當兩條不同邊的兩個頂點落在同一地圖網格單元中時，就會發生以頂點合併。這是一個相當快速且低成本的操作。對於所有尚未合併的邊，按邊連接進行合併發生在第二遍。透過距離和角度檢查所有自由邊緣是否有可能的邊緣連接，這是相當昂貴的。

source: So apart from the general rule to have as few polygon edges as possible, as many edges as possible should be merged by vertex upfront so only a few edges are left for the more costly edge connection calculation. The debug Navigation PerformanceMonitor can be used to get statistics on how many polygons and edges are available and how many of them are unmerged or not merged by vertex. If the ratio between vertex merged and edge connections is way off (vertex should be significantly higher) the navigation meshes are properly created or placed very inefficient.
de: Abgesehen von der allgemeinen Regel, so wenig Polygonkanten wie möglich zu haben, sollten also so viele Kanten wie möglich im Vorfeld per Vertex vereinigt werden, damit nur wenige Kanten für die aufwendigere Berechnung der Kantenverbindung übrig bleiben. Die Debug-Navigation PerformanceMonitor kann verwendet werden, um Statistiken darüber zu erhalten, wie viele Polygone und Kanten verfügbar sind und wie viele davon gar nicht vereinigt oder nicht per Vertex vereinigt sind. Wenn das Verhältnis zwischen per Vertex und per Kantenverbindung vereinigten Vertices überhaupt nicht passt (Vertex-Vereinigungen sollte deutlich häufiger vorkommen), werden die Navigations-Meshes nicht richtig erstellt oder sehr ineffizient platziert.
zh_tw: 因此，除了具有盡可能少的多邊形邊的一般規則之外，還應透過頂點預先合併盡可能多的邊，以便只留下少量邊用於成本更高的邊連接計算。偵錯導覽效能監視器可用於取得有關可用多邊形和邊的數量以及其中有多少未合併或未按頂點合併的統計資料。如果頂點合併和邊連接之間的比率相差很大（頂點應該明顯更高），則導覽網格會正確建立或放置得非常低效。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
