Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationlayers.po
Languages: de

source: Using NavigationLayers
de: Verwenden von NavigationLayers

source: NavigationLayers are an optional feature to further control which navigation meshes are considered in a path query and which regions can be connected. They work similar to how physics layers control collision between collision objects or how visual layers control what is rendered to the Viewport.
de: NavigationLayers sind ein optionales Feature, um detaillierter zu steuern, welche Navigations-Meshes in einer Pfadabfrage berücksichtigt werden und welche Regionen verbunden werden können. Sie funktionieren ähnlich wie Physikebenen zur Steuerung der Kollision zwischen Kollisionsobjekten oder wie visuelle Ebenen zum Steuern dessen, was im Viewport gerendert wird.

source: NavigationLayers can be named in the **ProjectSettings** the same as physics layers or visual layers.
de: NavigationLayers können in den **Projekteinstellungen** genauso benannt werden wie Physikebenen oder visuelle Ebenen.

source: If two regions have not a single compatible layer they will not be merged by the NavigationServer. See :ref:`doc_navigation_connecting_navmesh` for more information on merging navigation meshes.
de: Wenn zwei Regionen nicht über eine einzige kompatible Ebene verfügen, werden sie vom NavigationServer nicht zusammengeführt. Siehe :ref:`doc_navigation_connecting_navmesh` für weitere Informationen zum Zusammenführen von Navigations-Meshes.

source: If a region has not a single compatible navigation layer with the ``navigation_layers`` parameter of a path query this regions navigation mesh will be skipped in pathfinding. See :ref:`doc_navigation_using_navigationpaths` for more information on querying the NavigationServer for paths.
de: Wenn eine Region nicht einen einzigen kompatiblen Navigationslayer mit dem Parameter ``navigation_layers`` einer Pfadabfrage hat, wird diese Region bei der Wegfindung übersprungen. Siehe :ref:`doc_navigation_using_navigationpaths` für weitere Informationen zur Abfrage des NavigationServers nach Pfaden.

source: NavigationLayers are a single ``int`` value that is used as a **bitmask**. Many navigation related nodes have ``set_navigation_layer_value()`` and ``get_navigation_layer_value()`` functions to set and get a layer number directly without the need for more complex bitwise operations.
de: NavigationLayers sind ein einzelner ``int``-Wert, der als **Bitmaske** verwendet wird. Viele navigationsbezogene Nodes haben ``set_navigation_layer_value()`` und ``get_navigation_layer_value()``-Funktionen, um eine Ebenennummer direkt zu setzen und zu ermitteln, ohne komplexere bitweise Operationen durchführen zu müssen.

source: In scripts the following helper functions can be used to work with the ``navigation_layers`` bitmask.
de: In Skripten können die folgenden Hilfsfunktionen verwendet werden, um mit der Bitmaske ``navigation_layers`` zu arbeiten.

source: Changing navigation layers for path queries is a performance friendly alternative to enabling / disabling entire navigation regions. Compared to region changes a navigation path query with different navigation layers does not trigger large scale updates on the NavigationServer.
de: Das Ändern von Navigationsebenen für Pfadabfragen ist eine Performance-freundliche Alternative zum Aktivieren/Deaktivieren ganzer Navigationsregionen. Im Vergleich zu Regionsänderungen löst eine Pfadabfrage mit verschiedenen Navigationsebenen keine großen Updates auf dem NavigationServer aus.

source: Changing the navigation layers of NavigationAgent nodes will have an immediate effect on the next path query. Changing the navigation layers of regions will have an immediate effect on the region but any new region connect or disconnect will only be in effect after the next physics frame.
de: Eine Änderung der Navigationsebenen von NavigationAgent-Nodes wirkt sich sofort auf die nächste Pfadabfrage aus. Eine Änderung der Navigationsebenen von Regionen wirkt sich unmittelbar auf die Region aus, aber jede neue Verbindung oder Trennung einer Region wird erst nach dem nächsten Physik-Frame wirksam.

source: Translation status
de: Übersetzungsstatus
