Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: de

source: For reference, here is the `folder structure for the Godot Android plugin project template <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. At build time, the contents of the ``export_scripts_template`` directory as well as the generated plugin binaries are copied to the ``addons/<plugin_name>`` directory:
de: Zur Veranschaulichung sehen Sie hier die `Ordnerstruktur für die Godot Android Plugin-Projektvorlage <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Zur Build-Zeit wird der Inhalt des Verzeichnisses ``export_scripts_template`` sowie die generierten Plugin-Binärdateien in das Verzeichnis ``addons/<plugin_name>`` kopiert:

source: Packaging a v2 Android plugin with GDExtension capabilities
de: Paketierung eines v2 Android-Plugins mit GDExtension-Funktionen

source: For GDExtension, we follow the same steps as for `Packaging a v2 Android plugin`_ and add the `GDExtension config file <https://docs.godotengine.org/en/stable/tutorials/scripting/gdextension/gdextension_cpp_example.html#using-the-gdextension-module>`_ in the same location as ``plugin.cfg``.
de: Für die GDExtension folgen wir den gleichen Schritten wie für `Packaging a v2 Android plugin`_ und fügen die `GDExtension config file <https://docs.godotengine.org/en/stable/tutorials/scripting/gdextension/gdextension_cpp_example.html#using-the-gdextension-module>`_ am gleichen Ort wie ``plugin.cfg`` hinzu.

source: For reference, here is the `folder structure for the GDExtension Android plugin project template <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. At build time, the contents of the ``export_scripts_template`` directory as well as the generated plugin binaries are copied to the ``addons/<plugin_name>`` directory:
de: Als Referenz ist hier die `Ordnerstruktur für die GDExtension-Android-Plugin-Projektvorlage <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Zur Build-Zeit wird der Inhalt des Verzeichnisses ``export_scripts_template`` sowie die generierten Plugin-Binärdateien in das Verzeichnis ``addons/<plugin_name>`` kopiert:

source: Here is what the ``plugin.gdextension`` config file should look like::
de: So sollte die Konfigurationsdatei ``plugin.gdextension`` aussehen::

source: Of note is the ``android_aar_plugin`` field that specifies this GDExtension module is provided as part of a v2 Android plugin. During the export process, this will indicate to the Godot Editor that the GDExtension native shared libraries are exported by the Android plugin AAR binaries.
de: Erwähnenswert ist das Feld ``android_aar_plugin``, das angibt, dass dieses GDExtension-Modul als Teil eines v2 Android-Plugins bereitgestellt wird. Während des Exportvorgangs wird dies dem Godot-Editor an, dass die nativen Shared-Libraries der GDExtension-Bibliotheken von den AAR-Binärdateien des Android-Plugins exportiert werden.

source: For GDExtension Android plugins, the plugin init class must override `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_, and return the paths to the bundled GDExtension libraries config files (``*.gdextension``).
de: Für GDExtension-Android-Plugins muss die Plugin-Init-Klasse `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_ überschreiben und die Pfade zu den gebündelten GDExtension-Bibliotheks-Konfigurationsdateien (``*.gdextension``) zurückgeben.

source: The paths must be relative to the Android library's ``assets`` directory. At runtime, the plugin will provide these paths to the Godot engine which will use them to load and initialize the bundled GDExtension libraries.
de: Die Pfade müssen relativ zum Verzeichnis ``assets`` der Android-Bibliothek sein. Zur Laufzeit wird das Plugin diese Pfade der Godot-Engine zur Verfügung stellen, die sie zum Laden und Initialisieren der gebündelten GDExtension-Bibliotheken verwenden wird.

source: Using a v2 Android plugin
de: Verwenden eines v2 Android-Plugins

source: Godot 4.2 or higher is required
de: Godot 4.2 oder höher ist erforderlich

source: v2 Android plugin requires the use of the `Gradle build process <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_.
de: v2-Android-Plugin erfordert die Verwendung des `Gradle-Build-Prozesses <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_.

source: The provided github project templates include demo Godot projects for quick testing.
de: Die mitgelieferten Github-Projektvorlagen enthalten Demo-Godot-Projekte für schnelle Tests.

source: Copy the plugin's output directory (``addons/<plugin_name>``) to the target Godot project's directory
de: Kopieren Sie das Ausgabeverzeichnis des Plugins (``addons/<plugin_name>``) in das Verzeichnis des Ziel-Godot-Projekts

source: Open the project in the Godot Editor; the Editor should detect the plugin
de: Öffnen Sie das Projekt im Godot-Editor; der Editor sollte das Plugin erkennen

source: Navigate to ``Project`` -> ``Project Settings...`` -> ``Plugins``, and ensure the plugin is enabled
de: Navigieren Sie zu ``Projekt`` -> ``Projekteinstellungen`` -> ``Plugins``, und stellen Sie sicher, dass das Plugin aktiviert ist

source: Install the Godot Android build template by clicking on ``Project`` -> ``Install Android Build Template...``
de: Installieren Sie die Godot-Android-Build-Vorlage, indem Sie auf ``Projekt`` -> ``Android Build Template installieren...`` klicken

source: Navigate to ``Project`` -> ``Export...``
de: Navigieren Sie zu ``Projekt`` -> ``Exportieren...``

source: In the ``Export`` window, create an ``Android export preset``
de: Erstellen Sie im Fenster ``Export`` eine ``Android Exportvorgabe``

source: In the ``Android export preset``, scroll to ``Gradle Build`` and set ``Use Gradle Build`` to ``true``
de: In der Voreinstellung ``Android-Export`` scrollen Sie zu ``Gradle-Build`` und setzen ``Gradle-Build verwenden`` auf ``true``

source: Update the project's scripts as needed to access the plugin's functionality. For example::
de: Aktualisieren Sie die Skripte des Projekts nach Bedarf, um auf die Funktionen des Plugins zuzugreifen. Zum Beispiel::

source: Connect an Android device to your machine and run the project on it
de: Schließen Sie ein Android-Gerät an Ihren Rechner an und führen Sie das Projekt darauf aus

source: Using a v2 Android plugin as an Android library
de: Verwendung eines v2-Android-Plugins als Android-Bibliothek

source: Since they are also Android libraries, Godot v2 Android plugins can be stripped from their ``EditorExportPlugin`` packaging and provided as raw ``AAR`` binaries for use as libraries alongside the :ref:`Godot Android library <doc_android_library>` by Android apps.
de: Da sie auch Android-Bibliotheken sind, können Godot v2-Android-Plugins aus ihrer ``EditorExportPlugin``-Paketierung herausgenommen und als rohe ``AAR``-Binärdateien zur Verwendung als Bibliotheken neben der :ref:`Godot Android-Bibliothek <doc_android_library>` durch Android-Anwendungen bereitgestellt werden.

source: If targetting this use-case, make sure to include additional instructions for how the ``AAR`` binaries should be included (e.g: custom additions to the Android app's manifest).
de: Wenn Sie auf diesen Anwendungsfall abzielen, stellen Sie sicher, dass Sie zusätzliche Anweisungen einfügen, wie die ``AAR``-Binärdateien eingebunden werden sollen (z.B.: eigene Ergänzungen zum Manifest der Android-App).

source: Reference implementations
de: Referenzimplementierungen

source: `Godot Android Plugin Template <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
de: `Godot-Android-Plugin-Vorlage <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_

source: `GDExtension Android Plugin Template <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_
de: `GDExtension-Android-Plugin-Vorlage <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_

source: `Godot OpenXR Loaders <https://github.com/GodotVR/godot_openxr_loaders>`_
de: `Godot-OpenXR-Loader <https://github.com/GodotVR/godot_openxr_loaders>`_

source: Tips and Guidelines
de: Tipps und Leitlinien

source: Simplify access to the exposed Java / Kotlin APIs
de: Vereinfachen Sie den Zugang zu den exponierten Java / Kotlin APIs

source: To make it easier to access the exposed Java / Kotlin APIs in the Godot Editor, it's recommended to provide one (or multiple) gdscript wrapper class(es) for your plugin users to interface with.
de: Um den Zugriff auf die exponierten Java-/Kotlin-APIs im Godot-Editor zu erleichtern, wird empfohlen, eine (oder mehrere) gdscript-Wrapper-Klasse(n) bereitzustellen, mit der/denen sich die Benutzer Ihres Plugins verbinden können.

source: For example::
de: Zum Beispiel::

source: This may involve creating dummy plugins for the host OS just so the API is published to the editor. You can use the [godot-cpp-template](https://github.com/godotengine/godot-cpp-template) github template for reference on how to do so.
de: Dies kann die Erstellung von Dummy-Plugins für das Host-Betriebssystem beinhalten, nur damit die API für den Editor veröffentlicht wird. Sie können die [godot-cpp-template](https://github.com/godotengine/godot-cpp-template) Github-Vorlage als Referenz für diese Vorgehensweise verwenden.

source: Godot crashes upon load
de: Godot stürzt beim Laden ab

source: Check ``adb logcat`` for possible problems, then:
de: Überprüfen Sie ``adb logcat`` auf mögliche Probleme, dann:

source: Check that the methods exposed by the plugin used the following Java types: ``void``, ``boolean``, ``int``, ``float``, ``java.lang.String``, ``org.godotengine.godot.Dictionary``, ``int[]``, ``byte[]``, ``float[]``, ``java.lang.String[]``.
de: Prüfen Sie, ob die Methoden, die das Plugin bereitstellt, die folgenden Java-Typen verwenden: ``void``, ``boolean``, ``int``, ``float``, ``java.lang.String``, ``org.godotengine.godot.Dictionary``, ``int[]``, ``byte[]``, ``float[]``, ``java.lang.String[]``.

source: More complex datatypes are not supported for now.
de: Komplexere Datentypen werden derzeit nicht unterstützt.

source: Translation status
de: Übersetzungsstatus
