Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_library.po
Languages: de

source: The Godot Engine for Android platforms is designed to be used as an `Android library <https://developer.android.com/studio/projects/android-library>`_. This architecture enables several key features on Android platforms:
de: Die Godot-Engine für Android-Plattformen ist so konzipiert, dass sie als `Android-Bibliothek <https://developer.android.com/studio/projects/android-library>`_ verwendet werden kann. Diese Architektur ermöglicht verschiedene wichtige Features auf Android-Plattformen:

source: Ability to integrate the Gradle build system within the Godot Editor, which provides the ability to leverage more components from the Android ecosystem such as libraries and tools
de: Möglichkeit der Integration des Gradle-Buildsystems in den Godot-Editor, wodurch mehr Komponenten aus dem Android-Ökosystem wie Bibliotheken und Tools genutzt werden können

source: Ability to make the engine portable and embeddable:
de: Möglichkeit, die Engine portabel und einbettbar zu machen:

source: Key in enabling the port of the Godot Editor to Android and mobile XR devices
de: Entscheidend für die Portierung des Godot-Editors auf Android- und mobile XR-Geräte

source: Key in allowing the integration and reuse of Godot's capabilities within existing codebase
de: Entscheidend für die Integration und Wiederverwendung der Godot-Funktionen in der bestehenden Codebasis

source: Below we describe some of the use-cases and scenarios this architecture enables.
de: Im Folgenden beschreiben wir einige der Anwendungsfälle und Szenarien, die diese Architektur ermöglicht.

source: Using the Godot Android library
de: Verwendung der Godot Android-Bibliothek

source: The Godot Android library is packaged as an AAR archive file and hosted on `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ along with `its documentation <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_.
de: Die Godot Android-Bibliothek ist als AAR-Archivdatei verpackt und wird auf `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ zusammen mit `ihrer Dokumentation <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_ bereitgestellt.

source: It provides access to Godot APIs and capabilities on Android platforms for the following non-exhaustive use-cases.
de: Es bietet Zugang zu Godot-APIs und -Funktionen auf Android-Plattformen für die folgenden Anwendungsfälle (kein Anspruch auf Vollständigkeit).

source: Android plugins are powerful tools to extend the capabilities of the Godot Engine by tapping into the functionality provided by Android platforms and ecosystem.
de: Android-Plugins sind leistungsstarke Werkzeuge zur Erweiterung der Fähigkeiten der Godot-Engine, indem sie die von den Android-Plattformen und dem Ökosystem bereitgestellten Funktionen nutzen.

source: An Android plugin is an Android library with a dependency on the Godot Android library which the plugin uses to integrate into the engine's lifecycle and to access Godot APIs, granting it powerful capabilities such as GDExtension support which allows to update / mod the engine behavior as needed.
de: Ein Android-Plugin ist eine Android-Bibliothek mit einer Abhängigkeit von der Godot Android-Bibliothek, die das Plugin verwendet, um sich in den Lebenszyklus der Engine zu integrieren und auf Godot-APIs zuzugreifen, was ihm leistungsstarke Fähigkeiten wie die Unterstützung von GDExtensions verleiht, mit denen das Verhalten der Engine bei Bedarf aktualisiert/geändert werden kann.

source: For more information, see :ref:`Godot Android plugins <doc_android_plugin>`.
de: Für weitere Informationen siehe :ref:`Godot Android-Plugins <doc_android_plugin>`.

source: Embedding Godot in existing Android projects
de: Godot in bestehende Android-Projekte einbinden

source: The Godot Engine can be embedded within existing Android applications or libraries, allowing developers to leverage mature and battle-tested code and libraries better suited to a specific task.
de: Die Godot-Engine kann in bestehende Android-Anwendungen oder -Bibliotheken eingebettet werden, so dass Entwickler ausgereiften und erprobten Code und Bibliotheken nutzen können, die für eine bestimmte Aufgabe besser geeignet sind.

source: The hosting component is responsible for driving the engine lifecycle via Godot's Android APIs. These APIs can also be used to provide bidirectional communication between the host and the embedded Godot instance allowing for greater control over the desired experience.
de: Die Hosting-Komponente ist für die Steuerung des Engine-Lebenszyklus über die Android-APIs von Godot verantwortlich. Diese APIs können auch verwendet werden, um eine bidirektionale Kommunikation zwischen dem Host und der eingebetteten Godot-Instanz zu ermöglichen, was eine größere Kontrolle über das gewünschte Nutzererlebnis bietet.

source: We showcase how this is done using a sample Android app that embeds the Godot Engine as an Android view, and uses it to render 3D GLTF models.
de: Wir zeigen dies anhand einer Android-Beispielanwendung, die von der Godot-Engine als Android-Ansicht eingebettet wird und zum Rendern von 3D-GLTF-Modellen verwendet.

source: The `GLTF Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ sample app uses an `Android RecyclerView component <https://developer.android.com/develop/ui/views/layout/recyclerview>`_ to create a list of GLTF items, populated from `Kenney's Food Kit pack <https://kenney.nl/assets/food-kit>`_. When an item on the list is selected, the app's logic interacts with the embedded Godot Engine to render the selected GLTF item as a 3D model.
de: Die Beispielanwendung `GLTF-Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ verwendet eine `Android RecyclerView-Komponente <https://developer.android.com/develop/ui/views/layout/recyclerview>`_, um eine Liste von GLTF-Artikeln zu erstellen, die aus dem `Kenney's Food Kit-Paket <https://kenney.nl/assets/food-kit>`_ zusammengestellt werden. Wenn ein Element in der Liste ausgewählt wird, interagiert die Logik der App mit der eingebetteten Godot-Engine, um das ausgewählte GLTF-Element als 3D-Modell zu rendern.

source: The sample app source code can be found `on GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_. Follow the instructions on `its README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ to build and install it.
de: Der Quellcode der Beispielanwendung kann `auf GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ gefunden werden. Folgen Sie den Anweisungen in `der README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_, um sie zu erstellen und zu installieren.

source: Below we break-down the steps used to create the GLTF Viewer app.
de: Im Folgenden werden die Schritte zur Erstellung der GLTF-Viewer-App beschrieben.

source: Currently only a single instance of the Godot Engine is supported per process. You can configure the process the Android Activity runs under using the `android:process attribute <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_.
de: Derzeit wird nur eine einzige Instanz der Godot-Engine pro Prozess unterstützt. Sie können den Prozess konfigurieren, unter dem die Android-Aktivität ausgeführt wird, indem Sie das `Attribut android:process <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_ verwenden.

source: Automatic resizing / orientation configuration events are not supported and may cause a crash. You can disable those events:
de: Ereignisse zur automatischen Größenänderung/Ausrichtungskonfiguration werden nicht unterstützt und können einen Absturz verursachen. Sie können diese Ereignisse deaktivieren:

source: By locking to a specific orientation using the `android:screenOrientation attribute <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_.
de: Durch die Festlegung auf eine bestimmte Ausrichtung mit dem Attribut `android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_.

source: By declaring that the Activity will handle these configuration events using the `android:configChanges attribute <https://developer.android.com/guide/topics/manifest/activity-element#config>`_.
de: Durch die Deklaration, dass die Aktivität diese Konfigurationsereignisse mit dem Attribut `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_ behandeln wird.

source: 1. Create the Android app
de: 1. Erstellen Sie die Android-App

source: The Android sample app was created using `Android Studio <https://developer.android.com/studio>`_ and using `Gradle <https://developer.android.com/build>`_ as the build system.
de: Die Android-Beispiel-App wurde mit `Android Studio <https://developer.android.com/studio>`_ und mit `Gradle <https://developer.android.com/build>`_ als Buildsystem erstellt.

source: The Android ecosystem provides multiple tools, IDEs, build systems for creating Android apps so feel free to use what you're familiar with, and update the steps below accordingly (contributions to this documentation are welcomed as well!).
de: Das Android-Ökosystem bietet mehrere Tools, IDEs und Buildsysteme für die Erstellung von Android-Apps. Verwenden Sie also das, womit Sie vertraut sind, und aktualisieren Sie die folgenden Schritte entsprechend (Beiträge zu dieser Dokumentation sind ebenfalls willkommen!).

source: Set up an Android application project. It may be a brand new empty project, or an existing project
de: Erstellen Sie ein Android-Anwendungsprojekt. Dabei kann es sich um ein völlig neues, leeres Projekt oder um ein bestehendes Projekt handeln

source: Add the `maven dependency for the Godot Android library <https://central.sonatype.com/artifact/org.godotengine/godot>`_
de: Fügen Sie die `Maven-Abhängigkeit für die Godot Android-Bibliothek <https://central.sonatype.com/artifact/org.godotengine/godot>`_ hinzu

source: If using ``gradle``, add the following to the ``dependency`` section of the app's gradle build file. Make sure to update ``<version>`` to the latest version of the Godot Android library:
de: Wenn Sie ``gradle`` verwenden, fügen Sie das Folgende in den Abschnitt ``dependency`` der gradle-Build-Datei der App ein. Stellen Sie sicher, dass Sie ``<Version>`` auf die neueste Version der Godot Android Bibliothek aktualisieren:

source: If using ``gradle``, include the following ``aaptOptions`` configuration under the ``android > defaultConfig`` section of the app's gradle build file. Doing so allows ``gradle`` to include Godot's hidden directories when building the app binary.
de: Wenn Sie ``gradle`` verwenden, fügen Sie die folgende ``aaptOptions``-Konfiguration in den Abschnitt ``android > defaultConfig`` der gradle-Build-Datei der App ein. Dadurch kann ``gradle`` die versteckten Verzeichnisse von Godot einbeziehen, wenn die App-Binärdatei gebaut wird.

source: If your build system does not support including hidden directories, you can `configure the Godot project to not use hidden directories <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-application-config-use-hidden-project-data-directory>`_ by deselecting ``Project Settings... > Application > Config > Use Hidden Project Data Directory``.
de: Wenn Ihr Build-System die Einbeziehung versteckter Verzeichnisse nicht unterstützt, können Sie das Godot-Projekt so `konfigurieren, dass es keine versteckten Verzeichnisse verwendet <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-application-config-use-hidden-project-data-directory>`_, indem Sie ``Projekteinstellungen... > Anwendung > Konfig > Verstecktes Projektdatenverzeichnis verwenden`` deaktivieren.

source: Create / update the application's Activity that will be hosting the Godot Engine instance. For the sample app, this is `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_
de: Erstellen/aktualisieren Sie die Aktivität der Anwendung, in der die Godot-Engine-Instanz gehostet werden soll. Für die Beispielanwendung ist dies `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_

source: The host Activity should implement the `GodotHost interface <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
de: Die Host-Aktivität sollte die `GodotHost-Schnittstelle <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_ implementieren

source: The sample app uses `Fragments <https://developer.android.com/guide/fragments>`_ to organize its UI, so it uses `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_, a fragment component provided by the Godot Android library to automatically host and manage the Godot Engine instance.
de: Die Beispielanwendung verwendet `Fragments <https://developer.android.com/guide/fragments>`_, um ihre Benutzeroberfläche zu organisieren. Sie verwendet also `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_, eine Fragment-Komponente, die von der Godot Android-Bibliothek bereitgestellt wird, um die Godot-Engine-Instanz automatisch zu hosten und zu verwalten.

source: The Godot Android library also provide `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_, an Activity component that can be extended to automatically host and manage the Godot Engine instance.
de: Die Godot-Android-Bibliothek bietet auch `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_, eine Activity-Komponente, die erweitert werden kann, um die Godot-Engine-Instanz automatisch zu hosten und zu verwalten.

source: Alternatively, applications can directly create a `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_ instance, host and manage it themselves.
de: Alternativ können Anwendungen direkt eine `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_-Instanz erstellen, selbst hosten und verwalten.

source: Using `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_, the sample app creates a `runtime GodotPlugin instance <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_ that's used to send :ref:`signals <doc_signals>` to the ``gdscript`` logic
de: Mit `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_ erstellt die Beispielanwendung eine `Laufzeit-GodotPlugin-Instanz <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_, die verwendet wird, um :ref:`signals <doc_signals>` an die ``gdscript``-Logik zu senden

source: The runtime ``GodotPlugin`` can also be used by ``gdscript`` logic to access JVM methods. For more information, see :ref:`Godot Android plugins <doc_android_plugin>`.
de: Das ``GodotPlugin``-Runtime kann auch von der ``gdscript``-Logik verwendet werden, um auf JVM-Methoden zuzugreifen. Für weitere Informationen siehe :ref:`Godot Android plugins <doc_android_plugin>`.

source: Add any additional logic that will be used by your application
de: Fügen Sie zusätzliche Logik hinzu, die von Ihrer Anwendung verwendet werden soll

source: For the sample app, this includes adding the `ItemsSelectionFragment fragment <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ItemsSelectionFragment.kt>`_ (and related classes), a fragment used to build and show the list of GLTF items
de: Für die Beispielanwendung beinhaltet dies das Hinzufügen des Fragments `ItemsSelectionFragment <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ItemsSelectionFragment.kt>`_ (und zugehöriger Klassen), ein Fragment, das zum Erstellen und Anzeigen der Liste der GLTF-Elemente verwendet wird

source: Open the ``AndroidManifest.xml`` file, and configure the orientation if needed using the `android:screenOrientation attribute <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_
de: Öffnen Sie die Datei ``AndroidManifest.xml`` und konfigurieren Sie die Ausrichtung, falls erforderlich, mit dem Attribut `android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_

source: If needed, disable automatic resizing / orientation configuration changes using the `android:configChanges attribute <https://developer.android.com/guide/topics/manifest/activity-element#config>`_
de: Deaktivieren Sie bei Bedarf die automatische Größenanpassung/Orientierungsänderung der Konfiguration mit dem Attribut `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_

source: 2. Create the Godot project
de: 2. Erstellen Sie das Godot-Projekt

source: On Android, Godot's project files are exported to the ``assets`` directory of the generated ``apk`` binary.
de: Unter Android werden die Godot-Projektdateien in das Verzeichnis ``assets`` der erzeugten ``apk``-Binärdatei exportiert.

source: We leverage that architecture to bind our Android app and Godot project together by creating the Godot project in the Android app's ``assets`` directory.
de: Wir nutzen diese Architektur, um unsere Android-App und das Godot-Projekt miteinander zu verbinden, indem wir das Godot-Projekt im Verzeichnis ``assets`` der Android-App erstellen.

source: Note that it's also possible to create the Godot project in a separate directory and export it as a `PCK or ZIP file <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_ to the Android app's ``assets`` directory. Using this approach requires passing the ``--main-pack <pck_or_zip_filepath_relative_to_assets_dir>`` argument to the hosted Godot Engine instance using `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_.
de: Beachten Sie, dass es auch möglich ist, das Godot-Projekt in einem separaten Verzeichnis zu erstellen und es als `PCK oder ZIP-Datei <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_ in das Verzeichnis ``assets`` der Android-App zu exportieren. Dieser Ansatz erfordert die Übergabe des Arguments ``--main-pack <pck_or_zip_filepath_relative_to_assets_dir>`` an die gehostete Godot-Engine-Instanz mit `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_.

source: The instructions below and the sample app follow the first approach of creating the Godot project in the Android app's ``assets`` directory.
de: Die folgenden Anweisungen und die Beispiel-App folgen dem ersten Ansatz, bei dem das Godot-Projekt im Verzeichnis ``assets`` der Android-App erstellt wird.

source: As mentioned in the **note** above, open the Godot Editor and create a Godot project directly (no subfolder) in the ``assets`` directory of the Android application project
de: Wie in der **Anmerkung** oben erwähnt, öffnen Sie den Godot-Editor und erstellen ein Godot-Projekt direkt (kein Unterordner) im Verzeichnis ``assets`` des Android-Anwendungsprojekts

source: See the sample app's `Godot project <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_ for reference
de: Siehe das `Godot-Projekt <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_ der Beispielanwendung als Referenz

source: Configure the Godot project as desired
de: Konfigurieren Sie das Godot-Projekt wie gewünscht

source: Make sure the `orientation <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_ set for the Godot project matches the one set in the Android app's manifest
de: Vergewissern Sie sich, dass die für das Godot-Projekt eingestellte `Ausrichtung <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_ mit der im Manifest der Android-App eingestellten übereinstimmt

source: For Android, make sure `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ is set to `true`
de: Für Android stellen Sie sicher, dass `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ auf `true` gesetzt ist

source: Update the Godot project script logic as needed
de: Aktualisieren Sie die Logik des Godot-Projektskripts nach Bedarf

source: For the sample app, the `script logic <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_ queries for the runtime ``GodotPlugin`` instance and uses it to register for signals fired by the app logic
de: Für die Beispielanwendung fragt die `Skriptlogik <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_ die ``GodotPlugin``-Runtime-Instanz ab und verwendet sie, um sich für Signale zu registrieren, die von der Anwendungslogik ausgelöst werden

source: The app logic fires a signal every time an item is selected in the list. The signal contains the filepath of the GLTF model, which is used by the ``gdscript`` logic to render the model.
de: Die Anwendungslogik feuert jedes Mal ein Signal ab, wenn ein Element in der Liste ausgewählt wird. Das Signal enthält den Dateipfad des GLTF-Modells, der von der ``gdscript``-Logik zum Rendern des Modells verwendet wird.

source: 3. Build and run the app
de: 3. Bauen und starten Sie die App
