Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_*_app_purchases.po
Languages: de

source: Android in-app purchases
de: Android In-App-Käufe

source: Godot offers a first-party ``GodotGooglePlayBilling`` Android plugin compatible with Godot 4 which uses the `Google Play Billing library <https://developer.android.com/google/play/billing>`_.
de: Godot bietet ein eigenes ``GodotGooglePlayBilling`` Android-Plugin, das mit Godot 4 kompatibel ist und die `Google Play Billing-Bibliothek <https://developer.android.com/google/play/billing>`_ verwendet.

source: Usage
de: Verwendung

source: Getting started
de: Erste Schritte

source: Make sure you have enabled and successfully set up :ref:`Android Gradle Builds <doc_android_gradle_build>`. Follow the compiling instructions on the ``GodotGooglePlayBilling`` `github page <https://github.com/godotengine/godot-google-play-billing>`__.
de: Stellen Sie sicher, dass Sie :ref:`Android Gradle-Builds <doc_android_gradle_build>` aktiviert und erfolgreich eingerichtet haben. Folgen Sie den Kompilierungsanweisungen auf der ``GodotGooglePlayBilling`` `Github-Seite <https://github.com/godotengine/godot-google-play-billing>`__.

source: Then put the files `./godot-google-play-billing/build/outputs/aar/GodotGooglePlayBilling.***.release.aar` and `./GodotGooglePlayBilling.gdap` into your project in the `res://android/plugins` folder.
de: Legen Sie dann die Dateien `./godot-google-play-billing/build/outputs/aar/GodotGooglePlayBilling.***.release.aar` und `./GodotGooglePlayBilling.gdap` in Ihr Projekt im Ordner `res://android/plugins`.

source: The plugin should now show up in the Android export settings, where you can enable it.
de: Das Plugin sollte nun in den Android-Exporteinstellungen auftauchen, wo Sie es aktivieren können.

source: Initialize the plugin
de: Initialisieren Sie das Plugin

source: To use the ``GodotGooglePlayBilling`` API:
de: Um die ``GodotGooglePlayBilling``-API zu verwenden:

source: Obtain a reference to the ``GodotGooglePlayBilling`` singleton
de: Beschaffen Sie sich eine Referenz auf das Singleton ``GodotGooglePlayBilling``

source: Connect handlers for the plugin signals
de: Verknüpfen Sie Handler für die Signale des Plugins

source: Call ``startConnection``
de: Rufen Sie ``startConnection`` auf

source: Initialization example:
de: Initialisierungsbeispiel:

source: The API must be in a connected state prior to use. The ``connected`` signal is sent when the connection process succeeds. You can also use ``isReady()`` to determine if the plugin is ready for use. The ``getConnectionState()`` function returns the current connection state of the plugin.
de: Die API muss sich vor der Verwendung in einem Verbindungszustand befinden. Das Signal ``connected`` wird gesendet, wenn der Verbindungsprozess erfolgreich war. Sie können auch ``isReady()`` verwenden, um festzustellen, ob das Plugin bereit zur Benutzung ist. Die Funktion ``getConnectionState()`` gibt den aktuellen Verbindungsstatus des Plugins zurück.

source: Return values for ``getConnectionState()``:
de: Rückgabewerte für ``getConnectionState()``:

source: Query available items
de: Verfügbare Elemente abfragen

source: Once the API has connected, query SKUs using ``querySkuDetails()``. You must successfully complete a SKU query before calling the ``purchase()`` or ``queryPurchases()`` functions, or they will return an error. ``querySkuDetails()`` takes two parameters: an array of SKU name strings, and a string specifying the type of SKU being queried. The SKU type string should be ``"inapp"`` for normal in-app purchases or ``"subs"`` for subscriptions. The name strings in the array should match the SKU product ids defined in the Google Play Console entry for your app.
de: Sobald die API verbunden ist, können Sie die SKUs mit ``querySkuDetails()`` abfragen. Sie müssen eine SKU-Abfrage erfolgreich abschließen, bevor Sie die Funktionen ``purchase()`` oder ``queryPurchases()`` aufrufen, sonst geben diese einen Fehler zurück. Die Funktion ``querySkuDetails()`` benötigt zwei Parameter: ein Array von SKU-Namen und einen String, der den Typ der abgefragten SKU angibt. Der SKU-Typ String sollte ``"inapp"`` für normale In-App Käufe oder ``"subs"`` für Abonnements sein. Die Namensstrings im Array sollten mit den SKU-Produkt-IDs übereinstimmen, die im Eintrag in der Google Play Console für Ihre App definiert sind.

source: Example use of ``querySkuDetails()``:
de: Beispiel für die Verwendung von ``querySkuDetails()``:

source: Query user purchases
de: Abfrage von Nutzerkäufen

source: To retrieve a user's purchases, call the ``queryPurchases()`` function passing a string with the type of SKU to query. The SKU type string should be ``"inapp"`` for normal in-app purchases or ``"subs"`` for subscriptions. The ``query_purchases_response`` signal is sent with the result. The signal has a single parameter: a :ref:`Dictionary <class_Dictionary>` with a status code and either an array of purchases or an error message. Only active subscriptions and non-consumed one-time purchases are included in the purchase array.
de: Um die Einkäufe eines Benutzers abzufragen, rufen Sie die Funktion ``queryPurchases()`` auf und übergeben einen String mit dem Typ der abzufragenden SKU. Der SKU-Typ String sollte ``"inapp"`` für normale In-App-Käufe oder ``"subs"`` für Abonnements sein. Das Signal ``query_purchases_response`` wird mit dem Ergebnis gesendet. Das Signal hat einen einzigen Parameter: ein :ref:`Dictionary <class_Dictionary>` mit einem Statuscode und entweder einem Array von Käufen oder einer Fehlermeldung. Nur aktive Abonnements und nicht verbrauchte einmalige Käufe werden in das Kauf-Array aufgenommen.

source: Example use of ``queryPurchases()``:
de: Beispiel für die Verwendung von ``queryPurchases()``:

source: You should query purchases during startup after successfully retrieving SKU details. Since the user may make a purchase or resolve a pending transaction from outside your app, you should recheck for purchases when resuming from the background. To accomplish this, you can use the ``billing_resume`` signal.
de: Sie sollten Käufe während des Starts abfragen, nachdem Sie erfolgreich SKU-Details abgerufen haben. Da der Benutzer möglicherweise einen Kauf tätigt oder eine ausstehende Transaktion von außerhalb Ihrer Anwendung auflöst, sollten Sie bei der Wiederaufnahme aus dem Hintergrund erneut nach Käufen suchen. Um dies zu erreichen, können Sie das Signal ``billing_resume`` verwenden.

source: Example use of ``billing_resume``:
de: Beispiel für die Verwendung von ``billing_resume``:

source: For more information on processing the purchase items returned by ``queryPurchases()``, see `Processing a purchase item`_
de: Weitere Informationen zur Verarbeitung der von ``queryPurchases()`` zurückgegebenen Einkaufsposten finden Sie unter `Bearbeitung eines Einkaufspostens`_

source: Purchase an item
de: Kauf eines Artikels

source: To initiate the purchase flow for an item, call ``purchase()`` passing the product id string of the SKU you wish to purchase. Reminder: you **must** query the SKU details for an item before you can pass it to ``purchase()``.
de: Um den Kaufvorgang für einen Artikel zu starten, rufen Sie ``purchase()`` auf und übergeben die Produkt-ID der SKU, die Sie kaufen möchten. Zur Erinnerung: Sie **müssen** die SKU-Details für einen Artikel abfragen, bevor Sie ihn an ``purchase()`` übergeben können.

source: Example use of ``purchase()``:
de: Beispiel für die Verwendung von ``purchase()``:

source: The payment flow will send a ``purchases_updated`` signal on success or a ``purchase_error`` signal on failure.
de: Der Zahlungsfluss sendet ein ``purchases_updated``-Signal bei Erfolg oder ein ``purchase_error``-Signal bei Misserfolg.

source: Processing a purchase item
de: Bearbeitung eines Kauf-Artikels

source: The ``query_purchases_response`` and ``purchases_updated`` signals provide an array of purchases in :ref:`Dictionary <class_Dictionary>` format. The purchase Dictionary includes keys that map to values of the Google Play Billing `Purchase <https://developer.android.com/reference/com/android/billingclient/api/Purchase>`_ class.
de: Die Signale ``query_purchases_response`` und ``purchases_updated`` liefern ein Array von Käufen im Format :ref:`Dictionary <class_Dictionary>`. Das Dictionary für Einkäufe enthält Schlüssel, die auf Werte der Google Play Billing-Klasse `Einkäufe <https://developer.android.com/reference/com/android/billingclient/api/Purchase>`_ abgebildet werden.

source: Purchase fields:
de: Kauf-Felder:

source: Check purchase state
de: Kaufstatus prüfen

source: Check the ``purchase_state`` value of a purchase to determine if a purchase was completed or is still pending.
de: Überprüfen Sie den Wert ``purchase_state`` eines Kaufs, um festzustellen, ob ein Kauf abgeschlossen wurde oder noch aussteht.

source: PurchaseState values:
de: PurchaseState-Werte:

source: If a purchase is in a ``PENDING`` state, you should not award the contents of the purchase or do any further processing of the purchase until it reaches the ``PURCHASED`` state. If you have a store interface, you may wish to display information about pending purchases needing to be completed in the Google Play Store. For more details on pending purchases, see `Handling pending transactions <https://developer.android.com/google/play/billing/integrate#pending>`_ in the Google Play Billing Library documentation.
de: Wenn sich ein Kauf in einem ``PENDING``-Status befindet, sollten Sie den Inhalt des Kaufs nicht vergeben oder den Kauf weiter bearbeiten, bis er den ``PURCHASED``-Status erreicht. Wenn Sie eine Store-Schnittstelle haben, möchten Sie vielleicht Informationen über ausstehende Käufe anzeigen, die im Google Play Store abgeschlossen werden müssen. Weitere Einzelheiten zu ausstehenden Käufen finden Sie unter `Umgang mit ausstehenden Transaktionen <https://developer.android.com/google/play/billing/integrate#pending>`_ in der Dokumentation der Google Play Billing Library.

source: Consumables
de: Verbrauchsartikel

source: If your in-app item is not a one-time purchase but a consumable item (e.g. coins) which can be purchased multiple times, you can consume an item by calling ``consumePurchase()`` passing the ``purchase_token`` value from the purchase dictionary. Calling ``consumePurchase()`` automatically acknowledges a purchase. Consuming a product allows the user to purchase it again, it will no longer appear in subsequent ``queryPurchases()`` calls unless it is repurchased.
de: Wenn es sich bei Ihrem In-App Gegenstand nicht um einen einmaligen Kauf handelt, sondern um einen Verbrauchsgegenstand (z.B. Münzen), der mehrmals gekauft werden kann, können Sie einen Gegenstand verbrauchen, indem Sie ``consumePurchase()`` aufrufen und den Wert ``purchase_token`` aus dem Kaufverzeichnis übergeben. Der Aufruf von ``consumePurchase()`` bestätigt automatisch einen Kauf. Wenn der Benutzer ein Produkt konsumiert, kann er es erneut kaufen. Es erscheint dann nicht mehr in nachfolgenden ``queryPurchases()`` Aufrufen, es sei denn, es wird erneut gekauft.

source: Example use of ``consumePurchase()``:
de: Beispiel für die Verwendung von ``consumePurchase()``:

source: Acknowledging purchases
de: Bestätigung von Käufen

source: If your in-app item is a one-time purchase, you must acknowledge the purchase by calling the ``acknowledgePurchase()`` function, passing the ``purchase_token`` value from the purchase dictionary. If you do not acknowledge a purchase within three days, the user automatically receives a refund, and Google Play revokes the purchase. If you are calling ``comsumePurchase()`` it automatically acknowledges the purchase and you do not need to call ``acknowledgePurchase()``.
de: Wenn es sich bei Ihrem In-App-Artikel um einen einmaligen Kauf handelt, müssen Sie den Kauf bestätigen, indem Sie die Funktion ``acknowledgePurchase()`` aufrufen und den Wert ``purchase_token`` aus dem Kauf-Dictionary übergeben. Wenn Sie einen Kauf nicht innerhalb von drei Tagen bestätigen, erhält der Nutzer automatisch eine Rückerstattung, und Google Play widerruft den Kauf. Wenn Sie ``comsumePurchase()`` aufrufen, wird der Kauf automatisch bestätigt und Sie müssen ``acknowledgePurchase()`` nicht aufrufen.

source: Example use of ``acknowledgePurchase()``:
de: Beispiel für die Verwendung von ``acknowledgePurchase()``:

source: Subscriptions
de: Abonnements

source: Subscriptions work mostly like regular in-app items. Use ``"subs"`` as the second argument to ``querySkuDetails()`` to get subscription details. Pass ``"subs"`` to ``queryPurchases()`` to get subscription purchase details.
de: Abonnements funktionieren größtenteils wie normale In-App-Artikel. Verwenden Sie ``"subs"`` als zweites Argument für ``querySkuDetails()``, um Details zu Abonnements zu erhalten. Übergeben Sie ``"subs"`` an ``queryPurchases()``, um Details zum Abonnementkauf zu erhalten.

source: You can check ``is_auto_renewing`` in the a subscription purchase returned from ``queryPurchases()`` to see if a user has cancelled an auto-renewing subscription.
de: Sie können ``is_auto_renewing`` in einem Abonnementkauf, der von ``queryPurchases()`` zurückgegeben wird, überprüfen, ob ein Benutzer ein sich automatisch verlängerndes Abonnement gekündigt hat.

source: You need to acknowledge new subscription purchases, but not automatic subscription renewals.
de: Sie müssen neue Abonnementkäufe bestätigen, aber nicht automatische Abonnementverlängerungen.

source: If you support upgrading or downgrading between different subscription levels, you should use ``updateSubscription()`` to use the subscription update flow to change an active subscription. Like ``purchase()``, results are returned by the ``purchases_updated`` and ``purchase_error`` signals. There are three parameters to ``updateSubscription()``:
de: Wenn Sie Upgrades oder Downgrades zwischen verschiedenen Abonnementstufen unterstützen, sollten Sie ``updateSubscription()`` verwenden, um den Abonnement-Aktualisierungsfluss zu nutzen, um ein aktives Abonnement zu ändern. Wie bei ``purchase()`` werden die Ergebnisse durch die Signale ``purchases_updated`` und ``purchase_error`` zurückgegeben. Es gibt drei Parameter für ``updateSubscription()``:

source: The purchase token of the currently active subscription
de: Das Kauf-Token des derzeit aktiven Abonnements

source: The product id string of the subscription SKU to change to
de: Der Produkt-ID-String der Abonnement-SKU, die geändert werden soll

source: The proration mode to apply to the subscription.
de: Der auf das Abonnement anzuwendende Anteilsmodus.

source: The proration values are defined as:
de: Die Anteilswerte sind wie folgt definiert:

source: Default behavior is ``IMMEDIATE_WITH_TIME_PRORATION``.
de: Das Default-Verhalten ist ``IMMEDIATE_WITH_TIME_PRORATION``.

source: Example use of ``updateSubscription``:
de: Beispiel für die Verwendung von ``updateSubscription``:

source: The ``confirmPriceChange()`` function can be used to launch price change confirmation flow for a subscription. Pass the product id of the subscription SKU subject to the price change. The result will be sent by the ``price_change_acknowledged`` signal.
de: Die Funktion ``confirmPriceChange()`` kann verwendet werden, um eine Preisänderung für ein Abonnement zu bestätigen. Übergeben Sie die Produkt-ID der Abonnement-SKU, die Gegenstand der Preisänderung ist. Das Ergebnis wird mit dem Signal ``price_change_acknowledged`` gesendet.

source: Example use of ``confirmPriceChange()``:
de: Beispiel für die Verwendung von ``confirmPriceChange()``:

source: Translation status
de: Übersetzungsstatus
