Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_library.po
Languages: de

source: Once you complete configuration of your Godot project, build and run the Android app. If set up correctly, the host Activity will initialize the embedded Godot Engine on startup. The Godot Engine will check the ``assets`` directory for project files to load (unless configured to look for a ``main pack``), and will proceed to run the project.
de: Sobald Sie die Konfiguration Ihres Godot-Projekts abgeschlossen haben, erstellen Sie die Android-App und führen Sie sie aus. Wenn die Host-Aktivität korrekt eingerichtet ist, wird die eingebettete Godot-Engine beim Start initialisiert. Die Godot-Engine sucht im Verzeichnis ``assets`` nach zu ladenden Projektdateien (es sei denn, sie ist so konfiguriert, dass sie nach einem ``main pack`` sucht) und führt das Projekt aus.

source: While the app is running on device, you can check `Android logcat <https://developer.android.com/studio/debug/logcat>`_ to investigate any errors or crashes.
de: Während die App auf dem Gerät läuft, können Sie `Android logcat <https://developer.android.com/studio/debug/logcat>`_ überprüfen, um eventuelle Fehler oder Abstürze zu untersuchen.

source: For reference, check the `build and install instructions <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ for the GLTF Viewer sample app.
de: Als Referenz können Sie die `Build- und Installationsanweisungen <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ für die GLTF Viewer Beispielanwendung lesen.

source: Translation status
de: Übersetzungsstatus
