Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: de

source: Introduction
de: Einführung

source: Android plugins are powerful tools to extend the capabilities of the Godot engine by tapping into the functionality provided by Android platforms and ecosystem.
de: Android-Plugins sind leistungsstarke Werkzeuge zur Erweiterung der Fähigkeiten der Godot-Engine, indem sie die von Android-Plattform und -Ökosystem bereitgestellten Funktionen nutzen.

source: For example in Godot 4, Android plugins are used to support multiple Android-based XR platforms without encumbering the core codebase with vendor specific code or binaries.
de: In Godot 4 werden beispielsweise Android-Plugins verwendet, um mehrere Android-basierte XR-Plattformen zu unterstützen, ohne die Kern-Codebasis mit herstellerspezifischem Code oder Binärdateien zu belasten.

source: Android plugin
de: Android-Plugins

source: **Version 1 (v1)** of the Android plugin system was introduced in Godot 3 and compatible with Godot 4.0 and 4.1. That version allowed developers to augment the Godot engine with Java, Kotlin and native functionality.
de: **Version 1 (v1)** des Android-Plugin-Systems wurde in Godot 3 eingeführt und ist mit Godot 4.0 und 4.1 kompatibel. Diese Version ermöglichte es Entwicklern, die Godot-Engine mit Java-, Kotlin- und nativen Funktionen zu erweitern.

source: Starting in Godot 4.2, Android plugins built on the v1 architecture are now deprecated. Instead, Godot 4.2 introduces a new **Version 2 (v2)** architecture for Android plugins.
de: Ab Godot 4.2 werden Android-Plugins, die auf der v1-Architektur basieren, nicht mehr verwendet. Stattdessen wird mit Godot 4.2 eine neue **Version 2 (v2)** Architektur für Android-Plugins eingeführt.

source: v2 Architecture
de: v2-Architektur

source: Godot Android plugin leverages the :ref:`Gradle build system <doc_android_gradle_build>`.
de: Das Godot Android Plugin nutzt das :ref:`Gradle Build System <doc_android_gradle_build>`.

source: Building on the previous v1 architecture, Android plugins continue to be derived from the `Android archive library <https://developer.android.com/studio/projects/android-library#aar-contents>`_.
de: Aufbauend auf der vorherigen v1-Architektur werden Android-Plugins weiterhin von der `Android-Archivbibliothek <https://developer.android.com/studio/projects/android-library#aar-contents>`_ abgeleitet.

source: At its core, a Godot Android plugin v2 is an Android library with a dependency on the :ref:`Godot Android library <doc_android_library>`, and a custom Android library manifest.
de: Im Kern ist ein Godot Android Plugin v2 eine Android-Bibliothek mit einer Abhängigkeit von der :ref:`Godot Android-Bibliothek <doc_android_library>` und einem benutzerdefinierten Android-Bibliotheksmanifest.

source: This architecture allows Android plugins to extend the functionality of the engine with:
de: Diese Architektur ermöglicht es Android-Plugins, die Funktionalität der Engine mit Folgendem zu erweitern:

source: Android platform APIs
de: APIs der Android-Plattform

source: Android libraries
de: Android-Bibliotheken

source: Kotlin and Java libraries
de: Kotlin- und Java-Bibliotheken

source: Native libraries (via JNI)
de: Native Bibliotheken (über JNI)

source: GDExtension libraries
de: GDExtension-Bibliotheken

source: Each plugin has an init class extending from the `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ class which is provided by the :ref:`Godot Android library <doc_android_library>`.
de: Jedes Plugin hat eine Init-Klasse, die von der Klasse `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ abgeleitet ist, die von der :ref:`Godot Android Bibliothek <doc_android_library>` bereitgestellt wird.

source: The ``GodotPlugin`` class provides APIs to access the running Godot instance and hook into its lifecycle. It is loaded at runtime by the Godot engine.
de: Die Klasse ``GodotPlugin`` bietet APIs, um auf die laufende Godot-Instanz zuzugreifen und sich in ihren Lebenszyklus einzuklinken. Sie wird zur Laufzeit von der Godot-Engine geladen.

source: v1 Android plugins required a custom ``gdap`` configuration file that was used by the Godot Editor to detect and load them. However this approach had several drawbacks, primary ones being that it lacked flexibility and departed from the `existing Godot EditorExportPlugin format, delivery and installation flow <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_.
de: v1 Android-Plugins erforderten eine eigene ``gdap``-Konfigurationsdatei, die vom Godot-Editor verwendet wurde, um die Plugins zu erkennen und zu laden. Dieser Ansatz hatte jedoch mehrere Nachteile, von denen der wichtigste darin bestand, dass es ihm an Flexibilität mangelte und er vom `bestehenden Godot-EditorExportPlugin-Format, -Bereitstellungs- und -Installationsfluss <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_ abwich.

source: This has been resolved for v2 Android plugins by deprecating the ``gdap`` packaging and configuration mechanism in favor of the existing Godot ``EditorExportPlugin`` packaging format. The ``EditorExportPlugin`` API in turn has been extended to properly support Android plugins.
de: Dieses Problem wurde für Android-Plugins der Version 2 behoben, indem der Paketierungs- und Konfigurationsmechanismus ``gdap`` zugunsten des bestehenden Godot-Paketierungsformats ``EditorExportPlugin`` veraltet wurde. Die ``EditorExportPlugin``-API wurde ihrerseits erweitert, um Android-Plugins korrekt zu unterstützen.

source: Building a v2 Android plugin
de: Erstellung eines v2-Android-Plugins

source: A github project template **is provided** at https://github.com/m4gr3d/Godot-Android-Plugin-Template as a **quickstart for building Godot Android plugins for Godot 4.2+**. You can follow the `template README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_ to set up your own Godot Android plugin project.
de: Eine Github-Projektvorlage **wird** unter https://github.com/m4gr3d/Godot-Android-Plugin-Template als **Schnellstart für die Erstellung von Godot-Android-Plugins für Godot 4.2+** bereitgestellt. Sie können der `Vorlage-README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_ folgen, um Ihr eigenes Godot-Android-Plugin-Projekt einzurichten.

source: To provide further understanding, here is a break-down of the steps used to create the project template:
de: Zum besseren Verständnis werden im Folgenden die Schritte zur Erstellung der Projektvorlage erläutert:

source: Create an Android library module using `these instructions <https://developer.android.com/studio/projects/android-library>`_
de: Erstellen Sie ein Android-Bibliotheksmodul mit `diesen Anweisungen <https://developer.android.com/studio/projects/android-library>`_

source: Add the Godot Android library as a dependency by updating the module's ``gradle`` `build file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/build.gradle.kts#L42>`_::
de: Fügen Sie die Godot-Android-Bibliothek als Abhängigkeit hinzu, indem Sie die ``gradle`` `Build-Datei <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/build.gradle.kts#L42>`_: aktualisieren::

source: The Godot Android library is `hosted on MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_, and updated for each release.
de: Die Godot-Android-Bibliothek wird `auf MavenCentral gehostet <https://central.sonatype.com/artifact/org.godotengine/godot>`_ und bei jeder Veröffentlichung aktualisiert.

source: Create `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_, an init class for the plugin extending `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_.
de: Erstellen Sie `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_, eine Init-Klasse für das Plugin, die `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ erweitert.

source: If the plugin exposes Kotlin or Java methods to be called from GDScript, they must be annotated with `@UsedByGodot <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/UsedByGodot.java#L45>`_. The name called from GDScript **must match the method name exactly**. There is **no** coercing ``snake_case`` to ``camelCase``. For example, from GDScript::
de: Wenn das Plugin Kotlin- oder Java-Methoden bereitstellt, die von GDScript aus aufgerufen werden sollen, müssen diese mit `@UsedByGodot <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/UsedByGodot.java#L45>`_ annotiert werden. Der Name, der von GDScript aufgerufen wird, **muss genau mit dem Methodennamen übereinstimmen**. Es gibt **keine** Erzwingung von ``snake_case`` zu ``camelCase``. Zum Beispiel, von GDScript::

source: If the plugin uses `signals <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_, the init class must return the set of signals used by overriding `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_. To emit signals, the plugin can use the `GodotPlugin::emitSignal(...) method <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_.
de: Wenn das Plugin `Signale <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_ verwendet, muss die init-Klasse den Satz der verwendeten Signale durch Überschreiben von `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_ zurückgeben. Um Signale auszusenden, kann das Plugin die Methode `GodotPlugin::emitSignal(...) <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_ verwenden.

source: Update the plugin ``AndroidManifest.xml`` `file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/src/main/AndroidManifest.xml>`_ with the following meta-data::
de: Aktualisieren Sie die ``AndroidManifest.xml`` `Datei <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/src/main/AndroidManifest.xml>`_ des Plugins mit den folgenden Metadaten::

source: Where:
de: Wobei:

source: ``PluginName`` is the name of the plugin
de: ``PluginName`` der Name des Plugins ist

source: ``plugin.init.ClassFullName`` is the full component name (package + class name) of the plugin init class (e.g: ``org.godotengine.plugin.android.template.GodotAndroidPlugin``).
de: ``plugin.init.ClassFullName`` der vollständige Komponentenname (Paket + Klassenname) der Plugin-Init-Klasse (z.B.: ``org.godotengine.plugin.android.template.GodotAndroidPlugin``) ist.

source: Create the `EditorExportPlugin configuration <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ to package the plugin. The steps used to create the configuration can be seen in the `Packaging a v2 Android plugin`_ section.
de: Erstellen Sie die `EditorExportPlugin-Konfiguration <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_, um das Plugin zu verpacken. Die Schritte zum Erstellen der Konfiguration sind im Abschnitt `Paketieren eines v2-Android-Plugins`_ zu sehen.

source: Building a v2 Android plugin with GDExtension capabilities
de: Erstellen eines v2-Android-Plugins mit GDExtension-Funktionen

source: Similar to GDNative support in v1 Android plugins, v2 Android plugins support the ability to integrate GDExtension capabilities.
de: Ähnlich wie die GDNative-Unterstützung in v1-Android-Plugins, unterstützen v2-Android-Plugins die Fähigkeit, GDExtension-Funktionen zu integrieren.

source: A github project template is provided at https://github.com/m4gr3d/GDExtension-Android-Plugin-Template as a quickstart for building GDExtension Android plugins for Godot 4.2+. You can follow the `template's README <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_ to set up your own Godot Android plugin project.
de: Eine Github-Projektvorlage wird unter https://github.com/m4gr3d/GDExtension-Android-Plugin-Template als Schnellstart für die Erstellung von GDExtension Android-Plugins für Godot 4.2+ bereitgestellt. Sie können der `README der Vorlage <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_ folgen, um Ihr eigenes Godot-Android-Plugin-Projekt einzurichten.

source: Migrating a v1 Android plugin to v2
de: Migrieren eines Android-Plugins von v1 nach v2

source: Use the following steps if you have a v1 Android plugin you want to migrate to v2:
de: Führen Sie die folgenden Schritte aus, wenn Sie ein Android-Plugin der Version 1 haben, das Sie auf die Version 2 migrieren möchten:

source: Update the plugin's manifest file:
de: Aktualisieren Sie die Manifestdatei des Plugins:

source: Change the ``org.godotengine.plugin.v1`` prefix to ``org.godotengine.plugin.v2``
de: Ändern Sie das Präfix ``org.godotengine.plugin.v1`` in ``org.godotengine.plugin.v2``

source: Update the Godot Android library build dependency:
de: Aktualisieren Sie die Build-Abhängigkeit der Godot Android-Bibliothek:

source: You can continue using the ``godot-lib.<version>.<status>.aar`` binary from `Godot's download page <https://godotengine.org/download>`_ if that's your preference. Make sure it's updated to the latest stable version.
de: Sie können weiterhin die Binärdatei ``godot-lib.<Version>.<Status>.aar`` von `Godot's download page <https://godotengine.org/download>`_ verwenden, wenn Sie das bevorzugen. Stellen Sie sicher, dass es auf die neueste stable-Version aktualisiert ist.

source: Or you can switch to the MavenCentral provided dependency::
de: Oder Sie können auf die von MavenCentral bereitgestellte Abhängigkeit wechseln::

source: After updating the Godot Android library dependency, sync or build the plugin and resolve any compile errors:
de: Nachdem Sie die Godot-Android-Bibliotheksabhängigkeit aktualisiert haben, synchronisieren oder erstellen Sie das Plugin und beheben Sie etwaige Kompilierungsfehler:

source: The ``Godot`` instance provided by ``GodotPlugin::getGodot()`` no longer has access to a ``android.content.Context`` reference. Use ``GodotPlugin::getActivity()`` instead.
de: Die ``Godot``-Instanz, die von ``GodotPlugin::getGodot()`` bereitgestellt wird, hat keinen Zugriff mehr auf eine ``android.content.Context``-Referenz. Verwenden Sie stattdessen ``GodotPlugin::getActivity()``.

source: Delete the ``gdap`` configuration file(s) and follow the instructions in the `Packaging a v2 Android plugin`_ section to set up the plugin configuration.
de: Löschen Sie die ``gdap``-Konfigurationsdatei(en) und folgen Sie den Anweisungen im Abschnitt `Paketierung eines v2-Android-Plugins`_, um die Plugin-Konfiguration einzurichten.

source: Packaging a v2 Android plugin
de: Paketierung eines v2-Android-Plugins

source: As mentioned, a v2 Android plugin is now provided to the Godot Editor as an ``EditorExportPlugin`` plugin, so it shares a lot of the `same packaging steps <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_.
de: Wie bereits erwähnt, wird ein v2 Android-Plugin jetzt als ``EditorExportPlugin``-Plugin für den Godot-Editor zur Verfügung gestellt, so dass es viele der `gleichen Paketierungsschritte <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_ teilt.

source: Add the plugin output binaries within the plugin directory (e.g: in ``addons/<plugin_name>/``)
de: Fügen Sie die Plugin-Ausgabe-Binärdateien in das Plugin-Verzeichnis ein (z.B.: in ``addons/<plugin_name>/``)

source: Add the `tool script <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_ for the export functionality within the plugin directory (e.g: in ``addons/<plugin_name>/``)
de: Fügen Sie das `Toolskript <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_ für die Exportfunktionalität in das Plugin-Verzeichnis ein (z.B.: in ``addons/<plugin_name>/``)

source: The created script must be a ``@tool`` script, or else it will not work properly
de: Das erstellte Skript muß ein ``@tool``-Skript sein, sonst funktioniert es nicht richtig

source: The export tool script is used to configure the Android plugin and hook it within the Godot Editor's export process. It should look something like this::
de: Das Export-Tool-Skript wird verwendet, um das Android-Plugin zu konfigurieren und es in den Exportprozess des Godot-Editors einzubinden. Es sollte in etwa so aussehen::

source: Here are the set of `EditorExportPlugin APIs <https://docs.godotengine.org/en/stable/classes/class_editorexportplugin.html>`_ most relevant to use in this tool script:
de: Hier sind die wichtigsten `EditorExportPlugin-APIs <https://docs.godotengine.org/en/stable/classes/class_editorexportplugin.html>`_, die in diesem Toolskript verwendet werden:

source: `_supports_platform <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-supports-platform>`_: returns ``true`` if the plugin supports the given platform. For Android plugins, this must return ``true`` when ``platform`` is `EditorExportPlatformAndroid <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html>`_
de: `_supports_platform <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-supports-platform>`_: gibt ``true`` zurück, wenn das Plugin die angegebene Plattform unterstützt. Für Android-Plugins muss dies ``true`` zurückgeben, wenn ``platform`` `EditorExportPlatformAndroid <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html>`_ ist

source: `_get_android_libraries <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-libraries>`_: retrieve the local paths of the Android libraries binaries (AAR files) provided by the plugin
de: `_get_android_libraries <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-libraries>`_: ermittelt die lokalen Pfade der vom Plugin bereitgestellten Android-Bibliotheken (AAR-Dateien)

source: `_get_android_dependencies <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies>`_: retrieve the set of Android maven dependencies (e.g: `org.godot.example:my-plugin:0.0.0`) provided by the plugin
de: `_get_android_dependencies <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies>`_: Abrufen des Satzes von Android-Maven-Abhängigkeiten (z.B.: `org.godot.example:my-plugin:0.0.0`), die vom Plugin bereitgestellt werden

source: `_get_android_dependencies_maven_repos <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies-maven-repos>`_: retrieve the urls of the maven repos for the android dependencies provided by ``_get_android_dependencies``
de: `_get_android_dependencies_maven_repos <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies-maven-repos>`_: liefert die URLs der Maven-Repos für die Android-Abhängigkeiten, die von ``_get_android_dependencies`` bereitgestellt werden

source: `_get_android_manifest_activity_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-activity-element-contents>`_: update the contents of the `<activity>` element in the generated Android manifest
de: `_get_android_manifest_activity_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-activity-element-contents>`_: aktualisiert den Inhalt des Elements `<activity>` im generierten Android-Manifest

source: `_get_android_manifest_application_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-application-element-contents>`_: update the contents of the `<application>` element in the generated Android manifest
de: `_get_android_manifest_application_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-application-element-contents>`_: aktualisiert den Inhalt des Elements `<application>` im generierten Android-Manifest

source: `_get_android_manifest_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-element-contents>`_: update the contents of the `<manifest>` element in the generated Android manifest
de: `_get_android_manifest_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-element-contents>`_: aktualisiert den Inhalt des Elements `<manifest>` im generierten Android-Manifest

source: The ``_get_android_manifest_*`` methods allow the plugin to automatically provide changes to the app's manifest which are preserved when the Godot Editor is updated, resolving a long standing issue with v1 Android plugins.
de: Die ``_get_android_manifest_*``-Methoden ermöglichen es dem Plugin, automatisch Änderungen am Manifest der App bereitzustellen, die bei einer Aktualisierung des Godot-Editors erhalten bleiben, wodurch ein langjähriges Problem mit v1-Android-Plugins behoben wird.

source: Create a ``plugin.cfg``. This is an INI file with metadata about your plugin::
de: Erstellen Sie eine ``plugin.cfg``. Dies ist eine INI-Datei mit Metadaten über Ihr Plugin::
