Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/index.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, uk, zh_tw

source: Submit an issue or pull request on the `GitHub repository <https://github.com/godotengine/godot-docs/issues>`_, help us `translate the documentation <https://hosted.weblate.org/engage/godot-engine/>`_ into your language, or talk to us on the ``#documentation`` channel on the `Godot Contributors Chat <https://chat.godotengine.org/>`_!
cs: Ohlašte problém (issue) nebo zašlete požadavek (pull request) na `GitHub <https://github.com/godotengine/godot-docs/issues>`_ , pomozte nám `přeložit dokumentaci <https://hosted.weblate.org/engage/godot-engine/>`_ do vašeho jazyka nebo si s námi promluvte na ``#documentation`` kanálu na `Godot Contributors Chat <https://chat.godotengine.org/>`_!
de: Reichen Sie einen Fehler oder Pull Request im `GitHub-Repository <https://github.com/godotengine/godot-docs/issues>`_ ein, helfen Sie uns, `die Dokumentation <https://hosted.weblate.org/engage/godot-engine/>`_ in Ihre Sprache zu übersetzen, oder diskutieren Sie mit uns im ``#documentation``-Kanal des `Godot Mitwirkenden-Chat <https://chat.godotengine.org/>`_!
es: Envíe una incidencia o un pull request en el `repositorio de GitHub <https://github.com/godotengine/godot-docs/issues>`_ , ayúdenos a `traducir la documentación <https://hosted.weblate.org/engage/godot-engine/>`_ a su idioma, o hable con nosotros en el canal de ``#documentation`` en `Godot Contributors Chat <https://chat.godotengine.org/>`_!
fr: Soumettez un rapport de bug ou une *pull request* sur le `dépôt GitHub <https://github.com/godotengine/godot-docs/issues>`_, aidez nous à `traduire la documentation <https://hosted.weblate.org/engage/godot-engine/>`_ dans votre langue, ou discutez avec nous sur le canal ``#documentation`` sur le `Chat des contributeurs de Godot <https://chat.godotengine.org/>`_ !
it: Segnala un problema o fai una pull request sul `repository di GitHub <https://github.com/godotengine/godot-docs/issues>`_, aiutaci a `tradurre la documentazione <https://hosted.weblate.org/engage/godot-engine/>`_ nella tua lingua, o rimani in contatto con noi sia sul canale della ``#documentation`` su `Chat Contributori Godot <https://chat.godotengine.org/>`_!
ja: \ `GitHub リポジトリ <https://github.com/godotengine/godot-docs/issues>`_\ でissueやプルリクエストを提出したり、\ `ドキュメントの翻訳 <https://hosted.weblate.org/engage/godot-engine/>`_\ を手伝ってください。または、\ `Godot Contributors Chat <https://chat.godotengine.org/>`_\ の\ ``#documentation``\ チャンネルで話してください！
ko: `GitHub 저장소 <https://github.com/godotengine/godot-docs/issues>`_\ 에 Issue 제출, Pull Request를 하고 `문서 현지화 <https://hosted.weblate.org/engage/godot-engine/>`_\ 를 돕거나 `Godot Contributors Chat <http://chat.godotengine.org/>`_\ 의 ``#documentation``\ 채널에서 저희에게 이야기할 수 있습니다!
pl: Zgłoś problem lub zaproponuj zmianę w naszym `repozytorium na GitHubie <https://github.com/godotengine/godot-docs/issues>`_, pomóż w `tłumaczeniu dokumentacji <https://hosted.weblate.org/engage/godot-engine/>`_ na twój język, lub odwiedź kanał ``#documentation`` na `Czacie Twórców Godota <https://chat.godotengine.org/>`_!
pt_br: Envie um "issue" ou "pull request" no `Repositório do GitHub <https://github.com/godotengine/godot-docs/issues>`_, ajude-nos a `traduzir a documentação <https://hosted.weblate.org/engage/godot-engine/>`_ para o seu idioma ou fale conosco no canal ``#documentation`` do `Chat de Contribuidores do Godot <https://chat.godotengine.org/>`_!
ru: Отправьте жалобу или запрос на изменение кода в `репозитории GitHub <https://github.com/godotengine/godot-docs/issues>`_, помогите нам `перевести документацию <https://hosted.weblate.org/engage/godot-engine />`_ на свой язык или свяжитесь с нами в канале ``#documentation`` в `чате участников Godot <https://chat.godotengine.org/>`_!
tr: `GitHub deposu <https://github.com/godotengine/godot-docs/issues>`_ üzerinde bir sorun bildirin veya bir çekme isteğinde (pull request) bulunun, kendi dilinizde `belgeleri çevirme <https://hosted.weblate.org/engage/godot-engine/>`_ 'ye yardım edin, veya `Godot Contributors Chat <https://chat.godotengine.org/>`_ üzerinden ``#documentation`` kanalında bizlerle sohbete katılın (`Discord <https://discord.gg/zH7NUgz>`)!
uk: Створіть повідомлення щодо вади, або запит на злиття коду (pull request), у `сховищі GitHub <https://github.com/godotengine/godot-docs/issues>`_, допоможіть нам `перекласти документацію <https://hosted.weblate.org/engage/godot-engine/>`_ вашою рідною мовою, або візьміть участь у обговоренні на каналі ``#documentation`` у `Godot Contributors Chat <https://chat.godotengine.org/>`_!
zh_tw: 您可以在 `GitHub Repository <https://github.com/godotengine/godot-docs/issues>`_ 上送出 Issue 或 Pull Request、幫我們替您的語言 `翻譯這份文件 <https://hosted.weblate.org/engage/godot-engine/>`_ 、也可以在 `Godot Contributors Chat <https://chat.godotengine.org/>`_ 上的 ``#documentation`` 頻道上與我們交流！

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
it: Stato della traduzione
ja: 翻訳ステータス
ko: 번역 상태
pl: Status tłumaczenia
pt_br: Progresso da Tradução
ru: Статус перевода
tr: Çeviri durumu
uk: Стан перекладу
zh_tw: 翻譯狀態

source: Offline documentation
cs: Offline dokumentace
de: Offline-Dokumentation
es: Documentación sin conexión
fr: Documentation hors ligne
it: Documentazione offline
ja: オフラインドキュメント
ko: 오프라인 문서
pl: Dokumentacja offline
pt_br: Documentação offline
ru: Офлайн документация
tr: Çevrimdışı belgeler
uk: Оффлайн документація
zh_tw: 離線文件

source: To browse the documentation offline, you can use the mirror of the documentation hosted on `DevDocs <https://devdocs.io/godot/>`__. To enable offline browsing on DevDocs, you need to:
cs: K procházení offline dokumentace, můžete použít odkaz k dokumentaci umístěné na adrese `DevDocs <https://devdocs.io/godot/>`__. Chcete-li povolit procházení offline, na stránkách DevDocs musíte:
de: Um die Dokumentation offline zu durchsuchen, können Sie die Kopie der Dokumentation auf dem Spiegel-Server verwenden, die auf `DevDocs <https://devdocs.io/godot/>`__ gehostet wird. Um die Offline-Durchsuchung auf DevDocs zu aktivieren, müssen Sie Folgendes tun:
es: Para consultar la documentación sin conexión, puedes utilizar la réplica de la documentación alojada en `DevDocs <https://devdocs.io/godot/>`__. Para habilitar la navegación sin conexión en DevDocs, necesitas:
fr: Pour faire des recherches dans la documentation hors-ligne, vous pouvez utiliser le mirroir de la documentation héberger sur `DevDocs <https://devdocs.io/godot/>`_. Pour rendre possible la recherche hors-ligne sur DevDocs, vous devez :
it: Per navigare la documentazione offline, puoi utilizzare la versione “mirror” della documentazione su `DevDocs <https://devdocs.io/godot/>`__. Per abilitare la navigazione offline su DevDocs, bisogna:
ja: オフライン時にドキュメントを参照する時、`DevDocs <https://devdocs.io/godot/>`__にある英語版のドキュメントを読めます。DevDocsでオフラインブラウジングを有効にするには：
ko: 문서를 오프라인에서 읽고 싶으시다면, `DevDocs <https://devdocs.io/godot/>`__ 에서 호스팅되는 문서의 복제본을 사용할 수 있습니다. DevDocs에서 오프라인 조회를 활성화하시려면 다음을 해 주세요:
pl: Ąby przeglądać dokumentację offline, możesz użyć lustrzanej kopii dokumentacji utrzymywanej na `DevDocs<https://devdocs.io/godot/>`__. Aby włączyć przeglądanie offline na DevDocs, musisz:
pt_br: Para acessar a documentação offline, você pode usar o espelho da documentação hospedada em `DevDocs <https://devdocs.io/godot/>`__. Para Habilitar a navegação offline no DevDocs, você precisa:
ru: Для просмотра документации оффлайн, Вы можете использовать зеркало документации, размещенное на `DevDocs <https://devdocs.io/godot/>`__. Для включения автономного просмотра на DevDocs вам нужно:
tr: Belgelere çevrimdışı göz atmak için, `DevDocs <https://devdocs.io/godot/>`__ üzerinde barındırılan belgelerin aynasını kullanabilirsiniz. DevDocs'ta çevrimdışı taramayı etkinleştirmek için şunları yapmanız gerekir:
uk: Щоб переглядати документацію офлайн, ви можете використовувати дзеркало документації, розміщене на `DevDocs <https://devdocs.io/godot/>`__. Щоб увімкнути офлайн-перегляд на DevDocs, вам потрібно:
zh_tw: 要離線瀏覽文件，您可以使用在 DevDocs <https://devdocs.io/godot/> 上托管的文件的鏡像。要在DevDocs上啟用離線瀏覽，您需要：

source: Click the three dots in the top-left corner, choose **Preferences**.
cs: Klikněte na tři tečky umístěné v levém horním rohu a vyberte **Preferences**.
de: Klicken Sie auf die drei Punkte in der oberen, linken Ecke und wählen Sie **Einstellungen**.
es: Haz clic en los tres puntos en la esquina superior izquierda, elige **Preferencias**.
fr: Cliquez sur les 3 points dans le coin en haut à gauche, choisir **Preferences**.
it: Premi i tre puntini nell'angolo in alto a sinistra, scegli **Preferences**.
ja: 左上にある三連ドットをクリックして**Preferences**を選びます。
ko: 좌상단의 끄트머리에 있는 세 개의 점을 클릭하고, **Preferences**를 선택합니다.
pl: Kliknij trzy kropki w lewym górnym rogu i wybierz **Preferencje**.
pt_br: Clicar nos 3 pontos no canto superior esquerdo, escolher **Preferências**.
ru: Нажмите на три точки в верхнем левом углу и выберите **Настройки**.
tr: Sol üst köşedeki üç noktaya tıklayın, **Tercihler** öğesini seçin.
uk: Клацніть на три крапки в лівому верхньому куті, виберіть **Налаштування**.
zh_tw: 點擊左上角的三個點，選擇 偏好設定。

source: Enable the desired version of the Godot documentation by checking the box next to it in the sidebar.
cs: Povolte požadovanou verzi dokumentace Godot zaškrtnutím políčka vedle ní v postranním panelu.
de: Aktivieren Sie die gewünschte Version der Godot-Dokumentation, indem Sie das Kästchen neben ihr in der Seitenleiste auswählen.
es: Habilita la versión deseada de la documentación de Godot marcando la casilla junto a ella en la barra lateral.
fr: Active la version souhaité de la documentation Godot en cliquant sur la boîte à côté du panneau latéral.
it: Abilitare la versione desiderata della documentazione di Godot spuntando il relativo flag raggiungibile dalla sidebar laterale a sinistra espandendo la voce "Godot".
ja: サイドバー内のチェックボックスを使い、任意のバージョンのGodotドキュメントを有効化します。
ko: 사이드바에서 원하는 고도 문서 버전 옆의 박스를 클릭하여 그것을 활성화합니다.
pl: Włącz pożądaną wersję dokumentacji Godota zaznaczając pole obok niej na pasku bocznym.
pt_br: Habilitar a versão desejada da documentação do Godot marcando a caixa ao lado na barra lateral.
ru: Включите необходимую версию документации Godot, установив флажок рядом с ней в боковой панели.
tr: Kenar çubuğunda yanındaki kutuyu işaretleyerek Godot belgelerinin istediğiniz sürümünü etkinleştirin.
uk: Увімкніть потрібну версію документації Godot, поставивши прапорець поруч із нею у бічній панелі.
zh_tw: 在側邊欄中，勾選您所需的Godot文件版本以啟用它。

source: Click the three dots in the top-left corner, choose **Offline data**.
cs: Klikněte na tři tečky umístěné v levém horním rohu a vyberte **Offline data**.
de: Klicken Sie auf die drei Punkte in der oberen, linken Ecke und wählen Sie **Offline-Daten**.
es: Haz clic en los tres puntos en la esquina superior izquierda, elige **Offline data**.
fr: Cliquez sur les trois points dans le coin en haut à gauche, choisissez **Offline Data**.
it: Clicca i tre puntini in alto a sinistra, e seleziona **Offline data**.
ja: 左上の三連ドットをクリックし、**Offline data**を選択します。
ko: 좌상단 끄트머리의 세개의 점을 클릭하고 **Offline data**를 선택합니다.
pl: Kliknij trzy kropki w górnym lewym rogu, wybierz **Dane offline**.
pt_br: Clicar nos três pontos no canto superior esquerdo, escolher a opção **Dados offline**.
ru: Нажмите на три точки в верхнем-левом углу и выберите **Офлайн данные**.
tr: Sol üst köşedeki üç noktaya tıklayın, **Çevrimdışı veri** öğesini seçin.
uk: Клацніть на три крапки в лівому верхньому куті, виберіть **Офлайн-дані**.
zh_tw: 點擊左上角的三個點，選擇 離線資料。

source: Click the **Install** link next to the Godot documentation.
cs: Klikněte na odkaz **Install** vedle dokumentace Godot.
de: Klicken Sie auf den **Installieren** Link neben der Godot Dokumentation.
es: Haz clic en el enlace **Install** junto a la documentación de Godot.
fr: Cliquez sur le lien **Installer** à côté de la documentation Godot.
it: Clicca il link **installa** a fianco della documentazione di Godot.
ja: Godotドキュメントの隣にある**Install**リンクをクリックします。
ko: Godot 문서 옆의 **설치** 링크를 누르세요.
pl: Kliknij link **Instaluje** obok dokumentacji Godota.
pt_br: Clique no link **Instalar** próximo à documentação do Godot.
ru: Нажмите ссылку **Установить** расположенной рядом с документацией Godot.
tr: Godot belgelerinin yanındaki **Yükle** bağlantısını tıklayın.
uk: Клацніть посилання **Встановити**, яке знаходиться поруч із документацією Godot.
zh_tw: 點擊**安裝**在Godot說明文件旁邊的連結。

source: You can also `download an HTML copy <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ for offline reading (updated every Monday). Extract the ZIP archive then open the top-level ``index.html`` in a web browser.
cs: Můžete si také `stáhnout kopii HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ pro čtení offline (aktualizováno každé pondělí). Rozbalte archiv ZIP a poté otevřete nejvýše umístěný soubor ``index.html`` ve webovém prohlížeči.
de: Sie können ebenfalls eine `HTML Kopie von <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ herunterladen, um es offline zu lesen (Wird jeden Montag aktualisiert). Extrahieren Sie die ZIP-Datei und öffnen Sie die ``index.html`` in einem Webbrowser.
es: También puede `descargar una copia en HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ para leerla sin conexión (se actualiza cada Lunes). Extraiga el archivo ZIP y abra el archivo ``index.html`` de nivel superior en un navegador web.
fr: Vous pouvez aussi `télécharger une copie au format HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ pour une lecture hors-ligne (mise à jour chaque lundi). Il suffit d'extraire l'archive ZIP puis d'ouvrir ``index.html`` à la racine dans un navigateur web.
it: Puoi anche `scaricare una copia HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ per la lettura offline (aggiornata ogni lunedì). Estrai l'archivio ZIP poi apri il livello superiore ``index.html`` in un browser web.
ja: `HTMLのコピーをダウンロード <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/3.3/godot-docs-html.zip>`__ してオフラインでドキュメントを参照することもできます (毎週月曜日にアップデートされます)。ZIPアーカイブを展開しブラウザで最上位の ``index.html`` を開いてください。
ko: 오프라인으로 읽을 수 있는 `HTML 복사본을 다운로드받을 수도 있습니다 <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`\ (매주 월요일 업데이트). ZIP 파일의 압축을 풀고 웹브라우저에서 ``index.html``\ 을 여세요.
pl: Możesz również `pobrać kopię dokumentacji HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__, z której możesz korzystać offline (jest aktualizowana w każdy poniedziałek). Wypakuj pobrane archiwum ZIP i otwórz w przeglądarce internetowej plik ``index.html`` z głównego katalogu dokumentacji.
pt_br: Você também pode `baixar uma cópia em HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ para leitura offline (atualizada toda segunda-feira). Extraia o arquivo ZIP e abra o arquivo ``index.html`` em um navegador web.
ru: Также можно `загрузить HTML-копию документа (на английском) <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`_ для чтения в офлайн-режиме (обновляется каждый понедельник). Распакуйте ZIP архив, затем откройте самый верхний файл ``index.html`` в браузере.
tr: Ayrıca, çevrimdışı okuyabilmek için belgelerin `bir HTML kopyasını indirebilirsiniz <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ (her pazartesi güncellenir). Sıkıştırılmış dosyayı ayıklayın ve en üst-seviye ``index.html`` dosyasını web tarayıcısı ile açın.
uk: Ви також можете `завантажити HTML-копію <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ для офлайн-читання (оновлюється щопонеділка). Розпакуйте ZIP-архів, а потім відкрийте файл ``index.html`` на верхньому рівні у веб-браузері.
zh_tw: 你也可以 `下載一個HTML複本 <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ 離線閱讀(每周一更新)。解壓縮 ZIP檔案，然後在瀏覽器開啟最上層的 ``index.html`` 。

source: For mobile devices or e-readers, you can also `download an ePub copy <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ for offline reading (updated every Monday). Extract the ZIP archive then open the ``GodotEngine.epub`` file in an e-book reader application.
cs: Pro mobilní zařízení a čtečky knih si můžete také `stáhnout kopii ePub <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ pro čtení offline (aktualizováno každé pondělí). Rozbalte archiv ZIP a poté otevřete soubor ``GodotEngine.epub`` v aplikaci pro čtení e-knížek.
de: Für Mobilgeräte und E-reader steht zusätzlich ein `Download einer ePub Kopie <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ zum offline Lesen bereit (Wird jeden Montag aktualisiert). Extrahieren Sie das ZIP Archiv und öffnen sie die ``GodotEngine.epub`` Datei in einer e-book reader Applikation.
es: Para dispositivos móviles o lectores electrónicos (E-Readers), puedes también descargar una copia en formato ePub <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-master.zip>`__ para leerla sin conexión (se actualiza cada lunes). Extrae el archivo ZIP y abre el archivo ``GodotEngine.epub`` en una aplicación de lectura de libros electrónicos (E-Book).
fr: Pour les téléphones mobiles et les liseuses, vous pouvez aussi `télécharger une copie au format HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ pour une lecture hors-ligne (mise à jour chaque lundi). Il suffit d'extraire l'archive ZIP puis d'ouvrir ``index.html`` à la racine dans un navigateur web.
it: Puoi anche `scaricare una copia HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ per la lettura offline (aggiornata ogni lunedì). Estrai l'archivio ZIP poi apri il file ``GodotEngine.epub`` in un applicazione per la lettura degli e-book.
ja: `HTMLのコピーをダウンロード <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/3.3/godot-docs-html.zip>`__ することで、モバイルでもドキュメントをオフラインで参照できます。ZIPアーカイブを展開しブラウザで最上位の ``index.html`` を開いてください。
ko: 모바일 장치나 e-리더용으로는 `ePub 복사본을 다운로드 <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ 해서 오프라인에서 읽을 수도 있습니다(매 월요일마다 갱신됩니다). ZIP 압축을 푼 뒤 ``GodotEngine.epub`` 파일을 e-북 리더 앱에서 열어 보세요.
pl: Dla urządzeń przenośnych albo czytników e-booków, możesz też `pobrać kopię w formacie ePub <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ do czytania bez połączenia z internetem (aktualizowana w każdy poniedziałek). Wypakuj archiwum ZIP, a potem otwórz plik ``GodotEngine.epub`` w aplikacji czytnika e-booków.
pt_br: Para dispositivos móveis ou leitores digitais, você também pode `baixar uma cópia em ePub <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ para leitura offline (atualizada toda segunda-feira). Extraia o arquivo ZIP e abra o arquivo ``GodotEngine.epub`` em um aplicativo para leitura de livros digitais.
ru: Также можно `загрузить HTML-копию документа (на английском) <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`_ для чтения в офлайн-режиме (обновляется каждый понедельник). Распакуйте ZIP архив, затем откройте самый верхний файл ``index.html`` в браузере.
tr: Mobil cihazlar veya e-okuyucular için, çevrimdışı okuma için `bir ePub kopyası <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ da indirebilirsiniz (her Pazartesi güncellenir). ZIP arşivini çıkarın ve ardından ``GodotEngine.epub`` dosyasını bir e-kitap okuyucu uygulamasında açın.
uk: Для мобільних пристроїв або електронних книг ви також можете `завантажити копію ePub <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-epub-master.zip>`__ для офлайн-читання (оновлюється щопонеділка). Розпакуйте ZIP-архів, а потім відкрийте файл ``GodotEngine.epub`` в додатку для читання електронних книг.
zh_tw: 你也可以 `下載一個HTML複本 <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ 離線閱讀(每周一更新)。解壓縮 ZIP檔案，然後在瀏覽器開啟最上層的 ``index.html`` 。
