Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/index.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, uk, zh_tw

source: About
cs: O aplikaci
de: Über
es: Acerca de
fr: À propos
it: Informazioni su Godot
ja: 概要
ko: 정보
pl: O Godocie
pt_br: Sobre
ru: О Godot Engine
tr: Hakkında
uk: Відомості
zh_tw: 關於

source: Getting started
cs: Začínáme
de: Erste Schritte
es: Primeros pasos
fr: Pour commencer
it: Per iniziare
ja: 入門
ko: 시작하기
pl: Jak rozpocząć
pt_br: Primeiros passos
ru: Начало работы
tr: Başlarken
uk: Перші кроки
zh_tw: 入門

source: Manual
cs: Manuály
de: Handbuch
es: Manual de uso
fr: Manuel d'utilisation
it: Manuale
ja: マニュアル
ko: 설명서
pl: Instrukcja obsługi
ru: Руководство
tr: El Kitabı
uk: Посібник
zh_tw: 手冊

source: Contributing
cs: Přispějte
de: Mitwirken
es: Contribuyendo
fr: Contribuer
it: Contribuire
ja: 貢献
ko: 기여하기
pl: Wkład w rozwój Godota
pt_br: Contribuindo
ru: Содействие
tr: Katkıda Bulunma
uk: Участь у розробці
zh_tw: 參與貢獻

source: Community
cs: Komunita
es: Comunidad
fr: Communauté
it: Comunità
ja: コミュニティ
ko: 커뮤니티
pl: Społeczność
pt_br: Comunidade
ru: Сообщество
tr: Topluluk
uk: Спільнота
zh_tw: 社群

source: Class reference
cs: Dokumentace tříd
de: Klassenreferenz
es: Referencia de clase
fr: Référence de classe
it: Riferimento alla classe
ja: クラス リファレンス
ko: 클래스 레퍼런스
pl: Referencja klas
pt_br: Referência de classe
ru: Справочник по классам
tr: Sınıf referansı
uk: Довідник з класів
zh_tw: 類別參照手冊

source: Godot Docs – *4.2* branch
cs: Godot Dokumentace – *4.2* branch
de: Godot-Dokumentation – *4.2*-Branch
es: Documentación de Godot – rama *4.2*
fr: Documentation Godot – branche *4.2*
it: Documentazione di Godot – versione *4.2*
ja: Godot ドキュメント - *4.2* ブランチ
ko: Godot 문서 – *4.2* 브랜치
pt_br: Documentação do Godot - versão *4.2*
ru: Документация Godot – ветка *4.2*
tr: Godot Belgeleri - *4.2* dalı
uk: Godot Docs - *4.2* гілка

source: Godot's documentation is available in various languages and versions. Expand the "Read the Docs" panel at the bottom of the sidebar to see the list.
cs: Dokumentace enginu Godot je dostupná v mnoha jazycích a verzích. Rozbalte panel "Přečtěte si dokumenty" v dolní části postranního panelu pro zobrazení seznamu.
de: Godots Dokumentation ist in verschiedenen Sprachen und Versionen verfügbar. Klappen Sie das "Read the Docs"-Panel unten in der Seitenleiste auf, um die Liste zu sehen.
es: La documentación de Godot está disponible en varios idiomas y versiones. Expande el panel "Read the Docs" en la parte inferior de la barra lateral para ver la lista.
fr: La documentation de Godot est disponible dans différentes langues et versions. Développez le panneau "Read the Docs" en bas du menu de navigation latéral pour voir la liste.
it: La documentazione di Godot è disponibile in diverse lingue e versioni. Espandi il pannello "Leggi la documentazione" in fondo alla barra laterale per vedere la lista.
ja: Godotのドキュメントには様々な言語とバージョンがあります。そのリストを見るには、サイドバーの下にある「Read the Docs」のパネルを開いて下さい。
ko: Godot의 문서는 다양한 언어와 버전으로 제공됩니다.사이드바의 아래 "문서 읽기" 패널을 확장해서 목록을 확인하세요.
pl: Dokumentacja programu Godot jest dostępna w wielu językach oraz wersjach. Rozwiń panel "Czytaj Dokumenty" na dole menu, aby dotrzeć do listy.
pt_br: A documentação do Godot está disponível em vários idiomas e versões. Expanda o painel "Leia a Documentação" na parte inferior da barra lateral para ver a lista.
ru: Документация Godot доступна на различных языках и для разных версий. Разверните панель "Read the Docs" в нижней части боковой панели, чтобы увидеть весь список.
tr: Godot'nun belgeleri farklı diller ve sürümler için de mevcuttur. Listeyi görmek için kenar çubuğunun (genelde solda) altındaki "Read the Docs" paneline tıklayıp genişletin.
uk: Документація Godot доступна на різних мовах і версіях. Розгорніть панель "Прочитати документи" в нижній частині бічної панелі, щоб переглянути список.
zh_tw: Godot 的文件有多種不同語言的版本。展開側欄底部的 [閱讀說明文件] 面板可瀏覽完整列表。

source: This documentation is translated from the `original English one <https://docs.godotengine.org/en/stable>`_ by community members on `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
cs: Tato dokumentace byla přeložena z `anglického originálu <https://docs.godotengine.org/en/stable>`_ členy komunity z `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
de: Diese Dokumentation wird von der `originalen englischen Version <https://docs.godotengine.org/en/stable>`_ von Community-Mitgliedern auf `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_ übersetzt.
es: Esta documentación es traducida de la `original en inglés <https://docs.godotengine.org/en/latest>`_ por miembros de la comunidad en `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
fr: Cette documentation a été traduite à partir de la `version anglaise <https://docs.godotengine.org/en/latest>`_ par des membres de la communauté sur `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
it: Questa documentazione è tradotta da `quella originale in inglese <https://docs.godotengine.org/en/stable>`_ dai membri della community su `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
ja: このドキュメントは `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_ のコミュニティー・メンバーによって、\ `英語の原文 <https://docs.godotengine.org/en/latest>`_\ から翻訳されました。
ko: 이 문서는 `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_\ 커뮤니티 회원들이 `원본 영어 문서 <https://docs.godotengine.org/en/latest>`_\ 를 번역한 것입니다.
pl: Ta dokumentacja została przetłumaczona z `angielskiego oryginału <https://docs.godotengine.org/en/latest>`_ przez członków społeczności na portalu `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
pt_br: Esta documentação é traduzida do `original em inglês <https://docs.godotengine.org/en/latest>`_ por membros da comunidade no `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
ru: Эта документация была переведена с оригинального `английского источника <https://docs.godotengine.org/en/latest>`_ участниками сообщества на `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
tr: Bu belge `aslı olan İngilizce'den <https://docs.godotengine.org/en/latest>`_ , topluluk üyeleri tarafından, `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_ üzerinde çevirilmiştir.
uk: Ця документація перекладена з оригінальної англійської <https://docs.godotengine.org/en/latest> учасниками спільноти на `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
zh_tw: 這份文件是由社群成員在 `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_ 上翻譯自 `原始英文文件 <https://docs.godotengine.org/en/stable>`_ 。

source: Depending on the translation effort's completion level, you may find paragraphs or whole pages which are still in English. You can help the community by providing new translations or reviewing existing ones on Weblate.
cs: V závislosti na úrovni dokončení překladu můžete najít odstavce, nebo celé stránky, které jsou ještě v angličtině. Můžete pomoci komunitě tím, že poskytnete nové překlady, nebo přezkoumáte stávající překlady na Weblate.
de: Abhängig vom Fertigstellungsgrad der Übersetzung können Absätze oder ganze Seiten noch in englischer Sprache verfasst sein. Sie können der Community helfen, indem Sie neue Übersetzungen erstellen oder vorhandene in Weblate überprüfen.
es: Dependiendo del nivel de progreso de la traducción, es posible que encuentres párrafos o páginas enteras que aún están en inglés. Puedes ayudar a la comunidad proporcionando nuevas traducciones o revisando las existentes en Weblate.
fr: Selon le niveau d'achèvement du travail de traduction, vous pouvez trouver des paragraphes ou des pages entières encore en anglais. Vous pouvez aider la communauté en fournissant de nouvelles traductions ou en révisant les traductions existantes sur Weblate.
it: A seconda del livello di completezza raggiunta nella traduzione, potresti trovare alcuni paragrafi o intere pagine ancora in inglese. Puoi aiutare la comunità fornendo nuove traduzioni o controllando quelle esistenti su Weblate.
ja: 翻訳の進行度合いによっては、段落やページ全体がまだ英語のままになっている場合があるかもしれません。Weblateにて新しく翻訳をしたり、既存の文を査読することで、あなたもコミュニティーの助けになれます。
ko: 번역의 진행 정도에 따라 아직 영어로 된 페이지나 단락이 나올 수도 있습니다. 본인이 영어에 자신 있다면 Weblate에서 문서를 새로 번역하거나 기존의 번역을 검토하여 커뮤니티에 기여해주세요.
pl: W zależności od postępów tłumaczenia, możesz zauważyć, że niektóre akapity, a nawet całe strony dostępne są wyłącznie w języku angielskim. Możesz pomóc społeczności przez dodawanie nowych tłumaczeń lub ocenianie już istniejących.
pt_br: Dependendo do nível de esforço para a conclusão da tradução, você pode encontrar parágrafos ou páginas inteiras que ainda estão em inglês. Você pode ajudar a comunidade fornecendo novas traduções ou revisando as existentes no Weblate.
ru: В зависимости от степени завершённости перевода, вы можете наткнуться на абзацы или целые страницы, которые всё ещё на английском языке. Вы можете помочь сообществу добавить новые переводы или проверить уже существующие на Weblate.
tr: Çeviri çalışmasının tamamlanma derecesine bağlı olarak, paragrafların veya sayfaların tamamının hala İngilizce olduğunu görebilirsiniz. Weblate üzerinde yeni çeviriler yaparak veya mevcut çevirileri gözden geçirerek topluluğa yardımcı olabilirsiniz.
uk: Залежно від ступеня завершеності перекладу, ви можете знайти параграфи, або цілі сторінки, які все ще на англійській. Ви можете допомогти спільноті шляхом надання нових перекладів, або перевірки існуючих, на Weblate.
zh_tw: 根據翻譯的完成度，有些段落或整個頁面可能依然是英語。歡迎你通過 Weblate 提供新的翻譯或校正現有的翻譯來協助社群。

source: For the time being, localized translations are only available for the "stable" branch. You can still view the English documentation for other engine versions using the "Read the Docs" panel at the bottom of the sidebar.
cs: Prozatím jsou překlady dostupné pouze pro "stable" verzi enginu. Dokumentaci pro ostatní verze enginu naleznete na konci bočního panelu v "Přečíst dokumentaci".
de: Vorerst sind lokalisierte Übersetzungen nur für den "stable" Branch verfügbar. Sie können die englische Dokumentation für andere Engine-Versionen weiterhin über den Bereich "Read the Docs" unten in der Seitenleiste anzeigen.
es: Por el momento, las traducciones localizadas sólo están disponibles para la rama "estable". Todavía puedes ver la documentación en inglés para otras versiones del motor usando el panel de "Read the Docs" al final de la barra lateral.
fr: Pour le moment, les traductions ne sont disponibles que pour la branche "stable". Vous pouvez toujours voir la documentation anglaise pour d'autres versions du moteur en utilisant le bouton "Read the Docs" en bas du panneau latéral.
it: Al momento, le traduzioni localizzate sono disponibili solo per la versione del ramo "latest" (development), ma dovrebbero essere adatte per imparare come usare le versioni stabili di Godot.
ja: 当分の間、翻訳版は安定板にしかありませんが、他バージョンの英語版ドキュメントはサイドパネルの下の"Read the Docs"(ドキュメントを読む)から参照できます。
ko: 당분간 현지화된 번역은 "stable" 브랜치에서만 이용할 수 있습니다. 당신은 여전히 사이드바 하단의 "문서 읽기" 패널을 통해 다른 엔진버전의 영문 문서를 볼 수 있습니다.
pl: Obecnie tłumaczenia dla języków innych niż angielski dostępne są wyłącznie dla "stabilnej" gałęzi. Dokumentacje dla innych wersji silnika możesz wyświetlić po angielsku korzystając z panelu "Przeczytaj dokumentację" na dole bocznego paska.
pt_br: Por enquanto, as traduções localizadas estão disponíveis apenas na versão "estável". Você ainda pode conferir a documentação em inglês para outras versões da ferramenta usando o painel "Read the Docs" no fim da barra lateral.
ru: На данный момент локализованные переводы доступны только для «стабильной» ветки. Вы по-прежнему можете просмотреть документацию на английском языке для других версий движка, используя панель «Читать документацию» в нижней части боковой панели.
tr: Şimdilik, yerelleştirilmiş çeviriler yalnızca "kararlı" dal için mevcuttur. Kenar çubuğunun altındaki "Read the Docs" (Belgeleri Oku) panelini kullanarak diğer motor sürümleri için İngilizce belgeleri görüntüleyebilirsiniz.
uk: На даний момент локалізовані переклади доступні лише для гілки "latest" (розробка), але вони повинні підходити для вивчення стабільних релізів Godot.
zh_tw: 目前，本地化翻譯只適用於 **穩定** 分支，您仍然可以使用側邊欄底部的“閱讀文件”面板查看其他引擎版本的英文文件。

source: Welcome to the official documentation of `Godot Engine <https://godotengine.org>`__, the free and open source community-driven 2D and 3D game engine! If you are new to this documentation, we recommend that you read the :ref:`introduction page <doc_about_intro>` to get an overview of what this documentation has to offer.
cs: Vítejte v oficiální dokumentaci `Enginu Godot <https://godotengine.org>`__, svobodném a open-source komunitou řízeném 2D a 3D herním enginu! Jste-li zde poprvé, doporučujeme prečíst si :ref:`úvodní stránku <doc_about_intro>` pro lepší představu, co tato dokumentace nabízí.
de: Willkommen zur offiziellen Dokumentation der `Godot Engine <https://godotengine.org>`__, der freien, quelloffenen und von der Community entwickelten 2D- und 3D-Spiele-Engine! Wenn Sie neu mit dieser Dokumentation beginnen, empfehlen wir Ihnen, die :ref:`Einführungsseite <doc_about_intro>` zu lesen, um einen Überblick darüber zu bekommen, was diese Dokumentation zu bieten hat.
es: Bienvenido a la documentación oficial de `Godot Engine <https://godotengine.org>`__, ¡el motor de juegos 2D y 3D libre y de código abierto impulsado por la comunidad! Si eres nuevo en esto, te recomendamos que leas la :ref:`página de introducción <doc_about_intro>` para obtener una visión general de lo que esta documentación tiene para ofrecer.
fr: Bienvenue dans la documentation officielle du `Moteur de jeu Godot <https://godotengine.org>`__, le moteur de jeu 2D et 3D libre et open source, piloté par la communauté ! Si vous êtes nouveau dans cette documentation, nous vous recommandons de lire la page :ref:`introduction <doc_about_intro>` pour avoir un aperçu de ce que cette documentation a à offrir.
it: Benvenuto nella documentazione ufficiale di :ref:`Godot Engine <https://godotengine.org>`, il motore di gioco 2D e 3D gratuito e open source gestito dalla community! Se è la prima volta che utilizzi questa documentazione, ti raccomandiamo di leggere la :ref:`pagina di introduzione <doc_about_intro>` per avere una panoramica di cosa questa documentazione ha da offrirti.
ja: `Godot Engine <https://godotengine.org>`__ の公式ドキュメントへようこそ。フリーかつオープンソースで、コミュニティが運営する 2D/3D ゲームエンジンです！ このドキュメントが初めての方は、 概要である\ :ref:`『はじめに』のページ <doc_about_intro>`\ を読まれることをおすすめします。
ko: 커뮤니티가 개발하는 자유 오픈소스 2D & 3D 게임 엔진 `Godot 엔진 <https://godotengine.org>`__\ 의 공식 문서에 오신 것을 환영합니다! 이 문서를 처음 보신다면 :ref:`소개 페이지 <doc_about_intro>`\ 에서 문서의 개요를 읽어보세요.
pl: Witamy w oficjalnej dokumentacji `silnika Godot <https://godotengine.org>`__, darmowego i otwartego, napędzanego przez społeczność silnika gier 2D i 3D! Początkującym zalecamy zapoznanie się ze :ref:`stroną wprowadzającą <doc_about_intro>`, aby mieć ogólne pojęcie co ta dokumentacja oferuje.
pt_br: Seja bem-vindo à documentação oficial do `Godot Engine <https://godotengine.org>`__, o motor(engine) de jogos gratuito e de código aberto impulsionado pela comunidade para jogos 2D e 3D! Se você não conhece a documentação, sugerimos que leia a :ref:`introdução <doc_about_intro>` para obter uma visão geral do que esta documentação tem a oferecer.
ru: Добро пожаловать в официальную документацию `Godot Engine <https://godotengine.org>`__, бесплатного и открытого игрового движка 2D и 3D, управляемого сообществом! Если вы впервые знакомитесь с этой документацией, мы рекомендуем вам прочитать :ref:`вводную страницу <doc_about_intro>`, чтобы получить общее представление о том, что эта документация может предложить.
tr: Özgür/ücretsiz ve açık kaynaklı topluluk-güdümlü 2B-3B oyun motoru olan `Godot Engine <https://godotengine.org>`__ 'in resmi belgelerine hoş geldiniz! Eğer bu belgelere yeni iseniz, :ref:`tanıtım sayfası <doc_about_intro>`'na giderek, bu belgelerin size neler sunacağını hakkındaki genel tanıtımı okumanızı öneririz.
uk: Ласкаво просимо до офіційної документації `Godot Engine <https://godotengine.org>`__, розробленого спільнотою вільного та відкритого 2D та 3D-ігрового рушія! Якщо ви новачок у цій документації, радимо ознайомитись зі :ref:`сторінкою введення <doc_about_intro>`, щоб оглянути те, що ця документація може запропонувати.
zh_tw: 歡迎來到 Godot 的官方文件， `Godot Engine <https://godotengine.org>`__ 是一款免費、由開源社區所驅動的 2D/3D 遊戲引擎！若你是第一次閱讀此文件，建議先閲讀 :ref:`簡介 <doc_about_intro>` 以便大致瞭解本文件所提供之內容。

source: The table of contents in the sidebar should let you easily access the documentation for your topic of interest. You can also use the search function in the top-left corner.
cs: Obsah v bočním panelu vám usnadní přístup k tématům v dokumentaci o která máte zájem. Také můžete využít funkci vyhledávaní v levém horním rohu.
de: Mithilfe des Inhaltsverzeichnisses in der Seitenleiste können Sie leicht auf die Dokumentation zu Ihrem gewünschten Thema zugreifen. Sie können auch die Suchfunktion in der oberen linken Ecke verwenden.
es: La tabla de contenidos en la barra lateral te permitirá acceder fácilmente a la documentación sobre el tema de tu interés. También puedes utilizar la función de búsqueda en la esquina superior izquierda.
fr: La table des matières dans la barre latérale devrait vous permettre d'accéder facilement à la documentation sur les sujets qui vous intéressent. Vous pouvez également utiliser la fonction de recherche dans le coin supérieur gauche.
it: La tabella dei contenuti qui sotto e nella barra laterale ti dovrebbero consentire un accesso facile alla documentazione degli argomenti che ti interessano. Puoi usare anche la funzione di ricerca nell'angolo in alto a sinistra.
ja: サイドバーにある目次から、関心のあるトピックにすぐアクセスすることができます。また、左上の検索機能を利用することも出来ます。
ko: 사이드바의 목차를 통해 관심 있는 주제에 대한 문서에 쉽게 액세스할 수 있습니다. 왼쪽 상단 모서리에 있는 검색 기능을 사용할 수도 있습니다.
pl: Spis treści na pasku bocznym pozwoli Ci w łatwy sposób dotrzeć do interesujących Cię materiałów. Możesz też skorzystać z funkcji wyszukiwania w lewym górnym rogu.
pt_br: O sumário abaixo e a barra lateral devem permitem que você acesse facilmente a documentação do tópico de seu interesse. Você também pode utilizar a função de busca no canto superior esquerdo.
ru: Оглавление в боковой панели позволяет легко перейти к документации по интересующей вас теме. Вы также можете воспользоваться функцией поиска в левом верхнем углу.
tr: Kenar çubuğundaki içindekiler tablosu, ilgilendiğiniz konuya ilişkin belgelere kolayca erişmenize olanak sağlamaktadır. Ayrıca sol-üst köşedeki arama işlevini de kullanabilirsiniz.
uk: Зміст, наведений нижче і на бічній панелі, повинен дозволити вам легко отримати доступ до документації з цікавої вам теми. Ви також можете використовувати функцію пошуку у верхньому лівому куті.
zh_tw: 下方的目錄以及側邊欄能讓你在文件中輕鬆找到感興趣的主題，亦可以利用左上角的搜尋功能。

source: Get involved
cs: Zapojit se
de: Beteiligen Sie sich
es: Hazte parte
fr: S'impliquer
it: Partecipa
ja: 開発に貢献する
ko: 참여하기
pl: Zaangażuj się
pt_br: Envolva-se
ru: Участвуйте
tr: Katılın
uk: Взяти участь
zh_tw: 參與其中

source: Godot Engine is an open source project developed by a community of volunteers. The documentation team can always use your feedback and help to improve the tutorials and class reference. If you don't understand something, or cannot find what you are looking for in the docs, help us make the documentation better by letting us know!
cs: Godot Engine je projekt s otevřeným zdrojovým kódem vyvíjený komunitou dobrovolníků. Tým dokumentaristů vždy ocení vaší zpětnou vazbu a pomoc ke zlepšení návodů a třídních referencí. Pokud nečemu nerozumíte nebo nemůžete najít to, co hledáte v dokumentaci, tak nám dejte vědět a pomozte udělat dokumentaci lepší!
de: Godot Engine ist ein Open Source-Projekt einer Community von Freiwilligen. Das für die Dokumentation zuständige Team ist immer für Rückmeldungen und Hilfe dankbar, um Anleitungen oder die Klassenreferenz zu verbessern. Sollten Sie etwas nicht verstehen oder in der Dokumentation nicht finden können, geben Sie uns Bescheid, um uns zu helfen die Dokumentation zu verbessern!
es: Godot Engine es un proyecto de código abierto desarrollado por una comunidad de voluntarios. El equipo de documentación siempre puede utilizar tu retroalimentación y ayuda para mejorar los tutoriales y las referencias de clases. Si no entiendes algo, o no encuentras lo que buscas en los documentos, ¡ayúdanos a mejorar la documentación haciéndonos saber!
fr: Godot Engine est un logiciel libre développé par une communauté de bénévoles. L'équipe de documentation a toujours besoin de vos retours et de votre aide pour améliorer les tutoriels et la documentation de l'API. Si quoi que ce soit vous semble difficile à comprendre, ou si vous ne trouvez pas l'information qu'il vous faut, aidez-nous à améliorer la documentation en nous le faisant savoir !
it: Godot Engine è un progetto open source sviluppato da una comunità di volontari. Il team della documentazione può utilizzare sempre i tuoi feedback ed il tuo aiuto per migliorare i tutorial ed i riferimenti alle classi. Se non comprendi qualcosa o non riesci a trovare quello che stai cercando in questi documenti, aiutaci a migliorare la documentazione facendocelo sapere!
ja: Godot Engineは有志のコミュニティによって開発されたオープンソースプロジェクトです。あなたのフィードバックとご協力によって、ドキュメント チームはチュートリアルやクラス リファレンスを改善できます。もし、理解できないものがあったり、あなたが探しているものがドキュメントで見つからない場合は、私たちに教えてください！
ko: Godot 엔진은 커뮤니티의 봉사로 개발되는 오픈 소스 프로젝트입니다. 문서화 팀은 튜토리얼과 클래스 참조 등을 개선하기 위해 여러분의 의견을 받고 있습니다. 문서 안에서 이해가 가지 않는 부분, 설명이 애매하거나 부족한 부분이 있다면 저희에게 알려주셔서 더 나은 문서를 만들 수 있게 도와주세요!
pl: Silnik Godot to projekt open source, który rozwijany jest przez społeczność ochotników. Twoje uwagi mogą zawsze okazać się przydatne dla zespołu zajmującego się dokumentacją, aby ulepszyć samouczki i opis klas. Jeżeli czegoś nie rozumiesz lub nie możesz znaleźć interesującej Cię informacji w dokumentacji, pomóż nam ją ulepszyć informując nas o tym!
pt_br: Godot Engine é um projeto de código aberto desenvolvido por uma comunidade de voluntários. A equipe de documentação sempre pode usar seu feedback e ajudar a aprimorar os tutoriais e a referência de classe. Se você não entender alguma coisa ou não encontrar o que está procurando nos documentos, ajude-nos a melhorar a documentação nos informando!
ru: Godot Engine — это проект с открытым исходным кодом, разрабатываемый сообществом добровольцев. Команда документации всегда открыта к вашим отзывам и помощи по улучшению уроков и справочнику классов. Если вы чего-то не понимаете или не можете найти что-то в документации, помогите нам сделать её лучше, рассказав нам об этом!
tr: Godot Engine, bir gönüllüler topluluğu tarafından geliştirilen açık kaynaklı bir projedir. Belgeler ekibimiz, öğreticileri ve sınıf referanslarını iyileştirmeye yardımcı olacak her türlü geri bildirimlerinize açıktır. Eğer anlamadığınız bir şey varsa, ya da belgelerde aradığınız şeyi bulamıyorsanız, bunu bize bildirerek belgeleri daha iyi yapmamıza yardım edin!
uk: Godot Engine - це проєкт з відкритим кодом, розроблений спільнотою волонтерів. Команда документації завжди може використовувати ваш відгук та допомогу з покращення навчальних посібників та довідників класів. Якщо ви щось не розумієте, або не можете знайти те, що шукаєте в документації, допоможіть нам покращити документацію, повідомивши нам про це!
zh_tw: Godot Engine 是由志願者社群所開發的開放原始碼專案。為改進這份教學與類別參照文件，文件團隊成員隨時都願意接受意見回饋。若有任何不瞭解的地方或文件中缺少了什麼，歡迎告訴我們來讓這份文件變得更好！
