Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/creating_script_templates.po
Languages: de, zh_tw

source: Creating script templates
de: Erstellen von Skript-Vorlagen
zh_tw: 建立腳本樣板

source: Godot provides a way to use script templates as seen in the ``Script Create Dialog`` while creating a new script:
de: Godot bietet eine Möglichkeit, Skriptvorlagen zu verwenden, wie im ``Skript erstellen-Dialog`` beim Erstellen eines neuen Skripts dargestellt ist:
zh_tw: Godot 中能使用腳本樣板，該功能可以在建立新腳本的 ``[腳本建立視窗]`` 中看到：

source: A set of built-in script templates are provided with the editor, but it is also possible to create new ones and set them by default, both per project and at editor scope.
de: Der Editor enthält eine Reihe Built-in-Skriptvorlagen, aber es ist auch möglich, neue Vorlagen zu erstellen und sie als Default einzustellen, sowohl pro Projekt als auch im Editorbereich.
zh_tw: 預設有提供一系列的預設腳本樣板，但也可以修改現有樣板或建立新的樣板。設定樣板時可以只為單一專案設定或為編輯器設定。

source: Templates are linked to a specific node type, so when you create a script you will only see the templates corresponding to that particular node, or one of its parent types. For example, if you are creating a script for a CharacterBody3D, you will only see templates defined for CharacterBody3Ds, Node3Ds or Nodes.
de: Vorlagen sind mit einem bestimmten Node-Typ verknüpft. Wenn Sie also ein Skript erstellen, werden nur die Vorlagen angezeigt, die diesem bestimmten Node oder einem seiner Parent-Typen entsprechen. Wenn Sie zum Beispiel ein Skript für einen CharacterBody3D erstellen, sehen Sie nur Vorlagen, die für CharacterBody3Ds, Node3Ds oder Nodes definiert sind.
zh_tw: 範本連結到特定的節點型別，因此當您建立腳本時，您只會看到與該特定節點或其父型別之一對應的範本。例如，如果您正在為CharacterBody3D 建立腳本，您將只能看到為CharacterBody3D、Node3D 或節點定義的範本。

source: Locating the templates
de: Auffinden der Vorlagen
zh_tw: 放置樣板

source: There are two places where templates can be managed.
de: Es gibt zwei Stellen, an denen Vorlagen verwaltet werden können.
zh_tw: 有兩個地方可以管理樣板。

source: Editor-defined templates
de: Editor-definierte Vorlagen
zh_tw: 編輯器中定義的樣板

source: These are available globally throughout any project. The location of these templates are determined per each OS:
de: Diese sind global in jedem Projekt verfügbar. Der Speicherort dieser Vorlagen wird für jedes Betriebssystem festgelegt:
zh_tw: 這些樣板可以在所有專案中使用。樣板的位置根據各個作業系統而不同：

source: Linux: ``$HOME/.config/godot/script_templates/``
de: Auf Linux: ``$HOME/.config/godot/script_templates/``
zh_tw: Linux：``$HOME/.local/share/godot/script_templates/``

source: If no ``script_templates`` is detected, Godot will create a default set of built-in templates automatically, so this logic can be used to reset the default templates in case you've accidentally overwritten them.
de: Wenn keine ``script_templates`` erkannt werden, erstellt Godot automatisch einen Default-Satz von Built-in-Vorlagen, sodass diese Logik verwendet werden kann um die Default-Vorlagen zurückzusetzen, falls Sie sie versehentlich überschrieben haben.
zh_tw: 若未偵測到 ``script_templates``，則 Godot 會自動建立一系列預設的內建樣板。所以可以藉此方法來在不小心覆蓋掉預設樣板時重設。

source: Project-defined templates
de: Projektdefinierte Vorlagen
zh_tw: 各專案定義的樣板

source: The default path to search for templates is the ``res://script_templates/`` directory. The path can be changed by configuring the ``editor/script_templates_search_path`` setting in the :ref:`ProjectSettings <class_ProjectSettings>`, both via code and the editor.
de: Der Default-Pfad für die Suche nach Vorlagen ist das Verzeichnis ``res://script_templates/``. Der Pfad kann geändert werden, indem die Einstellung ``editor/script_templates_search_path`` in den :ref:`Projekteinstellungen <class_ProjectSettings>` sowohl über Code als auch über den Editor konfiguriert wird.
zh_tw: 搜尋樣板的預設路徑是 ``res://script_templates/`` 目錄。該路徑可以通過程式碼或編輯器在 :ref:`專案設定 <class_ProjectSettings>` 中的 ``editor/script_templates_search_path`` 設定更改。

source: If no ``script_templates`` directory is found within a project, it is simply ignored.
de: Wenn in einem Projekt kein ``script_templates``-Verzeichnis gefunden wird, wird es einfach ignoriert.
zh_tw: 若在專案中未找到 ``script_templates`` 資料夾，則會直接忽略。

source: Template organization and naming
de: Organisation und Benennung von Vorlagen
zh_tw: 型別轉換

source: Both editor and project defined templates are organized in the following way:
de: Sowohl editor- als auch projektdefinierte Vorlagen sind auf folgende Weise organisiert:
zh_tw: 編輯器和專案定義的範本都以以下方式組織：

source: where:
de: wobei:
zh_tw: 位置:

source: ``template_path`` is one of the 2 locations discussed in the previous two sections
de: ``template_path`` einer der 2 Orte ist, die in den beiden vorherigen Abschnitten besprochen wurden
zh_tw: 「template_path」 是前兩節討論的 2 個位置之一

source: ``node_type`` is the node it will apply to (for example, :ref:`Node <class_Node>`, or :ref:`CharacterBody3D <class_CharacterBody3D>`)
de: ``node_type`` der Node ist, auf den es angewendet wird (zum Beispiel :ref:`Node <class_Node>`, oder :ref:`CharacterBody3D <class_CharacterBody3D>`)
zh_tw: ``node_type`` 是將其套用到的節點（例如，:ref:`Node <class_Node>` 或:ref:`CharacterBody3D <class_CharacterBody3D>`）

source: ``file`` is the custom name you can chose for the template (for example: ``platformer_movement`` or ``smooth_camera``)
de: ``file`` der benutzerdefinierte Name ist, den Sie für die Vorlage wählen können (zum Beispiel: ``platformer_movement`` oder ``smooth_camera``)
zh_tw: ``file`` 是您可以為模板選擇的自訂名稱（例如：``platformer_movement`` 或``smooth_camera``）

source: ``extension``: will indicate which language the template will apply to (it should be ``gd`` for GDScript or ``cs`` for C#)
de: ``Extension``: gibt an, für welche Sprache die Vorlage gelten soll (es sollte ``gd`` für GDScript oder ``cs`` für C# sein)
zh_tw: ``extension``：將指示模板將應用於哪種語言（對於 GDScript 應該是 ``gd`` ，對於 C# 應該是 ``cs`` ）

source: For example:
de: Zum Beispiel:
zh_tw: 如：

source: Default behaviour and overriding it
de: Defaultverhalten und dessen Überschreibung
zh_tw: 預設行為與覆蓋

source: By default:
de: Standardmäßig:
zh_tw: 預設

source: the template's name is the same as the file name (minus the extension, prettyfied)
de: der Name der Vorlage ist derselbe wie der Dateiname (ohne die Erweiterung und lesbarer gemacht)
zh_tw: 模板的名稱與檔案名稱相同（減去副檔名，prettyfied）

source: the description is empty
de: die Beschreibung ist leer
zh_tw: 下面是這些選項的說明

source: the space indent is set to 4
de: die Einrückungstiefe ist auf 4 gesetzt
zh_tw: 空格縮排設定為 4

source: the template will not be set as the default for the given node
de: die Vorlage wird nicht als Default für den angegebenen Node festgelegt
zh_tw: 在本示範專案中，可將所有選項保留為預設值。

source: It is possible to customize this behaviour by adding meta headers at the start of your file, like this:
de: Es ist möglich, dieses Verhalten anzupassen, indem Sie Meta-Header am Anfang Ihrer Datei hinzufügen, etwa so:
zh_tw: 可以透過在檔案開頭新增元標頭來自訂此行為，如下所示：

source: In this case, the name will be set to "Platformer movement", with the given custom description, and it will be set as the default template for the node in which directory it has been saved.
de: In diesem Fall wird der Name auf "Platformer movement" gesetzt, mit der angegebenen benutzerdefinierten Beschreibung, und es wird als Defaultvorlage für den Node festgelegt, in dessen Verzeichnis er gespeichert wurde.
zh_tw: 在這種情況下，名稱將設定為“平台移動”，並帶有給定的自訂描述，並且它將設定為保存該節點的目錄的預設範本。

source: This is an example of utilizing custom templates at editor and project level:
de: Dies ist ein Beispiel für die Verwendung von benutzerdefinierten Vorlagen auf Editor- und Projektebene:
zh_tw: 這是在編輯器和專案層級使用自訂範本的範例：

source: The script templates have the same extension as the regular script files. This may lead to an issue of a script parser treating those templates as actual scripts within a project. To avoid this, make sure to ignore the directory containing them by creating an empty ``.gdignore`` file. The directory won't be visible throughout the project's filesystem anymore, yet the templates can be modified by an external text editor anytime.
de: Die Skriptvorlagen haben die gleiche Dateiendung wie die regulären Skriptdateien. Dies kann dazu führen, dass ein Skriptparser diese Vorlagen als tatsächliche Skripte in einem Projekt behandelt. Um dies zu vermeiden, stellen Sie sicher, dass das Verzeichnis, das sie enthält, ignoriert wird, indem Sie eine leere ``.gdignore``-Datei erstellen. Das Verzeichnis ist dann im Dateisystem des Projekts nicht mehr sichtbar, die Vorlagen können jedoch jederzeit mit einem externen Texteditor bearbeitet werden.
zh_tw: 腳本樣板與一般腳本檔的副檔名相同。這可能會讓腳本解析器把專案中的腳本當成是實際腳本。為了避免這種情況，請確保在包含樣板腳本的資料夾內建立一個 ``.gdignore`` 檔案。該資料夾將不再顯示於專案的檔案系統中，但樣板依然可以使用外部文字編輯器來開啟。

source: By default, every C# file inside the project directory is included in the compilation. Script templates must be manually excluded from the C# project to avoid build errors. See `Exclude files from the build <https://learn.microsoft.com/en-us/visualstudio/msbuild/how-to-exclude-files-from-the-build>`_ in the Microsoft documentation.
de: Standardmäßig wird jede C#-Datei innerhalb des Projektverzeichnisses in die Kompilierung einbezogen. Skriptvorlagen müssen manuell aus dem C#-Projekt ausgeschlossen werden, um Build-Fehler zu vermeiden. Siehe `Dateien vom Build ausschließen <https://learn.microsoft.com/en-us/visualstudio/msbuild/how-to-exclude-files-from-the-build>`_ in der Microsoft-Dokumentation.
zh_tw: 預設情況下，專案目錄中的每個 C# 檔案都會包含在編譯中。必須從 C# 專案中手動排除腳本範本以避免產生錯誤。請參閱 Microsoft 檔案中的「從建置中排除檔案 <https://learn.microsoft.com/en-us/visualstudio/msbuild/how-to-exclude-files-from-the-build>」。

source: It is possible to create editor-level templates that have the same level as a project-specific templates, and also that have the same name as a built-in one, all will be shown on the new script dialog.
de: Es ist möglich, Vorlagen auf Editorebene zu erstellen, die auf der gleichen Ebene liegen wie projektspezifische Vorlagen und auch den gleichen Namen wie eine Built-in-Vorlage haben; alle werden im neuen Skriptdialog angezeigt.
zh_tw: 可以建立與專案特定模板具有相同等級的編輯器級模板，並且也可以與內建模板具有相同的名稱，所有這些都會顯示在新腳本對話方塊中。

source: Default template
de: Default-Vorlage
zh_tw: 預設樣板

source: To override the default template, create a custom template at editor or project level inside a ``Node`` directory (or a more specific type, if only a subtype wants to be overridden) and start the file with the ``meta-default: true`` header.
de: Um die Default-Vorlage zu überschreiben, erstellen Sie eine eigene Vorlage auf Editor- oder Projektebene innerhalb eines ``Node``-Verzeichnisses (oder eines spezifischeren Typs, wenn nur ein Subtyp überschrieben werden soll) und beginnen die Datei mit dem ``meta-default: true``-Header.
zh_tw: 若要覆寫預設模板，請在「Node」目錄（或更具體的型別，如果只想覆寫子型別）內的編輯器或專案層級建立自訂模板，並使用「meta-default」啟動檔案: true``標題。

source: Only one template can be set as default at the same time for the same node type.
de: Für denselben Knotentyp kann nur eine Vorlage gleichzeitig als Default festgelegt werden.
zh_tw: 同一節點型別只能同時設定一個預設模板。

source: The ``Default`` templates for basic Nodes, for both GDScript and C#, are shown here so you can use these as the base for creating other templates:
de: Die ``Default``-Vorlagen für Basis-Nodes, sowohl für GDScript als auch für C#, werden hier gezeigt, damit Sie diese als Basis für die Erstellung anderer Vorlagen verwenden können:
zh_tw: ``Default`` 預設樣板會依各語言自動產生，且無法設定或覆寫。但這些樣板可以用來當作建立其他樣板的基底。

source: The Godot editor provides a set of useful built-in node-specific templates, such as ``basic_movement`` for both :ref:`CharacterBody2D <class_CharacterBody2D>` and :ref:`CharacterBody3D <class_CharacterBody3D>` and ``plugin`` for :ref:`EditorPlugin <class_EditorPlugin>`.
de: Der Godot-Editor bietet eine Reihe nützlicher Built-in-Node-spezifischer Vorlagen, wie z.B. ``basic_movement`` für :ref:`CharacterBody2D <class_CharacterBody2D>` und :ref:`CharacterBody3D <class_CharacterBody3D>` und ``plugin`` für :ref:`EditorPlugin <class_EditorPlugin>`.
zh_tw: Godot 編輯器提供了一組有用的內建節點特定模板，例如用於 CharacterBody2D <class_CharacterBody2D> 和 CharacterBody3D <class_CharacterBody3D> 的 ``basic_movement`` 和 ``plugin``對於:ref:`itorPlugin <class_itor。

source: List of template placeholders
de: Liste der Vorlagen-Platzhalter
zh_tw: 樣板預留位置列表

source: The following describes the complete list of built-in template placeholders which are currently implemented.
de: Im Folgenden wird die vollständige Liste der derzeit implementierten Platzhalter für Vorlagen beschrieben.
zh_tw: 下表列出了所有目前有實作的內建樣板預留位置。

source: Base placeholders
de: Basis-Platzhalter
zh_tw: 基礎預留位置

source: Placeholder
de: Platzhalter
zh_tw: 預留位置

source: Description
de: Beschreibung
zh_tw: 說明

source: The name of the Godot namespace (used in C# only).
de: Der Name des Godot-Namespaces (nur in C# verwendet).
zh_tw: 新類別的名稱 (僅於 C# 中使用)。

source: The name of the new class (used in C# only).
de: Der Name der neuen Klasse (wird nur in C# verwendet).
zh_tw: 新類別的名稱 (僅於 C# 中使用)。

source: The base type a new script inherits from.
de: Der Basistyp, von dem ein neues Skript erbt.
zh_tw: 新腳本所繼承的基礎型別。

source: Indentation placeholder. The exact type and number of whitespace characters used for indentation is determined by the ``text_editor/indent/type`` and ``text_editor/indent/size`` settings in the :ref:`EditorSettings <class_EditorSettings>` respectively. Can be overridden by the ``meta-space-indent`` header on the template.
de: Platzhalter für Einrückung. Die genaue Art und Anzahl der Leerzeichen, die für die Einrückung verwendet werden, wird durch die Einstellungen ``text_editor/indent/type`` und ``text_editor/indent/size`` in der :ref:`EditorSettings <class_EditorSettings>` bestimmt. Kann durch den ``meta-space-indent``-Header der Vorlage überschrieben werden.
zh_tw: 縮排預留位置。依據 :ref:`編輯器設定 <class_EditorSettings>` 中 ``text_editor/indent/type`` 與 ``text_editor/indent/size`` 判斷的正確縮排，會依據設定來使用正確的形式以及正確數量的空白字元。

source: Type placeholders
de: Typ-Platzhalter
zh_tw: 型別預留位置

source: There used to be, in Godot 3.x, placeholders for GDScript type hints that would get replaced whenever a template was used to create a new script, such as: ``%INT_TYPE%``, ``%STRING_TYPE%``, ``%FLOAT_TYPE%`` or ``%VOID_RETURN%``.
de: In Godot 3.x gab es Platzhalter für GDScript-Type-Hints, die immer dann ersetzt wurden, wenn eine Vorlage zur Erstellung eines neuen Skripts verwendet wurde, wie z.B.: ``%INT_TYPE%``, ``%STRING_TYPE%``, ``%FLOAT_TYPE%`` oder ``%VOID_RETURN%``.
zh_tw: 在Godot 3.x 中，曾經有GDScript 型別提示的佔位符，每當使用模板建立新腳本時，這些佔位符就會被替換，例如：``%INT_TYPE%``、``%STRING_TYPE% ``、 ``%FLOAT_TYPE%`` 或 ``%VOID_RETURN%``。

source: The placeholders no longer work for Godot 4.x, but if the setting ``text_editor/completion/add_type_hints`` from :ref:`EditorSettings <class_EditorSettings>` is disabled, type hints for parameters and return types will be automatically removed for a few base types:
de: Diese Platzhalter funktionieren nicht mehr für Godot 4.x, aber wenn die Einstellung ``text_editor/completion/add_type_hints`` aus :ref:`EditorSettings <class_EditorSettings>` deaktiviert ist, werden Type-Hints für Parameter und Rückgabetypen automatisch für einige Basistypen entfernt:
zh_tw: 佔位符不再適用於 Godot 4.x，但如果停用 EditorSettings <class_EditorSettings> 中的設定 ``text_editor/completion/add_type_hints`` ，參數和傳回型別的型別提示將自動刪除幾種基本型別：

source: ``int``
zh_tw: ``in``

source: ``Array[String]``
zh_tw: ``String[]``

source: ``:=`` will be transformed into ``=``
de: ``:=`` wird in ``=`` umgewandelt
zh_tw: ``:=`` 將被轉換為 ``=``

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
