Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/cross_language_scripting.po
Languages: de, zh_cn

source: Cross-language scripting
de: Cross-Language-Skripting
zh_cn: 跨语言脚本

source: Godot allows you to mix and match scripting languages to suit your needs. This means a single project can define nodes in both C# and GDScript. This page will go through the possible interactions between two nodes written in different languages.
de: Godot erlaubt es, mehrere Skriptsprachen zu mischen, je nach Anforderung. Ein einzelnes Projekt kann somit Nodes sowohl in C# als auch in GDScript definieren. Diese Seite geht auf die möglichen Interaktionen zwischen zwei Nodes ein, die in unterschiedlichen Sprachen geschrieben wurden.
zh_cn: Godot 允许混合、匹配使用脚本语言以满足你的需求，也就是说，一个项目可以同时用 C# 和 GDScript 定义节点。本页将用不同语言编写的两个脚本来介绍这两种语言之间可进行的交互。

source: The following two scripts will be used as references throughout this page.
de: Die folgenden beiden Skripte werden durchgehend auf dieser Seite als Referenz genutzt.
zh_cn: 以下两个脚本在整个页面中用作参考。

source: Instantiating nodes
de: Instanziieren von Nodes
zh_cn: 实例化节点

source: If you're not using nodes from the scene tree, you'll probably want to instantiate nodes directly from the code.
de: Wenn Sie keine Nodes aus dem Szenenbaum verwenden, werden Sie wahrscheinlich Nodes direkt aus dem Code instanziieren wollen.
zh_cn: 如果不想通过场景树来使用节点，则可能需要直接通过代码来实例化节点。

source: Instantiating C# nodes from GDScript
de: Instanziierung von C# Nodes aus GDScript
zh_cn: 在 GDScript 中实例化 C# 节点

source: Using C# from GDScript doesn't need much work. Once loaded (see :ref:`doc_gdscript_classes_as_resources`), the script can be instantiated with :ref:`new() <class_CSharpScript_method_new>`.
de: C# aus GDScript zu nutzen, benötigt nicht viel Aufwand. Einmal geladen (siehe :ref:`doc_gdscript_classes_as_resources`) kann das Skript mit :ref:`new() <class_CSharpScript_method_new>` instanziiert werden.
zh_cn: 在 GDScript 中使用 C# 脚本并不麻烦，C# 脚本经加载后（见 :ref:`doc_gdscript_classes_as_resources`）便可使用 :ref:`new() <class_CSharpScript_method_new>` 来进行实例化。

source: When creating ``.cs`` scripts, you should always keep in mind that the class Godot will use is the one named like the ``.cs`` file itself. If that class does not exist in the file, you'll see the following error: ``Invalid call. Nonexistent function `new` in base``.
de: Wenn Sie ``.cs``-Skripte erstellen, sollten Sie immer bedenken, dass die von Godot verwendete Klasse genauso benannt wird wie die ``.cs``-Datei selbst. Wenn diese Klasse in der Datei nicht vorhanden ist, wird der folgende Fehler angezeigt: ``Ungültiger Aufruf. Nicht vorhandene Funktion `neu` in base``.
zh_cn: 创建 ``.cs`` 脚本时，要始终记住：Godot 会使用和这个 ``.cs`` 文件名相同的类进行相关操作。如果文件中不存在该类，那么你将会看到以下错误: ``Invalid call. Nonexistent function `new` in base`` 。

source: For example, MyCoolNode.cs should contain a class named MyCoolNode.
de: Zum Beispiel soll MyCoolNode.cs eine Klasse namens MyCoolNode beinhalten.
zh_cn: 例如：MyCoolNode.cs 应该包含一个名为 MyCoolNode 的类。

source: The C# class needs to derive a Godot class, for example ``GodotObject``. Otherwise, the same error will occur.
de: Die C#-Klasse muss eine Godot-Klasse ableiten, zum Beispiel ``GodotObject``. Andernfalls wird derselbe Fehler auftreten.
zh_cn: C# 类也需要获取 Godot 类，如\ ``GodotObject``\，否则将触发同样的错误。

source: You also need to check your ``.cs`` file is referenced in the project's ``.csproj`` file. Otherwise, the same error will occur.
de: Sie müssen auch überprüfen, ob auf Ihre ``.cs``-Datei in der ``.csproj``-Datei des Projekts verwiesen wird. Andernfalls tritt der gleiche Fehler auf.
zh_cn: 你还需要检查在项目的 ``.csproj`` 文件中是否引用了该 ``.cs`` 文件的内容，否则将触发同样的错误。

source: Instantiating GDScript nodes from C#
de: Instanziieren von GDScript Nodes über C#
zh_cn: 在 C# 中实例化 GDScript 节点

source: From the C# side, everything work the same way. Once loaded, the GDScript can be instantiated with :ref:`GDScript.New() <class_GDScript_method_new>`.
de: Von der C#-Seite aus funktioniert alles auf die gleiche Art. Einmal geladen, kann das GDScript mit :ref:`GDScript.New() <class_GDScript_method_new>` instanziiert werden.
zh_cn: 在 C# 侧的实例化方式与 GDScript 的基本相同，加载 GDScript 脚本后，该 GDScript 脚本就可以使用\ :ref:`GDScript.New() <class_GDScript_method_new>`\实例化。

source: Here we are using an :ref:`class_Object`, but you can use type conversion like explained in :ref:`doc_c_sharp_features_type_conversion_and_casting`.
de: Hier verwenden wir ein :ref:`class_Object`, aber Sie können die Typkonvertierung wie in :ref:`doc_c_sharp_features_type_conversion_and_casting` beschrieben verwenden.
zh_cn: 在这里我们用 :ref:`class_Object` 进行转型，但是也可以使用 Godot 所提供的类型转换语法转型，见\ :ref:`doc_c_sharp_features_type_conversion_and_casting`\ 章节。

source: Accessing fields
de: Zugriff auf Felder
zh_cn: 访问字段

source: Accessing C# fields from GDScript
de: Zugriff auf C# Felder über GDScript
zh_cn: 从 GDScript 中访问 C# 字段

source: Accessing C# fields from GDScript is straightforward, you shouldn't have anything to worry about.
de: Der Zugriff auf C# Felder über GDScript ist unkompliziert, Sie müssen sich keine Sorgen machen.
zh_cn: 从 GDScript 访问 C# 字段非常简单，大可不必担心会出现什么问题。

source: Accessing GDScript fields from C#
de: Zugriff auf GDScript-Felder über C#
zh_cn: 从 C# 中访问 GDSscript

source: As C# is statically typed, accessing GDScript from C# is a bit more convoluted, you will have to use :ref:`GodotObject.Get() <class_Object_method_get>` and :ref:`GodotObject.Set() <class_Object_method_set>`. The first argument is the name of the field you want to access.
de: Da C# statisch typisiert ist, ist der Zugriff auf GDScript von C# aus etwas umständlicher. Sie müssen :ref:`GodotObject.Get() <class_Object_method_get>` und :ref:`GodotObject.Set() <class_Object_method_set>` verwenden. Das erste Argument ist der Name des Feldes, auf das Sie zugreifen möchten.
zh_cn: 由于 C# 是静态类型语言，因此在 C# 脚本里访问 GDScript 字段会有点复杂，此时必须使用 :ref:`Object.Get() <class_Object_method_get>` 和 :ref:`Object.Set() <class_Object_method_set>` 来读写字段，其首个参数为要访问的字段的名称。

source: Keep in mind that when setting a field value you should only use types the GDScript side knows about. Essentially, you want to work with built-in types as described in :ref:`doc_gdscript` or classes extending :ref:`class_Object`.
de: Beachten Sie, dass Sie beim Festlegen eines Feldwerts nur Typen verwenden sollten, die der GDScript-Seite bekannt sind. Im Wesentlichen sollten Sie mit Built-in-Typen arbeiten, wie in :ref:`doc_gdscript` beschrieben, oder Klassenerweiterung von :ref:`class_Object` verwenden.
zh_cn: 需要牢记：在给字段赋值时只能使用 GDScript 已知的类型，实际上指的就是 GDScript 的内置类型 :ref:`doc_gdscript` 或 :ref:`class_Object` 的子类型。

source: Calling methods
de: Aufruf von Methoden
zh_cn: 调用方法

source: Calling C# methods from GDScript
de: Aufruf von C#-Methoden über GDScript
zh_cn: 在 GDScript 中调用 C# 方法

source: Again, calling C# methods from GDScript should be straightforward. The marshalling process will do its best to cast the arguments to match function signatures. If that's impossible, you'll see the following error: ``Invalid call. Nonexistent function `FunctionName```.
de: Auch hier sollte das Aufrufen von C#-Methoden über GDScript unkompliziert sein. Der Marshalling-Prozess wird sein Bestes tun, die Argumente so umzuwandeln, dass sie mit den Funktionssignaturen übereinstimmen. Wenn dies nicht möglich ist, wird der folgende Fehler angezeigt: ``Invalid call. Nonexistent function `FunctionName```.
zh_cn: 在 GDScript 里调用 C# 方法同样非常简单，调用 C# 脚本的方法时将尽可能地将你的参数类型进行强制转型以匹配函数签名。如果调用失败，则会看到以下错误 ``Invalid call. Nonexistent function `FunctionName```\。

source: Calling GDScript methods from C#
de: Aufruf von GDScript-Methoden über C#
zh_cn: 从 C# 中 调用 GDScript 方法

source: To call GDScript methods from C# you'll need to use :ref:`GodotObject.Call() <class_Object_method_call>`. The first argument is the name of the method you want to call. The following arguments will be passed to said method.
de: Um GDScript-Methoden von C# aus aufzurufen, müssen Sie :ref:`GodotObject.Call() <class_Object_method_call>` verwenden. Das erste Argument ist der Name der Methode, die Sie aufrufen möchten. Die folgenden Argumente werden an diese Methode übergeben.
zh_cn: 在 C# 脚本中调用 GDScript 脚本的方法时需要使用 :ref:`Object.Call() <class_Object_method_call>` 函数，该方法的第一个参数为想要调用方法的名称，之后的其他参数会顺次传递给被调用的方法。

source: As you can see, if the first argument of the called method is an array, you'll need to cast it as ``object``. Otherwise, each element of your array will be treated as a single argument and the function signature won't match.
de: Wie Sie sehen können, müssen Sie das erste Argument der aufgerufenen Methode nach ``object`` casten, wenn es sich um ein Array handelt. Andernfalls wird jedes Element Ihres Arrays als einzelnes Argument behandelt und die Funktionssignatur stimmt nicht überein.
zh_cn: 如你所见，若被调用方法的第一个参数为数组类型，则需要强制转为 ``object``\ 类型，否则该数组内的每个元素都将会被当做单个参数传入，导致与被调用的参数不匹配。

source: Inheritance
de: Vererbung
zh_cn: 继承

source: A GDScript file may not inherit from a C# script. Likewise, a C# script may not inherit from a GDScript file. Due to how complex this would be to implement, this limitation is unlikely to be lifted in the future. See `this GitHub issue <https://github.com/godotengine/godot/issues/38352>`__ for more information.
de: Eine GDScript-Datei darf nicht von einem C#-Skript erben. Genauso wenig darf ein C#-Skript von einer GDScript-Datei erben. Aufgrund der Komplexität der Implementierung ist es unwahrscheinlich, dass diese Einschränkung in Zukunft aufgehoben wird. Weitere Informationen finden Sie in `dieser GitHub-Issue <https://github.com/godotengine/godot/issues/38352>`__.
zh_cn: GDScript 脚本无法继承 C＃脚本。同样，C＃脚本也无法继承 GDScript 脚本。由于该机制实现起来非常复杂，故未来不太可能取消此限制，详见 `该 GitHub issue <https://github.com/godotengine/godot/issues/38352>`_ 。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
