Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/evaluating_expressions.po
Languages: de, zh_tw

source: Evaluating expressions
de: Auswertung von Ausdrücken
zh_tw: Bisect 迴歸

source: Godot provides an :ref:`class_Expression` class you can use to evaluate expressions.
de: Godot bietet eine Klasse :ref:`class_Expression`, die Sie zur Auswertung von Ausdrücken verwenden können.
zh_tw: Godot 提供了 :ref:`class_Expression` 類，可以用來對運算式進行估值。

source: An expression can be:
de: Ein Ausdruck kann sein:
zh_tw: 運算式節點可以：

source: A mathematical expression such as ``(2 + 4) * 16/4.0``.
de: Ein mathematischer Ausdruck wie ``(2 + 4) * 16/4,0``.
zh_tw: 類似 ``(2 + 4) * 16/4.0`` 的數學運算式。

source: A built-in method call like ``deg_to_rad(90)``.
de: Ein Built-in-Methodenaufruf wie ``deg_to_rad(90)``.
zh_tw: 類似 ``deg2rad(90)`` 的內建方法呼叫。

source: A method call on an user-provided script like ``update_health()``, if ``base_instance`` is set to a value other than ``null`` when calling :ref:`Expression.execute() <class_Expression_method_execute>`.
de: Ein Methodenaufruf in einem benutzerdefinierten Skript wie ``update_health()``, wenn ``base_instance`` beim Aufruf von :ref:`Expression.execute() <class_Expression_method_execute>` auf einen anderen Wert als ``null`` gesetzt wird.
zh_tw: 呼叫 :ref:`Expression.execute() <class_Expression_method_execute>` 時如果 ``base_instance`` 非 ``null``，那麼呼叫使用者提供腳本的方法，比如 ``update_health()``。

source: The Expression class is independent from GDScript. It's available even if you compile Godot with the GDScript module disabled.
de: Die Expression-Klasse ist unabhängig von GDScript. Sie ist auch dann verfügbar, wenn Sie Godot mit deaktiviertem GDScript-Modul kompilieren.
zh_tw: Expression 類是獨立於 GDScript 的。即便禁用 GDScript 模組編譯 Godot 也能使用。

source: Basic usage
de: Grundlegende Verwendung
zh_tw: 基本使用

source: To evaluate a mathematical expression, use::
de: Um einen mathematischen Ausdruck auszuwerten, verwenden Sie::
zh_tw: 要對數學運算式求值，請使用： ::

source: The following operators are available:
de: Folgende Operatoren sind verfügbar:
zh_tw: 可以使用以下運算子：

source: Operator
zh_tw: 運算子

source: Notes
de: Anmerkungen
zh_tw: 請注意

source: Addition ``+``
zh_tw: 其他注意事項

source: Can also be used to concatenate strings and arrays: - ``"hello" + " world"`` = ``hello world`` - ``[1, 2] + [3, 4]`` = ``[1, 2, 3, 4]``
de: Kann auch zur Verkettung von Strings und Arrays verwendet werden: - ``"Hallo" + " Welt"`` = ``Hallo Welt`` - ``[1, 2] + [3, 4]`` = ``[1, 2, 3, 4]``
zh_tw: 還可以用於連接字串和陣列：- ``"hello" + " world"`` = ``hello world`` - ``[1, 2] + [3, 4]`` = ``[1, 2, 3, 4]``

source: Subtraction (``-``)
de: Subtraktion (``-``)
zh_tw: 減法

source: Multiplication (``*``)
de: Multiplikation (``*``)
zh_tw: 乘（``*``）

source: Performs and integer division if both operands are integers. If at least one of them is a floating-point number, returns a floating-point value.
de: Führt eine Integer-Division durch, wenn beide Operanden Integer sind. Wenn mindestens einer der beiden Operanden eine Float-Zahl ist, wird ein Float-Wert zurückgegeben.
zh_tw: 兩個運算元都是整數時執行整數除法。如果至少有一個是浮點數，就會返回浮點值。

source: Modulo (``%``)
zh_tw: 求餘（``%``）

source: Returns the remainder of an integer division.
de: Gibt den Rest einer Integer-Division zurück.
zh_tw: 返回整數除法的餘數。

source: Spaces around operators are optional. Also, keep in mind the usual `order of operations <https://en.wikipedia.org/wiki/Order_of_operations>`__ applies. Use parentheses to override the order of operations if needed.
de: Leerzeichen um Operatoren sind optional. Denken Sie auch daran, dass die übliche `Reihenfolge der Operationen <https://en.wikipedia.org/wiki/Order_of_operations>`__ gilt. Verwenden Sie Klammern, um die Reihenfolge der Operationen bei Bedarf außer Kraft zu setzen.
zh_tw: 運算子周圍的空格是可選的。另外請記住，此處適用一般的`運算次序 <https://zh.wikipedia.org/zh-cn/%E9%81%8B%E7%AE%97%E6%AC%A1%E5%BA%8F>`__。必要時請使用括弧來覆蓋運算子的次序。

source: All the Variant types supported in Godot can be used: integers, floating-point numbers, strings, arrays, dictionaries, colors, vectors, …
de: Alle in Godot unterstützten Variantentypen können verwendet werden: Integer, Floats, Strings, Arrays, Dictionarys, Farben, Vektoren, …
zh_tw: Godot 所支援的所有 Variant 型別都可以使用：整數、浮點數、字串、陣列、字典、顏色、向量……

source: Arrays and dictionaries can be indexed like in GDScript::
de: Arrays und Dictionarys können wie in GDScript indiziert werden::
zh_tw: 陣列與字典的索引方法與 GDScript 一致： ::

source: Passing variables to an expression
de: Übergabe von Variablen an einen Ausdruck
zh_tw: 向運算式傳遞變數

source: You can pass variables to an expression. These variables will then become available in the expression's "context" and will be substituted when used in the expression::
de: Sie können Variablen an einen Ausdruck übergeben. Diese Variablen werden dann im "Kontext" des Ausdrucks verfügbar und werden bei der Verwendung im Ausdruck ersetzt::
zh_tw: 你可以將變數傳入運算式。這些變數就會進入這個運算式的“本文”，在運算式中使用就會被替換： ::

source: Both the variable names and variable values **must** be specified as an array, even if you only define one variable. Also, variable names are **case-sensitive**.
de: Sowohl die Variablennamen als auch die Variablenwerte **müssen** als Array angegeben werden, auch wenn Sie nur eine Variable definieren. Außerdem wird bei Variablennamen auf **Groß- und Kleinschreibung** geachtet.
zh_tw: 變數的名稱和變數的值都**必須**以陣列的形式指定，即便只定義一個變數也是如此。而且，變數名是**大小寫敏感**的。

source: Setting a base instance for the expression
de: Festlegen einer Basisinstanz für den Ausdruck
zh_tw: 為運算式設定基礎實例

source: By default, an expression has a base instance of ``null``. This means the expression has no base instance associated to it.
de: Standardmäßig hat ein Ausdruck eine Basisinstanz von ``null``. Das bedeutet, dass dem Ausdruck keine Basisinstanz zugeordnet ist.
zh_tw: 運算式預設的基礎實例是 ``null``。這意味著該運算式沒有關聯基礎實例。

source: When calling :ref:`Expression.execute() <class_Expression_method_execute>`, you can set the value of the ``base_instance`` parameter to a specific object instance such as ``self``, another script instance or even a singleton::
de: Wenn Sie :ref:`Ausdruck.execute() <class_Expression_method_execute>` aufrufen, können Sie den Wert des Parameters ``base_instance`` auf eine bestimmte Objektinstanz wie ``self``, eine andere Skriptinstanz oder sogar ein Singleton: setzen::
zh_tw: 呼叫 :ref:`Expression.execute() <class_Expression_method_execute>` 時，你可以將參數 ``base_instance`` 的值設為 ``self``、另一個腳本實例、單例等特定物件的實例： ::

source: Associating a base instance allows doing the following:
de: Das Assoziieren einer Basisinstanz ermöglicht Folgendes:
zh_tw: 關聯基礎實例可以實作以下功能：

source: Reference the instance's constants (``const``) in the expression.
de: Referenzieren der Instanz-Konstanten (``const``) in dem Ausdruck.
zh_tw: 在運算式中引用實例的常數（``const``）。

source: Reference the instance's member variables (``var``) in the expression.
de: Verweise auf die Instanz-Membervariablen (``var``) im Ausdruck.
zh_tw: 在運算式中引用實例的成員變數（``var``）。

source: Call methods defined in the instance and use their return values in the expression.
de: Aufruf von Methoden, die in der Instanz definiert sind, und Verwendung ihrer Rückgabewerte in dem Ausdruck.
zh_tw: 在運算式中呼叫定義在實例上的方法，並使用其返回值。

source: Setting a base instance to a value other than ``null`` allows referencing constants, member variables, and calling all methods defined in the script attached to the instance. Allowing users to enter expressions may allow cheating in your game, or may even introduce security vulnerabilities if you allow arbitrary clients to run expressions on other players' devices.
de: Wenn Sie eine Basisinstanz auf einen anderen Wert als ``null`` setzen, können Sie auf Konstanten und Membervariablen verweisen und alle Methoden aufrufen, die in dem mit der Instanz verbundenen Skript definiert sind. Wenn Sie Nutzern erlauben, Ausdrücke einzugeben, kann dies zu Betrug in Ihrem Spiel führen oder sogar zu Sicherheitslücken, wenn Sie beliebigen Clients erlauben, Ausdrücke auf den Geräten anderer Spieler auszuführen.
zh_tw: 將基礎實例設為非 ``null`` 值，就可以引用常數、成員變數、呼叫定義在該實例的附加腳本中的方法。允許使用者輸入運算式可能會導致在你的遊戲出現作弊，如果你允許任意客戶的在其他玩家的裝置上運作運算式的話，甚至還可能引入安全隱患。

source: Example script
de: Beispiel-Skript
zh_tw: GDScript 範例

source: The script below demonstrates what the Expression class is capable of::
de: Das folgende Skript zeigt, was die Klasse Expression kann::
zh_tw: 下面的腳本演示的是 Expression 類的功能： ::

source: The output from the script will be::
de: Die Ausgabe des Skripts lautet::
zh_tw: 腳本的功能

source: Built-in functions
de: Built-in-Funktionen
zh_tw: 內建函式

source: However, unlike GDScript, parameters are **always required** even if they're specified as being optional in the class reference. In contrast, this restriction on arguments doesn't apply to user-made functions when you bind a base instance to the expression.
de: Im Gegensatz zu GDScript sind Parameter jedoch **immer erforderlich**, auch wenn sie in der Klassenreferenz als optional angegeben sind. Im Gegensatz dazu gilt diese Einschränkung für Argumente nicht für benutzerdefinierte Funktionen, wenn Sie eine Basisinstanz an den Ausdruck binden.
zh_tw: 然而，與 GDScript 不同，參數**始終是必須的**，即使類參考中說明此參數為可選。不過，為運算式綁定了基礎實例時，使用者定義函式的參數沒有此限制。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: All methods in the :ref:`Global Scope<class_@GlobalScope>` are available in the Expression class, even if no base instance is bound to the expression. The same parameters and return types are available.
de: Alle Methoden im :ref:`Global Scope<class_@GlobalScope>` sind in der Klasse Expression verfügbar, auch wenn keine Basisinstanz an den Ausdruck gebunden ist. Es sind die gleichen Parameter und Rückgabetypen verfügbar.
