Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/how_to_read_the_godot_api.po
Languages: de, zh_cn, zh_tw

source: How to read the Godot API
de: Wie man die Godot-API liest
zh_cn: 如何阅读 Godot API
zh_tw: 如何閱讀 Godot API

source: On this page, you'll learn how to read the class reference for the Godot API.
de: Auf dieser Seite erfahren Sie, wie Sie die Klassenreferenz für die Godot-API lesen können.
zh_cn: 在这个页面，你将学习如何阅读 Godot API 的类参考。
zh_tw: 在此頁面上，您將學習如何閱讀 Godot API 的類別參考。

source: The API, or Application Programming Interface, is an index of what Godot offers users. It provides a brief summary of which classes exist, how they are related to each other, what features they have, and how to use them.
de: Die API (Application Programming Interface) ist ein Verzeichnis dessen, was Godot den Benutzern bietet. Sie enthält eine kurze Zusammenfassung darüber, welche Klassen es gibt, wie sie miteinander in Beziehung stehen, welche Funktionen sie haben und wie sie zu verwenden sind.
zh_cn: API，也就是应用(A)程序(P)接口(I),是 Godot 提供给用户的一个目录，提供了一些简要的信息，包括有那些类，如何找到它们，它们有哪些特性，以及如何使用它们。
zh_tw: API（應用程式介面）是 Godot 為使用者提供的內容的索引。它簡要概述了存在哪些類別、它們之間的關係、它們具有哪些功能以及如何使用它們。

source: Inheritance
de: Vererbung
zh_cn: 继承
zh_tw: 繼承

source: At the top of each file, you will see the name of the class.
de: Am Anfang jeder Datei sehen Sie den Namen der Klasse.
zh_cn: 在每个文件的开头，你可以看到类的名称。
zh_tw: 在每個檔案的頂部，您將看到類別的名稱。

source: The "Inherits" section lists each class the current one inherits. Here ``CanvasItem`` inherits ``Node`` and ``Node`` inherits ``Object``.
de: Der Abschnitt "Inherits" listet jede Klasse auf, von der die aktuelle Klasse erbt. Hier erbt ``CanvasItem`` von ``Node`` und ``Node`` erbt von ``Object``.
zh_cn: “继承”部分列出了当前的类继承了哪些类，此处 ``CanvasItem`` 继承自 ``Node`` 以及 ``Node`` 继承 自 ``Object`` 。
zh_tw: 「繼承」部分列出了目前繼承的每個類別。這裡``CanvasItem``繼承了``Node``，``Node``繼承了``Object``。

source: The "Inherited By" section lists each class which directly inherits the current class. Here ``Control`` and ``Node2D`` both inherit ``CanvasItem``.
de: Der Abschnitt "Inherited By" listet alle Klassen auf, die direkt von der aktuellen Klasse erben. Hier erben ``Control`` und ``Node2D`` beide von ``CanvasItem``.
zh_cn: “派生”部分列出了所有直接继承自当前类的类，此处 ``Control`` 和 ``Node2D`` 都继承了 ``CanvasItem`` 。
zh_tw: 「繼承者」部分列出了直接繼承目前類別的每個類別。這裡「Control」和「Node2D」都繼承了「CanvasItem」。

source: Brief Description
de: Kurzbeschreibung
zh_cn: 简要描述
zh_tw: 說明

source: Next a brief description of the class. This text appears in Godot Editor popups for creating Nodes, Resources, and other types.
de: Danach folgt eine kurze Beschreibung der Klasse. Dieser Text erscheint in Godot-Editor-Popups zum Erstellen von Nodes, Ressourcen und anderen Typen.
zh_cn: 接下来是类的简要描述，这些文字会出现在 Godot 编辑器用于创建节点或其他类型的弹出窗口里。
zh_tw: 接下來簡單介紹一下該類別。此文字出現在 Godot 編輯器彈出視窗中，用於建立節點、資源和其他型別。

source: Description
de: Beschreibung
zh_cn: 描述
zh_tw: 說明

source: Next a more detailed description the class, its features, and its use case(s).
de: Es folgt eine detailliertere Beschreibung der Klasse, ihrer Features und ihrer Anwendungsfälle.
zh_cn: 接下来是类更详细的描述，有哪些特性，以及使用示例。
zh_tw: 接下來更詳細地描述該類別、其功能及其用例。

source: Things you may find here:
de: Dinge, die Sie hier finden können:
zh_cn: 你可以在这里找到：
zh_tw: 你可以在這裡找到：

source: Specifics of how the class works.
de: Einzelheiten zur Funktionsweise der Klasse.
zh_cn: 类的具体原理。
zh_tw: 類的具體原理。

source: Code samples of common use cases.
de: Codebeispiele für häufige Anwendungsfälle.
zh_cn: 常见用法的代码示例。
zh_tw: 常見用法的程式碼範例。

source: Usage details which are shared between each of the class's methods.
de: Verwendungsdetails, die von allen Methoden der Klasse gemeinsam genutzt werden.
zh_cn: 适用于类中所有方法的用法细节。
zh_tw: 適用於類中所有方法的用法細節。

source: Warnings about required dependencies or configuration.
de: Warnungen über erforderliche Abhängigkeiten oder Konfigurationen.
zh_cn: 关于必要依赖项或配置的警告。
zh_tw: 關於必要依賴項或配置的警告。

source: Links to other related parts of the Godot API.
de: Links zu anderen verwandten Teilen der Godot-API.
zh_cn: 和 Godot API 其他部分的链接。
zh_tw: 和 Godot API 其他部分的連結。

source: Tutorials
zh_cn: 教程
zh_tw: 教學

source: The page then provides links to parts of the manual which mention or make use of the current class.
de: Die Seite enthält dann Links zu Teilen des Handbuchs, in denen die aktuelle Klasse erwähnt oder verwendet wird.
zh_cn: 这一页提供了用户手册中提到或使用了该类的链接。
zh_tw: 然後，該頁面提供指向手冊中提到或使用目前類別的部分的連結。

source: Properties
de: Propertys
zh_cn: 属性
zh_tw: 屬性

source: The Properties table lists the variables which belong to each instance of the class, also known as the "properties."
de: In der Tabelle "Propertys" sind die Variablen aufgelistet, die zu jeder Instanz der Klasse gehören und auch als "Propertys" bezeichnet werden.
zh_cn: 属性表列出了属于该类每个实例的变量
zh_tw: 屬性表列出了屬於該類別的每個實例的變量，也稱為“屬性”。

source: The left column contains the data type of the property. The text is also a link to that data type's Godot API page.
de: Die linke Spalte enthält den Datentyp der Property. Der Text ist auch ein Link zur Godot-API-Seite für diesen Datentyp.
zh_cn: 左边一列包含了属性的数据类型，同时文字也链接到了 Godot API 中有关该类型的页面。
zh_tw: 左列包含屬性的資料型別。該文字也是該資料型別的 Godot API 頁面的連結。

source: The center column contains the name of the property. The text is also a link to that property's full description on the page. Use this name to get the property's data or set a new value to it.
de: Die mittlere Spalte enthält den Namen der Property. Der Text ist auch ein Link zur vollständigen Beschreibung dieser Property auf der Seite. Verwenden Sie diesen Namen, um die Daten der Property abzurufen oder ihr einen neuen Wert zuzuweisen.
zh_cn: 中间一列包含了属性的名称，名称链接到了该属性完整描述的页面，可以使用属性的名称来获取属性对应的值或者将属性设置为新值。
zh_tw: 中心列包含屬性的名稱。該文字也是指向該屬性在頁面上的完整描述的連結。使用此名稱取得屬性的資料或為其設定新值。

source: The right column contains the default value of the property. To initialize it with a different value, you must set a different value via script or the Inspector.
de: Die rechte Spalte enthält den Defaultwert der Property. Um sie mit einem anderen Wert zu initialisieren, müssen Sie über ein Skript oder den Inspektor einen anderen Wert festlegen.
zh_cn: 右边一列包含了属性的默认值。要想将其初始化为不同的值，你需要通过代码或者检视器将其设置为不同的值。
zh_tw: 右列包含屬性的預設值。若要使用不同的值對其進行初始化，您必須透過腳本或屬性面板設定不同的值。

source: Methods
de: Methoden
zh_cn: 方法
zh_tw: 方法

source: The Methods table lists the functions which belong to each instance of the class, also known as the "methods."
de: In der Tabelle "Methoden" sind die Funktionen aufgelistet, die zu jeder Instanz der Klasse gehören, auch "Methoden" genannt.
zh_cn: 方法一栏列出了属于该类每个实例的函数
zh_tw: 方法表列出了屬於該類別的每個實例的函式，也稱為「方法」。

source: The left column contains the data type of the method's return value.
de: Die linke Spalte enthält den Datentyp des Rückgabewerts der Methode.
zh_cn: 左侧一栏包含了方法返回值的类型。
zh_tw: 左列包含方法傳回值的資料型別。

source: The right column contains the name, parameters, and qualifiers of the method. The name is the text before the opening parenthesis. It is also a link to the method's full description on the page. Use this name to call the method.
de: Die rechte Spalte enthält den Namen, die Parameter und die Qualifier der Methode. Der Name ist der Text vor der öffnenden Klammer. Er ist auch ein Link zur vollständigen Beschreibung der Methode auf der Seite. Verwenden Sie diesen Namen, um die Methode aufzurufen.
zh_cn: 右侧一列包含了方法的名称，参数和限定符。方法的名字就是括号前的文字，可以使用这个名字来调用方法，同时，该文字也链接到方法的完整描述。
zh_tw: 右列包含方法的名稱、參數和限定符。名稱是左括號之前的文字。它也是頁面上該方法的完整描述的連結。使用該名稱來呼叫該方法。

source: For each parameter, the page details its data type, name, and default value, if any.
de: Für jeden Parameter werden auf der Seite der Datentyp, der Name und ggf. der Defaultwert angegeben.
zh_cn: 对于每个属性，该页面详细给出了数据类型，名称，和默认值（如果有）。
zh_tw: 對於每個參數，該頁面詳細介紹了其資料型別、名稱和預設值（如果有）。

source: Possible qualifiers include...
de: Mögliche Qualifier sind...
zh_cn: 一些可能包含的限定符...
zh_tw: 可能的預選賽包括...

source: ``const``: the method does not change any data in the class instance.
de: ``const``: Die Methode ändert keine Daten in der Klasseninstanz.
zh_cn: ``const``: 该方法不会改变类实例的任何数据。
zh_tw: ``const``：該方法不會更改類別實例中的任何資料。

source: ``virtual``: the method does nothing but wait for a script to override it.
de: ``virtual``: Die Methode tut nichts weiter, als darauf zu warten, dass ein Skript sie überschreibt.
zh_cn: ``virtual``: 该方法什么都不做，等待脚本重写。
zh_tw: ``virtual``：該方法什麼也不做，只是等待腳本覆蓋它。

source: ``vararg``: the method can accept an arbitrary number of arguments.
de: ``vararg``: die Methode kann eine beliebige Anzahl von Argumenten annehmen.
zh_cn: ``vararg``: 方法可以接受任意数量的参数。
zh_tw: 對每個索引鍵雜湊任意次。

source: Signals
de: Signale
zh_cn: 信号
zh_tw: 訊號

source: The Signals list details the names and parameters of events which "signal" a change in game state to other class instances.
de: Die Liste "Signale" enthält die Namen und Parameter von Ereignissen, die anderen Klasseninstanzen eine Änderung des Spielzustands "signalisieren".
zh_cn: 信号列表详细介绍了向其他类实例“发出”游戏状态变化信号的事件的名称和参数。
zh_tw: 訊號列表詳細介紹了向其他類別實例「發出」遊戲狀態變化訊號的事件的名稱和參數。

source: Like the Methods table, any parameters will include their data type and name.
de: Wie in der Methoden-Tabelle werden alle Parameter mit ihrem Datentyp und Namen angegeben.
zh_cn: 和方法表一样，每个参数都包含其数据类型和名称。
zh_tw: 與方法表一樣，任何參數都將包含其資料型別和名稱。

source: Each signal also has a detailed explanation of when the signal is emitted.
de: Zu jedem Signal gibt es auch eine ausführliche Erklärung, wann das Signal ausgesendet wird.
zh_cn: 每个信号也详细说明了其何时发出。
zh_tw: 每個訊號還詳細說明了該訊號何時發出。

source: Enumerations
de: Enumerationen
zh_cn: 枚举
zh_tw: 列舉

source: The Enumerations list details the enumerable data types associated with the current class.
de: In der Liste "Enumerationen" werden die enumerierbaren Datentypen aufgeführt, die mit der aktuellen Klasse verbunden sind.
zh_cn: 枚举列表详细说明了与当前类关联的可枚举数据类型。
zh_tw: 列舉列表詳細說明了與目前類別關聯的可列舉資料型別。

source: For each enumeration, the page states its name and then lists its possible values.
de: Für jede Enumeration gibt die Seite den Namen an und listet dann die möglichen Werte auf.
zh_cn: 对于每一个枚举，该页面说明了其名称，然后列出了可能的值。
zh_tw: 對於每個列舉，該頁面都會說明其名稱，然後列出其可能的值。

source: For each enumeration value, the page states its name, its integer value, and an explanation of its use case(s) and/or affects.
de: Für jeden Enumerationswert werden auf der Seite sein Name, sein Integer-Wert und eine Erläuterung seines/ihres Anwendungsfalls und/oder seiner/ihrer Auswirkungen angegeben.
zh_cn: 对于每个枚举值，该页面都会说明其名称，对应的整数值，和其用例/或作用的解释。
zh_tw: 對於每個列舉值，頁面都會說明其名稱、整數值以及其用例和/或影響的說明。

source: Constants
de: Konstanten
zh_cn: 常量
zh_tw: 常數

source: The Constants list details named integer constants in the current class.
de: Die Liste "Konstanten" enthält Details zu benannten Integer-Konstanten in der aktuellen Klasse.
zh_cn: 常量列表详细介绍了当前类中命名的整型常量。
zh_tw: 常數列表詳細介紹了目前類別中命名的整型常數。

source: For each constant, the page states its name, its integer value, and an explanation of its use case(s) and/or affects.
de: Für jede Konstante werden auf der Seite ihr Name, ihr Integer-Wert und eine Erläuterung ihres Anwendungsfalls bzw. ihrer Auswirkungen angegeben.
zh_cn: 对每个常量，该页面说明了其名称，整数值，和对其用例/或影响的解释。
zh_tw: 例和/或影響的解釋。

source: ``NOTIFICATION_*`` constants' descriptions will state which engine event triggers the notification.
de: Die Beschreibungen der Konstanten ``NOTIFICATION_*`` geben an, welches Engine-Event die Benachrichtigung auslöst.
zh_cn: ``NOTIFICATION_*`` 常量的描述将表明哪个引擎事件会触发通知。
zh_tw: 「NOTIFICATION_*」常數的描述將說明哪個引擎事件觸發通知。

source: Property Descriptions
de: Property-Beschreibungen
zh_cn: 属性说明
zh_tw: 屬性說明

source: The Property Descriptions list details everything about each property.
de: Die Liste "Property-Beschreibungen" enthält alle Details zu den einzelnen Propertys.
zh_cn: “属性说明”列表详细说明了每个属性的所有信息。
zh_tw: 屬性描述列表詳細介紹了每個屬性的所有資訊。

source: It restates the data type and name of the property.
de: Sie gibt den Datentyp und den Namen der Property wieder.
zh_cn: 其重申了属性的数据类型和名称。
zh_tw: ``name`` 是要加入屬性面板中的分類別名稱稱；

source: Every property in the Godot API is bound to a pair of setter and getter functions. Using either is equivalent. They are listed here.
de: Jede Property in der Godot-API ist an ein Paar von Setter- und Getter-Funktionen gebunden. Die Verwendung einer dieser Funktionen ist gleichwertig. Sie sind hier aufgeführt.
zh_cn: Godot API 中的每个属性都绑定了一对 setter 和 getter 函数，使用其中任何一个都是等效的。将其列在此处。
zh_tw: Godot API 中的每個屬性都會綁定到一對 setter 和 getter 函式。使用其中任何一個都是等效的。它們列在這裡。

source: Below that is a detailed summary of what the property's data represents, its use case(s) and/or the affects of changing it. It may include code samples and/or links to relevant parts of the Godot API.
de: Darunter befindet sich eine ausführliche Zusammenfassung dessen, was die Daten der Property repräsentieren, ihr(e) Verwendungszweck(e) und/oder die Auswirkungen einer Änderung der Property. Sie kann Codebeispiele und/oder Links zu relevanten Teilen der Godot-API enthalten.
zh_cn: 之后是每个属性数据代表的含义，其用例或改变它的影响的详细说明。此处可能包含代码示例或指向 Godot API 相关部分的链接。
zh_tw: 以下是屬性資料所代表的內容、其用例和/或更改它的影響的詳細摘要。它可能包括程式碼範例和/或指向 Godot API 相關部分的連結。

source: Knowing the setter and getter names is useful when one must bind a method name or :ref:`Callable<class_Callable>` to something.
de: Die Kenntnis der Setter- und Getter-Namen ist nützlich, wenn man einen Methodennamen oder :ref:`Callable<class_Callable>` an etwas binden muss.
zh_cn: 当必须将方法名称或 :ref:`Callable<class_Callable>` 绑定到某物时，了解 setter 和 getter 名称非常有用。
zh_tw: 當必須將方法名稱或 Callable<class_Callable>` 綁定到某物時，了解 setter 和 getter 名稱非常有用。

source: Method Descriptions
de: Methodenbeschreibungen
zh_cn: 方法描述
zh_tw: 方法說明

source: The Method Descriptions list details everything about each method.
de: In der Liste der Methodenbeschreibungen finden Sie alle Informationen zu den einzelnen Methoden.
zh_cn: 方法描述列表详细介绍了每个方法的所有内容。
zh_tw: 方法描述列表詳細介紹了每種方法的所有內容。

source: It restates the method's return data type, parameter names/types/defaults, and qualifiers.
de: Sie gibt den Rückgabedatentyp der Methode, die Parameternamen/Typen/Defaultwerte und die Qualifier an.
zh_cn: 它重申了方法的返回值类型，参数名称/类型/默认值/ ,以及限定符。
zh_tw: 它重申了方法的傳回資料型別、參數名稱/型別/預設值和限定符。

source: Below that is a detailed summary of what the method does and its use case(s). It may include code samples and/or links to relevant parts of the Godot API.
de: Darunter befindet sich eine ausführliche Zusammenfassung der Funktion der Methode und ihres Anwendungsfalls/ihrer Anwendungsfälle. Sie kann Codebeispiele und/oder Links zu relevanten Teilen der Godot-API enthalten.
zh_cn: 之后是方法的用途和用例的详细介绍。可能包含代码示例以及指向Godot API 相关部分的链接（有的话）。
zh_tw: 以下是該方法的用途及其用例的詳細摘要。它可能包括程式碼範例和/或指向 Godot API 相關部分的連結。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
