Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/idle_and_physics_processing.po
Languages: de, zh_cn, zh_tw

source: Idle and Physics Processing
de: Leerlauf und Physik-Prozessierung
zh_cn: 空闲处理与物理处理
zh_tw: 空閒處理與物理處理

source: Games run in a loop. Each frame, you need to update the state of your game world before drawing it on screen. Godot provides two virtual methods in the Node class to do so: :ref:`Node._process() <class_Node_private_method__process>` and :ref:`Node._physics_process() <class_Node_private_method__physics_process>`. If you define either or both in a script, the engine will call them automatically.
de: Spiele laufen in einer Schleife. Bei jedem Frame müssen Sie den Zustand Ihrer Spielwelt aktualisieren, bevor Sie sie auf den Bildschirm zeichnen. Godot bietet zwei virtuelle Methoden in der Node-Klasse, um dies zu tun: :ref:`Node._process() <class_Node_private_method__process>` und :ref:`Node._physics_process() <class_Node_private_method__physics_process>`. Wenn Sie eine oder beide in einem Skript definieren, wird die Engine sie automatisch aufrufen.
zh_cn: 游戏是通过循环来运行的，每一帧都需要先更新游戏世界的状态，然后再把它绘制到屏幕上。Godot 为 Node 类提供了两个虚方法来完成帧循环处理：\ :ref:`Node._process() <class_Node_method__process>` 和 :ref:`Node._physics_process() <class_Node_method__physics_process>`\ 。如果你在脚本中定义了这两个函数的其中之一，或者两者都定义了，引擎就会自动进行调用这个（这些）虚函数。

source: There are two types of processing available to you:
de: Es stehen Ihnen zwei Arten der Prozessierung zur Verfügung:
zh_cn: 可以使用两种帧循环处理方式：
zh_tw: Godot 中需要的圖示有兩種型別：

source: **Idle processing** allows you to run code that updates a node every frame, as often as possible.
de: Die **Leerlauf-Prozessierung** ermöglicht es Ihnen, Code auszuführen, der einen Node so oft wie möglich pro Frame aktualisiert.
zh_cn: **空闲处理**\ （Idle processing）可以用来执行每帧更新节点的代码，执行频率会尽可能地快。
zh_tw: **空閒處理**（Idle processing）可以用來執行每影格更新節點的程式碼，執行頻率會盡可能地快。

source: **Physics processing** happens at a fixed rate, 60 times per second by default. This is independent of your game's actual framerate, and keeps physics running smoothly. You should use it for anything that involves the physics engine, like moving a body that collides with the environment.
de: Die **Physik-Prozessierung** erfolgt mit einer festen Rate, standardmäßig 60 Mal pro Sekunde. Dies ist unabhängig von der tatsächlichen Framerate Ihres Spiels und sorgt dafür, dass die Physik reibungslos läuft. Sie sollten sie für alles verwenden, was die Physik-Engine betrifft, wie das Bewegen eines Bodys, der mit der Umgebung kollidiert.
zh_cn: **物理处理**\ （Physics processing）的执行频率是固定的，默认为每秒 60 次。物理处理和游戏的实际帧率无关，可以让物理平滑执行，故一切与物理引擎相关的行为都应该用物理处理帧循环函数来进行处理，如移动可能会与环境相碰撞的实体。
zh_tw: **物理處理**（Physics processing）的頻率是固定的，預設為每秒 60 次。它和遊戲的實際影格率無關，可以讓物理平滑執行。任何與物理引擎相關的東西都應該用它，比如移動可能與環境相碰撞的實體。

source: You can activate idle processing by defining the ``_process()`` method in a script. You can turn it off and back on by calling :ref:`Node.set_process() <class_Node_method_set_process>`.
de: Sie können die Leerlauf-Prozessierung aktivieren, indem Sie die Methode ``_process()`` in einem Skript definieren. Sie können sie durch den Aufruf von :ref:`Node.set_process() <class_Node_method_set_process>` aus- und wieder einschalten.
zh_cn: 在脚本中定义 ``_process()`` 方法就会激活空闲处理。可以通过调用 :ref:`Node.set_process() <class_Node_method_set_process>` 来对空闲处理的启用状态进行控制。
zh_tw: 閒置處理會在腳本中有 :ref:`Node._process() <class_Node_method__process>`方法時候啟動。可以通過 :ref:`Node.set_process() <class_Node_method_set_process>` 方法來開啟或關閉閒置處理。

source: The engine calls this method every time it draws a frame:
de: Die Engine ruft diese Methode jedes Mal auf, wenn sie einen Frame zeichnet:
zh_cn: 引擎每需要绘制一帧画面，就会调用一次该方法：
zh_tw: 每次引擎需要繪製一影格的時候就會呼叫該方法：

source: Keep in mind that the frequency at which the engine calls ``_process()`` depends on your application's framerate, which varies over time and across devices.
de: Beachten Sie, dass die Häufigkeit, mit der die Engine ``_process()`` aufruft, von der Framerate Ihrer Anwendung abhängt, die zeitlich und geräteabhängig variiert.
zh_cn: 切记：引擎调用 ``_process()`` 的频率以应用的实际帧率为准，该实际帧率会根据时间的变化而变化，在不同设备上该实际帧率也会有所不同。
zh_tw: 有一點很重要的是， ``_process()`` 的呼叫頻率會依據應用程式在執行時的 FPS (Frames Per Second，每秒影格數) 而定。這個頻率在不同裝置下可能會不同。

source: The function's ``delta`` parameter is the time elapsed in seconds since the previous call to ``_process()``. Use this parameter to make calculations independent of the framerate. For example, you should always multiply a speed value by ``delta`` to animate a moving object.
de: Der Parameter ``delta`` der Funktion ist die seit dem letzten Aufruf von ``_process()`` verstrichene Zeit in Sekunden. Verwenden Sie diesen Parameter, um Berechnungen unabhängig von der Framerate zu machen. Zum Beispiel sollten Sie immer einen Geschwindigkeitswert mit ``delta`` multiplizieren, um ein sich bewegendes Objekt zu animieren.
zh_cn: 该函数的参数 ``delta`` 表示从上一次调用 ``_process()`` 开始所经过的秒数，借助这个参数就可以进行与帧率无关的计算。例如，为移动物理做动画时，应该始终将速度值乘上 ``delta``\ 。
zh_tw: 函式的參數 ``delta`` 是從上一次呼叫 ``_process()`` 開始所經過的秒數。借助這個參數就可以進行與影格率無關的計算。例如，為移動物理做動畫時，應該始終將速度值乘上 ``delta``。

source: Physics processing works with a similar virtual function: ``_physics_process()``. Use it for calculations that must happen before each physics step, like moving a character that collides with the game world. As mentioned above, ``_physics_process()`` runs at fixed time intervals as much as possible to keep the physics interactions stable. You can change the interval between physics steps in the Project Settings, under Physics -> Common -> Physics Fps. By default, it's set to run 60 times per second.
de: Die Physik-Prozessierung funktioniert mit einer ähnlichen virtuellen Funktion: ``_physics_process()``. Verwenden Sie diese Funktion für Berechnungen, die vor jedem physikalischen Schritt stattfinden müssen, wie z.B. das Bewegen eines Charakters, der mit der Spielwelt kollidiert. Wie bereits erwähnt, läuft ``_physics_process()`` so oft wie möglich in festen Zeitabständen ab, um die Physik-Interaktionen stabil zu halten. Sie können das Intervall zwischen den Physikschritten in den Projekteinstellungen unter Physik -> Allgemein -> Physik-Fps ändern. Standardmäßig ist es so eingestellt, dass es 60 Mal pro Sekunde ausgeführt wird.
zh_cn: 物理处理使用的是类似的虚函数：\ ``_physics_process()``\ ，用于必须在每一次物理迭代前进行的计算，比如移动可能会与游戏世界发生碰撞的角色。前面提到过，为了实现平稳的物理交互，\ ``_physics_process()`` 的执行间隔是尽可能固定的，可以在“项目设置”的“Physics -> Common -> Physics Fps”（物理 -> 常规 -> 物理 FPS）中修改物理迭代之间的间隔，默认设置是每秒 60 次。
zh_tw: 使用 ``_physics_process()`` 來進行物理處理，但物理處理是在每個物理步驟前使用的，如控制角色。物理處理永遠都在物理步驟之前執行，而且會以相同的間隔呼叫，預設為每秒 60 次。可以在專案設定中的 [Physics] -> [Common] -> [Physics FPS] 來更改這個間隔。

source: The engine calls this method before every physics step:
de: Die Engine ruft diese Methode vor jedem Physikschritt auf:
zh_cn: 引擎每进行一次物理计算，就会调用一次该方法：
zh_tw: 每次引擎需要繪製一影格的時候就會呼叫該方法：

source: The function ``_process()`` is not synchronized with physics. Its rate depends on hardware and game optimization. It also runs after the physics step in single-threaded games.
de: Die Funktion ``_process()`` ist nicht mit der Physik synchronisiert. Ihre Geschwindigkeit hängt von der Hardware und der Spieloptimierung ab. Sie läuft auch nach dem Physikschritt in Single-Thread-Spielen.
zh_cn: ``_process()`` 函数不与物理处理同步执行，且其执行频率会受到硬件和游戏优化的影响。在单线程游戏中，会在物理迭代后执行。
zh_tw: 然而，``_process()`` 函式並不與物理處理同步。_process() 的影格率並不固定，且會根據硬體與遊戲的最佳化而有所不同。在單一執行緒的遊戲上，_process() 會在物理步驟後才被執行。

source: You can see the ``_process()`` function at work by creating a scene with a single Label node, with the following script attached to it:
de: Sie können die Funktion ``_process()`` bei der Arbeit sehen, indem Sie eine Szene mit einem einzelnen Label-Node erstellen, an den das folgende Skript angehängt ist:
zh_cn: 要观察 ``_process()`` 的执行，可以创建一个只有单个 Label 节点的场景，然后把下面的脚本附加给这个 Label 节点：
zh_tw: 有一個簡單的方法可以讓我們瞭解 ``_process()``。先建立一個有 Label 節點的場景，然後使用下列腳本：

source: When you run the scene, you should see a counter increasing each frame.
de: Wenn Sie die Szene laufen lassen, sollten Sie einen Zähler sehen, der mit jedem Frame steigt.
zh_cn: 运行场景，你就会看到一个每帧都会增加的计数器。
zh_tw: 這樣就會顯示一個每一影格都會增加的計數器。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
