Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/instancing_with_signals.po
Languages: de, zh_tw

source: Signal
zh_tw: 訊號

source: Instancing with signals
de: Instanziierung mit Signalen
zh_tw: 產生實體與訊號

source: Signals provide a way to decouple game objects, allowing you to avoid forcing a fixed arrangement of nodes. One sign that a signal might be called for is when you find yourself using ``get_parent()``. Referring directly to a node's parent means that you can't easily move that node to another location in the scene tree. This can be especially problematic when you are instancing objects at runtime and may want to place them in an arbitrary location in the running scene tree.
de: Signale bieten eine Möglichkeit, Spielobjekte zu entkoppeln, so dass Sie eine feste Anordnung von Nodes vermeiden können. Ein Anzeichen dafür, dass ein Signal notwendig sein könnte, ist, wenn Sie ``get_parent()`` verwenden. Ein direkter Verweis auf den Elternteil eines Nodes bedeutet, dass man diesen Node nicht einfach an eine andere Stelle im Szenenbaum verschieben kann. Dies kann besonders problematisch sein, wenn Sie Objekte zur Laufzeit instanziieren und sie an einer beliebigen Stelle im laufenden Szenenbaum platzieren möchten.
zh_tw: 訊號提供了一種解耦遊戲物件的方式, 讓你避免強行強制固定節點排列. 當使用 ``get_parent()`` 時, 你會發現可能需要呼叫訊號的一個旗標, 直接引用一個節點的父節點意味著你不能輕易地將該節點移動到場景樹的另一個位置. 當你在運作時產生實體物件, 並且可能想把它們放在運作中的場景樹的任意位置時, 這可能是個問題.

source: Below we'll consider an example of such a situation: firing bullets.
de: Im Folgenden betrachten wir ein Beispiel für eine solche Situation: das Abfeuern von Geschossen.
zh_tw: 下面我們將考慮這種情況的一個例子: 發射子彈.

source: Shooting example
de: Beispiel für Geschosse
zh_tw: 射擊範例

source: Consider a player character that can rotate and shoot towards the mouse. Every time the mouse button is clicked, we create an instance of the bullet at the player's location. See :ref:`doc_instancing` for details.
de: Nehmen wir eine Spielerfigur, die sich drehen und in Richtung der Maus schießen kann. Jedes Mal, wenn die Maustaste geklickt wird, erstellen wir eine Instanz des Geschosses an der Position des Spielers. Siehe :ref:`doc_instancing` für Details.
zh_tw: 考慮一個可以旋轉並向滑鼠射擊的玩家角色. 每次點擊滑鼠按鈕, 我們就在玩家的位置建立一個子彈的實例. 詳見 :ref:`doc_instancing` .

source: We'll use an ``Area2D`` for the bullet, which moves in a straight line at a given velocity:
de: Wir verwenden ein ``Area2D`` für das Geschoss, das sich mit einer bestimmten Geschwindigkeit in einer geraden Linie bewegt:
zh_tw: 我們用 ``Area2D`` 來表示子彈, 它以給定的速度直線運動:

source: However, if the bullets are added as children of the player, then they will remain "attached" to the player as it rotates:
de: Wenn die Geschosse jedoch als Child-Elemente des Spielers hinzugefügt werden, bleiben sie an dem Spieler "gebunden", während er sich dreht:
zh_tw: 然而, 如果子彈作為遊戲角色的子節點新增, 那麼當它旋轉時, 子彈將仍然保持 "附著" 在遊戲角色身上:

source: Instead, we need the bullets to be independent of the player's movement - once fired, they should continue traveling in a straight line and the player can no longer affect them. Instead of being added to the scene tree as a child of the player, it makes more sense to add the bullet as a child of the "main" game scene, which may be the player's parent or even further up the tree.
de: Stattdessen müssen die Geschosse unabhängig von der Bewegung des Spielers sein - einmal abgefeuert, sollten sie sich weiterhin in einer geraden Linie bewegen und der Spieler kann sie nicht mehr beeinflussen. Anstatt das Geschoss als Child-Element des Spielers in den Szenenbaum hinzuzufügen, ist es sinnvoller, das Geschoss als Child-Element der "Haupt"-Spielszene hinzuzufügen, die entweder das übergeordnete Objekt des Spielers oder sogar weiter oben im Baum sein kann.
zh_tw: 相反, 我們需要子彈獨立於遊戲角色的移動——一旦發射, 子彈將持續沿著直線運動, 遊戲角色就不能再影響它們了. 與其作為遊戲角色的子節點被新增到場景樹中, 不如將子彈作為 "主" 遊戲場景的子節點新增上去更有意義, 後者可能是遊戲角色的父節點, 甚至可能是更高層級的樹.

source: You could do this by adding the bullet to the main scene directly:
de: Sie können dies tun, indem Sie das Geschoss direkt hinzufügen:
zh_tw: 你可以通過將子彈直接新增到主場景中來做到這一點:

source: However, this will lead to a different problem. Now if you try to test your "Player" scene independently, it will crash on shooting, because there is no parent node to access. This makes it a lot harder to test your player code independently and also means that if you decide to change your main scene's node structure, the player's parent may no longer be the appropriate node to receive the bullets.
de: Dies führt jedoch zu einem anderen Problem. Wenn Sie nun versuchen, Ihre "Spieler"-Szene unabhängig voneinander zu testen, stürzt sie beim Schießen ab, da es keinen Parent-Node gibt, auf den Sie zugreifen können. Dies macht es viel schwieriger, den Spieler-Code unabhängig zu testen. Wenn Sie sich entscheiden, die Node-Struktur der Hauptszene zu ändern, ist das Parent-Element des Spielers möglicherweise nicht mehr der geeignete Node, um das Geschoss zu empfangen.
zh_tw: 然而, 這將導致一個不同的問題. 現在, 如果你試圖獨立測試你的 "Player" 場景, 它將在射擊時當機, 因為沒有父節點可以存取. 這使得獨立測試你的遊戲角色程式碼變得更加困難, 也意味著如果你決定改變你的主場景的節點結構, 遊戲角色的父節點可能不再是接收子彈的適當節點.

source: The solution to this is to use a signal to "emit" the bullets from the player. The player then has no need to "know" what happens to the bullets after that - whatever node is connected to the signal can "receive" the bullets and take the appropriate action to spawn them.
de: Die Lösung dafür ist, ein Signal zu verwenden, um die Geschosse vom Spieler "abzufeuern". Der Spieler muss dann nicht "wissen", was danach mit den Geschossen geschieht. Jeder Node, der mit dem Signal verbunden ist, kann die Geschosse "empfangen" und entsprechende Aktionen durchführen, um sie zu erzeugen.
zh_tw: 解決這個問題的方法是使用一個訊號來 "發射" 遊戲角色的子彈. 遊戲角色不需要 "知道" 子彈在那之後發生了什麼——任何連接到訊號的節點都可以 "接收" 子彈並採取適當的行動來產生它們.

source: Here is the code for the player using signals to emit the bullet:
de: Hier ist der Code für den Spieler, der Signale verwendet, um das Geschoss auszusenden:
zh_tw: 下面是遊戲角色使用訊號發射子彈的程式碼:

source: In the main scene, we then connect the player's signal (it will appear in the "Node" tab of the Inspector)
de: In der Hauptszene verbinden wir dann das Signal des Spielers (es erscheint im "Node"-Tab des Inspektors)
zh_tw: 在主場景中，我們連接遊戲角色的訊號（它將出現在“節點”分頁中）

source: Now the bullets will maintain their own movement independent of the player's rotation:
de: Jetzt werden die Geschosse ihre Bewegung beibehalten, unabhängig von der Rotation des Spielers:
zh_tw: 現在子彈將自行運作，獨立於遊戲角色的旋轉：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
