Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/nodes_and_scene_instances.po
Languages: de, zh_cn, zh_tw

source: Nodes and scene instances
de: Nodes und Szeneninstanzen
zh_cn: 节点与场景实例
zh_tw: 節點與資源

source: This guide explains how to get nodes, create nodes, add them as a child, and instantiate scenes from code.
de: In dieser Anleitung wird erklärt, wie man Nodes abruft, Nodes erstellt, sie als Child-Element hinzufügt und Szenen aus dem Code instanziiert.
zh_cn: 本指南将介绍如何获取节点、创建节点，如何将节点添加为子项，以及如何使用代码实例化场景。
zh_tw: 本指南將介紹如何獲取節點、建立節點、將節點新增為子項、使用程式碼產生實體場景。

source: Getting nodes
de: Zugang zu Nodes
zh_cn: 获取节点
zh_tw: 建立節點

source: You can get a reference to a node by calling the :ref:`Node.get_node() <class_Node_method_get_node>` method. For this to work, the child node must be present in the scene tree. Getting it in the parent node's ``_ready()`` function guarantees that.
de: Sie können eine Referenz auf einen Node erhalten, indem Sie die Methode :ref:`Node.get_node() <class_Node_method_get_node>` aufrufen. Damit dies funktioniert, muss der Child-Node im Szenenbaum vorhanden sein. Dies wird durch die ``_ready()`` Funktion des Parent-Nodes garantiert.
zh_cn: 你可以通过调用 :ref:`Node.get_node() <class_Node_method_get_node>` 方法来获取对某个节点的引用，此时子节点必须在场景树中才能获取成功。在父节点的 ``_ready()`` 函数中获取就可以保证这一点。
zh_tw: 你可以通過呼叫 :ref:`Node.get_node() <class_Node_method_get_node>` 方法來獲取節點的引用。子節點必須在場景樹中才能成功。在父節點的 ``_ready()`` 函式中獲取就可以保證這一點。

source: If, for example, you have a scene tree like this, and you want to get a reference to the Sprite2D and Camera2D nodes to access them in your script.
de: Wenn Sie zum Beispiel einen Szenenbaum wie diesen haben und einen Verweis auf die Nodes Sprite2D und Camera2D erhalten möchten, um in Ihrem Skript darauf zuzugreifen.
zh_cn: 例如，如果有这样的场景树，你希望获得对 Sprite2D 和 Camera2D 节点的引用，以便在脚本中访问这些节点。
zh_tw: 打個比方，如果你的場景樹是這樣的，並且你想要在腳本中獲取 Sprite 和 Camera2D 節點的引用。

source: To do so, you can use the following code.
de: Dazu können Sie den folgenden Code verwenden.
zh_cn: 那么，你便可以使用如下代码。
zh_tw: 有下列事項需注意：

source: Note that you get nodes using their name, not their type. Above, "Sprite2D" and "Camera2D" are the nodes' names in the scene.
de: Beachten Sie, dass Sie Zugriff auf Nodes über ihren Namen und nicht über ihren Typ erhalten. Oben: "Sprite2D" und "Camera2D" sind die Namen der Nodes in der Szene.
zh_cn: 请注意：你是通过名称来获取节点的，而非通过节点的类型来获取的。上面的“Sprite2D”和“Camera2D”都是这些节点在场景中的名字。
zh_tw: 請注意，你是通過名稱來獲取節點的，和型別無關。上面的“Sprite”和“Camera2D”都是這些節點在場景中的名字。

source: If you rename the Sprite2D node as Skin in the Scene dock, you have to change the line that gets the node to ``get_node("Skin")`` in the script.
de: Wenn Sie den Sprite2D-Node im Szenendock in Skin umbenennen, müssen Sie die Zeile, die den Node erhält, im Skript in ``get_node("Skin")`` ändern.
zh_cn: 如果你在“场景”面板中将“Sprite2D”节点重命名为“Skin”，那么就必须在脚本里把获得节点的那一行语句改成 ``get_node("Skin")``\ 。
zh_tw: 如果你在“場景”面板中將 Sprite 節點重命名為“Skin”，那就必須在腳本裡把獲得節點的那一行敘述寫成 ``get_node("Skin")``。

source: Node paths
de: Node-Pfade
zh_cn: 节点路径

source: When getting a reference to a node, you're not limited to getting a direct child. The ``get_node()`` function supports paths, a bit like when working with a file browser. Add a slash to separate nodes.
de: Wenn Sie eine Referenz auf einen Node erhalten, sind Sie nicht darauf beschränkt, einen direkten Child-Node zu erhalten. Die Funktion ``get_node()`` unterstützt Pfade, ein bisschen wie bei der Arbeit mit einem Dateibrowser. Fügen Sie einen Schrägstrich hinzu, um Nodes zu trennen.
zh_cn: 获取节点的引用时，并不仅限于直接子节点。\ ``get_node()`` 函数支持使用节点路径来获取节点。节点路径有点类似文件浏览器里的路径，可以用斜杠来分隔节点。
zh_tw: 獲取節點的引用時，並不僅限於直接子節點。``get_node()`` 函式支援使用路徑，有點類似檔瀏覽器裡的路徑。可以用斜杠分隔節點。

source: Take the following example scene, with the script attached to the UserInterface node.
de: Nehmen Sie die folgende Beispielszene, in der das Skript an den UserInterface-Node angehängt ist.
zh_cn: 在下面这个实例场景中，脚本是附加在 UserInterface 节点上的。
zh_tw: 在下面這個實例場景中，腳本是附加在 UserInterface 節點上的。

source: To get the AnimationPlayer node, you would use the following code.
de: Um den AnimationPlayer-Node zu erhalten, würden Sie den folgenden Code verwenden.
zh_cn: 要获取 AnimationPlayer 节点，你可以使用如下代码。
zh_tw: 有下列事項需注意：

source: As with file paths, you can use ".." to get a parent node. The best practice is to avoid doing that though not to break encapsulation. You can also start the path with a forward slash to make it absolute, in which case your topmost node would be "/root", the application's predefined root viewport.
de: Wie bei Dateipfaden, können Sie ".." verwenden, um einen Parent-Node zu erhalten. Es ist bewährte Praxis, dies zu vermeiden, um einen Kapselungsbruch zu vermeiden. Sie können den Pfad auch mit einem Schrägstrich beginnen, um ihn absolut zu machen. In diesem Fall wäre Ihr oberster Node "/root", der vordefinierte Root-Viewport der Anwendung.
zh_cn: 和文件路径一样，你也可以使用“..”来获取父节点，最好不要这么做，以免破坏封装。你还可以让路径以斜杠开头，这样的路径叫做绝对路径，其最上层的节点就是“/root”，即程序预定义的根视口。
zh_tw: 和檔路徑一樣，你可以使用“..”來獲取父節點。最佳實踐是不要這麼做，避免破壞封裝。你還可以讓路徑以斜杠開頭，這樣的路徑是絕對路徑，最上層的節點就是“/root”，即程式的預定義根視口。

source: Syntactic sugar
de: Syntaktischer Zucker
zh_cn: 语法糖
zh_tw: 語法糖

source: You can use two shorthands to shorten your code in GDScript. Firstly, putting the ``@onready`` annotation before a member variable makes it initialize right before the ``_ready()`` callback.
de: Sie können zwei Abkürzungen verwenden, um Ihren Code in GDScript zu verkürzen. Erstens, wenn Sie die Anmerkung ``@onready`` vor eine Membervariable setzen, wird diese direkt vor dem ``_ready()``-Callback initialisiert.
zh_cn: GDScript 中有两个快速写法来缩短节点获取代码的长度。首先是在成员变量的前面写上 ``@onready`` 注解，这样这个变量就会刚好在 ``_ready()`` 回调之前初始化。
zh_tw: GDScript 中有兩個速寫法可以用來縮短程式碼。首先是在成員變數之前寫 ``onready`` 關鍵字，這樣這個變數就會剛好在 ``_ready()`` 回呼函式之前初始化。

source: There is also a short notation for ``get_node()``: the dollar sign, "$". You place it before the name or path of the node you want to get.
de: Es gibt auch eine Kurzschreibweise für ``get_node()``: das Dollarzeichen, "$". Man setzt es vor den Namen oder den Pfad des Nodes, den man erhalten möchte.
zh_cn: 还有一个快速写法就是 ``get_node()`` 的缩写：美元符号“$”，可以把它放在想要获取的名称或者节点路径之前。
zh_tw: 還有一個 ``get_node()`` 的速記法：美元符號“$”。可以把它放在想要獲取的名稱或者節點路徑之前。

source: Creating nodes
de: Nodes erstellen
zh_cn: 创建节点
zh_tw: 建立節點

source: To create a node from code, call its ``new()`` method like for any other class-based datatype.
de: Um einen Node im Code zu erstellen, rufen Sie die Methode ``new()`` auf, genau wie für jeden anderen klassenbasierten Datentyp auch.
zh_cn: 要通过代码创建节点，请像对象类型一样，调用其 ``new()`` 方法。
zh_tw: 與其他以類別為基礎的資料型別一樣，可以呼叫 ``.new()`` 方法來用程式碼建立節點。例如：

source: You can store the newly created node's reference in a variable and call ``add_child()`` to add it as a child of the node to which you attached the script.
de: Sie können die Referenz des neu erstellten Nodes in einer Variablen speichern und ``add_child()`` aufrufen, um ihn als Child des Nodes hinzuzufügen, an den Sie das Skript angehängt haben.
zh_cn: 你可以将新创建的节点的引用保存在一个变量中，然后调用 ``add_child()`` 方法，将其添加为脚本所在节点的子节点。
zh_tw: 你可以將新建立的節點的引用保存在一個變數中，然後呼叫 ``add_child()`` 將其新增為腳本所在節點的子項。

source: To delete a node and free it from memory, you can call its ``queue_free()`` method. Doing so queues the node for deletion at the end of the current frame after it has finished processing. At that point, the engine removes the node from the scene and frees the object in memory.
de: Um einen Node zu löschen und aus dem Speicher zu befreien, können Sie seine ``queue_free()``-Methode aufrufen. Dadurch wird der Node in eine Warteschlange gestellt, um am Ende des aktuellen Frames gelöscht zu werden, nachdem die Verarbeitung abgeschlossen ist. Zu diesem Zeitpunkt entfernt die Engine den Node aus der Szene und gibt das Objekt im Speicher frei.
zh_cn: 要删除节点、将其从内存中释放，可以调用其 ``queue_free()`` 方法。这样，该节点的删除操作就会被排进一个队列当中，在当前帧处理完成之后就会执行队列中的节点删除操作。删除时，引擎会把该节点从场景（树）中删除，然后释放内存中相应的对象。
zh_tw: 要刪除節點、將其從內容中釋放，你可以呼叫其 ``queue_free()`` 方法。這樣該節點的刪除工作就會被新增到佇列中，在目前影格完成處理後就會執行。刪除時，引擎會把該節點從場景中刪除，然後釋放物件記憶體中的物件。

source: Before calling ``sprite2d.queue_free()``, the remote scene tree looks like this.
de: Vor dem Aufruf von ``sprite2d.queue_free()`` sieht der Remote-Szenenbaum wie folgt aus.
zh_cn: 在调用 ``sprite2d.queue_free()`` 之前，远程场景树是这样的。
zh_tw: 在呼叫 ``sprite.queue_free()`` 之前，遠端場景樹是類似這樣的。

source: After the engine freed the node, the remote scene tree doesn't display the sprite anymore.
de: Nachdem die Engine den Node freigegeben hat, wird das Sprite im Remote-Szenenbaum nicht mehr angezeigt.
zh_cn: 在引擎释放节点后，远程场景树就不会再显示这个精灵节点了。
zh_tw: 在引擎釋放節點後，遠端場景樹就不會再現實這個精靈了。

source: You can alternatively call ``free()`` to immediately destroy the node. You should do this with care as any reference to it will instantly become ``null``. We recommend using ``queue_free()`` unless you know what you're doing.
de: Sie können alternativ ``free()`` aufrufen, um den Node sofort zu zerstören. Sie sollten dies mit Vorsicht tun, da jede Referenz auf diesen Node sofort ``null`` wird. Wir empfehlen, ``queue_free()`` zu benutzen, wenn Sie nicht wissen, was Sie tun.
zh_cn: 你也可以调用 ``free()`` 来立即删除该节点。调用时需要小心：所有对它的引用都会立即变成 ``null``\ ，除非你知道自己在干什么，否则建议使用 ``queue_free()``\ 。
zh_tw: 你也可以呼叫 ``free()`` 來立即刪除該節點。呼叫時需要小心，因為所有對它的引用都會立即變成 ``null``。除非你知道自己在幹什麼，否則我們建議使用 ``queue_free()``。

source: When you free a node, it also frees all its children. Thanks to this, to delete an entire branch of the scene tree, you only have to free the topmost parent node.
de: Wenn Sie einen Node freigeben, werden auch alle seine Child-Nodes freigegeben. Um einen ganzen Zweig des Szenenbaums zu löschen, müssen Sie also nur den obersten übergeordneten Node freigeben.
zh_cn: 释放节点时也会释放其所有子节点。得益于此，只需删除最顶端的父节点，就可以在场景树中删除该节点及其所有子孙节点了。
zh_tw: 釋放節點時也會釋放它的所有子項。多虧如此，只需刪除最頂端的父節點，就可以刪除整個場景樹分支了。

source: Instancing scenes
de: Instanziierung von Szenen
zh_cn: 实例化场景
zh_tw: 實體化場景

source: Scenes are templates from which you can create as many reproductions as you'd like. This operation is called instancing, and doing it from code happens in two steps:
de: Szenen sind Vorlagen, aus denen Sie beliebig viele Reproduktionen erstellen können. Dieser Vorgang wird Instanziierung genannt, und er erfolgt im Code in zwei Schritten:
zh_cn: 场景就是模板，你可以用场景来创建出任意数量的复制品，这种的操作就叫作实例化（instancing）。在代码中进行实例化总共分两步：
zh_tw: 場景就是範本，你可以用來來建立任意數量的複製品。這樣的操作叫作產生實體（instancing），在程式碼中進行產生實體總共分兩步：

source: Loading the scene from the local drive.
de: Laden der Szene vom lokalen Laufwerk.
zh_cn: 从本地硬盘中加载场景。
zh_tw: 在程式碼中載入資源

source: Creating an instance of the loaded :ref:`PackedScene <class_PackedScene>` resource.
de: Erstellen einer Instanz der geladenen Ressource :ref:`PackedScene <class_PackedScene>`.
zh_cn: 创建已加载好的 :ref:`PackedScene <class_PackedScene>` 资源的实例。
zh_tw: 要取得場景的實體，則必須使用 :ref:`PackedScene.instance() <class_PackedScene_method_instance>` 方法。

source: Preloading the scene can improve the user's experience as the load operation happens when the compiler reads the script and not at runtime. This feature is only available with GDScript.
de: Das Vorladen der Szene kann das Benutzererlebnis verbessern, da der Ladevorgang beim Lesen des Skripts durch den Compiler und nicht zur Laufzeit erfolgt. Diese Funktion ist nur mit GDScript verfügbar.
zh_cn: 预加载场景可以提升用户体验，因为加载操作是发生在编译器读取脚本的时候进行的，而非在游戏运行时进行，这个特性是 GDScript 所独有的。
zh_tw: 預載入場景可以提升使用者體驗，因為載入操作發生在編譯器讀取腳本時，而非運作時。這個功能是 GDScript 獨有的。

source: At that point, ``scene`` is a packed scene resource, not a node. To create the actual node, you need to call :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`. It returns a tree of nodes that you can use as a child of your current node.
de: Zu diesem Zeitpunkt ist ``scene`` eine gepackte Szenenressource, kein Node. Um den eigentlichen Node zu erzeugen, müssen Sie :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>` aufrufen. Sie gibt einen Baum von Nodes zurück, den du als Child deines aktuellen Nodes verwenden kannst.
zh_cn: 此时的 ``scene`` 是个打包场景资源，并非节点。要创建实际的节点，你还需要调用 :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`\ 来创建节点，该方法会返回该打包场景的节点树的根节点。你可以将其添加为当前节点的子节点。
zh_tw: 但 ``scene`` (場景) 還不是節點，目前還打包在一個叫做 :ref:`PackedScene <class_PackedScene>` (打包場景) 的特殊資源內。要真正建立節點，必須呼叫 :ref:`PackedScene.instance()` 函式。這個函式會回傳一個可以被新增到有效場景內的節點樹：

source: The advantage of this two-step process is you can keep a packed scene loaded and create new instances on the fly. For example, to quickly instance several enemies or bullets.
de: Der Vorteil dieses zweistufigen Prozesses besteht darin, dass Sie eine gepackte Szene geladen lassen und neue Instanzen im Handumdrehen erstellen können. Zum Beispiel, um schnell mehrere Feinde oder Kugeln zu instanziieren.
zh_cn: 这两步过程的优点在于：打包的场景可以保持加载状态，且可以随时使用。例如，你可以对大量敌人或子弹快速进行实例化。
zh_tw: 拆成「載入 - 實體化」兩個步驟的優點是，載入過打包場景後就可以維持已載入的狀態，隨時拿來使用。這樣一來我們就可以根據需要建立任意數量的實體。特別適用於需要在有效場景內快速實體化多個敵人、子彈或是其他實體的情況。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
