Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/overridable_functions.po
Languages: de, zh_cn

source: Overridable functions
de: Überschreibbare Funktionen
zh_cn: 可覆盖函数

source: Godot's Node class provides virtual functions you can override to update nodes every frame or on specific events, like when they enter the scene tree.
de: Die Node-Klasse von Godot bietet virtuelle Funktionen, die Sie überschreiben können, um Nodes in jedem Frame oder bei bestimmten Ereignissen zu aktualisieren, z.B. wenn sie den Szenenbaum betreten.
zh_cn: Godot 的 Node 类提供了一些虚函数，你可以通过覆盖这些虚函数来在每帧或发生特定事件时更新节点，比如节点进入场景树时就有一个虚函数会被调用。

source: This document presents the ones you'll use most often.
de: In diesem Dokument finden Sie die am häufigsten verwendeten.
zh_cn: 本文档中会向大家展示经常会用到的那些虚函数。

source: Under the hood, these functions rely on Godot's low-level notifications system. To learn more about it, see :ref:`doc_godot_notifications`.
de: Unter der Haube basieren diese Funktionen auf Godots Low-Level-Benachrichtigungssystem. Um mehr darüber zu erfahren, siehe :ref:`doc_godot_notifications`.
zh_cn: 这些函数在引擎内部会依赖 Godot 的底层通知系统而调用。要了解、学习相关知识，请参阅 :ref:`doc_godot_notifications`\ 。

source: Two functions allow you to initialize and get nodes besides the class's constructor: ``_enter_tree()`` and ``_ready()``.
de: Neben dem Konstruktor der Klasse gibt es zwei Funktionen, mit denen man Nodes initialisieren und darauf zugreifen kann: ``_enter_tree()`` und ``_ready()``.
zh_cn: 除了类的构造函数之外，还有两个函数可以用来进行初始化操作及获取节点操作：\ ``_enter_tree()`` 和 ``_ready()``\ 。

source: When the node enters the Scene Tree, it becomes active and the engine calls its ``_enter_tree()`` method. That node's children may not be part of the active scene yet. As you can remove and re-add nodes to the scene tree, this function may be called multiple times throughout a node's lifetime.
de: Wenn der Node in den Szenenbaum eintritt, wird er aktiv und die Engine ruft seine Methode ``_enter_tree()`` auf. Die Child-Nodes dieses Nodes dürfen noch nicht Teil der aktiven Szene sein. Da Sie Knoten aus dem Szenenbaum entfernen und wieder hinzufügen können, kann diese Funktion während der Lebensdauer eines Nodes mehrere Male aufgerufen werden.
zh_cn: 节点进入场景树时就会激活，引擎会调用其 ``_enter_tree()`` 方法，此时该节点的子节点可能还未激活，由于你可以从场景树中移除节点然后重新添加这个节点，因此在一个节点的生命周期内，这个函数可能会被调用多次。

source: Most of the time, you'll use ``_ready()`` instead. This function is called only once in a node's lifetime, after ``_enter_tree()``. ``_ready()`` ensures that all children have entered the scene tree first, so you can safely call ``get_node()`` on them.
de: Die meiste Zeit werden Sie stattdessen ``_ready()`` verwenden. Diese Funktion wird nur einmal während der Lebensdauer eines Nodes aufgerufen, nach ``_enter_tree()``. ``_ready()`` stellt sicher, daß alle Child-Nodes zuerst in den Szenenbaum eingetreten sind, so daß Sie ``get_node()`` sicher für sie aufrufen können.
zh_cn: 在大多数时候，你用的初始化函数其实都是 ``_ready()``\ 。这个函数只会在节点的生命周期中调用一次，且会在 ``_enter_tree()`` 执行完毕之后调用。\ ``_ready()`` 可以保证所有子节点都已进入场景树，因此在该节点内可以安全地调用 ``get_node()``\ 。

source: To learn more about getting node references, read :ref:`doc_nodes_and_scene_instances`.
de: Weitere Informationen darüber, wie man Node-Referenzen erhält, finden Sie unter :ref:`doc_nodes_and_scene_instances`.
zh_cn: 要学习更多有关节点引用的知识，请参阅 :ref:`doc_nodes_and_scene_instances`\ 。

source: Another related callback is ``_exit_tree()``, which the engine calls every time a node is about to exit the scene tree. This can be when you call :ref:`Node.remove_child() <class_Node_method_remove_child>` or when you free a node.
de: Ein weiterer verwandter Callback ist ``_exit_tree()``, den die Engine jedes Mal aufruft, wenn ein Node im Begriff ist, den Szenenbaum zu verlassen. Das kann sein, wenn Sie :ref:`Node.remove_child() <class_Node_method_remove_child>` aufrufen oder wenn Sie einen Node freigeben.
zh_cn: 另一个有关的回调函数便是 ``_exit_tree()``\ ，在节点退出场景树时，引擎便会调用该节点的该函数，调用时机既可以是你调用 :ref:`Node.remove_child() <class_Node_method_remove_child>` 的时时候，也可以是你释放这个节点的时候。

source: The two virtual methods ``_process()`` and ``_physics_process()`` allow you to update the node, every frame and every physics frame respectively. For more information, read the dedicated documentation: :ref:`doc_idle_and_physics_processing`.
de: Die beiden virtuellen Methoden ``_process()`` und ``_physics_process()`` erlauben es, den Node, jeden Frame bzw. jeden Physik-Frame zu aktualisieren. Für weitere Informationen lesen Sie bitte die entsprechende Dokumentation: :ref:`doc_idle_and_physics_processing`.
zh_cn: 虚函数 ``_process()`` 和 ``_physics_process()`` 可以分别用来对节点进行每帧更新和每物理帧更新。要了解更多信息，请阅读专门介绍空闲帧和物理帧的文档：\ :ref:`doc_idle_and_physics_processing`\ 。

source: Two more essential built-in node callback functions are :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` and :ref:`Node._input() <class_Node_private_method__input>`, which you use to both receive and process individual input events. The ``_unhandled_input()`` method receives every key press, mouse click, etc. that have not been handled already in an ``_input()`` callback or in a user interface component. You want to use it for gameplay input in general. The ``_input()`` callback allows you to intercept and process input events before ``_unhandled_input()`` gets them.
de: Zwei weitere wichtige Built-in-Node-Callback-Funktionen sind :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` und :ref:`Node._input() <class_Node_private_method__input>`, die Sie verwenden, um einzelne Eingabe-Events zu empfangen und zu verarbeiten. Die Methode ``_unhandled_input()`` empfängt jeden Tastendruck, Mausklick usw., der nicht bereits in einem ``_input()``-Callback oder in einer Komponente der Benutzeroberfläche behandelt wurde. Sie sollten diese Methode generell für Spieleingaben verwenden. Der ``_input()``-Callback erlaubt es Ihnen, Eingabe-Events abzufangen und zu verarbeiten, bevor ``_unhandled_input()`` sie erhält.
zh_cn: 还有两个关键的内置节点回调函数 :ref:`Node._input() <class_Node_method__input>` 和 :ref:`Node._unhandled_input() <class_Node_method__unhandled_input>`\ ，二者都可用来接收、处理单独的输入事件。如果按键、鼠标点击等事件没有被 ``_input()`` 回调函数或用户界面组件处理，那么\ ``_unhandled_input()`` 方法就会接收到该事件，游戏中的输入通常是使用后者进行处理的。\ ``_input()`` 回调函数可以用来在 ``_unhandled_input()`` 获取输入事件之前拦截并处理输入事件。

source: To learn more about inputs in Godot, see the :ref:`Input section <toc-learn-features-inputs>`.
de: Um mehr über Eingaben in Godot zu erfahren, lesen Sie bitte den :ref:`Abschnitt über Eingaben <toc-learn-features-inputs>`.
zh_cn: 要学习更多关于 Godot 中输入的内容，请参阅\ :ref:`输入章节 <toc-learn-features-inputs>`\ 。

source: There are some more overridable functions like :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. Specialized node types provide more callbacks like :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` to draw programmatically or :ref:`Control._gui_input() <class_Control_private_method__gui_input>` to handle clicks and input on UI elements.
de: Es gibt einige weitere überschreibbare Funktionen wie :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. Spezialisierte Node-Typen bieten mehr Callbacks, wie :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` um programmatisch zu zeichnen oder :ref:`Control._gui_input() <class_Control_private_method__gui_input>` um Klicks und Eingaben auf UI-Elementen zu behandeln.
zh_cn: 还有 :ref:`Node._get_configuration_warning() <class_Node_method__get_configuration_warning>` 等更多的可覆盖函数。特定的节点类型也会提供很多的回调函数，比如 :ref:`CanvasItem._draw() <class_CanvasItem_method__draw>` 可以用来用程序绘图，\ :ref:`Control._gui_input() <class_Control_method__gui_input>` 可以用来处理 UI 元素上的点击和输入事件，等等。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
