Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/pausing_games.po
Languages: de, zh_tw

source: Pausing games and process mode
de: Pausieren von Spielen und Prozessierungsmodus
zh_tw: 將更改推送 (Push) 到遠端

source: Introduction
de: Einführung
zh_tw: 前言

source: In most games it is desirable to, at some point, interrupt the game to do something else, such as taking a break or changing options. Implementing a fine-grained control for what can be paused (and what cannot) is a lot of work, so a simple framework for pausing is provided in Godot.
de: In den meisten Spielen ist es wünschenswert, das Spiel irgendwann zu unterbrechen, um etwas anderes zu tun, z.B. eine Pause zu machen oder die Optionen zu ändern. Die Implementierung einer feinkörnigen Steuerung für das, was pausiert werden kann (und was nicht), ist eine Menge Arbeit, so dass in Godot ein einfacher Rahmen für die Pausierung vorgesehen ist.
zh_tw: 在大多數遊戲中，或多或少都會希望能夠中斷遊戲去幹些別的，例如休息一下或者修改選項。要非常細緻地控制哪些可以暫停（哪些不可以）實作起來非常麻煩，所以 Godot 提供了一個簡單的暫停框架。

source: How pausing works
de: Wie das Pausieren funktioniert
zh_tw: 如何暫停工作

source: To pause the game the pause state must be set. This is done by assigning ``true`` to the :ref:`SceneTree.paused <class_SceneTree_property_paused>` property:
de: Um das Spiel zu pausieren, muss der Pausenstatus gesetzt werden. Dies geschieht durch Zuweisung von ``true`` an die Property :ref:`SceneTree.paused <class_SceneTree_property_paused>`:
zh_tw: 要將遊戲暫停，就必須設定暫停狀態。將 :ref:`SceneTree.paused <class_SceneTree_property_paused>` 屬性賦值為 ``true`` 即可：

source: Doing this will cause two things. First, 2D and 3D physics will be stopped for all nodes. Second, the behavior of certain nodes will stop or start depending on their process mode.
de: Dadurch werden zwei Dinge bewirkt. Erstens wird die 2D- und 3D-Physik für alle Nodes gestoppt. Zweitens wird das Verhalten bestimmter Nodes abhängig von ihrem Prozessierungsmodus angehalten oder gestartet.
zh_tw: 這樣做會導致兩件事。首先，所有節點的 2D 和 3D 物理都會停止。其次，根據處理模式的不同，某些節點的行為會停止或者開始。

source: The physics servers can be made active while the game is paused by using their ``set_active`` methods.
de: Die Physikserver können mit Hilfe ihrer ``set_active``-Methoden aktiv gemacht werden, während das Spiel pausiert ist.
zh_tw: 遊戲暫停時，可以通過 ``set_active`` 方法啟動物理伺服器。

source: Process Modes
de: Prozessierungsmodi
zh_tw: 處理

source: Each node in Godot has a "Process Mode" that defines when it processes. It can be found and changed under a node's :ref:`Node <class_Node>` properties in the inspector.
de: Jeder Node in Godot hat einen "Prozessierungsmodus", der definiert, wann er verarbeitet wird. Er kann unter den :ref:`Node <class_Node>`-Propertys eines Nodes im Inspektor gefunden und geändert werden.
zh_tw: Godot 中的節點都有“Pause Mode”（暫停模式）定義它們應該在何時進行處理。可以在屬性面板中 :ref:`Node <class_Node>` 的屬性裡找到並修改。

source: You can also alter the property with code:
de: Sie können die Property auch mit Code ändern:
zh_tw: 你也可以通過程式碼來修改該屬性：

source: This is what each mode tells a node to do:
de: Jeder Modus weist einen Node an, Folgendes zu tun:
zh_tw: 各個模式對節點的要求是這樣的：

source: **Inherit**: Process depending on the state of the parent, grandparent, etc. The first parent that has a non-Inherit state.
de: **Erben**: Prozessieren je nach Status des Parent, sowie dessen Parent usw. Der erste Parent, der einen Nicht-Vererbungsstatus hat.
zh_tw: **Inherit（繼承）** ：處理與否取決於父、祖父等等節點中第一個具有非 Inherit 狀態的節點。

source: **Pausable**: Process the node (and its children in Inherit mode) only when the game is not paused.
de: **Pausierbar**: Prozessierung des Nodes (und seiner Child-Nodes im Modus "Erben") nur, wenn das Spiel nicht pausiert ist.
zh_tw: **可暫停**：僅在遊戲未暫停時處理節點（及其繼承模式下的子節點）。

source: **WhenPaused**: Process the node (and its children in Inherit mode) *only* when the game is paused.
de: **Wenn Pausiert**: Prozessiert den Node (und seine Child-Nodes im Erben-Modus) *nur*, wenn das Spiel pausiert ist.
zh_tw: **WhenPaused**：*僅*當遊戲暫停時處理節點（及其處於繼承模式的子節點）。

source: **Always**: Process the node (and its children in Inherit mode) no matter what. Paused or not, this node will process.
de: **Immer**: Prozessiert den Node (und seine Child-Nodes im Modus "Erben") in jedem Fall. Ob pausiert oder nicht, dieser Node wird verarbeitet.
zh_tw: **Process（處理）** ：無條件處理節點（以及 Inherit 模式的子節點）。無論暫停與否，該節點都會進行處理。

source: **Disabled**: The node (and its children in Inherit mode) will not process at all.
de: **Deaktiviert**: Der Node (und seine Child-Nodes im Modus "Vererben") wird überhaupt nicht prozessiert.
zh_tw: **禁用**：節點（及其繼承模式下的子節點）根本不會處理。

source: By default, all nodes have this property in the "Inherit" state. If the parent is set to "Inherit", then the grandparent will be checked and so on. If a state can't be found in any of the grandparents, the pause state in SceneTree is used. This means that, by default, when the game is paused every node will be paused. Several things happen when a node stops processing.
de: Standardmäßig haben alle Nodes diese Property auf den Status "Erben" gesetzt. Wenn der Parent auf "Erben" gesetzt ist, wird dessen Parent überprüft und so weiter. Wenn ein Zustand in keinem übergeordneten Nodes gefunden werden kann, wird der Pausenzustand im SceneTree verwendet. Das bedeutet, dass standardmäßig alle Nodes angehalten werden, wenn das Spiel pausiert wird. Wenn ein Node die Verarbeitung anhält, passieren mehrere Dinge.
zh_tw: 預設情況下，所有節點的這個屬性都是“Inherit”狀態。如果父節點也是“Inherit”，那麼就會去檢查祖父節點，以此類推。如果祖宗們都沒有更改過狀態，那麼就會使用 SceneTree 的暫停狀態。也就是說，在遊戲暫停時預設所有節點都會被暫停下來。節點停止處理時會發生不少事情。

source: The ``_process``, ``_physics_process``, ``_input``, and ``_input_event`` functions will not be called. However signals still work and cause their connected function to run, even if that function's script is attached to a node that is not currently being processed.
de: Die Funktionen ``_process``, ``_physics_process``, ``_input``, und ``_input_event`` werden nicht aufgerufen. Signale funktionieren jedoch weiterhin und bewirken, dass die mit ihnen verbundene Funktion ausgeführt wird, selbst wenn das Skript dieser Funktion an einen Node angehängt ist, der gerade nicht verarbeitet wird.
zh_tw: ``_process``、``_physics_process``、``_input``、``_input_event`` 函式都不會再被呼叫。不過訊號仍然是正常工作的，因此它們連接的函式也會執行，即便該函式的腳本是附加在暫停模式為“Stop”的節點上的。

source: Animation nodes will pause their current animation, audio nodes will pause their current audio stream, and particles will pause. These resume automatically when the game is no longer paused.
de: Animations-Nodes halten ihre aktuelle Animation an, Audio-Nodes halten ihren aktuellen Audio-Stream an, und Partikel halten an. Sie werden automatisch fortgesetzt, wenn das Spiel nicht mehr pausiert ist.
zh_tw: 動畫節點會暫停它們的目前動畫，音訊節點會暫停它們的目前音訊流，粒子也會暫停。遊戲不再暫停時，它們都會自動繼續運作。

source: It is important to note that even if a node is processing while the game is paused physics will **NOT** work for it by default. As stated earlier this is because the physics servers are turned off. The physics servers can be made active while the game is paused by using their ``set_active`` methods.
de: Es ist wichtig zu beachten, dass selbst wenn ein Node verarbeitet wird, während das Spiel pausiert ist, die Physik standardmäßig **NICHT** für ihn funktioniert. Wie bereits erwähnt, liegt das daran, dass die Physikserver ausgeschaltet sind. Die Physikserver können auf aktiv gesetzt werden, während das Spiel pausiert ist, indem man ihre ``set_active``-Methoden benutzt.
zh_tw: 請注意有一點非常重要，即便遊戲暫停時節點仍在進行處理，但物理預設是**無法**正常工作的。如前文所述，這是因為物理伺服器會被關閉。遊戲暫停時，可以通過 ``set_active`` 方法啟動物理伺服器。

source: Pause menu example
de: Beispiel für ein Pausenmenü

source: Start by creating a button that will be used to pause the game.
de: Beginnen Sie damit, einen Button zu erstellen, mit dem das Spiel angehalten werden kann.

source: Create a menu containing a close button, set the **Process Mode** of the menu's root node to **When Paused**, then hide the menu. Since the process mode is set to **When Paused** on the root node, all its children and grandchildren will inherit that process mode. This way, all the nodes in the menu will start processing when the game is paused.
de: Erstellen Sie ein Menü mit einem Schließen-Button, setzen Sie den **Prozessierungsmodus** des Root-Nodes des Menüs auf **Wenn Pausiert** und blenden Sie dann das Menü aus. Da der Prozessierungsmodus für den Root-Node auf **Wenn Pausiert** gesetzt ist, erben alle seine Child-Nodes und deren Child-Nodes diesen Prozessierungsmodus. Auf diese Weise beginnen alle Nodes des Menüs mit der Prozessierung, wenn das Spiel pausiert wird.

source: Attach a script to the menu's root node, connect the pause button created earlier to a new method in the script, and inside that method pause the game and show the pause menu.
de: Hängen Sie ein Skript an den Root-Node des Menüs an, verbinden Sie den zuvor erstellten Pause-Button mit einer neuen Methode im Skript und halten Sie innerhalb dieser Methode das Spiel an und zeigen Sie das Pausenmenü an.

source: Finally, connect the menu's close button to a new method in the script. Inside that method, unpause the game and hide the pause menu.
de: Verbinden Sie schließlich den Schließen-Button des Menüs mit einer neuen Methode im Skript. In dieser Methode heben Sie die Spielpause auf und blenden das Pausenmenü aus.

source: You should now have a working pause menu.
de: Sie sollten nun ein funktionierendes Pausenmenü haben.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
