Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/scene_tree.po
Languages: de, ja, zh_cn

source: Using SceneTree
de: Verwendung von ScreneTree
ja: シーンツリーの使用
zh_cn: 使用 SceneTree

source: Introduction
de: Einführung
ja: はじめに
zh_cn: 前言

source: In previous tutorials, everything revolved around the concept of nodes. Scenes are collections of nodes. They become active once they enter the *scene tree*.
de: In der vorangegangen Anleitung drehte sich alles um das Konzept der Nodes. Szenen sind Sammlungen von Nodes. Sie werden aktiv sobald sie in den *Szenenbaum* eingefügt werden.
ja: これまでのチュートリアルは、すべてがノードの概念を中心に展開していました。シーンはノードのコレクションです。それら *シーンツリー* に入るとアクティブになります。
zh_cn: 在之前的教程中，所有内容都是围绕节点这一概念展开的。场景是节点的合集，节点一进入 *场景树* 就会被激活。

source: The way Godot works internally is as follows. There is the :ref:`OS <class_OS>` class, which is the only instance that runs at the beginning. Afterwards, all drivers, servers, scripting languages, scene system, etc are loaded.
de: Die interne Funktionsweise von Godot ist wie folgt. Es gibt die Klasse :ref:`OS <class_OS>`, die einzige Instanz, die am Anfang läuft. Danach werden alle Treiber, Server, Skriptsprachen, das Szenensystem usw. geladen.
ja: Godotの内部的な働きは次のとおりです。\ :ref:`OS <class_OS>`\ クラスがあります。これは最初に実行される唯一のインスタンスです。その後、すべてのドライバ、サーバ、スクリプト言語、シーンシステムなどがロードされます。
zh_cn: Godot 内部的工作方式是这样的：开始的时候只会有一个 :ref:`OS <class_OS>` 类的实例在运行，然后才会把驱动程序、服务器、脚本语言、场景系统等等这些加载进来。

source: When initialization is complete, :ref:`OS <class_OS>` needs to be supplied a :ref:`MainLoop <class_MainLoop>` to run. Up to this point, all this is internals working (you can check main/main.cpp file in the source code if you are ever interested to see how this works internally).
de: Sobald die Initialisierung abgeschlossen ist, wird :ref:`OS<class_OS>` eine :ref:`MainLoop<class_MainLoop>` übergeben, um ausgeführt zu werden. Bis zu diesem Punkt ist alles ein interner Ablauf (siehe main/main.cpp im Quellcode, falls Interesse besteht, die Internen Abläufe nachzuvollziehen).
ja: 初期化が完了したら、実行するために\ :ref:`OS <class_OS>`\ にメインループを提供する必要があります。これまでのところはすべて内部の作業です(これが内部でどのように機能するかを知りたい場合は、ソースコードのmain/main.cppファイルを確認できます)。
zh_cn: 初始化完成后，就会为 :ref:`OS <class_OS>` 提供一个 :ref:`MainLoop <class_MainLoop>` 来运行。目前为止的所有内容都是内部工作（如果你有兴趣查看内部如何工作，可以在源代码中查看 main/main.cpp 文件）。

source: The user program, or game, starts in the MainLoop. This class has a few methods, for initialization, idle (frame-synchronized callback), fixed (physics-synchronized callback), and input. Again, this is low level and when making games in Godot, writing your own MainLoop seldom makes sense.
de: Die Nutzer-Anwendung, oder das Spiel, startet in der MainLoop. Diese Klasse definiert einige Methoden für die Initialisierung, Leerlauf (Frame-synchrones Callback), Fixed (Physik-synchrones Callback) und Eingabe. Auch hier handelt es sich um eine Low-Level-Funktionen, und bei der Entwicklung von Spielen in Godot ist es selten sinnvoll, eine eigene MainLoop zu schreiben.
ja: ユーザー プログラムまたはゲームは、MainLoopで起動します。このクラスには、初期化、アイドル (フレーム同期コールバック)、固定 (物理同期コールバック)、および入力のためのいくつかのメソッドがあります。繰り返しますが、これは低レベルの処理であり、Godotでゲームを作るときに、独自にMainLoopを書くことはめったに意味がありません。
zh_cn: 用户程序或游戏会在 MainLoop 中启动，这个类包含初始化、空闲（帧同步回调）、固定（物理同步回调）、输入等方法。当然这也属于底层，用 Godot 制作游戏时几乎不会遇到需要自行编写 MainLoop 的情况。

source: One of the ways to explain how Godot works is that it's a high level game engine over a low level middleware.
de: Eine Möglichkeit, die Funktionsweise von Godot zu erklären, besteht darin, dass es sich um eine High-Level-Spielengine über einer Low-Level-Middleware handelt.
ja: Godotの仕組みを説明する方法の1つは、Godotが低レベルのミドルウェアよりも高レベルなゲームエンジンであることです。
zh_cn: 解释Godot的工作方式的一种方法是, 它是基于低级中间件的高级游戏引擎.

source: The scene system is the game engine, while the :ref:`OS <class_OS>` and servers are the low level API.
de: Das Szenensystem ist die Game Engine, wohingegen das :ref:`OS <class_OS>` und die Server zur Low Level-API gehören.
ja: シーンシステムはゲームエンジンで、\ :ref:`OS <class_OS>`\ とサーバーは低レベルのAPIです。
zh_cn: 场景系统是游戏引擎, 而 :ref:`OS <class_OS>` 和服务是底层API.

source: The scene system provides its own main loop to OS, :ref:`SceneTree <class_SceneTree>`. This is automatically instanced and set when running a scene, no need to do any extra work.
de: Das Szenensystem liefert seine eigene Hauptschleife zum OS, :ref:`SceneTree <class_SceneTree>`. Dieser wird automatisch instanziiert und gesetzt, wenn eine Szene ausgeführt wird, ohne dass Sie zusätzlich etwas tun müssen.
ja: シーンシステムは、OSに独自のメインループ\ :ref:`SceneTree <class_SceneTree>`\ を提供します。これは自動的にインスタンス化され、シーンの実行時に設定されるので、余分な作業を行う必要はありません。
zh_cn: 场景系统为OS提供了自己的主循环, 即 :ref:`SceneTree <class_SceneTree>`. 运行场景时会自动实例化并设置该场景, 无需执行任何其他工作.

source: It's important to know that this class exists because it has a few important uses:
de: Es ist wichtig zu wissen, dass es diese Klasse gibt, weil sie einige wichtige Verwendungszwecke hat:
ja: このクラスにはいくつかの重要な用途があるため、このクラスが存在することを知っておくことが重要です:
zh_cn: 重要的是要知道此类的存在, 因为它有一些重要的用途:

source: It contains the root :ref:`Viewport <class_Viewport>`, to which a scene is added as a child when it's first opened to become part of the *Scene Tree* (more on that next).
de: Sie beinhaltet den Root-:ref:`Viewport<class_Viewport>`, zu welcher eine Szene als Child-Element hinzugefügt wird, welches beim ersten Öffnen Teil des Szenen-Baums (*Scene Tree*) wird.
ja: ルート\ :ref:`Viewport <class_Viewport>`\ が含まれており、最初に開かれたときに、 *シーン ツリー* の一部になるためにシーンが子として追加されます(詳細は次のページを参照)。
zh_cn: 它包含根 :ref:`Viewport <class_Viewport>`, 当场景第一次打开成为 *Scene Tree* 的一部分时, 会将场景作为子级添加到其中(接下来会有更多).

source: It contains information about the groups and has the means to call all nodes in a group or get a list of them.
de: Sie enthält Informationen zu Gruppen und hat Möglichkeiten, Node-Methoden einer Gruppe aufzurufen oder eine Liste dieser zu liefern.
ja: それにはグループに関する情報が含まれており、グループ内のすべてのノードを呼び出すか、それらのリストを取得する手段があります。
zh_cn: 它包含有关编组的信息, 并具有调用编组中所有节点或获取它们的列表的方法.

source: It contains some global state functionality, such as setting pause mode or quitting the process.
de: Sie beinhaltet einige Funktionalität zum Globalen Zustand, wie dem Pausieren oder Beenden des Prozesses.
ja: これには、一時停止モードの設定やプロセスの終了など、いくつかのグローバル状態に関する機能が含まれています。
zh_cn: 它包含一些全局状态功能, 例如设置暂停模式或退出进程.

source: When a node is part of the Scene Tree, the :ref:`SceneTree <class_SceneTree>` singleton can be obtained by calling :ref:`Node.get_tree() <class_Node_method_get_tree>`.
de: Wenn ein Node Teil des Szenen-Baums ist, kann auf den :ref:`Szenen-Baum<class_SceneTree>` als Singleton über :ref:`Node.get_tree() <class_Node_method_get_tree>` zugegriffen werden.
ja: ノードがシーンツリーの一部である場合、 :ref:`Node.get_tree() <class_Node_method_get_tree>` を呼び出すことで :ref:`SceneTree <class_SceneTree>` シングルトンを取得できます。
zh_cn: 当节点是场景树的一部分时, 可以通过调用 :ref:`Node.get_tree() <class_Node_method_get_tree>` 获得 :ref:`SceneTree <class_SceneTree>` 单例.

source: The root :ref:`Viewport <class_Viewport>` is always at the top of the scene. From a node, it can be obtained in two different ways:
de: Der Root-Viewport (:ref:`Viewport <class_Viewport>`) befindet sich immer am oberen Ende der Szene. Durch einen Node kann mittels zwei verschiedener Wege auf ihn zugegriffen werden:
ja: ルート\ :ref:`Viewport <class_Viewport>`\ は常にシーンの一番上にあります。ノードからは、次の2つの方法で取得できます:
zh_cn: 根 :ref:`Viewport <class_Viewport>` 始终位于场景的顶部. 从一个节点, 可以通过两种不同的方式获得它:

source: This node contains the main viewport. Anything that is a child of a :ref:`Viewport <class_Viewport>` is drawn inside of it by default, so it makes sense that the top of all nodes is always a node of this type otherwise nothing would be seen.
de: Dieser Node enthält den Haupt-Viewport. Alles, was ein Child-Element eines :ref:`Viewports<class_Viewport>` ist, wird standardmäßig darin gezeichnet, daher ist es sinnvoll, dass der oberste aller Nodes immer ein Node dieses Typs ist, sonst würde man nichts sehen.
ja: このノードにはメインビューポートが含まれます。 :ref:`Viewport <class_Viewport>` の子であるものはすべてデフォルトでその内部に描画されるため、すべてのノードの最上位は常にこのタイプのノードであり、そうでない場合は何も表示されません。
zh_cn: 此节点包含主视口, 默认情况下, :ref:`Viewport <class_Viewport>` 的任何子节点都将绘制在其中, 因此以Viewport作为根节点是有意义的, 否则将看不到任何内容.

source: While other viewports can be created in the scene (for split-screen effects and such), this one is the only one that is never created by the user. It's created automatically inside SceneTree.
de: Während andere Viewports in der Szene erstellt werden können (für Split-Screen-Effekte und dergleichen), ist dies das einzige, das nie vom Benutzer erstellt wird. Er wird automatisch im SceneTree erstellt.
ja: 他のビューポートをシーンに作成することができますが(画面分割効果など)、これがユーザーによって作成されることのない唯一のビューポートです。 SceneTree内に自動的に作成されます。
zh_cn: 尽管可以在场景中创建其他视图(用于分屏效果等), 但该视图是唯一不由用户创建的视图. 它是在 ``SceneTree`` 内部自动创建的.

source: Scene tree
de: Szenenbaum
ja: シーンツリー
zh_cn: 场景树

source: When a node is connected, directly or indirectly, to the root viewport, it becomes part of the *scene tree*.
de: Wenn ein Node direkt oder indirekt mit dem Root-Viewport verbunden ist, wird er Teil des *Szenenbaums*.
ja: ノードがルートビューポートに直接または間接的に接続されると、 *シーンツリー* の一部になります。
zh_cn: 当节点直接或间接连接到根视图时，它就成为了\ *场景树*\ 的一部分。

source: This means that as explained in previous tutorials, it will get the ``_enter_tree()`` and ``_ready()`` callbacks (as well as ``_exit_tree()``).
de: Das bedeutet, dass es, wie in früheren Tutorials erklärt, die ``_enter_tree()`` und ``_ready()`` Callbacks (sowie ``_exit_tree()``) erhält.
ja: つまり、前のチュートリアルで説明したように、 ``_enter_tree()`` と ``_ready()`` (または ``_exit_tree()`` ) の コールバック が取得されます。
zh_cn: 因此，正如在之前的教程中所解释的，它将获得 ``_enter_tree()`` 和 ``_ready()`` 回调（以及 ``_exit_tree()`` ）。

source: When nodes enter the *Scene Tree*, they become active. They get access to everything they need to process, get input, display 2D and 3D visuals, receive and send notifications, play sounds, etc. When they are removed from the *scene tree*, they lose these abilities.
de: Sobald Nodes den *Szenenbaum* betreten, werden sie aktiv. Sie erhalten Zugang zu allem, was sie verarbeiten müssen, erhalten Eingaben, zeigen 2D- und 3D-Grafiken, erhalten und senden Benachrichtigungen, spielen Töne ab, etc. Doch sobald sie vom *Szenenbaum* entfernt werden, verlieren sie jene Fähigkeiten.
ja: ノードは *シーン ツリー* に入ると、アクティブになります。処理、入力、2Dおよび3Dビジュアルの表示、通知の送受信、サウンドの再生などに必要なすべてのものにアクセスできます。 *シーンツリー* から削除されると、これらの機能を失います。
zh_cn: 当节点进入\ *场景树*\ 时，它们将变为活动状态。它们可以访问需要处理的所有内容、获取输入、显示 2D 和 3D 视觉效果、收发通知、播放声音等。当从\ *场景树*\ 中删除时，它们将失去这些能力。

source: Tree order
de: Baum-Reihenfolge
ja: ツリーの順序
zh_cn: 树顺序

source: Most node operations in Godot, such as drawing 2D, processing, or getting notifications are done in *tree order*, or top to bottom as seen in the editor (also known as pre-order traversal):
de: Die meisten Node-Operationen in Godot, wie z.B. das Zeichnen von 2D, die Verarbeitung oder das Abrufen von Benachrichtigungen, erfolgen in *Baumreihenfolge*, d.h. von oben nach unten, wie im Editor zu sehen (auch bekannt als Pre-Order-Traversal):

source: For example, the top node in a scene has its ``_process()`` function called first, then the node below it has its ``_process()`` function called, then the node below that and so on.
de: So wird z.B. beim obersten Node in einer Szene zuerst die Funktion ``_process()`` aufgerufen, dann beim darunterliegenden Node Funktion ``_process()``, dann beim darunterliegenden Node und so weiter.

source: An important exception is the ``_ready()`` function: each parent node has its ``_ready()`` function called only after all its child nodes have their ``_ready()`` functions called, so that the parent knows its children are completely ready to be accessed. This is also known as post-order traversal. In the above image, ``NameLabel`` would be notified first (but only after its children, if it had any!), followed by ``Name``, etc., and ``Panel`` would be notified last.
de: Eine wichtige Ausnahme ist die Funktion ``_ready()``: bei jedem Parent-Node wird die Funktion ``_ready()`` erst dann aufgerufen, wenn bei allen Child-Nodes die Funktion ``_ready()`` aufgerufen wurde, so dass der Parent-Node weiß, dass seine Child-Nodes vollständig zum Zugriff bereit sind. Dies ist auch als Post-Order-Traversal bekannt. In der obigen Abbildung würde ``NameLabel`` zuerst benachrichtigt werden (aber erst nach seinen Child-Nodes, falls er welche hat!), gefolgt von ``Name``, usw., und ``Panel`` würde zuletzt benachrichtigt werden.

source: The order of operations can also be overridden using the ``process_priority`` node property. Nodes with a lower number are called first. For example, nodes with the priorities "0, 1, 2, 3" would be called in that order from left to right.
de: Die Reihenfolge der Operationen kann auch durch die Node-Property ``process_priority`` außer Kraft gesetzt werden. Nodes mit einer niedrigeren Nummer werden zuerst aufgerufen. Zum Beispiel würden Nodes mit den Prioritäten "0, 1, 2, 3" in dieser Reihenfolge von links nach rechts aufgerufen werden.

source: "Becoming active" by entering the *Scene Tree*
de: "Aktiv werden" durch das Betreten des *Szenenbaums*
ja: *シーンツリー* に入って「アクティブになる」
zh_cn: 通过进入\ *场景树*\ “变为活动状态”

source: A scene is loaded from disk or created by scripting.
de: Eine Szene wird von der Festplatte geladen oder per Skript erzeugt.
ja: シーンはディスクから読み込まれるか、スクリプトによって作成されます。
zh_cn: 从磁盘加载场景或通过脚本创建场景。

source: The root node of that scene (only one root, remember?) is added as either a child of the "root" Viewport (from SceneTree), or to any of its descendants.
de: Der Root-Node dieser Szene (es gibt nur einen Root-Node, erinnern Sie sich?) wird entweder als Child des "Root"-Viewports (von SceneTree) oder zu einem seiner untergeordnetn Nodes hinzugefügt.

source: Every node of the newly added scene will receive the "enter_tree" notification ( ``_enter_tree()`` callback in GDScript) in top-to-bottom order (pre-order traversal).
de: Jeder Node der neu hinzugefügten Szene erhält die "enter_tree"-Benachrichtigung ( ``_enter_tree()``-Callback in GDScript) in der Reihenfolge von oben nach unten (Pre-Order Traversal).
zh_cn: 新添加的场景的每个节点都将按照从上到下的顺序接收 ``enter_tree`` 通知（GDScript 中的 ``_enter_tree()`` 回调函数）。

source: Every node will receive the "ready" notification ( ``_ready()`` callback in GDScript) for convenience, once all its children have received the "ready" notification (post-order traversal).
de: Jeder Node erhält der Einfachheit halber die "ready"-Benachrichtigung ( ``_ready()`` Callback in GDScript), sobald alle seine Child-Nodes die "ready"-Benachrichtigung erhalten haben (Post-Order Traversal).

source: When a scene (or part of it) is removed, they receive the "exit scene" notification ( ``_exit_tree()`` callback in GDScript) in bottom-to-top order (the exact reverse of top-to-bottom order).
de: Wenn eine Szene (oder ein Teil davon) entfernt wird, erhalten sie die "exit scene"-Benachrichtigung ( ``_exit_tree()``-Callback in GDScript) in der Reihenfolge von unten nach oben (die genaue Umkehrung der Reihenfolge von oben nach unten).
zh_cn: 删除场景（或场景的一部分）后，它们将按照自底向上的顺序（自顶向下的逆序）收到 ``exit scene`` 通知（GDScript中的 ``_exit_tree()`` 回调函数）。

source: Changing current scene
de: Änderung der aktuellen Szene
ja: 現在のシーンの変更
zh_cn: 更改当前场景

source: After a scene is loaded, you may want to change this scene for another one. One way to do this is to use the :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` function:
de: Nachdem eine Szene geladen wurde, möchten Sie vielleicht diese Szene durch eine andere ersetzen. Eine Möglichkeit, dies zu tun, ist die Verwendung der Funktion :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>`:

source: Rather than using file paths, one can also use ready-made :ref:`PackedScene <class_PackedScene>` resources using the equivalent function :ref:`SceneTree.change_scene_to_packed(PackedScene scene) <class_SceneTree_method_change_scene_to_packed>`:
de: Anstatt Dateipfade zu verwenden, kann man auch fertige :ref:`PackedScene <class_PackedScene>`-Ressourcen mit der entsprechenden Funktion :ref:`SceneTree.change_scene_to_packed(PackedScene scene) <class_SceneTree_method_change_scene_to_packed>` verwenden:

source: These are quick and useful ways to switch scenes but have the drawback that the game will stall until the new scene is loaded and running. At some point in the development of your game, it may be preferable to create proper loading screens with progress bar, animated indicators or threaded (background) loading. This must be done manually using :ref:`doc_singletons_autoload` and :ref:`doc_background_loading`.
de: Dies sind schnelle und nützliche Wege, um die Szene zu wechseln, haben aber den Nachteil, dass das Spiel stehen bleibt, bis die neue Szene geladen ist und läuft. An einem bestimmten Punkt in der Entwicklung Ihres Spiels kann es besser sein, richtige Ladebildschirme mit Fortschrittsbalken, animierte Indikatoren oder Hintergrundladen mit Threading zu erstellen. Dies muss manuell mit :ref:`doc_singletons_autoload` und :ref:`doc_background_loading` gemacht werden.

source: Translation status
de: Übersetzungsstatus
ja: 翻訳ステータス
zh_cn: 翻译状态

source: MainLoop
ja: メインループ

source: SceneTree
ja: シーンツリー

source: Root viewport
ja: ルートビューポート
zh_cn: 根视图
