Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/scene_unique_nodes.po
Languages: de, zh_tw

source: Scene Unique Nodes
de: Szenen-Eindeutige Nodes
zh_tw: Scene Node 場景節點

source: Introduction
de: Einführung
zh_tw: 前言

source: Using ``get_node()`` to reference nodes from a script can sometimes be fragile. If you move a button in a UI scene from one panel to another, the button's node path changes, and if a script uses ``get_node()`` with a hard-coded node path, the script will not be able to find the button anymore.
de: Die Verwendung von ``get_node()``, um Nodes aus einem Skript zu referenzieren, kann manchmal fragil sein. Wenn Sie einen Button in einer UI-Szene von einem Panel zu einem anderen verschieben, ändert sich der Node-Pfad des Buttons, und wenn ein Skript ``get_node()`` mit einem fest kodierten Node-Pfad verwendet, wird das Skript den Button nicht mehr finden können.
zh_tw: 使用“get_node()”從腳本引用節點有時可能很脆弱。如果將 UI 場景中的按鈕從一個面板移動到另一個面板，按鈕的節點路徑會發生變化，並且如果腳本使用具有硬編碼節點路徑的“get_node()”，則腳本將無法找到按鈕不再。

source: In situations like this, the node can be turned into a scene unique node to avoid having to update the script every time the node's path is changed.
de: In solchen Situationen kann der Node in einen Szenen-Eindeutigen Node umgewandelt werden, damit das Skript nicht jedes Mal aktualisiert werden muss, wenn der Pfad des Nodes geändert wird.
zh_tw: 在類似這樣的情況下，可以將節點設為場景唯一節點，這樣修改路徑後就不必去修改腳本了。

source: Creation and usage
de: Erstellung und Verwendung
zh_tw: 建立內容

source: In the Scene tree dock, right-click on a node and select **Access as Unique Name** in the context menu.
de: Klicken Sie im Szenenbaum-Dock mit der rechten Maustaste auf einen Node und wählen Sie im Kontextmenü **Zugriff als Eindeutiger Name**.
zh_tw: 在場景樹面板中，按右鍵節點並在本文功能表中選擇**作為場景唯一名稱存取**。

source: After selecting the option, the node will now have a percent symbol (**%**) next to its name in the scene tree:
de: Nach der Auswahl der Option wird der Node im Szenenbaum mit einem Prozent-Symbol (**%**) neben seinem Namen versehen:
zh_tw: 勾選後，該節點在場景樹中會在名稱旁邊顯示一個百分號（**%**）：

source: You can now use the node in your script. For example, you can reference it with a ``get_node()`` method call by typing the % symbol, followed by the node's name:
de: Sie können den Node nun in Ihrem Skript verwenden. Sie können ihn zum Beispiel mit einem ``get_node()`` Methodenaufruf referenzieren, indem Sie das %-Symbol eingeben, gefolgt vom Namen des Nodes:
zh_tw: 現在您可以在腳本中使用該節點。例如，您可以透過鍵入 % 符號，後面跟著節點名稱，透過「get_node()」方法呼叫來引用它：

source: Same-scene limitation
de: "Selbe Szene"-Begrenzung
zh_tw: 著色器語言限制

source: A scene unique node can only be retrieved by a node inside the same scene. To demonstrate this limitation, consider this example **Player** scene that instances a **Sword** scene:
de: Ein Szenen-Eindeutiger Node kann nur von einem Node innerhalb derselben Szene abgerufen werden. Um diese Einschränkung zu verdeutlichen, betrachten Sie dieses Beispiel einer **Spieler**-Szene, die eine **Schwert**-Szene instanziiert:
zh_tw: 場景唯一節點只能由同一場景內的節點檢索。為了示範此限制，請考慮以下範例 **Player** 場景，該場景實例化 **Sword** 場景：

source: Here are the results of ``get_node()`` calls inside the **Player** script:
de: Hier sind die Ergebnisse der ``get_node()``-Aufrufe innerhalb des **Player** Skripts:
zh_tw: 以下是 **Player** 腳本內的 ``get_node()`` 呼叫的結果：

source: ``get_node("%Eyes")`` returns the **Eyes** node.
de: ``get_node("%Eyes")`` gibt den **Eyes**-Node zurück.
zh_tw: ``get_node("%Eyes")`` 傳回 **Eyes** 節點。

source: ``get_node("%Hilt")`` returns ``null``.
de: ``get_node("%Hilt")`` gibt ``null`` zurück.
zh_tw: ``get_node("%Hilt")`` 回傳``null``。

source: These are the results of ``get_node()`` calls inside the **Sword** script:
de: Dies sind die Ergebnisse der ``get_node()``-Aufrufe innerhalb des **Sword**-Skripts:

source: ``get_node("%Eyes")`` returns ``null``.
de: ``get_node("%Eyes")`` liefert ``null`` zurück.
zh_tw: ``get_node("%Eyes")`` 回傳``null``。

source: ``get_node("%Hilt")`` returns the **Hilt** node.
de: ``get_node("%Hilt")`` gibt den **Hilt**-Node zurück.
zh_tw: ``get_node("%Hilt")`` 回傳 **Hilt** 節點。

source: If a script has access to a node in another scene, it can call ``get_node()`` on that node to get scene unique nodes from that node's scene. This also works in a node path, which avoids multiple ``get_node()`` calls. Here are two ways to get the **Hilt** node from the **Player** script using scene unique nodes:
de: Wenn ein Skript Zugriff auf einen Node in einer anderen Szene hat, kann es ``get_node()`` auf diesem Node aufrufen, um Szenen-Eindeutige Nodes aus der Szene dieses Nodes zu erhalten. Dies funktioniert auch in einem Node-Pfad, was mehrere ``get_node()`` Aufrufe vermeidet. Hier sind zwei Wege, um den **Hilt**-Node aus dem **Player**-Skript zu erhalten, indem man Szenen-Eindeutige Nodes benutzt:
zh_tw: 如果腳本可以存取另一個場景中的節點，它可以在該節點上呼叫「get_node()」以從該節點的場景中取得場景唯一節點。這也適用於節點路徑，避免多次呼叫“get_node()”。以下是使用場景唯一節點從 **Player** 腳本取得 **Hilt** 節點的兩種方法：

source: ``get_node("Hand/Sword").get_node("%Hilt")`` returns the **Hilt** node.
de: ``get_node("Hand/Sword").get_node("%Hilt")`` liefert den **Hilt**-Node.
zh_tw: ``get_node("Hand/Sword").get_node("%Hilt")`` 傳回 **Hilt** 節點。

source: ``get_node("Hand/Sword/%Hilt")`` also returns the **Hilt** node.
de: ``get_node("Hand/Sword/%Hilt")`` liefert ebenfalls den Node **Hilt**.
zh_tw: ``get_node("Hand/Sword/%Hilt")`` 也回傳 **Hilt** 節點。

source: Scene unique names don't only work at the end of a node path. They can be used in the middle to navigate from one node to another. For example, the **Sword** node is marked as a scene unique node in the **Player** scene, so this is possible:
de: Szenen-Eindeutige Namen funktionieren nicht nur am Ende eines Node-Pfads. Sie können auch in der Mitte verwendet werden, um von einem Node zu einem anderen zu navigieren. Zum Beispiel ist der Node **Sword** in der Szene **Player** als Szenen-Eindeutiger Node markiert, so dass dies möglich ist:
zh_tw: 場景唯一名稱不僅適用於節點路徑的末端。它們可以在中間使用，從一個節點導覽到另一個節點。例如，**Sword** 節點被標記為 **Player** 場景中的場景唯一節點，因此這是可能的：

source: ``get_node("%Sword/%Hilt")`` returns the **Hilt** node.
de: ``get_node("%Sword/%Hilt")`` gibt den **Hilt**-Node zurück.
zh_tw: ``get_node("%Sword/%Hilt")`` 回傳 **Hilt** 節點。

source: Alternatives
de: Alternative Ansätze
zh_tw: 額外檔案

source: Scene unique nodes are a useful tool to navigate a scene. However, there are some situations where other techniques may be better.
de: Szenen-Eindeutige Nodes sind ein nützliches Hilfsmittel, um in einer Szene zu navigieren. Es gibt jedoch einige Situationen, in denen andere Methoden besser geeignet sind.
zh_tw: 場景唯一節點是導覽場景的有用工具。然而，在某些情況下，其他技術可能會更好。

source: A :ref:`Group <doc_groups>` allows locating a node (or a group of many nodes) from any other node, no matter what scene the two nodes are located in.
de: Eine :ref:`Gruppe <doc_groups>` ermöglicht es, einen Node (oder eine Gruppe von vielen Nodes) von jedem anderen Node aus zu lokalisieren, unabhängig davon, in welcher Szene sich die beiden Nodes befinden.
zh_tw: 群組 <doc_groups>` 允許從任何其他節點定位一個節點（或一組許多節點），無論這兩個節點位於哪個場景。

source: A :ref:`Singleton (Autoload) <doc_singletons_autoload>` is an always loaded node that can be accessed directly by any node regardless of the scene. These are useful when some data or functionality is shared globally.
de: Ein :ref:`Singleton (Autoload) <doc_singletons_autoload>` ist ein immer geladener Node, auf den von jedem Node unabhängig von der Szene direkt zugegriffen werden kann. Diese sind nützlich, wenn einige Daten oder Funktionen global gemeinsam genutzt werden.
zh_tw: Singleton (Autoload) <doc_singletons_autoload>` 是一個始終載入的節點，無論場景如何，任何節點都可以直接存取它。當某些資料或功能在全球範圍內共享時，這些功能非常有用。

source: :ref:`Node.find_child() <class_Node_method_find_child>` finds a node by name without knowing its full path. This seems similar to a scene unique node, but this method is able to find nodes in nested scenes, and doesn't require marking the node in the scene editor in any way. However, this method is slow. Scene unique nodes are cached by Godot and are fast to retrieve, but each time the method is called, ``find_child()`` needs to check every descendant (every child, grandchild, and so on).
de: :ref:`Node.find_child() <class_Node_method_find_child>` findet einen Node anhand seines Namens, ohne seinen vollständigen Pfad zu kennen. Dies scheint ähnlich wie ein Szenene-Eindeutiger Node, aber diese Methode ist in der Lage, Nodes in verschachtelten Szenen zu finden, und erfordert keine Markierung des Nodes im Szeneneditor in irgendeiner Weise. Allerdings ist diese Methode langsam. Szenen-Eindeutige Nodes werden von Godot zwischengespeichert und sind schnell auffindbar, aber jedes Mal, wenn die Methode aufgerufen wird, muss ``find_child()`` jeden Unter-Node überprüfen (jedes Child, dessen Child, und so weiter.).
zh_tw: :ref:`Node.find_child() <class_Node_method_find_child>` 透過名稱尋找節點，而不知道其完整路徑。這看起來類似於場景唯一節點，但這種方法能夠在巢狀場景中尋找節點，並且不需要以任何方式在場景編輯器中標記節點。然而，這種方法很慢。場景唯一節點由 Godot 快取，並且可以快速檢索，但每次呼叫該方法時，``find_child()`` 都需要檢查每個後代（每個孩子、孫子等）。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
