Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/singletons_autoload.po
Languages: de

source: Introduction
de: Einführung

source: Godot's scene system, while powerful and flexible, has a drawback: there is no method for storing information (e.g. a player's score or inventory) that is needed by more than one scene.
de: Das Szenensystem von Godot ist zwar leistungsfähig und flexibel, hat aber einen Nachteil: Es gibt keine Methode, um Informationen zu speichern (z.B. den Punktestand eines Spielers oder sein Inventar), die von mehr als einer Szene benötigt werden.

source: It's possible to address this with some workarounds, but they come with their own limitations:
de: Es ist möglich, dieses Problem mit einigen Workarounds zu beheben, aber diese haben ihre eigenen Grenzen:

source: You can use a "master" scene that loads and unloads other scenes as its children. However, this means you can no longer run those scenes individually and expect them to work correctly.
de: Sie können eine "Master"-Szene verwenden, die andere Szenen als ihre Child-Elemente lädt und entlädt. Das bedeutet jedoch, dass Sie diese Szenen nicht mehr einzeln ausführen und erwarten können, dass sie korrekt funktionieren.

source: Information can be stored to disk in ``user://`` and then loaded by scenes that require it, but frequently saving and loading data is cumbersome and may be slow.
de: Informationen können auf der Festplatte unter ``user://`` gespeichert und dann von Szenen geladen werden, die sie benötigen, aber häufiges Speichern und Laden von Daten ist umständlich und kann langsam sein.

source: The `Singleton pattern <https://en.wikipedia.org/wiki/Singleton_pattern>`_ is a useful tool for solving the common use case where you need to store persistent information between scenes. In our case, it's possible to reuse the same scene or class for multiple singletons as long as they have different names.
de: Das `Singleton-Pattern <https://en.wikipedia.org/wiki/Singleton_pattern>`_ ist ein nützliches Werkzeug, um den häufigen Anwendungsfall zu lösen, bei dem Sie persistente Informationen zwischen Szenen speichern müssen. In unserem Fall ist es möglich, die gleiche Szene oder Klasse für mehrere Singletons wiederzuverwenden, solange sie unterschiedliche Namen haben.

source: Using this concept, you can create objects that:
de: Durch die Verwendung dieses Konzepts wird es Ihnen ermöglicht, Objekte zu instanziieren die:

source: Are always loaded, no matter which scene is currently running.
de: Immer geladen werden, unabhängig davon, welche Szene gerade abgespielt wird.

source: Can store global variables such as player information.
de: Globale Variablen abspeichern können, wie z.B. Spielerinformationen.

source: Can handle switching scenes and between-scene transitions.
de: Szenenwechsel und Szenenübergänge verarbeiten können.

source: *Act* like a singleton, since GDScript does not support global variables by design.
de: Sich *verhalten* wie ein Singleton, da GDScript von Haus aus keine globalen Variablen unterstützt.

source: Autoloading nodes and scripts can give us these characteristics.
de: Das Autoloading von Nodes und Skripten kann uns diese Merkmale liefern.

source: Godot won't make an Autoload a "true" singleton as per the singleton design pattern. It may still be instanced more than once by the user if desired.
de: Godot macht ein Autoload nicht zu einem "echten" Singleton gemäß dem Singleton-Design-Pattern. Es kann immer noch mehr als einmal vom Benutzer instanziiert werden, falls gewünscht.

source: If you're creating an autoload as part of an editor plugin, consider :ref:`registering it automatically in the Project Settings <doc_making_plugins_autoload>` when the plugin is enabled.
de: Wenn Sie einen Autoload als Teil eines Editor-Plugins erstellen, sollten Sie in Betracht ziehen, :ref:`ihn automatisch in den Projekteinstellungen zu registrieren <doc_making_plugins_autoload>`, wenn das Plugin aktiviert ist.

source: You can create an Autoload to load a scene or a script that inherits from :ref:`class_Node`.
de: Sie können ein Autoload erstellen, um eine Szene oder ein Skript zu laden, das von :ref:`class_Node` erbt.

source: When autoloading a script, a :ref:`class_Node` will be created and the script will be attached to it. This node will be added to the root viewport before any other scenes are loaded.
de: Wenn ein Skript automatisch geladen wird, wird ein :ref:`class_Node` erstellt und das Skript wird daran angehängt. Dieser Node wird dem Root-Viewport hinzugefügt, bevor weitere Szenen geladen werden.

source: To autoload a scene or script, select **Project > Project Settings** from the menu and switch to the **Autoload** tab.
de: Um eine Szene oder ein Skript automatisch zu laden, wählen Sie im Menü **Projekt > Projekteinstellungen** und wechseln Sie zum **Autoload**-Tab.

source: Here you can add any number of scenes or scripts. Each entry in the list requires a name, which is assigned as the node's ``name`` property. The order of the entries as they are added to the global scene tree can be manipulated using the up/down arrow keys. Like regular scenes, the engine will read these nodes in top-to-bottom order.
de: Hier können Sie eine beliebige Anzahl von Szenen oder Skripten hinzufügen. Jeder Eintrag in der Liste benötigt einen Namen, der als ``Name``-Property des Nodes zugewiesen wird. Die Reihenfolge der Einträge, wenn sie dem globalen Szenenbaum hinzugefügt werden, kann mit den oben/unten-Pfeiltasten geändert werden. Wie bei regulären Szenen liest die Engine diese Nodes in der Reihenfolge von oben nach unten.

source: This means that any node can access a singleton named "PlayerVariables" with:
de: Das bedeutet, dass ein Node auf ein Singleton namens "SpielerVariablen" zugreifen kann mit:

source: If the **Enable** column is checked (which is the default), then the singleton can be accessed directly in GDScript, without requiring ``get_node()``:
de: Wenn die Spalte **Aktivieren** angekreuzt ist (was der Default ist), dann kann auf das Singleton direkt in GDScript zugegriffen werden, ohne ``get_node()`` zu benötigen:

source: Note that autoload objects (scripts and/or scenes) are accessed just like any other node in the scene tree. In fact, if you look at the running scene tree, you'll see the autoloaded nodes appear:
de: Beachten Sie, dass auf automatisch geladene Objekte (Skripte und/oder Szenen) wie auf alle anderen Nodes im Szenenbaum zugegriffen wird. Wenn Sie sich den laufenden Szenenbaum ansehen, werden Sie die automatisch geladenen Nodes sehen:

source: Autoloads must **not** be removed using ``free()`` or ``queue_free()`` at runtime, or the engine will crash.
de: Autoloads dürfen **nicht** mit ``free()`` oder ``queue_free()`` zur Laufzeit entfernt werden, sonst stürzt die Engine ab.

source: Custom scene switcher
de: Benutzerdefinierter Szenenwechsler

source: This tutorial will demonstrate building a scene switcher using autoloads. For basic scene switching, you can use the :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` method (see :ref:`doc_scene_tree` for details). However, if you need more complex behavior when changing scenes, this method provides more functionality.
de: Dieses Tutorial demonstriert den Aufbau eines Szenenwechslers mit Autoloads. Für einfache Szenenwechsel können Sie die Methode :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` verwenden (siehe :ref:`doc_scene_tree` für Details). Wenn Sie jedoch ein komplexeres Verhalten beim Ändern von Szenen benötigen, bietet diese Methode mehr Funktionalität.

source: To begin, download the template from here: `singleton_autoload_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/singleton_autoload_starter.zip>`_ and open it in Godot.
de: Um zu beginnen, laden Sie die Vorlage von hier herunter: `singleton_autoload_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/singleton_autoload_starter.zip>`_ und öffnen Sie sie in Godot.

source: The project contains two scenes: ``scene_1.tscn`` and ``scene_2.tscn``. Each scene contains a label displaying the scene name and a button with its ``pressed()`` signal connected. When you run the project, it starts in ``scene_1.tscn``. However, pressing the button does nothing.
de: Das Projekt enthält zwei Szenen: ``scene_1.tscn`` und ``scene_2.tscn``. Jede Szene enthält eine Beschriftung, die den Namen der Szene anzeigt, und einen Button, dessen ``pressed()`` Signal angeschlossen ist. Wenn Sie das Projekt starten, beginnt es in ``scene_1.tscn``. Das Drücken des Buttons bewirkt jedoch nichts.

source: Creating the script
de: Erstellen des Skripts

source: Open the **Script** window and create a new script called ``global.gd``. Make sure it inherits from ``Node``:
de: Öffnen Sie das **Skript**-Fenster und erstellen Sie ein neues Skript mit dem Namen ``global.gd``. Stellen Sie sicher, dass es von ``Node`` erbt:

source: The next step is to add this script to the autoLoad list. Open **Project > Project Settings** from the menu, switch to the **Autoload** tab and select the script by clicking the browse button or typing its path: ``res://global.gd``. Press **Add** to add it to the autoload list:
de: Der nächste Schritt besteht darin, dieses Skript zur AutoLoad-Liste hinzuzufügen. Öffnen Sie **Projekt > Projekteinstellungen** aus dem Menü, wechseln Sie zum **Autoload**-Tab und wählen Sie das Skript aus, indem Sie auf den Durchsuchen-Button klicken oder den Pfad eingeben: ``res://global.gd``. Drücken Sie **Hinzufügen**, um es der Autoload-Liste hinzuzufügen:

source: Now whenever we run any scene in the project, this script will always be loaded.
de: Ab jetzt würde bei jeder Ausführung des Projekts das Skript automatisch geladen werden.

source: Returning to the script, it needs to fetch the current scene in the `_ready()` function. Both the current scene (the one with the button) and ``global.gd`` are children of root, but autoloaded nodes are always first. This means that the last child of root is always the loaded scene.
de: Um zum Skript zurückzukehren, muss es sich die aktuelle Szene mit der Funktion `_ready()` holen. Sowohl die aktuelle Szene (die mit dem Button) als auch ``global.gd`` sind Child-Elemente von root, aber automatisch geladene Nodes kommen immer zuerst. Das bedeutet, dass das letzte Child-Element von root immer die geladene Szene ist.

source: Now we need a function for changing the scene. This function needs to free the current scene and replace it with the requested one.
de: Als nächstes benötigen wir eine Funktion, um die Szene zu modifizieren. Diese Funktion muss die aktuelle Szene leeren und diese mit der gewünschten ersetzen.

source: Using :ref:`Object.call_deferred() <class_Object_method_call_deferred>`, the second function will only run once all code from the current scene has completed. Thus, the current scene will not be removed while it is still being used (i.e. its code is still running).
de: Durch Nutzung von :ref:`Object.call_deferred() <class_Object_method_call_deferred>` wird die zweite Funktion nur ausgeführt, wenn das komplette Programm der aktuellen Szene beendet ist. Daher wird die aktuelle Szene nicht gelöscht, solange sie noch genutzt wird (z.B. wenn sein Code noch läuft).

source: Finally, we need to fill the empty callback functions in the two scenes:
de: Schlussendlich müssen wir noch die leeren Callback-Funktionen in den zwei Szenen ausfüllen:

source: and
de: und

source: Run the project and test that you can switch between scenes by pressing the button.
de: Führen Sie das Projekt aus und überprüfen Sie, dass Sie durch die Betätigung des Buttons zwischen den Szenen hin- und her springen können.

source: When scenes are small, the transition is instantaneous. However, if your scenes are more complex, they may take a noticeable amount of time to appear. To learn how to handle this, see the next tutorial: :ref:`doc_background_loading`.
de: Bei kleinen Szenen erfolgt der Übergang sofort. Wenn Ihre Szenen jedoch komplexer sind, kann es eine merkliche Zeit dauern, bis sie erscheinen. Wie man damit umgeht, erfahren Sie im nächsten Tutorial: :ref:`doc_background_loading`.

source: Alternatively, if the loading time is relatively short (less than 3 seconds or so), you can display a "loading plaque" by showing some kind of 2D element just before changing the scene. You can then hide it just after the scene is changed. This can be used to indicate to the player that a scene is being loaded.
de: Wenn die Ladezeit relativ kurz ist (weniger als 3 Sekunden oder so), können Sie alternativ eine "Ladeplakette" anzeigen, indem Sie kurz vor dem Ändern der Szene irgendein 2D-Element anzeigen. Sie können es dann direkt nach dem Ändern der Szene ausblenden. Dies kann verwendet werden, um dem Spieler anzuzeigen, dass eine Szene gerade geladen wird.

source: Translation status
de: Übersetzungsstatus
