Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/index.po
Languages: de

source: Particle systems (3D)
de: Partikelsysteme (3D)

source: This section of the tutorial covers (3D) GPU-accelerated particle systems. Most of the things discussed here apply to CPU particles as well.
de: Dieser Abschnitt des Tutorials behandelt (3D) GPU-beschleunigte Partikelsysteme. Das meiste, was hier besprochen wird, gilt auch für CPU-Partikel.

source: Introduction
de: Einführung

source: You can use particle systems to simulate complex physical effects like fire, sparks, smoke, magical effects, and many more. They are very well suited for creating dynamic and organic behavior and adding "life" to your scenes.
de: Sie können Partikelsysteme verwenden, um komplexe physikalische Effekte wie Feuer, Funken, Rauch, magische Effekte und vieles mehr zu simulieren. Sie sind sehr gut geeignet, um dynamisches und organisches Verhalten zu erzeugen und Ihren Szenen "Leben" zu verleihen.

source: The idea is that a particle is emitted at a fixed interval and with a fixed lifetime. During its lifetime, every particle will have the same base behavior. What makes each particle different from the others and creates the organic look is the randomness that you can add to most of its parameters and behaviors.
de: Die Idee ist, dass ein Teilchen in einem festen Intervall und mit einer festen Lebensdauer emittiert wird. Während seiner Lebensdauer hat jedes Partikel das gleiche Grundverhalten. Was jedes Partikel von den anderen unterscheidet und das organischen Aussehen erzeugt, ist die Zufälligkeit, die Sie den meisten Parametern und Verhaltensweisen hinzufügen können.

source: Every particle system you create in Godot consists of two main parts: particles and emitters.
de: Jedes Partikelsystem, das Sie in Godot erstellen, besteht aus zwei Hauptteilen: Partikel und Emitter.

source: Particles
de: Partikel

source: A particle is the visible part of a particle system. It's what you see on the screen when a particle system is active: The tiny specks of dust, the flames of a fire, the glowing orbs of a magical effect. You can have anywhere between a couple hundred and tens of thousands of particles in a single system. You can randomize a particle's size, its speed and movement direction, and change its color over the course of its lifetime. When you think of a fire, you can think of all the little embers flying away from it as individual particles.
de: Ein Partikel ist der sichtbare Teil eines Partikelsystems. Es ist das, was Sie auf dem Bildschirm sehen, wenn ein Partikelsystem aktiv ist: Die winzigen Staubkörnchen, die Flammen eines Feuers, die leuchtenden Kugeln eines magischen Effekts. Ein einziges System kann zwischen ein paar hundert und zehntausend Partikel enthalten. Sie können die Größe, Geschwindigkeit und Bewegungsrichtung eines Partikels nach dem Zufallsprinzip bestimmen und seine Farbe im Laufe seines Lebens ändern. Wenn Sie an ein Feuer denken, können Sie sich all die kleinen Funken, die davon wegfliegen, als einzelne Partikel vorstellen.

source: Emitters
de: Emitter

source: An emitter is what's creating the particles. Emitters are usually not visible, but they can have a shape. That shape controls where and how particles are spawned, for example whether they should fill a room like dust or shoot away from a single point like a fountain. Going back to the fire example, an emitter would be the heat at the center of the fire that creates the embers and the flames.
de: Ein Emitter ist das, was die Partikel erzeugt. Emitter sind normalerweise nicht sichtbar, aber sie können eine Form haben. Diese Form steuert, wo und wie die Partikel erzeugt werden, z. B. ob sie einen Raum wie Staub füllen oder von einem einzelnen Punkt wie eine Fontäne wegschießen sollen. Um auf das Beispiel mit dem Feuer zurückzukommen: Ein Emitter wäre die Hitze im Zentrum des Feuers, die Glut und Flammen erzeugt.

source: Node overview
de: Node-Übersicht

source: A list of nodes related to 3D particles
de: Eine Liste von Nodes, die sich auf 3D-Partikel beziehen

source: All 3D particle nodes available in Godot
de: Alle 3D-Partikel-Nodes, die in Godot verfügbar sind

source: There are two types of 3D particle systems in Godot: :ref:`class_GPUParticles3D`, which are processed on the GPU, and :ref:`class_CPUParticles3D`, which are processed on the CPU.
de: Es gibt zwei Arten von 3D-Partikel-Systemen in Godot: :ref:`class_GPUParticles3D`, die auf der GPU verarbeitet werden, und :ref:`class_CPUParticles3D`, die auf der CPU verarbeitet werden.

source: CPU particle systems are less flexible than their GPU counterpart, but they work on a wider range of hardware and provide better support for older devices and mobile phones. Because they are processed on the CPU, they are not as performant as GPU particle systems and can't render as many individual particles. In addition they currently do not have all the available options GPU particles have for control.
de: CPU-Partikel-Systeme sind weniger flexibel als ihr GPU-Gegenstück, aber sie funktionieren auf einer breiteren Palette von Hardware und bieten bessere Unterstützung für ältere Geräte und Mobiltelefone. Da sie auf der CPU verarbeitet werden, sind sie nicht so leistungsfähig wie GPU-Partikel-Systeme und können nicht so viele einzelne Partikel rendern. Außerdem verfügen sie derzeit nicht über alle Optionen, die GPU-Partikel zur Steuerung bieten.

source: GPU particle systems run on the GPU and can render hundreds of thousands of particles on modern hardware. You can write custom particle shaders for them, which makes them very flexible. You can also make them interact with the environment by using attractor and collision nodes.
de: GPU-Partikel-Systeme laufen auf der GPU und können auf moderner Hardware Hunderttausende von Partikeln rendern. Sie können eigene Partikel-Shader für sie schreiben, was sie sehr flexibel macht. Sie können sie auch mit der Umgebung interagieren lassen, indem Sie Attraktor- und Kollisions-Nodes verwenden.

source: There are three particle attractor nodes: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D`, and :ref:`class_GPUParticlesAttractorVectorField3D`. An attractor node applies a force to all particles in its reach and pulls them closer or pushes them away based on the direction of that force.
de: Es gibt drei Partikel-Attraktor-Nodes: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D`, und :ref:`class_GPUParticlesAttractorVectorField3D`. Ein Attraktor-Node übt eine Kraft auf alle Partikel in seiner Reichweite aus und zieht sie näher heran oder stößt sie weg, je nach Richtung dieser Kraft.

source: There are several particle collision nodes. :ref:`class_GPUParticlesCollisionBox3D` and :ref:`class_GPUParticlesCollisionSphere3D` are the simple ones. You can use them to create basic shapes like boxes, a floor, or a wall that particles collide with. The other two nodes provide more complex collision behavior. The :ref:`class_GPUParticlesCollisionSDF3D` is useful when you want indoor scenes to collide with particles without having to create all the individual box and sphere colliders by hand. If you want particles to collide with large outdoor scenes, you would use the :ref:`class_GPUParticlesCollisionHeightField3D` node. It creates a heightmap of your world and the objects in it and uses that for large-scale particle collisions.
de: Es gibt mehrere Nodes für Partikelkollisionen: :ref:`class_GPUParticlesCollisionBox3D` und :ref:`class_GPUParticlesCollisionSphere3D` sind die einfachsten. Sie können sie verwenden, um grundlegende Formen wie Boxen, einen Boden oder eine Wand zu erstellen, mit denen Partikel kollidieren. Die anderen beiden Nodes bieten ein komplexeres Kollisionsverhalten. Der :ref:`class_GPUParticlesCollisionSDF3D` ist nützlich, wenn Sie wollen, dass Innenszenen mit Partikeln kollidieren, ohne alle einzelnen Box- und Kugelkollider von Hand erstellen zu müssen. Wenn Sie wollen, dass Partikel mit großen Außenszenen kollidieren, würden Sie den :ref:`class_GPUParticlesCollisionHeightField3D` Node verwenden. Er erstellt eine Höhenkarte Ihrer Welt und der darin befindlichen Objekte und verwendet diese für großflächige Partikelkollisionen.

source: Basic usage
de: Grundlegende Verwendung

source: Advanced topics
de: Fortgeschrittene Themen

source: Translation status
de: Übersetzungsstatus
