Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/2d_coordinate_systems.po
Languages: de

source: 2D coordinate systems and 2D transforms
de: 2D-Koordinatensysteme und 2D-Transformationen

source: Introduction
de: Einführung

source: This is a detailed overview of the available 2D coordinate systems and 2D transforms that are built in. The basic concepts are covered in :ref:`doc_viewport_and_canvas_transforms`.
de: Dies ist ein detaillierter Überblick über die verfügbaren Built-in-2D-Koordinatensysteme und -2D-Transformationen. Die grundlegenden Konzepte werden in :ref:`doc_viewport_and_canvas_transforms` behandelt.

source: :ref:`Transform2D <class_Transform2D>` are matrices that convert coordinates from one coordinate system to an other. In order to use them, it is beneficial to know which coordinate systems are available in Godot. For a deeper understanding, the :ref:`doc_matrices_and_transforms` tutorial offers insights to the underlying functionality.
de: :ref:`Transform2D <class_Transform2D>` sind Matrizen, die Koordinaten von einem Koordinatensystem in ein anderes umwandeln. Um sie verwenden zu können, ist es von Vorteil, zu wissen, welche Koordinatensysteme in Godot verfügbar sind. Für ein tieferes Verständnis bietet das :ref:`doc_matrices_and_transforms`-Tutorial Einblicke in die zugrunde liegende Funktionalität.

source: Godot 2D coordinate systems
de: Godot 2D-Koordinatensysteme

source: The following graphic gives an overview of Godot 2D coordinate systems and the available node-transforms, transform-functions and coordinate-system related functions. At the left is the OS Window Manager screen, at the right are the :ref:`CanvasItems <class_CanvasItem>`. For simplicity reasons this graphic doesn't include :ref:`SubViewport <class_SubViewport>`, :ref:`SubViewportContainer <class_SubViewportContainer>`, :ref:`ParallaxLayer<class_ParallaxLayer>` and :ref:`ParallaxBackground<class_ParallaxBackground>` all of which also influence transforms.
de: Die folgende Grafik gibt einen Überblick über die Godot-2D-Koordinatensysteme und die verfügbaren Node-Transformationen, Transformations-Funktionen und koordinatensystembezogenen Funktionen. Links ist der Bildschirm des OS Window Managers zu sehen, rechts sind die :ref:`CanvasItems <class_CanvasItem>`. Der Einfachheit halber enthält diese Grafik keine :ref:`SubViewport <class_SubViewport>`, :ref:`SubViewportContainer <class_SubViewportContainer>`, :ref:`ParallaxLayer<class_ParallaxLayer>` und :ref:`ParallaxBackground<class_ParallaxBackground>`, die alle auch Transformationen beeinflussen.

source: The graphic is based on a node tree of the following form: ``Root Window (embed Windows)`` ⇒ ``Window (don't embed Windows)`` ⇒ ``CanvasLayer`` ⇒ ``CanvasItem`` ⇒ ``CanvasItem`` ⇒ ``CanvasItem``. There are more complex combinations possible, like deeply nested Window and SubViewports, however this example intends to provide an overview of the methodology in general.
de: Die Grafik basiert auf einem Node-Baum der folgenden Form: ``Root-Fenster (Fenster einbetten)`` ⇒ ``Fenster (keine Fenster einbetten)`` ⇒ ``CanvasLayer`` ⇒ ``CanvasItem`` ⇒ ``CanvasItem`` ⇒ ``CanvasItem``. Es sind noch komplexere Kombinationen möglich, wie z.B. tief verschachtelte Fenster und SubViewports, dieses Beispiel soll jedoch einen Überblick über die Methodik im Allgemeinen geben.

source: Click graphic to enlarge.
de: Zum Vergrößern auf die Grafik klicken.

source: **Item Coordinates**
de: **Element-Koordinaten**

source: This is the local coordinate system of a :ref:`CanvasItem <class_CanvasItem>`.
de: Dies ist das lokale Koordinatensystem eines :ref:`CanvasItem <class_CanvasItem>`.

source: **Parent Item Coordinates**
de: **Koordinaten des übergeordneten Elements**

source: This is the local coordinate system of the parent's *CanvasItem*. When positioning *CanvasItems* in the *Canvas*, they usually inherit the transformations of their parent *CanvasItems*. An exceptions is :ref:`CanvasItems.top_level <class_CanvasItem_property_top_level>`.
de: Dies ist das lokale Koordinatensystem des übergeordneten *CanvasItems*. Wenn *CanvasItems* im *Canvas* positioniert werden, erben sie normalerweise die Transformationen ihrer übergeordneten *CanvasItems*. Eine Ausnahme ist :ref:`CanvasItems.top_level <class_CanvasItem_property_top_level>`.

source: **Canvas Coordinates**
de: **Canvas-Koordinaten**

source: As mentioned in the previous tutorial :ref:`doc_canvas_layers`, there are two types of canvases (*Viewport* canvas and *CanvasLayer* canvas) and both have a canvas coordinate system. These are also called world coordinates. A *Viewport* can contain multiple *Canvases* with different coordinate systems.
de: Wie im vorangegangenen Tutorial :ref:`doc_canvas_layers` erwähnt, gibt es zwei Arten von Canvases (*Viewport*-Canvas und *CanvasLayer*-Canvas) und beide haben ein Canvas-Koordinatensystem. Diese werden auch Weltkoordinaten genannt. Ein *Viewport* kann mehrere *Canvases* mit unterschiedlichen Koordinatensystemen enthalten.

source: **Viewport Coordinates**
de: **Viewport-Koordinaten**

source: This is the coordinate system of the :ref:`Viewport <class_Viewport>`.
de: Dies ist das Koordinatensystem des :ref:`Viewport <class_Viewport>`.

source: **Camera Coordinates**
de: **Kamerakoordinaten**

source: This is only used internally for functionality like 3D-camera ray projections.
de: Dies wird nur intern für Funktionen wie 3D-Kamerastrahlenprojektionen verwendet.

source: **Embedder Coordinates / Screen Coordinates**
de: **Embedder-Koordinaten / Bildschirmkoordinaten**

source: Every *Viewport* (*Window* or *SubViewport*) in the scene tree is embedded either in a different node or in the OS Window Manager. This coordinate system's origin is identical to the top-left corner of the *Window* or *SubViewport* and its scale is the one of the embedder or the OS Window Manager.
de: Jeder *Viewport* (*Fenster* oder *SubViewport*) im Szenenbaum ist entweder in einem anderen Node oder im OS Window Manager eingebettet. Der Ursprung dieses Koordinatensystems ist identisch mit der linken oberen Ecke des *Fensters* oder *SubViewports* und sein Maßstab ist der des Embedders oder des OS Window Managers.

source: If the embedder is the OS Window Manager, then they are also called Screen Coordinates.
de: Wenn der Embedder der OS Window Manager ist, werden sie auch Bildschirmkoordinaten genannt.

source: **Absolute Embedder Coordinates / Absolute Screen Coordinates**
de: **Absolute Embedder-Koordinaten / Absolute Bildschirmkoordinaten**

source: The origin of this coordinate system is the top-left corner of the embedding node or the OS Window Manager screen. Its scale is the one of the embedder or the OS Window Manager.
de: Der Ursprung dieses Koordinatensystems ist die linke obere Ecke des einbettenden Nodes oder des OS Window Manager-Bildschirms. Sein Maßstab ist der des Embedders oder des OS Window Managers.

source: If the embedder is the OS Window Manager, then they are also called Absolute Screen Coordinates.
de: Wenn der Embedder der OS Window Manager ist, werden sie auch als absolute Bildschirmkoordinaten bezeichnet.

source: Node transforms
de: Node-Transformationen

source: Each of the mentioned nodes have one or more transforms associated with them and the combination of these nodes infer the transforms between the different coordinate systems. With a few exceptions, the transforms are :ref:`Transform2D <class_Transform2D>` and the following list shows details and effects of each of them.
de: Jedem der genannten Nodes sind eine oder mehrere Transformationen zugeordnet, und aus der Kombination dieser Nodes lassen sich die Transformationen zwischen den verschiedenen Koordinatensystemen ableiten. Bis auf wenige Ausnahmen handelt es sich bei den Transformationen um :ref:`Transform2D <class_Transform2D>`, und die folgende Liste enthält Einzelheiten und Auswirkungen der einzelnen Transformationen.

source: **CanvasItem transform**
de: **CanvasItem-Transformation**

source: *CanvasItems* are either *Control*-nodes or *Node2D*-nodes.
de: *CanvasItems* sind entweder *Control*-Nodes oder *Node2D*-Nodes.

source: For *Control* nodes this transform consists of a :ref:`position <class_Control_property_position>` relative to the parent's origin and a :ref:`scale <class_Control_property_scale>` and :ref:`rotation <class_Control_property_rotation>` around a :ref:`pivot point <class_Control_property_pivot_offset>`.
de: Für *Control*-Nodes besteht diese Transformation aus einer :ref:`Position <class_Control_property_position>` relativ zum Ursprung des Parent-Nodes und einer :ref:`Skalierung <class_Control_property_scale>` und :ref:`Rotation <class_Control_property_rotation>` um einen :ref:`Pivotpunkt <class_Control_property_pivot_offset>`.

source: For *Node2D* nodes :ref:`transform <class_Node2D_property_transform>` consists of :ref:`position <class_Node2D_property_position>`, :ref:`rotation <class_Node2D_property_rotation>`, :ref:`scale <class_Node2D_property_scale>` and :ref:`skew <class_Node2D_property_skew>`.
de: Für *Node2D*-Nodes besteht :ref:`transform <class_Node2D_property_transform>` aus :ref:`Position <class_Node2D_property_position>`, :ref:`Rotation <class_Node2D_property_rotation>`, :ref:`Skalierung <class_Node2D_property_scale>` und :ref:`Skew <class_Node2D_property_skew>`.

source: The transform affects the item itself and usually also child-*CanvasItems* and in the case of a *SubViewportContainer* it affects the contained *SubViewport*.
de: Die Transformation wirkt sich auf das Element selbst und in der Regel auch auf untergeordnete *CanvasItems* und im Falle eines *SubViewportContainers* auf den enthaltenen *SubViewport* aus.

source: **CanvasLayer transform**
de: **CanvasLayer-Transformation**

source: The *CanvasLayer's* :ref:`transform <class_CanvasLayer_property_transform>` affects all *CanvasItems* within the *CanvasLayer*. It doesn't affect other *CanvasLayers* or *Windows* in its *Viewport*.
de: Die :ref:`Transformation <class_CanvasLayer_property_transform>` des *CanvasLayers* betrifft alle *CanvasItems* innerhalb der *CanvasLayer*. Sie wirkt sich nicht auf andere *CanvasLayer* oder *Fenster* in ihrem *Viewport* aus.

source: **CanvasLayer follow viewport transform**
de: **CanvasLayer folgt der Viewport-Transformation**

source: The *follow viewport transform* is an automatically calculated transform, that is based on the *Viewport's* :ref:`canvas transform <class_Viewport_property_canvas_transform>` and the *CanvasLayer's* :ref:`follow viewport scale <class_CanvasLayer_property_follow_viewport_scale>` and can be used, if :ref:`enabled <class_CanvasLayer_property_follow_viewport_enabled>`, to achieve a pseudo 3D effect. It affects the same child nodes as the *CanvasLayer transform*.
de: Die *Viewport-Transformation folgen*-Property ist eine automatisch berechnete Transformation, die auf der :ref:`Canvas-Transformation <class_Viewport_property_canvas_transform>`-Property des *Viewports* und der :ref:`Viewport-Skalerung folgen <class_CanvasLayer_property_follow_viewport_scale>`-Property des *CanvasLayers* basieret und kann, wenn sie :ref:`aktiviert <class_CanvasLayer_property_follow_viewport_enabled>` ist, verwendet werden, um einen Pseudo-3D-Effekt zu erzielen. Sie wirkt auf die gleichen Child-Nodes wie die *CanvasLayer-Transformation*.

source: **Viewport canvas transform**
de: **Viewport-Canvas-Transformation**

source: The :ref:`canvas transform <class_Viewport_property_canvas_transform>` affects all *CanvasItems* in the *Viewport's* default canvas. It also affects *CanvasLayers*, that have follow viewport transform enabled. The *Viewport's* active :ref:`Camera2D <class_Camera2D>` works by changing this transform. It doesn't affect this *Viewport's* embedded *Windows*.
de: Die :ref:`Canvas-Transformation <class_Viewport_property_canvas_transform>` wirkt sich auf alle *CanvasItems* im Standard-Canvas des *Viewports* aus. Sie wirkt sich auch auf *CanvasLayers* aus, die ihre Viewport-Transformation aktiviert haben. Die aktive :ref:`Camera2D <class_Camera2D>` des *Viewports* funktioniert, indem sie diese Transformation ändert. Sie wirkt sich nicht auf die eingebetteten *Fenster* dieses *Viewports* aus.

source: **Viewport global canvas transform**
de: **Viewport-globale Canvas-Transformation**

source: *Viewports* also have a :ref:`global canvas transform <class_Viewport_property_global_canvas_transform>`. This is the master transform and affects all individual *Canvas Layer* and embedded *Window* transforms. This is primarily used in Godot's CanvasItem Editor.
de: *Viewports* haben auch eine :ref:`globale Canvas-Transformation <class_Viewport_property_global_canvas_transform>`. Dies ist die Master-Transformation und beeinflusst alle individuellen *Canvas-Ebenen* und eingebetteten *Fenster*-Transformationen. Sie wird hauptsächlich im CanvasItem-Editor von Godot verwendet.

source: **Viewport stretch transform**
de: **Viewport-Stretch-Transformation**

source: Finally, *Viewports* have a *stretch transform*, which is used when resizing or stretching the viewport. This transform is used for :ref:`Windows <class_Window>` as described in :ref:`doc_multiple_resolutions`, but can also be manually set on *SubViewports* by means of :ref:`size <class_SubViewport_property_size>` and :ref:`size_2d_override <class_SubViewport_property_size_2d_override>`. It's :ref:`translation <class_Transform2D_method_get_origin>`, :ref:`rotation <class_Transform2D_method_get_rotation>` and :ref:`skew <class_Transform2D_method_get_skew>` are the default values and it can only have non-default :ref:`scale <class_Transform2D_method_get_scale>`.
de: Schließlich haben *Viewports* eine *Stretch-Transformation*, die bei der Größenänderung oder beim Stretching des Viewports verwendet wird. Diese Transformation wird für :ref:`Fenster <class_Window>` verwendet, wie in :ref:`doc_multiple_resolutions` beschrieben; kann aber auch manuell auf *SubViewports* mittels :ref:`size <class_SubViewport_property_size>` und :ref:`size_2d_override <class_SubViewport_property_size_2d_override>` gesetzt werden. :ref:`translation <class_Transform2D_method_get_origin>`, :ref:`rotation <class_Transform2D_method_get_rotation>` und :ref:`skew <class_Transform2D_method_get_skew>` sind die Default-Werte und sie kann nur :ref:`scale <class_Transform2D_method_get_scale>` als Nicht-Default-Wert haben.

source: **Window transform**
de: **Fenstertransformation**

source: In order to scale and position the *Window's* content as described in :ref:`doc_multiple_resolutions`, each :ref:`Window <class_Window>` contains a *window transform*. It is for example responsible for the black bars at the *Window's* sides so that the *Viewport* is displayed with a fixed aspect ratio.
de: Um den Inhalt des *Fensters* wie in :ref:`doc_multiple_resolutions` beschrieben zu skalieren und zu positionieren, enthält jedes :ref:`Fenster <class_Window>` eine *Fenstertransformation*. Sie ist z.B. für die schwarzen Balken an den Seiten des *Fensters* verantwortlich, damit der *Viewport* mit einem festen Seitenverhältnis dargestellt wird.

source: **Window position**
de: **Fensterposition**

source: Every *Window* also has a :ref:`position <class_Window_property_position>` to describe its position within its embedder. The embedder can be another *Viewport* or the OS Window Manager.
de: Jedes *Fenster* hat auch eine :ref:`position <class_Window_property_position>`-Property, um seine Position innerhalb seines Embedders zu beschreiben. Die Einbettungsstelle kann ein anderer *Viewport* oder der OS Window Manager sein.

source: **SubViewportContainer shrink transform**
de: **SubViewportContainer Shrink-Transformation**

source: :ref:`stretch <class_SubViewportContainer_property_stretch>` together with :ref:`stretch_shrink <class_SubViewportContainer_property_stretch_shrink>` declare for a *SubViewportContaner* if and by what integer factor the contained *SubViewport* should be scaled in comparison to the container's size.
de: Die :ref:`stretch <class_SubViewportContainer_property_stretch>`-Property zusammen mit der :ref:`stretch_shrink <class_SubViewportContainer_property_stretch_shrink>`-Property deklarieren für einen *SubViewportContaner*, ob und um welchen Integer-Faktor das enthaltene *SubViewport* im Vergleich zur Containergröße skaliert werden soll.

source: Translation status
de: Übersetzungsstatus
