Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/common_engine_methods_and_macros.po
Languages: de

source: Common engine methods and macros
de: Gängige Engine-Methoden und Makros

source: Godot's C++ codebase makes use of dozens of custom methods and macros which are used in almost every file. This page is geared towards beginner contributors, but it can also be useful for those writing custom C++ modules.
de: Die C++-Codebasis von Godot verwendet Dutzende von benutzerdefinierten Methoden und Makros, die in fast jeder Datei verwendet werden. Diese Seite richtet sich an Anfänger, kann aber auch für diejenigen nützlich sein, die benutzerdefinierte C++-Module schreiben.

source: Print text
de: Text ausgeben

source: If you need to add placeholders in your messages, use format strings as described below.
de: Wenn Sie Ihren Nachrichten Platzhalter hinzufügen müssen, verwenden Sie Format-Strings wie unten beschrieben.

source: Format a string
de: Formatieren eines Strings

source: The ``vformat()`` function returns a formatted :ref:`class_String`. It behaves in a way similar to C's ``sprintf()``:
de: Die Funktion ``vformat ()`` gibt einen formatierten :ref:`class_String` zurück. Sie verhält sich ähnlich wie ``sprintf()`` in C:

source: In most cases, try to use ``vformat()`` instead of string concatenation as it makes for more readable code.
de: Versuchen Sie in den meisten Fällen, ``vformat()`` anstelle der String-Konkatenation zu verwenden, da dies zu besser lesbarem Code führt.

source: Convert an integer or float to a string
de: Konvertiert eine Integer- oder eine Float-Zahl in einen String

source: This is not needed when printing numbers using ``print_line()``, but you may still need to perform manual conversion for some other use cases.
de: Dies ist nicht notwendig, wenn man Zahlen mit ``print_line()`` ausgibt, aber für einige andere Anwendungsfälle kann es notwendig sein, eine manuelle Konvertierung durchzuführen.

source: Internationalize a string
de: Internationalisieren eines Strings

source: There are two types of internationalization in Godot's codebase:
de: Es gibt zwei Arten der Internationalisierung in Godots Codebasis:

source: ``TTR()``: **Editor ("tools") translations** will only be processed in the editor. If a user uses the same text in one of their projects, it won't be translated if they provide a translation for it. When contributing to the engine, this is generally the macro you should use for localizable strings.
de: ``TTR()``: **Editor-Übersetzungen** werden nur im Editor verarbeitet. Wenn ein Benutzer denselben Text in einem seiner Projekte verwendet, wird er nicht übersetzt, obwohl er eine Übersetzung dafür bereitstellt. Wenn Sie zur Engine beitragen, ist dies im Allgemeinen das Makro, das Sie für lokalisierbare Strings verwenden sollten.

source: ``RTR()``: **Run-time translations** will be automatically localized in projects if they provide a translation for the given string. This kind of translation shouldn't be used in editor-only code.
de: ``RTR()``: **Laufzeitübersetzungen** werden in Projekten automatisch übersetzt, wenn sie eine Übersetzung für den angegebene String bereitstellen. Diese Art der Übersetzung sollte nicht im Code verwendet werden, der nur im Editor vorkommt.

source: To insert placeholders in localizable strings, wrap the localization macro in a ``vformat()`` call as follows:
de: Um Platzhalter in lokalisierbare Strings einzufügen, schließen Sie das Lokalisierungsmakro wie folgt in einen ``vformat()``-Aufruf ein:

source: When using ``vformat()`` and a translation macro together, always wrap the translation macro in ``vformat()``, not the other way around. Otherwise, the string will never match the translation as it will have the placeholder already replaced when it's passed to TranslationServer.
de: Wenn Sie ``vformat()`` und ein Übersetzungsmakro zusammen verwenden, sollten Sie das Übersetzungsmakro immer in ``vformat()`` wrappen, nicht umgekehrt. Andernfalls wird der String niemals mit der Übersetzung übereinstimmen, da der Platzhalter bereits ersetzt ist, wenn er an TranslationServer übergeben wird.

source: Clamp a value
de: Einen Wert begrenzen

source: Godot provides macros for clamping a value with a lower bound (``MAX``), an upper bound (``MIN``) or both (``CLAMP``):
de: Godot bietet Makros zum Begrenzen eines Werts mit einer Untergrenze (``MAX``), einer Obergrenze (``MIN``) oder beiden (``CLAMP``):

source: This works with any type that can be compared to other values (like ``int`` and ``float``).
de: Dies funktioniert mit jedem Typ, der mit anderen Werten verglichen werden kann (wie ``int`` und ``float``).

source: Microbenchmarking
de: Mikrobenchmarking

source: If you want to benchmark a piece of code but don't know how to use a profiler, use this snippet:
de: Wenn Sie einen Code benchmarken möchten, aber nicht wissen wie man einen Profiler verwendet, benutzen Sie diesen Schnipsel:

source: This will print the time spent between the ``begin`` declaration and the ``end`` declaration.
de: Dies gibt die Zeit zwischen der ``begin`` und ``end``-Deklaration aus.

source: You may have to ``#include "core/os/os.h"`` if it's not present already.
de: Möglicherweise müssen Sie ``#include "core/os/os.h"`` einbinden, wenn es nicht bereits vorhanden ist.

source: When opening a pull request, make sure to remove this snippet as well as the include if it wasn't there previously.
de: Stellen Sie beim Öffnen eines Pull-Requests sicher, dass Sie dieses Snippet sowie das Include entfernen, falls es vorher nicht vorhanden war.

source: Get project/editor settings
de: Zugriff auf Projekt-/Editoreinstellungen

source: There are four macros available for this:
de: Hierfür stehen vier Makros zur Verfügung:

source: If a default value has been specified elsewhere, don't specify it again to avoid repetition:
de: Wenn an anderer Stelle ein Default-Wert angegeben wurde, geben Sie ihn nicht erneut an, um Wiederholungen zu vermeiden:

source: It's recommended to use ``GLOBAL_DEF``/``EDITOR_DEF`` only once per setting and use ``GLOBAL_GET``/``EDITOR_GET`` in all other places where it's referenced.
de: Es wird empfohlen, ``GLOBAL_DEF``/``EDITOR_DEF`` nur einmal pro Einstellung zu verwenden und ``GLOBAL_GET``/``EDITOR_GET`` an allen anderen Stellen zu verwenden, auf die verwiesen wird.

source: Error macros
de: Fehlermakros

source: Godot features many error macros to make error reporting more convenient.
de: Godot bietet viele Fehlermakros, um die Fehlerberichterstattung komfortabler zu gestalten.

source: Conditions in error macros work in the **opposite** way of GDScript's built-in ``assert()`` function. An error is reached if the condition inside evaluates to ``true``, not ``false``.
de: Bedingungen in Fehlermakros funktionieren in **entgegengesetzter** Weise wie die in GDScript integrierte Funktion ``assert()``. Ein Fehler wird ausgelöst, wenn die Bedingung darin ``wahr`` und nicht ``falsch`` ergibt.

source: Only variants with custom messages are documented here, as these should always be used in new contributions. Make sure the custom message provided includes enough information for people to diagnose the issue, even if they don't know C++. In case a method was passed invalid arguments, you can print the invalid value in question to ease debugging.
de: Hier werden nur Varianten mit benutzerdefinierten Nachrichten dokumentiert, da diese immer in neuen Beiträgen verwendet werden sollten. Stellen Sie sicher, dass die bereitgestellte benutzerdefinierte Nachricht genügend Informationen enthält, damit Benutzer das Problem diagnostizieren können, auch wenn sie C++ nicht kennen. Falls einer Methode ungültige Argumente übergeben wurden, können Sie den betreffenden ungültigen Wert anzeigen, um das Debuggen zu vereinfachen.

source: For internal error checking where displaying a human-readable message isn't necessary, remove ``_MSG`` at the end of the macro name and don't supply a message argument.
de: Entfernen Sie für interne Fehlerprüfungen, bei denen die Anzeige einer für Menschen lesbaren Nachricht nicht erforderlich ist, ``_MSG`` am Ende des Makronamens und geben Sie kein Nachrichtenargument an.

source: Also, always try to return processable data so the engine can keep running well.
de: Versuchen Sie außerdem immer, verarbeitbare Daten zurückzugeben, damit die Engine weiterhin einwandfrei laufen kann.

source: See `core/error/error_macros.h <https://github.com/godotengine/godot/blob/master/core/error/error_macros.h>`__ in Godot's codebase for more information about each error macro.
de: Siehe `core/error/error_macros.h <https://github.com/godotengine/godot/blob/master/core/error/error_macros.h>`__ in der Codebasis von Godot für weitere Informationen über jedes Fehlermakro.

source: Some functions return an error code (materialized by a return type of ``Error``). This value can be returned directly from an error macro. See the list of available error codes in `core/error/error_list.h <https://github.com/godotengine/godot/blob/master/core/error/error_list.h>`__.
de: Einige Funktionen geben einen Fehlercode zurück (der sich durch einen Rückgabetyp von ``Error`` zeigt). Dieser Wert kann direkt von einem Fehlermakro zurückgegeben werden. Siehe die Liste der verfügbaren Fehlercodes in `core/error/error_list.h <https://github.com/godotengine/godot/blob/master/core/error/error_list.h>`__.

source: Translation status
de: Übersetzungsstatus
