Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_modules_*_cpp.po
Languages: de

source: Custom modules in C++
de: Benutzerdefinierte Module in C++

source: Modules
de: Module

source: Godot allows extending the engine in a modular way. New modules can be created and then enabled/disabled. This allows for adding new engine functionality at every level without modifying the core, which can be split for use and reuse in different modules.
de: Godot ermöglicht das modularen Erweitern der Engine. Neue Module können erstellt und dann aktiviert bzw. deaktiviert werden. Dies ermöglicht das Hinzufügen neuer Enginefunktionen auf jeder Ebene, ohne den Kern zu ändern, die zur Verwendung und Wiederverwendung in verschiedenen Modulen aufgeteilt werden können.

source: Modules are located in the ``modules/`` subdirectory of the build system. By default, dozens of modules are enabled, such as GDScript (which, yes, is not part of the base engine), the Mono runtime, a regular expressions module, and others. As many new modules as desired can be created and combined. The SCons build system will take care of it transparently.
de: Module befinden sich im Unterverzeichnis ``modules/`` des Buildsystems. Standardmäßig sind Dutzende von Modulen aktiviert, z.B. GDScript (das ja nicht Teil der Basis-Engine ist), die Mono-Runtime, ein Modul für reguläre Ausdrücke und andere. Es können beliebig viele neue Module erstellt und kombiniert werden. Das SCons-Buildsystem kümmert sich transparent darum.

source: What for?
de: Wofür?

source: While it's recommended that most of a game be written in scripting (as it is an enormous time saver), it's perfectly possible to use C++ instead. Adding C++ modules can be useful in the following scenarios:
de: Es wird zwar empfohlen, den größten Teil eines Spiels in Skripten zu schreiben (da dies eine enorme Zeitersparnis bedeutet), es ist jedoch durchaus möglich, stattdessen C++ zu verwenden. Das Hinzufügen von C++-Modulen kann in den folgenden Szenarien hilfreich sein:

source: Binding an external library to Godot (like PhysX, FMOD, etc).
de: Binden einer externen Bibliothek an Godot (wie PhysX, FMOD usw.).

source: Optimize critical parts of a game.
de: Optimieren kritischer Teile eines Spiels.

source: Adding new functionality to the engine and/or editor.
de: Hinzufügen neuer Funktionen zur Engine oder zum Editor.

source: Porting an existing game to Godot.
de: Portierung eines bestehenden Spiels nach Godot.

source: Write a whole, new game in C++ because you can't live without C++.
de: Schreiben eines ganz neuen Spiels in C++, weil Sie ohne C++ nicht leben können.

source: Creating a new module
de: Neues Modul erstellen

source: Before creating a module, make sure to :ref:`download the source code of Godot and compile it <toc-devel-compiling>`.
de: Bevor Sie ein Modul erstellen, :ref:`laden Sie den Quellcode von Godot herunter und kompilieren Sie ihn <toc-devel-compiling>`.

source: To create a new module, the first step is creating a directory inside ``modules/``. If you want to maintain the module separately, you can checkout a different VCS into modules and use it.
de: Um ein neues Modul zu erstellen, müssen Sie zunächst ein Verzeichnis in ``modules/`` erstellen. Wenn Sie das Modul separat warten möchten, können Sie ein anderes Repository in Module auschecken und verwenden.

source: The example module will be called "summator" (``godot/modules/summator``). Inside we will create a summator class:
de: Das Beispielmodul wird "summator" heißen (``godot/modules/summator``). Darin werden wir eine Summierer-Klasse erstellen:

source: And then the cpp file.
de: Und hier die cpp Datei.

source: Then, the new class needs to be registered somehow, so two more files need to be created:
de: Dann muss die neue Klasse irgendwie registriert werden, sodass zwei weitere Dateien erstellt werden müssen:

source: These files must be in the top-level folder of your module (next to your ``SCsub`` and ``config.py`` files) for the module to be registered properly.
de: Diese Dateien müssen sich im obersten Ordner Ihres Moduls befinden (neben Ihren Dateien ``SCsub`` und ``config.py``), damit das Modul ordnungsgemäß registriert werden kann.

source: These files should contain the following:
de: Diese Dateien sollten Folgendes enthalten:

source: Next, we need to create a ``SCsub`` file so the build system compiles this module:
de: Als nächstes müssen wir eine ``SCsub`` Datei erstellen, damit das Buildsystem dieses Modul kompiliert:

source: With multiple sources, you can also add each file individually to a Python string list:
de: Bei mehreren Quellen können Sie jede Datei auch einzeln zu einer Python-String-Liste hinzufügen:

source: This allows for powerful possibilities using Python to construct the file list using loops and logic statements. Look at some modules that ship with Godot by default for examples.
de: Dies erlaubt leistungsstarke Möglichkeiten mit Python, die Dateiliste mithilfe von Schleifen und logischen Anweisungen zu erstellen. Schauen Sie sich einige der Module an, die standardmäßig mit Godot geliefert werden.

source: To add include directories for the compiler to look at you can append it to the environment's paths:
de: Um Include-Verzeichnisse hinzuzufügen, die der Compiler anzeigen kann, können Sie sie an die Pfade der Umgebungvariable anhängen:

source: If you want to add custom compiler flags when building your module, you need to clone ``env`` first, so it won't add those flags to whole Godot build (which can cause errors). Example ``SCsub`` with custom flags:
de: Wenn Sie beim Bauen Ihres Moduls eigene Compilerflags hinzufügen wollen, müssen Sie zuerst ``env`` klonen, damit diese Flags nicht zum gesamten Godot-Build hinzugefügt werden (was zu Fehlern führen kann). Beispiel ``SCsub`` mit eigenen Flags:

source: And finally, the configuration file for the module, this is a Python script that must be named ``config.py``:
de: Und schließlich die Konfigurationsdatei für das Modul, ein Python-Skript, das den Namen ``config.py`` tragen muss:

source: The module is asked if it's OK to build for the specific platform (in this case, ``True`` means it will build for every platform).
de: Das Modul wird gefragt, ob es für die jeweilige Plattform in Ordnung ist, zu bauen (in diesem Fall bedeutet ``True``, dass es für jede Plattform erstellt wird).

source: And that's it. Hope it was not too complex! Your module should look like this:
de: Und das war's, hoffentlich war es nicht zu komplex. Ihr Modul sollte folgendermaßen aussehen:

source: You can then zip it and share the module with everyone else. When building for every platform (instructions in the previous sections), your module will be included.
de: Sie können es dann zippen und das Modul mit allen anderen teilen. Beim Erstellen für jede Plattform (Anweisungen in den vorherigen Abschnitten) wird Ihr Modul einbezogen.

source: There is a parameter limit of 5 in C++ modules for things such as subclasses. This can be raised to 13 by including the header file ``core/method_bind_ext.gen.inc``.
de: In C++-Modulen gibt es eine Parametergrenze von 5 für Dinge wie Unterklassen. Dies kann durch Einfügen der Header-Datei ``core/method_bind_ext.gen.inc`` auf 13 erhöht werden.

source: Using the module
de: Das Modul verwenden

source: You can now use your newly created module from any script:
de: Sie können Ihr neu erstelltes Modul jetzt in jedem Skript verwenden:

source: The output will be ``60``.
de: Die Ausgabe wird ``60`` sein.

source: The previous Summator example is great for small, custom modules, but what if you want to use a larger, external library? Refer to :ref:`doc_binding_to_external_libraries` for details about binding to external libraries.
de: Das vorherige Summator-Beispiel eignet sich hervorragend für kleine, benutzerdefinierte Module. Was ist jedoch, wenn Sie eine größere externe Bibliothek verwenden möchten? Weitere Informationen zum Binden an externe Bibliotheken finden Sie unter :ref:`doc_binding_to_external_libraries`.

source: If your module is meant to be accessed from the running project (not just from the editor), you must also recompile every export template you plan to use, then specify the path to the custom template in each export preset. Otherwise, you'll get errors when running the project as the module isn't compiled in the export template. See the :ref:`Compiling <toc-devel-compiling>` pages for more information.
de: Wenn auf Ihr Modul vom laufenden Projekt aus zugegriffen werden soll (nicht nur vom Editor), müssen Sie auch jede Exportvorlage, die Sie verwenden möchten, neu kompilieren und dann in jeder Exportvoreinstellung den Pfad zur benutzerdefinierten Vorlage angeben. Andernfalls werden beim Ausführen des Projekts Fehler angezeigt, da das Modul nicht in der Exportvorlage kompiliert ist. Weitere Informationen finden Sie auf den Seiten :ref:`Kompilieren <toc-devel-compiling>`.

source: Compiling a module externally
de: Ein Modul extern kompilieren

source: Compiling a module involves moving the module's sources directly under the engine's ``modules/`` directory. While this is the most straightforward way to compile a module, there are a couple of reasons as to why this might not be a practical thing to do:
de: Beim Kompilieren eines Moduls wird der Quellcode des Moduls direkt in das Verzeichnis ``modules/`` der Engine verschoben. Dies ist zwar die einfachste Methode zum Kompilieren eines Moduls, es gibt jedoch mehrere Gründe, warum dies möglicherweise nicht praktikabel ist:

source: Having to manually copy modules sources every time you want to compile the engine with or without the module, or taking additional steps needed to manually disable a module during compilation with a build option similar to ``module_summator_enabled=no``. Creating symbolic links may also be a solution, but you may additionally need to overcome OS restrictions like needing the symbolic link privilege if doing this via script.
de: Sie müssen Modul-Quellcode jedes Mal manuell kopieren, wenn Sie die Engine mit oder ohne Modul kompilieren möchten, oder zusätzliche Schritte ausführen, um ein Modul während der Kompilierung mit einer Erstellungsoption ähnlich ``module_summator_enabled = no`` manuell zu deaktivieren. Das Erstellen symbolischer Links kann ebenfalls eine Lösung sein. Möglicherweise müssen Sie jedoch zusätzlich Betriebssystembeschränkungen überwinden, z.B. die Berechtigung für symbolische Links, wenn Sie dies über ein Skript tun.

source: Depending on whether you have to work with the engine's source code, the module files added directly to ``modules/`` changes the working tree to the point where using a VCS (like ``git``) proves to be cumbersome as you need to make sure that only the engine-related code is committed by filtering changes.
de: Abhängig davon, ob Sie mit dem Quellcode der Engine arbeiten müssen, ändern die direkt zu ``modules/`` hinzugefügten Moduldateien den Arbeitsbaum so weit, dass sich die Verwendung eines VCS (wie ``git``) als umständlich erweist, denn Sie müssen sicherstellen, dass nur der Code mit Bezug auf die Engine durch Filtern von Änderungen committed wird.

source: So if you feel like the independent structure of custom modules is needed, lets take our "summator" module and move it to the engine's parent directory:
de: Wenn Sie also der Meinung sind, dass die unabhängige Struktur benutzerdefinierter Module benötigt wird, nehmen Sie unser "Summator"-Modul und verschieben Sie es in das übergeordnete Verzeichnis der Engine:

source: Compile the engine with our module by providing ``custom_modules`` build option which accepts a comma-separated list of directory paths containing custom C++ modules, similar to the following:
de: Kompilieren Sie die Engine mit unserem Modul, indem Sie die Build-Option ``custom_modules`` bereitstellen, die eine durch Kommas getrennte Liste von Verzeichnispfaden akzeptiert, die benutzerdefinierte C++-Module enthalten, ähnlich wie im Folgenden:

source: The build system shall detect all modules under the ``../modules`` directory and compile them accordingly, including our "summator" module.
de: Das Buildsystem erkennt alle Module im Verzeichnis ``../modules`` und kompiliert sie entsprechend, einschließlich unseres "Summator" -Moduls.

source: Any path passed to ``custom_modules`` will be converted to an absolute path internally as a way to distinguish between custom and built-in modules. It means that things like generating module documentation may rely on a specific path structure on your machine.
de: Jeder an ``custom_modules`` übergebene Pfad wird intern in einen absoluten Pfad konvertiert, um zwischen benutzerdefinierten und integrierten Modulen zu unterscheiden. Dies bedeutet, dass Dinge wie das Generieren der Moduldokumentation möglicherweise von einer bestimmten Pfadstruktur auf Ihrem Computer abhängen.

source: :ref:`Introduction to the buildsystem - Custom modules build option <doc_buildsystem_custom_modules>`.
de: :ref:`Einführung in das Buildsystem - Build-Option für benutzerdefinierte Module <doc_buildsystem_custom_modules>`.

source: Customizing module types initialization
de: Initialisierung der Modultypen anpassen

source: Modules can interact with other built-in engine classes during runtime and even affect the way core types are initialized. So far, we've been using ``register_summator_types`` as a way to bring in module classes to be available within the engine.
de: Module können während der Laufzeit mit anderen Built-in Engine-Klassen interagieren und sogar die Art und Weise beeinflussen, wie Core-Typen initialisiert werden. Bisher haben wir ``register_summator_types`` verwendet, um Modulklassen in der Engine verfügbar zu machen.

source: A crude order of the engine setup can be summarized as a list of the following type registration methods:
de: Eine grobe Reihenfolge der Engine-Einstellung kann als Liste der folgenden Typregistrierungsmethoden zusammengefasst werden:

source: Our ``Summator`` class is initialized during the ``register_module_types()`` call. Imagine that we need to satisfy some common module run-time dependency (like singletons), or allow us to override existing engine method callbacks before they can be assigned by the engine itself. In that case, we want to ensure that our module classes are registered *before* any other built-in type.
de: Unsere ``Summator``-Klasse wird während des ``register_module_types()``-Aufrufs initialisiert. Stellen Sie sich vor, dass wir eine allgemeine Modul-Laufzeit-Abhängigkeit erfüllen müssen (wie Singletons), oder dass wir bestehende Methoden-Callbacks der Engine überschreiben müssen, bevor sie von der Engine selbst zugewiesen werden können. In diesem Fall wollen wir sicherstellen, dass unsere Modulklassen *vor* jedem anderen Built-in-Typ registriert werden.

source: This is where we can define an optional ``preregister_summator_types()`` method which will be called before anything else during the ``preregister_module_types()`` engine setup stage.
de: Hier können wir eine optionale ``preregister_summator_types()``-Methode definieren, die während der ``preregister_module_types()``-Einrichtungsphase der Engine vor allem anderen aufgerufen wird.

source: We now need to add this method to ``register_types`` header and source files:
de: Wir müssen nun diese Methode in die ``register_types``-Header- und Quelldateien einfügen:

source: Unlike other register methods, we have to explicitly define ``MODULE_SUMMATOR_HAS_PREREGISTER`` to let the build system know what relevant method calls to include at compile time. The module's name has to be converted to uppercase as well.
de: Im Gegensatz zu anderen Register-Methoden müssen wir ``MODULE_SUMMATOR_HAS_PREREGISTER`` explizit definieren, um dem Buildsystem mitzuteilen, welche relevanten Methodenaufrufe es zur Kompilierzeit einbinden soll. Der Name des Moduls muss ebenfalls in Großbuchstaben umgewandelt werden.

source: Improving the build system for development
de: Verbesserung des Buildsystems für die Entwicklung

source: This shared library support is not designed to support distributing a module to other users without recompiling the engine. For that purpose, use a GDExtension instead.
de: Diese Unterstützung für gemeinsam genutzte Bibliotheken ist nicht dafür gedacht, ein Modul an andere Benutzer weiterzugeben, ohne die Engine neu zu kompilieren. Verwenden Sie zu diesem Zweck stattdessen eine GDExtension.

source: So far, we defined a clean SCsub that allows us to add the sources of our new module as part of the Godot binary.
de: Bisher haben wir eine saubere SCsub definiert, die es uns ermöglicht, die Quellen unseres neuen Moduls als Teil der Godot-Binärdatei hinzuzufügen.

source: This static approach is fine when we want to build a release version of our game, given we want all the modules in a single binary.
de: Dieser statische Ansatz ist gut, wenn wir eine Release-Version unseres Spiels erstellen wollen, da wir alle Module in einer einzigen Binärdatei haben wollen.

source: However, the trade-off is that every single change requires a full recompilation of the game. Even though SCons is able to detect and recompile only the file that was changed, finding such files and eventually linking the final binary takes a long time.
de: Der Nachteil ist jedoch, dass jede einzelne Änderung eine vollständige Neukompilierung des Spiels erfordert. Auch wenn SCons in der Lage ist, nur die geänderte Datei zu erkennen und neu zu kompilieren, dauert es lange, solche Dateien zu finden und schließlich die endgültige Binärdatei zu linken.

source: The solution to avoid such a cost is to build our own module as a shared library that will be dynamically loaded when starting our game's binary.
de: Die Lösung, um solche Kosten zu vermeiden, besteht darin, ein eigenes Modul als Shared Library zu erstellen, die beim Starten der Binärdatei unseres Spiels dynamisch geladen wird.

source: Once compiled, we should end up with a ``bin`` directory containing both the ``godot*`` binary and our ``libsummator*.so``. However given the .so is not in a standard directory (like ``/usr/lib``), we have to help our binary find it during runtime with the ``LD_LIBRARY_PATH`` environment variable:
de: Einmal kompiliert, sollten wir ein ``bin`` Verzeichnis haben, das sowohl die ``godot*``-Binärdatei als auch unseren ``libsummator*.so`` enthält. Da sich die .so jedoch nicht in einem Standardverzeichnis befindet (wie ``/usr/lib``), müssen wir unserer Binärdatei helfen, sie zur Laufzeit mit der Umgebungsvariablen ``LD_LIBRARY_PATH`` zu finden:

source: You have to ``export`` the environment variable. Otherwise, you won't be able to run your project from the editor.
de: Sie müssen die Umgebungsvariable ``exportieren``. Andernfalls werden Sie nicht in der Lage sein, Ihr Projekt mit dem Editor zu starten.

source: On top of that, it would be nice to be able to select whether to compile our module as shared library (for development) or as a part of the Godot binary (for release). To do that we can define a custom flag to be passed to SCons using the ``ARGUMENT`` command:
de: Darüber hinaus wäre es schön, wenn wir auswählen könnten, ob unser Modul als Shared Library (für die Entwicklung) oder als Teil der Godot-Binärdatei (für die Veröffentlichung) kompiliert werden soll. Um dies zu tun, können wir ein eigenes Flag definieren, das mit dem Befehl ``ARGUMENT`` an SCons übergeben wird:

source: Now by default ``scons`` command will build our module as part of Godot's binary and as a shared library when passing ``summator_shared=yes``.
de: Standardmäßig erstellt der Befehl ``scons`` unser Modul als Teil von Godots Binärdatei und als gemeinsam genutzte Bibliothek, wenn ``summator_shared = yes`` übergeben wird.

source: Finally, you can even speed up the build further by explicitly specifying your shared module as target in the SCons command:
de: Schließlich können Sie den Build sogar noch weiter beschleunigen, indem Sie Ihr freigegebenes Modul im Befehl SCons explizit als Target angeben:

source: Writing custom documentation
de: Benutzerdefinierte Dokumentation schreiben

source: Writing documentation may seem like a boring task, but it is highly recommended to document your newly created module to make it easier for users to benefit from it. Not to mention that the code you've written one year ago may become indistinguishable from the code that was written by someone else, so be kind to your future self!
de: Das Schreiben von Dokumentation mag wie eine langweilige Aufgabe erscheinen, aber es wird dringend empfohlen, Ihr neu erstelltes Modul zu dokumentieren, damit die Benutzer es leichter nutzen können. Ganz zu schweigen davon, dass der Code, den Sie vor einem Jahr geschrieben haben, möglicherweise nicht mehr von dem Code zu unterscheiden ist, den jemand anderes geschrieben hat - seien Sie also nett zu Ihrem zukünftigen Ich!

source: There are several steps in order to setup custom docs for the module:
de: Es gibt mehrere Schritte, um benutzerdefinierte Dokumente für das Modul einzurichten:

source: Make a new directory in the root of the module. The directory name can be anything, but we'll be using the ``doc_classes`` name throughout this section.
de: Erstellen Sie ein neues Verzeichnis im Stammverzeichnis des Moduls. Der Verzeichnisname kann beliebig sein, aber wir werden in diesem Abschnitt den Namen ``doc_classes`` verwenden.

source: Now, we need to edit ``config.py``, add the following snippet:
de: Jetzt müssen wir ``config.py`` bearbeiten und den folgenden Schnipsel hinzufügen:

source: The ``get_doc_path()`` function is used by the build system to determine the location of the docs. In this case, they will be located in the ``modules/summator/doc_classes`` directory. If you don't define this, the doc path for your module will fall back to the main ``doc/classes`` directory.
de: Die Funktion ``get_doc_path()`` wird vom Buildsystem verwendet, um den Speicherort der Dokumente zu bestimmen. In diesem Fall befinden sie sich im Verzeichnis ``modules/summator/doc_classes``. Wenn Sie dies nicht definieren, wird der Dokumentpfad für Ihr Modul auf das Hauptverzeichnis ``doc/classes`` zurückgesetzt.

source: The ``get_doc_classes()`` method is necessary for the build system to know which registered classes belong to the module. You need to list all of your classes here. The classes that you don't list will end up in the main ``doc/classes`` directory.
de: Die Methode ``get_doc_classes()`` ist erforderlich, damit das Buildsystem weiß, welche registrierten Klassen zum Modul gehören. Sie müssen alle Ihre Klassen hier auflisten. Die Klassen, die Sie nicht auflisten, landen im Hauptverzeichnis ``doc/classes``.

source: You can use Git to check if you have missed some of your classes by checking the untracked files with ``git status``. For example::
de: Sie können Git verwenden, um zu überprüfen, ob Sie einige Ihrer Klassen übersehen haben, indem Sie die nicht getrackten Dateien mit ``git status`` überprüfen. Zum Beispiel::

source: Example output::
de: Beispielausgabe::

source: Now we can generate the documentation:
de: Jetzt können wir die Dokumentation erstellen:

source: We can do this via running Godot's doctool i.e. ``godot --doctool <path>``, which will dump the engine API reference to the given ``<path>`` in XML format.
de: Wir können dies tun, indem wir Godots doctool ausführen, d.h. ``godot --doctool <Pfad>``, wodurch die Engine-API-Referenz auf den angegebenen ``<Pfad>`` im XML-Format ausgegeben wird.

source: In our case we'll point it to the root of the cloned repository. You can point it to an another folder, and just copy over the files that you need.
de: In unserem Fall verweisen wir auf das Stammverzeichnis des geklonten Repositorys. Sie können es auf einen anderen Ordner verweisen lassen und einfach die benötigten Dateien kopieren.

source: Run command:
de: Führen Sie den Befehl aus:
