Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_platform_ports.po
Languages: de, zh_tw

source: Before distributing a custom platform port, make sure you're allowed to distribute all the code that is being linked against. Console SDKs are typically under NDAs which prevent redistribution to the public.
de: Stellen Sie vor der Veröffentlichung einer benutzerdefinierten Plattform-Portierung sicher, dass Sie den gesamten Code, gegen den gelinkt wird, veröffentlichen dürfen. Konsolen-SDKs stehen in der Regel unter NDAs, die eine Veröffentlichung an die Öffentlichkeit verhindern.
zh_tw: 在分發自訂平台連接埠之前，請確保您有權分發所連結的所有程式碼。控制台 SDK 通常處於保密協議 (NDA) 之下，這會阻止向公眾重新分發。

source: Platform ports are designed to be as self-contained as possible. Most of the code can be kept within a single folder located in ``platform/``. Like :ref:`doc_custom_modules_in_cpp`, this allows for streamlining the build process by making it possible to ``git clone`` a platform folder within a Godot repository clone's ``platform/`` folder, then run ``scons platform=<name>``. No other steps are necessary for building, unless third-party platform-specific dependencies need to be installed first.
de: Plattform-Ports sind so konzipiert, dass sie so eigenständig wie möglich sind. Der Großteil des Codes kann in einem einzigen Ordner in ``platform/`` untergebracht werden. Wie :ref:`doc_custom_modules_in_cpp` ermöglicht dies eine Rationalisierung des Build-Prozesses, indem es möglich ist, per ``git clone`` einen Plattform-Ordner innerhalb des ``platform/``-Ordners eines Godot-Repository-Klons zu erstellen und dann ``scons platform=<name>`` auszuführen. Für die Erstellung sind keine weiteren Schritte erforderlich, es sei denn, plattformspezifische Abhängigkeiten von Drittanbietern müssen zuerst installiert werden.
zh_tw: 平台連接埠被設計為盡可能獨立。大多數程式碼可以保存在“platform/”中的單一資料夾中。與 doc_custom_modules_in_cpp 一樣，這可以透過在 Godot 儲存庫克隆的 platform/ 資料夾中「git clone」平台資料夾來簡化建置過程，然後執行 scons platform=<名稱>``。建置不需要其他步驟，除非需要先安裝第三方平台特定的依賴項。

source: However, when a custom rendering backend is needed, another folder must be added in ``drivers/``. In this case, the platform port can be distributed as a fork of the Godot repository, or as a collection of several folders that can be added over a Godot Git repository clone.
de: Wenn jedoch ein benutzerdefiniertes Rendering-Backend benötigt wird, muss ein weiterer Ordner in ``drivers/`` hinzugefügt werden. In diesem Fall kann die Plattform-Portierung als Fork des Godot-Repositorys oder als eine Sammlung mehrerer Ordner veröffentlichen werden, die über einen Godot-Git-Repository-Klon hinzugefügt werden können.
zh_tw: 但是，當需要自訂算繪後端時，必須在「drivers/」中新增另一個資料夾。在這種情況下，平台連接埠可以作為 Godot 儲存庫的分支進行分發，或者作為可以透過 Godot Git 儲存庫克隆新增的多個資料夾的集合進行分發。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
