Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_modules_*_cpp.po
Languages: de

source: Now if you go to the ``godot/modules/summator/doc_classes`` folder, you will see that it contains a ``Summator.xml`` file, or any other classes, that you referenced in your ``get_doc_classes`` function.
de: Wenn Sie nun zum Ordner ``godot/modules/summator/doc_classes`` gehen, werden Sie sehen, dass er eine ``Summator.xml``-Datei oder andere Klassen enthält, auf die Sie in Ihren ``get_doc_classes`` Funktion verwiesen haben.

source: Edit the file(s) following :ref:`doc_class_reference_primer` and recompile the engine.
de: Bearbeiten Sie die Datei(en) gemäß :ref:`doc_class_reference_primer` und kompilieren Sie die Engine neu.

source: Once the compilation process is finished, the docs will become accessible within the engine's built-in documentation system.
de: Sobald der Kompilierungsprozess abgeschlossen ist, können Sie auf die Dokumente im integrierten Dokumentationssystem der Engine zugreifen.

source: In order to keep documentation up-to-date, all you'll have to do is simply modify one of the XML files and recompile the engine from now on.
de: Um die Dokumentation auf dem neuesten Stand zu halten, müssen Sie lediglich eine der XML-Dateien ändern und die Engine von nun an neu kompilieren.

source: If you change your module's API, you can also re-extract the docs, they will contain the things that you previously added. Of course if you point it to your godot folder, make sure you don't lose work by extracting older docs from an older engine build on top of the newer ones.
de: Wenn Sie die API Ihres Moduls ändern, können Sie die Dokumente auch erneut extrahieren. Sie enthalten die zuvor hinzugefügten Elemente. Wenn Sie auf Ihren Godot-Ordner verweisen, stellen Sie sicher, dass Sie keine Arbeit verlieren, indem Sie ältere Dokumente aus einer älteren Engine extrahieren, die auf den neueren basiert.

source: Note that if you don't have write access rights to your supplied ``<path>``, you might encounter an error similar to the following:
de: Beachten Sie, dass möglicherweise ein Fehler auftritt, der dem folgenden ähnelt, wenn Sie keine Schreibzugriffsrechte für Ihren angegebenen ``<Pfad>`` haben:

source: Writing custom unit tests
de: Schreiben von benutzerdefinierten Unit-Tests

source: It's possible to write self-contained unit tests as part of a C++ module. If you are not familiar with the unit testing process in Godot yet, please refer to :ref:`doc_unit_testing`.
de: Es ist möglich, in sich geschlossene Unit-Tests als Teil eines C++-Moduls zu schreiben. Wenn Sie mit dem Unit-Testing-Prozess in Godot noch nicht vertraut sind, lesen Sie bitte :ref:`doc_unit_testing`.

source: The procedure is the following:
de: Das Verfahren ist wie folgt:

source: Create a new directory named ``tests/`` under your module's root:
de: Erstellen Sie ein neues Verzeichnis mit dem Namen ``tests/`` unter dem Stammverzeichnis Ihres Moduls:

source: Create a new test suite: ``test_summator.h``. The header must be prefixed with ``test_`` so that the build system can collect it and include it as part of the ``tests/test_main.cpp`` where the tests are run.
de: Erstellen Sie eine neue Testsuite: ``test_summator.h``. Der Header muss mit dem Präfix ``test_`` versehen werden, damit das Buildsystem ihn aufsammeln und als Teil der ``tests/test_main.cpp`` einbinden kann, in der die Tests ausgeführt werden.

source: Write some test cases. Here's an example:
de: Schreiben Sie einige Test-Cases. Hier ist ein Beispiel:

source: Compile the engine with ``scons tests=yes``, and run the tests with the following command:
de: Kompilieren Sie die Engine mit ``scons tests=yes``, und führen Sie die Tests mit dem folgenden Befehl aus:

source: You should see the passing assertions now.
de: Sie sollten jetzt die durchlaufenen Assertions sehen.

source: Adding custom editor icons
de: Hinzufügen von benutzerdefinierten Editor-Symbolen

source: Similarly to how you can write self-contained documentation within a module, you can also create your own custom icons for classes to appear in the editor.
de: Ähnlich wie Sie eine in sich geschlossene Dokumentation innerhalb eines Moduls schreiben, können Sie auch eigene benutzerdefinierte Icons erstellen, damit Klassen im Editor angezeigt werden.

source: For the actual process of creating editor icons to be integrated within the engine, please refer to :ref:`doc_editor_icons` first.
de: Informationen zum eigentlichen Erstellen von Editor-Icons für die Integration in die Engine finden Sie zuerst unter :ref:`doc_editor_icons`.

source: Once you've created your icon(s), proceed with the following steps:
de: Führen Sie die folgenden Schritte aus, nachdem Sie Ihre Icons erstellt haben:

source: Make a new directory in the root of the module named ``icons``. This is the default path for the engine to look for module's editor icons.
de: Erstellen Sie ein neues Verzeichnis im Stammverzeichnis des Moduls mit dem Namen ``icons``. Dies ist der Standardpfad für das Modul, um nach den Editor-Icons des Moduls zu suchen.

source: Move your newly created ``svg`` icons (optimized or not) into that folder.
de: Verschieben Sie Ihre neu erstellten ``svg``-Icons (optimiert oder nicht) in diesen Ordner.

source: Recompile the engine and run the editor. Now the icon(s) will appear in editor's interface where appropriate.
de: Kompilieren Sie die Engine neu und führen Sie den Editor aus. Jetzt werden die Icons gegebenenfalls in der Benutzeroberfläche des Editors angezeigt.

source: If you'd like to store your icons somewhere else within your module, add the following code snippet to ``config.py`` to override the default path:
de: Wenn Sie Ihre Icons an einer anderen Stelle in Ihrem Modul speichern möchten, fügen Sie den folgenden Codeausschnitt zu ``config.py`` hinzu, um den Standardpfad zu überschreiben:

source: Summing up
de: Zum Abschluss

source: Remember to:
de: Nicht vergessen:

source: Use ``GDCLASS`` macro for inheritance, so Godot can wrap it.
de: Verwenden Sie das Makro ``GDCLASS`` für die Vererbung, damit Godot es einschließen kann.

source: Use ``_bind_methods`` to bind your functions to scripting, and to allow them to work as callbacks for signals.
de: Verwenden Sie ``_bind_methods``, um Ihre Funktionen an Skripte zu binden, damit sie als Callbacks für Signale arbeiten können.

source: **Avoid multiple inheritance for classes exposed to Godot**, as ``GDCLASS`` doesn't support this. You can still use multiple inheritance in your own classes as long as they're not exposed to Godot's scripting API.
de: **Vermeiden Sie Mehrfachvererbung für Klassen, die für Godot sichtbar sind**, da ``GDCLASS`` dies nicht unterstützt. Sie können dennoch Mehrfachvererbung in Ihren eigenen Klassen verwenden, solange diese für die Godot-Skript-API sichtbar sind.

source: But this is not all, depending what you do, you will be greeted with some (hopefully positive) surprises.
de: Aber das ist noch nicht alles - je nachdem, was Sie tun, werden Sie mit einigen (hoffentlich positiven) Überraschungen begrüßt.

source: If you inherit from :ref:`class_Node` (or any derived node type, such as Sprite2D), your new class will appear in the editor, in the inheritance tree in the "Add Node" dialog.
de: Wenn Sie von :ref:`class_Node` (oder einem abgeleiteten Nodetyp wie Sprite2D) erben, wird Ihre neue Klasse im Editor im Vererbungsbaum im Dialogfeld "Node hinzufügen" angezeigt.

source: If you inherit from :ref:`class_Resource`, it will appear in the resource list, and all the exposed properties can be serialized when saved/loaded.
de: Wenn Sie von :ref:`class_Resource` erben, wird es in der Ressourcenliste angezeigt, und alle offengelegten Propertys können beim Speichern/Laden serialisiert werden.

source: By this same logic, you can extend the Editor and almost any area of the engine.
de: Mit derselben Logik können Sie den Editor und fast jeden Bereich der Engine erweitern.

source: Translation status
de: Übersetzungsstatus
