Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_platform_ports.po
Languages: de, zh_tw

source: Custom platform ports
de: Eigene Plattform-Portierungen
zh_tw: 支援平台

source: Similar to :ref:`doc_custom_modules_in_cpp`, Godot's multi-platform architecture is designed in a way that allows creating platform ports without modifying any existing source code.
de: Ähnlich wie :ref:`doc_custom_modules_in_cpp` ist die Multiplattform-Architektur von Godot so konzipiert, dass die Erstellung von Plattform-Portierungen ohne Änderung des vorhandenen Quellcodes möglich ist.
zh_tw: 與 doc_custom_modules_in_cpp 類似，Godot 的多平台架構的設計方式允許在不修改任何現有原始碼的情況下建立平台連接埠。

source: An example of a custom platform port distributed independently from the engine is `FRT <https://github.com/efornara/frt>`__, which targets single-board computers. Note that this platform port currently targets Godot 3.x; therefore, it does not use the :ref:`class_DisplayServer` abstraction that is new in Godot 4.
de: Ein Beispiel für eine benutzerdefinierte Plattform-Portierung, die unabhängig von der Engine veröffentlichen wird, ist `FRT <https://github.com/efornara/frt>`__, die für Einplatinencomputer bestimmt ist. Beachten Sie, dass diese Plattform-Portierung derzeit auf Godot 3.x abzielt; daher verwendet sie nicht die Abstraktion :ref:`class_DisplayServer`, die in Godot 4 neu ist.
zh_tw: 獨立於引擎分發的自訂平台連接埠的一個範例是`FRT <https://github.com/efornara/frt>`__，它針對單板電腦。請注意，該平台移植目前針對 Godot 3.x；因此，它不使用 Godot 4 中新增的 class_DisplayServer 抽象化。

source: Some reasons to create custom platform ports might be:
de: Einige Gründe für die Erstellung benutzerdefinierter Plattform-Ports können sein:
zh_tw: 建立自訂平臺移植可能有以下原因：

source: You want to :ref:`port your game to consoles <doc_consoles>`, but wish to write the platform layer yourself. This is a long and arduous process, as it requires signing NDAs with console manufacturers, but it allows you to have full control over the console porting process.
de: Sie möchten Ihr Spiel :ref:`auf Konsolen portieren <doc_consoles>`, möchten aber die Plattformschicht selbst schreiben. Dies ist ein langwieriger und mühsamer Prozess, da er die Unterzeichnung von NDAs mit Konsolenherstellern erfordert, aber er erlaubt Ihnen die volle Kontrolle über den Portierungsprozess für Konsolen.
zh_tw: 您想要 :ref:`將您的遊戲移植到控制台 <doc_consoles>`，但希望自己編寫平台層。這是一個漫長而艱鉅的過程，因為它需要與控制台製造商簽署保密協議，但它允許您完全控制控制台移植過程。

source: You want to port Godot to an exotic platform that isn't currently supported.
de: Sie möchten Godot auf eine exotische Plattform portieren, die derzeit nicht unterstützt wird.
zh_tw: 您想要將 Godot 移植到目前不支援的奇異平台。

source: If you have questions about creating a custom platform port, feel free to ask in the ``#platforms`` channel of the `Godot Contributors Chat <https://chat.godotengine.org/channel/platforms>`__.
de: Wenn Sie Fragen zur Erstellung einer eigenen Plattform-Portierung haben, können Sie diese im ``#platforms``-Kanal des `Godot Mitwirkenden-Chat <https://chat.godotengine.org/channel/platforms>`__ stellen.
zh_tw: 如果您對建立自訂平台連接埠有疑問，請隨時在「Godot 貢獻者聊天 <https://chat.godotengine.org/channel/platforms>」的「#platforms」頻道中提問。

source: Godot is a modern engine with modern requirements. Even if you only intend to run simple 2D projects on the target platform, it still requires an amount of memory that makes it unviable to run on most retro consoles. For reference, in Godot 4, an empty project with nothing visible requires about 100 MB of RAM to run on Linux (50 MB in headless mode).
de: Godot ist eine moderne Engine mit modernen Anforderungen. Selbst wenn Sie nur beabsichtigen, einfache 2D-Projekte auf der Target-Plattform auszuführen, wird eine Menge Speicher benötigt, die es unrentabel macht, auf den meisten Retro-Konsolen zu laufen. In Godot 4 benötigt ein leeres Projekt, bei dem nichts zu sehen ist, etwa 100 MB RAM, um unter Linux zu laufen (50 MB im Headless-Modus).
zh_tw: Godot 是一款具有現代要求的現代化引擎。即使您只想在目標平台上運作簡單的 2D 專案，它仍然需要大量內存，這使得它無法在大多數復古控制台上運作。作為參考，在 Godot 4 中，一個沒有任何可見內容的空專案需要大約 100 MB 的 RAM 才能在 Linux 上運作（無頭模式下為 50 MB）。

source: If you want to run Godot on heavily memory-constrained platforms, older Godot versions have lower memory requirements. The porting process is similar, with the exception of :ref:`class_DisplayServer` not being split from the :ref:`class_OS` singleton.
de: Wenn Sie Godot auf Plattformen mit stark eingeschränktem Speicher betreiben wollen, haben ältere Godot-Versionen geringere Speicheranforderungen. Der Portierungsprozess ist ähnlich, mit der Ausnahme, dass :ref:`class_DisplayServer` nicht von dem Singleton :ref:`class_OS` getrennt wird.
zh_tw: 如果您想在記憶體嚴重受限的平台上執行 Godot，較舊的 Godot 版本的記憶體需求較低。移植過程類似，但 class_DisplayServer 並沒有從 class_OS 單例中分離出來。

source: Official platform ports
de: Offizielle Plattform-Ports
zh_tw: 官方 Git 外掛

source: The official platform ports can be used as a reference when creating a custom platform port:
de: Die offiziellen Plattform-Ports können bei der Erstellung eines eigenen Plattform-Ports als Referenz verwendet werden:
zh_tw: 建立自訂平台連接埠時可以參考官方平台連接埠：

source: `Windows <https://github.com/godotengine/godot/tree/master/platform/windows>`__
zh_tw: `editor/icons <https://github.com/godotengine/godot/tree/master/editor/icons>`__

source: `macOS <https://github.com/godotengine/godot/tree/master/platform/macos>`__
zh_tw: `editor/icons <https://github.com/godotengine/godot/tree/master/editor/icons>`__

source: `Linux/\*BSD <https://github.com/godotengine/godot/tree/master/platform/linuxbsd>`__
zh_tw: \ `editor/icons <https://github.com/godotengine/godot/tree/master/editor/icons>`__

source: `Android <https://github.com/godotengine/godot/tree/master/platform/android>`__
zh_tw: `editor/icons <https://github.com/godotengine/godot/tree/master/editor/icons>`__

source: `iOS <https://github.com/godotengine/godot/tree/master/platform/ios>`__
zh_tw: `editor/icons <https://github.com/godotengine/godot/tree/master/editor/icons>`__

source: `Web <https://github.com/godotengine/godot/tree/master/platform/web>`__
zh_tw: `editor/icons <https://github.com/godotengine/godot/tree/master/editor/icons>`__

source: While platform code is usually self-contained, there are exceptions to this rule. For instance, audio drivers that are shared across several platforms and rendering backends are located in the `drivers/ folder <https://github.com/godotengine/godot/tree/master/drivers>`__ of the Godot source code.
de: Obwohl der Plattformcode normalerweise in sich geschlossen ist, gibt es Ausnahmen von dieser Regel. So befinden sich z.B. Audiotreiber, die von mehreren Plattformen und Rendering-Backends gemeinsam genutzt werden, im Ordner `drivers/ <https://github.com/godotengine/godot/tree/master/drivers>`__ des Godot-Quellcodes.
zh_tw: 雖然平台程式碼通常是獨立的，但此規則也有例外。例如，跨多個平台和算繪後端共享的音訊驅動程式位於 Godot 原始碼的 `drivers/ 資料夾 <https://github.com/godotengine/godot/tree/master/drivers>`__ 中。

source: Creating a custom platform port
de: Erstellen einer benutzerdefinierten Plattform-Portierung
zh_tw: 建立自定節點

source: Creating a custom platform port is a large undertaking which requires prior knowledge of the platform's SDKs. Depending on what features you need, the amount of work needed varies:
de: Die Erstellung einer benutzerdefinierten Plattform-Portierung ist ein umfangreiches Unterfangen, das Vorkenntnisse über die SDKs der jeweiligen Plattform voraussetzt. Je nachdem, welche Features Sie benötigen, ist der Arbeitsaufwand unterschiedlich hoch:
zh_tw: 建立自訂平台連接埠是一項艱鉅的工作，需要事先了解平台的 SDK。根據您需要的功能，所需的工作量會有所不同：

source: Required features of a platform port
de: Erforderliche Merkmale einer Plattform-Portierung
zh_tw: 平臺移植需要的功能

source: At the very least, a platform port must have methods from the :ref:`class_OS` singleton implemented to be buildable and usable for headless operation. A ``logo.svg`` (32×32) vector image must also be present within the platform folder. This logo is displayed in the Export dialog for each export preset targeting the platform in question.
de: Als mindestes müssen die Methoden des Singletons :ref:`class_OS` implementiert sein, um für den Headless-Betrieb gebaut und verwendet werden zu können. Ein ``logo.svg`` (32×32)-Vektorbild muss ebenfalls im Plattformordner vorhanden sein. Dieses Logo wird im Export-Dialog für jede Export-Vorgabe angezeigt, die auf die betreffende Plattform abzielt.
zh_tw: 至少，平台連接埠必須具有實作的 class_OS 單例中的方法，以便可建置並可用於無頭操作。平台資料夾中也必須存在「logo.svg」 (32×32) 向量圖。對於針對相關平台的每個匯出預設，此旗標會顯示在「匯出」對話方塊中。

source: See `this implementation <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/os_linuxbsd.cpp>`__ for the Linux/\*BSD platform as an example. See also the `OS singleton header <https://github.com/godotengine/godot/blob/master/core/os/os.h>`__ for reference.
de: Siehe `diese Implementierung <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/os_linuxbsd.cpp>`__ für die Linux/\*BSD-Plattform als Beispiel. Siehe auch den `OS Singleton Header <https://github.com/godotengine/godot/blob/master/core/os/os.h>`__ als Referenz.
zh_tw: 請參閱 '這個實作 <https://github.com/godotengine/ godot/blob/master/platform/linuxbsd/os_linuxbsd.cpp>'__ 作為 Linux/\*BSD 平臺的範例。另請參閱“OS singleton header <https://github.com/godotengine/ godot/blob/master/core/os/os.h>”__ 以供參考。

source: If your target platform is UNIX-like, consider inheriting from the ``OS_Unix`` class to get much of the work done automatically.
de: Wenn Ihre Target-Plattform UNIX-ähnlich ist, sollten Sie erwägen, von der Klasse ``OS_Unix`` zu erben, um einen Großteil der Arbeit automatisch zu erledigen.
zh_tw: 如果您的目標平台是類 UNIX 的，請考慮繼承「OS_Unix」類別以自動完成大部分工作。

source: If the platform is not UNIX-like, you might use the `Windows port <https://github.com/godotengine/godot/blob/master/platform/windows/os_windows.cpp>` as a reference.
de: Wenn die Plattform nicht UNIX-ähnlich ist, können Sie den `Windows-Port <https://github.com/godotengine/godot/blob/master/platform/windows/os_windows.cpp>` als Referenz verwenden.
zh_tw: 如果平台不是類 UNIX，您可以使用「Windows 連接埠 <https://github.com/godotengine/godot/blob/master/platform/windows/os_windows.cpp>」作為參考。

source: **detect.py file**
de: **detect.py-Datei**
zh_tw: **紋理篩選：**

source: A ``detect.py`` file must be created within the platform's folder with all methods implemented. This file is required for SCons to detect the platform as a valid option for compiling. See the `detect.py file <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/detect.py>`__ for the Linux/\*BSD platform as an example.
de: Eine ``detect.py``-Datei muss im Ordner der Plattform mit allen implementierten Methoden erstellt werden. Diese Datei wird benötigt, damit SCons die Plattform als gültige Option für die Kompilierung erkennen kann. Siehe die Datei `detect.py <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/detect.py>`__ für die Linux/\*BSD-Plattform als Beispiel.
zh_tw: 必須在平臺的資料夾中建立一個「detect.py」檔，並實現所有方法。SCons 需要此檔才能將平台檢測為有效的編譯選項。請參閱 Linux/\*BSD 平臺的 'detect.py 檔 <https://github.com/godotengine/ godot/blob/master/platform/linuxbsd/detect.py>“__ 作為範例。

source: All methods should be implemented within ``detect.py`` as follows:
de: Alle diese Methoden sollten in ``detect.py`` wie folgt implementiert werden:
zh_tw: ``detect.py`` 應實作如下所有方法：

source: ``is_active()``: Can be used to temporarily disable building for a platform. This should generally always return ``True``.
de: ``is_active()``: Kann verwendet werden, um das Bauen für eine Plattform vorübergehend zu deaktivieren. Diese Funktion sollte normalerweise immer ``True`` zurückgeben.
zh_tw: ``is_active()``：可用於暫時停用平台建置。這通常應該總是返回“True”。

source: ``get_name()``: Returns the platform's user-visible name as a string.
de: ``get_name()``: Gibt den für den Benutzer sichtbaren Namen der Plattform als String zurück.
zh_tw: ``get_name()``：以字串形式傳回平台的使用者可見名稱。

source: ``can_build()``: Return ``True`` if the host system is able to build for the target platform, ``False`` otherwise. Do not put slow checks here, as this is queried when the list of platforms is requested by the user. Use ``configure()`` for extensive dependency checks instead.
de: ``can_build()``: Gibt ``True`` zurück, wenn das Hostsystem in der Lage ist, für die Target-Plattform zu bauen, andernfalls ``False``. Fügen Sie hier keine langsamen Checks ein, da dies abgefragt wird, wenn die Liste der Plattformen vom Benutzer angefordert wird. Benutzen Sie stattdessen ``configure()`` für umfangreiche Abhängigkeitsüberprüfungen.
zh_tw: “can_build()”：如果主機系統能夠為目標平台建構，則返回“True”，否則返回“False”。請勿在此處進行緩慢檢查，因為當使用者要求平台列表時會查詢此檢查。請使用“configure()”進行廣泛的依賴性檢查。

source: ``get_opts()``: Returns the list of SCons build options that can be defined by the user for this platform.
de: ``get_opts()``: Gibt die Liste der SCons-Build-Optionen zurück, die vom Benutzer für diese Plattform definiert werden können.
zh_tw: ``get_opts()``：傳回使用者可以為此平台定義的 SCons 建置選項列表。

source: ``get_flags()``: Returns the list of overridden SCons flags for this platform.
de: ``get_flags()``: Gibt die Liste der überschriebenen SCons-Flags für diese Plattform zurück.
zh_tw: ``get_flags()``：傳回該平台覆蓋的 SCons 旗標列表。

source: ``configure()``: Perform build configuration, such as selecting compiler options depending on SCons options chosen.
de: ``configure()``: Build-Konfiguration durchführen, wie z.B. die Auswahl von Compiler-Optionen in Abhängigkeit von den gewählten SCons-Optionen.
zh_tw: ``configure()``：執行建置配置，例如根據所選的 SCons 選項選擇編譯器選項。

source: Optional features of a platform port
de: Optionale Features einer Plattform-Portierung
zh_tw: 平臺移植的可選功能

source: In practice, headless operation doesn't suffice if you want to see anything on screen and handle input devices. You may also want audio output for most games.
de: In der Praxis reicht der Headless-Betrieb nicht aus, wenn Sie etwas auf dem Bildschirm sehen und Eingabegeräte bedienen wollen. Für die meisten Spiele werden Sie auch eine Audioausgabe benötigen.
zh_tw: 實際上，如果您想在螢幕上看到任何內容並處理輸入裝置，無頭操作是不夠的。您可能還需要大多數遊戲的音訊輸出。

source: *Some links on this list point to the Linux/\*BSD platform implementation as a reference.*
de: *Einige Links auf dieser Liste verweisen auf die Implementierung für die Linux/\*BSD-Plattform als Referenz.*
zh_tw: *此清單中的一些連結指向Linux/\*BSD平臺實現作為參考。*

source: One or more `DisplayServers <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/display_server_x11.cpp>`__, with the windowing methods implemented. DisplayServer also covers features such as mouse support, touchscreen support and tablet driver (for pen input). See the `DisplayServer singleton header <https://github.com/godotengine/godot/blob/master/servers/display_server.h>`__ for reference.
de: Ein oder mehrere `DisplayServer <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/display_server_x11.cpp>`__, mit den implementierten Windowing-Methoden. DisplayServer umfasst auch Features wie Mausunterstützung, Touchscreen-Unterstützung und Tablet-Treiber (für Stifteingabe). Siehe den `DisplayServer Singleton Header <https://github.com/godotengine/godot/blob/master/servers/display_server.h>`__ als Referenz.
zh_tw: 一個或多個 `DisplayServers <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/display_server_x11.cpp>`__，已實作視窗方法。 DisplayServer 還涵蓋滑鼠支援、觸控螢幕支援和平板電腦驅動程式（用於筆輸入）等功能。請參閱 `DisplayServer 單例標頭 <https://github.com/godotengine/godot/blob/master/servers/display_server.h>`__ 以供參考。

source: For platforms not featuring full windowing support (or if it's not relevant for the port you are making), most windowing functions can be left mostly unimplemented. These functions can be made to only check if the window ID is ``MAIN_WINDOW_ID`` and specific operations like resizing may be tied to the platform's screen resolution feature (if relevant). Any attempt to create or manipulate other window IDs can be rejected.
de: Für Plattformen, die keine volle Fensterunterstützung bieten (oder wenn es für den Port, den Sie erstellen, nicht relevant ist), können die meisten Fensterfunktionen weitgehend unimplementiert bleiben. Diese Funktionen können so eingerichtet werden, dass sie nur prüfen, ob die Fenster-ID ``MAIN_WINDOW_ID`` ist, und bestimmte Operationen wie die Größenänderung können an die Bildschirmauflösung der Plattform gebunden sein (falls relevant). Jeder Versuch, andere Fenster-IDs zu erzeugen oder zu manipulieren, kann zurückgewiesen werden.
zh_tw: 對於不具有完整視窗支援的平台（或如果它與您正在製作的連接埠無關），大多數視窗功能可以大部分未實作。這些函式可以僅檢查視窗 ID 是否為“MAIN_WINDOW_ID”，並且調整大小等特定操作可能與平台的螢幕解析度功能（如果相關）相關。任何建立或操作其他視窗 ID 的嘗試都會被拒絕。

source: *If the target platform supports the graphics APIs in question:* Rendering context for `Vulkan <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/vulkan_context_x11.cpp>`__, `OpenGL 3.3 or OpenGL ES 3.0 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/gl_manager_x11.cpp>`__.
de: *Wenn die Target-Plattform die fraglichen Grafik-APIs unterstützt:* Rendering-Kontext für `Vulkan <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/vulkan_context_x11.cpp>`__, `OpenGL 3.3 oder OpenGL ES 3.0 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/gl_manager_x11.cpp>`__.
zh_tw: *如果目標平台支援相關圖形 API：* `Vulkan <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/vulkan_context_x11.cpp>`__ 的算繪本文，`OpenGL 3.3 或OpenGL ES 3.0 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/gl_manager_x11.cpp>`__。

source: Input handlers for `keyboard <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/key_mapping_x11.cpp>`__ and `controller <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/joypad_linux.cpp>`__.
de: Eingabe-Handler für `Tastatur <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/key_mapping_x11.cpp>`__ und `Controller <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/joypad_linux.cpp>`__.
zh_tw: `鍵盤<https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/key_mapping_x11.cpp>`__ 和`控制器<https://github.com/godotengine/godot/ 的輸入處理程式blob/master/platform/linuxbsd/joypad_linux.cpp>`__。

source: One or more `audio drivers <https://github.com/godotengine/godot/blob/master/drivers/pulseaudio/audio_driver_pulseaudio.cpp>`__. The audio driver can be located in the ``platform/`` folder (this is done for the Android and Web platforms), or in the ``drivers/`` folder if multiple platforms may be using this audio driver. See the `AudioServer singleton header <https://github.com/godotengine/godot/blob/master/servers/audio_server.h>`__ for reference.
de: Ein oder mehrere `Audio-Treiber <https://github.com/godotengine/godot/blob/master/drivers/pulseaudio/audio_driver_pulseaudio.cpp>`__. Der Audiotreiber kann sich im ``platform/``-Ordner befinden (dies wird für die Android- und Web-Plattformen gemacht), oder im ``drivers/``-Ordner, wenn mehrere Plattformen diesen Audiotreiber verwenden können. Siehe den `AudioServer Singleton Header <https://github.com/godotengine/godot/blob/master/servers/audio_server.h>`__ als Referenz.
zh_tw: 一個或多個「音訊驅動程式<https://github.com/godotengine/godot/blob/master/drivers/pulseaudio/audio_driver_pulseaudio.cpp>`__。音訊驅動程式可以位於「platform/」資料夾中（這是針對 Android 和 Web 平台完成的），或者如果多個平台可能使用此音訊驅動程式，則位於「drivers/」資料夾中。請參閱 `AudioServer 單例標頭 <https://github.com/godotengine/godot/blob/master/servers/audio_server.h>`__ 以供參考。

source: `Crash handler <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/crash_handler_linuxbsd.cpp>`__, for printing crash backtraces when the game crashes. This allows for easier troubleshooting on platforms where logs aren't readily accessible.
de: `Crash-Handler <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/crash_handler_linuxbsd.cpp>`__, für die Ausgabe von Crash-Backtraces, wenn das Spiel abstürzt. Dies ermöglicht eine einfachere Fehlersuche auf Plattformen, auf denen Logs nicht ohne weiteres zugänglich sind.
zh_tw: `當機處理程式 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/crash_handler_linuxbsd.cpp>`__，用於在遊戲當機時列印當機回溯。這樣可以更輕鬆地在不易存取紀錄的平台上進行故障排除。

source: `Text-to-speech driver <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/tts_linux.cpp>`__ (for accessibility).
de: `Text-to-Speech-Treiber <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/tts_linux.cpp>`__ (für Barrierefreiheit).
zh_tw: `core/io/fileaccess.h <https://github.com/godotengine/godot/blob/master/core/os/file_access.h>`_

source: `Export handler <https://github.com/godotengine/godot/tree/master/platform/linuxbsd/export>`__ (for exporting from the editor, including :ref:`doc_one-click_deploy`). Not required if you intend to export only a PCK from the editor, then run the export template binary directly by renaming it to match the PCK file. See the `EditorExportPlatform header <https://github.com/godotengine/godot/blob/master/editor/export/editor_export_platform.h>`__ for reference. ``run_icon.svg`` (16×16) should be present within the platform folder if :ref:`doc_one-click_deploy` is implemented for the target platform. This icon is displayed at the top of the editor when one-click deploy is set up for the target platform.
de: `Export-Handler <https://github.com/godotengine/godot/tree/master/platform/linuxbsd/export>`__ (für den Export aus dem Editor, einschließlich :ref:`doc_one-click_deploy`). Nicht erforderlich, wenn Sie beabsichtigen, nur ein PCK aus dem Editor zu exportieren und dann die Exportvorlagen-Binärdatei direkt auszuführen, indem Sie sie so umbenennen, dass sie der PCK-Datei entspricht. Siehe den `EditorExportPlatform-Header <https://github.com/godotengine/godot/blob/master/editor/export/editor_export_platform.h>`__ als Referenz. ``run_icon.svg`` (16×16) sollte im Plattformordner vorhanden sein, wenn :ref:`doc_one-click_deploy` für die Target-Plattform implementiert ist. Dieses Icon wird am oberen Rand des Editors angezeigt, wenn One-Click-Deploy für die Target-Plattform eingerichtet ist.
zh_tw: `匯出處理程式 <https://github.com/godotengine/godot/tree/master/platform/linuxbsd/export>`__ （用於從編輯器匯出，包括 :ref:`doc_one-click_deploy`）。如果您打算僅從編輯器匯出 PCK，則不需要，然後透過重命名它以配對 PCK 檔案來直接執行匯出範本二進位檔案。請參閱 `EditorExportPlatform 標頭 <https://github.com/godotengine/godot/blob/master/editor/export/editor_export_platform.h>`__ 以供參考。如果為目標平台實作了 doc_one-click_deploy ，則平台資料夾中應存在「run_icon.svg」(16×16)。當為目標平台設定一鍵部署時，此圖示將顯示在編輯器頂部。

source: If the target platform doesn't support running Vulkan, OpenGL 3.3 or OpenGL ES 3.0, you have two options:
de: Wenn die Target-Plattform die Ausführung von Vulkan, OpenGL 3.3 oder OpenGL ES 3.0 nicht unterstützt, haben Sie zwei Möglichkeiten:
zh_tw: 如果目標平台不支援運作 Vulkan、OpenGL 3.3 或 OpenGL ES 3.0，您有兩個選擇：

source: Use a library at run-time to translate Vulkan or OpenGL calls to another graphics API. For example, `MoltenVK <https://moltengl.com/moltenvk/>`__ is used on macOS to translate Vulkan to Metal at run-time.
de: Verwenden Sie eine Bibliothek zur Laufzeit, um Vulkan- oder OpenGL-Aufrufe in eine andere Grafik-API zu übersetzen. Zum Beispiel wird `MoltenVK <https://moltengl.com/moltenvk/>`__ unter macOS verwendet, um Vulkan zur Laufzeit in Metal zu übersetzen.
zh_tw: 在運作時使用庫將 Vulkan 或 OpenGL 呼叫轉換為另一個圖形 API。例如，`MoltenVK <https://moltengl.com/moltenvk/>`__ 用於在 macOS 上在運作時將 Vulkan 轉換為 Metal。

source: Create a new renderer from scratch. This is a large undertaking, especially if you want to support both 2D and 3D rendering with advanced features.
de: Erstellen Sie einen neuen Renderer von Grund auf. Das ist ein großes Unterfangen, vor allem, wenn Sie sowohl 2D- als auch 3D-Rendering mit fortgeschrittenen Features unterstützen möchten.
zh_tw: 從頭開始建立一個新的算繪器。這是一項艱鉅的工作，特別是如果您想透過進階功能支援 2D 和 3D 算繪。

source: Distributing a custom platform port
de: Veröffentlichen einer benutzerdefinierten Plattform-Portierung
zh_tw: 分發自訂平台端口
