Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/internal_rendering_architecture.po
Languages: de

source: Internal rendering architecture
de: Interne Rendering-Architektur

source: This page is a high-level overview of Godot 4's internal renderer design. It does not apply to previous Godot versions.
de: Diese Seite gibt einen Überblick über das interne Renderer-Design von Godot 4. Sie gilt nicht für frühere Godot-Versionen.

source: The goal of this page is to document design decisions taken to best suit :ref:`Godot's design philosophy <doc_best_practices_for_engine_contributors>`, while providing a starting point for new rendering contributors.
de: Das Ziel dieser Seite ist es, Design-Entscheidungen zu dokumentieren, die getroffen wurden, um der :ref:`Godot Design-Philosophie <doc_best_practices_for_engine_contributors>` am besten zu entsprechen, und gleichzeitig einen Ausgangspunkt für neue Rendering-Mitwirkende zu bieten.

source: If you have questions about rendering internals not answered here, feel free to ask in the ``#rendering`` channel of the `Godot Contributors Chat <https://chat.godotengine.org/channel/rendering>`__.
de: Wenn Sie Fragen zu Rendering-Interna haben, die hier nicht beantwortet werden, können Sie diese im ``#rendering``-Kanal des `Godot Mitwirkenden-Chat <https://chat.godotengine.org/channel/rendering>`__ stellen.

source: If you have difficulty understanding concepts on this page, it is recommended to go through an OpenGL tutorial such as `LearnOpenGL <https://learnopengl.com/>`__.
de: Wenn Sie Schwierigkeiten haben, die Konzepte auf dieser Seite zu verstehen, ist es empfehlenswert, ein OpenGL-Tutorial wie `LearnOpenGL <https://learnopengl.com/>`__ durchzuarbeiten.

source: Modern low-level APIs (Vulkan/Direct3D 12) require intermediate knowledge of higher-level APIs (OpenGL/Direct3D 11) to be used effectively. Thankfully, contributors rarely need to work directly with low-level APIs. Godot's renderers are built entirely on OpenGL and RenderingDevice, which is our abstraction over Vulkan/Direct3D 12.
de: Moderne Low-Level-APIs (Vulkan/Direct3D 12) erfordern Zwischenkenntnisse über Higher-Level-APIs (OpenGL/Direct3D 11), um effektiv genutzt werden zu können. Glücklicherweise müssen die Mitwirkenden nur selten direkt mit Low-Level-APIs arbeiten. Godots Renderer basieren vollständig auf OpenGL und RenderingDevice, das unsere Abstraktion von Vulkan/Direct3D 12 ist.

source: Rendering methods
de: Rendering-Methoden

source: This is a forward renderer that uses a *clustered* approach to lighting.
de: Dies ist ein Vorwärts-Renderer, der einen *Cluster*-Ansatz für die Beleuchtung verwendet.

source: Clustered lighting uses a compute shader to group lights into a 3D frustum aligned grid. Then, at render time, pixels can lookup what lights affect the grid cell they are in and only run light calculations for lights that might affect that pixel.
de: Bei der Cluster-Beleuchtung wird ein Compute-Shader verwendet, um die Lichter in einem an 3D-Frustum-ausgerichteten Raster zu gruppieren. Zur Renderzeit können die Pixel dann nachsehen, welche Lichter die Rasterzelle, in der sie sich befinden, beeinflussen, und nur Lichtberechnungen für Lichter durchführen, die dieses Pixel beeinflussen könnten.

source: This approach can greatly speed up rendering performance on desktop hardware, but is substantially less efficient on mobile.
de: Dieser Ansatz kann die Rendering-Performance auf Desktop-Hardware erheblich beschleunigen, ist aber auf mobilen Geräten wesentlich weniger effizient.

source: This is a forward renderer that uses a traditional single-pass approach to lighting.
de: Dies ist ein Vorwärts-Renderer, der einen traditionellen Single-Pass-Ansatz für die Beleuchtung verwendet.

source: Intended for mobile platforms, but can also run on desktop platforms. This rendering method is optimized to perform well on mobile GPUs. Mobile GPUs have a very different architecture compared to desktop GPUs due to their unique constraints around battery usage, heat, and overall bandwidth limitations of reading and writing data. Compute shaders also have very limited support or aren't supported at all. As a result, the mobile renderer purely uses raster-based shaders (fragment/vertex).
de: Gedacht für mobile Plattformen, kann aber auch auf Desktop-Plattformen ausgeführt werden. Diese Rendering-Methode ist für eine gute Performance auf mobilen GPUs optimiert. Mobile GPUs haben eine ganz andere Architektur als Desktop-GPUs, da sie besondere Einschränkungen in Bezug auf den Batterieverbrauch, die Wärmeentwicklung und die allgemeine Bandbreitenbeschränkung beim Lesen und Schreiben von Daten haben. Auch Compute-Shader werden nur sehr eingeschränkt oder gar nicht unterstützt. Infolgedessen verwendet der Mobile-Renderer ausschließlich rasterbasierte Shader (Fragment/Vertex).

source: Unlike desktop GPUs, mobile GPUs perform *tile-based rendering*. Instead of rendering the whole image as a single unit, the image is divided in smaller tiles that fit within the faster internal memory of the mobile GPU. Each tile is rendered and then written out to the destination texture. This all happens automatically on the graphics driver.
de: Im Gegensatz zu Desktop-GPUs führen mobile GPUs *Tile-Based-Rendering* durch. Anstatt das gesamte Bild als eine Einheit zu rendern, wird das Bild in kleinere Kacheln unterteilt, die in den schnelleren internen Speicher der mobilen GPU passen. Jede Kachel wird gerendert und dann in die Zieltextur geschrieben. Dies geschieht alles automatisch durch den Grafiktreiber.

source: The problem is that this introduces bottlenecks in our traditional approach. For desktop rendering, we render all opaque geometry, then handle the background, then transparent geometry, then post-processing. Each pass will need to read the current result into tile memory, perform its operations and then write it out again. We then wait for all tiles to be completed before moving on to the next pass.
de: Das Problem ist, dass dies zu Engpässen in unserem traditionellen Ansatz führt. Beim Desktop-Rendering werden zunächst alle undurchsichtigen Geometrien gerendert, dann der Hintergrund bearbeitet, dann die transparenten Geometrien und schließlich die Nachbearbeitung. Jeder Durchlauf muss das aktuelle Ergebnis in den Kachel-Speicher einlesen, seine Operationen durchführen und es dann wieder herausschreiben. Anschließend warten wir, bis alle Kacheln fertiggestellt sind, bevor wir zum nächsten Durchgang übergehen.

source: The first important change in the mobile renderer is that the mobile renderer does not use the RGBA16F texture formats that the desktop renderer does. Instead, it is using a R10G10B10A2 UNORM texture format. This halves the bandwidth required and has further improvements as mobile hardware often further optimizes for 32-bit formats. The tradeoff is that the mobile renderer has limited HDR capabilities due to the reduced precision and maximum values in the color data.
de: Die erste wichtige Änderung im mobilen Renderer ist, dass der mobile Renderer nicht die RGBA16F-Texturformate verwendet, die der Desktop-Renderer verwendet. Stattdessen wird ein R10G10B10A2 UNORM-Texturformat verwendet. Dadurch halbiert sich die erforderliche Bandbreite und es ergeben sich weitere Verbesserungen, da die mobile Hardware häufig für 32-Bit-Formate optimiert ist. Der Nachteil ist, dass der mobile Renderer aufgrund der reduzierten Präzision und der Maximalwerte in den Farbdaten nur begrenzte HDR-Fähigkeiten hat.

source: The second important change is the use of sub-passes whenever possible. Sub-passes allows us to perform the rendering steps end-to-end per tile saving on the overhead introduced by reading from and writing to the tiles between each rendering pass. The ability to use sub-passes is limited by the inability to read neighboring pixels, as we're constrained to working within a single tile.
de: Die zweite wichtige Änderung ist die Verwendung von Sub-Passes, wann immer dies möglich ist. Mit Sub-Passes können wir die Rendering-Schritte Ende-zu-Ende pro Kachel durchführen und so den Overhead einsparen, der durch das Lesen von und Schreiben in die Kacheln zwischen den einzelnen Rendering-Durchgängen entsteht. Die Möglichkeit, Sub-Passes zu verwenden, wird durch die Unmöglichkeit eingeschränkt, benachbarte Pixel zu lesen, da wir auf die Arbeit innerhalb einer einzelnen Kachel beschränkt sind.

source: This limitation of subpasses results in not being able to implement features such as glow and depth of field efficiently. Similarly, if there is a requirement to read from the screen texture or depth texture, we must fully write out the rendering result limiting our ability to use sub-passes. When such features are enabled, a mix of sub-passes and normal passes are used, and these features result in a notable performance penalty.
de: Diese Einschränkung von Subpasses führt dazu, dass Features wie Glow und Schärfentiefe nicht effizient implementiert werden können. Ähnlich verhält es sich, wenn aus der Bildschirmtextur oder der Tiefentextur gelesen werden muss, so dass das Rendering-Ergebnis vollständig ausgeschrieben werden muss, was die Möglichkeit der Verwendung von Subpasses einschränkt. Wenn solche Features aktiviert sind, wird eine Mischung aus Sub-Passes und normalen Passes verwendet, und diese Features führen zu einem erheblichen Performanceverlust.

source: On desktop platforms, the use of sub-passes won't have any impact on performance. However, this rendering method can still perform better than Clustered Forward in simple scenes thanks to its lower complexity and lower bandwidth usage. This is especially noticeable on low-end GPUs, integrated graphics or in VR applications.
de: Auf Desktop-Plattformen hat die Verwendung von Sub-Passes keine Auswirkungen auf die Performance. Dennoch kann diese Rendering-Methode bei einfachen Szenen aufgrund ihrer geringeren Komplexität und geringeren Bandbreitennutzung besser abschneiden als Clustered Forward. Dies macht sich besonders auf leistungsschwachen Grafikprozessoren, integrierten Grafiken oder in VR-Anwendungen bemerkbar.

source: Given its low-end focus, this rendering method does not provide high-end rendering features such as SDFGI and :ref:`doc_volumetric_fog`. Several post-processing effects are also not available.
de: Da diese Rendering-Methode auf das einfache Rendering ausgerichtet ist, bietet sie keine High-End-Rendering-Features wie SDFGI und :ref:`doc_volumetric_fog`. Verschieden Nachbearbeitungseffekte sind ebenfalls nicht verfügbar.

source: Compatibility
de: Kompatibilität

source: This is the only rendering method available when using the OpenGL driver. This rendering method is not available when using Vulkan or Direct3D 12.
de: Dies ist die einzige Rendering-Methode, die bei Verwendung des OpenGL-Treibers verfügbar ist. Diese Rendering-Methode ist nicht verfügbar, wenn Sie Vulkan oder Direct3D 12 verwenden.

source: This is a traditional (non-clustered) forward renderer. It's intended for old GPUs that don't have Vulkan support, but still works very efficiently on newer hardware. Specifically, it is optimized for older and lower-end mobile devices However, many optimizations carry over making it a good choice for older and lower-end desktop as well.
de: Dies ist ein traditioneller (nicht geclusterter) Vorwärtsrenderer. Er ist für alte GPUs gedacht, die keine Vulkan-Unterstützung haben, funktioniert aber auch auf neuerer Hardware sehr effizient. Insbesondere ist er für ältere und leistungsschwächere Mobilgeräte optimiert. Allerdings werden viele Optimierungen übernommen, sodass er auch für ältere und leistungsschwächere Desktop-Geräte eine gute Wahl ist.

source: Like the Mobile renderer, the Compatibility renderer uses an R10G10B10A2 UNORM texture for 3D rendering. Unlike the mobile renderer, colors are tonemapped and stored in sRGB format so there is no HDR support. This avoids the need for a tonemapping pass and allows us to use the lower bit texture without substantial banding.
de: Wie der mobile Renderer verwendet auch der Kompatibilitäts-Renderer eine R10G10B10A2 UNORM-Textur für das 3D-Rendering. Im Gegensatz zum mobilen Renderer werden die Farben im sRGB-Format gespeichert, sodass keine HDR-Unterstützung vorhanden ist. Dadurch wird ein Tonemapping-Durchgang überflüssig und wir können die Textur mit niedrigeren Bits ohne erhebliches Banding verwenden.

source: The Compatibility renderer uses a traditional forward single-pass approach to drawing objects with lights, but it uses a multi-pass approach to draw lights with shadows. Specifically, in the first pass, it can draw multiple lights without shadows and up to one DirectionalLight3D with shadows. In each subsequent pass, it can draw up to one OmniLight3D, one SpotLight3D and one DirectionalLight3D with shadows. Lights with shadows will affect the scene differently than lights without shadows, as the lighting is blended in sRGB space instead of linear space. This difference in lighting will impact how the scene looks and needs to be kept in mind when designing scenes for the Compatibility renderer.
de: Der Kompatibilitäts-Renderer verwendet einen traditionellen Forward-Single-Pass-Ansatz zum Zeichnen von Objekten mit Lichtern, aber er verwendet einen Multi-Pass-Ansatz, um Lichter mit Schatten zu zeichnen. Insbesondere kann er im ersten Durchgang mehrere Lichter ohne Schatten und bis zu einem DirectionalLight3D mit Schatten zeichnen. In jedem weiteren Durchgang kann er bis zu einem OmniLight3D, einem SpotLight3D und einem DirectionalLight3D mit Schatten zeichnen. Lichter mit Schatten wirken sich anders auf die Szene aus als Lichter ohne Schatten, da die Beleuchtung im sRGB-Raum und nicht im linearen Raum gemischt wird. Dieser Unterschied in der Beleuchtung wirkt sich auf das Aussehen der Szene aus und muss bei der Gestaltung von Szenen für den Kompatibilitätsrenderer berücksichtigt werden.

source: Given its low-end focus, this rendering method does not provide high-end rendering features (even less so compared to Forward Mobile). Most post-processing effects are not available.
de: Angesichts des Low-End-Schwerpunkts bietet diese Rendering-Methode keine High-End-Rendering-Features (noch weniger als Forward Mobile). Die meisten Nachbearbeitungseffekte sind nicht verfügbar.

source: Why not deferred rendering?
de: Warum kein verzögertes Rendering?

source: Forward rendering generally provides a better tradeoff for performance versus flexibility, especially when a clustered approach to lighting is used. While deferred rendering can be faster in some cases, it's also less flexible and requires using hacks to be able to use MSAA. Since games with a less realistic art style can benefit a lot from MSAA, we chose to go with forward rendering for Godot 4 (like Godot 3).
de: Forward Rendering bietet im Allgemeinen einen besseren Kompromiss zwischen Performance und Flexibilität, insbesondere wenn ein Cluster-Ansatz für die Beleuchtung verwendet wird. Verzögertes Rendering kann zwar in einigen Fällen schneller sein, ist aber auch weniger flexibel und erfordert die Verwendung von Hacks, um MSAA nutzen zu können. Da Spiele mit einem weniger realistischen Grafikstil sehr von MSAA profitieren können, haben wir uns bei Godot 4 (wie bei Godot 3) für Forward Rendering entschieden.

source: That said, parts of the forward renderer *are* performed with a deferred approach to allow for some optimizations when possible. This applies to VoxelGI and SDFGI in particular.
de: Allerdings *werden* Teile des Vorwärtsrenderers mit einem verzögerten Ansatz ausgeführt, um einige Optimierungen zu erreichen, wenn dies möglich ist. Dies gilt insbesondere für VoxelGI und SDFGI.

source: A clustered deferred renderer may be developed in the future. This renderer could be used in situations where performance is favored over flexibility.
de: Für die Zukunft ist die Entwicklung eines "geclusterten verzögerten Renderers" geplant. Dieser Renderer könnte in Situationen verwendet werden, in denen die Performance gegenüber der Flexibilität im Vordergrund steht.

source: Rendering drivers
de: Rendering-Treiber

source: Godot 4 supports the following graphics APIs:
de: Godot 4 unterstützt die folgenden Grafik-APIs:

source: This is the main driver in Godot 4, with most of the development focus going towards this driver.
de: Dies ist der Haupttreiber in Godot 4, auf den der größte Teil der Entwicklung ausgerichtet ist.

source: Vulkan 1.0 is required as a baseline, with optional Vulkan 1.1 and 1.2 features used when available. `volk <https://github.com/zeux/volk>`__ is used as a Vulkan loader, and `Vulkan Memory Allocator <https://github.com/GPUOpen-LibrariesAndSDKs/VulkanMemoryAllocator>`__ is used for memory management.
de: Vulkan 1.0 ist als Basis erforderlich, wobei optionale Vulkan 1.1- und 1.2-Features verwendet werden, wenn sie verfügbar sind. `volk <https://github.com/zeux/volk>`__ wird als Vulkan-Loader verwendet, und `Vulkan Memory Allocator <https://github.com/GPUOpen-LibrariesAndSDKs/VulkanMemoryAllocator>`__ wird für die Speicherverwaltung verwendet.

source: Both the Forward+ and Mobile :ref:`doc_internal_rendering_architecture_methods` are supported when using the Vulkan driver.
de: Sowohl Forward+ als auch Mobile :ref:`doc_internal_rendering_architecture_methods` werden bei Verwendung des Vulkan-Treibers unterstützt.

source: **Vulkan context creation:**
de: **Vulkan Kontexterstellung:**

source: Like Vulkan, the Direct3D 12 driver targets modern platforms only. It is designed to target both Windows and Xbox (whereas Vulkan can't be used directly on Xbox).
de: Wie Vulkan zielt auch der Direct3D 12-Treiber nur auf moderne Plattformen ab. Er ist sowohl für Windows als auch für die Xbox konzipiert (während Vulkan nicht direkt auf der Xbox verwendet werden kann).

source: Both the Forward+ and Mobile :ref:`doc_internal_rendering_architecture_methods` can be used with Direct3D 12.
de: Sowohl die Forward+ als auch die Mobile-:ref:`doc_internal_rendering_architecture_methods` können mit Direct3D 12 verwendet werden.

source: :ref:`doc_internal_rendering_architecture_core_shaders` are shared with the Vulkan renderer. Shaders are transpiled from GLSL to HLSL using Mesa NIR (`more information <https://godotengine.org/article/d3d12-adventures-in-shaderland/>`__). This means you don't need to know HLSL to work on the Direct3D 12 renderer, although knowing the language's basics is recommended to ease debugging.
de: :ref:`doc_internal_rendering_architecture_core_shaders` werden mit dem Vulkan-Renderer geteilt. Shader werden mit Hilfe von Mesa NIR von GLSL nach HLSL transpiliert (`mehr Informationen <https://godotengine.org/article/d3d12-adventures-in-shaderland/>`__). Das bedeutet, dass man HLSL nicht kennen muss, um mit dem Direct3D 12 Renderer zu arbeiten, obwohl es empfehlenswert ist, die Grundlagen der Sprache zu kennen, um die Fehlersuche zu erleichtern.

source: Godot supports Metal rendering via `MoltenVK <https://github.com/KhronosGroup/MoltenVK>`__, as macOS and iOS do not support Vulkan natively. This is done automatically when specifying the Vulkan driver in the Project Settings.
de: Godot unterstützt Metal-Rendering über `MoltenVK <https://github.com/KhronosGroup/MoltenVK>`__, da macOS und iOS Vulkan nicht nativ unterstützen. Dies geschieht automatisch, wenn der Vulkan-Treiber in den Projekteinstellungen angegeben wird.

source: MoltenVK makes driver maintenance easy at the cost of some performance overhead. Also, MoltenVK has several limitations that a native Metal driver implementation wouldn't have. Both the clustered and mobile :ref:`doc_internal_rendering_architecture_methods` can be used with a Metal backend via MoltenVK.
de: MoltenVK vereinfacht die Treiberwartung auf Kosten eines gewissen Performance-Overheads. Außerdem hat MoltenVK einige Einschränkungen, die eine native Metal-Treiber-Implementierung nicht hat. Sowohl die geclusterten als auch die mobilen :ref:`doc_internal_rendering_architecture_methods` können mit einem Metal-Backend über MoltenVK verwendet werden.

source: A native Metal driver is planned in the future for better performance and compatibility.
de: Für eine bessere Performance und Kompatibilität ist für die Zukunft ein nativer Metal-Treiber geplant.

source: This driver uses OpenGL ES 3.0 and targets legacy and low-end devices that don't support Vulkan. OpenGL 3.3 Core Profile is used on desktop platforms to run this driver, as most graphics drivers on desktop don't support OpenGL ES. WebGL 2.0 is used for web exports.
de: Dieser Treiber verwendet OpenGL ES 3.0 und zielt auf ältere und Low-End-Geräte ab, die Vulkan nicht unterstützen. OpenGL 3.3 Core Profile wird auf Desktop-Plattformen verwendet, um diesen Treiber auszuführen, da die meisten Grafiktreiber auf dem Desktop OpenGL ES nicht unterstützen. WebGL 2.0 wird für Web-Exporte verwendet.

source: Only the :ref:`doc_internal_rendering_architecture_compatibility` rendering method can be used with the OpenGL driver.
de: Nur die Rendering-Methode :ref:`doc_internal_rendering_architecture_compatibility` kann mit dem OpenGL-Treiber verwendet werden.

source: :ref:`doc_internal_rendering_architecture_core_shaders` are entirely different from the Vulkan renderer.
de: :ref:`doc_internal_rendering_architecture_core_shaders` sind völlig anders als der Vulkan-Renderer.

source: **As of May 2023, this driver is still in development.** Many features are still not implemented, especially in 3D.
de: **Mit Stand vom Mai 2023 befindet sich dieser Treiber noch in der Entwicklung.** Viele Features sind noch nicht implementiert, insbesondere in 3D.

source: Summary of rendering drivers/methods
de: Zusammenfassung der Rendering-Treiber/Methoden

source: The following rendering API + rendering method combinations are currently possible:
de: Die folgenden Kombinationen aus Rendering-API und Rendering-Methode sind derzeit möglich:

source: OpenGL + Compatibility
de: OpenGL + Kompatibilität

source: Each combination has its own limitations and performance characteristics. Make sure to test your changes on all rendering methods if possible before opening a pull request.
de: Jede Kombination hat ihre eigenen Einschränkungen und Performancemerkmale. Stellen Sie sicher, dass Sie Ihre Änderungen nach Möglichkeit mit allen Rendering-Methoden testen, bevor Sie einen Pull Request erstellen.

source: RenderingDevice abstraction
de: RenderingDevice-Abstraktion

source: The OpenGL driver does not use the RenderingDevice abstraction.
de: Der OpenGL-Treiber verwendet nicht die RenderingDevice-Abstraktion.

source: To make the complexity of modern low-level graphics APIs more manageable, Godot uses its own abstraction called RenderingDevice.
de: Um die Komplexität moderner Low-Level-Grafik-APIs besser handhabbar zu machen, verwendet Godot eine eigene Abstraktion namens RenderingDevice.

source: This means that when writing code for modern rendering methods, you don't actually use the Vulkan or Direct3D 12 APIs directly. While this is still lower-level than an API like OpenGL, this makes working on the renderer easier, as RenderingDevice will abstract many API-specific quirks for you. The RenderingDevice presents a similar level of abstraction as Metal or WebGPU.
de: Das bedeutet, dass Sie beim Schreiben von Code für moderne Rendering-Methoden nicht direkt die Vulkan- oder Direct3D 12-APIs verwenden. Dies ist zwar immer noch eine niedrigere Ebene als eine API wie OpenGL, aber es macht die Arbeit am Renderer einfacher, da RenderingDevice viele API-spezifische Eigenheiten für Sie abstrahiert. Das RenderingDevice bietet eine ähnliche Abstraktionsebene wie Metal oder WebGPU.

source: **Vulkan RenderingDevice implementation:**
de: **Vulkan RenderingDevice-Implementierung:**

source: Core rendering classes architecture
de: Architektur der wichtigsten Rendering-Klassen
