Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/internal_rendering_architecture.po
Languages: de

source: Screen-space effects (SSAO, SSIL, SSR, SSS)
de: Screen Space-Effekte (SSAO, SSIL, SSR, SSS)

source: The Forward+ backend supports screen-space ambient occlusion, screen-space indirect lighting, screen-space reflections and subsurface scattering.
de: Das Forward+-Backend unterstützt Screen Space Ambient Occlusion, Screen Space Indirect Lighting, Screen Space Reflections und Subsurface Scattering.

source: SSAO uses an implementation derived from Intel's `ASSAO <https://www.intel.com/content/www/us/en/developer/articles/technical/adaptive-screen-space-ambient-occlusion.html>`__ (converted to Vulkan). SSIL is derived from SSAO to provide high-performance indirect lighting.
de: SSAO verwendet eine Implementierung, die von Intels `ASSAO <https://www.intel.com/content/www/us/en/developer/articles/technical/adaptive-screen-space-ambient-occlusion.html>`__ (konvertiert zu Vulkan) abgeleitet ist. SSIL ist von SSAO abgeleitet, um eine leistungsstarke indirekte Beleuchtung zu ermöglichen.

source: When both SSAO and SSIL are enabled, parts of SSAO and SSIL are shared to reduce the performance impact.
de: Wenn sowohl SSAO als auch SSIL aktiviert sind, werden Teile von SSAO und SSIL gemeinsam genutzt, um die Auswirkungen auf die Performance zu verringern.

source: SSAO and SSIL are performed at half resolution by default to improve performance. SSR is always performed at half resolution to improve performance.
de: SSAO und SSIL werden standardmäßig mit halber Auflösung ausgeführt, um die Performance zu verbessern. SSR wird immer mit halber Auflösung ausgeführt, um die Performance zu verbessern.

source: **Screen-space effects C++ code:**
de: **C++-Code für Screen Space-Effekte:**

source: **Screen-space ambient occlusion GLSL shader:**
de: **GSL-Shader für Screen Space Ambient Occlusion:**

source: **Screen-space indirect lighting GLSL shader:**
de: **GSL-Shader für Screen Space Indirect Lighting:**

source: **Screen-space reflections GLSL shader:**
de: **GLSL-Shader für Screen Space Reflections:**

source: **Subsurface scattering GLSL:**
de: **GLSL mit Subsurface Scattering:**

source: Sky rendering
de: Himmelsrendering

source: Godot supports using shaders to render the sky background. The radiance map (which is used to provide ambient light and reflections for PBR materials) is automatically updated based on the sky shader.
de: Godot unterstützt die Verwendung von Shadern zum Rendern des Himmelshintergrunds. Die Radiance Map (die verwendet wird, um Umgebungslicht und Reflexionen für PBR-Materialien bereitzustellen) wird automatisch auf der Grundlage des Himmelsshaders aktualisiert.

source: The SkyMaterial resources such as ProceduralSkyMaterial, PhysicalSkyMaterial and PanoramaSkyMaterial generate a built-in shader for sky rendering. This is similar to what BaseMaterial3D provides for 3D scene materials.
de: Die SkyMaterial-Ressourcen wie ProceduralSkyMaterial, PhysicalSkyMaterial und PanoramaSkyMaterial erzeugen einen Built-in-Shader für das Himmelsrendering. Dies ist vergleichbar mit dem, was BaseMaterial3D für 3D-Szenenmaterialien bietet.

source: A detailed technical implementation can be found in the `Custom sky shaders in Godot 4.0 <https://godotengine.org/article/custom-sky-shaders-godot-4-0>`__ article.
de: Eine detaillierte technische Implementierung findet sich im Artikel `Custom sky shaders in Godot 4.0 <https://godotengine.org/article/custom-sky-shaders-godot-4-0>`__.

source: **Sky rendering C++ code:**
de: **C++-Code für Himmelsrendering:**

source: **Sky rendering GLSL shader:**
de: **GLSL-Shader für Himmelsrendering:**

source: Volumetric fog
de: Volumetrischer Nebel

source: Godot supports a frustum-aligned voxel (froxel) approach to volumetric fog rendering. As opposed to a post-processing filter, this approach is more general-purpose as it can work with any light type. Fog can also use shaders for custom behavior, which allows animating the fog or using a 3D texture to represent density.
de: Godot unterstützt einen Frustum-aligned Voxel (Froxel)-Ansatz für das Rendern von volumetrischem Nebel. Im Gegensatz zu einem Post-Processing-Filter ist dieser Ansatz vielseitiger, da er mit jedem Lichttyp arbeiten kann. Nebel kann auch Shader für benutzerdefiniertes Verhalten verwenden, was die Animation des Nebels oder die Verwendung einer 3D-Textur zur Darstellung von Dichte ermöglicht.

source: The FogMaterial resource generates a built-in shader for FogVolume nodes. This is similar to what BaseMaterial3D provides for 3D scene materials.
de: Die FogMaterial-Ressource erzeugt einen Built-in-Shader für FogVolume-Nodes. Dies ist vergleichbar mit dem, was BaseMaterial3D für 3D-Szenenmaterialien bietet.

source: A detailed technical explanation can be found in the `Fog Volumes arrive in Godot 4.0 <https://godotengine.org/article/fog-volumes-arrive-in-godot-4>`__ article.
de: Eine ausführliche technische Erklärung finden Sie im Artikel `Fog Volumes arrive in Godot 4.0 <https://godotengine.org/article/fog-volumes-arrive-in-godot-4>`__.

source: **Volumetric fog C++ code:**
de: **C++-Code für volumetrischen Nebel:**

source: **Volumetric fog GLSL shaders:**
de: **GLSL Shader mit volumetrischem Nebel:**

source: While modern GPUs can handle drawing a lot of triangles, the number of draw calls in complex scenes can still be a bottleneck (even with Vulkan and Direct3D 12).
de: Moderne Grafikprozessoren können zwar viele Dreiecke zeichnen, aber die Anzahl der Draw-Aufrufe in komplexen Szenen kann immer noch ein Bottleneck sein (selbst mit Vulkan und Direct3D 12).

source: Godot 4 supports occlusion culling to reduce overdraw (when the depth prepass is disabled) and reduce vertex throughput. This is done by rasterizing a low-resolution buffer on the CPU using `Embree <https://github.com/embree/embree>`__. The buffer's resolution depends on the number of CPU threads on the system, as this is done in parallel. This buffer includes occluder shapes that were baked in the editor or created at run-time.
de: Godot 4 unterstützt Occlusion Culling, um das Überzeichnen zu reduzieren (wenn der Tiefenvordurchlauf deaktiviert ist) und den Vertex-Durchsatz zu verringern. Dies geschieht durch Rasterung eines Puffers mit niedriger Auflösung auf der CPU mit `Embree <https://github.com/embree/embree>`__. Die Auflösung des Puffers hängt von der Anzahl der CPU-Threads auf dem System ab, da dies parallel durchgeführt wird. Dieser Puffer enthält Occluder-Shapes, die im Editor gebacken oder zur Laufzeit erstellt wurden.

source: As complex occluders can introduce a lot of strain on the CPU, baked occluders can be simplified automatically when generated in the editor.
de: Da komplexe Occluder die CPU stark belasten können, können gebackene Occluder bei der Erstellung im Editor automatisch vereinfacht werden.

source: Godot's occlusion culling doesn't support dynamic occluders yet, but OccluderInstance3D nodes can still have their visibility toggled or be moved. However, this will be slow when updating complex occluders this way. Therefore, updating occluders at run-time is best done only on simple occluder shapes such as quads or cuboids.
de: Das Occlusion Culling von Godot unterstützt noch keine dynamischen Occluder, aber OccluderInstance3D-Nodes können ihre Sichtbarkeit umschalten oder verschoben bekommen. Allerdings wird dies bei der Aktualisierung komplexer Occluder auf diese Weise langsam. Daher ist es am besten, die Occluder zur Laufzeit nur bei einfachen Occluder-Shapes wie Quads oder Quadern zu aktualisieren.

source: This CPU-based approach has a few advantages over other solutions, such as portals and rooms or a GPU-based culling solution:
de: Dieser CPU-basierte Ansatz hat einige Vorteile gegenüber anderen Lösungen, wie z.B. Portalen und Räumen oder einer GPU-basierten Culling-Lösung:

source: No manual setup required (but can be tweaked manually for best performance).
de: Keine manuelle Einrichtung erforderlich (kann aber für optimale Performance manuell angepasst werden).

source: No frame delay, which is problematic in cutscenes during camera cuts or when the camera moves fast behind a wall.
de: Keine Bildverzögerung, die in Zwischensequenzen bei Kameraschwenks problematisch ist, oder wenn sich die Kamera schnell hinter einer Wand bewegt.

source: Works the same on all rendering drivers and methods, with no unpredictable behavior depending on the driver or GPU hardware.
de: Funktioniert bei allen Rendering-Treibern und -Methoden gleich, ohne unvorhersehbares Verhalten je nach Treiber oder GPU-Hardware.

source: Occlusion culling is performed by registering occluder meshes, which is done using OccluderInstance3D *nodes* (which themselves use Occluder3D *resources*). RenderingServer then performs occlusion culling by calling Embree in RendererSceneOcclusionCull.
de: Occlusion Culling wird durch die Registrierung von Occluder Meshes durchgeführt, was mit OccluderInstance3D-*Nodes* geschieht (die ihrerseits Occluder3D-*Ressourcen* verwenden). RenderingServer führt dann Occlusion Culling durch den Aufruf von Embree in RendererSceneOcclusionCull durch.

source: **Occlusion culling C++ code:**
de: **C++-Code für Occlusion-Culling:**

source: Visibility range (LOD)
de: Sichtbarkeits-Reichweite (LOD)

source: Godot supports manually authored hierarchical level of detail (HLOD), with distances specified by the user in the inspector.
de: Godot unterstützt manuell erstellte hierarchisches Level of Detail (HLOD), wobei die Abstände vom Benutzer im Inspektor festgelegt werden.

source: In RenderingSceneCull, the ``_scene_cull()`` and ``_render_scene()`` functions are where most of the LOD determination happens. Each viewport can render the same mesh with different LODs (to allow for split screen rendering to look correct).
de: In RenderingSceneCull sind es die Funktionen ``_scene_cull()`` und ``_render_scene()``, in denen der Großteil der LOD-Bestimmung stattfindet. Jeder Viewport kann das gleiche Mesh mit unterschiedlichen LODs rendern (um ein korrektes Split-Screen-Rendering zu ermöglichen).

source: **Visibility range C++ code:**
de: **C++-Code zu Sichtbarkeits-Reichweite**

source: Automatic mesh LOD
de: Automatisches Mesh-LOD

source: The ImporterMesh class is used for the 3D mesh import workflow in the editor. Its ``generate_lods()`` function handles generating using the `meshoptimizer <https://meshoptimizer.org/>`__ library.
de: Die ImporterMesh-Klasse wird für den 3D-Mesh-Import-Workflow im Editor verwendet. Ihre Funktion ``generate_lods()`` behandelt die Generierung mit der Bibliothek `meshoptimizer <https://meshoptimizer.org/>`__.

source: LOD mesh generation also generates shadow meshes at the same time. These are meshes that have their vertices welded regardless of smoothing and materials. This is used to improve shadow rendering performance by lowering the vertex throughput required to render shadows.
de: Bei der LOD-Mesh-Generierung werden gleichzeitig auch Schatten-Meshes erzeugt. Dabei handelt es sich um Meshes, deren Vertices unabhängig von Glättung und Materialien verschweißt sind. Dies wird verwendet, um die Performance beim Rendern von Schatten zu verbessern, indem der für das Rendern von Schatten erforderliche Vertex-Durchsatz verringert wird.

source: The RenderingSceneCull class's ``_render_scene()`` function determines which mesh LOD should be used when rendering. Each viewport can render the same mesh with different LODs (to allow for split screen rendering to look correct).
de: Die Funktion ``_render_scene()`` der Klasse RenderingSceneCull bestimmt, welches Mesh-LOD beim Rendern verwendet werden soll. Jeder Viewport kann das gleiche Mesh mit unterschiedlichen LODs rendern (um ein korrektes Split-Screen-Rendering zu ermöglichen).

source: The mesh LOD is automatically chosen based on a screen coverage metric. This takes resolution and camera FOV changes into account without requiring user intervention. The threshold multiplier can be adjusted in the project settings.
de: Das LOD des Meshes wird automatisch auf der Grundlage einer Bildschirmabdeckungsmetrik ausgewählt. Dabei werden Änderungen der Auflösung und des Kamerabildes berücksichtigt, ohne dass der Benutzer eingreifen muss. Der Schwellenwertmultiplikator kann in den Projekteinstellungen angepasst werden.

source: To improve performance, shadow rendering and reflection probe rendering also choose their own mesh LOD thresholds (which can be different from the main scene rendering).
de: Um die Performance zu verbessern, wählen das Schatten-Rendering und das Reflection-Probe-Rendering auch ihre eigenen Mesh-LOD-Schwellenwerte (die sich vom Rendering der Hauptszene unterscheiden können).

source: **Mesh LOD generation on import C++ code:**
de: **C++-Code zu Mesh LOD-Erzeugung bei Import:**

source: **Mesh LOD determination C++ code:**
de: **C++-Code zur Bestimmung von Mesh LOD:**

source: Translation status
de: Übersetzungsstatus
