Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/internal_rendering_architecture.po
Languages: de

source: This diagram represents the structure of rendering classes in Godot, including the RenderingDevice abstraction:
de: Dieses Diagramm zeigt die Struktur der Rendering-Klassen in Godot, einschließlich der RenderingDevice-Abstraktion:

source: Core shaders
de: Core-Shader

source: While shaders in Godot projects are written using a :ref:`custom language inspired by GLSL <doc_shading_language>`, core shaders are written directly in GLSL.
de: Während Shader in Godot-Projekten mit :ref:`einer eigenen, von GLSL inspirierten Sprache <doc_shading_language>` geschrieben werden, werden Core-Shader direkt in GLSL geschrieben.

source: These core shaders are embedded in the editor and export template binaries at compile-time. To see any changes you've made to those GLSL shaders, you need to recompile the editor or export template binary.
de: Diese Core-Shader werden zur Kompilierungszeit in die Editor- und Exportvorlagen-Binärdateien eingebettet. Um Änderungen an diesen GLSL-Shadern zu sehen, müssen Sie den Editor oder die Exportvorlagen-Binärdatei neu kompilieren.

source: Some material features such as height mapping, refraction and proximity fade are not part of core shaders, and are performed in the default BaseMaterial3D using the Godot shader language instead (not GLSL). This is done by procedurally generating the required shader code depending on the features enabled in the material.
de: Einige Material-Eigenschaften wie Height Mapping, Refraction und Proximity Fade sind nicht Teil der Core-Shader und werden im Standard-BaseMaterial3D stattdessen mit der Godot-Shader-Sprache (nicht GLSL) ausgeführt. Dies geschieht durch prozedurale Generierung des erforderlichen Shader-Codes in Abhängigkeit von den im Material aktivierten Features.

source: By convention, shader files with ``_inc`` in their name are included in other GLSL files for better code reuse. Standard GLSL preprocessing is used to achieve this.
de: Konventionell werden Shader-Dateien mit ``_inc`` in ihrem Namen in andere GLSL-Dateien eingebunden, um die Wiederverwendung von Code zu verbessern. Um dies zu erreichen, wird die standardmäßige GLSL-Vorverarbeitung verwendet.

source: Core material shaders will be used by every material in the scene – both with the default BaseMaterial3D and custom shaders. As a result, these shaders must be kept as simple as possible to avoid performance issues and ensure shader compilation doesn't become too slow.
de: Core-Material-Shader werden von jedem Material in der Szene verwendet - sowohl mit dem standardmäßigen BaseMaterial3D als auch mit benutzerdefinierten Shadern. Daher müssen diese Shader so einfach wie möglich gehalten werden, um Performanceprobleme zu vermeiden und sicherzustellen, dass die Shader-Kompilierung nicht zu langsam wird.

source: If you use ``if`` branching in a shader, performance may decrease as :abbr:`VGPR (Vector General-Purpose Register)` usage will increase in the shader. This happens even if all pixels evaluate to ``true`` or ``false`` in a given frame.
de: Wenn Sie ``if``-Verzweigungen in einem Shader verwenden, kann die Performance sinken, da die :abbr:`VGPR (Vector General-Purpose Register)`-Nutzung im Shader steigt. Dies geschieht selbst dann, wenn alle Pixel in einem bestimmten Frame als ``true`` oder ``false`` ausgewertet werden.

source: If you use ``#if`` preprocessor branching, the number of required shader versions will increase in the scene. In a worst-case scenario, adding a single boolean ``#define`` can *double* the number of shader versions that may need to be compiled in a given scene. In some cases, Vulkan specialization constants can be used as a faster (but more limited) alternative.
de: Wenn Sie die ``#if``-Präprozessorverzweigung verwenden, wird die Anzahl der benötigten Shader-Versionen in der Szene steigen. Im schlimmsten Fall kann das Hinzufügen eines einzigen booleschen ``#define`` die Anzahl der Shader-Versionen, die in einer bestimmten Szene kompiliert werden müssen, *verdoppeln*. In einigen Fällen können Vulkan-Spezialisierungskonstanten als schnellere (aber begrenztere) Alternative verwendet werden.

source: This means there is a high barrier to adding new built-in material features in Godot, both in the core shaders and BaseMaterial3D. While BaseMaterial3D can make use of dynamic code generation to only include the shader code if the feature is enabled, it'll still require generating more shader versions when these features are used in a project. This can make shader compilation stutter more noticeable in complex 3D scenes.
de: Das bedeutet, dass es eine hohe Hürde für das Hinzufügen neuer Built-in-Material-Eigenschaften in Godot gibt, sowohl in den Core-Shadern als auch in BaseMaterial3D. BaseMaterial3D kann zwar die dynamische Codegenerierung nutzen, um den Shader-Code nur dann einzubeziehen, wenn das Feature aktiviert ist, aber es müssen immer noch mehr Shader-Versionen generiert werden, wenn diese Features in einem Projekt verwendet werden. Dies kann dazu führen, dass die Shader-Kompilierung in komplexen 3D-Szenen stärker stottert.

source: See `The Shader Permutation Problem <https://therealmjp.github.io/posts/shader-permutations-part1/>`__ and `Branching on a GPU <https://medium.com/@jasonbooth_86226/branching-on-a-gpu-18bfc83694f2>`__ blog posts for more information.
de: Weitere Informationen finden Sie in den Blogbeiträgen `The Shader Permutation Problem <https://therealmjp.github.io/posts/shader-permutations-part1/>`__ und `Branching on a GPU <https://medium.com/@jasonbooth_86226/branching-on-a-gpu-18bfc83694f2>`__.

source: **Core GLSL material shaders:**
de: **Core-GLSL-Material-Shader:**

source: **Material shader generation:**
de: **Material-Shader-Generierung:**

source: **Other GLSL shaders for Forward+ and Forward Mobile rendering methods:**
de: **Andere GLSL-Shader für Forward+ und Forward Mobile Rendering-Methoden:**

source: **Other GLSL shaders for the Compatibility rendering method:**
de: **Andere GLSL-Shader für die Kompatibilitäts-Renderingmethode:**

source: 2D and 3D rendering separation
de: Trennung von 2D- und 3D-Rendering

source: The following is only applicable in the Forward+ and Forward Mobile rendering methods, not in Compatibility. Multiple Viewports can be used to emulate this when using the Compatibility backend, or to perform 2D resolution scaling.
de: Das Folgende gilt nur für die Rendering-Methoden Forward+ und Forward Mobile, nicht aber für Kompatibilität. Mehrere Viewports können verwendet werden, um dies zu emulieren, wenn das Kompatibilität-Backend verwendet wird, oder um eine 2D-Auflösungsskalierung durchzuführen.

source: 2D and 3D are rendered to separate buffers, as 2D rendering in Godot is performed in :abbr:`LDR (Low Dynamic Range)` sRGB-space while 3D rendering uses :abbr:`HDR (High Dynamic Range)` linear space.
de: 2D und 3D werden in getrennten Puffern gerendert, da das 2D-Rendering in Godot im :abbr:`LDR (Low Dynamic Range)` sRGB-Raum durchgeführt wird, während das 3D-Rendering den :abbr:`HDR (High Dynamic Range)` linearen Raum verwendet.

source: The color format used for 2D rendering is RGB8 (RGBA8 if the **Transparent** property on the Viewport is enabled). 3D rendering uses a 24-bit unsigned normalized integer depth buffer, or 32-bit signed floating-point if a 24-bit depth buffer is not supported by the hardware. 2D rendering does not use a depth buffer.
de: Das für das 2D-Rendering verwendete Farbformat ist RGB8 (RGBA8, wenn die Property **Transparent** im Viewport aktiviert ist). Das 3D-Rendering verwendet einen 24-Bit-Tiefenpuffer mit normalisierten unsigned Integer oder 32-Bit-signed Float, wenn ein 24-Bit-Tiefenpuffer von der Hardware nicht unterstützt wird. Beim 2D-Rendering wird kein Tiefenpuffer verwendet.

source: 3D resolution scaling is performed differently depending on whether bilinear or FSR 1.0 scaling is used. When bilinear scaling is used, no special upscaling shader is run. Instead, the viewport's texture is stretched and displayed with a linear sampler (which makes the filtering happen directly on the hardware). This allows maximizing the performance of bilinear 3D scaling.
de: Die Skalierung der 3D-Auflösung wird unterschiedlich durchgeführt, je nachdem, ob eine bilineare oder eine FSR 1.0-Skalierung verwendet wird. Bei bilinearer Skalierung wird kein spezieller Upscaling-Shader ausgeführt. Stattdessen wird die Textur des Viewports gestreckt und mit einem linearen Sampler angezeigt (wodurch die Filterung direkt in der Hardware erfolgt). Dies ermöglicht die Maximierung der Performance der bilinearen 3D-Skalierung.

source: The ``configure()`` function in RenderSceneBuffersRD reallocates the 2D/3D buffers when the resolution or scaling changes.
de: Die Funktion ``configure()`` in RenderSceneBuffersRD ordnet die 2D/3D-Puffer neu zu, wenn sich die Auflösung oder Skalierung ändert.

source: Dynamic resolution scaling isn't supported yet, but is planned in a future Godot release.
de: Die dynamische Auflösungsskalierung wird noch nicht unterstützt, ist aber für ein künftiges Godot-Release geplant.

source: **2D and 3D rendering buffer configuration C++ code:**
de: **C++-Code für 2D- und 3D-Rendering-Bufferkonfiguration:**

source: 2D rendering techniques
de: 2D-Rendering-Techniken

source: 2D light rendering is performed in a single pass to allow for better performance with large amounts of lights.
de: Das 2D-Lichtrendering wird in einem einzigen Durchgang durchgeführt, um eine bessere Performance bei großen Mengen von Lichtern zu ermöglichen.

source: The Forward+ and Mobile rendering methods don't feature 2D batching yet, but it's planned for a future release.
de: Die Rendering-Methoden Forward+ und Mobile bieten noch keine 2D-Batching-Funktion, diese ist jedoch für ein zukünftiges Release geplant.

source: The Compatibility backend features 2D batching to improve performance, which is especially noticeable with lots of text on screen.
de: Das Kompatibilität-Backend bietet 2D-Batching, um die Performance zu verbessern, was sich besonders bei viel Text auf dem Bildschirm bemerkbar macht.

source: MSAA can be enabled in 2D to provide "automatic" line and polygon antialiasing, but FXAA does not affect 2D rendering as it's calculated before 2D rendering begins. Godot's 2D drawing methods such as the Line2D node or some CanvasItem ``draw_*()`` methods provide their own way of antialiasing based on triangle strips and vertex colors, which don't require MSAA to work.
de: MSAA kann in 2D aktiviert werden, um ein "automatisches" Antialiasing für Linien und Polygone zu ermöglichen, aber FXAA hat keinen Einfluss auf das 2D-Rendering, da es berechnet wird, bevor das 2D-Rendering beginnt. Godots 2D-Zeichenmethoden wie der Line2D-Node oder einige CanvasItem ``draw_*()``-Methoden bieten ihre eigene Art des Antialiasing basierend auf Triangle Strips und Vertex-Farben, die kein MSAA benötigen, um zu funktionieren.

source: A 2D signed distance field representing LightOccluder2D nodes in the viewport is automatically generated if an user shader requests it. This can be used for various effects in custom shaders, such as 2D global illumination. It is also used to calculate particle collisions in 2D.
de: Ein 2D-Signed Distance Field, das LightOccluder2D-Nodes im Viewport repräsentiert, wird automatisch erzeugt, wenn ein Benutzer-Shader es anfordert. Dies kann für verschiedene Effekte in benutzerdefinierten Shadern verwendet werden, z.B. für die 2D Global Illumination. Es wird auch zur Berechnung von Partikelkollisionen in 2D verwendet.

source: **2D SDF generation GLSL shader:**
de: **2D-SDF-GLSL-Shader:**

source: 3D rendering techniques
de: 3D-Rendering-Techniken

source: Batching and instancing
de: Batching und Instanziierung

source: In the Forward+ backend, Vulkan instancing is used to group rendering of identical objects for performance. This is not as fast as static mesh merging, but it still allows instances to be culled individually.
de: Im Forward+-Backend wird Vulkan-Instanziierung verwendet, um das Rendering identischer Objekte aus Performancegründen zu gruppieren. Dies ist nicht so schnell wie das statische Mergen von Meshes, ermöglicht aber dennoch das individuelle Culling von Instanzen.

source: Light, decal and reflection probe rendering
de: Licht-, Decal- und Reflexionsprobe-Rendering

source: Reflection probe and decal rendering are currently not available in the Compatibility backend.
de: Reflexions-Probe und Decal-Rendering sind derzeit im Kompatibilitäts-Backend nicht verfügbar.

source: As its name implies, the Forward+ backend uses clustered lighting. This allows using as many lights as you want; performance largely depends on screen coverage. Shadow-less lights can be almost free if they don't occupy much space on screen.
de: Wie der Name schon sagt, verwendet das Forward+-Backend eine Cluster-Beleuchtung. Dadurch können Sie so viele Lichter verwenden, wie Sie wollen; die Performance hängt weitgehend von der Bildschirmabdeckung ab. Schattenlose Lichter können fast kostenlos sein, wenn sie nicht viel Platz auf dem Bildschirm beanspruchen.

source: All rendering methods also support rendering up to 8 directional lights at the same time (albeit with lower shadow quality when more than one light has shadows enabled).
de: Alle Rendering-Methoden unterstützen auch das gleichzeitige Rendering von bis zu 8 gerichteten Lichtern (wenn auch mit geringerer Schattenqualität, wenn mehr als ein Licht Schatten aktiviert hat).

source: The Forward Mobile backend uses a single-pass lighting approach, with a limitation of 8 OmniLights + 8 SpotLights affecting each Mesh *resource* (plus a limitation of 256 OmniLights + 256 SpotLights in the camera view). These limits are hardcoded and can't be adjusted in the project settings.
de: Das Forward Mobile-Backend verwendet einen Single-Pass-Beleuchtungsansatz mit einer Begrenzung von 8 OmniLights + 8 SpotLights pro Mesh-*Ressource* (plus einer Begrenzung von 256 OmniLights + 256 SpotLights in der Kameraansicht). Diese Grenzen sind fest kodiert und können in den Projekteinstellungen nicht angepasst werden.

source: The Compatibility backend uses a hybrid single-pass + multi-pass lighting approach. Lights without shadows are rendered in a single pass. Lights with shadows are rendered in multiple passes. This is required for performance reasons on mobile devices. As a result, performance does not scale well with many shadow-casting lights. It is recommended to only have a handful of lights with shadows in the camera frustum at a time and for those lights to be spread apart so that each object is only touched by 1 or 2 shadowed lights at a time. The maximum number of lights visible at once can be adjusted in the project settings.
de: Das Kompatibilität-Backend verwendet einen hybriden Single-Pass- und Multi-Pass-Beleuchtungsansatz. Lichter ohne Schatten werden in einem einzigen Durchgang gerendert. Lichter mit Schatten werden in mehreren Durchgängen gerendert. Dies ist aus Performancegründen auf mobilen Geräten erforderlich. Daher ist die Performance bei vielen schattenwerfenden Lichtern nicht gut skalierbar. Es wird empfohlen, jeweils nur eine Handvoll Lichter mit Schatten im Kamera-Frustum zu haben und diese Lichter so zu verteilen, dass jedes Objekt nur von 1 oder 2 schattenwerfenden Lichtern auf einmal berührt wird. Die maximale Anzahl der gleichzeitig sichtbaren Lichter kann in den Projekteinstellungen angepasst werden.

source: In all 3 methods, lights without shadows are much cheaper than lights with shadows. To improve performance, lights are only updated when the light is modified or when objects in its radius are modified. Godot currently doesn't separate static shadow rendering from dynamic shadow rendering, but this is planned in a future release.
de: Bei allen 3 Methoden sind Lichter ohne Schatten viel billiger als Lichter mit Schatten. Um die Performance zu verbessern, werden Lichter nur aktualisiert, wenn das Licht geändert wird oder wenn Objekte in seinem Radius geändert werden. Godot trennt derzeit nicht zwischen statischem und dynamischem Schattenrendering, aber dies ist für ein zukünftiges Release geplant.

source: Clustering is also used for reflection probes and decal rendering in the Forward+ backend.
de: Clustering wird auch für Reflexions-Probes und das Rendering von Decals im Forward+ Backend verwendet.

source: Both Forward+ and Forward Mobile methods use :abbr:`PCF (Percentage Closer Filtering)` to filter shadow maps and create a soft penumbra. Instead of using a fixed PCF pattern, these methods use a vogel disk pattern which allows for changing the number of samples and smoothly changing the quality.
de: Sowohl Forward+ als auch Forward Mobile verwenden :abbr:`PCF (Percentage Closer Filtering)`, um Shadow Maps zu filtern und einen weichen Halbschatten zu erzeugen. Anstelle eines festen PCF-Musters verwenden diese Methoden ein Vogel-Disk-Muster, das es ermöglicht, die Anzahl der Samples zu ändern und die Qualität stufenlos zu verändern.

source: Godot also supports percentage-closer soft shadows (PCSS) for more realistic shadow penumbra rendering. PCSS shadows are limited to the Forward+ backend as they're too demanding to be usable in the Forward Mobile backend. PCSS also uses a vogel-disk shaped kernel.
de: Godot unterstützt auch Percentage-Closer Soft Shadows (PCSS) für eine realistischere Darstellung der Schatten-Penumbra. PCSS-Schatten sind auf das Forward+-Backend beschränkt, da sie zu anspruchsvoll sind, um im Forward Mobile-Backend verwendet werden zu können. PCSS verwendet auch einen Vogel-Disk-förmigen Kernel.

source: Additionally, both shadow-mapping techniques rotate the kernel on a per-pixel basis to help soften under-sampling artifacts.
de: Darüber hinaus rotieren beide Shadow-Mapping-Techniken den Kernel auf einer pro-Pixel-Basis, um Unterabtastungsartefakte zu mildern.

source: The Compatibility backend doesn't support shadow mapping for any light types yet.
de: Das Kompatibilität-Backend unterstützt noch kein Shadow-Mapping für irgendwelche Lichttypen.

source: Temporal antialiasing
de: Temporales Antialiasing

source: Only available in the Forward+ backend, not the Forward Mobile or Compatibility methods.
de: Nur im Forward+-Backend verfügbar, nicht in den Methoden Forward Mobile oder Compatibility.

source: Godot uses a custom TAA implementation based on the old TAA implementation from `Spartan Engine <https://github.com/PanosK92/SpartanEngine>`__.
de: Godot verwendet eine benutzerdefinierte TAA-Implementierung, die auf der alten TAA-Implementierung der `Spartan Engine <https://github.com/PanosK92/SpartanEngine>`__ basiert.

source: Temporal antialiasing requires motion vectors to work. If motion vectors are not correctly generated, ghosting will occur when the camera or objects move.
de: Temporales Antialiasing erfordert Bewegungsvektoren, um zu funktionieren. Wenn die Bewegungsvektoren nicht korrekt erzeugt werden, kommt es zu Geisterbildern, wenn sich die Kamera oder Objekte bewegen.

source: Motion vectors are generated on the GPU in the main material shader. This is done by running the vertex shader corresponding to the previous rendered frame (with the previous camera transform) in addition to the vertex shader for the current rendered frame, then storing the difference between them in a color buffer.
de: Die Bewegungsvektoren werden auf der GPU im Hauptmaterial-Shader erzeugt. Dazu wird der Vertex-Shader des vorherigen gerenderten Frames (mit der vorherigen Kameratransformation) zusätzlich zum Vertex-Shader des aktuellen gerenderten Frames ausgeführt und die Differenz zwischen beiden in einem Farbpuffer gespeichert.

source: VoxelGI and SDFGI are only available in the Forward+ backend, not the Forward Mobile or Compatibility methods.
de: VoxelGI und SDFGI sind nur im Forward+-Backend verfügbar, nicht in den Methoden Forward Mobile oder Kompatibilität.

source: LightmapGI *baking* is only available in the Forward+ and Forward Mobile methods, and can only be performed within the editor (not in an exported project). LightmapGI *rendering* will eventually be supported by the Compatibility backend.
de: LightmapGI *backen* ist nur in den Methoden Forward+ und Forward Mobile verfügbar und kann nur innerhalb des Editors durchgeführt werden (nicht in einem exportierten Projekt). LightmapGI-*Rendering* wird irgendwann vom Kompatibilität-Backend unterstützt werden.

source: Godot supports voxel-based GI (VoxelGI), signed distance field GI (SDFGI) and lightmap baking and rendering (LightmapGI). These techniques can be used simultaneously if desired.
de: Godot unterstützt voxelbasiertes GI (VoxelGI), Signed Distance Field-GI (SDFGI), sowie Lightmap-Backen und -Rendering (LightmapGI). Diese Techniken können bei Bedarf gleichzeitig verwendet werden.

source: Lightmap baking happens on the GPU using Vulkan compute shaders. The GPU-based lightmapper is implemented in the LightmapperRD class, which inherits from the Lightmapper class. This allows for implementing additional lightmappers, paving the way for a future port of the CPU-based lightmapper present in Godot 3.x. This would allow baking lightmaps while using the Compatibility backend.
de: Das Backen von Lightmaps erfolgt auf der GPU unter Verwendung von Vulkan-Compute-Shadern. Der GPU-basierte Lightmapper ist in der LightmapperRD-Klasse implementiert, die von der Lightmapper-Klasse erbt. Dies ermöglicht die Implementierung zusätzlicher Lightmapper und ebnet den Weg für eine künftige Portierung des CPU-basierten Lightmappers in Godot 3.x. Dies würde das Backen von Lightmaps unter Verwendung des Kompatibilität-Backends ermöglichen.

source: **Core GI C++ code:**
de: **C++-Code für Core GI:**

source: **Core GI GLSL shaders:**
de: **Core GI GLSL Shader:**

source: **Lightmapper C++ code:**
de: **C++-Code für Lightmapper:**

source: **Lightmapper GLSL shaders:**
de: **Lightmapper GLSL Shader:**

source: Depth of field
de: Schärfentiefe

source: Only available in the Forward+ and Forward Mobile methods, not the Compatibility backend.
de: Nur verfügbar in den Methoden Forward+ und Forward Mobile, nicht im Kompatibilität-Backend.

source: The Forward+ and Forward Mobile methods use different approaches to DOF rendering, with different visual results. This is done to best match the performance characteristics of the target hardware. In Clustered Forward, DOF is performed using a compute shader. In Forward Mobile, DOF is performed using a fragment shader (raster).
de: Die Methoden Forward+ und Forward Mobile verwenden unterschiedliche Ansätze für das Schärfentiefe (DOF)-Rendering mit unterschiedlichen visuellen Ergebnissen. Dies geschieht, um die Performancemerkmale der Zielhardware bestmöglich zu erfüllen. Bei Clustered Forward wird DOF mit einem Compute-Shader ausgeführt. In Forward Mobile wird DOF mit einem Fragment-Shader (Raster) ausgeführt.

source: Box, hexagon and circle bokeh shapes are available (from fastest to slowest). Depth of field can optionally be jittered every frame to improve its appearance when temporal antialiasing is enabled.
de: Es stehen Box-, Hexagon und Kreis-Bokeh-Formen zur Verfügung (vom schnellsten zum langsamsten). Die Schärfentiefe kann optional bei jedem Bild gejittert werden, um das Erscheinungsbild zu verbessern, wenn das temporale Antialiasing aktiviert ist.

source: **Depth of field C++ code:**
de: **C++-Code zu Schärfentiefe:**

source: **Depth of field GLSL shader (compute - used for Forward+):**
de: **GLSL-Shader mit Schärfentiefe (Compute - verwendet für Forward+):**

source: **Depth of field GLSL shader (raster - used for Forward Mobile):**
de: **GLSL-Shader mit Schärfentiefe (Raster - verwendet für Forward Mobile):**
