Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/unit_testing.po
Languages: de, zh_tw

source: Unit testing
de: Unit-Tests
zh_tw: 位元移位

source: Godot Engine allows to write unit tests directly in C++. The engine integrates the `doctest <https://github.com/onqtam/doctest>`_ unit testing framework which gives ability to write test suites and test cases next to production code, but since the tests in Godot go through a different ``main`` entry point, the tests reside in a dedicated ``tests/`` directory instead, which is located at the root of the engine source code.
de: Die Godot Engine ermöglicht das Schreiben von Unit-Tests direkt in C++. Die Engine integriert das `doctest <https://github.com/onqtam/doctest>`_-Unit-Testing-Framework, das die Möglichkeit bietet, Test-Suites und Test-Cases neben dem Produktionscode zu schreiben. Da die Tests in Godot jedoch über einen anderen ``main``-Einstiegspunkt laufen, befinden sich die Tests stattdessen in einem eigenen ``tests/``-Verzeichnis, das sich im Stammverzeichnis des Quellcodes der Engine befindet.
zh_tw: Godot Engine 允許直接用 C++ 寫單元測試。該引擎整合了「doctest <https://github.com/onqtam/doctest>」_單元測試框架，該框架提供了在生產程式碼旁邊編寫測試套件和測試案例的能力，但由於Godot 中的測試經歷了不同的「 `main` 入口點，測試駐留在專用的 `tests/` 目錄中，該目錄位於引擎原始碼的根目錄下。

source: Platform and target support
de: Unterstützung von Plattformen und Targets
zh_tw: 支援平台

source: C++ unit tests can be run on Linux, macOS, and Windows operating systems.
de: C++-Unit-Tests können auf Linux-, macOS- und Windows-Betriebssystemen ausgeführt werden.
zh_tw: C++ 單元測試可以在 Linux、macOS 和 Windows 作業系統上運作。

source: Tests can only be run with editor ``tools`` enabled, which means that export templates cannot be tested currently.
de: Tests können nur mit aktivierten Editor-``Tools`` durchgeführt werden, was bedeutet, dass Exportvorlagen derzeit nicht getestet werden können.
zh_tw: 測試只能在啟用編輯器「tools」的情況下運作，這表示目前無法測試匯出範本。

source: Running tests
de: Ausführen von Tests
zh_tw: 執行遊戲

source: Before tests can be actually run, the engine must be compiled with the ``tests`` build option enabled (and any other build option you typically use), as the tests are not compiled as part of the engine by default:
de: Bevor die Tests tatsächlich ausgeführt werden können, muss die Engine mit der Build-Option ``tests`` kompiliert werden (plus jede andere Build-Option, die Sie normalerweise verwenden), da die Tests nicht als Teil der Engine standardmäßig kompiliert werden:
zh_tw: 在實際執行測試之前，必須在啟用「tests」建置選項（以及您通常使用的任何其他建置選項）的情況下編譯引擎，因為預設情況下測試不會編譯為引擎的一部分：

source: Once the build is done, run the tests with a ``--test`` command-line option:
de: Sobald der Build fertig ist, führen Sie die Tests mit der Kommandozeilenoption ``--test`` aus:
zh_tw: 建置完成後，使用“--test”命令列選項執行測試：

source: The test run can be configured with the various doctest-specific command-line options. To retrieve the full list of supported options, run the ``--test`` command with the ``--help`` option:
de: Der Testlauf kann mit den verschiedenen doctest-spezifischen Kommandozeilenoptionen konfiguriert werden. Um die vollständige Liste der unterstützten Optionen zu erhalten, führen Sie den Befehl ``--test`` mit der Option ``--help`` aus:
zh_tw: 可以使用各種特定於 doctest 的命令列選項來設定測試運作。若要檢索支援選項的完整列表，請執行帶有“--help”選項的“--test”命令：

source: Any other options and arguments after the ``--test`` command are treated as arguments for doctest.
de: Alle anderen Optionen und Argumente nach dem Befehl ``--test`` werden als Argumente für doctest behandelt.
zh_tw: “--test” 指令之後的任何其他選項和參數都被視為 doctest 的參數。

source: Tests are compiled automatically if you use the ``dev_mode=yes`` SCons option. ``dev_mode=yes`` is recommended if you plan on contributing to the engine development as it will automatically treat compilation warnings as errors. The continuous integration system will fail if any compilation warnings are detected, so you should strive to fix all warnings before opening a pull request.
de: Tests werden automatisch kompiliert, wenn Sie die ``dev_mode=yes`` SCons Option verwenden. ``dev_mode=yes`` wird empfohlen, wenn Sie vorhaben, zur Entwicklung der Engine beizutragen, da Compilerwarnungen automatisch als Fehler behandelt werden. Das Continuous-Integration-System wird fehlschlagen, wenn Compilerwarnungen entdeckt werden, daher sollten Sie sich bemühen, alle Warnungen zu beheben, bevor Sie einen Pull Request erstellen.
zh_tw: 如果您使用“dev_mode=yes” SCons 選項，測試會自動編譯。如果您打算為引擎開發做出貢獻，建議使用“dev_mode=yes”，因為它會自動將編譯警告視為錯誤。如果偵測到任何編譯警告，持續整合系統將會失敗，因此您應該在開啟拉取請求之前努力修復所有警告。

source: Filtering tests
de: Filtern von Tests
zh_tw: 篩選檔案

source: By default, all tests are run if you don't supply any extra arguments after the ``--test`` command. But if you're writing new tests or would like to see the successful assertions output coming from those tests for debugging purposes, you can run the tests of interest with the various filtering options provided by doctest.
de: Standardmäßig werden alle Tests ausgeführt, wenn Sie keine zusätzlichen Argumente nach dem ``--test`` Befehl angeben. Wenn Sie jedoch neue Tests schreiben oder die Ausgabe der erfolgreichen Assertions aus diesen Tests zu Debugging-Zwecken sehen möchten, können Sie die Tests, die Sie interessieren, mit den verschiedenen Filteroptionen von doctest ausführen.
zh_tw: 預設情況下，如果您在“--test”命令後不提供任何額外參數，則會執行所有測試。但是，如果您正在編寫新測試或希望查看這些測試的成功判斷提示輸出以進行偵錯，則可以使用 doctest 提供的各種篩選選項來執行感興趣的測試。

source: The wildcard syntax ``*`` is supported for matching any number of characters in test suites, test cases, and source file names:
de: Die Wildcard-Syntax ``*`` wird für die Suche nach einer beliebigen Anzahl von Zeichen in Testsuiten, Testfällen und Quellcode-Dateinamen unterstützt:
zh_tw: 支援通配符語法「*」來配對測試套件、測試案例和原始檔案名稱中的任意數量的字元：

source: **Filter options**
de: **Filter-Optionen**
zh_tw: **通用選項**

source: **Examples**
de: **Beispiele**
zh_tw: **範例**

source: ``--test-suite``
zh_tw: ``--test <test>``

source: ``--test-case``
zh_tw: ``--no-docbase``

source: ``-tc="*[String]*"``
zh_tw: ``String[]``

source: ``--source-file``
zh_tw: ``--quiet``

source: For instance, to run only the ``String`` unit tests, run:
de: Um zum Beispiel nur die ``String``-Unit-Tests auszuführen, führen Sie aus:
zh_tw: 例如，若要僅執行“String”單元測試，請執行：

source: Successful assertions output can be enabled with the ``--success`` (``-s``) option, and can be combined with any combination of filtering options above, for instance:
de: Die Ausgabe erfolgreicher Assertions kann mit der Option ``--success`` (``-s``) aktiviert werden und kann z.B. mit jeder Kombination der oben genannten Filteroptionen kombiniert werden:
zh_tw: 成功的判斷提示輸出可以使用“--success”（“-s”）選項啟用，並且可以與上述篩選選項的任意組合結合使用，例如：

source: Specific tests can be skipped with corresponding ``-exclude`` options. As of now, some tests include random stress tests which take a while to execute. In order to skip those kind of tests, run the following command:
de: Bestimmte Tests können mit den entsprechenden ``-exclude`` Optionen übersprungen werden. Zur Zeit beinhalten einige Tests zufällige Stresstests, die eine gewisse Zeit zur Ausführung benötigen. Um diese Art von Tests zu überspringen, führen Sie den folgenden Befehl aus:
zh_tw: 可以使用對應的“-exclude”選項跳過特定測試。截至目前，一些測試包括隨機壓力測試，需要一段時間才能執行。若要跳過此類測試，請執行以下命令：

source: Writing tests
de: Schreiben von Tests
zh_tw: 撰文風格

source: Test suites represent C++ header files which must be included as part of the main test entry point in ``tests/test_main.cpp``. Most test suites are located directly under ``tests/`` directory.
de: Test-Suites sind C++ Headerdateien, die als Teil des Haupteinstiegspunktes in ``tests/test_main.cpp`` eingebunden werden müssen. Die meisten Test-Suites befinden sich direkt im Verzeichnis ``tests/``.
zh_tw: 測試套件代表 C++ 頭檔案，必須將其作為主測試入口點的一部分包含在「tests/test_main.cpp」中。大多數測試套件直接位於“tests/”目錄下。

source: All header files are prefixed with ``test_``, and this is a naming convention which the Godot build system relies on to detect tests throughout the engine.
de: Allen Header-Dateien wird das Präfix ``test_`` vorangestellt. Dies ist eine Namenskonvention, auf die sich das Godot-Buildsystem verlässt, um Tests in der gesamten Engine zu erkennen.
zh_tw: 所有頭檔都以「test_」為前綴，這是 Godot 建置系統用來偵測整個引擎測試的命名約定。

source: Here's a minimal working test suite with a single test case written:
de: Hier ist eine minimale funktionierende Testsuite mit einem einzigen geschriebenen Test-Case:
zh_tw: 這是一個最小的工作測試套件，其中編寫了一個測試案例：

source: The ``tests/test_macros.h`` header encapsulates everything which is needed for writing C++ unit tests in Godot. It includes doctest assertion and logging macros such as ``CHECK`` as seen above, and of course the definitions for writing test cases themselves.
de: Der Header ``tests/test_macros.h`` kapselt alles, was zum Schreiben von C++-Unit-Tests in Godot benötigt wird. Er enthält Doctest-Assertion- und Logging-Makros wie ``CHECK`` (siehe oben) und natürlich die Definitionen zum Schreiben von Test-Cases selbst.
zh_tw: “tests/test_macros.h” 標頭封裝了所有在 Godot 中編寫 C++ 單元測試所需的內容。它包括 doctest 判斷提示和紀錄記錄宏，例如上面看到的“CHECK”，當然還有編寫測試案例本身的定義。

source: `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ source code for currently implemented macros and aliases for them.
de: `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ Quellcode für derzeit implementierte Makros und Aliase für diese Makros.
zh_tw: 有關各個錯誤巨集的更多資訊，請參考 Godot 原始碼中的 `core/error_macros.h <https://github.com/godotengine/godot/blob/master/core/error_macros.h>`__ 。

source: Test cases are created using ``TEST_CASE`` function-like macro. Each test case must have a brief description written in parentheses, optionally including custom tags which allow to filter the tests at run-time, such as ``[String]``, ``[Stress]`` etc.
de: Test-Cases werden mit dem funktionsähnlichen Makro ``TEST_CASE`` erstellt. Jeder Test-Case muss eine kurze Beschreibung in Klammern haben, optional mit eigenen Tags, die es erlauben, die Tests zur Laufzeit zu filtern, wie ``[String]``, ``[Stress]`` usw.
zh_tw: 測試案例是使用“TEST_CASE”類似函式的巨集建立的。每個測試案例必須有一個寫在括號中的簡短描述，可以選擇包含允許在執行時間篩選測試的自訂標籤，例如「[String]」、「[Stress]」等。

source: Test cases are written in a dedicated namespace. This is not required, but allows to prevent naming collisions for when other static helper functions are written to accommodate the repeating testing procedures such as populating common test data for each test, or writing parameterized tests.
de: Test-Cases werden in einem eigenen Namespace geschrieben. Dies ist nicht erforderlich, ermöglicht es aber, Namenskollisionen zu vermeiden, wenn andere statische Hilfsfunktionen geschrieben werden, um sich wiederholende Testverfahren unterzubringen, wie z.B. das Auffüllen gemeinsamer Testdaten für jeden Test oder das Schreiben parametrisierter Tests.
zh_tw: 測試案例編寫在專用的命名空間中。這不是必需的，但可以防止在編寫其他靜態幫助器函式以適應重複測試過程（例如為每個測試填充公共測試資料或編寫參數化測試）時發生命名衝突。

source: Godot supports writing tests per C++ module. For instructions on how to write module tests, refer to :ref:`doc_custom_module_unit_tests`.
de: Godot unterstützt das Schreiben von Tests pro C++-Modul. Anweisungen zum Schreiben von Modultests finden Sie in :ref:`doc_custom_module_unit_tests`.
zh_tw: 有關如何建立模組圖示，請參考 :ref:`Creating custom module icons<doc_custom_module_icons>` 。

source: Assertions
zh_tw: 注意事項

source: A list of all commonly used assertions used throughout the Godot tests, sorted by severity.
de: Eine Liste aller häufig verwendeten Assertions, die in den Godot-Tests verwendet werden, sortiert nach Schweregrad.
zh_tw: Godot 測試中常用的判斷提示列表，按嚴格程度排序。

source: **Assertion**
zh_tw: **版本**

source: **Description**
de: **Beschreibung**
zh_tw: **描述**

source: Test if condition holds true. Fails the entire test immediately if the condition does not hold true.
de: Testet, ob die Bedingung erfüllt ist. Der gesamte Test schlägt sofort fehl, wenn die Bedingung nicht zutrifft.
zh_tw: 檢查條件是否成立。如果條件不成立則會立即讓整個測試失敗。

source: Test if condition does not hold true. Fails the entire test immediately if the condition holds true.
de: Testet, wenn die Bedingung nicht erfüllt ist. Der gesamten Test schlägt sofort fehl, wenn die Bedingung erfüllt ist.
zh_tw: 檢查條件是否不成立。如果條件成立則會立即讓整個測試失敗。

source: Test if condition holds true. Marks the test run as failing, but allow to run other assertions.
de: Testet, ob die Bedingung erfüllt ist. Markiert den Testlauf als fehlgeschlagen, erlaubt aber die Ausführung anderer Assertions.
zh_tw: 檢查條件是否成立。會將測試表示為失敗，但允許運作其他判斷提示。

source: Test if condition does not hold true. Marks the test run as failing, but allow to run other assertions.
de: Testet, ob die Bedingung nicht erfüllt ist. Markiert den Testlauf als fehlgeschlagen, erlaubt aber die Ausführung anderer Assertions.
zh_tw: 檢查條件是否不成立。會將測試表示為失敗，但允許運作其他判斷提示。

source: Test if condition holds true. Does not fail the test under any circumstance, but logs a warning if something does not hold true.
de: Testet, ob die Bedingung erfüllt ist. Lässt den Test unter keinen Umständen fehlschlagen, gibt aber eine Warnung aus, etwas nicht "true" ergibt.
zh_tw: 檢查條件是否成立。任何情況下都不會讓測試失敗，但是不成立時會記錄一條警告。

source: Test if condition does not hold true. Does not fail the test under any circumstance, but logs a warning if something holds true.
de: Testet, ob die Bedingung nicht zutrifft. Lässt den Test unter keinen Umständen fehlschlagen, gibt aber eine Warnung aus, wenn etwas "true" ergibt.
zh_tw: 檢查條件是否不成立。任何情況下都不會讓測試失敗，但是成立時會記錄一條警告。

source: All of the above assertions have corresponding ``*_MESSAGE`` macros, which allow to print optional message with rationale of what should happen.
de: Alle oben genannten Assertions haben entsprechende ``*_MESSAGE``-Makros, die es erlauben, eine optionale Nachricht mit der Begründung auszugeben, was erwartet wird.
zh_tw: 以上判斷提示都有對應的 ``*_MESSAGE`` 宏，能夠在原有行為的基礎上輸出可選的消息。

source: Prefer to use ``CHECK`` for self-explanatory assertions and ``CHECK_MESSAGE`` for more complex ones if you think that it deserves a better explanation.
de: Bevorzugen Sie ``CHECK`` für selbsterklärende Assertions und ``CHECK_MESSAGE`` für komplexere, wenn Sie denken, dass diese eine bessere Erklärung verdienen.
zh_tw: 對於能夠自我說明的判斷提示請儘量使用 ``CHECK``，如果你認為相對複雜的判斷提示需要更好的解釋再使用 ``CHECK_MESSAGE``。

source: `doctest: Assertion macros <https://github.com/onqtam/doctest/blob/master/doc/markdown/assertions.md>`_.
de: `Doctest: Assertion-Makros <https://github.com/onqtam/doctest/blob/master/doc/markdown/assertions.md>`_.
zh_tw: `doctest: 判斷提示宏 <https://github.com/onqtam/doctest/blob/master/doc/markdown/assertions.md>`_。

source: Logging
zh_tw: 偵錯

source: The test output is handled by doctest itself, and does not rely on Godot printing or logging functionality at all, so it's recommended to use dedicated macros which allow to log test output in a format written by doctest.
de: Die Testausgabe wird von doctest selbst gehandhabt und verlässt sich nicht auf die Print- oder Logging-Funktionalität von Godot. Es wird daher empfohlen, spezielle Makros zu verwenden, die es ermöglichen, die Testausgabe in einem von doctest geschriebenen Format zu loggen.
zh_tw: 測試輸出由 doctest 本身處理，根本不依賴 Godot 列印或紀錄記錄功能，因此建議使用專用宏，它允許以 doctest 編寫的格式記錄測試輸出。

source: Prints a message.
de: Gibt eine Nachricht aus.
zh_tw: 列印一條訊息。

source: Marks the test as failing, but continue the execution. Can be wrapped in conditionals for complex checks.
de: Markiert den Test als fehlgeschlagen, setzt aber die Ausführung fort. Kann für komplexe Prüfungen in Conditionals verpackt werden.
zh_tw: 將測試標記為失敗，但繼續執行。可以包含在條件敘述中以進行複雜的檢查。

source: Fails the test immediately. Can be wrapped in conditionals for complex checks.
de: Der Test schlägt sofort fehl. Kann für komplexe Prüfungen in Conditionals verpackt werden.
zh_tw: 測試立即失敗。可以包含在條件敘述中以進行複雜的檢查。

source: Different reporters can be chosen at run-time. For instance, here's how the output can be redirected to a XML file:
de: Zur Laufzeit können verschiedene Reporter gewählt werden. So kann zum Beispiel die Ausgabe in eine XML-Datei umgeleitet werden:
zh_tw: 可以在運作時選擇不同的記者。例如，以下是將輸出重新導向到 XML 檔案的方法：

source: `doctest: Logging macros <https://github.com/onqtam/doctest/blob/master/doc/markdown/logging.md>`_.
de: `Doctest: Logging-Makros <https://github.com/onqtam/doctest/blob/master/doc/markdown/logging.md>`_.
zh_tw: `doctest：記錄巨集<https://github.com/onqtam/doctest/blob/master/doc/markdown/logging.md>`_。

source: Testing failure paths
de: Testen von Fehlerpfaden
zh_tw: 匯入翻譯

source: Sometimes, it's not always feasible to test for an *expected* result. With the Godot development philosophy of that the engine should not crash and should gracefully recover whenever a non-fatal error occurs, it's important to check that those failure paths are indeed safe to execute without crashing the engine.
de: Manchmal ist es nicht möglich, auf ein *erwartetes* Ergebnis zu testen. Da die Godot-Entwicklungsphilosophie vorsieht, dass die Engine nicht abstürzen und sich bei Auftreten eines nicht-kritischen Fehlers ordnungsgemäß erholen soll, ist es wichtig zu prüfen, ob diese Fehlerpfade tatsächlich sicher ausgeführt werden können, ohne dass die Engine abstürzt.
zh_tw: 有時，測試「預期」結果並不總是可行。按照 Godot開發理念，引擎不應當機，並且在發生非致命錯誤時應正常恢復，因此檢查這些故障路徑是否確實可以安全執行而不會使引擎當機非常重要。

source: *Unexpected* behavior can be tested in the same way as anything else. The only problem this creates is that the error printing shall unnecessarily pollute the test output with errors coming from the engine itself (even if the end result is successful).
de: *Unerwartetes* Verhalten kann auf die gleiche Weise getestet werden wie alles andere. Das einzige Problem, das dadurch entsteht, ist, dass der Fehlertext die Testausgabe unnötig mit Fehlern vermüllt, die von der Engine selbst stammen (selbst wenn das Endergebnis erfolgreich ist).
zh_tw: *意外*行為可以用與其他任何行為相同的方式進行測試。這產生的唯一問題是錯誤列印會不必要地污染來自引擎本身的錯誤的測試輸出（即使最終結果是成功的）。

source: To alleviate this problem, use ``ERR_PRINT_OFF`` and ``ERR_PRINT_ON`` macros directly within test cases to temporarily disable the error output coming from the engine, for instance:
de: Um dieses Problem zu umgehen, können Sie die Makros ``ERR_PRINT_OFF`` und ``ERR_PRINT_ON`` direkt in den Testfällen verwenden, um z.B. die Fehlerausgabe der Engine vorübergehend zu deaktivieren:
zh_tw: 為了緩解這個問題，請直接在測試案例中使用“ERR_PRINT_OFF”和“ERR_PRINT_ON”巨集來暫時停用來自引擎的錯誤輸出，例如：

source: Test tools
zh_tw: 2D 工具

source: Test tools are advanced methods which allow you to run arbitrary procedures to facilitate the process of manual testing and debugging the engine internals.
de: Test-Tools sind fortgeschrittene Methoden, die es Ihnen ermöglichen, beliebige Prozeduren auszuführen, um den Prozess des manuellen Testens und des Debuggens der Engine-Interna zu erleichtern.
zh_tw: 測試工具是先進的方法，可讓您運作任意程式，以方便手動測試和除錯引擎內部的過程。

source: These tools can be run by supplying the name of a tool after the ``--test`` command-line option. For instance, the GDScript module implements and registers several tools to help the debugging of the tokenizer, parser, and compiler:
de: Diese Tools können durch die Angabe des Namens eines Tools nach der ``--test`` Kommandozeilenoption gestartet werden. Zum Beispiel implementiert und registriert das GDScript-Modul mehrere Tools, die bei der Fehlersuche im Tokenizer, Parser und Compiler helfen:
zh_tw: 可以透過在「--test」命令列選項後提供工具名稱來運作這些工具。例如，GDScript 模組實作並註冊了幾個工具來幫助偵錯分詞器、解析器和編譯器：

source: If any such tool is detected, then the rest of the unit tests are skipped.
de: Wird ein solches Tool entdeckt, werden die restlichen Unit-Tests übersprungen.
zh_tw: 如果偵測到任何此類工具，則跳過其餘的單元測試。

source: Test tools can be registered anywhere throughout the engine as the registering mechanism closely resembles of what doctest provides while registering test cases using dynamic initialization technique, but usually these can be registered at corresponding ``register_types.cpp`` sources (per module or core).
de: Test-Tools können überall in der Engine registriert werden, da der Registrierungsmechanismus dem von doctest ähnelt, wenn Testfälle mit dynamischer Initialisierungstechnik registriert werden, aber normalerweise können diese in den entsprechenden ``register_types.cpp``-Quellen (pro Modul oder Kern) registriert werden.
zh_tw: 測試工具可以在整個引擎的任何地方註冊，因為註冊機制與doctest 在使用動態初始化技術註冊測試案例時提供的機制非常相似，但通常這些可以在相應的「register_types.cpp」來源中註冊（每個模組或核心） 。

source: Here's an example of how GDScript registers test tools in ``modules/gdscript/register_types.cpp``:
de: Hier ist ein Beispiel dafür, wie GDScript Test-Tools in ``modules/gdscript/register_types.cpp`` registriert:
zh_tw: 以下是 GDScript 如何在「modules/gdscript/register_types.cpp」中註冊測試工具的範例：

source: The custom command-line parsing can be performed by a test tool itself with the help of OS :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>` method.
de: Das benutzerdefinierte Parsen der Kommandozeile kann von einem Test-Tool selbst mit Hilfe der Methode OS :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>` durchgeführt werden.
zh_tw: 自訂命令列解析可以由測試工具本身在 OS get_cmdline_args<class_OS_method_get_cmdline_args>` 方法的幫助下執行。

source: Integration tests for GDScript
de: Integrationstests für GDScript
zh_tw: 在 GDScript 中實體化 C# 節點

source: Godot uses doctest to prevent regressions in GDScript during development. There are several types of test scripts which can be written:
de: Godot verwendet doctest, um Regressions-Bugs in GDScript während der Entwicklung zu verhindern. Es gibt mehrere Arten von Testskripten, die geschrieben werden können:
zh_tw: Godot 使用 doctest 來防止開發過程中 GDScript 中的迴歸。可以編寫多種型別的測試腳本：

source: tests for expected errors;
de: Tests für erwartete Fehler;
zh_tw: 測試預期錯誤;

source: tests for warnings;
de: Tests für Warnungen;
zh_tw: 警告測試;

source: tests for features.
de: Tests für Performancemerkmale.
zh_tw: 功能列表

source: Therefore, the process of writing integration tests for GDScript is the following:
de: Der Prozess der Erstellung von Integrationstests für GDScript sieht daher wie folgt aus:
zh_tw: 因此，為GDScript編寫整合測試的流程如下：

source: Pick a type of a test script you'd like to write, and create a new GDScript file under the ``modules/gdscript/tests/scripts`` directory within corresponding sub-directory.
de: Wählen Sie einen Typ eines Testskripts, das Sie schreiben möchten, und erstellen Sie eine neue GDScript-Datei im Verzeichnis ``modules/gdscript/tests/scripts`` im entsprechenden Unterverzeichnis.
zh_tw: 選擇您想要編寫的測試腳本型別，然後在對應子目錄中的「modules/gdscript/tests/scripts」目錄下建立新的 GDScript 檔案。

source: Write GDScript code. The test script must have a function called ``test()`` which takes no arguments. Such function will be called by the test runner. The test should not have any dependency unless it's part of the test too. Global classes (using ``class_name``) are registered before the runner starts, so those should work if needed.
de: Schreiben Sie GDScript-Code. Das Testskript muss eine Funktion namens ``test()`` enthalten, die keine Argumente benötigt. Diese Funktion wird vom Test-Runner aufgerufen. Der Test sollte keine Abhängigkeiten haben, es sei denn, sie sind auch Teil des Tests. Globale Klassen (mit ``class_name``) werden vor dem Start des Test-Runners registriert, so dass diese bei Bedarf funktionieren sollten.
zh_tw: 編寫 GDScript 程式碼。測試腳本必須有一個名為「test()」的函式，該函式不帶參數。這樣的函式將由測試運作器呼叫。測試不應該有任何依賴性，除非它也是測試的一部分。全域類別（使用“class_name”）在運作器啟動之前註冊，因此如果需要的話這些應該可以工作。

source: Here's an example test script:
de: Hier ist ein Beispiel für ein Testskript:
zh_tw: 下列為有兩個骨頭的骨骼節點範例：

source: Generate ``*.out`` files to update the expected results from the output:
de: Erzeugen Sie ``*.out``-Dateien, um die erwarteten Ergebnisse der Ausgabe zu aktualisieren:
zh_tw: 產生“*.out”檔案以更新輸出的預期結果：
