Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/unit_testing.po
Languages: de, zh_tw

source: You may add the ``--print-filenames`` option to see filenames as their test outputs are generated. If you are working on a new feature that is causing hard crashes, you can use this option to quickly find which test file causes the crash and debug from there.
de: Sie können die Option ``--print-filenames`` hinzufügen, um die Dateinamen zu sehen, während die Testausgaben erzeugt werden. Wenn Sie an einem neuen Feature arbeiten, die schwere Abstürze verursacht, können Sie diese Option verwenden, um schnell herauszufinden, welche Testdatei den Absturz verursacht, und von dort aus debuggen.
zh_tw: 您可以新增「--print-filenames」選項來查看產生測試輸出的檔案名稱。如果您正在開發導致硬當機的新功能，則可以使用此選項快速尋找導致當機的測試檔案並從那裡進行偵錯。

source: Run GDScript tests with:
de: Führen Sie GDScript-Tests aus mit:
zh_tw: GDScript的匯出

source: This also accepts the ``--print-filenames`` option (see above).
de: Dies akzeptiert auch die Option ``--print-filenames`` (siehe oben).
zh_tw: 這也接受“--print-filenames”選項（見上文）。

source: If no errors are printed and everything goes well, you're done!
de: Wenn keine Fehler ausgegeben werden und alles gut geht, sind Sie fertig!
zh_tw: 如果沒有列印任何錯誤並且一切順利，那麼您就完成了！

source: Make sure the output does have the expected values before submitting a pull request. If ``--gdscript-generate-tests`` produces ``*.out`` files which are unrelated to newly added tests, you should revert those files back and only commit ``*.out`` files for new tests.
de: Vergewissern Sie sich, dass die Ausgabe die erwarteten Werte hat, bevor Sie einen Pull Request einreichen. Wenn ``--gdscript-generate-tests`` ``*.out``-Dateien erzeugt, die nichts mit den neu hinzugefügten Tests zu tun haben, sollten Sie diese Dateien reverten und nur ``*.out`` Dateien für neue Tests committen.
zh_tw: 在提交拉取請求之前，請確保輸出確實具有預期值。如果「--gdscript-generate-tests」產生與新新增的測試無關的「*.out」檔案，您應該恢復這些檔案並只為新測試提交「*.out」檔案。

source: The GDScript test runner is meant for testing the GDScript implementation, not for testing user scripts nor testing the engine using scripts. We recommend writing new tests for already resolved `issues related to GDScript at GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_, or writing tests for currently working features.
de: Der GDScript-Testrunner ist zum Testen der GDScript-Implementierung gedacht, nicht zum Testen von Benutzerskripten oder zum Testen der Engine mithilfe von Skripten. Wir empfehlen, neue Tests für bereits gelöste `Issues im Zusammenhang mit GDScript auf GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_ zu schreiben, oder Tests für derzeit in Arbeit befindliche Features zu schreiben.
zh_tw: GDScript 測試執行程式旨在測試 GDScript 實作，而不是測試使用者腳本或使用腳本測試引擎。我們建議為GitHub 上已解決的「與GDScript 相關的問題<https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aheld>」編寫新測試，或為目前工作的功能編寫測試。

source: If your test case requires that there is no ``test()`` function present inside the script file, you can disable the runtime section of the test by naming the script file so that it matches the pattern ``*.notest.gd``. For example, "test_empty_file.notest.gd".
de: Wenn Ihr Test Case erfordert, dass innerhalb der Skriptdatei keine ``test()`` Funktion vorhanden ist, können Sie den Laufzeitabschnitt des Tests deaktivieren, indem Sie die Skriptdatei so benennen, dass sie dem Muster ``*.notest.gd`` entspricht. Zum Beispiel: "test_empty_file.notest.gd".
zh_tw: 如果您的測試案例要求腳本檔案中不存在「test()」函式，您可以透過命名腳本檔案來停用測試的執行時間部分，使其與模式「*.notest.gd」相符``。例如，「test_empty_file.notes.gd」。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: **Shorthand**
de: **Abkürzung**

source: **Macro**
de: **Makro**

source: Change directory to the Godot source repository root.
de: Wechseln Sie in das Stammverzeichnis des Godot-Quellcode-Repositorys.
