Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/variant_class.po
Languages: de

source: Variant class
de: Die Klasse "Variant"

source: About
de: Über

source: Variant is the most important datatype of Godot, it's the most important class in the engine. A Variant takes up only 20 bytes and can store almost any engine datatype inside of it. Variants are rarely used to hold information for long periods of time, instead they are used mainly for communication, editing, serialization and generally moving data around.
de: Variant ist der wichtigste Datentyp von Godot, es ist die wichtigste Klasse in der Engine. Ein Variant benötigt nur 20 Bytes und kann fast jeden Engine-Datentyp darin speichern. Variants werden selten verwendet, um Informationen über einen längeren Zeitraum zu speichern. Stattdessen werden sie hauptsächlich für die Kommunikation, Bearbeitung, Serialisierung und das allgemeine Verschieben von Daten verwendet.

source: A Variant can:
de: Ein Variant kann:

source: Store almost any datatype
de: fast jeden Datentyp speichern

source: Perform operations between many variants (GDScript uses Variant as its atomic/native datatype).
de: Operationen zwischen vielen Variants ausführen (GDScript verwendet Variant als atomaren/nativen Datentyp).

source: Be hashed, so it can be compared quickly to other variants
de: gehasht sein, damit sie schnell mit anderen Variants verglichen werden können

source: Be used to convert safely between datatypes
de: verwendet werden, um sicher zwischen Datentypen zu konvertieren

source: Be used to abstract calling methods and their arguments (Godot exports all its functions through variants)
de: verwendet werden, um aufrufende Methoden und ihre Argumente zu abstrahieren (Godot exportiert alle seine Funktionen über Variants)

source: Be used to defer calls or move data between threads.
de: verwendet werden, um Anrufe zu verschieben oder Daten zwischen Threads zu verschieben.

source: Be serialized as binary and stored to disk, or transferred via network.
de: binär serialisiert und auf der Festplatte gespeichert oder über das Netzwerk übertragen werden.

source: Be serialized to text and use it for printing values and editable settings.
de: in Text serialisiert und dies zum Ausgeben von Werten und bearbeitbaren Einstellungen verwenden.

source: Work as an exported property, so the editor can edit it universally.
de: wie eine exportierte Property arbeiten, damit der Editor sie universell bearbeiten kann.

source: Be used for dictionaries, arrays, parsers, etc.
de: für Dictionaries, Arrays, Parser usw. verwendet werden.

source: Basically, thanks to the Variant class, writing Godot itself was a much, much easier task, as it allows for highly dynamic constructs not common of C++ with little effort. Become a friend of Variant today.
de: Dank der Variant-Klasse war das Schreiben von Godot selbst eine viel, viel einfachere Aufgabe, da es mit wenig Aufwand hochdynamische Konstrukte ermöglicht, die in C++ nicht üblich sind. Werden Sie noch heute ein Freund von Variants.

source: References:
de: Referenzen:

source: Containers: Dictionary and Array
de: Container: Dictionary und Array

source: Both are implemented using variants. A Dictionary can match any datatype used as key to any other datatype. An Array just holds an array of Variants. Of course, a Variant can also hold a Dictionary and an Array inside, making it even more flexible.
de: Beide werden mit Variants implementiert. Ein Dictionary kann jeden Datentyp als Schlüssel jedem anderen Datentyp zuordnen. Ein Array enthält lediglich ein Array von Variants. Natürlich kann eine Variant auch ein Dictionary und ein Array enthalten, was es noch flexibler macht.

source: Modifications to a container will modify all references to it. A Mutex should be created to lock it if multi threaded access is desired.
de: Durch Änderungen an einem Container werden alle Verweise darauf geändert. Es sollte ein Mutex erstellt werden, um ihn zu locken, wenn ein Multithreading-Zugriff gewünscht wird.

source: Copy-on-write (COW) mode support for containers was dropped with Godot 3.0.
de: Die Unterstützung des COW-Modus (Copy-on-Write) für Container wurde mit Godot 3.0 eingestellt.

source: Translation status
de: Übersetzungsstatus
