Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/high_level_multiplayer.po
Languages: de, zh_tw

source: Remote procedure calls, or RPCs, are functions that can be called on other peers. To create one, use the ``@rpc`` annotation before a function definition. To call an RPC, use ``Callable``'s method ``rpc()`` to call in every peer, or ``rpc_id()`` to call in a specific peer.
de: Remote Procedure Calls (RPCs) sind Funktionen, die auf anderen Peers aufgerufen werden können. Um einen RPC zu erstellen, verwenden Sie die ``@rpc``-Annotation vor einer Funktionsdefinition. Um einen RPC aufzurufen, verwenden Sie die Methode ``rpc()`` von ``Callable``, um jeden Peer aufzurufen, oder ``rpc_id()``, um einen bestimmten Peer aufzurufen.
zh_tw: 遠端過程呼叫（RPC）是可以在其他對等點上呼叫的函式。若要建立一個，請在函式定義之前使用“@rpc”註解。若要呼叫 RPC，請使用 Callable 的方法 rpc() 來呼叫每個對等點，或使用 rpc_id() 來呼叫特定對等點。

source: RPCs will not serialize objects or callables.
de: RPCs serialisieren keine Objekte oder Callables.
zh_tw: RPC 不會序列化物件或可呼叫物件。

source: For a remote call to be successful, the sending and receiving node need to have the same ``NodePath``, which means they must have the same name. When using ``add_child()`` for nodes which are expected to use RPCs, set the argument ``force_readable_name`` to ``true``.
de: Damit ein Remote Call erfolgreich ist, müssen der sendende und der empfangende Node den gleichen ``NodePath`` haben, was bedeutet, dass sie den gleichen Namen haben müssen. Wenn Sie ``add_child()`` für Nodes verwenden, von denen erwartet wird, dass sie RPCs benutzen, setzen Sie das Argument ``force_readable_name`` auf ``true``.
zh_tw: 為了使遠端呼叫成功，發送節點和接收節點需要具有相同的“NodePath”，這意味著它們必須具有相同的名稱。當對預期使用 RPC 的節點使用「add_child()」時，請將參數「force_read_name」設為「true」。

source: The annotation can take a number of arguments, which have default values. ``@rpc`` is equivalent to:
de: Die Annotation kann eine Reihe von Argumenten annehmen, die Default-Werte haben. ``@rpc`` ist äquivalent zu:
zh_tw: 註解可以採用多個參數，這些參數具有預設值。 ``@rpc`` 相當於：

source: The parameters and their functions are as follows:
de: Die Parameter und ihre Funktionen sind wie folgt:
zh_tw: 常見的使用情景如下：

source: ``"authority"``: Only the multiplayer authority (the server) can call remotely.
de: ``"authority"``: Nur die Multiplayer-Autorität (der Server) kann aus der Remote-Calls ausführen.
zh_tw: 『「authority」『：只有多人權限（伺服器）才能遠端呼叫。

source: ``"any_peer"``: Clients are allowed to call remotely. Useful for transferring user input.
de: ``"any_peer"``: Clients dürfen Remote-Calls ausführen. Nützlich für die Übermittlung von Benutzereingaben.
zh_tw: ``“any_peer”``：允許客戶端遠端呼叫。對於傳輸使用者輸入很有用。

source: ``"call_remote"``: The function will not be called on the local peer.
de: ``"call_remote"``: Die Funktion wird nicht auf dem lokalen Peer aufgerufen.
zh_tw: **注意**：如果引擎當機或無回應，該函式不會被呼叫。

source: ``"call_local"``: The function can be called on the local peer. Useful when the server is also a player.
de: ``"call_local"``: Die Funktion kann auf dem lokalen Peer aufgerufen werden. Nützlich, wenn der Server auch ein Spieler ist.
zh_tw: ``“call_local”``：可以在本地對等點上呼叫函式。當伺服器同時也是玩家時很有用。

source: ``"unreliable"`` Packets are not acknowledged, can be lost, and can arrive at any order.
de: ``"unreliable"`` Pakete werden nicht quittiert, können verloren gehen und in beliebiger Reihenfolge ankommen.
zh_tw: ``「不可靠」`` 封包未被確認，可能會遺失，並且可能以任何順序到達。

source: ``"unreliable_ordered"`` Packets are received in the order they were sent in. This is achieved by ignoring packets that arrive later if another that was sent after them has already been received. Can cause packet loss if used incorrectly.
de: ``"unreliable_ordered"`` Pakete werden in der Reihenfolge empfangen, in der sie gesendet wurden. Dies wird dadurch erreicht, dass Pakete, die später eintreffen, ignoriert werden, wenn ein anderes, das nach ihnen gesendet wurde, bereits empfangen wurde. Kann bei unsachgemäßer Verwendung zu Paketverlusten führen.
zh_tw: ``「unreliable_ordered」`` 封包按照發送的順序接收。這是透過忽略稍後到達的封包（如果已經收到在它們之後發送的另一個封包）來實作的。如果使用不當可能會導致丟包。

source: ``"reliable"`` Resend attempts are sent until packets are acknowledged, and their order is preserved. Has a significant performance penalty.
de: ``"reliable"`` Wiederholte Sendeversuche werden gesendet, bis die Pakete bestätigt werden, und ihre Reihenfolge wird beibehalten. Hat einen erheblichen Performance-Verlust.
zh_tw: ``「可靠」`` 發送重新傳送嘗試，直到封包被確認為止，並且它們的順序被保留。具有顯著的性能損失。

source: ``transfer_channel`` is the channel index.
de: ``transfer_channel`` ist der Kanalindex.
zh_tw: ``transfer_channel`` 是頻道索引。

source: The first 3 can be passed in any order, but ``transfer_channel`` must always be last.
de: Die ersten 3 können in beliebiger Reihenfolge übergeben werden, aber ``transfer_channel`` muss immer an letzter Stelle stehen.
zh_tw: 前 3 個可以按任何順序傳遞，但「transfer_channel」必須始終是最後一個。

source: The function ``multiplayer.get_remote_sender_id()`` can be used to get the unique id of an rpc sender, when used within the function called by rpc.
de: Die Funktion ``multiplayer.get_remote_sender_id()`` kann verwendet werden, um die eindeutige ID eines rpc-Senders zu erhalten, wenn sie innerhalb der von rpc aufgerufenen Funktion verwendet wird.
zh_tw: 當在 rpc 呼叫的函式中使用時，函式「multiplayer.get_remote_sender_id()」可用於取得 rpc 發送者的唯一 ID。

source: Channels
de: Kanäle
zh_tw: 改動

source: Modern networking protocols support channels, which are separate connections within the connection. This allows for multiple streams of packets that do not interfere with each other.
de: Moderne Netzwerkprotokolle unterstützen Kanäle, die separate Verbindungen innerhalb einer Verbindung darstellen. Dies ermöglicht mehrere Paketströme, die sich nicht gegenseitig stören.
zh_tw: 現代網路協定支援通道，通道是連接內的單獨連接。這允許多個封包流互不干擾。

source: For example, game chat related messages and some of the core gameplay messages should all be sent reliably, but a gameplay message should not wait for a chat message to be acknowledged. This can be achieved by using different channels.
de: Zum Beispiel sollten sowohl die Nachrichten, die sich auf den Spielchat beziehen, als auch einige der wichtigsten Gameplay-Nachrichten zuverlässig gesendet werden, aber eine Gameplay-Nachricht sollte nicht darauf warten, dass eine Chat-Nachricht bestätigt wird. Dies kann durch die Verwendung verschiedener Kanäle erreicht werden.
zh_tw: 例如，遊戲聊天相關訊息和一些核心遊戲訊息都應該可靠地發送，但遊戲訊息不應等待聊天訊息被確認。這可以透過使用不同的管道來實作。

source: Channels are also useful when used with the unreliable ordered transfer mode. Sending packets of variable size with this transfer mode can cause packet loss, since packets which are slower to arrive are ignored. Separating them into multiple streams of homogeneous packets by using channels allows ordered transfer with little packet loss, and without the latency penalty caused by reliable mode.
de: Kanäle sind auch nützlich, wenn sie mit dem unzuverlässigen geordneten Übertragungsmodus verwendet werden. Das Senden von Paketen unterschiedlicher Größe mit diesem Übertragungsmodus kann zu Paketverlusten führen, da Pakete, die langsamer ankommen, ignoriert werden. Die Aufteilung in mehrere Ströme homogener Pakete durch die Verwendung von Kanälen ermöglicht eine geordnete Übertragung mit geringen Paketverlusten und ohne die durch den zuverlässigen Modus verursachte Latenzzeit.
zh_tw: 當與不可靠的有序傳輸模式一起使用時，通道也很有用。使用此傳輸模式發送可變大小的封包可能會導致封包遺失，因為到達較慢的封包將被忽略。透過使用通道將它們分成多個同質封包流，可以實作有序傳輸，且封包遺失很少，並且不會因可靠模式而導致延遲損失。

source: Example lobby implementation
de: Beispiel einer Lobby-Implementierung
zh_tw: 實作

source: This is an example lobby that can handle peers joining and leaving, notify UI scenes through signals, and start the game after all clients have loaded the game scene.
de: Dies ist ein Beispiel für eine Lobby, die den Beitritt und das Verlassen von Peers verarbeiten kann, die UI-Szenen durch Signale benachrichtigt und das Spiel startet, nachdem alle Clients die Spielszene geladen haben.
zh_tw: 這是一個範例大廳，可以處理同伴的加入和離開，透過訊號通知UI場景，並在所有客戶端載入遊戲場景後啟動遊戲。

source: The game scene's root node should be named Game. In the script attached to it:
de: Der Root Node der Spielszene sollte den Namen Game tragen. In dem dazugehörigen Skript:
zh_tw: 遊戲場景的根節點應命名為 Game。在附加的腳本中：

source: Exporting for dedicated servers
de: Exportieren für dedizierte Server
zh_tw: 為專用伺服器匯出

source: Once you've made a multiplayer game, you may want to export it to run it on a dedicated server with no GPU available. See :ref:`doc_exporting_for_dedicated_servers` for more information.
de: Sobald Sie ein Multiplayer-Spiel erstellt haben, möchten Sie es möglicherweise exportieren, um es auf einem dedizierten Server ohne verfügbare GPU auszuführen. Weitere Informationen finden Sie unter :ref:`doc_exporting_for_dedicated_servers`.
zh_tw: 一旦你製作了一個多人遊戲, 你可能會想匯出它到一個沒有GPU的專用伺服器上運作. 參見 :ref:`doc_exporting_for_dedicated_servers` 獲取更多資訊.

source: The code samples on this page aren't designed to run on a dedicated server. You'll have to modify them so the server isn't considered to be a player. You'll also have to modify the game starting mechanism so that the first player who joins can start the game.
de: Die Codebeispiele auf dieser Seite können nicht auf einem dedizierten Server ausgeführt werden. Sie müssen sie ändern, damit der Server nicht als Spieler betrachtet wird. Sie müssen auch den Spielstartmechanismus ändern, damit der erste Spieler, der beitritt, das Spiel starten kann.
zh_tw: 這個頁面上的程式碼樣本並不是為了在專用伺服器上運作而設計的. 必須修改它們, 使伺服器不被認為是一個玩家, 還必須修改遊戲啟動機制, 使第一個加入的玩家可以啟動遊戲.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: The default channel with index 0 is actually three different channels - one for each transfer mode.
de: Der Default-Kanal mit dem Index 0 besteht eigentlich aus drei verschiedenen Kanälen - einer für jeden Übertragungsmodus.
