Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/high_level_multiplayer.po
Languages: de, zh_tw

source: High-level multiplayer
zh_tw: 高級多人遊戲

source: High-level vs low-level API
zh_tw: 高階 API v.s. 低階 API

source: The following explains the differences of high- and low-level networking in Godot as well as some fundamentals. If you want to jump in head-first and add networking to your first nodes, skip to `Initializing the network`_ below. But make sure to read the rest later on!
de: Im Folgenden werden die Unterschiede zwischen High-Level- und Low-Level-Netzwerkfunktionen in Godot sowie einige grundlegende Aspekte erläutert. Wenn Sie sofort loslegen und Ihre ersten Nodes mit Netzwerkfunktionen ausstatten wollen, lesen Sie bitte weiter unten unter `Netzwerkinitialisierung`_. Aber lesen Sie später unbedingt den Rest!
zh_tw: 以下為 Godot 中高階與低階網路的區別，以及一些基礎說明。若想直接將網路加到第一個節點上，請跳至下方的 `初始化網路`_ 。但請記得等一下再回來讀剩下的部分！

source: Godot always supported standard low-level networking via :abbr:`UDP (User Datagram Protocol)`, :abbr:`TCP (Transmission Control Protocol)` and some higher-level protocols such as :abbr:`HTTP (Hypertext Transfer Protocol)` and :abbr:`SSL (Secure Sockets Layer)`. These protocols are flexible and can be used for almost anything. However, using them to synchronize game state manually can be a large amount of work. Sometimes that work can't be avoided or is worth it, for example when working with a custom server implementation on the backend. But in most cases, it's worthwhile to consider Godot's high-level networking API, which sacrifices some of the fine-grained control of low-level networking for greater ease of use.
de: Godot unterstützte immer Standard-Low-Level-Netzwerkfunktionen über :abbr:`UDP (User Datagram Protocol)`, :abbr:`TCP (Transmission Control Protocol)` und einige High-Level-Protokolle, wie :abbr:`HTTP (Hypertext Transfer Protocol)` und :abbr:`SSL (Secure Sockets Layer)`. Diese Protokolle sind flexibel und können für fast alles verwendet werden. Allerdings kann die manuelle Synchronisierung des Spielstatus eine Menge Arbeit bedeuten. Manchmal lässt sich dieser Aufwand nicht vermeiden oder ist es wert, zum Beispiel wenn man mit einer eigenen Server-Implementierung im Backend arbeitet. In den meisten Fällen lohnt es sich jedoch, Godots High-Level Netzwerk-API zu verwenden, die einige der feineren Steuerungsmöglichkeiten der Low-Level Netzwerkfunktionen zugunsten größerer Benutzerfreundlichkeit opfert.
zh_tw: Godot 使用 UDP、TCP、與其他如 SSL 與 HTTP 等的高級通訊協定來支援標準低階網路。這些通訊協定非常彈性，且幾乎可以用在任何地方。但是，要手動通過這些方法來同步遊戲狀態可能會需要大量的工作。有時候，這種工作是無法避免的，例如要處理後端的自定伺服器實作時。但大多數情況下，都建議考慮一下 Godot 的高階網路 API，使用高階網路 API 只需要犧牲小部分的細節控制，就可以換來更好的易用性。

source: This is due to the inherent limitations of the low-level protocols:
de: Dies ist auf die inhärenten Beschränkungen der Low-Level-Protokolle zurückzuführen:
zh_tw: 由於繼承了低階通訊協定的一些功能，因此：

source: TCP ensures packets will always arrive reliably and in order, but latency is generally higher due to error correction. It's also quite a complex protocol because it understands what a "connection" is, and optimizes for goals that often don't suit applications like multiplayer games. Packets are buffered to be sent in larger batches, trading less per-packet overhead for higher latency. This can be useful for things like HTTP, but generally not for games. Some of this can be configured and disabled (e.g. by disabling "Nagle's algorithm" for the TCP connection).
de: TCP stellt sicher, dass Pakete immer zuverlässig und in der richtigen Reihenfolge ankommen, allerdings ist die Latenz durch Fehlerkorrektur in der Regel höher. Es ist auch ein etwas komplexeres Protokoll, da es versteht, was eine "Verbindung" ist, und für Ziele optimiert wird, die häufig nicht für Anwendungen wie Multiplayer-Spiele geeignet sind. Pakete werden gepuffert, um in größeren Batches gesendet zu werden, wobei weniger Overhead pro Paket gegen eine höhere Latenz getauscht wird. Dies kann für Anwendungen wie HTTP nützlich sein, aber im Allgemeinen nicht für Spiele. Einige davon können konfiguriert und deaktiviert werden (z.B. durch Deaktivieren des "Nagle-Algorithmus" für die TCP-Verbindung).
zh_tw: TCP確保封包始終可靠且按順序到達，但是由於錯誤校正，延遲通常更高。這也是一個非常複雜的協定，因為它了解什麼是“連接”，並最佳化了通常不適合用於多人遊戲的應用程式。封包被緩衝成更大的批次發送，從而減少了每份封包的開銷，提高了延遲。這對HTTP之類的東西可能很有用，但對遊戲通常不是。其中一些可以配置和禁用（例如禁用TCP連接的Nagle演算法）。

source: UDP is a simpler protocol, which only sends packets (and has no concept of a "connection"). No error correction makes it pretty quick (low latency), but packets may be lost along the way or received in the wrong order. Added to that, the MTU (maximum packet size) for UDP is generally low (only a few hundred bytes), so transmitting larger packets means splitting them, reorganizing them and retrying if a part fails.
de: UDP ist ein einfacheres Protokoll, das nur Pakete sendet (und kein Konzept einer "Verbindung" hat). Die fehlende Fehlerkorrektur macht es ziemlich schnell (geringe Latenz), aber Pakete können auf dem Weg verloren gehen oder in der falschen Reihenfolge empfangen werden. Hinzu kommt, dass die MTU (maximale Paketgröße) für UDP im Allgemeinen niedrig ist (nur einige hundert Bytes). Wenn Sie also größere Pakete übertragen, müssen Sie diese aufteilen, neu organisieren und erneut versuchen, falls ein Teil fehlschlägt.
zh_tw: UDP是一種更簡單的協定，它僅發送封包（並且沒有“連接”的概念）。沒有錯誤糾正可以使其快速（低延遲），但是可能會丟失封包或以錯誤的順序接收封包。除此之外，UDP的MTU（最大封包大小）通常很低（只有幾百個位元組），因此傳輸較大的封包意味著得將其拆分、重組並在出現故障時重試。

source: In general, TCP can be thought of as reliable, ordered, and slow; UDP as unreliable, unordered and fast. Because of the large difference in performance, it often makes sense to re-build the parts of TCP wanted for games (optional reliability and packet order), while avoiding the unwanted parts (congestion/traffic control features, Nagle's algorithm, etc). Due to this, most game engines come with such an implementation, and Godot is no exception.
de: Im Allgemeinen kann TCP als zuverlässig, geordnet und langsam und UDP als unzuverlässig, ungeordnet und schnell charakterisiert werden. Wegen des großen Performance-Unterschieds macht es häufig Sinn, die Teile von TCP wiederzuverwenden, die für Spiele gewollt sind (optionale Zuverlässigkeit und Paketreihenfolge) , während die ungewollten Teile (Paketstau/Übertragungs-Kontroll-Features, Nagle-Algorithmus, etc.) weggelassen werden. Aus diesem Grund liefern die meisten Spiele-Engines solche Implementierungen direkt mit und Godot ist da keine Ausnahme.
zh_tw: 普遍來說，TCP可以被認為是可靠，有序且緩慢；UDP不可靠，無序且快速。由於性能上的巨大差異，重新建構遊戲所需的TCP部分（可選的可靠性和封包順序），同時免去不必要的部分（擁塞/流量控制功能，Nagle演算法等）是合理的。因此，大多數遊戲引擎都提供了這樣的實作方式，Godot也不例外。

source: In summary, you can use the low-level networking API for maximum control and implement everything on top of bare network protocols or use the high-level API based on :ref:`SceneTree <class_SceneTree>` that does most of the heavy lifting behind the scenes in a generally optimized way.
de: Zusammengefasst kann die Low-Level Netzwerk-API für maximale Kontrolle genutzt werden, wobei alles darüber von Grund auf selbst implementiert werden muss, oder man nutzt die High-Level API basierend auf dem :ref:`Szenenbaum <class_SceneTree>`, die den Großteil der Arbeit im Hintergrund leistet und das im Allgemeinen auf optimierte Weise.
zh_tw: 綜上所述, 您可以使用低級網路API來實作最大限度的控制, 並在完全裸露的網路通訊協定之上實作所有功能, 或者使用基於 :ref:`SceneTree <class_SceneTree>` 的高級API, 後者以通常以一種比較優化的方式在後臺完成大部分繁重的工作.

source: Most of Godot's supported platforms offer all or most of the mentioned high- and low-level networking features. As networking is always largely hardware and operating system dependent, however, some features may change or not be available on some target platforms. Most notably, the HTML5 platform currently offers WebSockets and WebRTC support but lacks some of the higher-level features, as well as raw access to low-level protocols like TCP and UDP.
de: Die meisten von Godot unterstützten Plattformen liefern alle oder die meisten der angesprochenen High- und Low-Level Netzwerk-Features. Da Netzwerkfunktionen allerdings sehr plattformabhängig sind, könnten manche Features auf manchen Plattformen nicht verfügbar sein. Besonders die HTML5-Plattform unterstützt zurzeit nur WebSocket und manche High-Level-Features, als auch der Zugriff auf Low-Level-Protokolle wie TCP und UDP, fehlen.
zh_tw: Godot 支援的大多數平臺都提供所有或大部分上述的高、低網路功能。但是，由於網路在很大程度上依賴於硬體和作業系統，在某些目標平臺上一些功能可能會改變或者不可用。最值得注意的是 HTML5 平臺目前只提供 WebSocket 和 WebRTC 支援，缺乏一些高級功能，以及對 TCP 和 UDP 等低級協議的原始存取。

source: More about TCP/IP, UDP, and networking: https://gafferongames.com/post/udp_vs_tcp/
de: Mehr über TCP/IP, UDP und Netzwerkfunktionen im Allgemeinen finden Sie hier: https://gafferongames.com/post/udp_vs_tcp/
zh_tw: 更多關於TCP/IP, UDP和網路的資訊: https://gafferongames.com/post/udp_vs_tcp/

source: Gaffer On Games has a lot of useful articles about networking in Games (`here <https://gafferongames.com/categories/game-networking/>`__), including the comprehensive `introduction to networking models in games <https://gafferongames.com/post/what_every_programmer_needs_to_know_about_game_networking/>`__.
de: Gaffer On Games hat viele nützliche Artikel über Netzwerkfunktionen in Spielen (`hier <https://gafferongames.com/categories/game-networking/>`__), darunter die umfassende `Introduction to networking models in games <https://gafferongames.com/post/what_every_programmer_needs_to_know_about_game_networking/>`__.
zh_tw: Gaffer On Games有很多關於遊戲中網路的有用文章( `這裡 <https://gafferongames.com/categories/game-networking/>`__ ), 包括全面的 `遊戲中的網路模型介紹 <https://gafferongames.com/post/what_every_programmer_needs_to_know_about_game_networking/>`__ .

source: If you want to use your low-level networking library of choice instead of Godot's built-in networking, see here for an example: https://github.com/PerduGames/gdnet3
de: Wenn Sie die Low-Level-Netzwerkbibliothek Ihrer Wahl anstatt der in Godot eingebauten nutzen wollen, finden Sie hier ein Beispiel: https://github.com/PerduGames/gdnet3
zh_tw: 如果您想使用您選擇的底層網路庫來代替Godot的內建網路, 請參閱這裡的範例 : https://github.com/PerduGames/gdnet3

source: Adding networking to your game comes with some responsibility. It can make your application vulnerable if done wrong and may lead to cheats or exploits. It may even allow an attacker to compromise the machines your application runs on and use your servers to send spam, attack others or steal your users' data if they play your game.
de: Das Hinzufügen von Netzwerkfunktionen zu Ihrem Spiel ist mit einer gewissen Verantwortung verbunden. Es kann Ihre Anwendung angreifbar machen, wenn es falsch gemacht wird, und kann zu Cheats oder Exploits führen. Es kann sogar einem Angreifer ermöglichen, die Computer zu kompromittieren, auf denen Ihre Anwendung ausgeführt wird, und Ihre Server zu verwenden, um Spam zu senden, andere anzugreifen oder die Daten Ihrer Benutzer zu stehlen, wenn diese Ihr Spiel spielen.
zh_tw: 在您的遊戲中加入社交網路需要承擔一定的責任. 如果做錯了, 它會使您的應用程式很容易受到攻擊, 並可能導致欺騙或利用. 它甚至可能允許攻擊者破壞您的應用程式運作在的機器, 並使用您的伺服器發送垃圾郵件, 攻擊其他人或竊取您的使用者資料, 如果他們玩您的遊戲.

source: This is always the case when networking is involved and has nothing to do with Godot. You can of course experiment, but when you release a networked application, always take care of any possible security concerns.
de: Das ist bei Netzwerkanwendungen immer der Fall, ganz unabhängig ob Godot genutzt wird oder nicht. Sie können natürlich experimentieren, aber wenn Sie eine Netzwerkanwendung veröffentlichen, berücksichtigen Sie immer mögliche Sicherheitsbedenken.
zh_tw: 當涉及到網路而與Godot無關時, 情況總是如此. 當然, 您可以進行試驗, 但是在發行網路應用程式時, 請始終注意任何可能的安全問題.

source: Mid-level abstraction
de: Mid-Level-Abstraktion
zh_tw: 中級抽象

source: Before going into how we would like to synchronize a game across the network, it can be helpful to understand how the base network API for synchronization works.
de: Bevor wir darauf eingehen, wie wir ein Spiel über das Netzwerk synchronisieren möchten, kann es hilfreich sein zu verstehen, wie die grundlegende Netzwerk-API für die Synchronisierung funktioniert.
zh_tw: 在討論我們希望如何跨網路同步遊戲之前, 瞭解用於同步的基本網路API是如何工作的可能會有所幫助.

source: Godot uses a mid-level object :ref:`MultiplayerPeer <class_MultiplayerPeer>`. This object is not meant to be created directly, but is designed so that several C++ implementations can provide it.
de: Godot verwendet ein Mid-Level-Objekt :ref:`MultiplayerPeer <class_MultiplayerPeer>`. Dieses Objekt soll nicht direkt erstellt werden, sondern ist so konzipiert, dass mehrere C++-Implementierungen es bereitstellen können.
zh_tw: Godot使用了一個中層物件 :ref:`NetworkedMultiplayerPeer <class_NetworkedMultiplayerPeer>`. 這個物件並不是直接建立的, 但經過設計, 以便多個C++實作可以提供它.

source: This object extends from :ref:`PacketPeer <class_PacketPeer>`, so it inherits all the useful methods for serializing, sending and receiving data. On top of that, it adds methods to set a peer, transfer mode, etc. It also includes signals that will let you know when peers connect or disconnect.
de: Dieses Objekt ist eine Erweiterung von :ref:`PacketPeer <class_PacketPeer>`, so dass es alle nützlichen Methoden zum Serialisieren, Senden und Empfangen von Daten erbt. Darüber hinaus fügt es Methoden hinzu, um einen Peer, den Übertragungsmodus usw. festzulegen. Sie enthält auch Signale, die Ihnen mitteilen, wenn Peers sich verbinden oder die Verbindung trennen.
zh_tw: 這個物件擴充自 :ref:`PacketPeer <class_PacketPeer>`, 因此它繼承了所有用於序列化, 發送和接收資料的方法. 除此之外, 它還新增了設定節點, 傳輸模式等的方法. 它同時還包括當節點連接或斷開時將通知您的訊號.

source: This class interface can abstract most types of network layers, topologies and libraries. By default, Godot provides an implementation based on ENet (:ref:`ENetMultiplayerPeer <class_ENetMultiplayerPeer>`), one based on WebRTC (:ref:`WebRTCMultiplayerPeer <class_WebRTCMultiplayerPeer>`), and one based on WebSocket (:ref:`WebSocketPeer <class_WebSocketPeer>`), but this could be used to implement mobile APIs (for ad hoc WiFi, Bluetooth) or custom device/console-specific networking APIs.
de: Diese Klassenschnittstelle kann die meisten Arten von Netzwerkschichten, Topologien und Bibliotheken abstrahieren. Standardmäßig bietet Godot eine Implementierung auf Basis von ENet (:ref:`ENetMultiplayerPeer <class_ENetMultiplayerPeer>`), eine auf Basis von WebRTC (:ref:`WebRTCMultiplayerPeer <class_WebRTCMultiplayerPeer>`) und eine auf Basis von WebSocket (:ref:`WebSocketPeer <class_WebSocketPeer>`), aber dies könnte verwendet werden, um mobile APIs (für Ad-hoc-WiFi, Bluetooth) oder benutzerdefinierte geräte-/konsolenspezifische Netzwerk-APIs zu implementieren.
zh_tw: 這個類介面可以抽象出大多數型別的網路層, 拓撲結構和庫。預設情況下，Godot提供了一個基於ENet的實作( :ref:`NetworkedMultiplayerEnet <class_NetworkedMultiplayerENet>`), 一個基於WebRTC的實作( :ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>`), 還有一個基於WebSocket的實作( :ref:`WebSocketMultiplayerPeer<class_WebSocketMultiplayerPeer>`)，但這可以用來實作移動API(用於特設的WiFi, 藍牙)或自訂裝置/控制台特定的網路API。

source: For most common cases, using this object directly is discouraged, as Godot provides even higher level networking facilities. This object is still made available in case a game has specific needs for a lower-level API.
de: In den meisten Fällen wird davon abgeraten, dieses Objekt direkt zu verwenden, da Godot noch leistungsfähigere Netzwerkfunktionen bietet. Dieses Objekt wird dennoch zur Verfügung gestellt, falls ein Spiel spezielle Anforderungen an eine Low-Level-API hat.
zh_tw: 大多數常見情況下, 不鼓勵直接使用這個物件, 因為Godot提供了更高級別的網路使用. 只有當遊戲對較低級別的API有特殊需求的情況下, 才使用它.

source: Hosting considerations
de: Überlegungen zum Hosting
zh_tw: 其他建議

source: When hosting a server, clients on your :abbr:`LAN (Local Area Network)` can connect using the internal IP address which is usually of the form ``192.168.*.*``. This internal IP address is **not** reachable by non-LAN/Internet clients.
de: Wenn Sie einen Server hosten, können sich Clients in Ihrem :abbr:`LAN (Local Area Network)` über die interne IP-Adresse verbinden, die normalerweise die Form ``192.168.*.*`` hat. Diese interne IP-Adresse ist **nicht** für Nicht-LAN-/Internet-Clients erreichbar.
zh_tw: 託管伺服器時，LAN（區域網路）上的使用者端可以使用內部 IP 位址進行連接，該位址通常採用「192.168.*.*」形式。非 LAN/Internet 使用者端**無法**存取此內部 IP 位址。

source: On Windows, you can find your internal IP address by opening a command prompt and entering ``ipconfig``. On macOS, open a Terminal and enter ``ifconfig``. On Linux, open a terminal and enter ``ip addr``.
de: Unter Windows können Sie Ihre interne IP-Adresse herausfinden, indem Sie eine Eingabeaufforderung öffnen und ``ipconfig`` eingeben. Unter macOS öffnen Sie ein Terminal und geben ``ifconfig`` ein. Unter Linux öffnen Sie ein Terminal und geben ``ip addr`` ein.
zh_tw: 在 Windows 上，您可以透過開啟命令提示字元並輸入「ipconfig」來找到您的內部 IP 位址。在 macOS 上，開啟終端機並輸入「ifconfig」。在 Linux 上，打開終端機並輸入“ip addr”。

source: If you're hosting a server on your own machine and want non-LAN clients to connect to it, you'll probably have to *forward* the server port on your router. This is required to make your server reachable from the Internet since most residential connections use a `NAT <https://en.wikipedia.org/wiki/Network_address_translation>`__. Godot's high-level multiplayer API only uses UDP, so you must forward the port in UDP, not just TCP.
de: Wenn Sie einen Server auf Ihrem eigenen Rechner hosten und möchten, dass Nicht-LAN-Kunden eine Verbindung herstellen können, müssen Sie wahrscheinlich den Server-Port auf Ihrem Router per *Forwarding* weiterleiten. Dies ist erforderlich, damit Ihr Server vom Internet aus erreichbar ist, da die meisten privaten Verbindungen ein `NAT <https://en.wikipedia.org/wiki/Network_address_translation>`__ verwenden. Godots High-Level-Multiplayer-API verwendet nur UDP, also müssen Sie den Port in UDP weiterleiten, nicht nur in TCP.
zh_tw: 如果您在自己的電腦上託管伺服器並希望非 LAN 使用者端連接到它，您可能必須「轉送」路由器上的伺服器連接埠。這是讓您的伺服器可以透過網路存取所必需的，因為大多數住宅連線都使用「NAT <https://en.wikipedia.org/wiki/Network_address_translation>」__。 Godot 的高級多人 API 僅使用 UDP，因此您必須以 UDP 轉發端口，而不僅僅是 TCP。

source: After forwarding an UDP port and making sure your server uses that port, you can use `this website <https://icanhazip.com/>`__ to find your public IP address. Then give this public IP address to any Internet clients that wish to connect to your server.
de: Nachdem Sie einen UDP-Port weitergeleitet und sichergestellt haben, dass Ihr Server diesen Port verwendet, können Sie mit Hilfe `dieser Website <https://icanhazip.com/>`__ Ihre öffentliche IP-Adresse ermitteln. Geben Sie dann diese öffentliche IP-Adresse an alle Internet-Clients weiter, die eine Verbindung zu Ihrem Server herstellen möchten.
zh_tw: 轉送 UDP 連接埠並確保您的伺服器使用該連接埠後，您可以使用「此網站 <https://icanhazip.com/>」來尋找您的公用 IP 位址。然後將此公用 IP 位址提供給任何希望連接到您的伺服器的 Internet 使用者端。

source: Godot's high-level multiplayer API uses a modified version of ENet which allows for full IPv6 support.
de: Godots High-Level-Multiplayer-API verwendet eine modifizierte Version von ENet, die eine vollständige IPv6-Unterstützung ermöglicht.
zh_tw: Godot 的高級多人 API 使用 ENet 的修改版本，它允許完全支援 IPv6。

source: Initializing the network
de: Initialisieren des Netzwerks
zh_tw: 初始化網路

source: High level networking in Godot is managed by the :ref:`SceneTree <class_SceneTree>`.
de: High-Level-Netzwerkfunktionen in Godot werden durch den :ref:`SceneTree <class_SceneTree>` verwaltet.
zh_tw: 在Godot中, 控制聯網的物件與控制所有與樹相關的東西的物件是相同的: :ref:`SceneTree <class_SceneTree>`.

source: Each node has a ``multiplayer`` property, which is a reference to the ``MultiplayerAPI`` instance configured for it by the scene tree. Initially, every node is configured with the same default ``MultiplayerAPI`` object.
de: Jeder Node hat eine ``multiplayer``-Property, die eine Referenz auf die ``MultiplayerAPI``-Instanz ist, die für ihn durch den Szenenbaum konfiguriert wurde. Anfänglich ist jeder Node mit dem gleichen Standard ``MultiplayerAPI`` Objekt konfiguriert.
zh_tw: 每個節點都有一個「multiplayer」屬性，它是對場景樹為其配置的「MultiplayerAPI」實例的參考。最初，每個節點都配置相同的預設「MultiplayerAPI」物件。

source: It is possible to create a new ``MultiplayerAPI`` object and assign it to a ``NodePath`` in the the scene tree, which will override ``multiplayer`` for the node at that path and all of its descendants. This allows sibling nodes to be configured with different peers, which makes it possible to run a server and a client simultaneously in one instance of Godot.
de: Es ist möglich, ein neues ``MultiplayerAPI``-Objekt zu erzeugen und es einem ``NodePath`` im Szenenbaum zuzuweisen, wodurch ``multiplayer`` für den Node an diesem Pfad und alle seine Unter-Nodes außer Kraft gesetzt wird. Dies erlaubt es, Nachbar-Nodes mit verschiedenen Peers zu konfigurieren, was es möglich macht, einen Server und einen Client gleichzeitig in einer Instanz von Godot laufen zu lassen.
zh_tw: 可以建立一個新的“MultiplayerAPI”物件並將其分配給場景樹中的“NodePath”，這將覆蓋該路徑及其所有後代節點的“multiplayer”。這允許兄弟節點配置不同的對等點，從而可以在一個 Godot 實例中同時執行伺服器和客戶端。

source: To initialize networking, a ``MultiplayerPeer`` object must be created, initialized as a server or client, and passed to the ``MultiplayerAPI``.
de: Um die Netzwerkfunktionen zu initialisieren, muß ein ``MultiplayerPeer``-Objekt erzeugt, als Server oder Client initialisiert und an die ``MultiplayerAPI`` übergeben werden.
zh_tw: 要初始化網路，必須建立一個「MultiplayerPeer」對象，將其初始化為伺服器或客戶端，然後傳遞給「MultiplayerAPI」。

source: To terminate networking:
de: Beenden von Netzwerkfunktionen:
zh_tw: 停止聯網功能:

source: When exporting to Android, make sure to enable the ``INTERNET`` permission in the Android export preset before exporting the project or using one-click deploy. Otherwise, network communication of any kind will be blocked by Android.
de: Wenn Sie nach Android exportieren, stellen Sie sicher, dass Sie die Berechtigung ``INTERNET`` in der Android-Exportvorgabe aktivieren, bevor Sie das Projekt exportieren oder die Ein-Klick-Auslieferung verwenden. Andernfalls wird jede Art von Netzwerkkommunikation von Android blockiert.
zh_tw: 當匯出到 Android 時，在匯出專案或使用一鍵部署之前，確保在 Android 匯出預設中啟用 ``INTERNET`` 許可權。否則，任何形式的網路通信都會被 Android 系統阻止。

source: Managing connections
de: Verbindungen verwalten
zh_tw: 管理連接

source: Every peer is assigned a unique ID. The server's ID is always 1, and clients are assigned a random positive integer.
de: Jedem Peer wird eine eindeutige ID zugewiesen. Die ID des Servers ist immer 1, und den Clients wird eine zufällige positive Integer-Zahl zugewiesen.
zh_tw: 每個對等點都被分配了一個唯一的 ID。伺服器的 ID 始終為 1，並且為客戶端分配一個隨機正整數。

source: Responding to connections or disconnections is possible by connecting to ``MultiplayerAPI``'s signals:
de: Das Reagieren auf Verbindungen oder Verbindungsabbrüche ist durch die Verbindung mit den Signalen der ``MultiplayerAPI`` möglich:
zh_tw: 透過連接到「MultiplayerAPI」的訊號可以回應連接或斷開連接：

source: ``peer_connected(id: int)`` This signal is emitted with the newly connected peer's ID on each other peer, and on the new peer multiple times, once with each other peer's ID.
de: ``peer_connected(id: int)`` Dieses Signal wird mit der ID des neu verbundenen Peers an jeden anderen Peer gesendet, und an den neuen Peer mehrfach, einmal mit der ID jedes anderen Peers.
zh_tw: ``peer_connected(id: int)`` 此訊號在每個其他對等點上與新連接的對等點ID 一起發出，並在新對等點上多次發出，其中一次與每個其他對等點ID 一起發出。

source: ``peer_disconnected(id: int)`` This signal is emitted on every remaining peer when one disconnects.
de: ``peer_disconnected(id: int)`` Dieses Signal wird bei jedem verbleibenden Peer ausgegeben, wenn dieser die Verbindung trennt.
zh_tw: ``peer_disconnected(id: int)`` 當一個對等點斷開連接時，該訊號會在每個剩餘對等點上發出。

source: The rest are only emitted on clients:
de: Der Rest wird nur auf Clients ausgesendet:
zh_tw: 有下列事項需注意：

source: To get the unique ID of the associated peer:
de: Um die eindeutige ID des zugehörigen Peers zu erhalten:
zh_tw: 若要取得關聯對等點的唯一 ID：

source: To check whether the peer is server or client:
de: Um zu prüfen, ob der Peer ein Server oder ein Client ist:
zh_tw: 檢查樹是否被初始化為伺服器或使用者端:

source: Remote procedure calls
de: Remote-Prozeduraufrufe
zh_tw: 遠程程式呼叫
