Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/http_request_class.po
Languages: de, zh_tw

source: Making HTTP requests
de: HTTP-Anfragen stellen
zh_tw: 發出 HTTP 請求

source: Why use HTTP?
de: Warum HTTP verwenden?
zh_tw: 為什麼使用 HTTP？

source: `HTTP requests <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ are useful to communicate with web servers and other non-Godot programs.
de: `HTTP-Anfragen <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ sind nützlich für die Kommunikation mit Webservern und anderen Nicht-Godot-Programmen.
zh_tw: `HTTP 請求 <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_可以用來與 Web 伺服器以及其他非 Godot 程式通信。

source: Compared to Godot's other networking features (like :ref:`High-level multiplayer <doc_high_level_multiplayer>`), HTTP requests have more overhead and take more time to get going, so they aren't suited for real-time communication, and aren't great to send lots of small updates as is common for multiplayer gameplay.
de: Im Vergleich zu den anderen Netzwerk-Features von Godot (wie z.B. :ref:`High-level multiplayer <doc_high_level_multiplayer>`) haben HTTP-Anfragen mehr Overhead und brauchen mehr Zeit, um in Gang zu kommen. Sie eignen sich daher nicht für die Kommunikation in Echtzeit und sind nicht gut geeignet, um viele kleine Aktualisierungen zu senden, wie es bei Multiplayer-Spielen üblich ist.
zh_tw: 與 Godot 的其他網路功能（例如:ref:`高階多人遊戲 <doc_high_level_multiplayer>`）相比，HTTP 請求的額外開銷更大，起步也更慢，所以並不適合即時通信，也不善於進行多人遊戲中常見的大量較小更新的發送。

source: HTTP, however, offers interoperability with external web resources and is great at sending and receiving large amounts of data, for example to transfer files like game assets. These assets can then be loaded using :ref:`runtime file loading and saving <doc_runtime_loading_and_saving>`.
de: HTTP bietet jedoch Interoperabilität mit externen Web-Ressourcen und eignet sich hervorragend zum Senden und Empfangen großer Datenmengen, z.B. zum Übertragen von Dateien wie Spiel-Assets. Diese Assets können dann mit :ref:`Laden und Speichern von Dateien zur Laufzeit <doc_runtime_loading_and_saving>` geladen werden.

source: So HTTP may be useful for your game's login system, lobby browser, to retrieve some information from the web or to download game assets.
de: HTTP kann also für das Anmeldesystem Ihres Spiels, den Lobby-Browser, zum Abrufen von Informationen aus dem Internet oder zum Herunterladen von Spielinhalten nützlich sein.
zh_tw: 所以 HTTP 可以用在遊戲的登錄系統、大廳瀏覽器，可以從 Web 獲取資訊，也可以下載遊戲素材。

source: This tutorial assumes some familiarity with Godot and the Godot Editor. Refer to the :ref:`Introduction <toc-learn-introduction>` and the :ref:`Step by step <toc-learn-step_by_step>` tutorial, especially its :ref:`Nodes and Scenes <doc_nodes_and_scenes>` and :ref:`Creating your first script <doc_scripting_first_script>` pages if needed.
de: Dieses Tutorial setzt eine gewisse Vertrautheit mit Godot und dem Godot-Editor voraus. Lesen Sie bei Bedarf die Seiten :ref:`Einführung <toc-learn-introduction>` und :ref:`Schritt für Schritt <toc-learn-step_by_step>`, insbesondere die Seiten :ref:`Nodes und Szenen <doc_nodes_and_scenes>` und :ref:`Erstellen eines ersten Skripts <doc_scripting_first_script>`.
zh_tw: 本教學假設您對 Godot 和 Godot 編輯器有一定的了解。請參閱 :ref:`簡介 <toc-learn-introduction>` 和 :ref:`逐步 <toc-learn-step_by_step>` 教學課程，特別是其 :ref:`節點和場景 <doc_nodes_and_scenes>` 和：參考： `如果需要，建立您的第一個腳本<doc_scripting_first_script>` 頁面。

source: HTTP requests in Godot
de: HTTP-Anfragen in Godot
zh_tw: Godot 中的 HTTP 請求

source: The :ref:`HTTPRequest <class_HTTPRequest>` node is the easiest way to make HTTP requests in Godot. It is backed by the more low-level :ref:`HTTPClient <class_HTTPClient>`, for which a tutorial is available :ref:`here <doc_http_client_class>`.
de: Der Node :ref:`HTTPRequest <class_HTTPRequest>` ist der einfachste Weg, HTTP-Anfragen in Godot zu stellen. Er wird durch den einfacheren :ref:`HTTPClient <class_HTTPClient>` unterstützt, für den ein Tutorial verfügbar ist :ref:`hier <doc_http_client_class>`.
zh_tw: 在Godot中, 用 :ref:`HTTPRequest <class_HTTPRequest>` 節點發出HTTP請求是最簡單的方法. 它繼承自更低級別的 :ref:`HTTPClient <class_HTTPClient>` , 相關的教學見 :ref:`here <doc_http_client_class>`.

source: For this example, we will make an HTTP request to GitHub to retrieve the name of the latest Godot release.
de: In diesem Beispiel wird eine HTTP-Anfrage an GitHub gestellt, um den Namen der neuesten Godot-Version abzurufen.
zh_tw: 對於此範例，我們將向 GitHub 發出 HTTP 請求以檢索最新 Godot 版本的名稱。

source: When exporting to **Android**, make sure to enable the **Internet** permission in the Android export preset before exporting the project or using one-click deploy. Otherwise, network communication of any kind will be blocked by the Android OS.
de: Wenn Sie nach **Android** exportieren, stellen Sie sicher, dass Sie die Berechtigung **Internet** in der Android-Exportvorgabe aktivieren, bevor Sie das Projekt exportieren oder die Ein-Klick-Auslieferung verwenden. Andernfalls wird jede Art von Netzwerk-Kommunikation durch das Android-Betriebssystem blockiert.
zh_tw: 當匯出到 Android 時，在匯出專案或使用一鍵部署之前，確保在 Android 匯出預設中啟用 ``INTERNET`` 許可權。否則，任何形式的網路通信都會被 Android 系統阻止。

source: Preparing the scene
de: Vorbereiten der Szene
zh_tw: 準備 SDK

source: Create a new empty scene, add a root :ref:`Node <class_Node>` and add a script to it. Then add a :ref:`HTTPRequest <class_HTTPRequest>` node as a child.
de: Erstellen Sie eine neue leere Szene, fügen Sie einen Root :ref:`Node <class_Node>` hinzu und fügen Sie ihm ein Skript hinzu. Fügen Sie dann einen :ref:`HTTPRequest <class_HTTPRequest>` Node als Child hinzu.
zh_tw: 建立一個新的空場景，新增一個根節點 <class_Node>` 並向其新增腳本。然後加入一個 HTTPRequest <class_HTTPRequest>` 節點作為子節點。

source: Scripting the request
de: Skripting der Anfrage
zh_tw: 建立內容

source: When the project is started (so in ``_ready()``), we're going to send an HTTP request to Github using our :ref:`HTTPRequest <class_HTTPRequest>` node, and once the request completes, we're going to parse the returned JSON data, look for the ``name`` field and print that to console.
de: Wenn das Projekt gestartet wird (also in ``_ready()``), werden wir eine HTTP-Anfrage an Github senden, indem wir unseren Node :ref:`HTTPRequest <class_HTTPRequest>` verwenden. Sobald die Anfrage abgeschlossen ist, werden wir die zurückgegebenen JSON-Daten parsen, nach dem Feld ``Name`` suchen und dieses auf der Konsole ausgeben.
zh_tw: 當專案啟動時（所以在 _ready() 中），我們將使用 HTTPRequest <class_HTTPRequest> 節點向 Github 發送 HTTP 請求，一旦請求完成，我們就將解析傳回的JSON 資料，搜尋「name」欄位並將其列印到控制台。

source: Save the script and the scene, and run the project. The name of the most recent Godot release on Github should be printed to the output log. For more information on parsing JSON, see the class references for :ref:`JSON <class_JSON>`.
de: Speichern Sie das Skript und die Szene, und führen Sie das Projekt aus. Der Name der neuesten Godot-Version auf Github sollte im Log erscheinen. Weitere Informationen zum Parsen von JSON finden Sie in den Klassenreferenzen für :ref:`JSON <class_JSON>`.
zh_tw: 儲存腳本和場景，然後執行專案。 Github 上最新的 Godot 版本的名稱應列印到輸出紀錄中。有關解析 JSON 的更多信息，請參閱 JSON <class_JSON>` 的類別參考。

source: Note that you may want to check whether the ``result`` equals ``RESULT_SUCCESS`` and whether a JSON parsing error occurred, see the JSON class reference and :ref:`HTTPRequest <class_HTTPRequest>` for more.
de: Beachten Sie, dass Sie überprüfen wollen, ob das ``result`` gleich ``RESULT_SUCCESS`` ist und ob ein JSON-Parsing-Fehler aufgetreten ist, siehe die JSON-Klassenreferenz und :ref:`HTTPRequest <class_HTTPRequest>` für weitere Informationen.
zh_tw: 請注意, 您可能需要檢查 ``result`` 是否等於 ``RESULT_SUCCESS`` 以及JSON解析錯誤是否發生, 要瞭解更多資訊, 請參閱JSON型別參考和 :ref:`HTTPRequest <class_HTTPRequest>` .

source: You have to wait for a request to finish before sending another one. Making multiple request at once requires you to have one node per request. A common strategy is to create and delete HTTPRequest nodes at runtime as necessary.
de: Sie müssen warten, bis eine Anfrage beendet ist, bevor Sie eine weitere senden können. Um mehrere Anfragen auf einmal zu stellen, benötigen Sie einen Node pro Anfrage. Eine übliche Strategie besteht darin, bei Bedarf HTTPRequest-Nodes zur Laufzeit zu erstellen und zu löschen.
zh_tw: 請記住, 在發送另一個請求之前, 您必須等待請求完成. 一次發出多個請求需要每個請求有一個節點. 常見的策略是在運作時根據需要建立和刪除HTTPRequest節點.

source: Sending data to the server
de: Senden von Daten an den Server
zh_tw: 建立 Godot 伺服器

source: Until now, we have limited ourselves to requesting data from a server. But what if you need to send data to the server? Here is a common way of doing it:
de: Bisher haben wir uns darauf beschränkt, Daten von einem Server anzufordern. Was aber, wenn Sie Daten an den Server senden müssen? Hier ist eine übliche Vorgehensweise:
zh_tw: 到目前為止, 我們僅限於從伺服器上請求資料. 但如果你需要向伺服器發送資料呢？這裡有一個常見的方法:

source: Setting custom HTTP headers
de: Benutzerdefinierte HTTP-Header einstellen
zh_tw: 建立內容

source: Of course, you can also set custom HTTP headers. These are given as a string array, with each string containing a header in the format ``"header: value"``. For example, to set a custom user agent (the HTTP ``User-Agent`` header) you could use the following:
de: Natürlich können Sie auch eigene HTTP-Header setzen. Diese werden als String-Array angegeben, wobei jeder String einen Header im Format ``"header: value"`` enthält. Um zum Beispiel einen benutzerdefinierten User-Agent (den HTTP ``User-Agent``-Header) zu setzen, könnten Sie folgendes verwenden:
zh_tw: 當然, 您也可以設定自訂的HTTP頭部. 它們以字串陣列的形式給出, 每個字串都包含一個格式為 ``"header: value"`` 的頭部. 例如, 要設定自訂使用者代理(HTTP的 ``user-agent`` 頭部部分), 您可以像這樣使用:

source: Be aware that someone might analyse and decompile your released application and thus may gain access to any embedded authorization information like tokens, usernames or passwords. That means it is usually not a good idea to embed things such as database access credentials inside your game. Avoid providing information useful to an attacker whenever possible.
de: Seien Sie sich darüber im Klaren, dass jemand Ihre veröffentlichte Anwendung analysieren und dekompilieren und so Zugang zu allen eingebetteten Autorisierungsinformationen wie Token, Benutzernamen oder Passwörtern erhalten könnte. Das bedeutet, dass es in der Regel keine gute Idee ist, Dinge wie Datenbank-Zugangsdaten in Ihr Spiel einzubetten. Vermeiden Sie es, wann immer möglich, für einen Angreifer nützliche Informationen bereitzustellen.
zh_tw: 此外, 在使用授權呼叫API時, 請注意有人可能會分析和反編譯已發行的應用程式, 因此可能會存取到任何嵌入程式的授權資訊, 如權杖, 使用者名或密碼等. 這意味著在遊戲中嵌入諸如資料庫存取憑證之類的東西通常不是一個好主意. 盡可能避免提供對攻擊者有用的資訊.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
