Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/websocket.po
Languages: de, zh_tw

source: HTML5 and WebSocket
de: HTML5 und WebSocket
zh_tw: HTML5 與 WebSocket

source: The WebSocket protocol was standardized in 2011 with the original goal of allowing browsers to create stable and bidirectional connections with a server. Before that, browsers used to only support HTTPRequests, which is not well-suited for bidirectional communication.
de: Das WebSocket-Protokoll wurde 2011 mit dem ursprünglichen Ziel standardisiert, dass Browser stabile und bidirektionale Verbindungen mit einem Server herstellen können. Zuvor unterstützten Browser nur HTTPRequests, was für die bidirektionale Kommunikation nicht gut geeignet ist.
zh_tw: WebSocket協定在2011年被標準化, 最初的目標是讓瀏覽器與伺服器建立穩定的雙向連接. 在此之前, 瀏覽器曾只支援HTTPRequests, 並不適合雙向通信.

source: The protocol is message based and a very powerful tool to send push notifications to browsers, and has been used to implement chats, turn-based games, etc. It still uses a TCP connection, which is good for reliability but not for latency, so not good for real-time applications like VoIP and fast-paced games (see :ref:`WebRTC <doc_webrtc>` for those use cases).
de: Das Protokoll ist nachrichtenbasiert und ein sehr leistungsfähiges Werkzeug, um Push-Benachrichtigungen an Browser zu senden, und wurde zur Implementierung von Chats, rundenbasierten Spielen usw. verwendet. Es verwendet immer noch eine TCP-Verbindung, die gut für die Zuverlässigkeit, aber nicht für die Latenz ist, also nicht gut für Echtzeitanwendungen wie VoIP und schnelle Spiele (siehe :ref:`WebRTC <doc_webrtc>` für diese Anwendungsfälle).
zh_tw: 這個協定相當簡單, 基於消息, 是一個非常強大的向瀏覽器推送通知的工具, 已經被用來實作聊天, 回合制遊戲等. 它仍使用TCP連接, 這對可靠性有好處, 但對延遲沒有好處, 所以不適合即時的應用, 比如VoIP和快節奏的遊戲(這些用例見 :ref:`WebRTC <doc_webrtc>`).

source: Due to its simplicity, its wide compatibility, and being easier to use than a raw TCP connection, WebSocket soon started to spread outside the browsers, in native applications as a mean to communicate with network servers.
de: Aufgrund seiner Einfachheit, seiner breiten Kompatibilität und seiner einfacheren Verwendung als eine direkte TCP-Verbindung verbreitete sich WebSocket bald außerhalb der Browser in nativen Anwendungen, um mit Netzwerkservern zu kommunizieren.
zh_tw: 由於它的簡單性, 廣泛的相容性以及比原始TCP連接更容易使用,WebSocket很快就開始在瀏覽器以外的地方應用, 在本地應用程式中作為與網路伺服器通信的一種手段.

source: Godot supports WebSocket in both native and HTML5 exports.
de: Godot unterstützt WebSocket sowohl beim nativen als auch beim HTML5-Export.
zh_tw: Godot在本機和HTML5匯出中都支援WebSocket.

source: Using WebSocket in Godot
de: Verwenden von WebSocket in Godot
zh_tw: 在 Godot 中使用 WebSocket

source: WebSocket is implemented in Godot via :ref:`WebSocketPeer <class_WebSocketPeer>`. The WebSocket implementation is compatible with the High Level Multiplayer. See section on :ref:`high-level multiplayer <doc_high_level_multiplayer>` for more details.
de: WebSocket wird in Godot über :ref:`WebSocketPeer <class_WebSocketPeer>` implementiert. Die WebSocket-Implementierung ist mit dem High-Level-Multiplayer kompatibel. Siehe Abschnitt :ref:`High-Level Multiplayer <doc_high_level_multiplayer>` für weitere Details.
zh_tw: 在Godot中,WebSocket通過三個主要類來實作 :ref:`WebSocketClient <class_WebSocketClient>`, :ref:`WebSocketServer <class_WebSocketServer>`, 和 :ref:`WebSocketPeer <class_WebSocketPeer>`.WebSocket的實作與高級多人遊戲相容. 更多細節請參見 :ref:`high-level multiplayer <doc_high_level_multiplayer>` 一節.

source: When exporting to Android, make sure to enable the ``INTERNET`` permission in the Android export preset before exporting the project or using one-click deploy. Otherwise, network communication of any kind will be blocked by Android.
de: Wenn Sie nach Android exportieren, stellen Sie sicher, dass Sie die Berechtigung ``INTERNET`` in der Android-Exportvorgabe aktivieren, bevor Sie das Projekt exportieren oder die Ein-Klick-Auslieferung verwenden. Andernfalls wird jede Art von Netzwerkkommunikation von Android blockiert.
zh_tw: 當匯出到 Android 時，在匯出專案或使用一鍵部署之前，確保在 Android 匯出預設中啟用 ``INTERNET`` 許可權。否則，任何形式的網路通信都會被 Android 系統阻止。

source: Minimal client example
de: Minimales Client-Beispiel
zh_tw: 最小使用者端範例

source: This example will show you how to create a WebSocket connection to a remote server, and how to send and receive data.
de: In diesem Beispiel wird gezeigt, wie Sie eine WebSocket-Verbindung zu einem Remoteserver herstellen und wie Sie Daten senden und empfangen können.
zh_tw: 本範例將向您展示如何建立與遠端伺服器的 WebSocket 連接, 以及如何發送和接收資料.

source: This will print:
de: Dies gibt aus:
zh_tw: 這將列印:

source: Minimal server example
de: Minimales Server-Beispiel
zh_tw: 最小伺服器範例

source: This example will show you how to create a WebSocket server that listens for remote connections, and how to send and receive data.
de: Dieses Beispiel zeigt Ihnen, wie Sie einen WebSocket-Server erstellen, der auf Remote-Verbindungen wartet, und wie Sie Daten senden und empfangen.
zh_tw: 這個例子將告訴你如何建立一個監聽遠端連接的WebSocket伺服器，以及如何發送和接收資料。

source: This will print (when a client connects) something similar to this:
de: Dadurch wird (wenn ein Client eine Verbindung herstellt) etwas Ähnliches wie folgendes ausgegeben:
zh_tw: 這將列印(當使用者端連接時)與此類似的東西:

source: Advanced chat demo
de: Fortgeschrittene Chat-Demo
zh_tw: 高級聊天演示

source: A more advanced chat demo which optionally uses the multiplayer mid-level abstraction and a high level multiplayer demo are available in the `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ under `networking/websocket_chat` and `networking/websocket_multiplayer`.
de: Eine fortgeschrittene Chat-Demo, die optional die Multiplayer-Mid-Level-Abstraktion und eine High-Level-Multiplayer-Demo verwendet, ist in den `Godot-Demo-Projekten <https://github.com/godotengine/godot-demo-projects>`_ unter `Networking/websocket_chat` und `networking/websocket_multiplayer` verfügbar.
zh_tw: 在 `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ 下 `networking/websocket_chat` 和 `networking/websocket_multiplayer` 有一個更高級的聊天演示demo, 可以選擇使用多人中級抽象和高級多人演示demo.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
