Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_basics.po
Languages: de

source: Any constant expression compatible with the required argument type can be passed as an annotation argument value::
de: Jeder konstante Ausdruck, der mit dem erforderlichen Argumenttyp kompatibel ist, kann als ein Annotationsargument-Wert übergeben werden::

source: Annotations can be specified one per line or all in the same line. They affect the next statement that isn't an annotation. Annotations can have arguments sent between parentheses and separated by commas.
de: Annotationen können einzeln pro Zeile oder alle in derselben Zeile angegeben werden. Sie wirken sich auf die nächste Anweisung aus, die keine Annotation ist. Annotationen können Argumente haben, die in Klammern gesetzt und durch Kommas getrennt werden.

source: Both of these are the same::
de: Diese beiden sind das Gleiche::

source: When using nodes, it's common to desire to keep references to parts of the scene in a variable. As scenes are only warranted to be configured when entering the active scene tree, the sub-nodes can only be obtained when a call to ``Node._ready()`` is made.
de: Bei der Verwendung von Nodes ist es üblich, Verweise auf Teile der Szene in einer Variablen zu behalten. Da Szenen nur beim Aufrufen des aktiven Szenenbaums konfiguriert werden müssen, können die Unter-Nodes nur abgerufen werden, wenn ein Aufruf von ``Node._ready()`` erfolgt.

source: This can get a little cumbersome, especially when nodes and external references pile up. For this, GDScript has the ``@onready`` annotation, that defers initialization of a member variable until ``_ready()`` is called. It can replace the above code with a single line::
de: Dies kann ein wenig mühsam werden, besonders wenn sich Nodes und externe Referenzen häufen. Dafür gibt es in GDScript die ``@onready``-Annotation, um die Initialisierung einer Mitgliedsvariable aufzuschieben, bis ``_ready()`` aufgerufen wird. Sie kann den obigen Code durch eine einzige Zeile ersetzen::

source: Applying ``@onready`` and any ``@export`` annotation to the same variable doesn't work as you might expect. The ``@onready`` annotation will cause the default value to be set after the ``@export`` takes effect and will override it::
de: Die Anwendung von ``@onready`` und einer ``@export``-Annotation auf dieselbe Variable funktioniert nicht so, wie man es erwarten könnte. Die ``@onready``-Annotation bewirkt, dass der Default-Wert gesetzt wird, nachdem die ``@export``-Annotation in Kraft getreten ist, und überschreibt ihn::

source: Therefore, the ``ONREADY_WITH_EXPORT`` warning is generated, which is treated as an error by default. We do not recommend disabling or ignoring it.
de: Daher wird die Warnung ``ONREADY_WITH_EXPORT`` erzeugt, die standardmäßig als Fehler behandelt wird. Wir empfehlen nicht, sie zu deaktivieren oder zu ignorieren.

source: Comments
de: Kommentare

source: Anything from a ``#`` to the end of the line is ignored and is considered a comment.
de: Alles ab einem ``#`` bis zum Ende der Zeile wird ignoriert und als Kommentar aufgefasst.

source: In the Godot script editor, special keywords are highlighted within comments to bring the user's attention to specific comments:
de: Im Godot-Skript-Editor werden spezielle Schlüsselwörter in Kommentaren hervorgehoben, um die Aufmerksamkeit des Benutzers auf bestimmte Kommentare zu lenken:

source: **Critical** *(appears in red)*: ``ALERT``, ``ATTENTION``, ``CAUTION``, ``CRITICAL``, ``DANGER``, ``SECURITY``
de: **Kritisch** *(erscheint in rot)*: ``ALERT``, ``ATTENTION``, ``CAUTION``, ``CRITICAL``, ``DANGER``, ``SECURITY``

source: **Warning** *(appears in yellow)*: ``BUG``, ``DEPRECATED``, ``FIXME``, ``HACK``, ``TASK``, ``TBD``, ``TODO``, ``WARNING``
de: **Warnung** *(erscheint in gelb)*: ``BUG``, ``DEPRECATED``, ``FIXME``, ``HACK``, ``TASK``, ``TBD``, ``TODO``, ``WARNING``

source: **Notice** *(appears in green)*: ``INFO``, ``NOTE``, ``NOTICE``, ``TEST``, ``TESTING``
de: **Hinweis** *(erscheint in grün)*: ``INFO``, ``NOTE``, ``NOTICE``, ``TEST``, ``TESTING``

source: These keywords are case-sensitive, so they must be written in uppercase for them to be recognized:
de: Bei diesen Schlüsselwörtern wird zwischen Groß- und Kleinschreibung unterschieden, sie müssen also in Großbuchstaben geschrieben werden, damit sie erkannt werden:

source: The list of highlighted keywords and their colors can be changed in the **Text Editor > Theme > Comment Markers** section of the Editor Settings.
de: Die Liste der hervorgehobenen Schlüsselwörter und ihre Farben können im Abschnitt **Texteditor > Theme > Kommentarmarkierungen** der Editoreinstellungen geändert werden.

source: Code regions
de: Code-Regionen

source: Code regions are special types of comments that the script editor understands as *foldable regions*. This means that after writing code region comments, you can collapse and expand the region by clicking the arrow that appears at the left of the comment. This arrow appears within a purple square to be distinguishable from standard code folding.
de: Code-Regionen sind spezielle Arten von Kommentaren, die der Skript-Editor als *ausklappbare Bereiche* versteht. Das bedeutet, dass Sie nach dem Schreiben von Code-Region-Kommentaren die Region ein- und ausklappen können, indem Sie auf den Pfeil klicken, der links neben dem Kommentar erscheint. Dieser Pfeil erscheint in einem lilafarbenen Quadrat, damit er von der normalen Code-Ausklappung unterschieden werden kann.

source: The syntax is as follows:
de: Die Syntax lautet wie folgt:

source: To create a code region quickly, select several lines in the script editor, right-click the selection then choose **Create Code Region**. The region description will be selected automatically for editing.
de: Um eine Code-Region schnell zu erstellen, markieren Sie mehrere Zeilen im Skript-Editor, klicken Sie mit der rechten Maustaste auf die Auswahl und wählen Sie **Code-Region erstellen**. Die Beschreibung des Bereichs wird automatisch zur Bearbeitung ausgewählt.

source: It is possible to nest code regions within other code regions.
de: Es ist möglich, Code-Regionen innerhalb anderer Code-Regionen zu verschachteln.

source: Here's a concrete usage example of code regions:
de: Hier ist ein konkretes Beispiel für die Verwendung von Code-Regionen:

source: This can be useful to organize large chunks of code into easier to understand sections. However, remember that external editors generally don't support this feature, so make sure your code is easy to follow even when not relying on folding code regions.
de: Dies kann nützlich sein, um große Codeabschnitte in leichter zu verstehende Abschnitte zu gliedern. Denken Sie jedoch daran, dass externe Editoren diese Funktion in der Regel nicht unterstützen. Stellen Sie also sicher, dass Ihr Code auch dann leicht verständlich ist, wenn Sie sich nicht auf das Einklappen von Codebereichen verlassen.

source: Individual functions and indented sections (such as ``if`` and ``for``) can *always* be collapsed in the script editor. This means you should avoid using a code region to contain a single function or indented section, as it won't bring much of a benefit. Code regions work best when they're used to group multiple elements together.
de: Einzelne Funktionen und eingerückte Abschnitte (wie ``if`` und ``for``) können im Skripteditor *immer* eingeklappt werden. Das bedeutet, dass Sie es vermeiden sollten, eine Code-Region zu verwenden, um eine einzelne Funktion oder einen eingerückten Abschnitt zu enthalten, da dies keinen großen Nutzen bringt. Code-Regionen funktionieren am besten, wenn sie dazu dienen, mehrere Elemente zusammenzufassen.

source: Line continuation
de: Fortsetzung der Zeile

source: A line of code in GDScript can be continued on the next line by using a backslash (``\``). Add one at the end of a line and the code on the next line will act like it's where the backslash is. Here is an example:
de: Eine Codezeile in GDScript kann in der nächsten Zeile fortgesetzt werden, indem ein Backslash (``\``) verwendet wird. Fügen Sie einen solchen Schrägstrich am Ende einer Zeile ein, und der Code in der nächsten Zeile verhält sich so, als befände er sich an der Stelle des Backslashs. Hier ist ein Beispiel:

source: A line can be continued multiple times like this:
de: Eine Zeile kann auf diese Weise mehrfach fortgesetzt werden:

source: Built-in types
de: Built-in-Typen

source: Built-in types are stack-allocated. They are passed as values. This means a copy is created on each assignment or when passing them as arguments to functions. The exceptions are ``Object``, ``Array``, ``Dictionary``, and packed arrays (such as ``PackedByteArray``), which are passed by reference so they are shared. All arrays, ``Dictionary``, and some objects (``Node``, ``Resource``) have a ``duplicate()`` method that allows you to make a copy.
de: Built-in-Typen werden auf dem Stack abgelegt. Sie werden als Werte übergeben. Das bedeutet, dass bei jeder Zuweisung oder bei der Übergabe als Argument an Funktionen eine Kopie erstellt wird. Die Ausnahmen sind ``Object``, ``Array``, ``Dictionary`` und gepackte Arrays (wie ``PackedByteArray``), die per Referenz übergeben werden, so dass sie gemeinsam genutzt werden können. Alle Arrays, ``Dictionary``, und einige Objekte (``Node``, ``Resource``) haben eine ``duplicate()`` Methode, die es erlaubt, eine Kopie zu erstellen.

source: Basic built-in types
de: Einfache Bult-in-Typen

source: A variable in GDScript can be assigned to several built-in types.
de: Eine Variable in GDScript kann mehreren Built-in-Typen zugewiesen werden.

source: ``null`` is an empty data type that contains no information and can not be assigned any other value.
de: ``null`` ist ein leerer Datentyp, der keine Information enthält und dem kein anderer Wert zugewiesen werden kann.

source: Short for "boolean", it can only contain ``true`` or ``false``.
de: Kurzform für "Boolean", der nur ``true`` oder ``false`` enthalten kann.

source: Short for "integer", it stores whole numbers (positive and negative). It is stored as a 64-bit value, equivalent to ``int64_t`` in C++.
de: Kurz für "Integer": es speichert ganze Zahlen (positiv und negativ). Sie werden als 64-Bit-Wert gespeichert werden, gleichbedeutend mit ``int64_t`` in C++.

source: Stores real numbers, including decimals, using floating-point values. It is stored as a 64-bit value, equivalent to ``double`` in C++. Note: Currently, data structures such as ``Vector2``, ``Vector3``, and ``PackedFloat32Array`` store 32-bit single-precision ``float`` values.
de: Speichert reelle Zahlen, einschließlich Dezimalzahlen, unter Verwendung von Gleitkommazahlen. Er wird als 64-Bit-Wert gespeichert, was ``double`` in C++ entspricht. Anmerkung: Derzeit speichern Datenstrukturen wie ``Vector2``, ``Vector3`` und ``PackedFloat32Array`` 32-Bit Single-Precision ``Float``-Werte.

source: A sequence of characters in `Unicode format <https://en.wikipedia.org/wiki/Unicode>`_.
de: Eine Folge von Zeichen im `Unicode-Format <https://en.wikipedia.org/wiki/Unicode>`_.

source: An immutable string that allows only one instance of each name. They are slower to create and may result in waiting for locks when multithreading. In exchange, they're very fast to compare, which makes them good candidates for dictionary keys.
de: Ein unveränderlicher String, der für jeden Namen nur eine Instanz zulässt. Sie sind langsamer zu erstellen und können beim Multithreading zum Warten auf Locks führen. Im Gegenzug sind sie sehr schnell zu vergleichen, was sie zu guten Kandidaten für Dictionary-Keys macht.

source: A pre-parsed path to a node or a node property. It can be easily assigned to, and from, a String. They are useful to interact with the tree to get a node, or affecting properties like with :ref:`Tweens <class_Tween>`.
de: Ein vor-geparster Pfad zu einem Node oder einer Node-Property. Er kann einfach einem String zugewiesen und von ihm abgeleitet werden. Sie sind nützlich, um mit dem Baum zu interagieren, um einen Node zu erhalten, oder um Propertys zu beeinflussen, wie mit :ref:`Tweens <class_Tween>`.

source: Vector built-in types
de: Vektor-Built-in-Typen

source: 2D vector type containing ``x`` and ``y`` fields. Can also be accessed as an array.
de: 2D Vektor-Typ bestehend aus ``x`` und ``y``. Zugriff kann auch als Array erfolgen.

source: Same as a Vector2 but the components are integers. Useful for representing items in a 2D grid.
de: Dasselbe wie Vector2, aber die Komponenten sind Integer. Nützlich für die Darstellung von Elementen in einem 2D-Raster.

source: 2D Rectangle type containing two vectors fields: ``position`` and ``size``. Also contains an ``end`` field which is ``position + size``.
de: 2D Rechteckstypen mit zwei Vektor Feldern: ``position`` und ``size``. Besitzt alternativ ein ``end`` Feld, welches ``position+size`` entspricht.

source: 3D vector type containing ``x``, ``y`` and ``z`` fields. This can also be accessed as an array.
de: 3D-Vektor-Typ besitzt ``x``, ``y`` und ``z``-Felder. Diese können auch als Array aufgerufen werden.

source: Same as Vector3 but the components are integers. Can be use for indexing items in a 3D grid.
de: Dasselbe wie Vector3, aber die Komponenten sind Integer-Zahlen. Kann für die Indizierung von Elementen in einem 3D-Raster verwendet werden.

source: 3×2 matrix used for 2D transforms.
de: Eine 3x2 Matrix, welche für 2D Transformationen verwendet wird.

source: :ref:`Plane <class_Plane>`
de: :ref:`Ebene <class_Plane>`

source: 3D Plane type in normalized form that contains a ``normal`` vector field and a ``d`` scalar distance.
de: 3D Ebenentyp in normalisierter Form, welcher ein ``normal``-Vektorfeld und eine skalare Distanz ``d`` besitzt.

source: Quaternion is a datatype used for representing a 3D rotation. It's useful for interpolating rotations.
de: Quaternion ist ein Datentyp, welcher für die Repräsentation von 3D-Rotationen verwendet wird. Er ist sehr nützlich für das Interpolieren von Rotationen.

source: Axis-aligned bounding box (or 3D box) contains 2 vectors fields: ``position`` and ``size``. Also contains an ``end`` field which is ``position + size``.
de: Eine achsparallele Bounding Box (oder 3D-Box) enthält 2 Vektorfelder: ``position`` und ``size``. Enthält auch ein ``end``-Feld, das ``position + size`` entspricht.

source: 3x3 matrix used for 3D rotation and scale. It contains 3 vector fields (``x``, ``y`` and ``z``) and can also be accessed as an array of 3D vectors.
de: 3x3 Matrix, welche für 3D Rotationen und Sklarierung verwendet wird. Es besitzt drei Vektorfelder (``x``, ``y`` und ``z``) und kann auch als Array von 3D-Vektoren aufgerufen werden.

source: 3D Transform contains a Basis field ``basis`` and a Vector3 field ``origin``.
de: 3D-Transform besitzt ein Basis-Feld ``basis`` und ein Vector3-Feld ``origin``.

source: Engine built-in types
de: Engine-Built-in-Typen

source: Color data type contains ``r``, ``g``, ``b``, and ``a`` fields. It can also be accessed as ``h``, ``s``, and ``v`` for hue/saturation/value.
de: Der Color Datentyp besitzt jeweils ein ``r``, ``g``, ``b`` und ``a`` Feld. Der Zugriff kann auch über ``h``, ``s`` und ``v`` erfolgen, was für hue/saturation/value (Farbton, Sättigung, Wert) steht.

source: Resource ID (RID). Servers use generic RIDs to reference opaque data.
de: Ressource-ID (RID). Server nutzen generische RIDs, um undurchsichtige Daten zu referenzieren.

source: Base class for anything that is not a built-in type.
de: Basisklasse für alles, was kein Built-in-Typ ist.

source: Container built-in types
de: Container-Built-in-Typen

source: Generic sequence of arbitrary object types, including other arrays or dictionaries (see below). The array can resize dynamically. Arrays are indexed starting from index ``0``. Negative indices count from the end.
de: Generische Abfolge beliebiger Objekttypen, einschließlich anderer Arrays oder Dictionarys (siehe unten). Die Größe des Arrays kann dynamisch geändert werden. Arrays werden ausgehend vom Index ``0`` indiziert. Negative Indizes beginnen vom Ende mit dem Zählen.

source: Typed arrays
de: Typisierte Arrays

source: Godot 4.0 added support for typed arrays. On write operations, Godot checks that element values match the specified type, so the array cannot contain invalid values. The GDScript static analyzer takes typed arrays into account, however array methods like ``front()`` and ``back()`` still have the ``Variant`` return type.
de: Mit Godot 4.0 wurde die Unterstützung für typisierte Arrays hinzugefügt. Bei Schreiboperationen prüft Godot, ob die Elementwerte dem angegebenen Typ entsprechen, so daß das Array keine ungültigen Werte enthalten kann. Der statische Analyzer von GDScript berücksichtigt typisierte Arrays, aber Array-Methoden wie ``front()`` und ``back()`` haben immer noch den Rückgabetyp ``Variant``.

source: Typed arrays have the syntax ``Array[Type]``, where ``Type`` can be any ``Variant`` type, native or user class, or enum. Nested array types (like ``Array[Array[int]]``) are not supported.
de: Typisierte Arrays haben die Syntax ``Array[Typ]``, wobei ``Typ`` ein beliebiger ``Variant``-Typ, eine native oder Benutzerklasse oder eine Enum sein kann. Verschachtelte Array-Typen (wie ``Array[Array[int]]``) werden nicht unterstützt.

source: ``Array`` and ``Array[Variant]`` are the same thing.
de: ``Array`` und ``Array[Variant]`` sind dasselbe.

source: Arrays are passed by reference, so the array element type is also an attribute of the in-memory structure referenced by a variable in runtime. The static type of a variable restricts the structures that it can reference to. Therefore, you **cannot** assign an array with a different element type, even if the type is a subtype of the required type.
de: Arrays werden per Referenz übergeben, so dass der Typ des Array-Elements auch ein Attribut der speicherinternen Struktur ist, auf die eine Variable zur Laufzeit verweist. Der statische Typ einer Variablen schränkt die Strukturen ein, auf die sie verweisen kann. Daher können Sie einem Array **keinen** anderen Elementtyp zuweisen, selbst wenn der Typ ein Subtyp des erforderlichen Typs ist.

source: If you want to *convert* a typed array, you can create a new array and use the :ref:`Array.assign() <class_Array_method_assign>` method::
de: Wenn Sie ein typisiertes Array *konvertieren* wollen, können Sie ein neues Array erstellen und die Methode :ref:`Array.assign() <class_Array_method_assign>` verwenden::

source: The only exception was made for the ``Array`` (``Array[Variant]``) type, for user convenience and compatibility with old code. However, operations on untyped arrays are considered unsafe.
de: Die einzige Ausnahme wurde für den Typ ``Array`` (``Array[Variant]``) gemacht, aus Gründen der Benutzerfreundlichkeit und der Kompatibilität mit altem Code. Allerdings werden Operationen auf nicht typisierte Arrays als unsicher angesehen.

source: Packed arrays
de: Gepackte Arrays

source: GDScript arrays are allocated linearly in memory for speed. Large arrays (more than tens of thousands of elements) may however cause memory fragmentation. If this is a concern, special types of arrays are available. These only accept a single data type. They avoid memory fragmentation and use less memory, but are atomic and tend to run slower than generic arrays. They are therefore only recommended to use for large data sets:
de: GDScript-Arrays werden aus Geschwindigkeitsgründen linear im Speicher alloziert. Große Arrays (mehr als Zehntausende von Elementen) können jedoch eine Speicherfragmentierung verursachen. Wenn dies ein Problem darstellt, stehen spezielle Arten von Arrays zur Verfügung. Diese akzeptieren nur einen einzigen Datentyp. Sie vermeiden Speicherfragmentierung und verbrauchen weniger Speicher, sind jedoch atomar und laufen tendenziell langsamer als generische Arrays. Sie werden daher nur für große Datenmengen empfohlen:

source: :ref:`PackedByteArray <class_PackedByteArray>`: An array of bytes (integers from 0 to 255).
de: :ref:`PackedByteArray <class_PackedByteArray>`: Ein Array von Bytes (Integer von 0 bis 255).

source: :ref:`PackedInt32Array <class_PackedInt32Array>`: An array of 32-bit integers.
de: :ref:`PackedInt32Array <class_PackedInt32Array>`: Ein Array von 32-Bit-Integern.

source: :ref:`PackedInt64Array <class_PackedInt64Array>`: An array of 64-bit integers.
de: :ref:`PackedInt64Array <class_PackedInt64Array>`: Ein Array von 64-Bit-Integern.

source: :ref:`PackedFloat32Array <class_PackedFloat32Array>`: An array of 32-bit floats.
de: :ref:`PackedFloat32Array <class_PackedFloat32Array>`: Ein Array von 32-Bit Floats.

source: :ref:`PackedFloat64Array <class_PackedFloat64Array>`: An array of 64-bit floats.
de: :ref:`PackedFloat64Array <class_PackedFloat64Array>`: Ein Array von 64-Bit Floats.

source: :ref:`PackedStringArray <class_PackedStringArray>`: An array of strings.
de: :ref:`PackedStringArray <class_PackedStringArray>`: Ein Array von Strings.

source: :ref:`PackedVector2Array <class_PackedVector2Array>`: An array of :ref:`Vector2 <class_Vector2>` values.
de: :ref:`PackedVector2Array <class_PackedVector2Array>`: Ein Array von :ref:`Vector2 <class_Vector2>`-Werten.

source: :ref:`PackedVector3Array <class_PackedVector3Array>`: An array of :ref:`Vector3 <class_Vector3>` values.
de: :ref:`PackedVector3Array <class_PackedVector3Array>`: Ein Array von :ref:`Vector3 <class_Vector3>`-Werten.

source: :ref:`PackedColorArray <class_PackedColorArray>`: An array of :ref:`Color <class_Color>` values.
de: :ref:`PackedColorArray <class_PackedColorArray>`: Ein Array von :ref:`Color <class_Color>`-Werten.

source: Associative container which contains values referenced by unique keys.
de: Assoziativer Container, der Values enthält, auf die durch eindeutige Keys verwiesen wird.

source: Lua-style table syntax is also supported. Lua-style uses ``=`` instead of ``:`` and doesn't use quotes to mark string keys (making for slightly less to write). However, keys written in this form can't start with a digit (like any GDScript identifier), and must be string literals.
de: Die Tabellensyntax im Lua-Stil wird ebenfalls unterstützt. Der Lua-Stil verwendet ``=`` anstelle von ``:`` und verwendet keine Anführungszeichen, um String-Keys zu markieren (was etwas weniger Schreibaufwand bedeutet). Allerdings können die Keys in dieser Form nicht mit einer Ziffer beginnen (wie jeder GDScript-Bezeichner) und müssen String-Literale sein.

source: To add a key to an existing dictionary, access it like an existing key and assign to it::
de: Um einen Key zu einem bestehenden Dictionary hinzuzufügen, greifen Sie wie bei einem vorhandenen Key darauf zu und weisen Sie ihm etwas zu::

source: The bracket syntax can be used to access properties of any :ref:`class_Object`, not just Dictionaries. Keep in mind it will cause a script error when attempting to index a non-existing property. To avoid this, use the :ref:`Object.get() <class_Object_method_get>` and :ref:`Object.set() <class_Object_method_set>` methods instead.
de: Die Klammer-Syntax kann verwendet werden, um auf die Propertys jedes :ref:`class_Object`\s zuzugreifen, nicht nur bei Dictionaries. Beachten Sie, dass beim Indizieren einer nicht vorhandenen Property ein Skriptfehler auftritt. Um dies zu vermeiden, verwenden Sie stattdessen die Methoden :ref:`Object.get() <class_Object_method_get>` und :ref:`Object.set() <class_Object_method_set>`.

source: A signal is a message that can be emitted by an object to those who want to listen to it. The Signal type can be used for passing the emitter around.
de: Ein Signal ist eine Nachricht, die von einem Objekt an diejenigen gesendet werden kann, die sie hören wollen. Der Typ Signal kann für die Weitergabe des Emitters verwendet werden.
