Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_styleguide.po
Languages: de, zh_cn

source: After the class's properties come the methods.
de: Nach den Klassen-Propertys kommen die Methoden.
zh_cn: 先声明类的属性，再声明类的方法。

source: Start with the ``_init()`` callback method, that the engine will call upon creating the object in memory. Follow with the ``_ready()`` callback, that Godot calls when it adds a node to the scene tree.
de: Beginnen Sie mit der Callback-Methode ``_init()``, die von der Engine beim Erstellen des Objekts im Speicher aufgerufen wird. Folgen Sie dem ``_ready()``-Callback den Godot aufruft, wenn er dem Szenenbaum einen Node hinzufügt.
zh_cn: 从 ``_init()`` 回调方法开始，引擎将在内存创建对象时调用该方法，然后是 ``_ready()`` 回调，Godot 在向场景树添加一个节点时会调用该回调。

source: These functions should come first because they show how the object is initialized.
de: Diese Funktionen sollten an erster Stelle stehen, da sie zeigen, wie das Objekt initialisiert wird.
zh_cn: 这些函数应声明在脚本最前面，以便显示该对象的初始化方式。

source: Other built-in virtual callbacks, like ``_unhandled_input()`` and ``_physics_process``, should come next. These control the object's main loop and interactions with the game engine.
de: Andere Built-in-virtuelle Callbacks wie ``_unhandled_input()`` und ``_physics_process`` sollten als nächstes folgen. Diese steuern die Hauptschleife des Objekts und die Interaktionen mit der Spiel-Engine.
zh_cn: ``_unhandling_input()`` 和 ``_physics_process`` 等其他内置的虚回调则应该放在后面，控制对象的主循环和与游戏引擎的交互。

source: The rest of the class's interface, public and private methods, come after that, in that order.
de: Der Rest des Interfaces der Klasse, öffentliche und private Methoden, folgt danach in dieser Reihenfolge.
zh_cn: 类的其余接口、公共和私有方法，均按照这个顺序呈现。

source: Static typing
de: Statische Typisierung
zh_cn: 静态类型

source: Since Godot 3.1, GDScript supports :ref:`optional static typing<doc_gdscript_static_typing>`.
de: Seit Godot 3.1 unterstützt GDScript :ref:`optionale statische Typisierung <doc_gdscript_static_typing>`.
zh_cn: 从 Godot 3.1 开始，GDScript 支持 :ref:`可选的静态类型 <doc_gdscript_static_typing>`。

source: Declared types
de: Deklarierte Typen
zh_cn: 声明类型

source: To declare a variable's type, use ``<variable>: <type>``:
de: Verwenden Sie ``<Variable>: <Typ>`` um den Typ einer Variablen zu deklarieren:
zh_cn: 要声明变量的类型，请使用 ``<variable>: <type>`` ：

source: To declare the return type of a function, use ``-> <type>``:
de: Um den Rückgabetyp einer Funktion zu deklarieren, verwenden Sie ``-> <type>``:
zh_cn: 要声明函数的返回类型，请使用 ``-> <type>`` ：

source: Inferred types
de: Typinferenz
zh_cn: 推断类型

source: In most cases you can let the compiler infer the type, using ``:=``. Prefer ``:=`` when the type is written on the same line as the assignment, otherwise prefer writing the type explicitly.
de: In den meisten Fällen können Sie den Typ vom Compiler inferieren lassen, indem Sie ``:=`` verwenden. Bevorzugen Sie ``:=``, wenn der Typ in der gleichen Zeile wie die Zuweisung steht, andernfalls schreiben Sie den Typ lieber explizit.
zh_cn: 大部分情况下，你可以让编译器自行推断变量类型，用 ``:=`` 来实现。在变量声明与变量类型写在同一行时使用该语法，除此之外还请显式指定变量类型。

source: Include the type hint when the type is ambiguous, and omit the type hint when it's redundant.
de: Fügen Sie den Type-Hint ein, wenn der Typ mehrdeutig ist, und lassen Sie den Type-Hint weg, wenn er überflüssig ist.
zh_cn: 在类型不明确时指定类型，在类型提示多余时省略类型指定。

source: In some cases, the type must be stated explicitly, otherwise the behavior will not be as expected because the compiler will only be able to use the function's return type. For example, ``get_node()`` cannot infer a type unless the scene or file of the node is loaded in memory. In this case, you should set the type explicitly.
de: In einigen Fällen muss der Typ explizit angegeben werden, da sonst das Verhalten nicht wie erwartet ist, da der Compiler nur den Rückgabetyp der Funktion verwenden kann. Zum Beispiel kann ``get_node()`` keinen Typ ableiten, es sei denn, die Szene oder Datei des Nodes ist im Speicher geladen. In diesem Fall sollten Sie den Typ explizit festlegen.
zh_cn: 但在少数情况下，上下文缺失时，编译器会回退到函数的返回类型。例如，在节点的场景或文件被加载到内存中之前， ``get_node()`` 无法自动推断类型。在这种情况下，应明确指定类型。

source: Alternatively, you can use the ``as`` keyword to cast the return type, and that type will be used to infer the type of the var.
de: Alternativ können Sie das Schlüsselwort ``as`` verwenden, um den Rückgabetyp zu casten, und dieser Typ wird verwendet, um den Typ der Variable abzuleiten.
zh_cn: 也可以使用 ``as`` 关键字来转换返回类型，该类型会用于推导变量类型。

source: This option is also considered more :ref:`type-safe<doc_gdscript_static_typing_safe_lines>` than the first.
de: Diese Option wird auch als mehr :ref:`type-safe<doc_gdscript_static_typing_safe_lines>` angesehen als die erste.
zh_cn: 这种做法也比第一种更加\ :ref:`类型安全<doc_gdscript_static_typing_safe_lines>`。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
