Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_basics.po
Languages: de

source: Signals are better used by getting them from actual objects, e.g. ``$Button.button_up``.
de: Signale lassen sich besser verwenden, wenn man sie von aktuellen Objekten bezieht, z.B. ``$Button.button_up``.

source: Contains an object and a function, which is useful for passing functions as values (e.g. when connecting to signals).
de: Enthält ein Objekt und eine Funktion, was für die Übergabe von Funktionen als Werte nützlich ist (z. B. beim Anbinden an Signale).

source: Getting a method as a member returns a callable. ``var x = $Sprite2D.rotate`` will set the value of ``x`` to a callable with ``$Sprite2D`` as the object and ``rotate`` as the method.
de: Zugriff auf eine Methode als Member gibt eine Callable zurück. ``var x = $Sprite2D.rotate`` setzt den Wert von ``x`` auf eine Callable mit ``$Sprite2D`` als Objekt und ``rotate`` als Methode.

source: You can call it using the ``call`` method: ``x.call(PI)``.
de: Sie können es mit der Methode ``call`` aufrufen: ``x.call(PI)``.

source: Data
de: Daten

source: Variables
de: Variablen

source: Variables can exist as class members or local to functions. They are created with the ``var`` keyword and may, optionally, be assigned a value upon initialization.
de: Variablen können als Klassen-Member oder lokal in Funktionen existieren. Sie werden mit dem Schlüsselwort ``var`` erzeugt und können optional mit einem Wert initialisiert werden.

source: Variables can optionally have a type specification. When a type is specified, the variable will be forced to have always that same type, and trying to assign an incompatible value will raise an error.
de: Variablen können optional eine Typspezifikation haben. Wenn ein Typ angegeben wird, muss die Variable immer denselben Typ haben, und der Versuch, einen inkompatiblen Wert zuzuweisen, führt zu einem Fehler.

source: Types are specified in the variable declaration using a ``:`` (colon) symbol after the variable name, followed by the type.
de: Typen werden in der Variablendeklaration mit einem ``:`` (Doppelpunkt) nach dem Variablennamen, gefolgt vom Typ, angegeben.

source: If the variable is initialized within the declaration, the type can be inferred, so it's possible to omit the type name::
de: Wenn die Variable innerhalb der Deklaration initialisiert wird, kann der Typ abgeleitet werden, sodass der Typname weggelassen werden kann::

source: Type inference is only possible if the assigned value has a defined type, otherwise it will raise an error.
de: Typ-Inferenz ist nur möglich, wenn der zugewiesene Wert einen definierten Typ hat, andernfalls wird ein Fehler ausgelöst.

source: Valid types are:
de: Gültige Typen sind:

source: Built-in types (Array, Vector2, int, String, etc.).
de: Built-in-Typen (Array, Vector2, int, String, etc.).

source: Engine classes (Node, Resource, Reference, etc.).
de: Engine-Klassen (Node, Resource, Reference, etc.).

source: Constant names if they contain a script resource (``MyScript`` if you declared ``const MyScript = preload("res://my_script.gd")``).
de: Konstanten-Namen, wenn sie eine Skript-Ressource enthalten (``MyScript``, wenn man ``const MyScript = preload("res://my_script.gd")`` deklariert hat).

source: Other classes in the same script, respecting scope (``InnerClass.NestedClass`` if you declared ``class NestedClass`` inside the ``class InnerClass`` in the same scope).
de: Andere Klassen im gleichen Skript, unter Berücksichtigung des Geltungsbereichs (``InnerClass.NestedClass``, wenn man ``class NestedClass`` innerhalb der ``class InnerClass`` im gleichen Geltungsbereich deklariert hat).

source: Script classes declared with the ``class_name`` keyword.
de: Skriptklassen, die mit dem Schlüsselwort ``class_name`` deklariert wurden.

source: Autoloads registered as singletons.
de: Autoloads, die als Singletons registriert sind.

source: While ``Variant`` is a valid type specification, it's not an actual type. It only means there's no set type and is equivalent to not having a static type at all. Therefore, inference is not allowed by default for ``Variant``, since it's likely a mistake.
de: Obwohl ``Variant`` eine gültige Typspezifikation ist, handelt es sich nicht um einen tatsächlichen Typ. Es bedeutet nur, dass es keinen festen Typ gibt und ist gleichbedeutend damit, dass sie gar keinen statischen Typ hat. Daher ist die Inferenz für ``Variant`` standardmäßig nicht erlaubt, da es sich wahrscheinlich um einen Fehler handelt.

source: You can turn off this check, or make it only a warning, by changing it in the project settings. See :ref:`doc_gdscript_warning_system` for details.
de: Sie können diese Prüfung abschalten oder nur eine Warnung ausgeben, indem Sie sie in den Projekteinstellungen ändern. Siehe :ref:`doc_gdscript_warning_system` für Details.

source: Static variables
de: Statische Variablen

source: A class member variable can be declared static::
de: Eine Klassen-Membervariable kann als statisch deklariert werden::

source: Static variables belong to the class, not instances. This means that static variables share values between multiple instances, unlike regular member variables.
de: Statische Variablen gehören zur Klasse, nicht zu den Instanzen. Das bedeutet, dass statische Variablen im Gegensatz zu regulären Member-Variablen Werte zwischen mehreren Instanzen teilen.

source: From inside a class, you can access static variables from any function, both static and non-static. From outside the class, you can access static variables using the class or an instance (the second is not recommended as it is less readable).
de: Innerhalb einer Klasse können Sie von jeder Funktion aus auf statische Variablen zugreifen, sowohl auf statische als auch auf nicht-statische. Außerhalb der Klasse können Sie auf statische Variablen über die Klasse oder eine Instanz zugreifen (letzteres wird nicht empfohlen, da es weniger lesbar ist).

source: The ``@export`` and ``@onready`` annotations cannot be applied to a static variable. Local variables cannot be static.
de: Die Annotationen ``@export`` und ``@onready`` können nicht auf eine statische Variable angewendet werden. Lokale Variablen können nicht statisch sein.

source: The following example defines a ``Person`` class with a static variable named ``max_id``. We increment the ``max_id`` in the ``_init()`` function. This makes it easy to keep track of the number of ``Person`` instances in our game.
de: Das folgende Beispiel definiert eine Klasse ``Person`` mit einer statischen Variable namens ``max_id``. Wir inkrementieren die ``max_id`` in der ``_init()`` Funktion. Das macht es einfach, die Anzahl der ``Person``-Instanzen in unserem Spiel zu tracken.

source: In this code, we create two instances of our ``Person`` class and check that the class and every instance have the same ``max_id`` value, because the variable is static and accessible to every instance.
de: In diesem Code erzeugen wir zwei Instanzen unserer Klasse ``Person`` und überprüfen, dass die Klasse und jede Instanz den gleichen Wert für ``max_id`` haben, da die Variable statisch und für jede Instanz zugänglich ist.

source: Static variables can have type hints, setters and getters::
de: Statische Variablen können Type-Hints, Setter und Getter haben::

source: A base class static variable can also be accessed via a child class::
de: Auf eine statische Variable einer Basisklasse kann auch über eine Child-Klasse zugegriffen werden::

source: Since GDScript classes are resources, having static variables in a script prevents it from being unloaded even if there are no more instances of that class and no other references left. This can be important if static variables store large amounts of data or hold references to other project resources, such as scenes. You should clean up this data manually, or use the :ref:`@static_unload <class_@GDScript_annotation_@static_unload>` annotation if static variables don't store important data and can be reset.
de: Da es sich bei GDScript-Klassen um Ressourcen handelt, verhindern statische Variablen in einem Skript, dass es entladen wird, auch wenn es keine Instanzen dieser Klasse und keine anderen Referenzen mehr gibt. Dies kann wichtig sein, wenn statische Variablen große Datenmengen speichern oder Referenzen auf andere Projektressourcen, wie z.B. Szenen, enthalten. Sie sollten diese Daten manuell bereinigen oder die Annotation :ref:`@static_unload <class_@GDScript_annotation_@static_unload>` verwenden, wenn die statischen Variablen keine wichtigen Daten speichern und zurückgesetzt werden können.

source: Currently, due to a bug, scripts are never freed, even if ``@static_unload`` annotation is used.
de: Derzeit werden Skripte aufgrund eines Bugs nie freigegeben, selbst wenn die Annotation ``@static_unload`` verwendet wird.

source: Note that ``@static_unload`` applies to the entire script (including inner classes) and must be placed at the top of the script, before ``class_name`` and ``extends``::
de: Beachten Sie, dass ``@static_unload`` für das gesamte Skript gilt (einschließlich der inneren Klassen) und am Anfang des Skripts stehen muss, vor ``class_name`` und ``extends``::

source: See also `Static functions`_ and `Static constructor`_.
de: Siehe auch `Statische Funktionen`_ und `Statischer Konstruktor`_.

source: Values assigned to typed variables must have a compatible type. If it's needed to coerce a value to be of a certain type, in particular for object types, you can use the casting operator ``as``.
de: Werte, die typisierten Variablen zugewiesen werden, müssen einen kompatiblen Typ haben. Wenn es erforderlich ist, einen Wert zu zwingen, einen bestimmten Typ zu haben, insbesondere bei Objekttypen, können Sie den Casting-Operator ``as`` verwenden.

source: Casting between object types results in the same object if the value is of the same type or a subtype of the cast type.
de: Das Casten zwischen Objekttypen führt zu demselben Objekt, wenn der Wert vom selben Typ oder einem Untertyp des Cast-Typs ist.

source: If the value is not a subtype, the casting operation will result in a ``null`` value.
de: Wenn der Wert kein Subtyp ist, führt die Casting-Operation zu einem ``null`` -Wert.

source: For built-in types, they will be forcibly converted if possible, otherwise the engine will raise an error.
de: Bei Built-in-Typen werden sie nach Möglichkeit zwangsweise konvertiert, da sonst die Engine einen Fehler auslöst.

source: Casting is also useful to have better type-safe variables when interacting with the scene tree::
de: Casting ist auch nützlich, um bei der Interaktion mit dem Szenenbaum bessere typsichere Variablen zu haben::

source: Constants
de: Konstanten

source: Constants are values you cannot change when the game is running. Their value must be known at compile-time. Using the ``const`` keyword allows you to give a constant value a name. Trying to assign a value to a constant after it's declared will give you an error.
de: Konstanten sind Werte, die Sie nicht ändern können während das Spiel läuft, ihr Wert muss zur Kompilierungszeit bekannt sein. Mit dem Schlüsselwort ``const`` können Sie einem konstanten Wert einen Namen geben. Wenn Sie versuchen, einer Konstanten nach ihrer Deklaration einen Wert zuzuweisen, wird ein Fehler angezeigt.

source: We recommend using constants whenever a value is not meant to change.
de: Wir empfehlen die Verwendung von Konstanten, wenn sich ein Wert nicht ändern soll.

source: Although the type of constants is inferred from the assigned value, it's also possible to add explicit type specification::
de: Obwohl der Typ der Konstanten aus dem zugewiesenen Wert abgeleitet wird, ist es auch möglich, eine explizite Typspezifikation hinzuzufügen::

source: Assigning a value of an incompatible type will raise an error.
de: Das Zuweisen eines Werts eines inkompatiblen Typs führt zu einem Fehler.

source: You can also create constants inside a function, which is useful to name local magic values.
de: Sie können auch Konstanten innerhalb einer Funktion erstellen, was nützlich ist, um lokale "Magic Numbers"mit Namen zu versehen.

source: Since objects, arrays and dictionaries are passed by reference, constants are "flat". This means that if you declare a constant array or dictionary, it can still be modified afterwards. They can't be reassigned with another value though.
de: Da Objekte, Arrays und Dictionarys per Referenz übergeben werden, sind Konstanten "flach". Das heißt, wenn Sie konstantes Array oder Dictionary deklarieren, kann dieses auch noch nachträglich geändert werden. Man kann ihnen jedoch keinen anderen Wert mehr zuweisen.

source: Enums are basically a shorthand for constants, and are pretty useful if you want to assign consecutive integers to some constant.
de: Enums sind im Grunde ein Kürzel für Konstanten und sind nützlich, wenn Sie aufeinanderfolgende Integer zu einer Kontanten zuweisen möchten.

source: If you pass a name to the enum, it will put all the keys inside a constant :ref:`Dictionary <class_Dictionary>` of that name. This means all constant methods of a dictionary can also be used with a named enum.
de: Wenn Sie dem Enum einen Namen übergeben, wird es alle Keys in ein konstantes :ref:`Dictionary <class_Dictionary>` mit diesem Namen einfügen. Das bedeutet, dass alle konstanten Methoden eines Dictionarys auch mit einem benannten Enum verwendet werden können.

source: Keys in a named enum are not registered as global constants. They should be accessed prefixed by the enum's name (``Name.KEY``).
de: Keys in einem benannten Enum werden nicht als globale Konstanten registriert. Auf sie sollte mit dem Präfix des Enum-Namens zugegriffen werden (``Name.KEY``).

source: Functions
de: Funktionen

source: Functions always belong to a `class <Classes_>`_. The scope priority for variable look-up is: local → class member → global. The ``self`` variable is always available and is provided as an option for accessing class members, but is not always required (and should *not* be sent as the function's first argument, unlike Python).
de: Funktionen gehören immer zu einer `Klasse <Classes_>`_. Die Priorität des Geltungsbereichs für die Suche nach Variablen ist: lokal → Klassenmember → global. Die Variable ``self`` ist immer verfügbar und wird als Option für den Zugriff auf Klassenmember angeboten, ist aber nicht immer erforderlich (und sollte im Gegensatz zu Python *nicht* als erstes Argument der Funktion gesendet werden).

source: A function can ``return`` at any point. The default return value is ``null``.
de: Eine Funktion kann jederzeit per return ``zurückkehren``. Der Default-Rückgabewert ist ``null``.

source: If a function contains only one line of code, it can be written on one line::
de: Wenn eine Funktion nur eine Zeile Code enthält, kann sie in eine Zeile geschrieben werden::

source: Functions can also have type specification for the arguments and for the return value. Types for arguments can be added in a similar way to variables::
de: Funktionen können auch eine Typspezifikation für die Argumente und für den Rückgabewert haben. Typen für Argumente können auf ähnliche Weise wie Variablen hinzugefügt werden::

source: If a function argument has a default value, it's possible to infer the type::
de: Wenn ein Funktionsargument einen Defaultwert hat, kann auf den Typ geschlossen werden::

source: The return type of the function can be specified after the arguments list using the arrow token (``->``)::
de: Der Rückgabetyp der Funktion kann nach der Argumentliste mit dem Pfeiltoken (``->``) angegeben werden::

source: Functions that have a return type **must** return a proper value. Setting the type as ``void`` means the function doesn't return anything. Void functions can return early with the ``return`` keyword, but they can't return any value.
de: Funktionen mit einem Rückgabetyp **müssen** einen richtigen Wert zurückgeben. Wenn Sie den Typ auf ``void`` setzen, gibt die Funktion nichts zurück. Void-Funktionen können mit dem Schlüsselwort ``return`` frühzeitig beendet werden, sie können jedoch keinen Wert zurückgeben.

source: Non-void functions must **always** return a value, so if your code has branching statements (such as an ``if``/``else`` construct), all the possible paths must have a return. E.g., if you have a ``return`` inside an ``if`` block but not after it, the editor will raise an error because if the block is not executed, the function won't have a valid value to return.
de: Nicht-void-Funktionen müssen **immer** einen Wert zurückgeben. Wenn Ihr Code also Verzweigungsanweisungen enthält (z.B. ein ``if``/``else``-Konstrukt), müssen alle möglichen Pfade eine Rückgabe haben. Wenn Sie beispielsweise ein ``return`` in einem ``if``-Block haben, aber nicht danach, gibt der Editor einen Fehler aus, da die Funktion keinen gültigen Wert für die Rückgabe hat, wenn der Block nicht ausgeführt wird.

source: Referencing functions
de: Funktionen referenzieren

source: Functions are first-class items in terms of the :ref:`Callable <class_Callable>` object. Referencing a function by name without calling it will automatically generate the proper callable. This can be used to pass functions as arguments.
de: Funktionen sind Elemente erster Klasse im Sinne des :ref:`Callable <class_Callable>`-Objekts. Wenn man eine Funktion mit ihrem Namen referenziert, ohne sie aufzurufen, wird automatisch das richtige Callable erzeugt. Dies kann verwendet werden, um Funktionen als Argumente zu übergeben.

source: Callables **must** be called with the ``call`` method. You cannot use the ``()`` operator directly. This behavior is implemented to avoid performance issues on direct function calls.
de: Callables **müssen** mit der Methode ``call`` aufgerufen werden. Sie können den ``()`` Operator nicht direkt verwenden. Dieses Verhalten ist implementiert, um Performanceprobleme bei direkten Funktionsaufrufen zu vermeiden.

source: Lambda functions
de: Lambda-Funktionen

source: Lambda functions allow you to declare functions that do not belong to a class. Instead a :ref:`Callable <class_Callable>` object is created and assigned to a variable directly. This can be useful to create Callables to pass around without polluting the class scope.
de: Mit Lambda-Funktionen können Sie Funktionen deklarieren, die nicht zu einer Klasse gehören. Stattdessen wird ein :ref:`Callable <class_Callable>`-Objekt erstellt und direkt einer Variablen zugewiesen. Dies kann nützlich sein, um Callables zu erstellen und weiterzugeben, ohne den Geltungsbereich der Klasse zu verschmutzen.

source: Lambda functions can be named for debugging purposes::
de: Lambda-Funktionen können zu Debugging-Zwecken benannt werden::

source: Lambda functions capture the local environment. Local variables are passed by value, so they won't be updated in the lambda if changed in the local function::
de: Lambda-Funktionen erfassen die lokale Umgebung. Lokale Variablen werden als Wert übergeben, so dass sie im Lambda nicht aktualisiert werden, wenn sie in der lokalen Funktion geändert werden::

source: The values of the outer scope behave like constants. Therefore, if you declare an array or dictionary, it can still be modified afterwards.
de: Die Werte des äußeren Geltungsbereichs verhalten sich wie Konstanten. Wenn Sie also ein Array oder ein Dictionary deklarieren, können Sie es anschließend noch ändern.

source: Static functions
de: Statische Funktionen

source: A function can be declared static. When a function is static, it has no access to the instance member variables or ``self``. A static function has access to static variables. Also static functions are useful to make libraries of helper functions::
de: Eine Funktion kann als statisch deklariert werden. Wenn eine Funktion statisch ist, hat sie keinen Zugriff auf die Member-Variablen der Instanz oder ``self``. Eine statische Funktion hat Zugriff auf statische Variablen. Auch statische Funktionen sind nützlich, um Bibliotheken von Hilfsfunktionen zu erstellen::

source: Lambdas cannot be declared static.
de: Lambdas können nicht als statisch deklariert werden.

source: See also `Static variables`_ and `Static constructor`_.
de: Siehe auch `Statische Variablen`_ und `Statischer Konstruktor`_.

source: Statements and control flow
de: Anweisungen und Kontrollfluss

source: Statements are standard and can be assignments, function calls, control flow structures, etc (see below). ``;`` as a statement separator is entirely optional.
de: Ausdrücke sind Standard und können Zuweisungen sein, Funktionsaufrufe, Kontrollfluss-Strukturen, etc. (siehe unten). ``;`` als Trennzeichen zwischen Ausdrücken ist optional.

source: Expressions
de: Ausdrücke

source: Expressions are sequences of operators and their operands in orderly fashion. An expression by itself can be a statement too, though only calls are reasonable to use as statements since other expressions don't have side effects.
de: Ausdrücke sind Folgen von Operatoren und ihren Operanden in geordneter Weise. Ein Ausdruck selbst kann auch eine Anweisung sein, allerdings sind nur Aufrufe als Anweisungen sinnvoll, da andere Ausdrücke keine Nebeneffekte haben.

source: Expressions return values that can be assigned to valid targets. Operands to some operator can be another expression. An assignment is not an expression and thus does not return any value.
de: Ausdrücke geben Werte zurück, die gültigen Zielen zugewiesen werden können. Operanden für einen Operator können ein anderer Ausdruck sein. Eine Zuweisung ist kein Ausdruck und gibt daher auch keinen Wert zurück.

source: Here are some examples of expressions::
de: Hier sind einige Beispiele für Ausdrücke::

source: Identifiers, attributes, and subscripts are valid assignment targets. Other expressions cannot be on the left side of an assignment.
de: Bezeichner, Attribute und Element-Zugriffe sind gültige Zuweisungsziele. Andere Ausdrücke können nicht auf der linken Seite einer Zuweisung stehen.

source: Simple conditions are created by using the ``if``/``else``/``elif`` syntax. Parenthesis around conditions are allowed, but not required. Given the nature of the tab-based indentation, ``elif`` can be used instead of ``else``/``if`` to maintain a level of indentation.
de: Einfache Bedingungen werden mit der ``if``/``else``/``elif`` Syntax erstellt. Klammern um die Bedingungen zu setzten ist möglich, aber nicht zwingend notwendig. Angesichts der Tabulator-basierten Einrückung kann ``elif`` anstelle von ``else``/``if`` verwendet werden, um auf dem selben Level der Einrückung zu bleiben.

source: Short statements can be written on the same line as the condition::
de: Kurze Anweisungen können in dieselbe Zeile wie die Bedingung geschrieben werden::

source: Sometimes, you might want to assign a different initial value based on a boolean expression. In this case, ternary-if expressions come in handy::
de: Manchmal möchte man vielleicht einen unterschiedlichen initialen Wert basierend auf einem booleschen Ausdruck zuweisen. Hierfür ist der ternäre If-Ausdruck nützlich::

source: Ternary-if expressions can be nested to handle more than 2 cases. When nesting ternary-if expressions, it is recommended to wrap the complete expression over multiple lines to preserve readability::
de: Ternäre-if-Ausdrücke können verschachtelt werden, um mehr als 2 Fälle zu behandeln. Bei der Verschachtelung von ternären if-Ausdrücken wird empfohlen, den gesamten Ausdruck über mehrere Zeilen zu verteilen, um die Lesbarkeit zu erhalten::

source: You may also wish to check if a value is contained within something. You can use an ``if`` statement combined with the ``in`` operator to accomplish this::
de: Man kann auch prüfen, ob ein Wert in etwas enthalten ist. Dazu können Sie eine ``if``-Anweisung in Kombination mit dem ``in``-Operator verwenden::
