Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_basics.po
Languages: de

source: Simple loops are created by using ``while`` syntax. Loops can be broken using ``break`` or continued using ``continue`` (which skips to the next iteration of the loop without executing any further code in the current iteration):
de: Einfache Schleifen werden mit der ``while``-Syntax erstellt. Schleifen können mit ``break`` unterbrochen oder mit ``continue`` fortgesetzt werden (wodurch zur nächsten Iteration der Schleife übergegangen wird, ohne dass in der aktuellen Iteration weiterer Code ausgeführt wird):

source: To iterate through a range, such as an array or table, a *for* loop is used. When iterating over an array, the current array element is stored in the loop variable. When iterating over a dictionary, the *key* is stored in the loop variable.
de: Um eine Range wie ein Array oder eine Tabelle zu durchlaufen, wird eine *for* -Schleife verwendet. Beim Iterieren über ein Array wird das aktuelle Array-Element in der Schleifenvariablen gespeichert. Beim Durchlaufen eines Dictionary wird der *Key* in der Schleifenvariablen gespeichert.

source: If you want to assign values on an array as it is being iterated through, it is best to use ``for i in array.size()``.
de: Wenn Sie einem Array Werte zuweisen wollen, während es durchlaufen wird, ist es am besten, ``for i in array.size()`` zu verwenden.

source: The loop variable is local to the for-loop and assigning to it will not change the value on the array. Objects passed by reference (such as nodes) can still be manipulated by calling methods on the loop variable.
de: Die Schleifenvariable ist in der for-Schleife lokal, und die Zuweisung an sie ändert den Wert im Array nicht. Objekte, die als Referenz übergeben werden (wie z. B. Nodes), können weiterhin durch den Aufruf von Methoden auf der Schleifenvariable manipuliert werden.

source: A ``match`` statement is used to branch execution of a program. It's the equivalent of the ``switch`` statement found in many other languages, but offers some additional features.
de: Eine ``match``-Anweisung benutzt man, um die Ausführung des Programms zu verzweigen. Sie ist äquivalent zur ``switch``-Anweisung, wie sie aus vielen anderen Sprachen bekannt ist, aber bietet darüberhinaus zusätzliche Funktionalität.

source: ``match`` is more type strict than the ``==`` operator. For example ``1`` will **not** match ``1.0``. The only exception is ``String`` vs ``StringName`` matching: for example, the String ``"hello"`` is considered equal to the StringName ``&"hello"``.
de: ``match`` ist strenger als der Operator ``==``. Zum Beispiel entspricht ``1`` **nicht** ``1.0``. Die einzige Ausnahme ist die Übereinstimmung von ``String`` und ``StringName``: zum Beispiel wird der String ``"hallo"`` als gleichwertig mit dem StringName ``&"hallo"`` angesehen.

source: Basic syntax
de: Grundlegende Syntax

source: Crash-course for people who are familiar with switch statements
de: Crashkurs für jene, die mit switch-Anweisungen vertraut sind

source: Replace ``switch`` with ``match``.
de: Ersetze ``switch`` mit ``match``.

source: Remove ``case``.
de: Entferne ``case``.

source: Remove any ``break``\ s.
de: Entferne alle ``break``\s.

source: Change ``default`` to a single underscore.
de: Ändere ``default`` zu einem einzelnen Unterstrich.

source: Control flow
de: Kontrollfluss

source: The patterns are matched from top to bottom. If a pattern matches, the first corresponding block will be executed. After that, the execution continues below the ``match`` statement.
de: Die Muster werden von oben nach unten geprüft. Wenn ein Muster übereinstimmt, wird der erste entsprechende Block ausgeführt. Danach wird die Ausführung unterhalb der ``match``-Anweisung fortgesetzt.

source: The special ``continue`` behavior in ``match`` supported in 3.x was removed in Godot 4.0.
de: Das in Version 3.x unterstützte spezielle Verhalten von ``continue`` in ``match`` wurde in Godot 4.0 entfernt.

source: The following pattern types are available:
de: Die folgenden Mustertypen sind verfügbar:

source: Literal pattern
de: Literal-Muster

source: Matches a `literal <Literals_>`_::
de: Passt auf ein `Literal <Literals_>`_::

source: Expression pattern
de: Ausdruck-Muster

source: Matches a constant expression, an identifier, or an attribute access (``A.B``)::
de: Passt auf einen konstanten Ausdruck, einen Bezeichner oder einen Attributzugriff (``A.B``)::

source: Wildcard pattern
de: Wildcard-Muster

source: This pattern matches everything. It's written as a single underscore.
de: Dieses Muster passt auf alles. Es wird als einzelner Unterstrich geschrieben.

source: It can be used as the equivalent of the ``default`` in a ``switch`` statement in other languages::
de: Es kann als Äquivalent zu ``default`` in einer ``switch``-Anweisung in anderen Sprachen verwendet werden::

source: Binding pattern
de: Binding-Muster

source: A binding pattern introduces a new variable. Like the wildcard pattern, it matches everything - and also gives that value a name. It's especially useful in array and dictionary patterns::
de: Ein Binding-Muster erzeugt eine neue Variable. Wie das Wildcard-Muster passt es auf alles und gibt diesem Wert einen Namen. Es ist besonders hilfreich beim Array- und Dictionary-Muster::

source: Array pattern
de: Array-Muster

source: Matches an array. Every single element of the array pattern is a pattern itself, so you can nest them.
de: Passt auf ein Array. Jedes einzelne Element des Array-Musters ist selbst ein Muster, sodass Sie sie verschachteln können.

source: The length of the array is tested first, it has to be the same size as the pattern, otherwise the pattern doesn't match.
de: Die Länge des Arrays wird zuerst getestet. Sie muss dieselbe Größe wie das Muster haben, andernfalls passt das Muster nicht.

source: **Open-ended array**: An array can be bigger than the pattern by making the last subpattern ``..``.
de: **Array mit offenem Ende**: Ein Array kann größer als das Muster sein, indem das letzte Untermuster mit ``..`` erstellt wird.

source: Every subpattern has to be comma-separated.
de: Jedes Untermuster muss durch Kommas getrennt werden.

source: Dictionary pattern
de: Dictionary-Muster

source: Works in the same way as the array pattern. Every key has to be a constant pattern.
de: Funktioniert auf die gleiche Weise wie das Array-Muster, jeder Key muss ein konstantes Muster haben.

source: The size of the dictionary is tested first, it has to be the same size as the pattern, otherwise the pattern doesn't match.
de: Die Größe des Dictionary wird zuerst getestet. Es muss dieselbe Größe wie das Muster haben, andernfalls passt das Muster nicht.

source: **Open-ended dictionary**: A dictionary can be bigger than the pattern by making the last subpattern ``..``.
de: **Dictionary mit offenem Ende**: Ein Dictionary kann größer als das Muster sein, indem das letzte Untermuster mit ``..`` erstellt wird.

source: Every subpattern has to be comma separated.
de: Jede Untermuster muss durch ein Komma getrennt werden.

source: If you don't specify a value, then only the existence of the key is checked.
de: Wenn Sie keinen Value angeben, wird nur das Vorhandensein des Keys geprüft.

source: A value pattern is separated from the key pattern with a ``:``.
de: Ein Value-Muster wird durch ein ``:`` vom Key-Muster getrennt.

source: Multiple patterns
de: Mehrere Muster

source: You can also specify multiple patterns separated by a comma. These patterns aren't allowed to have any bindings in them.
de: Sie können auch mehrere durch Komma getrennte Muster angeben. Diese Muster dürfen keine Bindings enthalten.

source: Pattern guards
de: Muster-Guards

source: Only one branch can be executed per ``match``. Once a branch is chosen, the rest are not checked. If you want to use the same pattern for multiple branches or to prevent choosing a branch with too general pattern, you can specify a guard expression after the list of patterns with the ``when`` keyword::
de: Pro ``match`` kann nur ein Zweig ausgeführt werden. Sobald ein Zweig ausgewählt wurde, werden die anderen nicht mehr geprüft. Wenn Sie dasselbe Muster für mehrere Verzweigungen verwenden wollen oder um zu verhindern, dass eine Verzweigung mit einem zu allgemeinen Muster gewählt wird, können Sie einen Guard-Ausdruck nach der Liste der Muster mit dem Schlüsselwort ``when`` angeben::

source: If there is no matching pattern for the current branch, the guard expression is **not** evaluated and the patterns of the next branch are checked.
de: Gibt es kein passendes Muster für die aktuelle Verzweigung, wird der guard-Ausdruck **nicht** ausgewertet und die Muster der nächsten Verzweigung werden geprüft.

source: If a matching pattern is found, the guard expression is evaluated.
de: Wenn ein passendes Muster gefunden wird, wird der Guard-Ausdruck ausgewertet.

source: If it's true, then the body of the branch is executed and ``match`` ends.
de: Wenn er "true" ist, wird der Rumpf der Verzweigung ausgeführt und ``match`` endet.

source: If it's false, then the patterns of the next branch are checked.
de: Wenn sie "false" ist, werden die Muster der nächsten Verzweigung geprüft.

source: Classes
de: Klassen

source: By default, all script files are unnamed classes. In this case, you can only reference them using the file's path, using either a relative or an absolute path. For example, if you name a script file ``character.gd``::
de: Standardmäßig sind alle Skriptdateien namenlose Klassen. In diesem Fall können Sie sie nur über den Dateipfad referenzieren, entweder über einen relativen oder einen absoluten Pfad. Wenn Sie beispielsweise eine Skriptdatei ``character.gd`` benennen::

source: Registering named classes
de: Registrierung von benannten Klassen

source: You can give your class a name to register it as a new type in Godot's editor. For that, you use the ``class_name`` keyword. You can optionally use the ``@icon`` annotation with a path to an image, to use it as an icon. Your class will then appear with its new icon in the editor::
de: Sie können Ihrer Klasse einen Namen geben, um sie als neuen Typ im Editor von Godot zu registrieren. Dazu verwenden Sie das Schlüsselwort ``class_name``. Optional können Sie die Annotation ``@icon`` mit einem Pfad zu einem Bild verwenden, um es als Icon zu benutzen. Ihre Klasse wird dann mit ihrem neuen Icon im Editor erscheinen::

source: Here's a class file example:
de: Hier ist ein Beispiel für eine Klassendatei:

source: If you want to use ``extends`` too, you can keep both on the same line::
de: Wenn Sie auch ``extends`` verwenden wollen, können Sie beides in der gleichen Zeile unterbringen::

source: Godot initializes non-static variables every time you create an instance, and this includes arrays and dictionaries. This is in the spirit of thread safety, since scripts can be initialized in separate threads without the user knowing.
de: Godot initialisiert nicht-statische Variablen jedes Mal, wenn Sie eine Instanz erstellen, und dies schließt Arrays und Dictionarys ein. Dies ist im Sinne der Thread-Sicherheit, da Skripte in separaten Threads initialisiert werden können, ohne dass der Benutzer dies merkt.

source: Inheritance
de: Vererbung

source: A class (stored as a file) can inherit from:
de: Eine Klasse (gespeichert als Datei) kann erben von:

source: A global class.
de: Einer globalen Klasse.

source: Another class file.
de: Einer anderen Klassendatei.

source: An inner class inside another class file.
de: Eine inneren Klasse innerhalb einer anderen Klassendatei.

source: Multiple inheritance is not allowed.
de: Mehrfach-Vererbung ist nicht erlaubt.

source: Inheritance uses the ``extends`` keyword::
de: Vererbung verwendet das Schlüsselwort ``extends``::

source: If inheritance is not explicitly defined, the class will default to inheriting :ref:`class_RefCounted`.
de: Wenn die Vererbung nicht ausdrücklich definiert ist, erbt die Klasse standardmäßig von :ref:`class_RefCounted`.

source: To check if a given instance inherits from a given class, the ``is`` keyword can be used::
de: Um zu prüfen, ob eine gegebene Instanz von einer gegebenen Klasse erbt, verwendet man das Schlüsselwort ``is``::

source: To call a function in a *super class* (i.e. one ``extend``-ed in your current class), use the ``super`` keyword::
de: Um eine Funktion in einer *Superklasse* aufzurufen (d.h. eine, die in Ihrer aktuellen Klasse ``erweitert`` wurde), verwenden Sie das Schlüsselwort ``super``::

source: This is especially useful because functions in extending classes replace functions with the same name in their super classes. If you still want to call them, you can use ``super``::
de: Dies ist besonders nützlich, weil Funktionen in erweiternden Klassen Funktionen mit demselben Namen in ihren Superklassen ersetzen. Wenn Sie sie trotzdem aufrufen wollen, können Sie ``super`` verwenden::

source: If you need to call a different function from the super class, you can specify the function name with the attribute operator::
de: Wenn Sie eine andere Funktion aus der Superklasse aufrufen müssen, können Sie den Funktionsnamen mit dem Attribut-Operator angeben::

source: One of the common misconceptions is trying to override *non-virtual* engine methods such as ``get_class()``, ``queue_free()``, etc. This is not supported for technical reasons.
de: Eines der häufigsten Mißverständnisse ist der Versuch, *nichtvirtuelle* Engine-Methoden wie ``get_class()``, ``queue_free()``, etc. zu überschreiben. Dies wird aus technischen Gründen nicht unterstützt.

source: In Godot 3, you can *shadow* engine methods in GDScript, and it will work if you call this method in GDScript. However, the engine will **not** execute your code if the method is called inside the engine on some event.
de: In Godot 3 können Sie Methoden der Engine in GDScript per *Shadowing* überlagern, und es wird funktionieren, wenn Sie diese Methode in GDScript aufrufen. Allerdings wird die Engine Ihren Code **nicht** ausführen, wenn die Methode innerhalb der Engine bei einem Event aufgerufen wird.

source: In Godot 4, even shadowing may not always work, as GDScript optimizes native method calls. Therefore, we added the ``NATIVE_METHOD_OVERRIDE`` warning, which is treated as an error by default. We strongly advise against disabling or ignoring the warning.
de: In Godot 4 funktioniert sogar das Shadowing nicht immer, da GDScript die nativen Methodenaufrufe optimiert. Daher haben wir die Warnung ``NATIVE_METHOD_OVERRIDE`` hinzugefügt, die standardmäßig als Fehler behandelt wird. Wir raten dringend davon ab, diese Warnung zu deaktivieren oder zu ignorieren.

source: Note that this does not apply to virtual methods such as ``_ready()``, ``_process()`` and others (marked with the ``virtual`` qualifier in the documentation and the names start with an underscore). These methods are specifically for customizing engine behavior and can be overridden in GDScript. Signals and notifications can also be useful for these purposes.
de: Beachten Sie, dass dies nicht für virtuelle Methoden wie ``_ready()``, ``_process()`` und andere gilt (in der Dokumentation mit dem Qualifier ``virtual`` gekennzeichnet, und die Namen beginnen mit einem Unterstrich). Diese Methoden sind speziell für die Anpassung des Verhaltens der Engine gedacht und können in GDScript überschrieben werden. Signale und Benachrichtigungen können für diese Zwecke ebenfalls nützlich sein.

source: Class constructor
de: Klassen-Konstruktor

source: The class constructor, called on class instantiation, is named ``_init``. If you want to call the base class constructor, you can also use the ``super`` syntax. Note that every class has an implicit constructor that it's always called (defining the default values of class variables). ``super`` is used to call the explicit constructor::
de: Der Klassenkonstruktor, der bei der Instanziierung der Klasse aufgerufen wird, heißt ``_init``. Wenn Sie den Konstruktor der Basisklasse aufrufen wollen, können Sie auch die ``super``-Syntax verwenden. Beachten Sie, dass jede Klasse einen impliziten Konstruktor hat, der immer aufgerufen wird (er definiert die Defaultwerte der Klassenvariablen). ``super`` wird verwendet, um den expliziten Konstruktor aufzurufen::

source: This is better explained through examples. Consider this scenario::
de: Dies lässt sich besser anhand von Beispielen erklären. Betrachten Sie dieses Szenario::

source: There are a few things to keep in mind here:
de: Hier müssen ein paar Sachen berücksichtigt werden:

source: If the inherited class (``state.gd``) defines a ``_init`` constructor that takes arguments (``e`` in this case), then the inheriting class (``idle.gd``) *must* define ``_init`` as well and pass appropriate parameters to ``_init`` from ``state.gd``.
de: Wenn die geerbte Klasse (``state.gd``) einen ``_init``-Konstruktor definiert, der Argumente entgegennimmt (in diesem Fall ``e``), dann *muss* die erbende Klasse (``idle.gd``) ``_init`` ebenfalls definieren und entsprechende Parameter an ``_init`` von ``state.gd`` übergeben.

source: ``idle.gd`` can have a different number of arguments than the base class ``state.gd``.
de: ``idle.gd`` kann eine andere Anzahl von Argumenten haben als die Basisklasse ``state.gd``.

source: In the example above, ``e`` passed to the ``state.gd`` constructor is the same ``e`` passed in to ``idle.gd``.
de: Im obigen Beispiel ist ``e``, das an den Konstruktor ``state.gd`` übergeben wird, das gleiche ``e``, das an ``idle.gd`` übergeben wird.

source: If ``idle.gd``'s ``_init`` constructor takes 0 arguments, it still needs to pass some value to the ``state.gd`` base class, even if it does nothing. This brings us to the fact that you can pass expressions to the base constructor as well, not just variables, e.g.::
de: Wenn der ``_init``-Konstruktor von ``idle.gd`` 0 Argumente annimmt, muss er trotzdem einen Wert an die Basisklasse ``state.gd`` übergeben, auch wenn er nichts tut. Das bringt uns zu der Tatsache, dass man auch Ausdrücke an den Basiskonstruktor übergeben kann, nicht nur Variablen, z.B.::

source: Static constructor
de: Statischer Konstruktor

source: A static constructor is a static function ``_static_init`` that is called automatically when the class is loaded, after the static variables have been initialized::
de: Ein statischer Konstruktor ist eine statische Funktion ``_static_init``, die automatisch beim Laden der Klasse aufgerufen wird, nachdem die statischen Variablen initialisiert worden sind::

source: A static constructor cannot take arguments and must not return any value.
de: Ein statischer Konstruktor kann keine Argumente annehmen und darf keinen Wert zurückgeben.

source: Inner classes
de: Innere Klassen

source: A class file can contain inner classes. Inner classes are defined using the ``class`` keyword. They are instanced using the ``ClassName.new()`` function.
de: Eine Klassendatei kann innere Klassen beinhalten. Innere Klassen werden durch das ``class``-Schlüsselwort definiert. Sie werden mithilfe der ``ClassName.new()``-Funktion instanziert.

source: Classes as resources
de: Klassen als Ressourcen

source: Classes stored as files are treated as :ref:`resources <class_GDScript>`. They must be loaded from disk to access them in other classes. This is done using either the ``load`` or ``preload`` functions (see below). Instancing of a loaded class resource is done by calling the ``new`` function on the class object::
de: Klassen, die als Datei gespeichert sind, werden als :ref:`Ressourcen <class_GDScript>` behandelt. Sie müssen von der Festplatte geladen werden, um auf sie in anderen Klassen zuzugreifen. Dies macht man mit den Funktionen ``load`` oder ``preload`` (siehe weiter unten). Das Instanziieren einer geladenen Klassenressource erledigt man durch Aufruf der ``new``-Funktion auf dem Klassenobjekt::

source: Exports
de: Exporte

source: Documentation about exports has been moved to :ref:`doc_gdscript_exports`.
de: Die Dokumentation über Exportieren wurde nach :ref:`doc_gdscript_exports` verschoben.

source: Properties (setters and getters)
de: Propertys (set/get)

source: Sometimes, you want a class' member variable to do more than just hold data and actually perform some validation or computation whenever its value changes. It may also be desired to encapsulate its access in some way.
de: Manchmal möchte man, dass eine Member-Variable einer Klasse mehr tut, als nur Daten zu speichern und bei jeder Änderung ihres Wertes eine Validierung oder Berechnung durchzuführen. Es kann auch erwünscht sein, den Zugriff auf sie in irgendeiner Weise zu kapseln.

source: For this, GDScript provides a special syntax to define properties using the ``set`` and ``get`` keywords after a variable declaration. Then you can define a code block that will be executed when the variable is accessed or assigned.
de: Hierfür bietet GDScript eine spezielle Syntax zur Definition von Propertys mit den Schlüsselwörtern ``set`` und ``get`` nach einer Variablendeklaration. Anschließend können Sie einen Codeblock definieren, der ausgeführt wird, wenn auf die Variable zugegriffen wird oder sie zugewiesen wird.

source: Example::
de: Beispiel::

source: Unlike ``setget`` in previous Godot versions, the properties setter and getter are **always** called (except as noted below), even when accessed inside the same class (with or without prefixing with ``self.``). This makes the behavior consistent. If you need direct access to the value, use another variable for direct access and make the property code use that name.
de: Im Gegensatz zu ``setget`` in früheren Godot-Versionen werden die Proprety-Setter und -Getter **immer** aufgerufen (außer wie unten angegeben), auch wenn auf sie innerhalb derselben Klasse zugegriffen wird (mit oder ohne Voranstellen von ``self.``). Dies macht das Verhalten konsistent. Wenn Sie direkten Zugriff auf den Wert benötigen, verwenden Sie eine andere Variable für den direkten Zugriff und lassen den Property-Code diesen Namen verwenden.

source: Also there is another notation to use existing class functions if you want to split the code from the variable declaration or you need to reuse the code across multiple properties (but you can't distinguish which property the setter/getter is being called for)::
de: Es gibt auch eine andere Notation, um bestehende Klassenfunktionen zu verwenden, wenn Sie den Code von der Variablendeklaration trennen wollen oder den Code für mehrere Propertys wiederverwenden müssen (aber Sie können nicht unterscheiden, für welche Property der Setter/Getter aufgerufen wird)::

source: This can also be done in the same line::
de: Dies kann auch in der gleichen Zeile geschehen::

source: The setter and getter must use the same notation, mixing styles for the same variable is not allowed.
de: Der Setter und der Getter müssen dieselbe Notation verwenden, das Mischen von Stilen für dieselbe Variable ist nicht erlaubt.

source: You cannot specify type hints for *inline* setters and getters. This is done on purpose to reduce the boilerplate. If the variable is typed, then the setter's argument is automatically of the same type, and the getter's return value must match it. Separated setter/getter functions can have type hints, and the type must match the variable's type or be a wider type.
de: Für *inline* Setter und Getter können keine Typ-Hinweise angegeben werden. Dies geschieht absichtlich, um Boilerplate-Code zu reduzieren. Wenn die Variable typisiert ist, dann ist das Argument des Setters automatisch vom gleichen Typ und der Rückgabewert des Getters muss damit übereinstimmen. Getrennte Setter/Getter-Funktionen können Type-Hints haben, und der Typ muss mit dem Typ der Variablen übereinstimmen oder ein breiterer Typ sein.

source: When setter/getter is not called
de: Wann setter/getter nicht aufgerufen werden
