Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_basics.po
Languages: de

source: GDScript reference
de: GDScript-Referenz

source: :ref:`GDScript<doc_gdscript>` is a high-level, `object-oriented <https://en.wikipedia.org/wiki/Object-oriented_programming>`_, `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`_, and `gradually typed <https://en.wikipedia.org/wiki/Gradual_typing>`_ programming language built for Godot. It uses an indentation-based syntax similar to languages like `Python <https://en.wikipedia.org/wiki/Python_%28programming_language%29>`_. Its goal is to be optimized for and tightly integrated with Godot Engine, allowing great flexibility for content creation and integration.
de: :ref:`GDScript<doc_gdscript>` ist eine High-Level, `objektorientierte <https://en.wikipedia.org/wiki/Object-oriented_programming>`_, `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`_ und `graduell typisierte <https://en.wikipedia.org/wiki/Gradual_typing>`_ Programmiersprache, die für Godot entwickelt wurde. Sie verwendet eine auf Einrückungen basierende Syntax, ähnlich zu Sprachen wie `Python <https://en.wikipedia.org/wiki/Python_%28programming_language%29>`_. Ihr Ziel ist es, für die Godot-Engine optimiert und eng in sie integriert zu werden, was eine große Flexibilität bei der Erstellung und Integration von Inhalten ermöglicht.

source: GDScript is entirely independent from Python and is not based on it.
de: GDScript ist völlig unabhängig von Python und basiert nicht darauf.

source: History
de: Geschichte

source: Documentation about GDScript's history has been moved to the :ref:`Frequently Asked Questions <doc_faq_what_is_gdscript>`.
de: Ältere Artikel über GDScript wurden in die :ref:`Häufig gestellten Fragen <doc_faq_what_is_gdscript>` verschoben.

source: Example of GDScript
de: Beispiel für GDScript

source: Some people can learn better by taking a look at the syntax, so here's an example of how GDScript looks.
de: Manche Leute können besser lernen, indem sie sich die Syntax ansehen. Hier ist ein Beispiel dafür, wie GDScript aussieht.

source: If you have previous experience with statically typed languages such as C, C++, or C# but never used a dynamically typed one before, it is advised you read this tutorial: :ref:`doc_gdscript_more_efficiently`.
de: Wenn Sie bereits Erfahrung mit statisch typisierten Sprachen wie C, C++ oder C# haben, aber bisher keine dynamisch typisierte verwendet haben, wird das Lesen dieses Tutorials empfohlen: :ref:`doc_gdscript_more_efficiently`.

source: Language
de: Sprache

source: In the following, an overview is given to GDScript. Details, such as which methods are available to arrays or other objects, should be looked up in the linked class descriptions.
de: Im Folgenden wird ein Überblick über GDScript gegeben. Details, wie welche Methoden es für Arrays oder andere Objekte gibt, sollten in den verlinkten Klassenbeschreibungen nachgeschlagen werden.

source: Identifiers
de: Bezeichner

source: Any string that restricts itself to alphabetic characters (``a`` to ``z`` and ``A`` to ``Z``), digits (``0`` to ``9``) and ``_`` qualifies as an identifier. Additionally, identifiers must not begin with a digit. Identifiers are case-sensitive (``foo`` is different from ``FOO``).
de: Jeder String, der beschränkt ist auf Zeichen des Alphabets (``a`` bis ``z`` und ``A`` bis ``Z``), Ziffern (``0`` bis ``9``) und ``_``, ist ein gültiger Bezeichner. Zusätzlich dürfen Bezeichner nicht mit einer Ziffer beginnen. Bei Bezeichnern wird Groß- und Kleinschreibung unterschieden (``foo`` unterscheidet sich von ``FOO``).

source: Identifiers may also contain most Unicode characters part of `UAX#31 <https://www.unicode.org/reports/tr31/>`__. This allows you to use identifier names written in languages other than English. Unicode characters that are considered "confusable" for ASCII characters and emoji are not allowed in identifiers.
de: Bezeichner können auch die meisten Unicode-Zeichen enthalten, die Teil von `UAX#31 <https://www.unicode.org/reports/tr31/>`__ sind. Dies ermöglicht die Verwendung von Bezeichnernamen, die in anderen Sprachen als Englisch geschrieben sind. Unicode-Zeichen, die als "verwechselbar" mit ASCII-Zeichen und Emoji gelten, sind in Bezeichnern nicht erlaubt.

source: Keywords
de: Schlüsselwörter

source: The following is the list of keywords supported by the language. Since keywords are reserved words (tokens), they can't be used as identifiers. Operators (like ``in``, ``not``, ``and`` or ``or``) and names of built-in types as listed in the following sections are also reserved.
de: Das Folgende ist eine Auflistung von Schlüsselwörtern, die von der Sprache unterstützt werden. Da Schlüsselwörter reservierte Wörter (Tokens) sind, können sie nicht als Bezeichner verwendet werden. Operatoren (wie ``in``, ``not``, ``and`` oder ``or``) und Namen von Built-in-Typen, die in den folgenden Abschnitten aufgelistet werden, sind ebenfalls reserviert.

source: Keywords are defined in the `GDScript tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ in case you want to take a look under the hood.
de: Schlüsselwörter werden im `GDSkript Tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ definiert, falls Sie einen Blick unter die Haube werfen möchten.

source: Keyword
de: Schlüsselwort

source: Description
de: Beschreibung

source: See `if/else/elif`_.
de: Siehe `if/else/elif`_.

source: See for_.
de: Siehe for_.

source: See while_.
de: Siehe while_.

source: See match_.
de: Siehe match_.

source: Exits the execution of the current ``for`` or ``while`` loop.
de: Beendet die Ausführung der aktuellen ``for`` oder ``while``-Schleife.

source: Immediately skips to the next iteration of the ``for`` or ``while`` loop.
de: Springt sofort zur nächsten Iteration der ``for`` oder ``while``-Schleife.

source: Used where a statement is required syntactically but execution of code is undesired, e.g. in empty functions.
de: Benutzt man, wo eine Anweisung zwar syntaktisch benötigt wird, aber die Ausführung von Code eigentlich ungewünscht ist, z.B. in leeren Funktionen.

source: Returns a value from a function.
de: Gibt einen Wert aus einer Funktion zurück.

source: Defines an inner class. See `Inner classes`_.
de: Definiert eine innere Klasse. Siehe `Innere Klassen`_.

source: Defines the script as a globally accessible class with the specified name. See `Registering named classes`_.
de: Definiert das Skript als eine global zugängliche Klasse mit dem angegebenen Namen. Siehe `Registrierung benannter Klassen`_.

source: Defines what class to extend with the current class.
de: Definiert von welcher Klasse die aktuelle Klasse abgeleitet soll.

source: Tests whether a variable extends a given class, or is of a given built-in type.
de: Testet, ob eine Variable von einer gegeben Klasse abgeleitet ist oder einem gegebenen Built-in-Typen entspricht.

source: Tests whether a value is within a string, array, range, dictionary, or node. When used with ``for``, it iterates through them instead of testing.
de: Prüft, ob ein Wert innerhalb eines Strings, eines Arrays, einer Range, eines Dictionarys oder eines Nodes liegt. Wenn es mit ``for`` verwendet wird, durchläuft es sie, anstatt zu testen.

source: Cast the value to a given type if possible.
de: Wandelt den Wert in einen gegebenen Typ um, falls möglich.

source: Refers to current class instance.
de: Bezieht sich auf die aktuelle Klassen-Instanz.

source: Defines a signal.
de: Definiert ein Signal.

source: Defines a function.
de: Definiert eine Funktion.

source: Defines a static function or a static member variable.
de: Definiert eine statische Funktion oder eine statische Membervariable.

source: Defines a constant.
de: Definiert eine Konstante.

source: Defines an enum.
de: Definiert ein Enum.

source: Defines a variable.
de: Definiert eine Variable.

source: Editor helper for debugger breakpoints. Unlike breakpoints created by clicking in the gutter, ``breakpoint`` is stored in the script itself. This makes it persistent across different machines when using version control.
de: Editor-Helfer für Debugger-Breakpoints. Im Gegensatz zu Breakpoints, die durch Klicken am Seitenrand erzeugt werden, wird ``breakpoint`` im Skript selbst gespeichert. Dadurch bleibt er bei Verwendung der Versionsverwaltung auf verschiedenen Rechnern erhalten.

source: Preloads a class or variable. See `Classes as resources`_.
de: Lädt eine Variable oder Klasse im Voraus, siehe `Klassen als Ressourcen`_.

source: Waits for a signal or a coroutine to finish. See `Awaiting for signals or coroutines`_.
de: Wartet auf das Ende eines Signals oder einer Coroutine. Siehe `Warten auf Signale oder Coroutines`_.

source: Previously used for coroutines. Kept as keyword for transition.
de: Wurde früher für Coroutinen verwendet. Wird übergangsweise als Schlüsselwort beibehalten.

source: Asserts a condition, logs error on failure. Ignored in non-debug builds. See `Assert keyword`_.
de: Fügt eine Assertion für eine Bedingung hinzu, protokolliert Fehler bei Fehlschlag. Wird in Nicht-Debug-Builds ignoriert. Siehe `Assert-Schlüsselwort`_.

source: Used to represent that a function does not return any value.
de: Wird verwendet, um darzustellen, dass eine Funktion keinen Wert zurückgibt.

source: PI constant.
de: Die PI-Konstante.

source: TAU constant.
de: Die TAU-Konstante.

source: Infinity constant. Used for comparisons and as result of calculations.
de: Unendlichkeitskonstante. Wird für Vergleiche und als Ergebnis von Berechnungen verwendet.

source: NAN (not a number) constant. Used as impossible result from calculations.
de: NAN (not a number, keine Zahl)-Konstante. Wird als unmögliches Ergebnis von Berechnungen verwendet.

source: Operators
de: Operatoren

source: The following is the list of supported operators and their precedence.
de: Es folgt eine Liste der unterstützen Operatoren und ihrer Auswertungsreihenfolge.

source: **Description**
de: **Beschreibung**

source: Grouping (highest priority)
de: Gruppierung (höchste Priorität)

source: Parentheses are not really an operator, but allow you to explicitly specify the precedence of an operation.
de: Klammern sind eigentlich kein Operator, sondern ermöglichen es Ihnen, den Vorrang einer Operation explizit anzugeben.

source: Subscription
de: Element-Zugriff

source: Attribute reference
de: Referenzierung eines Attributs

source: Function call
de: Funktionsaufruf

source: `Awaiting for signals or coroutines`_
de: `Warten auf Signale oder Coroutinen`_

source: Type checking
de: Typprüfung

source: See also :ref:`is_instance_of() <class_@GDScript_method_is_instance_of>` function.
de: Siehe auch :ref:`is_instance_of() <class_@GDScript_method_is_instance_of>`-Funktion.

source: Power
de: Potenzierung

source: Multiplies ``x`` by itself ``y`` times, similar to calling :ref:`pow() <class_@GlobalScope_method_pow>` function.
de: Multipliziert ``x`` mit sich selbst ``y`` mal, ähnlich dem Aufruf der Funktion :ref:`pow() <class_@GlobalScope_method_pow>`.

source: **Note:** In GDScript, the ``**`` operator is `left-associative <https://en.wikipedia.org/wiki/Operator_associativity>`_. See a detailed note after the table.
de: **Hinweis:** In GDScript ist der Operator ``**`` `links-assoziativ <https://en.wikipedia.org/wiki/Operator_associativity>`_. Siehe einen ausführlichen Hinweis nach der Tabelle.

source: Bitwise NOT
de: Bitweise Negation

source: Identity / Negation
de: identische Abbildung / Negation

source: Multiplication / Division / Remainder
de: Multiplikation / Division / Modulus (Rest)

source: The ``%`` operator is additionally used for :ref:`format strings <doc_gdscript_printf>`.
de: Der Operator ``%`` wird zusätzlich für :ref:`Format-Strings <doc_gdscript_printf>` verwendet.

source: **Note:** These operators have the same behavior as C++, which may be unexpected for users coming from Python, JavaScript, etc. See a detailed note after the table.
de: **Hinweis:** Diese Operatoren haben das gleiche Verhalten wie in C++, was für Benutzer, die aus Python, JavaScript usw. kommen, unerwartet sein kann. Siehe einen ausführlichen Hinweis nach der Tabelle.

source: Addition (or Concatenation) / Subtraction
de: Addition (oder Verkettung) / Subtraktion

source: Bitwise AND
de: Bitweises UND

source: Bitwise XOR
de: Bitweises XOR

source: Bitwise OR
de: Bitweises ODER

source: Comparison
de: Vergleich

source: See a detailed note after the table.
de: Siehe eine ausführliche Anmerkung nach der Tabelle.

source: Inclusion checking
de: Prüfung auf Enthaltensein

source: ``in`` is also used with the for_ keyword as part of the syntax.
de: ``in`` wird auch mit dem Schlüsselwort for_ als Teil der Syntax verwendet.

source: Boolean NOT and its :ref:`unrecommended <boolean_operators>` alias
de: Boolesches NOT und sein :ref:`nicht empfohlener <boolean_operators>`-Alias

source: Boolean AND and its :ref:`unrecommended <boolean_operators>` alias
de: Boolesches UND und sein :ref:`unempfohlener <boolean_operators>` Alias

source: Boolean OR and its :ref:`unrecommended <boolean_operators>` alias
de: Boolesches ODER und sein :ref:`unempfohlener <boolean_operators>` Alias

source: Ternary if/else
de: Ternäres if/else

source: `Type casting <casting_>`_
de: `Typ-Casting <casting_>`_

source: Assignment (lowest priority)
de: Zuweisung (niedrigste Priorität)

source: You cannot use an assignment operator inside an expression.
de: Sie können einen Zuweisungsoperator nicht innerhalb eines Ausdrucks verwenden.

source: The behavior of some operators may differ from what you expect:
de: Das Verhalten einiger Operatoren kann von dem abweichen, was Sie erwarten:

source: If both operands of the ``/`` operator are :ref:`int <class_int>`, then integer division is performed instead of fractional. For example ``5 / 2 == 2``, not ``2.5``. If this is not desired, use at least one :ref:`float <class_float>` literal (``x / 2.0``), cast (``float(x) / y``), or multiply by ``1.0`` (``x * 1.0 / y``).
de: Wenn beide Operanden des Operators ``/`` :ref:`int <class_int>` sind, dann wird eine Integer-Division anstelle einer mit Kommazahlen durchgeführt. Zum Beispiel ``5 / 2 == 2``, nicht ``2.5``. Wenn dies nicht erwünscht ist, verwenden Sie mindestens ein :ref:`Float <class_float>`-Literal (``x / 2.0``), Cast (``float(x) / y``), oder multiplizieren Sie mit ``1.0`` (``x * 1.0 / y``).

source: The ``%`` operator is only available for ints, for floats use the :ref:`fmod() <class_@GlobalScope_method_fmod>` function.
de: Der ``%``-Operator ist nur für Ints verfügbar, für Floats verwenden Sie die Funktion :ref:`fmod() <class_@GlobalScope_method_fmod>`.

source: For negative values, the ``%`` operator and ``fmod()`` use `truncation <https://en.wikipedia.org/wiki/Truncation>`_ instead of rounding towards negative infinity. This means that the remainder has a sign. If you need the remainder in a mathematical sense, use the :ref:`posmod() <class_@GlobalScope_method_posmod>` and :ref:`fposmod() <class_@GlobalScope_method_fposmod>` functions instead.
de: Für negative Werte verwenden der ``%``-Operator und ``fmod()`` das `Abrunden <https://en.wikipedia.org/wiki/Truncation>`_, anstatt gegen negativ unendlich zu runden. Dies bedeutet, dass der Rest ein Vorzeichen hat. Wenn Sie den Rest im mathematischen Sinn benötigen, verwenden Sie stattdessen die Funktionen :ref:`posmod() <class_@GlobalScope_method_posmod>` und :ref:`fposmod() <class_@GlobalScope_method_fposmod>`.

source: The ``**`` operator is `left-associative <https://en.wikipedia.org/wiki/Operator_associativity>`_. This means that ``2 ** 2 ** 3`` is equal to ``(2 ** 2) ** 3``. Use parentheses to explicitly specify precedence you need, for example ``2 ** (2 ** 3)``.
de: Der Operator ``**`` ist `links-assoziativ <https://en.wikipedia.org/wiki/Operator_associativity>`_. Das bedeutet, dass ``2 ** 2 ** 3`` gleich ``(2 ** 2) ** 3`` ist. Benutzen Sie Klammern, um die benötigte Rangfolge explizit anzugeben, zum Beispiel ``2 ** (2 ** 3)``.

source: The ``==`` and ``!=`` operators sometimes allow you to compare values of different types (for example, ``1 == 1.0`` is true), but in other cases it can cause a runtime error. If you're not sure about the types of the operands, you can safely use the :ref:`is_same() <class_@GlobalScope_method_is_same>` function (but note that it is more strict about types and references). To compare floats, use the :ref:`is_equal_approx() <class_@GlobalScope_method_is_equal_approx>` and :ref:`is_zero_approx() <class_@GlobalScope_method_is_zero_approx>` functions instead.
de: Die Operatoren ``==`` und ``!=`` erlauben es manchmal, Werte unterschiedlichen Typs zu vergleichen (z.B. ``1 == 1.0`` ist wahr), aber in anderen Fällen können sie einen Laufzeitfehler verursachen. Wenn Sie sich über die Typen der Operanden nicht sicher sind, können Sie die Funktion :ref:`is_same() <class_@GlobalScope_method_is_same>` verwenden (beachten Sie aber, dass sie strenger ist, was Typen und Referenzen angeht). Um Float-Zahlen zu vergleichen, verwenden Sie stattdessen die Funktionen :ref:`is_equal_approx() <class_@GlobalScope_method_is_equal_approx>` und :ref:`is_zero_approx() <class_@GlobalScope_method_is_zero_approx>`.

source: Literals
de: Literale

source: **Example(s)**
de: **Beispiel(e)**

source: Null value
de: Null-Wert

source: Boolean values
de: Boolesche Werte

source: Base 10 integer
de: Integer zur Basis 10

source: Base 16 (hexadecimal) integer
de: Integer zur Basis 16 (hexadezimal)

source: Base 2 (binary) integer
de: Integer zur Basis 2 (binär)

source: Floating-point number (real)
de: Gleitkomma-Zahl (real)

source: ``"Hello"``, ``'Hi'``
de: ``"Hallo"``, ``'Hi'``

source: Regular strings
de: Normale Strings

source: ``"""Hello"""``, ``'''Hi'''``
de: ``"""Hallo"""``, ``'''Hi'''``

source: Triple-quoted regular strings
de: Normale Strings in drei Anführungszeichen

source: ``r"Hello"``, ``r'Hi'``
de: ``r"Hallo"``, ``r'Hi'``

source: ``r"""Hello"""``, ``r'''Hi'''``
de: ``r"""Hallo"""``, ``r'''Hi'''``

source: Triple-quoted raw strings
de: Raw-Strings in drei Anführungszeichen

source: There are also two constructs that look like literals, but actually are not:
de: Es gibt auch zwei Konstrukte, die wie Literale aussehen, aber eigentlich keine sind:

source: **Example**
de: **Beispiel**

source: Shorthand for ``get_node("NodePath")``
de: Kurzform für ``get_node("NodePath")``

source: Shorthand for ``get_node("%UniqueNode")``
de: Kurzform für ``get_node("%UniqueNode")``

source: Integers and floats can have their numbers separated with ``_`` to make them more readable. The following ways to write numbers are all valid::
de: Integer und Floats können durch ``_`` getrennt werden um die Lesbarkeit zu verbessern. Die folgenden Möglichkeiten zum Schreiben von Zahlen sind alle gültig::

source: **Regular string literals** can contain the following escape sequences:
de: **Normale String-Literale** können die folgenden Escape-Sequenzen enthalten:

source: **Escape sequence**
de: **Escape-Sequenz**

source: **Expands to**
de: **wird erweitert zu**

source: Newline (line feed)
de: Zeilenumbruch (Line Feed)

source: Horizontal tab character
de: Horizontaler Tabulator

source: Carriage return
de: Wagenrücklauf (Carriage Return)

source: Alert (beep/bell)
de: Alarm (Piepton/Klingel)

source: Backspace
de: Rückschritt

source: Formfeed page break
de: Formfeed-Seitenumbruch

source: Vertical tab character
de: Vertikaler Tabulator

source: Double quote
de: Doppeltes Anführungszeichen

source: Single quote
de: Einfaches Anführungszeichen

source: Backslash
de: Rückwärtsschrägstrich

source: UTF-16 Unicode codepoint ``XXXX`` (hexadecimal, case-insensitive)
de: UTF-16 Unicode-Codepunkt ``XXXX`` (hexadezimal, Groß- und Kleinschreibung wird nicht berücksichtigt)

source: UTF-32 Unicode codepoint ``XXXXXX`` (hexadecimal, case-insensitive)
de: UTF-32 Unicode-Codepunkt ``XXXXXX`` (hexadezimal, Groß- und Kleinschreibung wird nicht berücksichtigt)

source: There are two ways to represent an escaped Unicode character above ``0xFFFF``:
de: Es gibt zwei Möglichkeiten, ein escapetes Unicode-Zeichen über ``0xFFFF`` darzustellen:

source: as a `UTF-16 surrogate pair <https://en.wikipedia.org/wiki/UTF-16#Code_points_from_U+010000_to_U+10FFFF>`_ ``\uXXXX\uXXXX``.
de: als `UTF-16-Ersatzpaar <https://en.wikipedia.org/wiki/UTF-16#Code_points_from_U+010000_to_U+10FFFF>`_ ``\uXXXX\uXXXX``.

source: as a single UTF-32 codepoint ``\UXXXXXX``.
de: als einen einzigen UTF-32-Codepunkt ``\UXXXXXX``.

source: Also, using ``\`` followed by a newline inside a string will allow you to continue it in the next line, without inserting a newline character in the string itself.
de: Außerdem ermöglicht die Verwendung von ``\`` gefolgt von einem Zeilenumbruch innerhalb eines Strings, diesen in der nächsten Zeile fortzusetzen, ohne ein Zeilenumbruchzeichen in den String selbst einzufügen.

source: A string enclosed in quotes of one type (for example ``"``) can contain quotes of another type (for example ``'``) without escaping. Triple-quoted strings allow you to avoid escaping up to two consecutive quotes of the same type (unless they are adjacent to the string edges).
de: Ein String, der in Anführungszeichen eines Typs (z. B. ``"``) eingeschlossen ist, kann Anführungszeichen eines anderen Typs (z.B. ``'``) enthalten, ohne dass er escaped wird. Bei Strings in dreifachen Anführungszeichen können Sie darauf verzichten, bis zu zwei aufeinanderfolgende Anführungszeichen desselben Typs zu escapen (es sei denn, sie grenzen an die Ränder des Strings).

source: **Raw string literals** always encode the string as it appears in the source code. This is especially useful for regular expressions. Raw strings do not process escape sequences, but you can "escape" a quote or backslash (they replace themselves).
de: **Raw-String-Literale** kodieren den String immer so, wie er im Quellcode erscheint. Dies ist besonders nützlich für reguläre Ausdrücke. Raw-Strings verarbeiten keine Escape-Sequenzen, aber Sie können ein Anführungszeichen oder einen Backslash "escapen" lassen (sie ersetzen sich selbst).

source: GDScript also supports :ref:`format strings <doc_gdscript_printf>`.
de: GDScript unterstützt auch :ref:`format strings <doc_gdscript_printf>`.

source: Annotations
de: Annotationen

source: There are some special tokens in GDScript that act like keywords but are not, they are *annotations* instead. Every annotation start with the ``@`` character and is specified by a name. A detailed description and example for each annotation can be found inside the :ref:`GDScript class reference <class_@GDScript>`.
de: Es gibt einige spezielle Tokens in GDScript, die sich wie Schlüsselwörter verhalten, aber keine sind, sondern *Annotationen*. Jede Annotation beginnt mit dem Zeichen ``@`` und wird durch einen Namen spezifiziert. Eine detaillierte Beschreibung und ein Beispiel für jede Annotation finden Sie in der :ref:`GDScript Klassenreferenz <class_@GDScript>`.

source: Annotations affect how the script is treated by external tools and usually don't change the behavior.
de: Anmerkungen wirken sich darauf aus, wie das Skript von externen Tools behandelt wird, und ändern normalerweise nicht das Verhalten.

source: For instance, you can use it to export a value to the editor::
de: Sie können damit zum Beispiel einen Wert in den Editor exportieren::

source: For more information about exporting properties, read the :ref:`GDScript exports <doc_gdscript_exports>` article.
de: Weitere Informationen über den Export von Propertys finden Sie im Artikel :ref:`GDScript-Exporte <doc_gdscript_exports>`.
