Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_basics.po
Languages: de

source: When a variable is initialized, the value of the initializer will be written directly to the variable. Including if the ``@onready`` annotation is applied to the variable.
de: Wenn eine Variable initialisiert wird, wird der Wert des Initialisierers direkt in die Variable geschrieben. Auch wenn die Annotation ``@onready`` auf die Variable angewendet wird.

source: Using the variable's name to set it inside its own setter or to get it inside its own getter will directly access the underlying member, so it won't generate infinite recursion and saves you from explicitly declaring another variable::
de: Die Verwendung des Variablennamens, um ihn in seinem eigenen Setter zu setzen oder in seinem eigenen Getter zu holen, greift direkt auf den zugrundeliegenden Member zu, erzeugt also keine unendliche Rekursion und erspart Ihnen die explizite Deklaration einer weiteren Variable::

source: This also applies to the alternative syntax::
de: Das gilt auch für die alternative Syntax::

source: The exception does **not** propagate to other functions called in the setter/getter. For example, the following code **will** cause an infinite recursion::
de: Die Ausnahme wird **nicht** auf andere Funktionen übertragen, die im Setter/Getter aufgerufen werden. Der folgende Code zum Beispiel **verursacht** eine unendliche Rekursion::

source: Tool mode
de: Tool-Modus

source: By default, scripts don't run inside the editor and only the exported properties can be changed. In some cases, it is desired that they do run inside the editor (as long as they don't execute game code or manually avoid doing so). For this, the ``@tool`` annotation exists and must be placed at the top of the file::
de: Standardmäßig werden Skripte nicht im Editor ausgeführt und nur die exportierten Propertys können geändert werden. In einigen Fällen ist es erwünscht, dass sie innerhalb des Editors laufen (solange sie keinen Spielcode ausführen oder dies manuell vermeiden). Hierfür gibt es die Annotation ``@tool``, die am Anfang der Datei platziert werden muss::

source: See :ref:`doc_running_code_in_the_editor` for more information.
de: Siehe :ref:`doc_running_code_in_the_editor` für weitere Informationen.

source: Be cautious when freeing nodes with ``queue_free()`` or ``free()`` in a tool script (especially the script's owner itself). As tool scripts run their code in the editor, misusing them may lead to crashing the editor.
de: Seien Sie vorsichtig, wenn Sie Nodes mit ``queue_free()`` oder ``free()`` in einem Tool-Skript freigeben (insbesondere der Eigentümer des Skripts selbst). Da Tool-Skripte ihren Code im Editor ausführen, kann ihr Missbrauch zum Absturz des Editors führen.

source: Memory management
de: Speicher-Management

source: Godot implements reference counting to free certain instances that are no longer used, instead of a garbage collector, or requiring purely manual management. Any instance of the :ref:`class_RefCounted` class (or any class that inherits it, such as :ref:`class_Resource`) will be freed automatically when no longer in use. For an instance of any class that is not a :ref:`class_RefCounted` (such as :ref:`class_Node` or the base :ref:`class_Object` type), it will remain in memory until it is deleted with ``free()`` (or ``queue_free()`` for Nodes).
de: Godot implementiert die Reference Counting, um bestimmte Instanzen, die nicht mehr verwendet werden, freizugeben, anstatt einen Garbage Collector einzusetzen oder eine rein manuelle Verwaltung zu erfordern. Jede Instanz der Klasse :ref:`class_RefCounted` (oder jeder Klasse, die sie erbt, wie z.B. :ref:`class_Resource`) wird automatisch freigegeben, wenn sie nicht mehr verwendet wird. Eine Instanz einer Klasse, die keine :ref:`class_RefCounted` ist (wie :ref:`class_Node` oder der Basistyp :ref:`class_Object`), bleibt im Speicher, bis sie mit ``free()`` (oder ``queue_free()`` für Nodes) gelöscht wird.

source: If a :ref:`class_Node` is deleted via ``free()`` or ``queue_free()``, all of its children will also recursively be deleted.
de: Wenn ein :ref:`class_Node` mittels ``free()`` oder ``queue_free()`` gelöscht wird, werden auch alle seine Unter-Nodes rekursiv gelöscht.

source: To avoid reference cycles that can't be freed, a :ref:`class_WeakRef` function is provided for creating weak references, which allow access to the object without preventing a :ref:`class_RefCounted` from freeing. Here is an example:
de: Um Referenzzyklen zu vermeiden, die nicht freigegeben werden können, wird eine :ref:`class_WeakRef`-Funktion zur Verfügung gestellt, um schwache Referenzen zu erzeugen, die den Zugriff auf das Objekt erlauben, ohne ein :ref:`class_RefCounted` am Freigeben zu hindern. Hier ist ein Beispiel:

source: Alternatively, when not using references, the ``is_instance_valid(instance)`` can be used to check if an object has been freed.
de: Wenn keine Referenzen verwendet werden, kann alternativ mit ``is_instance_valid(instance)`` überprüft werden, ob ein Objekt freigegeben wurde.

source: Signals
de: Signale

source: Signals are a tool to emit messages from an object that other objects can react to. To create custom signals for a class, use the ``signal`` keyword.
de: Signale sind ein Werkzeug zum Senden von Nachrichten von einem Objekt, auf die andere Objekte reagieren können. Verwenden Sie das Schlüsselwort ``signal``, um benutzerdefinierte Signale für eine Klasse zu erstellen.

source: Signals are a `Callback <https://en.wikipedia.org/wiki/Callback_(computer_programming)>`_ mechanism. They also fill the role of Observers, a common programming pattern. For more information, read the `Observer tutorial <https://gameprogrammingpatterns.com/observer.html>`_ in the Game Programming Patterns ebook.
de: Signale sind ein `Callback <https://de.wikipedia.org/wiki/R%C3%BCckruffunktion>` _-Mechanismus. Sie übernehmen auch die Rolle von Observern, einem gängigen Programmier-Pattern. Weitere Informationen finden Sie im `Observer-Tutorial (in englischer Sprache)<https://gameprogrammingpatterns.com/observer.html>` _ im E-Book Game Programming Patterns.

source: You can connect these signals to methods the same way you connect built-in signals of nodes like :ref:`class_Button` or :ref:`class_RigidBody3D`.
de: Sie können diese Signale mit Methoden auf die gleiche Weise verbinden, wie Sie Built-in-Signale von Nodes wie :ref:`class_Button` oder :ref:`class_RigidBody3D` verbinden.

source: In the example below, we connect the ``health_depleted`` signal from a ``Character`` node to a ``Game`` node. When the ``Character`` node emits the signal, the game node's ``_on_character_health_depleted`` is called::
de: Im Beispiel unten verbinden wir das Signal ``health_depleted`` von einem ``Character``-Node mit einem ``Game``-Node. Wenn der ``Charakter``-Node das Signal aussendet, wird der ``_on_character_health_depleted``-Node des Spiels aufgerufen::

source: You can emit as many arguments as you want along with a signal.
de: Sie können so viele Argumente wie Sie möchten zusammen mit einem Signal aussenden.

source: Here is an example where this is useful. Let's say we want a life bar on screen to react to health changes with an animation, but we want to keep the user interface separate from the player in our scene tree.
de: Hier ist ein Beispiel, wo dies nützlich ist. Angenommen, wir möchten, dass eine Lebensleiste auf dem Bildschirm mit einer Animation auf Gesundheitsänderungen reagiert, aber wir möchten in unserem Szenenbaum die Benutzeroberfläche vom Spieler getrennt halten.

source: In our ``character.gd`` script, we define a ``health_changed`` signal and emit it with :ref:`Signal.emit() <class_Signal_method_emit>`, and from a ``Game`` node higher up our scene tree, we connect it to the ``Lifebar`` using the :ref:`Signal.connect() <class_Signal_method_connect>` method::
de: In unserem Skript ``Charakter.gd`` definieren wir ein ``Health_changed``-Signal und senden es mit :ref:`Signal.emit() <class_Signal_method_emit>` aus, und von einem ``Game``-Node weiter oben in unserem Szenenbaum verbinden wir es mit der ``Lifebar`` mit der Methode :ref:`Signal.connect() <class_Signal_method_connect>`::

source: In the ``Game`` node, we get both the ``Character`` and ``Lifebar`` nodes, then connect the character, that emits the signal, to the receiver, the ``Lifebar`` node in this case.
de: Im ``Game``-Node erhalten wir sowohl den ``Character`` als auch den ``Lifebar``-Node und verbinden dann den Charakter, der das Signal aussendet, mit dem Empfänger, in diesem Fall dem ``Lifebar``-Node .

source: This allows the ``Lifebar`` to react to health changes without coupling it to the ``Character`` node.
de: Dies ermöglicht es der ``Lifebar``, auf Gesundheitsänderungen zu reagieren, ohne sie mit dem ``Character``-Node zu koppeln.

source: You can write optional argument names in parentheses after the signal's definition::
de: Sie können optionale Argumentnamen in Klammern nach der Definition des Signals schreiben::

source: These arguments show up in the editor's node dock, and Godot can use them to generate callback functions for you. However, you can still emit any number of arguments when you emit signals; it's up to you to emit the correct values.
de: Diese Argumente werden im Node-Dock des Editors angezeigt und Godot kann sie verwenden, um Callback-Funktionen für Sie zu generieren. Sie können jedoch immer noch eine beliebige Anzahl von Argumenten angeben, wenn Sie Signale ausgeben. Es liegt an Ihnen, die richtigen Werte auszugeben.

source: GDScript can bind an array of values to connections between a signal and a method. When the signal is emitted, the callback method receives the bound values. These bound arguments are unique to each connection, and the values will stay the same.
de: GDScript kann ein Array von Werten an Verbindungen zwischen einem Signal und einer Methode binden. Wenn das Signal ausgegeben wird, empfängt die Callback-Methode die gebundenen Werte. Diese gebundenen Argumente sind für jede Verbindung einzigartig aber die Werte bleiben gleich.

source: You can use this array of values to add extra constant information to the connection if the emitted signal itself doesn't give you access to all the data that you need.
de: Mit diesem Wertearray können Sie der Verbindung zusätzliche konstante Informationen hinzufügen, wenn Ihnen das ausgegebene Signal selbst keinen Zugriff auf alle benötigten Daten bietet.

source: Building on the example above, let's say we want to display a log of the damage taken by each character on the screen, like ``Player1 took 22 damage.``. The ``health_changed`` signal doesn't give us the name of the character that took damage. So when we connect the signal to the in-game console, we can add the character's name in the binds array argument::
de: Aufbauend auf dem obigen Beispiel möchten wir ein Protokoll des von jedem Charakter erlittenen Schadens auf dem Bildschirm anzeigen, z.B. ``Spieler1 hat 22 Schaden erlitten``. Das ``health_changed``-Signal gibt uns nicht den Namen des Charakters, der Schaden genommen hat. Wenn wir also das Signal mit der In-Game-Konsole verbinden, können wir den Namen des Charakters in das Binds-Array-Argument einfügen::

source: Our ``BattleLog`` node receives each element in the binds array as an extra argument::
de: Unser ``BattleLog`` -Node empfängt jedes Element im Binds-Array als zusätzliches Argument::

source: Awaiting for signals or coroutines
de: Warten auf Signale oder Coroutinen

source: The ``await`` keyword can be used to create `coroutines <https://en.wikipedia.org/wiki/Coroutine>`_ which wait until a signal is emitted before continuing execution. Using the ``await`` keyword with a signal or a call to a function that is also a coroutine will immediately return the control to the caller. When the signal is emitted (or the called coroutine finishes), it will resume execution from the point on where it stopped.
de: Das Schlüsselwort ``await`` kann verwendet werden, um `Coroutinen <https://en.wikipedia.org/wiki/Coroutine>`_ zu erzeugen, die warten, bis ein Signal ausgegeben wird, bevor sie die Ausführung fortsetzen. Die Verwendung des Schlüsselwortes ``await`` mit einem Signal oder einem Aufruf einer Funktion, die auch eine Coroutine ist, gibt die Kontrolle sofort an den Aufrufer zurück. Wenn das Signal ausgegeben wird (oder die aufgerufene Coroutine beendet wird), wird die Ausführung an dem Punkt fortgesetzt, an dem sie angehalten wurde.

source: For example, to stop execution until the user presses a button, you can do something like this::
de: Um zum Beispiel die Ausführung zu stoppen, bis der Benutzer eine Taste drückt, können Sie wie folgt vorgehen::

source: In this case, the ``wait_confirmation`` becomes a coroutine, which means that the caller also needs to await for it::
de: In diesem Fall wird die ``wait_confirmation`` zu einer Coroutine, was bedeutet, daß der Aufrufer auch darauf warten muß::

source: Note that requesting a coroutine's return value without ``await`` will trigger an error::
de: Beachten Sie, dass die Abfrage des Rückgabewerts einer Coroutine ohne ``await`` einen Fehler auslöst::

source: However, if you don't depend on the result, you can just call it asynchronously, which won't stop execution and won't make the current function a coroutine::
de: Wenn Sie jedoch nicht auf das Ergebnis angewiesen sind, können Sie die Funktion einfach asynchron aufrufen, wodurch die Ausführung nicht unterbrochen wird und die aktuelle Funktion nicht zu einer Coroutine wird::

source: If you use await with an expression that isn't a signal nor a coroutine, the value will be returned immediately and the function won't give the control back to the caller::
de: Wenn Sie await mit einem Ausdruck verwenden, der weder ein Signal noch eine Coroutine ist, wird der Wert sofort zurückgegeben und die Funktion gibt die Kontrolle nicht an den Aufrufer zurück::

source: This also means that returning a signal from a function that isn't a coroutine will make the caller await on that signal::
de: Das bedeutet auch, dass die Rückgabe eines Signals von einer Funktion, die keine Coroutine ist, den Aufrufer auf dieses Signal warten lässt::

source: Unlike ``yield`` in previous Godot versions, you cannot obtain the function state object. This is done to ensure type safety. With this type safety in place, a function cannot say that it returns an ``int`` while it actually returns a function state object during runtime.
de: Im Gegensatz zu ``yield`` in früheren Godot-Versionen können Sie das Funktionsstatusobjekt nicht erhalten. Dies geschieht, um Typsicherheit zu gewährleisten. Mit dieser Typsicherheit kann eine Funktion nicht sagen, dass sie einen ``int`` zurückgibt, während sie in Wirklichkeit zur Laufzeit ein Funktionsstatusobjekt zurückgibt.

source: Assert keyword
de: Assert-Schlüsselwort

source: The ``assert`` keyword can be used to check conditions in debug builds. These assertions are ignored in non-debug builds. This means that the expression passed as argument won't be evaluated in a project exported in release mode. Due to this, assertions must **not** contain expressions that have side effects. Otherwise, the behavior of the script would vary depending on whether the project is run in a debug build.
de: Das ``assert``-Schlüsselwort kann verwendet werden, um Bedingungen im Debug-Builds zu überprüfen. Diese Assertions werden in Nicht-Debug-Builds ignoriert. Dies bedeutet, dass der als Argument übergebene Ausdruck in einem Projekt, das im Release-Modus exportiert wird, nicht ausgewertet wird. Aus diesem Grund dürfen Assertions **keine** Ausdrücke enthalten, die Seiteneffekte haben. Andernfalls hängt das Verhalten des Skripts davon ab, ob das Projekt in einem Debug-Build ausgeführt wird.

source: When running a project from the editor, the project will be paused if an assertion error occurs.
de: Wenn Sie ein Projekt über den Editor ausführen, wird das Projekt angehalten, wenn ein Assertion-Fehler auftritt.

source: You can optionally pass a custom error message to be shown if the assertion fails::
de: Sie können optional eine benutzerdefinierte Fehlermeldung übergeben, die angezeigt wird, wenn die Assertion fehlschlägt::

source: Translation status
de: Übersetzungsstatus
