Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_styleguide.po
Languages: de, zh_cn

source: GDScript style guide
zh_cn: GDScript 编写风格指南

source: This style guide lists conventions to write elegant GDScript. The goal is to encourage writing clean, readable code and promote consistency across projects, discussions, and tutorials. Hopefully, this will also support the development of auto-formatting tools.
de: Dieser Style Guide listet Konventionen auf, um elegantes GDScript zu schreiben. Er soll zu sauberem, lesbarem Code ermutigen und Konsistenz in Projekten, Diskussionen und Tutorials fördern. Dies wird hoffentlich auch zur Entwicklung automatisierter Formatierungs-Tools beitragen.
zh_cn: 本编写风格指南列出了几条规定，能够让用户将 GDScript 代码编写得更加优雅。本指南旨在让用户编写更为整洁、可读的代码，促进项目、讨论和教程之间的一致性。本教程也希望能够因此鼓励开发者们能够开发出来代码自动格式化工具。

source: Since GDScript is close to Python, this guide is inspired by Python's `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ programming style guide.
de: Da GDScript viele Gemeinsamkeiten mit Python aufweist, sind die Empfehlungen an Pythons`PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ Style Guide angelehnt.
zh_cn: 由于 GDScript 与 Python 非常接近，因此本指南的灵感来自 Python 的 `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ 编程风格指南。

source: Style guides aren't meant as hard rulebooks. At times, you may not be able to apply some of the guidelines below. When that happens, use your best judgment, and ask fellow developers for insights.
de: Style Guides sind nicht als dogmatisch einzuhaltende Regelwerke zu verstehen. Einige der folgenden Richtlinien sind möglicherweise nicht stets anwendbar. In diesem Fall sollte nach bestem Wissen und Gewissen gehandelt und ggf. Erfahrungswerte bei anderen Entwicklern eingeholt werden.
zh_cn: 风格指南并不是硬性的规则教条，有些情况下，你可能无法施行下面的一些规范。如果这种情况发生在你身上，最好自行进行选择，并询问其他开发人员的见解。

source: In general, keeping your code consistent in your projects and within your team is more important than following this guide to a tee.
de: Im Allgemeinen ist es wichtiger, Ihren Code in Ihren Projekten und in Ihrem Team konsistent zu halten, als dieser Anleitung blind zu folgen.
zh_cn: 一般来说，在项目和团队中保持代码风格的一致性，比一板一眼地遵循本指南更为重要。

source: Godot's built-in script editor uses a lot of these conventions by default. Let it help you.
de: Godot's integrierter Skripteditor verwendet standardmäßig einige dieser Konventionen.
zh_cn: Godot的内置脚本编辑器默认使用了很多这些规范，那么就让这内置脚本编辑器来帮助你吧。

source: Here is a complete class example based on these guidelines:
de: Hier ist ein vollständiges Klassenbeispiel basierend auf diesen Richtlinien:
zh_cn: 下面是基于这些规范的完整的类的示例：

source: Formatting
de: Formatierung
zh_cn: 格式

source: Encoding and special characters
de: Encoding und Sonderzeichen
zh_cn: 编码与特殊字符

source: Use line feed (**LF**) characters to break lines, not CRLF or CR. *(editor default)*
de: Verwenden Sie Line Feed (**LF**) für Zeilenumbrüche, nicht CRLF oder CR. *(Default im Editor)*
zh_cn: 使用换行符（\ **LF**\ ）换行，而非 CRLF 或 CR。\ *（编辑器默认）*

source: Use one line feed character at the end of each file. *(editor default)*
de: Verwenden Sie ein Line Feed am Ende jeder Datei. *(Default im Editor)*
zh_cn: 在每个文件的末尾使用一个换行符。\ *（编辑器默认）*

source: Use **UTF-8** encoding without a `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(editor default)*
de: Verwenden Sie die **UTF-8**-Encoding ohne ein `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(Default im Editor)*
zh_cn: 使用不带\ `字节顺序标记 <https://zh.wikipedia.org/zh-cn/%E4%BD%8D%E5%85%83%E7%B5%84%E9%A0%86%E5%BA%8F%E8%A8%98%E8%99%9F>`_\ 的 **UTF-8** 编码。\ *（编辑器默认）*

source: Use **Tabs** instead of spaces for indentation. *(editor default)*
de: Verwenden Sie **Tabs** anstelle von Leerzeichen für Einrückungen. *(Default im Editor)*
zh_cn: 使用\ **制表符**\ 代替空格进行缩进。\ *（编辑器默认）*

source: Indentation
de: Einrückung
zh_cn: 缩进

source: Each indent level should be one greater than the block containing it.
de: Jede Einrückungsebene sollte um eins größer sein als die des umgebenden Blocks.
zh_cn: 每个缩进的缩进级别必须大于包含该缩进的代码块的缩进级别。

source: **Good**:
de: **Gut**:
zh_cn: **规范示例** :

source: **Bad**:
de: **Schlecht**:
zh_cn: **不规范示例** :

source: Use 2 indent levels to distinguish continuation lines from regular code blocks.
de: Verwenden Sie 2 Einrückungsebenen, um Fortsetzungszeilen von normalen Codeblöcken zu unterscheiden.
zh_cn: 使用2个缩进级别来区分续行代码块与常规代码块。

source: Exceptions to this rule are arrays, dictionaries, and enums. Use a single indentation level to distinguish continuation lines:
de: Ausnahmen von dieser Regel sind Arrays, Dictionarys und Enums. Verwenden Sie eine einzelne Einrückungsstufe, um fortgesetzte Zeilen zu unterscheiden:
zh_cn: 此规则的例外：数组、字典和枚举。使用单个缩进级别来区分续行代码块：

source: Trailing comma
de: Nachgestelltes Komma
zh_cn: 行尾逗号

source: Use a trailing comma on the last line in arrays, dictionaries, and enums. This results in easier refactoring and better diffs in version control as the last line doesn't need to be modified when adding new elements.
de: Verwenden Sie in Arrays, Dictionarys und Enums in der letzten Zeile ein nachfolgendes Komma. Dies erleichtert das Refactoring und verbessert Diffs in der Versionsverwaltung, da die letzte Zeile beim Hinzufügen neuer Elemente nicht geändert werden muss.
zh_cn: 请在数组、字典和枚举的最后一行使用逗号，这样，在添加新元素时就不需要修改最后一行了，既能让版本控制中的重构更容易，也会让 Diff 也更美观。

source: Trailing commas are unnecessary in single-line lists, so don't add them in this case.
de: Nachgestellte Kommas sind in einzeiligen Listen nicht erforderlich. Fügen Sie sie in diesem Fall also nicht hinzu.
zh_cn: 单行列表中不需要行尾逗号，故在此情况下不要添加逗号。

source: Blank lines
de: Leerzeilen
zh_cn: 空白行

source: Surround functions and class definitions with two blank lines:
de: Umgeben Sie Funktionen und Klassendefinitionen mit zwei Leerzeilen:
zh_cn: 用两个空行来包围函数和类定义：

source: Use one blank line inside functions to separate logical sections.
de: Verwenden Sie innerhalb von Funktionen eine Leerzeile, um logische Abschnitte zu trennen.
zh_cn: 函数内部使用一个空行来分隔每个逻辑片段。

source: We use a single line between classes and function definitions in the class reference and in short code snippets in this documentation.
de: Wir verwenden eine einzelne Zeile zwischen Klassen- und Funktionsdefinitionen in der Klassenreferenz und in kurzen Codeschnipseln in dieser Dokumentation.
zh_cn: 在类参考和本文档的短代码片段中，我们会在类和函数定义之间使用单个空行。

source: Line length
de: Zeilenlänge
zh_cn: 行的长度

source: Keep individual lines of code under 100 characters.
de: Halten Sie einzelne Codezeilen unter 100 Zeichen.
zh_cn: 把每行代码控制在100个字符以内。

source: If you can, try to keep lines under 80 characters. This helps to read the code on small displays and with two scripts opened side-by-side in an external text editor. For example, when looking at a differential revision.
de: Wenn Sie können, versuchen Sie, Zeilen unter 80 Zeichen zu halten. Dies hilft beim Lesen des Codes auf kleinen Displays und mit zwei nebeneinander geöffneten Skripten in einem externen Texteditor. Zum Beispiel bei der Betrachtung einer Datei in einer Differenzansicht.
zh_cn: 如果可以的话，尽量把行控制在80个字符以下，既有助于在小屏幕上阅读代码，也有利于在外部文本编辑器中并排打开两个脚本。例如，在查看差异修订时。

source: One statement per line
de: Eine Anweisung pro Zeile
zh_cn: 一条语句一行

source: Never combine multiple statements on a single line. No, C programmers, not even with a single line conditional statement.
de: Kombinieren Sie niemals mehrere Anweisungen in einer einzigen Zeile. Nein, C-Programmierer, nicht einmal mit einer einzeiligen bedingten Anweisung.
zh_cn: 不要在同一行上合并多个语句。不要像 C 语言那样使用单行条件语句。

source: The only exception to that rule is the ternary operator:
de: Die einzige Ausnahme dieser Regel ist der tenäre Operator:
zh_cn: 该规则的唯一例外便是三元运算符：

source: Format multiline statements for readability
de: Formatieren Sie mehrzeilige Anweisungen zur besseren Lesbarkeit
zh_cn: 对多行语句进行排版以提高可读性

source: When you have particularly long ``if`` statements or nested ternary expressions, wrapping them over multiple lines improves readability. Since continuation lines are still part of the same expression, 2 indent levels should be used instead of one.
de: Wenn Sie besonders lange ``if``-Anweisungen oder verschachtelte ternäre Ausdrücke haben, verbessert es die Lesbarkeit, wenn Sie diese über mehrere Zeilen umbrechen. Da Fortsetzungszeilen immer noch Teil desselben Ausdrucks sind, sollten 2 Einrückungsebenen statt einer verwendet werden.
zh_cn: 如果你的 ``if`` 语句特别长，亦或如果一条语句是嵌套的三元表达式，把它们拆分成多行可以提高可读性。由于这几行连续的代码仍属于同一个表达式，故应该缩进两级而非一级。

source: GDScript allows wrapping statements using multiple lines using parentheses or backslashes. Parentheses are favored in this style guide since they make for easier refactoring. With backslashes, you have to ensure that the last line never contains a backslash at the end. With parentheses, you don't have to worry about the last line having a backslash at the end.
de: GDScript erlaubt den Umbruch von Anweisungen über mehrere Zeilen mit Hilfe von Klammern oder Backslashes. Klammern werden in diesem Styleguide bevorzugt, da sie eine einfachere Umstrukturierung ermöglichen. Bei Backslashes müssen Sie sicherstellen, dass die letzte Zeile niemals einen Backslash am Ende enthält. Mit Klammern müssen Sie sich keine Sorgen machen, dass die letzte Zeile am Ende einen Backslash hat.
zh_cn: GDScript 允许使用括号或反斜杠将语句拆成多行，本指南倾向于使用括号，重构起来更简单。使用反斜杠的话，必须保证最后一行的末尾没有反斜杠；而如果是括号，则不必担心最后一行的反斜杠问题。

source: When wrapping a conditional expression over multiple lines, the ``and``/``or`` keywords should be placed at the beginning of the line continuation, not at the end of the previous line.
de: Wenn ein bedingter Ausdruck über mehrere Zeilen umgebrochen wird, sollten die Schlüsselwörter ``and``/``or`` am Anfang der Zeilenfortsetzung stehen, nicht am Ende der vorherigen Zeile.
zh_cn: 把条件表达式拆分成多行时，\ ``and`` 和 ``or`` 关键字应当放在下一行的开头，而非上一行的结尾。

source: Avoid unnecessary parentheses
de: Vermeiden Sie unnötige Klammern
zh_cn: 避免冗余的圆括号

source: Avoid parentheses in expressions and conditional statements. Unless necessary for order of operations or wrapping over multiple lines, they only reduce readability.
de: Vermeiden Sie Klammern in Ausdrücken und bedingten Anweisungen. Sofern sie nicht für die Reihenfolge der Operationen oder den Umbruch über mehrere Zeilen erforderlich sind, verringern sie nur die Lesbarkeit.
zh_cn: 避免在表达式和条件语句中使用括号，除非需要修改操作顺序或者将语句拆分多行编写，否则只会降低可读性。

source: Boolean operators
de: Boolesche Operatoren
zh_cn: 布尔运算

source: Prefer the plain English versions of boolean operators, as they are the most accessible:
de: Benutze wenn möglich die englische Version der Booleschen Operatoren, da diese verständlicher sind:
zh_cn: 推荐使用英文布尔运算符，简单易懂：

source: Use ``and`` instead of ``&&``.
de: Verwenden Sie ``and`` anstelle von ``&&``.
zh_cn: 用 ``and`` 代替 ``&&``\ 。

source: Use ``or`` instead of ``||``.
de: Verwenden Sie ``or`` anstelle von ``||``.
zh_cn: 用 ``or`` 代替 ``||``\ 。

source: Use ``not`` instead of ``!``.
de: Verwenden Sie ``not`` anstelle von ``!``.
zh_cn: 用 ``not`` 代替 ``!``\ 。

source: You may also use parentheses around boolean operators to clear any ambiguity. This can make long expressions easier to read.
de: Sie können auch boolesche Operatoren in Klammern setzen, um Mehrdeutigkeiten zu vermeiden. Dies kann lange Ausdrücke leichter lesbar machen.
zh_cn: 也可以在布尔运算符周围使用括号来消除歧义，这样还可以使长表达式更有可读性。

source: Comment spacing
de: Leerzeichen bei Kommentaren
zh_cn: 注释间距

source: Regular comments (``#``) and documentation comments (``##``) should start with a space, but not code that you comment out. Additionally, code region comments (``#region``/``#endregion``) must follow that precise syntax, so they should not start with a space.
de: Reguläre Kommentare (``#``) und Dokumentationskommentare (``##``) sollten mit einem Leerzeichen beginnen, aber nicht der Code, den Sie auskommentieren. Außerdem müssen Code-Region-Kommentare (``#region``/``#endregion``) genau dieser Syntax folgen, sie sollten also nicht mit einem Leerzeichen beginnen.
zh_cn: 普通注释（ ``#`` ）与文档注释（ ``##`` ）均应与注释正文保持一个空格的距离，而被注释掉的代码开头则不需要空格间隙。需要注意：代码区域注释（ ``#region`` / ``#endregion`` ）为保持其作用需要，不可以在井号后使用空格。

source: Using a space for regular and documentation comments helps differentiate text comments from disabled code.
de: Die Verwendung eines Leerzeichens für reguläre und Dokumentationskommentare hilft, Textkommentare von deaktiviertem Code zu unterscheiden.
zh_cn: 普通注释开头应该留一个空格，但如果是为了停用代码而将其注释掉则不需要留，以此区分文本注释和停用的代码。

source: Whitespace
de: Leerzeichen
zh_cn: 空格

source: Always use one space around operators and after commas. Also, avoid extra spaces in dictionary references and function calls.
de: Verwenden Sie immer ein Leerzeichen um Operatoren herum und nach Kommas. Vermeiden Sie außerdem zusätzliche Leerzeichen in Dictionary-Referenzen und Funktionsaufrufen.
zh_cn: 时刻记得在运算符前后和逗号后使用一个空格。同时，请避免在字典引用和函数调用中使用多余的空格。

source: Don't use spaces to align expressions vertically:
de: Verwenden Sie keine Leerzeichen, um Ausdrücke vertikal auszurichten:
zh_cn: 不要用空格去垂直对齐表达式：

source: Quotes
de: Anführungszeichen
zh_cn: 引号

source: Use double quotes unless single quotes make it possible to escape fewer characters in a given string. See the examples below:
de: Verwenden Sie doppelte Anführungszeichen, es sei denn, einfache Anführungszeichen machen es möglich, Escaping von Zeichen in einem gegebenen String zu vermeiden. Siehe die Beispiele unten:
zh_cn: 尽量使用双引号，除非单引号可以让字符串中需要转义的字符变少。见如下示例：

source: Numbers
de: Zahlen
zh_cn: 数字

source: Don't omit the leading or trailing zero in floating-point numbers. Otherwise, this makes them less readable and harder to distinguish from integers at a glance.
de: Lassen Sie die führende oder nachgestellte Null in Float-Zahlen nicht weg. Andernfalls sind sie schwerer lesbar und auf einen Blick schwerer von Integer-Zahlen zu unterscheiden.
zh_cn: 不要忽略浮点数中的前导和后缀零，否则会降低这些数字的可读性，很难一眼与整数区分开。

source: Use lowercase for letters in hexadecimal numbers, as their lower height makes the number easier to read.
de: Verwenden Sie Kleinschreibung für Buchstaben in hexadezimalen Zahlen, da ihre geringere Höhe die Lesbarkeit der Zahl erleichtert.
zh_cn: 对于十六进制数字，请使用小写字母。小写字母较矮，使数字更易读。

source: Take advantage of GDScript's underscores in literals to make large numbers more readable.
de: Nutzen Sie in GDScript Unterstriche in Literalen, damit große Zahlen lesbarer werden.
zh_cn: 利用 GDScript 的文字下划线，让大数字更易读。

source: Naming conventions
de: Namenskonventionen
zh_cn: 命名规定

source: These naming conventions follow the Godot Engine style. Breaking these will make your code clash with the built-in naming conventions, leading to inconsistent code.
de: Diese Namenskonventionen folgen dem Godot Engine-Stil. Bei Nichtbeachtung würde Ihr Code mit den Built-in-Namenskonventionen kollidieren, was zu inkonsistentem Code führt.
zh_cn: 这些命名规定遵循 Godot 引擎风格，不遵循这些规定都会使你的代码与内置的命名规定相冲突，导致风格不一致的代码.

source: File names
de: Dateinamen
zh_cn: 文件命名

source: Use snake_case for file names. For named classes, convert the PascalCase class name to snake_case::
de: Verwenden Sie snake_case für Dateinamen. Für benannte Klassen konvertieren Sie den PascalCase-Klassennamen in snake_case::
zh_cn: 文件名用 snake_case （蛇形）命名法，对于具名类，将其名字从帕斯卡命名（大驼峰命名，PascalCase）转化为 snake_case 命名： ::

source: This is consistent with how C++ files are named in Godot's source code. This also avoids case sensitivity issues that can crop up when exporting a project from Windows to other platforms.
de: Dies ist konsistent mit der Benennung von C++-Dateien im Godot Quellcode. Dadurch werden auch Probleme mit der Groß- und Kleinschreibung vermieden, die beim Exportieren eines Projekts von Windows auf andere Plattformen auftreten können.
zh_cn: 这种命名与 Godot 源码中的 C++ 文件命名保持一致，也避免了由 Windows 导出到其他大小写敏感平台时所发生的问题。

source: Classes and nodes
de: Klassen und Nodes
zh_cn: 类与节点

source: Use PascalCase for class and node names:
de: Verwenden Sie PascalCase für Klassen- und Node-Namen:
zh_cn: 对类和节点名称使用帕斯卡命名法（大驼峰命名法，PascalCase）:

source: Also use PascalCase when loading a class into a constant or a variable:
de: Verwenden Sie auch PascalCase, wenn Sie eine Klasse in eine Konstante oder Variable laden:
zh_cn: 将类加载到常量或变量时也同样适用：

source: Functions and variables
de: Funktionen und Variablen
zh_cn: 函数与变量

source: Use snake\_case to name functions and variables:
de: Verwenden Sie snake\_case, um Funktionen und Variablen zu benennen:
zh_cn: 函数与变量使用 snake\_case 命名：

source: Prepend a single underscore (\_) to virtual methods functions the user must override, private functions, and private variables:
de: Stellen Sie einen einzelnen Unterstrich (\ _) vor virtueller Methoden, Funktionen, die der Benutzer überschreiben muss, privaten Funktionen und privaten Variablen:
zh_cn: 在用户必须覆盖的虚方法、私有函数、私有变量的名称前加一个下划线（\_）：

source: Signals
de: Signale
zh_cn: 信号

source: Use the past tense to name signals:
de: Verwenden Sie die Vergangenheitsform, um Signale zu benennen:
zh_cn: 用过去时态（英文）来命名信号：

source: Constants and enums
de: Konstanten und Enums
zh_cn: 常量与枚举

source: Write constants with CONSTANT\_CASE, that is to say in all caps with an underscore (\_) to separate words:
de: Schreiben Sie Konstanten mit CONSTANT\_CASE, d.h. in Großbuchstaben mit einem Unterstrich (\_) zur Trennung der Wörter:
zh_cn: 使用 CONSTANT\_CASE，全部大写，并用下划线（\_）来分隔单词：

source: Use PascalCase for enum *names* and CONSTANT\_CASE for their members, as they are constants:
de: Verwenden Sie PascalCase für Enum-*Namen* und CONSTANT\_CASE für deren Member, da sie Konstanten sind:
zh_cn: 对枚举的\ *名称*\ 使用 PascalCase，对其成员使用 CONSTANT\_CASE， 因为这些成员是常量：

source: Code order
de: Code-Reihenfolge
zh_cn: 代码顺序

source: This first section focuses on code order. For formatting, see :ref:`formatting`. For naming conventions, see :ref:`naming_conventions`.
de: Dieser erste Abschnitt geht auf die Reihenfolge der Befehle im Code ein. Für Formatierung, siehe :ref:`formatting`. Für Namenskonventionen, siehe :ref:`naming_conventions`.
zh_cn: 第一节主要讨论代码顺序。有关代码格式，请参见 :ref:`formatting`。有关命名规定，请参见 :ref:`naming_conventions`。

source: We suggest to organize GDScript code this way:
de: Wir empfehlen, GDScript-Code auf folgende Art zu organisieren:
zh_cn: 我们建议按以下方式来组织 GDScript 代码：

source: We optimized the order to make it easy to read the code from top to bottom, to help developers reading the code for the first time understand how it works, and to avoid errors linked to the order of variable declarations.
de: Wir haben die Reihenfolge optimiert, um das Lesen des Codes von oben nach unten zu vereinfachen, Entwicklern das erste Lesen des Codes zu erleichtern und Fehler im Zusammenhang mit der Reihenfolge der Variablendeklarationen zu vermeiden.
zh_cn: 我们优化了代码顺序，从上往下阅读代码更加容易，帮助第一次阅读代码的开发人员了解代码的工作原理，同时避免与变量声明顺序相关的错误。

source: This code order follows four rules of thumb:
de: Diese Code-Reihenfolge folgt vier Faustregeln:
zh_cn: 此代码顺序遵循四个经验法则：

source: Properties and signals come first, followed by methods.
de: Propertys und Signale stehen an erster Stelle, gefolgt von Methoden.
zh_cn: 先写信号和属性，然后再写方法。

source: Public comes before private.
de: Public kommt vor Private.
zh_cn: 先写公共成员，然后再写私有成员。

source: Virtual callbacks come before the class's interface.
de: Virtuelle Callbacks kommen vor dem Interface der Klasse.
zh_cn: 先写虚函数回调，然后再写类的接口。

source: The object's construction and initialization functions, ``_init`` and ``_ready``, come before functions that modify the object at runtime.
de: Die Konstruktions- und Initialisierungsfunktionen des Objekts, ``_init`` und ``_ready``, stehen vor Funktionen, die das Objekt zur Laufzeit ändern.
zh_cn: 先写对象的构造函数和初始化函数 ``_init`` 和 ``_ready`` ，然后再写修改对象的函数。

source: Class declaration
de: Klassendeklaration
zh_cn: 类声明

source: If the code is meant to run in the editor, place the ``@tool`` annotation on the first line of the script.
de: Wenn der Code im Editor laufen soll, setzen Sie die Annotation ``@tool`` in die erste Zeile des Skripts.
zh_cn: 如果代码要在编辑器中运行，请将 ``@tool`` 注解写在脚本的第一行。

source: Follow with the ``class_name`` if necessary. You can turn a GDScript file into a global type in your project using this feature. For more information, see :ref:`doc_gdscript`.
de: Fügen Sie bei Bedarf ``class_name`` hinzu. Mit diesem Feature können Sie eine GDScript-Datei zu einem globalen Typ in Ihrem Projekt machen. Für weitere Informationen, siehe :ref:`doc_gdscript`.
zh_cn: 如有必要，在后面加上 ``class_name``。你可以使用该特性将 GDScript 文件转换为项目中的全局类型。有关更多信息，请参阅 :ref:`doc_gdscript`。

source: Then, add the ``extends`` keyword if the class extends a built-in type.
de: Dann fügen Sie das Schlüsselwort ``extends`` hinzu, wenn die Klasse einen Built-in-Typ erweitert.
zh_cn: 然后，如果该类扩展了内置类型，请添加 ``extends`` 关键字。

source: Following that, you should have the class's optional :ref:`documentation comments <doc_gdscript_documentation_comments>`. You can use that to explain the role of your class to your teammates, how it works, and how other developers should use it, for example.
de: Danach sollten Sie die optionalen :ref:`Dokumentationskommentare <doc_gdscript_documentation_comments>` für die Klasse einfügen. Damit können Sie zum Beispiel Ihren Teamkollegen die Rolle Ihrer Klasse erklären, wie sie funktioniert und wie andere Entwickler sie verwenden sollten.
zh_cn: 接下来，你应该有该类的可选 :ref:`文档注释 <doc_gdscript_documentation_comments>`。例如，你可以用它来向你的队友解释你的类的作用、它是如何工作的、以及其他开发人员应该如何使用它。

source: Signals and properties
de: Signale und Propertys
zh_cn: 信号和属性

source: Write signal declarations, followed by properties, that is to say, member variables, after the docstring.
de: Schreiben Sie Signaldeklarationen, gefolgt von Propertys, das heißt, Membervariablen nach dem Docstring.
zh_cn: 先声明信号，然后声明属性（即成员变量），这些都写在文档注释（docstring）之后。

source: Enums should come after signals, as you can use them as export hints for other properties.
de: Enums sollten nach Signalen kommen, da Sie sie als Exporthinweise für andere Propertys verwenden können.
zh_cn: 在信号之后声明枚举，枚举可以用作其他属性的导出提示。

source: Then, write constants, exported variables, public, private, and onready variables, in that order.
de: Schreiben Sie dann Konstanten, exportierte Variablen, öffentliche, private und onready-Variablen in dieser Reihenfolge.
zh_cn: 然后，按该顺序依次写入常量、导出变量、公共变量、私有变量和就绪加载（onready）变量。

source: The GDScript compiler evaluates onready variables right before the ``_ready`` callback. You can use that to cache node dependencies, that is to say, to get child nodes in the scene that your class relies on. This is what the example above shows.
de: Der GDScript-Compiler wertet onready-Variablen unmittelbar vor dem ``_ready``-Callback aus. Sie können dies verwenden, um Node-Abhängigkeiten zwischenzuspeichern, das heißt um untergeordnete Nodes in der Szene abzurufen, auf die sich Ihre Klasse bezieht. Dies zeigt das obige Beispiel.
zh_cn: GDScript编译器在 ``_ready`` 函数回调之前计算就绪加载（onready）变量，因此可以使用该虚函数来缓存节点依赖项，在你的类所依赖的场景中获取子节点。这便是上面的例子所展示的内容。

source: Member variables
de: Membervariablen
zh_cn: 成员变量

source: Don't declare member variables if they are only used locally in a method, as it makes the code more difficult to follow. Instead, declare them as local variables in the method's body.
de: Deklarieren Sie keine Membervariablen, wenn sie nur lokal in einer Methode verwendet werden, da dies das Lesen des Codes erschwert. Deklarieren Sie sie stattdessen als lokale Variablen in der Methode.
zh_cn: 如果变量只在方法中使用，请勿将该变量声明为成员变量，因为难以定位在何处使用了该变量。相反，你应该将这些变量在方法内部定义为局部变量。

source: Local variables
de: Lokale Variablen
zh_cn: 局部变量

source: Declare local variables as close as possible to their first use. This makes it easier to follow the code, without having to scroll too much to find where the variable was declared.
de: Deklarieren Sie lokale Variablen so nah wie möglich am Ort ihrer ersten Verwendung. Dies erleichtert das Lesen des Codes, ohne zu viel scrollen zu müssen, um herauszufinden, wo die Variable deklariert wurde.
zh_cn: 局部变量的声明位置离首次使用该局部变量的位置越近越好，让人更容易跟上代码的思路，而不需要上翻下找该变量的声明位置。

source: Methods and static functions
de: Methoden und statische Funktionen
zh_cn: 方法和静态函数
