Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_format_string.po
Languages: de

source: GDScript offers a feature called *format strings*, which allows reusing text templates to succinctly create different but similar strings.
de: GDScript bietet ein Funktion namens *Format-Strings*, die es ermöglicht, Textvorlagen wieder zu verwenden, um schnell unterschiedliche, aber ähnliche Strings zu erzeugen.

source: Format strings are just like normal strings, except they contain certain placeholder character-sequences. These placeholders can then easily be replaced by parameters handed to the format string.
de: Format-Strings sind wie normale Strings, mit der Ausnahme, dass sie bestimmte Platzhalter für Zeichensequenzen enthalten. Diese Platzhalter können einfach durch Parameter im Format-String ersetzt werden.

source: As an example, with ``%s`` as a placeholder, the format string ``"Hello %s, how are you?"`` can easily be changed to ``"Hello World, how are you?"``. Notice the placeholder is in the middle of the string; modifying it without format strings could be cumbersome.
de: Mit ``%s`` als Platzhalter kann zum Beispiel der Format-String ``"Hallo %s, wie geht es dir?"`` leicht in ``"Hallo Welt, wie geht es dir?"`` geändert werden. Beachten Sie, dass der Platzhalter in der Mitte des Strings steht; ohne Format-Strings wäre es umständlich, ihn zu ändern.

source: Usage in GDScript
de: Verwendung in GDScript

source: Examine this concrete GDScript example:
de: Versuchen Sie, das folgende GDScript-Beispiel zu verstehen:

source: Placeholders always start with a ``%``, but the next character or characters, the *format specifier*, determines how the given value is converted to a string.
de: Platzhalter starten immer mit einem ``%``, aber das nächste oder die nächsten Zeichen, der *Formatkennzeichner*, legt fest, wie der gegebene Wert zu einem String konvertiert wird.

source: The ``%s`` seen in the example above is the simplest placeholder and works for most use cases: it converts the value by the same method by which an implicit String conversion or ``str()`` would convert it. Strings remain unchanged, Booleans turn into either ``"True"`` or ``"False"``, an integral or real number becomes a decimal, other types usually return their data in a human-readable string.
de: Das ``%s`` im Beispiel oben ist der einfachste Platzhalter und funktioniert in den meisten Fällen: er konvertiert den Wert mit der gleichen Methode, von der eine implizierte String-Konvertierung oder ``str()`` es konvertieren würde. Strings bleiben unverändert. Booleans schalten entweder in ``"True"`` oder ``"False"``, eine ganze oder reelle Zahl wird eine Dezimalzahl, andere Typen geben meist ihre Daten in einem lesbaren String zurück.

source: There is also another way to format text in GDScript, namely the ``String.format()`` method. It replaces all occurrences of a key in the string with the corresponding value. The method can handle arrays or dictionaries for the key/value pairs.
de: Es gibt auch einen anderen Weg, um Text in GDScript zu formatieren, nämlich die ``String.format()``-Methode. Sie ersetzt alle Keys im String mit dem entsprechenden Wert. Die Methode kommt mit Arrays oder Dictionarys für die Key/Value-Paare klar.

source: Arrays can be used as key, index, or mixed style (see below examples). Order only matters when the index or mixed style of Array is used.
de: Arrays können als Key, Index oder in gemischtem Stil (siehe Beispiele unten) vorkommen. Die Reihenfolge ist nur wichtig, wenn der Index oder der gemischte Stil des Arrays benutzt wird.

source: A quick example in GDScript:
de: Ein kurzes Beispiel in GDScript:

source: There are other `format specifiers`_, but they are only applicable when using the ``%`` operator.
de: Es gibt auch andere `Formatbezeichner`_, aber diese sind nur anwendbar beim Benutzen des ``%``-Operators.

source: Multiple placeholders
de: Mehrere Platzhalter

source: Format strings may contain multiple placeholders. In such a case, the values are handed in the form of an array, one value per placeholder (unless using a format specifier with ``*``, see `dynamic padding`_):
de: Format-Strings können mehrere Platzhalter enthalten. In diesem Fall werden die Werte in der Form eines Arrays gehandhabt, ein Wert pro Platzhalter (außer es wird ein Formatbezeichner mit ``*`` genutzt, siehe `dynamisches Padding`_):

source: Note the values are inserted in order. Remember all placeholders must be replaced at once, so there must be an appropriate number of values.
de: Beachten Sie, dass die Werte der Reihe nach eingefügt werden. Denken Sie daran, dass alle Platzhalter auf einmal ersetzt werden müssen, es muss also eine angemessene Anzahl von Werten vorhanden sein.

source: Format specifiers
de: Formatbezeichner

source: There are format specifiers other than ``s`` that can be used in placeholders. They consist of one or more characters. Some of them work by themselves like ``s``, some appear before other characters, some only work with certain values or characters.
de: Es gibt weitere Formatbezeichner außer ``s``, die in Platzhaltern genutzt werden können. Diese bestehen aus einem oder mehreren Zeichen. Manche funktionieren für sich alleine, wie ``s``, manche stehen vor anderen Zeichen, wieder andere funktionieren in Verbindung mit bestimmten Werten oder Zeichen.

source: Placeholder types
de: Platzhalter-Typen

source: One and only one of these must always appear as the last character in a format specifier. Apart from ``s``, these require certain types of parameters.
de: Einer – und nur einer – dieser Platzhalter-Typen muss immer als letztes Zeichen in einem Formatbezeichner auftreten. Abgesehen von ``s`` werden bestimmte Parametertypen benötigt.

source: **Simple** conversion to String by the same method as implicit String conversion.
de: **Einfache** Konvertierung von einem String mit der selben Methode, die bei der impliziten String-Konvertierung verwendet wird.

source: A single **Unicode character**. Expects an unsigned 8-bit integer (0-255) for a code point or a single-character string.
de: Ein einzelnes **Unicode-Zeichen**. Erwartet ein unsigned 8-bit Integer (0-255) für einen Codepunkt oder einen String, der aus einem einzelnen Zeichen besteht.

source: A **decimal integral** number. Expects an integral or real number (will be floored).
de: Eine **dezimale ganze Zahl**. Erwartet eine ganze oder reelle Zahl (wird abgerundet).

source: An **octal integral** number. Expects an integral or real number (will be floored).
de: Eine **oktale ganze Zahl**. Erwartet eine ganze oder reelle Zahl (wird abgerundet).

source: A **hexadecimal integral** number with **lower-case** letters. Expects an integral or real number (will be floored).
de: Eine **hexadezimale ganze Zahl** mit **Kleinbuchstaben**. Erwartet eine ganze oder reelle Zahl (wird abgerundet).

source: A **hexadecimal integral** number with **upper-case** letters. Expects an integral or real number (will be floored).
de: Eine **hexadezimale ganz Zahl** mit **Großbuchstaben**. Erwartet eine ganze oder reelle Zahl (wird abgerundet).

source: A **decimal real** number. Expects an integral or real number.
de: Eine **reelle Dezimalzahl**. Erwartet eine ganze oder reelle Zahl.

source: A **vector**. Expects any float or int-based vector object ( ``Vector2``, ``Vector3``, ``Vector4``, ``Vector2i``, ``Vector3i`` or ``Vector4i``). Will display the vector coordinates in parentheses, formatting each coordinate as if it was an ``%f``, and using the same modifiers.
de: Ein **Vektor**. Erwartet ein beliebiges float- oder int-basiertes Vektorobjekt ( ``Vector2``, ``Vector3``, ``Vector4``, ``Vector2i``, ``Vector3i`` oder ``Vector4i``). Zeigt die Vektorkoordinaten in Klammern an, wobei jede Koordinate so formatiert wird, als ob sie ein ``%f`` wäre, und die gleichen Modifikatoren verwendet werden.

source: Placeholder modifiers
de: Platzhalter-Modifikatoren

source: These characters appear before the above. Some of them work only under certain conditions.
de: Diese Zeichen erscheinen vor den oben angegebenen. Einige davon funktionieren nur unter bestimmten Bedingungen.

source: In number specifiers, **show + sign** if positive.
de: Gibt bei Zahlen-Bezeichnern das ** "+"-Vorzeichen mit an**, falls die Zahl positiv ist.

source: Set **padding**. Padded with spaces or with zeroes if integer starts with ``0`` in an integer or real number placeholder. The leading ``0`` is ignored if ``-`` is present. When used after ``.``, see ``.``.
de: **Padding** einstellen. Füllt bei einem Platzhalter für ganze oder reelle Zahlen den String mit Leerzeichen oder Nullen auf, wenn die ganze Zahl mit ``0`` beginnt. Die führende ``0`` wird ignoriert, wenn ``-`` vorhanden ist. Für die Verwendung nach ``.`` siehe ``.``.

source: Before ``f`` or ``v``, set **precision** to 0 decimal places. Can be followed up with numbers to change. Padded with zeroes.
de: Vor ``f`` oder ``v``, wird die **Präzision** auf 0 Dezimalstellen gesetzt. Zum Ändern können Zahlen angegeben werden. Wird aufgefüllt mit Nullen.

source: **Pad to the right** rather than the left.
de: **Rechts-Padding** statt Links-Padding.

source: **Dynamic padding**, expect additional integral parameter to set padding or precision after ``.``, see `dynamic padding`_.
de: **Dynamisches Padding**, erwartet einen zusätzlichen ganzzahligen Parameter. Um das Padding oder die Genauigkeit nach ``.`` festzulegen, siehe `dynamisches Padding`_.

source: The ``.`` (*dot*), ``*`` (*asterisk*), ``-`` (*minus sign*) and digit (``0``-``9``) characters are used for padding. This allows printing several values aligned vertically as if in a column, provided a fixed-width font is used.
de: Die Zeichen ``.`` (*Punkt*), ``*`` (*Stern*), ``-`` (*Minuszeichen*) und Ziffer (``0``-``9``) werden zum Padding verwendet. Auf diese Weise können mehrere Werte vertikal angeordnet werden, als wären sie in einer Spalte, sofern eine Schriftart mit fester Breite verwendet wird.

source: To pad a string to a minimum length, add an integer to the specifier:
de: Um einen String auf eine Minimallänge zu padden, fügen Sie eine Ganzzahl zum Bezeichner hinzu:

source: If the integer starts with ``0``, integral values are padded with zeroes instead of white space:
de: Falls die Ganzzahl mit ``0`` beginnt, werden die Ganzzahlwerte mit Nullen aufgefüllt anstatt mit Leerzeichen:

source: Precision can be specified for real numbers by adding a ``.`` (*dot*) with an integer following it. With no integer after ``.``, a precision of 0 is used, rounding to integral value. The integer to use for padding must appear before the dot.
de: Die Genauigkeit für reelle Zahlen kann durch das Hinzufügen von ``.`` (*Punkt*) und einer darauffolgenden Ganzzahl festgelegt werden. Ohne Ganzzahl nach ``.`` wird eine Genauigkeit von 0 genutzt, wobei auf einen ganzzahligen Wert gerundet wird. Die Anzahl der Füllzeichen muss vor dem Punkt angegeben werden.

source: The ``-`` character will cause padding to the right rather than the left, useful for right text alignment:
de: Das Zeichen ``-`` führt zu einem Rechts-Padding statt einem Links-Padding, was nützlich ist für rechts ausgerichteten Text:

source: Dynamic padding
de: Dynamisches Padding

source: By using the ``*`` (*asterisk*) character, the padding or precision can be set without modifying the format string. It is used in place of an integer in the format specifier. The values for padding and precision are then passed when formatting:
de: Mit dem Zeichen ``*`` (*Stern*) kann der Abstand oder die Genauigkeit festgelegt werden, ohne den Formatstring zu ändern. Es wird anstelle einer Ganzzahl im Formatbezeichner verwendet. Die Werte für Padding und Genauigkeit werden dann beim Formatieren übergeben:

source: It is still possible to pad with zeroes in integer placeholders by adding ``0`` before ``*``:
de: Es ist weiterhin möglich, Ganzzahl-Platzhalter mit Nullen aufzufüllen, indem ``0`` vor ``*`` eingefügt wird:

source: Escape sequence
de: Escape-Sequenz

source: To insert a literal ``%`` character into a format string, it must be escaped to avoid reading it as a placeholder. This is done by doubling the character:
de: Um ein Zeichen ``%`` selbst in einen Format-String einzubauen, muss dieses „escaped“ werden, damit es nicht als Platzhalter aufgefasst wird. Dies schafft man durch das Verdoppeln des Zeichens:

source: Format method examples
de: Beispiele für Formatierungsmethoden

source: The following are some examples of how to use the various invocations of the ``String.format`` method.
de: Im Folgenden finden Sie einige Beispiele für die verschiedenen Aufrufarten der ``String.format``-Methode.

source: **Type**
de: **Typ**

source: **Style**
de: **Stil**

source: **Example**
de: **Beispiel**

source: **Result**
de: **Ergebnis**

source: ``"Hi, {name} v{version}!".format({"name":"Godette", "version":"3.0"})``
de: ``"Hallo, {name} v{version}!".format({"name":"Godette", "version":"3.0"})``

source: Hi, Godette v3.0!
de: Hallo, Godette v3.0!

source: ``"Hi, {0} v{1}!".format({"0":"Godette", "1":"3.0"})``
de: ``"Hallo, {0} v{1}!".format({"0":"Godette", "1":"3.0"})``

source: mix
de: gemischt

source: ``"Hi, {0} v{version}!".format({"0":"Godette", "version":"3.0"})``
de: ``"Hallo, {0} v{version}!".format({"0":"Godette", "version":"3.0"})``

source: ``"Hi, {name} v{version}!".format([["version","3.0"], ["name","Godette"]])``
de: ``"Hallo, {name} v{version}!".format([["version":"3.0"], ["name":"Godette"]])``

source: ``"Hi, {0} v{1}!".format(["Godette","3.0"])``
de: ``"Hallo, {0} v{1}!".format(["Godette","3.0"])``

source: ``"Hi, {name} v{0}!".format([3.0, ["name","Godette"]])``
de: ``"Hallo, {name} v{0}!".format([3.0, ["name":"Godette"]])``

source: no index
de: kein Index

source: ``"Hi, {} v{}!".format(["Godette", 3.0], "{}")``
de: ``"Hallo, {} v{}".format(["Godette", "3.0"], "{}")``

source: Placeholders can also be customized when using ``String.format``, here's some examples of that functionality.
de: Platzhalter können auch bei Verwendung von ``String.format`` angepasst werden, hier einige Beispiele zu dieser Funktionalität.

source: ``"Hi, {0} v{1}".format(["Godette", "3.0"], "{_}")``
de: ``"Hallo, {0} v{1}".format(["Godette", "3.0"], "{_}")``

source: Hi, Godette v3.0
de: Hallo, Godette v3.0

source: ``"Hi, 0% v1%".format(["Godette", "3.0"], "_%")``
de: ``"Hallo, 0% v1%".format(["Godette", "3.0"], "_%")``

source: Prefix
de: Präfix

source: ``"Hi, %0 v%1".format(["Godette", "3.0"], "%_")``
de: ``"Hallo, %0 v%1".format(["Godette", "3.0"], "%_")``

source: Combining both the ``String.format`` method and the ``%`` operator could be useful, as ``String.format`` does not have a way to manipulate the representation of numbers.
de: Es kann sinnvoll sein, die ``String.format``-Methode mit dem ``%``-Operator zu kombinieren, da mit ``String.format`` keine Möglichkeit besteht, die Repräsentation von Zahlen zu beeinflussen.

source: ``"Hi, {0} v{version}".format({0:"Godette", "version":"%0.2f" % 3.114})``
de: ``"Hallo, {0} v{version}".format({0:"Godette", "version":"%0.2f" % 3.114})``

source: Hi, Godette v3.11
de: Hallo, Godette v3.11

source: Translation status
de: Übersetzungsstatus
