Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: de, zh_cn

source: Safe lines do not always mean better or more reliable code. See the note above about the ``as`` keyword. For example::
de: Sichere Zeilen bedeuten nicht immer besseren oder zuverlässigeren Code. Siehe die obige Anmerkung über das Schlüsselwort ``as``. Zum Beispiel::
zh_cn: 安全行也并不总表示该行代码更加优秀可靠，参见前文所述的 ``as`` 关键字。比如：::

source: Even though ``node_2`` declaration is marked as an unsafe line, it is more reliable than ``node_1`` declaration. Because if you change the node type in the scene and accidentally forget to change it in the script, the error will be detected immediately when the scene is loaded. Unlike ``node_1``, which will be silently cast to ``null`` and the error will be detected later.
de: Auch wenn die ``node_2``-Deklaration als unsichere Zeile markiert ist, ist sie zuverlässiger als die ``Node_1``-Deklaration. Denn wenn Sie den Node-Typ in der Szene ändern und versehentlich vergessen, ihn im Skript zu ändern, wird der Fehler sofort entdeckt, wenn die Szene geladen wird. Im Gegensatz zu ``node_1``, das stillschweigend zu ``null`` gecastet wird und der Fehler erst später entdeckt wird.
zh_cn: 虽然 ``node_2`` 的声明被标记为了不安全行，但比起 ``node_1`` 的声明来看却更加可靠，这是因为如果你不小心在场景中更改了节点的类型，又忘记把它改回去的话，就会在场景加载时触发报错。 ``node_1`` 的情况则是会被静默转型成 ``null`` ，触发报错。

source: You can turn off safe lines or change their color in the editor settings.
de: Sie können sichere Zeilen deaktivieren oder ihre Farbe in den Editoreinstellungen ändern.
zh_cn: 可以在编辑器设置中关闭安全行或更改其颜色。

source: Typed or dynamic: stick to one style
de: Typisiert oder dynamisch: Halten Sie sich an einen Stil
zh_cn: 静态编程还是动态编程：坚持一种风格

source: Typed GDScript and dynamic GDScript can coexist in the same project. But it's recommended to stick to either style for consistency in your codebase, and for your peers. It's easier for everyone to work together if you follow the same guidelines, and faster to read and understand other people's code.
de: Typisiertes GDScript und dynamisches GDScript können im selben Projekt koexistieren. Aus Gründen der Konsistenz in Ihrer Codebasis und für Ihre Kollegen ist es jedoch empfehlenswert, durchgängug einen der beiden Stile zu verwenden. Es ist für alle einfacher, zusammenzuarbeiten, wenn Sie dieselben Richtlinien befolgen, und macht es einfacher und schneller, den Code anderer Leute zu lesen und zu verstehen.
zh_cn: 静态类型的 GDScript 和动态类型的 GDScript 可共存于同一项目，但还是建议二选其一，以确保每个人代码风格的一致性。如果你们遵循相同的规范，那么每个人就都可以更轻松地协作，阅读、理解他人的代码也就会更加迅速。

source: Typed code takes a little more writing, but you get the benefits we discussed above. Here's an example of the same, empty script, in a dynamic style::
de: Typisierter Code erfordert ein wenig mehr Schreibarbeit, aber Sie erhalten die oben beschriebenen Vorteile. Hier ist ein Beispiel für dasselbe leere Skript in dynamischem Stil::
zh_cn: 虽然静态类型的代码需要敲更多的字，但你将获得前文所述的种种好处。下面是内容一样的空脚本示例，首先是使用动态类型的脚本：

source: And with static typing::
de: Und mit statischer Typisierung::
zh_cn: 其次是使用静态类型的脚本示例：

source: As you can see, you can also use types with the engine's virtual methods. Signal callbacks, like any methods, can also use types. Here's a ``body_entered`` signal in a dynamic style::
de: Wie Sie sehen können, können Sie auch Typen mit den virtuellen Methoden der Engine verwenden. Signal-Callbacks können, wie alle Methoden, auch Typen verwenden. Hier ist ein ``body_entered``-Signal in dynamischem Stil::
zh_cn: 如你所见，你也可以对引擎虚函数的参数进行类型声明。和方法一样，信号的回调参数也可以指定类型，下面是一个动态类型的 ``body_entered`` 信号示例：

source: And the same callback, with type hints::
de: Und dasselbe Callback mit Type-Hints::
zh_cn: 以及具有类型提示的相同回调：

source: Warning system
de: Warnsystem
zh_cn: 警告系统

source: Detailed documentation about the GDScript warning system has been moved to :ref:`doc_gdscript_warning_system`.
de: Die ausführliche Dokumentation über das GDScript-Warnsystem wurde nach :ref:`doc_gdscript_warning_system` verschoben.
zh_cn: 关于 GDScript 警告系统的文档已移至 :ref:`doc_gdscript_warning_system`。

source: From version 3.1, Godot gives you warnings about your code as you write it: the engine identifies sections of your code that may lead to issues at runtime, but lets you decide whether or not you want to leave the code as it is.
de: Ab Version 3.1 gibt Godot bereits während des Schreibens Warnungen zu Ihrem Code aus: Die Engine identifiziert Abschnitte Ihres Codes, die zur Laufzeit zu Problemen führen könnten, lässt Ihnen aber die Entscheidung, ob Sie den Code so belassen wollen, wie er ist oder nicht.
zh_cn: 静态类型的 GDScript 的另一个显著优点便是 **警告系统** 。从Godot 3.1 开始，Godot 会在你编写代码时向你发出有关代码的警告，引擎会识别代码中可能导致运行时出现问题的部分，你可以决定是否要保留该部分代码。

source: We have a number of warnings aimed specifically at users of typed GDScript. By default, these warnings are disabled, you can enable them in Project Settings (**Debug > GDScript**, make sure **Advanced Settings** is enabled).
de: Es gibt eine Reihe von Warnungen, die sich speziell an Benutzer von typisiertem GDScript richten. Standardmäßig sind diese Warnungen deaktiviert, Sie können sie in den Projekteinstellungen aktivieren (**Debug > GDScript**, stellen Sie sicher, dass **Erweiterte Einstellungen** aktiviert ist).
zh_cn: 对于静态类型 GDScript 编程的用户，我们提供了大量警告，这些警告默认关闭，但你可以将这些警告在项目设置（**调试 > GDScript**）中开启，在此之前，请确保你已启用了项目设置的**高级设置**模式。

source: You can enable the ``UNTYPED_DECLARATION`` warning if you want to always use static types. Additionally, you can enable the ``INFERRED_DECLARATION`` warning if you prefer a more readable and reliable, but more verbose syntax.
de: Sie können die Warnung ``UNTYPED_DECLARATION`` aktivieren, wenn Sie immer statische Typen verwenden wollen. Zusätzlich können Sie die Warnung ``INFERRED_DECLARATION`` aktivieren, wenn Sie eine lesbarere und zuverlässigere, aber ausführlichere Syntax bevorzugen.
zh_cn: 若始终进行静态类型编程，你可以启用 ``UNTYPED_DECLARATION`` 警告。此外，你还可以启用 ``INFERRED_DECLARATION`` 警告来让你的代码可读性更强、更有可靠性，但同时也会让你的代码更加冗长。

source: ``UNSAFE_*`` warnings make unsafe operations more noticeable, than unsafe lines. Currently, ``UNSAFE_*`` warnings do not cover all cases that unsafe lines cover.
de: ``UNSAFE_*``-Warnungen machen unsichere Operationen deutlicher als unsichere Zeilen. Derzeit decken ``UNSAFE_*``-Warnungen nicht alle Fälle ab, die von unsicheren Zeilen abgedeckt werden.
zh_cn: ``UNSAFE_*`` 警告会让不安全操作比不安全行更容易引人注意。目前, ``UNSAFE_*`` 警告并不能涵盖不安行所涵盖的所有情况。

source: Cases where you can't specify types
de: Fälle, in denen Sie keine Typen spezifizieren können

source: To wrap up this introduction, let's mention cases where you can't use type hints. This will trigger a **syntax error**.
de: Zum Abschluss dieser Einführung wollen wir noch die Fälle erwähnen, in denen Sie keine Type-Hints verwenden können. Dies führt zu einem **Syntaxfehler**.
zh_cn: 最后，我们将介绍一些不能使用类型提示的情况。以下所有示例 **都会触发报错** 。

source: You can't specify the type of individual elements in an array or a dictionary::
de: Sie können den Typ der einzelnen Elemente in einem Array oder einem Dictionary nicht angeben::
zh_cn: 无法指定数组中单个成员的类型，这样会触发报错：::

source: Nested types are not currently supported::
de: Verschachtelte Typen werden derzeit nicht unterstützt::
zh_cn: 目前不支持数组类型嵌套： ::

source: Typed dictionaries are not currently supported::
de: Typisierte Dictionarys werden derzeit nicht unterstützt::
zh_cn: 目前不支持为字典元素设置类型： ::

source: Summary
de: Zusammenfassung
zh_cn: 总结

source: Typed GDScript is a powerful tool. It helps you write more structured code, avoid common errors, and create scalable and reliable systems. Static types improve GDScript performance and more optimizations are planned for the future.
de: Typisiertes GDScript ist ein leistungsstarkes Werkzeug. Es hilft Ihnen, strukturierteren Code zu schreiben, häufige Fehler zu vermeiden und skalierbare und zuverlässige Systeme zu erstellen. Statische Typen verbessern die Leistung von GDScript, und weitere Optimierungen sind für die Zukunft geplant.
zh_cn: 静态类型的 GDScript 是一个十分强大的工具，可以帮助编写更多结构化的代码，避免常见错误，创建灵活的代码系统。将来，由于即将进行的编译器优化，静态类型也将会带来不错的性能提升。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
