Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: de, zh_cn

source: Static typing in GDScript
de: Statische Typisierung in GDScript
zh_cn: GDScript 静态类型编程

source: In this guide, you will learn:
de: In dieser Anleitung lernen Sie:
zh_cn: 在本指南中，你将学会：

source: how to use static typing in GDScript;
de: wie man die statische Typisierung in GDScript verwendet;
zh_cn: 如何在 GDScript 中使用静态类型编程;

source: that static types can help you avoid bugs;
de: dass statische Typen zur Vermeidung von Bugs beitragen können;
zh_cn: 静态类型编程可以帮助你避免问题;

source: that static typing improves your experience with the editor.
de: dass die statische Typisierung Ihren Umgang mit dem Editor verbessert.
zh_cn: 静态类型编程可以提升编辑器的使用体验。

source: Where and how you use this language feature is entirely up to you: you can use it only in some sensitive GDScript files, use it everywhere, or don't use it at all.
de: Wo und wie Sie dieses neue Sprachfeature verwenden, liegt ganz bei Ihnen: Sie können es nur in einigen kritischen GDScript-Dateien verwenden, es überall verwenden, oder es überhaupt nicht verwenden.
zh_cn: 这项语言功能的使用场合、使用方式完全取决于你：你可以只在部分敏感的 GDScript 文件中使用，也可以在所有地方都使用，甚至可以完全不使用。

source: Static types can be used on variables, constants, functions, parameters, and return types.
de: Statische Typen können für Variablen, Konstanten, Funktionen, Parameter und Rückgabetypen verwendet werden.
zh_cn: 静态类型编程可用于变量、常量、函数、参数和返回类型。

source: A brief look at static typing
de: Ein kurzer Überblick über statische Typisierung
zh_cn: 静态类型编程简介

source: With static typing, GDScript can detect more errors without even running the code. Also type hints give you and your teammates more information as you're working, as the arguments' types show up when you call a method. Static typing improves editor autocompletion and :ref:`documentation <doc_gdscript_documentation_comments>` of your scripts.
de: Mit statischer Typisierung kann GDScript mehr Fehler erkennen, ohne dass der Code überhaupt ausgeführt wird. Außerdem geben Typisierungshinweise Ihnen und Ihren Teamkollegen mehr Informationen während der Arbeit, da die Typen der Argumente beim Aufruf einer Methode angezeigt werden. Die statische Typisierung verbessert die Autovervollständigung im Editor und die :ref:`Dokumentation <doc_gdscript_documentation_comments>` Ihrer Skripte.
zh_cn: 使用 GDScript 静态类型编程，Godot 在编写代码时甚至可以帮你检测到更多代码错误，在你工作时为你和你的团队提供更多信息，当你调用方法时，会显示出参数的类型。静态类型编程也能改善编辑器的自动补全体验，其中也包括 :ref:`documentation <doc_gdscript_documentation_comments>`。

source: Imagine you're programming an inventory system. You code an ``Item`` class, then an ``Inventory``. To add items to the inventory, the people who work with your code should always pass an ``Item`` to the ``Inventory.add()`` method. With types, you can enforce this::
de: Stellen Sie sich vor, Sie programmieren ein Inventarsystem. Sie programmieren eine ``Item``-Klasse, dann ein ``Inventory``. Um Gegenstände zum Inventar hinzuzufügen, sollten die Leute, die mit Ihrem Code arbeiten, immer ein ``Item`` an die Methode ``Inventory.add()`` übergeben. Mit Typen können Sie dies erzwingen::

source: Static types also give you better code completion options. Below, you can see the difference between a dynamic and a static typed completion options.
de: Statische Typen bieten auch bessere Optionen für die Code-Vervollständigung. Nachfolgend sehen Sie den Unterschied bei Code-Vervollständigung zwischen einer dynamischen und einer statischen Typisierung.
zh_cn: 静态类型编程还能为你提供更好的代码补全选项。下面，你可以看到一个名为 ``PlayerController`` 类的动态类型和静态类型补全选项之间的区别。

source: You've probably encountered a lack of autocomplete suggestions after a dot:
de: Wahrscheinlich haben Sie schon einmal festgestellt, dass nach einem Punkt keine Vorschläge für die automatische Code-Vervollständigung gemacht werden:
zh_cn: 你之前可能已经将节点存储在了变量中，打了一个句点符号，却没有代码自动补全提示：

source: Completion options for dynamic typed code.
de: Vervollständigungsoptionen für dynamisch typisierten Code.
zh_cn: 动态类型的代码补全选项。

source: This is due to dynamic code. Godot cannot know what value type you're passing to the function. If you write the type explicitly however, you will get all methods, properties, constants, etc. from the value:
de: Dies ist auf den dynamischen Code zurückzuführen. Godot kann nicht wissen, welchen Werttyp Sie an die Funktion übergeben. Wenn Sie den Typ jedoch explizit angeben, erhalten Sie alle Methoden, Propertys, Konstanten usw. von dem Wert:
zh_cn: 由于动态代码是动态的，因此 Godot 无法得知你传递给函数的值的类型。可如果你明确地声明了类型，则将从该节点类型获取所有公共方法和变量：

source: Completion options for static typed code.
de: Vervollständigungsoptionen für statisch typisierten Code.
zh_cn: 静态类型的代码补全选项。

source: If you prefer static typing, we recommend enabling the **Text Editor > Completion > Add Type Hints** editor setting. Also consider enabling `some warnings <Warning system_>`_ that are disabled by default.
de: Wenn Sie statische Typisierung bevorzugen, empfehlen wir Ihnen, die Editoreinstellung **Texteditor > Vervollständigung > Typhinweise hinzufügen** zu aktivieren. Ziehen Sie auch in Erwägung, `einige Warnungen <Warning system_>`_ zu aktivieren, die standardmäßig deaktiviert sind.
zh_cn: 若偏向静态类型编程，建议开启编辑器选项**文本编辑器 > 补全 > 添加类型提示**，顺便也可以考虑开启默认关闭的 `某些选项 <Warning system_>`_ 。

source: Also, typed GDScript improves performance by using optimized opcodes when operand/argument types are known at compile time. More GDScript optimizations are planned in the future, such as JIT/AOT compilation.
de: Außerdem verbessert typisiertes GDScript die Performance durch die Verwendung optimierter Opcodes, wenn die Typen der Operanden/Argumente zur Kompilierungszeit bekannt sind. Für die Zukunft sind weitere GDScript-Optimierungen geplant, z. B. die JIT/AOT-Kompilierung.
zh_cn: 同时，在操作数/参数类型在编译时已知时，静态类型编程编写的 GDScript 代码还能通过优化后的操作码提升代码运行性能。未来还计划进行更多 GDScript 方面的优化，如 JIT/AOT 编译。

source: Overall, typed programming gives you a more structured experience. It helps prevent errors and improves the self-documenting aspect of your scripts. This is especially helpful when you're working in a team or on a long-term project: studies have shown that developers spend most of their time reading other people's code, or scripts they wrote in the past and forgot about. The clearer and the more structured the code, the faster it is to understand, the faster you can move forward.
de: Insgesamt bietet die typisierte Programmierung ein besser strukturiertes Erlebnis. Es hilft, Fehler zu vermeiden und verbessert den selbstdokumentierenden Aspekt Ihrer Skripte. Dies ist besonders hilfreich, wenn Sie in einem Team oder an einem langfristigen Projekt arbeiten: Studien haben gezeigt, dass Entwickler die meiste Zeit damit verbringen, den Code anderer Leute oder Skripte zu lesen, die sie in der Vergangenheit geschrieben und vergessen haben. Je klarer und strukturierter der Code ist, desto schneller ist er zu verstehen, desto schneller können Sie vorankommen.
zh_cn: 总体而言，静态类型编程可为你提供更加结构化的体验，有助于避免代码错误，改善脚本的文档生成能力。当你在团队中或长期项目中工作时，静态类型编程将会特别有用。研究表明，开发人员将大部分时间要么都花在阅读别人的代码上，要么都花在阅读他们以前编写过但后来忘掉的脚本上。代码越清晰、越结构化，开发人员理解得也就越快，项目开发的速度也就越快。

source: How to use static typing
de: Wie man statische Typisierung einsetzt
zh_cn: 如何使用静态类型编程

source: To define the type of a variable, parameter, or constant, write a colon after the name, followed by its type. E.g. ``var health: int``. This forces the variable's type to always stay the same::
de: Um den Typ einer Variablen, eines Parameters oder einer Konstanten zu definieren, schreiben Sie einen Doppelpunkt nach dem Namen, gefolgt von seinem Typ. Z.B. ``var health: int``. Dadurch bleibt der Typ der Variablen immer derselbe::
zh_cn: 要定义变量、参数、常量的类型，请在名称后写一个英文冒号，再写上类型。例如 ``var health: int``\ 。这样就能够让变量的类型始终保持一致： ::

source: Godot will try to infer types if you write a colon, but you omit the type::
de: Godot versucht, die Typen zu ermitteln, wenn Sie einen Doppelpunkt schreiben, aber den Typ: weglassen::
zh_cn: 如果你写了冒号但是省略类型，Godot 就会尝试推导类型： ::

source: There is no difference between ``=`` and ``:=`` for constants.
de: Es gibt keinen Unterschied zwischen ``=`` und ``:=`` für Konstanten.
zh_cn: 对于常量而言， ``=`` 和 ``:=`` 没有区别。

source: You don't need to write type hints for constants, as Godot sets it automatically from the assigned value. But you can still do so to make the intent of your code clearer. Also, this is useful for typed arrays (like ``const A: Array[int] = [1, 2, 3]``), since untyped arrays are used by default.
de: Sie brauchen keine Type-Hints für Konstanten zu schreiben, da Godot diese automatisch anhand des zugewiesenen Wertes festlegt. Sie können dies aber trotzdem tun, um die Absicht Ihres Codes zu verdeutlichen. Außerdem ist dies für typisierte Arrays nützlich (wie ``const A: Array[int] = [1, 2, 3]``), da untypisierte Arrays standardmäßig verwendet werden.
zh_cn: 常量不需要写类型提示，Godot 会自动根据所赋的值设置该常量的类型，你仍然可以写上类型提示来让代码更整洁。同时，这样写对于类型化数组也还是很有用的（比如 ``const A: Array[int] = [1, 2, 3]``\ ），因为默认使用的是无类型的数组。

source: What can be a type hint
de: Was ein Type-Hint sein kann
zh_cn: 类型提示可以是什么

source: Here is a complete list of what can be used as a type hint:
de: Hier finden Sie eine vollständige Liste der Elemente, die als Type-Hint verwendet werden können:
zh_cn: 下面列出的是所有可以用作类型提示的东西：

source: ``Variant``. Any type. In most cases this is not much different from an untyped declaration, but increases readability. As a return type, forces the function to explicitly return some value.
de: ``Variant``. Beliebiger Typ. In den meisten Fällen ist dies nicht viel anders als eine Deklaration ohne Typisierung, erhöht aber die Lesbarkeit. Als Rückgabetyp zwingt es die Funktion, explizit einen Wert zurückzugeben.
zh_cn: ``Variant``\ ，任何类型。大多数情况下与不写类型声明差不多，但能够增加可读性。作为返回类型时，能够强制函数显式返回值。

source: *(Only return type)* ``void``. Indicates that the function does not return any value.
de: *(Nur Rückgabetyp)* ``void``. Gibt an, dass die Funktion keinen Wert zurückgibt.
zh_cn: *（仅作返回类型使用）* ``void``\ 。表示函数不返回任何值。

source: :ref:`Built-in types <doc_gdscript_builtin_types>`.
de: :ref:`Built-in-Typen <doc_gdscript_builtin_types>`.
zh_cn: :ref:`内置类型 <doc_gdscript_builtin_types>`\ 。

source: Native classes (``Object``, ``Node``, ``Area2D``, ``Camera2D``, etc.).
de: Native Klassen (``Object``, ``Node``, ``Area2D``, ``Camera2D``, etc.).
zh_cn: 原生类（\ ``Object``\ 、\ ``Node``\ 、\ ``Area2D``\ 、\ ``Camera2D`` 等）。

source: :ref:`Global classes <doc_gdscript_basics_class_name>`.
de: :ref:`Globale Klassen <doc_gdscript_basics_class_name>`.
zh_cn: :ref:`全局类 <doc_gdscript_basics_class_name>`\ 。

source: :ref:`Inner classes <doc_gdscript_basics_inner_classes>`.
de: :ref:`Innere Klassen <doc_gdscript_basics_inner_classes>`.
zh_cn: :ref:`内部类 <doc_gdscript_basics_inner_classes>`\ 。

source: Global, native and custom named enums. Note that an enum type is just an ``int``, there is no guarantee that the value belongs to the set of enum values.
de: Globale, native und benannte Enums. Beachten Sie, dass ein Enum-Typ nur ein ``int`` ist, es gibt keine Garantie, dass der Wert zur Menge der Enum-Werte gehört.
zh_cn: 全局具名常量与内部具名常量。注意：枚举是 ``int`` 类型的数据，不能保证一个值属于该枚举。

source: Constants (including local ones) if they contain a preloaded class or enum.
de: Konstanten (einschließlich lokaler Konstanten), wenn sie eine vorgeladene Klasse oder Enum enthalten.
zh_cn: 包含预加载类和枚举的常量（或局部常量）。

source: You can use any class, including your custom classes, as types. There are two ways to use them in scripts. The first method is to preload the script you want to use as a type in a constant::
de: Sie können jede Klasse, einschließlich Ihrer benutzerdefinierten Klassen, als Typen verwenden. Es gibt zwei Möglichkeiten, sie in Skripten zu verwenden. Die erste Methode besteht darin, das Skript, das Sie als Typ verwenden möchten, in einer Konstante vorzuladen::
zh_cn: 你可以将任何类（包括自定义类）用作类型。有两种在脚本中使用这些类型的方法：第一种方法是将要用作类型的脚本预加载为常量：::

source: The second method is to use the ``class_name`` keyword when you create. For the example above, your ``rifle.gd`` would look like this::
de: Die zweite Methode ist die Verwendung des Schlüsselwortes ``class_name`` beim Erstellen. Für das obige Beispiel würde Ihre ``rifle.gd`` wie folgt aussehen::
zh_cn: 而第二种方法则是在创建类时使用 ``class_name`` 关键字。对于上面的示例， ``Rifle.gd`` 看起来就像这样：::

source: If you use ``class_name``, Godot registers the ``Rifle`` type globally in the editor, and you can use it anywhere, without having to preload it into a constant::
de: Wenn Sie ``class_name`` verwenden, registriert Godot den Typ ``Rifle`` global im Editor, und Sie können ihn überall verwenden, ohne ihn in eine Konstante vorladen zu müssen::
zh_cn: 使用 ``class_name`` 时，Godot 会在编辑器中注册一个全局 ``Rifle`` 类型，可以在任何地方使用该类型，而无需将其预加载到常量当中：::

source: Specify the return type of a function with the arrow ``->``
de: Geben Sie den Rückgabetyp einer Funktion mit dem Pfeil ``->`` an

source: To define the return type of a function, write a dash and a right angle bracket ``->`` after its declaration, followed by the return type::
de: Um den Rückgabetyp einer Funktion zu definieren, schreiben Sie einen Bindestrich und eine rechteckige Klammer ``->`` nach ihrer Deklaration, gefolgt vom Rückgabetyp::
zh_cn: 要定义函数的返回类型，请在声明后写一个短划线和一个右尖括号 ``->`` ，后跟返回类型：::

source: The type ``void`` means the function does not return anything. You can use any type, as with variables::
de: Der Typ ``void`` bedeutet, dass die Funktion nichts zurückgibt. Sie können jeden Typ verwenden, wie bei Variablen::
zh_cn: 类型 ``void`` 表示函数不返回任何内容。你可以使用任何类型，如变量：::

source: You can also use your own classes as return types::
de: Sie können auch Ihre eigenen Klassen als Rückgabetypen verwenden::
zh_cn: 你还可以使用自定义类作为返回类型：::

source: Covariance and contravariance
de: Kovarianz und Kontravarianz
zh_cn: 协变与逆变

source: When inheriting base class methods, you should follow the `Liskov substitution principle <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__.
de: Bei der Vererbung von Basisklassen-Methoden sollten Sie das `Liskov-Substitutionsprinzip <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__ befolgen.
zh_cn: 继承基类方法时，应遵循 `里氏代换原则 <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__ 。

source: **Covariance:** When you inherit a method, you can specify a return type that is more specific (**subtype**) than the parent method.
de: **Kovarianz:** Wenn Sie eine Methode erben, können Sie einen Rückgabetyp angeben, der spezifischer ist (**Subtyp**) als die Parent-Methode.
zh_cn: **协变：** 继承方法时，你可以为子类方法指定一个比该子类方法的父类方法更为具体的返回值类型（比如**子类**）。

source: **Contravariance:** When you inherit a method, you can specify a parameter type that is less specific (**supertype**) than the parent method.
de: **Kontravarianz:** Wenn Sie eine Methode erben, können Sie einen Parametertyp angeben, der weniger spezifisch ist (**Supertyp**) als die Parent-Methode.
zh_cn: **逆变：** 继承方法时，你可以为子类方法指定一个比该子类方法的父类方法更不具体的返回值类型（比如**超类**）。

source: Example::
de: Beispiel::
zh_cn: 示例（以匿名 setter/getter 函数为例）::

source: Specify the element type of an ``Array``
de: Spezifizieren des Elementtyps eines ``Arrays``

source: To define the type of an ``Array``, enclose the type name in ``[]``.
de: Um den Typ eines ``Arrays`` zu definieren, schließen Sie den Typnamen in ``[]`` ein.

source: An array's type applies to ``for`` loop variables, as well as some operators like ``[]``, ``[]=``, and ``+``. Array methods (such as ``push_back``) and other operators (such as ``==``) are still untyped. Built-in types, native and custom classes, and enums may be used as element types. Nested array types are not supported.
de: Der Typ eines Arrays gilt für ``for``-Schleifenvariablen, sowie für einige Operatoren wie ``[]``, ``[]=`` und ``+``. Array-Methoden (wie ``push_back``) und andere Operatoren (wie ``==``) sind weiterhin untypisiert. Built-in-Typen, native und benutzerdefinierte Klassen und Enums können als Elementtypen verwendet werden. Verschachtelte Array-Typen werden nicht unterstützt.
zh_cn: 数组的类型适用于“for”循环变量以及一些运算符，如“[]”、“[]=”和“+”。部分数组方法（如`push_back``）和运算符（如``==``）依旧对数组类型不敏感。内置类型、引擎原生类型、自定义类型及枚举均可以用作元素类型。不支持嵌套数组类型。

source: Since Godot 4.2, you can also specify a type for the loop variable in a ``for`` loop. For instance, you can write::
de: Seit Godot 4.2 können Sie auch einen Typ für die Schleifenvariable in einer ``for``-Schleife angeben. Sie können zum Beispiel schreiben::
zh_cn: 从 Godot 4.2 开始，你可以显式指定 ``for`` 循环的循环变量类型。比如，你可以这样写：::

source: The array will remain untyped, but the ``name`` variable within the ``for`` loop will always be of ``String`` type.
de: Das Array bleibt untypisiert, aber die Variable ``name`` innerhalb der ``for``-Schleife wird immer vom Typ ``String`` sein.
zh_cn: 数组仍旧不会限定类型，但 ``for`` 循环的 ``name`` 循环变量则始终为 ``String`` 类型。

source: Type casting
de: Typ-Casting
zh_cn: 类型转换

source: Type casting is an important concept in typed languages. Casting is the conversion of a value from one type to another.
de: Typ-Casting ist ein wichtiges Konzept in typisierten Sprachen. Casting ist die Umwandlung eines Wertes von einem Typ in einen anderen.
zh_cn: 类型转换是类型语言的关键概念，转型是指将值从一种类型转换为另一种类型的操作或过程。

source: Imagine an ``Enemy`` in your game, that ``extends Area2D``. You want it to collide with the ``Player``, a ``CharacterBody2D`` with a script called ``PlayerController`` attached to it. You use the ``body_entered`` signal to detect the collision. With typed code, the body you detect is going to be a generic ``PhysicsBody2D``, and not your ``PlayerController`` on the ``_on_body_entered`` callback.
de: Stellen Sie sich einen ``Enemy`` in Ihrem Spiel vor, der per ``extend`` eine ``Area2D`` erweitert. Sie wollen, dass er mit dem ``Player`` kollidiert, einem ``CharacterBody2D`` mit einem Skript namens ``PlayerController``, das an ihm hängt. Sie benutzen das Signal ``body_entered``, um die Kollision zu erkennen. Mit typisiertem Code wird der Body, den Sie erkennen, ein generischer ``PhysicsBody2D`` sein, und nicht Ihr ``PlayerController`` beim ``_on_body_entered``-Callback.
zh_cn: 想象你的游戏中的一个敌人， ``extends Area2D`` 。你希望它与游戏角色，即一个附带有一个名为 ``PlayerController`` 的脚本的 ``CharacterBody2D``, 碰撞，那么你可以使用 ``body_entered`` 信号来检测碰撞。使用类型化代码，其检测到的物体（body）将是通用的 ``PhysicsBody2D`` 而非 ``_on_body_entered`` 回调上使用的 ``PlayerController`` 。

source: You can check if this ``PhysicsBody2D`` is your ``Player`` with the ``as`` keyword, and using the colon ``:`` again to force the variable to use this type. This forces the variable to stick to the ``PlayerController`` type::
de: Sie können überprüfen, ob dieser ``PhysicsBody2D`` Ihr ``Player`` ist, indem Sie das ``as``-Schlüsselwort benutzen, und den Doppelpunkt ``:`` erneut verwenden, um die Variable zu zwingen, diesen Typ zu benutzen. Dies zwingt die Variable, sich an den ``PlayerController``-Typ zu halten::
zh_cn: 你可以使用 ``as``转型关键字来检查这个 ``PhysicsBody2D`` 是否是你的游戏角色，并再次使用冒号 ``:`` 来强制变量使用这种类型。这样会强制变量使用 ``PlayerController`` 类型：

source: As we're dealing with a custom type, if the ``body`` doesn't extend ``PlayerController``, the ``player`` variable will be set to ``null``. We can use this to check if the body is the player or not. We will also get full autocompletion on the player variable thanks to that cast.
de: Da wir es mit einem benutzerdefinierten Typ zu tun haben, wird die Variable ``player`` auf ``null`` gesetzt, wenn der ``body`` nicht ``PlayerController`` erweitert. Wir können dies benutzen, um zu überprüfen, ob der Body der Spieler ist oder nicht. Dank dieses Casts erhalten wir auch eine vollständige Autovervollständigung für die Player-Variable.
zh_cn: 在处理自定义类型时，如果 ``body`` 没有继承 ``PlayerController`` 类，则 ``player`` 变量将被赋值为 ``null`` 。我们可以用这种操作来检查物体是否为游戏玩家角色。多亏了类型转换，我们还能获得 ``player`` 变量的代码自动补全功能。

source: The ``as`` keyword silently casts the variable to ``null`` in case of a type mismatch at runtime, without an error/warning. While this may be convenient in some cases, it can also lead to bugs. Use the ``as`` keyword only if this behavior is intended. A safer alternative is to use the ``is`` keyword::
de: Das ``as``-Schlüsselwort verwandelt die Variable im Falle einer zur Laufzeit stillschweigend in ``null``, wenn der Typ nicht übereinstimmt, ohne dass ein Fehler oder eine Warnung ausgegeben wird. Obwohl dies in einigen Fällen bequem sein kann, kann es auch zu Fehlern führen. Verwenden Sie das Schlüsselwort ``as`` nur, wenn dieses Verhalten beabsichtigt ist. Eine sicherere Alternative ist die Verwendung des ``is`` Schlüsselwortes::
zh_cn: 在变量类型在运行时中不匹配的情况下， ``as`` 关键字会将变量的值静默转型为 ``null`` ，不会触发任何警告与报错，虽然在某些情况下会比较好用，但也会带来一些问题。尽在需要强制转型的时候使用 ``as`` ，否则使用 ``is`` 来代替转型语法：::

source: or ``assert()`` statement::
de: oder ``assert()`` Anweisung::
zh_cn: 或者用 ``assert()`` 断言语法：::

source: If you try to cast with a built-in type and it fails, Godot will throw an error.
de: Wenn Sie versuchen, mit einem Built-in-Typ zu casten und dies fehlschlägt, gibt Godot einen Fehler aus.
zh_cn: 如果你尝试使用内置类型进行转型且转型失败，则将触发 Godot 脚本编辑器底部报错。

source: Safe lines
de: Sichere Zeilen
zh_cn: 安全行

source: You can also use casting to ensure safe lines. Safe lines are a tool to tell you when ambiguous lines of code are type-safe. As you can mix and match typed and dynamic code, at times, Godot doesn't have enough information to know if an instruction will trigger an error or not at runtime.
de: Sie können auch Casting verwenden, um sichere Zeilen zu gewährleisten. Sichere Zeilen sind ein Werkzeug, das Ihnen sagt, wann mehrdeutige Codezeilen typsicher sind. Da Sie typisierten und dynamischen Code vermischen können, verfügt Godot manchmal nicht über genügend Informationen, um zu wissen, ob eine Anweisung zur Laufzeit einen Fehler auslösen wird oder nicht.
zh_cn: 你也可以使用转型语法来确保存在安全行，安全行是 Godot 3.1 中加入的新工具，可以告诉你一行歧义代码在什么情况下类型安全。由于你有时会混合使用静态类型代码和动态类型代码，有时如果指令在运行时触发错误，Godot 可能没有足够的信息进行判断。

source: This happens when you get a child node. Let's take a timer for example: with dynamic code, you can get the node with ``$Timer``. GDScript supports `duck-typing <https://stackoverflow.com/a/4205163/8125343>`__, so even if your timer is of type ``Timer``, it is also a ``Node`` and an ``Object``, two classes it extends. With dynamic GDScript, you also don't care about the node's type as long as it has the methods you need to call.
de: Dies geschieht, wenn Sie einen Child-Node erhalten. Nehmen wir zum Beispiel einen Timer: mit dynamischem Code können Sie den Node mit ``$Timer`` erhalten. GDScript unterstützt `duck-typing <https://stackoverflow.com/a/4205163/8125343>`__, d.h. selbst wenn Ihr Timer vom Typ ``Timer`` ist, ist er auch ein ``Node`` und ein ``Object``, zwei Klassen, die er erweitert. Mit dynamischem GDScript ist der Typ des Nodes auch egal, solange er die Methoden hat, die Sie aufrufen müssen.
zh_cn: 当你需要获得子节点时就会发生这种情况。以计时器为例：使用动态代码，你可以使用 ``$Timer`` 获取节点。GDScript 支持\ `鸭子类型 <https://stackoverflow.com/a/4205163/8125343>`__\ ，即使你的计时器是 ``Timer`` 类型，计时器也继承了 ``Node`` 和 ``Object`` 这两个类。使用动态类型的 GDScript，只要节点具有你需要调用的方法，你也不必关心节点的类型。

source: You can use casting to tell Godot the type you expect when you get a node: ``($Timer as Timer)``, ``($Player as CharacterBody2D)``, etc. Godot will ensure the type works and if so, the line number will turn green at the left of the script editor.
de: Sie können das Casting verwenden, um Godot mitzuteilen, welchen Typ Sie erwarten, wenn Sie einen Node erhalten: ``($Timer as Timer)``, ``($Player as CharacterBody2D)``, usw. Godot überprüft, ob der Typ funktioniert, und wenn ja, wird die Zeilennummer links im Skript-Editor grün angezeigt.
zh_cn: 当你得到一个节点时，可以使用强制转型来告诉 Godot 你所期望的类型： ``($Timer as Timer)`` 、 ``($Player as KinematicBody2D)`` 等，Godot 将确认该类型是否有效，如果有效，在脚本编辑器的左侧的行号将会变为绿色。

source: Unsafe vs Safe Line
de: Unsichere vs. sichere Zeile
zh_cn: 不安全行 vs 安全行

source: Unsafe line (line 7) vs Safe Lines (line 6 and 8)
de: Unsichere Zeile (Zeile 7) vs. sichere Zeilen (Zeilen 6 und 8)
zh_cn: 不安全代码行（第 7 行）vs 安全代码行（第 6 行和第 8 行）
