Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/debug/custom_performance_monitors.po
Languages: de, zh_tw

source: Custom performance monitors
de: Eigene Performance-Monitore
zh_tw: 屬性目標中的效能提示

source: Introduction
de: Einführung
zh_tw: 前言

source: As explained in the :ref:`doc_debugger_panel` documentation, Godot features a **Debugger > Monitors** bottom panel that allows tracking various values with graphs showing their evolution over time. The data for those graphs is sourced from the engine's :ref:`class_Performance` singleton.
de: Wie in der :ref:`doc_debugger_panel`-Dokumentation erläutert, verfügt Godot über ein unteres Panel **Debugger > Monitore**, das die Verfolgung verschiedener Werte mit Graphen ermöglicht, die ihre Entwicklung über die Zeit zeigen. Die Daten für diese Diagramme werden aus dem Singleton :ref:`class_Performance` der Engine bezogen.

source: Since Godot 4.0, you can declare custom values to be displayed in the Monitors tab. Example use cases for custom performance monitors include:
de: Seit Godot 4.0 können Sie benutzerdefinierte Werte deklarieren, die auf dem Monitore-Tab angezeigt werden. Anwendungsbeispiele für benutzerdefinierte Performance-Monitore sind:

source: Displaying performance metrics that are specific to your project. For instance, in a voxel game, you could create a performance monitor to track the number of chunks that are loaded every second.
de: Anzeige von Performance-Metriken, die für Ihr Projekt spezifisch sind. In einem Voxel-Spiel könnten Sie zum Beispiel einen Performance-Monitor erstellen, um die Anzahl der pro Sekunde geladenen Chunks zu verfolgen.
zh_tw: 顯示特定於您的專案的績效指標。例如，在體素遊戲中，您可以建立一個效能監視器來追蹤每秒載入的區塊數。

source: Displaying in-game metrics that are not strictly related to performance, but are still useful to graph for debugging purposes. For instance, you could track the number of enemies present in the game to make sure your spawning mechanic works as intended.
de: Anzeige von Metriken im Spiel, die nicht unbedingt mit der Performance zu tun haben, aber dennoch nützlich sind, um sie für Debugging-Zwecke darzustellen. Sie könnten zum Beispiel die Anzahl der im Spiel vorhandenen Feinde verfolgen, um sicherzustellen, dass Ihre Spawning-Mechanik wie vorgesehen funktioniert.
zh_tw: 顯示與效能不嚴格相關的遊戲內指標，但對於出於除錯目的繪製圖表仍然有用。例如，您可以追蹤遊戲中存在的敵人數量，以確保您的生成機制能如預期運作。

source: Creating a custom performance monitor
de: Erstellen eines benutzerdefinierten Performance-Monitors
zh_tw: 建立自定節點

source: In this example, we'll create a custom performance monitor to track how many enemies are present in the currently running project.
de: In diesem Beispiel erstellen wir einen benutzerdefinierten Performance-Monitor, um zu verfolgen, wie viele Feinde im laufenden Projekt vorhanden sind.
zh_tw: 在此範例中，我們將建立一個自訂效能監視器來追蹤目前正在運作的專案中存在多少敵人。

source: The main scene features a :ref:`class_Timer` node with the following script attached:
de: Die Hauptszene enthält einen :ref:`class_Timer` Node mit dem folgenden Skript:
zh_tw: 主場景有一個 class_Timer 節點，並附有以下腳本：

source: The second parameter of :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` is a :ref:`class_Callable`.
de: Der zweite Parameter von :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` ist ein :ref:`class_Callable`.

source: ``enemy.tscn`` is a scene with a Node2D root node and Timer child node. The Node2D has the following script attached:
de: Die Datei ``enemy.tscn`` ist eine Szene mit einem Node2D-Root-Node und einem Timer-Child-Node. Der Node2D hat das folgende Skript angehängt:
zh_tw: ``enemy.tscn`` 是一個具有 Node2D 根節點和 Timer 子節點的場景。 Node2D 附加了以下腳本：

source: In this example, since we spawn 20 enemies per second, and each enemy despawns 2.5 seconds after they spawn, we expect the number of enemies present in the scene to stabilize to 50. We can make sure about this by looking at the graph.
de: Da wir in diesem Beispiel 20 Feinde pro Sekunde spawnen und jeder Feind 2,5 Sekunden nach dem Spawnen despawnt, erwarten wir, dass sich die Anzahl der Feinde in der Szene auf 50 einpendelt. Wir können uns davon überzeugen, indem wir uns den Graphen ansehen.
zh_tw: 在此範例中，由於我們每秒生成 20 個敵人，並且每個敵人在生成後 2.5 秒後消失，因此我們預計場景中存在的敵人數量將穩定為 50 個。我們可以透過查看圖表來確定這一點。

source: To visualize the graph created from this custom performance monitor, run the project, switch to the editor while the project is running and open **Debugger > Monitors** at the bottom of the editor window. Scroll down to the newly available **Game** section and check **Enemies**. You should see a graph appearing as follows:
de: Um den von diesem benutzerdefinierten Performance-Monitor erstellten Graphen zu visualisieren, führen Sie das Projekt aus, wechseln Sie zum Editor, während das Projekt läuft, und öffnen Sie **Debugger > Monitore** am unteren Rand des Editorfensters. Scrollen Sie nach unten zum neu verfügbaren Abschnitt **Spiel** und markieren Sie **Enemies**. Sie sollten ein Diagramm sehen, das wie folgt aussieht:
zh_tw: 若要視覺化從此自訂效能監視器建立的圖形，請執行專案，在專案執行時切換到編輯器，然後開啟編輯器視窗底部的 **偵錯器 > 監視器**。向下捲動到新推出的**遊戲**部分並選中**敵人**。您應該會看到如下所示的圖表：

source: Example editor graph from a custom performance monitor
de: Beispiel eines Editor-Diagramms aus einem benutzerdefinierten Performance-Monitor

source: The performance monitor handling code doesn't have to live in the same script as the nodes themselves. You may choose to move the performance monitor registration and getter function to an :ref:`autoload <doc_singletons_autoload>` instead.
de: Der Code zur Handhabung des Performance-Monitors muss nicht im selben Skript wie die Nodes selbst enthalten sein. Sie können stattdessen die Performance-Monitor-Registrierung und die Getter-Funktion in einen :ref:`Autoload <doc_singletons_autoload>` verschieben.
zh_tw: 效能監視器處理程式碼不必與節點本身位於同一腳本中。您可以選擇將效能監視器註冊和 getter 函式移至 autoload <doc_singletons_autoload>`。

source: Querying a performance monitor in a project
de: Abfrage eines Performance-Monitors in einem Projekt
zh_tw: 效能偵測工具。

source: If you wish to display the value of the performance monitor in the running project's window (rather than the editor), use ``Performance.get_custom_monitor("category/name")`` to fetch the value of the custom monitor. You can display the value using a :ref:`class_Label`, :ref:`class_RichTextLabel`, :ref:`doc_custom_drawing_in_2d`, :ref:`doc_3d_text`, etc.
de: Wenn Sie den Wert des Performance-Monitors im Fenster des laufenden Projekts (und nicht im Editor) anzeigen möchten, verwenden Sie ``Performance.get_custom_monitor("category/name")``, um den Wert des benutzerdefinierten Monitors zu holen. Sie können den Wert mit :ref:`class_Label`, :ref:`class_RichTextLabel`, :ref:`doc_custom_drawing_in_2d`, :ref:`doc_3d_text`, etc. anzeigen.
zh_tw: 如果您希望在正在執行的專案的視窗（而不是編輯器）中顯示效能監視器的值，請使用 Performance.get_custom_monitor("category/name")`` 來取得自訂監視器的值。您可以使用 class_Label、class_RichTextLabel、doc_custom_drawing_in_2d、doc_3 d_text 等顯示值。

source: This method can be used in exported projects as well (debug and release mode), which allows you to create visualizations outside the editor.
de: Diese Methode kann auch in exportierten Projekten verwendet werden (Debug- und Freigabemodus), wodurch Sie Visualisierungen außerhalb des Editors erstellen können.
zh_tw: 此方法也可用於匯出的專案（偵錯和發布模式），它允許您在編輯器外部建立視覺化效果。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
