Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/debug/debugger_panel.po
Languages: de, zh_tw

source: Debugger panel
zh_tw: 除錯工具

source: Many of Godot's debugging tools, including the debugger, can be found in the debugger panel at the bottom of the screen. Click on **Debugger** to open it.
de: Viele der Debugging-Tools von Godot, einschließlich des Debuggers, finden Sie im Debugger-Panel am unteren Bildschirmrand. Klicken Sie auf **Debugger** um sie zu öffnen.
zh_tw: 在螢幕下方的除錯器面板中, 可以找到包括除錯器在內的許多Godot的除錯工具. 點擊 **除錯器** 即可打開.

source: The debugger panel is split into several tabs, each focusing on a specific task.
de: Das Debugger-Panel ist in mehrere Tabs unterteilt, die sich jeweils auf eine bestimmte Aufgabe konzentrieren.
zh_tw: 除錯器面板被分成幾個標籤, 每個標籤專注於一個特定的工作.

source: Debugger
zh_tw: 除錯工具

source: The Debugger tab opens automatically when the GDScript compiler reaches a breakpoint in your code.
de: Das Debugger-Tab wird automatisch geöffnet, wenn der GDScript-Compiler einen Breakpoint in Ihrem Code erreicht.
zh_tw: 當 GDScript 編譯器在你的程式碼中達到一個中斷點時，“除錯器”分頁會自動打開。

source: It gives you a `stack trace <https://en.wikipedia.org/wiki/Stack_trace>`__, information about the state of the object, and buttons to control the program's execution. When the debugger breaks on a breakpoint, a green triangle arrow is visible in the script editor's gutter. This arrow indicates the line of code the debugger broke on.
de: Sie erhalten `ein Stack-Trace <https://en.wikipedia.org/wiki/Stack_trace>`__,-Informationen über den Zustand des Objekts und Buttons zur Steuerung der Programmausführung. Wenn der Debugger an einem Breakpoint abbricht, wird ein grüner Dreieckspfeil in der Leiste des Skripteditors angezeigt. Dieser Pfeil zeigt die Codezeile an, wo der Debugger abgebrochen hat.
zh_tw: 它給你提供了一個 `堆疊追蹤 <https://en.wikipedia.org/wiki/Stack_trace>`__ , 物件的狀態資訊, 以及控制程式執行的按鈕.

source: You can create a breakpoint by clicking the gutter in the left of the script editor (on the left of the line numbers). When hovering this gutter, you will see a transparent red dot appearing, which turns into an opaque red dot after the breakpoint is placed by clicking. Click the red dot again to remove the breakpoint. Breakpoints created this way persist across editor restarts, even if the script wasn't saved when exiting the editor.
de: Sie können einen Breakpoint erstellen, indem Sie auf die Leiste links im Skript-Editor klicken (links neben den Zeilennummern). Wenn Sie mit dem Mauszeiger über diese Leiste fahren, erscheint ein transparenter roter Punkt, der sich in einen undurchsichtigen roten Punkt verwandelt, nachdem der Breakpoint durch Klicken gesetzt wurde. Klicken Sie erneut auf den roten Punkt, um den Breakpoint zu entfernen. Auf diese Weise erstellte Breakpoints bleiben auch nach einem Neustart des Editors erhalten, selbst wenn das Skript beim Verlassen des Editors nicht gespeichert wurde.
zh_tw: 您可以透過點選腳本編輯器左側的裝訂線（行號左側）來建立斷點。將滑鼠懸停在該排水溝上時，您會看到出現一個透明的紅點，點擊放置斷點後，該紅點會變成不透明的紅點。再次點選紅點即可刪除斷點。以這種方式建立的斷點在編輯器重新啟動後仍然存在，即使退出編輯器時未儲存腳本也是如此。

source: You can use the buttons in the top-right corner to:
de: Sie können die Buttons in der oberen rechten Ecke verwenden, um:
zh_tw: 你可以使用右上角的按鈕來:

source: Skip all breakpoints. That way, you can save breakpoints for future debugging sessions.
de: Alle Breakpoints überspringen. Auf diese Weise können Sie Breakpoints für zukünftige Debugging-Sitzungen speichern.
zh_tw: 跳過所有中斷點. 這樣一來, 你就可以為將來的除錯會話保存中斷點.

source: Copy the current error message.
de: Kopieren der aktuellen Fehlermeldung.
zh_tw: 複製目前錯誤消息.

source: **Step Into** the code. This button takes you to the next line of code, and if it's a function, it steps line-by-line through the function.
de: In den Code **Hineinspringen**. Dieser Button führt Sie zur nächsten Codezeile. Wenn es sich um eine Funktion handelt, wird die Funktion zeilenweise durchlaufen.
zh_tw: **步入** 程式碼. 這個按鈕將帶你進入下一行程式碼, 如果是函式, 它將逐行進入函式.

source: **Step Over** the code. This button goes to the next line of code, but it doesn't step line-by-line through functions.
de: Den Code **Überspringen**. Dieser Button wechselt zur nächsten Codezeile, geht jedoch nicht zeilenweise durch die Funktionen.
zh_tw: **步過** 的程式碼. 這個按鈕會進入下一行程式碼, 但它不會逐行跳過函式.

source: **Break**. This button pauses the game's execution.
de: **Unterbrechen**. Dieser Button unterbricht die Ausführung des Spiels.
zh_tw: **Break** . 這個按鈕會暫停執行遊戲.

source: **Continue**. This button resumes the game after a breakpoint or pause.
de: **Fortsetzen**. Dieser Button setzt das Spiel nach einem Breakpoint oder einer Pause fort.
zh_tw: **繼續** . 該按鈕在中斷點或暫停後恢復遊戲.

source: Errors
de: Fehler
zh_tw: 錯誤

source: This is where error and warning messages are printed while running the game.
de: Hier werden Fehler- und Warnmeldungen ausgegeben, während das Spiel ausgeführt wird.
zh_tw: 這是運作遊戲時列印錯誤和警告資訊的地方.

source: You can disable specific warnings in **Project Settings > Debug > GDScript**.
de: Sie können bestimmte Warnungen unter **Projekteinstellungen> Debug> GDScript** deaktivieren.
zh_tw: 您可以在 **專案設定>除錯> GDScript** 中禁用特定的警告.

source: Profiler
zh_tw: 分析工具

source: The profiler is used to see what code is running while your project is in use, and how that effects performance.
de: Der Profiler wird verwendet, um zu sehen, welcher Code ausgeführt wird, während Ihr Projekt in Gebrauch ist, und wie sich dies auf die Performance auswirkt.
zh_tw: 探查器用於查看專案使用時正在運作哪些程式碼，以及它如何影響效能。

source: A detailed explanation of how to use the profiler can be found in the dedicated :ref:`doc_the_profiler` page.
de: Eine ausführliche Erklärung, wie der Profiler verwendet wird, finden Sie auf der Seite :ref:`doc_the_profiler`.
zh_tw: 有關如何使用探查器的詳細說明可以在專用的 doc_the_profiler 頁面中找到。

source: Visual Profiler
de: Visueller Profiler
zh_tw: 分析工具

source: The Visual Profiler can be used to monitor what is taking the most time when rendering a frame on the CPU and GPU respectively. This allows tracking sources of potential CPU and GPU bottlenecks caused by rendering.
de: Der Visual Profiler kann verwendet werden, um zu überwachen, was beim Rendern eines Frames auf der CPU bzw. GPU am meisten Zeit in Anspruch nimmt. Dies ermöglicht das Aufspüren von Quellen potenzieller CPU- und GPU-Bottlenecks, die durch das Rendering verursacht werden.
zh_tw: Visual Profiler 可用來監控分別在 CPU 和 GPU 上算繪影格時花費最多時間的情況。這允許追蹤由算繪引起的潛在 CPU 和 GPU 瓶頸的來源。

source: The Visual Profiler only measures CPU time taken for rendering tasks, such as performing draw calls. The Visual Profiler does **not** include CPU time taken for other tasks such as scripting and physics. Use the standard Profiler tab to track non-rendering-related CPU tasks.
de: Der Visual Profiler misst nur die CPU-Zeit, die für Rendering-Aufgaben benötigt wird, wie z.B. die Ausführung von Zeichenaufrufen. Der Visual Profiler umfasst **nicht** die CPU-Zeit, die für andere Aufgaben wie Skripting und Physik benötigt wird. Verwenden Sie die Das Standard-Profiler-Tab, um nicht-renderingbezogene CPU-Aufgaben zu verfolgen.
zh_tw: Visual Profiler 僅測量算繪工作（例如執行繪製呼叫）所花費的 CPU 時間。 Visual Profiler **不**包含其他工作（例如腳本編寫和實體）所花費的 CPU 時間。使用標準 Profiler 標籤來追蹤與算繪無關的 CPU 工作。

source: To use the visual profiler, run the project, switch to the **Visual Profiler** tab within the Debugger bottom panel, then click **Start**:
de: Um den visuellen Profiler zu verwenden, starten Sie das Projekt, wechseln Sie zum Tab **Visueller Profiler** im unteren Bereich des Debuggers und klicken Sie dann auf **Start**:
zh_tw: 若要使用視覺化分析器，請執行專案，切換到偵錯器底部面板中的 **Visual Profiler** 分頁，然後按一下 **Start**：

source: Visual Profiler tab after clicking Start, waiting for a few seconds, then clicking Stop
de: Der Visual Profiler-Tab, nachdem Sie auf Start geklickt, einige Sekunden gewartet und dann auf Stopp geklickt haben
zh_tw: 點擊“開始”後的“Visual Profiler”分頁，等待幾秒鐘，然後點擊“停止”

source: Visual Profiler tab after clicking **Start**, waiting for a few seconds, then clicking **Stop**
de: Der Visual Profiler-Tab, nachdem Sie auf **Start** geklickt, ein paar Sekunden gewartet und dann auf **Stop** geklickt haben
zh_tw: 點擊“**開始**”後的“Visual Profiler”分頁，等待幾秒鐘，然後點擊“**停止**”

source: You will see categories and results appearing as the profiler is running. Graph lines also appear, with the left side being a CPU framegraph and the right side being a GPU framegraph.
de: Während der Profiler ausgeführt wird, werden Kategorien und Ergebnisse eingeblendet. Außerdem werden Diagrammlinien angezeigt, wobei die linke Seite ein CPU-Framegraph und die rechte Seite ein GPU-Framegraph ist.
zh_tw: 您將看到分析器運作時出現的類別和結果。也會出現圖形線，左側是 CPU 影格圖，右側是 GPU 影格圖。

source: Click **Stop** to finish profiling, which will keep the results visible but frozen in place. Results remain visible after stopping the running project, but not after exiting the editor.
de: Klicken Sie auf **Stop**, um die Profilerstellung zu beenden, wodurch die Ergebnisse sichtbar bleiben, aber eingefroren werden. Die Ergebnisse bleiben nach dem Anhalten des laufenden Projekts sichtbar, nicht aber nach dem Verlassen des Editors.
zh_tw: 按一下 **停止** 完成分析，這將使結果保持可見但凍結在適當的位置。停止正在執行的專案後，結果仍然可見，但退出編輯器後則不再可見。

source: Click on result categories on the left to highlight them in the CPU and GPU graphs on the right. You can also click on the graph to move the cursor to a specific frame number and highlight the selected data type in the result categories on the left.
de: Klicken Sie auf die Ergebniskategorien auf der linken Seite, um sie in den CPU- und GPU-Diagrammen auf der rechten Seite hervorzuheben. Sie können auch auf das Diagramm klicken, um den Cursor zu einer bestimmten Bildnummer zu bewegen und den ausgewählten Datentyp in den Ergebniskategorien auf der linken Seite zu markieren.
zh_tw: 點擊左側的結果類別可在右側的 CPU 和 GPU 圖表中反白顯示它們。您也可以按一下圖形將遊標移至特定影格編號，並在左側結果類別中反白顯示所選資料型別。

source: You can switch the result display between a time value (in milliseconds per frame) or a percentage of the target frametime (which is currently hardcoded to 16.67 milliseconds, or 60 FPS).
de: Sie können die Ergebnisanzeige zwischen einem Zeitwert (in Millisekunden pro Frame) oder einem Prozentsatz der Ziel-Frame-Zeit umschalten (der derzeit auf 16,67 Millisekunden oder 60 FPS fest einkodiert ist).
zh_tw: 您可以在時間值（每影格毫秒）或目標影格時間百分比（目前硬編碼為 16.67 毫秒或 60 FPS）之間切換結果顯示。

source: If framerate spikes occur during profiling, this can cause the graph to be poorly scaled. Disable **Fit to Frame** so that the graph will zoom onto the 60 FPS+ portion.
de: Wenn während der Profilerstellung Framerate-Spitzen auftreten, kann dies dazu führen, dass das Diagramm schlecht skaliert wird. Deaktivieren Sie **Fit to Frame**, damit das Diagramm auf den 60 FPS+ Bereich gezoomt wird.
zh_tw: 如果在分析過程中出現影格速率峰值，可能會導致圖表縮放不良。停用 **Fit to Frame**，以便圖表將縮放到 60 FPS+ 部分。

source: Remember that Visual Profiler results can vary **heavily** based on viewport resolution, which is determined by the window size if using the ``disabled`` or ``canvas_items`` :ref:`stretch modes <doc_multiple_resolutions>`.
de: Denken Sie daran, dass die Ergebnisse des Visual Profilers **stark** von der Auflösung des Viewports abhängen, die durch die Fenstergröße bestimmt wird, wenn Sie die Modi ``disabled`` oder ``canvas_items`` :ref:`stretch modes <doc_multiple_resolutions>` verwenden.
zh_tw: 請記住，Visual Profiler 結果可能會根據視口分辨率而**顯著**，如果使用“disabled”或“canvas_items”:ref:`拉伸模式<doc_multiple_analysis>`，則視口分辨率由視窗大小決定。

source: When comparing results across different runs, make sure to use the same viewport size for all runs.
de: Wenn Sie die Ergebnisse verschiedener Läufe miteinander vergleichen, achten Sie darauf, dass Sie für alle Läufe die gleiche Ansichtsgröße verwenden.
zh_tw: 比較不同運作的結果時，請確保所有運作使用相同的視窗大小。

source: Visual Profiler is supported when using any rendering method (Forward+, Mobile or Compatibility), but the reported categories will vary depending on the current rendering method as well as the enabled graphics features. For example, when using Forward+, a simple 2D scene with shadow-casting lights will result in the following categories appearing:
de: Visual Profiler wird bei Verwendung jeder Rendering-Methode (Forward+, Mobile oder Kompatibilität) unterstützt, aber die gemeldeten Kategorien hängen von der aktuellen Rendering-Methode und den aktivierten Grafikfunktionen ab. Wenn Sie beispielsweise Forward+ verwenden, werden bei einer einfachen 2D-Szene mit schattenwerfenden Lichtern die folgenden Kategorien angezeigt:
zh_tw: 使用任何算繪方法（Forward+、Mobile 或 Compatibility）時支援 Visual Profiler，但報告的類別將根據目前算繪方法以及啟用的圖形功能而有所不同。例如，當使用 Forward+ 時，具有陰影投射燈的簡單 2D 場景將導致以下類別：

source: Example results from a 2D scene in the Visual Profiler
de: Beispielergebnisse aus einer 2D-Szene im Visual Profiler
zh_tw: 例子結果來自Callgrind, 這是Valgrind的一部分

source: To give another example with Forward+, a 3D scene with shadow-casting lights and various effects enabled will result in the following categories enabled:
de: Um ein weiteres Beispiel mit Forward+ zu geben: Eine 3D-Szene mit schattenwerfenden Lichtern und verschiedenen aktivierten Effekten führt dazu, dass die folgenden Kategorien aktiviert sind:
zh_tw: 再舉一個 Forward+ 的例子，啟用陰影投射燈和各種效果的 3D 場景將導致啟用以下類別：

source: Example results from a 3D scene in the Visual Profiler
de: Beispielergebnisse aus einer 3D-Szene im Visual Profiler
zh_tw: 可視分析器中 3D 場景的範例結果

source: Notice how in the 3D example, several of the categories have **(Parallel)** appended to their name. This hints that multiple tasks are being performed in parallel on the GPU. This generally means that disabling only one of the features involved won't improve performance as much as anticipated, as the other task still needs to be performed sequentially.
de: Wie Sie sehen, haben im 3D-Beispiel mehrere Kategorien den Zusatz **(Parallel)** an ihrem Namen. Dies deutet darauf hin, dass mehrere Aufgaben parallel auf der GPU ausgeführt werden. Dies bedeutet im Allgemeinen, dass die Deaktivierung nur einer der beteiligten Funktionen die Performance nicht so stark verbessert wie erwartet, da die andere Aufgabe weiterhin sequentiell ausgeführt werden muss.
zh_tw: 請注意，在 3D 範例中，幾個類別的名稱後面附加了 **(Parallel)**。這暗示多個工作正在 GPU 上並行執行。這通常意味著僅停用其中一項功能不會像預期那樣提高效能，因為其他工作仍需要按順序執行。

source: Network Profiler
de: Netzwerk-Profiler
zh_tw: 網路分析工具

source: The Network Profiler contains a list of all the nodes that communicate over the multiplayer API and, for each one, some counters on the amount of incoming and outgoing network interactions. It also features a bandwidth meter that displays the total bandwidth usage at any given moment.
de: Der Netzwerk-Profiler enthält eine Liste aller Nodes, die über die Multiplayer-API kommunizieren, und für jeden Node einige Zähler für die Menge der eingehenden und ausgehenden Netzwerkinteraktionen. Außerdem gibt es einen Bandbreitenmesser, der die gesamte Bandbreitennutzung zu einem bestimmten Zeitpunkt anzeigt.
zh_tw: 網路剖析器包含了所有通過多人遊戲API進行通信的節點列表, 對於每個節點, 還包含了一些傳入和傳出網路互動量的計數器. 它還具有一個頻寬表, 可以顯示任何特定時刻的總頻寬使用情況.

source: The bandwidth meter does **not** take the :ref:`doc_high_level_multiplayer` API's own compression system into account. This means that changing the compression algorithm used will not change the metrics reported by the bandwidth meter.
de: Die Bandbreitenmessung berücksichtigt **nicht** das Kompressionssystem der :ref:`doc_high_level_multiplayer`-API. Das bedeutet, dass eine Änderung des verwendeten Kompressionsalgorithmus die von der Bandbreitenanzeige gemeldeten Werte nicht verändert.
zh_tw: 頻寬計**不**考慮 doc_high_level_multiplayer API 自己的壓縮系統。這意味著更改所使用的壓縮演算法不會更改頻寬計報告的指標。

source: Monitors
de: Monitore
zh_tw: 監視器

source: The monitors are graphs of several aspects of the game while its running such as FPS, memory usage, how many nodes are in a scene and more. All monitors keep track of stats automatically, so even if one monitor isn't open while the game is running, you can open it later and see how the values changed.
de: Die Monitore sind Diagramme verschiedener Aspekte des Spiels, während es ausgeführt wird, wie z.B. FPS, Speichernutzung, Anzahl der Nodes in einer Szene und mehr. Alle Monitore verfolgen die Statistiken automatisch. Selbst wenn ein Monitor während des Spiels nicht geöffnet ist, können Sie ihn später öffnen und sehen, wie sich die Werte geändert haben.
zh_tw: 監視器是遊戲運作時幾個方面的圖表, 如FPS, 記憶體使用情況, 場景中的節點數量等等. 所有的監控器都會自動追蹤統計, 所以即使遊戲運作時一個監控器沒有打開, 你也可以在以後打開它, 查看數值的變化.

source: In addition to the default performance monitors, you can also create :ref:`custom performance monitors <doc_custom_performance_monitors>` to track arbitrary values in your project.
de: Zusätzlich zu den Default-Performance-Monitoren können Sie auch :ref:`Eigene Performance-Monitore <doc_custom_performance_monitors>` erstellen, um beliebige Werte in Ihrem Projekt zu tracken.
zh_tw: 除了預設的效能監視器之外，您還可以建立:ref:`自訂效能監視器 <doc_custom_performance_monitors>` 來追蹤專案中的任意值。

source: Video RAM
zh_tw: 顯存

source: The **Video RAM** tab shows the video RAM usage of the game while it is running. It provides a list of every resource using video RAM by resource path, the type of resource it is, what format it is in, and how much Video RAM that resource is using. There is also a total video RAM usage number at the top right of the panel.
de: Der **Video RAM**-Tab zeigt die Video RAM-Nutzung des Spiels während der Ausführung an. Sie enthält eine Liste aller Ressourcen, die Video-RAM verwenden, geordnet nach Ressourcenpfad, dem Ressourcentyp, dem Format und den von dieser Ressource verwendeten Video-RAM. Oben rechts im Panel befindet sich außerdem eine Gesamtzahl der Video-RAM-Auslastung.
zh_tw: **顯存**標籤顯示了遊戲運作時的顯存使用情況。它按資源路徑提供了每一個使用顯存的資源列表、資源的型別、資源的格式，以及該資源使用了多少顯存。在面板的右上方還有一個顯存佔用總量的數字。

source: Misc
de: Verschiedenes
zh_tw: 雜項

source: The **Misc** tab contains tools to identify the control nodes you are clicking at runtime:
de: Der **Verschiedenes**-Tab enthält Tools zum Identifizieren der Control-Nodes, auf die Sie zur Laufzeit klicken:
zh_tw: **其他**分頁中的工具可以用來識別你在運作時點擊了哪個控制項節點：

source: **Clicked Control** tells you where the clicked node is in the scene tree.
de: **Angeklickter Control-Node** zeigt an, wo sich der angeklickte Node im Szenenbaum befindet.
zh_tw: **點擊的控制項**顯示的是被點擊節點在場景樹中的位置。

source: **Clicked Control Type** tells you the type of the node you clicked is.
de: **Typ des angeklickten Control-Nodes** gibt den Typ des angeklickten Nodes an.
zh_tw: **點擊的控制項型別**顯示的是被點擊節點的型別。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: You can also use the ``breakpoint`` keyword in GDScript to create a breakpoint that is stored in the script itself. Unlike breakpoints created by clicking in the gutter, this keyword-based breakpoint is persistent across different machines when using version control.
de: Sie können auch das ``Breakpoint``-Schlüsselwort in GDScript verwenden, um einen Breakpoint zu erzeugen, der im Skript selbst gespeichert wird. Im Gegensatz zu Breakpoints, die durch Klicken auf die linke Leiste erstellt werden, bleibt dieser auf Schlüsselwörtern basierende Breakpoint bei Verwendung der Versionsverwaltung auf verschiedenen Rechnern erhalten.
