Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/debug/the_profiler.po
Languages: de, zh_tw

source: The Profiler
de: Der Profiler
zh_tw: 分析工具

source: You run your game from Godot and play around. It's fun, it's becoming feature complete, and you feel it's getting close to release.
de: Sie starten Ihr Spiel von Godot aus und spielen herum. Es macht Spaß, die Features werden immer vollständiger, und Sie haben das Gefühl, dass es kurz vor der Veröffentlichung steht.
zh_tw: 您可以從 Godot 運作遊戲並進行遊戲。它很有趣，它的功能正在變得完整，而且你感覺它已經接近發布了。

source: But then, you open the skill tree, and it grinds to a halt as something snags in your code. Watching the skill tree scroll by like it's a slide show is unacceptable. What went wrong? Is it positioning the skill tree elements, the UI, or rendering?
de: Doch dann öffnen Sie den Fertigkeitenbaum, und er kommt zum Stillstand, weil etwas in Ihrem Code hängen bleibt. Es ist inakzeptabel, den Fertigkeitenbaum wie eine Diashow vorbeiziehen zu sehen. Was ist schief gelaufen? Liegt es an der Positionierung der Elemente im Fertigkeitenbaum, an der Benutzeroberfläche oder am Rendering?
zh_tw: 但是，當你打開技能樹時，它就會因為程式碼中的某些問題而停止運作。看著技能樹像幻燈片一樣滾動是不可接受的。什麼地方出錯？是定位技能樹元素、UI 還是算繪？

source: You could try to optimize everything and run the game repeatedly, but you can be smarter about this and narrow down the possibilities. Enter Godot's profiler.
de: Sie könnten versuchen, alles zu optimieren und das Spiel wiederholt laufen zu lassen, aber Sie können auch schlauer vorgehen und die Möglichkeiten eingrenzen. Hier kommt der Profiler von Godot ins Spiel.
zh_tw: 您可以嘗試優化所有內容並重複運作遊戲，但您可以對此更加聰明並縮小可能性。輸入戈多的分析器。

source: An overview of the profiler
de: Ein Überblick über den Profiler
zh_tw: PCK 檔概覽

source: You can open the profiler by opening the **Debugger** panel and clicking on the **Profiler** tab.
de: Sie können den Profiler öffnen, indem Sie das Fenster **Debugger** öffnen und auf den **Profiler**-Tab klicken.
zh_tw: 您可以透過開啟 **偵錯器** 面板並點擊 **探查器** 標籤來開啟探查器。

source: Godot's profiler does not automatically run because profiling is performance-intensive. It has to continually measure everything happening in the game and report back to the debugger, so it's off by default.
de: Der Profiler von Godot wird nicht automatisch ausgeführt, da die Profilerstellung Performance-intensiv ist. Er muss ständig alles, was im Spiel passiert, messen und an den Debugger zurückmelden, daher ist er standardmäßig deaktiviert.
zh_tw: Godot 的分析器不會自動運作，因為分析是效能密集的。它必須不斷測量遊戲中發生的一切並向偵錯器報告，因此預設情況下它是關閉的。

source: To begin profiling, click on the **Start** button in the top-left. Run your game and data will start appearing. You can also start profiling at any time before or during gameplay, depending on if you want.
de: Um mit dem Profiling zu beginnen, klicken Sie auf **Start**-Button oben links. Starten Sie Ihr Spiel und die Daten werden angezeigt. Sie können das Profiling auch jederzeit vor oder während des Spiels starten, je nachdem, was Sie möchten.
zh_tw: 要開始分析，請點擊左上角的 **開始** 按鈕。運作你的遊戲，資料將開始出現。您也可以在遊戲之前或遊戲過程中的任何時間開始分析，這取決於您是否願意。

source: The profiler does not currently support C# scripts. C# scripts can be profiled using JetBrains Rider and JetBrains dotTrace with the Godot support plugin.
de: Der Profiler unterstützt derzeit keine C#-Skripte. C#-Skripte können mit JetBrains Rider und JetBrains dotTrace mit dem Godot-Support-Plugin profiliert werden.
zh_tw: 探查器目前不支援 C# 腳本。可以使用 JetBrains Rider 和 JetBrains dotTrace 以及 Godot 支援外掛程式來分析 C# 腳本。

source: You can clear the data by clicking the **Clear** button anytime. Use the **Measure** drop-down menu to change the type of data you measure. The measurements panel and the graph will update accordingly.
de: Sie können die Daten jederzeit löschen, indem Sie auf den **Löschen**-Button klicken. Verwenden Sie das Dropdown-Menü **Messung**, um die Art der Daten zu ändern, die Sie messen. Das Messungsfeld und das Diagramm werden entsprechend aktualisiert.
zh_tw: 您可以隨時點擊**清除**按鈕來清除資料。使用**測量**下拉式選單變更您測量的資料型別。測量面板和圖表將會相應更新。

source: The measured data
de: Die gemessenen Daten
zh_tw: 精靈軌道

source: The profiler's interface is split into two. There is a list of functions on the left and the performance graph on the right.
de: Die Benutzeroberfläche des Profilers ist zweigeteilt. Auf der linken Seite befindet sich eine Liste der Funktionen und auf der rechten Seite das Performance-Diagramm.
zh_tw: 分析器的介面分為兩個。左側是功能列表，右側是效能圖。

source: The main measurements are frame time, physics frame, idle time, and physics time.
de: Die wichtigsten Messungen sind Frame-Zeit, Physik-Frame, Leerlaufzeit und Physik-Zeit.
zh_tw: 主要測量是影格時間、物理影格、空閒時間和物理時間。

source: The **frame time** is the time it takes Godot to execute all the logic for an entire image, from physics to rendering.
de: Die **Frame-Zeit** ist die Zeit, die Godot benötigt, um die gesamte Logik für ein Bild auszuführen, von der Physik bis zum Rendering.
zh_tw: **影格時間**是 Godot 執行整個影像的所有邏輯（從物理到算繪）所需的時間。

source: **Physics frame** is the time Godot has allocated between physics updates. In an ideal scenario, the frame time is whatever you chose: 16.66 milliseconds by default, which corresponds to 60FPS. It's a frame of reference you can use for everything else around it.
de: Der **Physik-Frame** ist die Zeit, die Godot zwischen den Aktualisierungen der Physik zugewiesen hat. In einem idealen Szenario ist die Frame-Zeit, was auch immer Sie gewählt haben: Standardmäßig 16,66 Millisekunden, was 60 FPS entspricht. Es ist ein Bezugsrahmen, den Sie für alles andere um ihn herum verwenden können.
zh_tw: **實體訊框** 是 Godot 在實體更新之間指派的時間。在理想情況下，影格時間是您選擇的任何值：預設為 16.66 毫秒，對應於 60FPS。這是一個參考框架，您可以將其用於周圍的其他一切。

source: **Idle time** is the time Godot took to update logic other than physics, such as code that lives in `_process` or timers and cameras set to update on **Idle**.
de: Die **Leerlaufzeit** ist die Zeit, die Godot brauchte, um andere Logik als die der Physik zu aktualisieren, z.B. Code, der sich in `_process` befindet, oder Timer und Kameras, die so eingestellt sind, dass sie bei **Leerlauf** aktualisiert werden.
zh_tw: **空閒時間**是 Godot 更新實體以外的邏輯所花費的時間，例如位於「_process」中的程式碼或設定為在**空閒**上更新的計時器和相機。

source: **Physics time** is the time Godot took to update physics tasks, like `_physics_process` and built-in nodes set to **Physics** update.
de: **Physikzeit** ist die Zeit, die Godot für die Aktualisierung von Physikaufgaben wie `_physics_process` und eingebauten Nodes, die auf **Physik** eingestellt sind, benötigt hat.
zh_tw: **物理時間**是 Godot 更新物理工作所花費的時間，例如「_physical_process」和設定為 **Physics** 更新的內建節點。

source: In Godot 3, **Frame Time** includes rendering time. Say you find a mysterious spike of lag in your game, but your physics and scripts are all running fast. The delay could be due to the appearance of particles or visual effects!
de: In Godot 3 umfasst **Frame Time** die Rendering-Zeit. Angenommen, Sie stellen eine mysteriöse Verzögerung in Ihrem Spiel fest, aber Ihre Physik und Skripte laufen alle schnell. Die Verzögerung könnte auf das Auftreten von Partikeln oder visuellen Effekten zurückzuführen sein!
zh_tw: 在 Godot 3 中，**影格時間**包括算繪時間。假設您在遊戲中發現了神秘的延遲峰值，但您的物理和腳本都運作得很快。延遲可能是由於粒子或視覺效果的出現！

source: By default, Godot ticks on Frame Time and Physics Time. This gives you an overview of how long each frame takes relative to the allocated desired physics FPS. You can toggle functions on and off by clicking the checkboxes on the left. Other facilities make appearances as you go down the list, like Physics 2D, Physics, and Audio, before reaching Script functions, where your code appears.
de: Standardmäßig zeigt Godot Frame-Zeit und Physik-Zeit an. So erhalten Sie einen Überblick darüber, wie lange jedes Bild im Verhältnis zu den zugewiesenen gewünschten Physik-FPS dauert. Sie können die Funktionen ein- und ausschalten, indem Sie auf die Kontrollkästchen auf der linken Seite klicken. Nach und nach erscheinen weitere Funktionen wie Physik 2D, Physik und Audio, bevor Sie zu den Skriptfunktionen gelangen, wo Ihr Code erscheint.
zh_tw: 預設情況下，Godot 會勾選「影格時間」和「物理時間」。這可以讓您大致了解每個影格相對於分配的所需物理 FPS 所花費的時間。您可以透過點擊左側的複選框來開啟和關閉功能。當您沿著列表向下瀏覽時，會出現其他功能，例如“Physics 2D”、“Physics”和“Audio”，然後再到達顯示程式碼的腳本函式。

source: If you click on the graph, you change which frame's information appears on the left. In the top right, there is also a frame counter where you can manually adjust the frame you are looking at more granularly.
de: Wenn Sie auf das Diagramm klicken, können Sie ändern, welche Bildinformationen auf der linken Seite angezeigt werden. Oben rechts befindet sich außerdem ein Frame-Zähler, mit dem Sie den betrachtete Frame manuell genauer einstellen können.
zh_tw: 如果您按一下圖表，您可以變更左側顯示的框架資訊。右上角還有一個影格計數器，您可以在其中更精細地手動調整您正在查看的影格。

source: Scope of measurement and measurement windows
de: Umfang der Messung und Messfenster
zh_tw: 測量範圍和測量視窗

source: You can change what measurement you are looking at using the **Measure** drop-down menu. By default, it starts with Frame Time and lists the time it takes to go through the frame in milliseconds. The average time is the average time any given function took when called more than once. For example, a function that took 0.05 milliseconds to run five times should give you an average of 0.01 milliseconds.
de: Über das Dropdown-Menü **Messung** können Sie die angezeigte Messung ändern. Standardmäßig beginnt es mit Frame Time und listet die Zeit in Millisekunden auf, die zum Durchlaufen des Frames benötigt wird. Die Durchschnittszeit ist die durchschnittliche Zeit, die eine bestimmte Funktion benötigte, wenn sie mehr als einmal aufgerufen wurde. Eine Funktion, die beispielsweise fünfmal 0,05 Millisekunden für die Ausführung benötigte, sollte einen Durchschnitt von 0,01 Millisekunden ergeben.
zh_tw: 您可以使用**測量**下拉式選單變更您正在查看的測量結果。預設情況下，它以影格時間開始，並列出通過影格所需的時間（以毫秒為單位）。平均時間是任何給定函式被呼叫多次時所花費的平均時間。例如，一個需要 0.05 毫秒運作五次的函式應該會給您平均 0.01 毫秒。

source: If accurate milliseconds count is not important, and you want to see proportions of time relative to the rest of the frame, use percentage measurements. Frame % is relative to Frame Time, and Physics % is relative to Physics Time.
de: Wenn die genaue Zählung der Millisekunden nicht wichtig ist und Sie den Anteil der Zeit im Verhältnis zum Rest des Frames sehen möchten, verwenden Sie die prozentuale Messung. Frame % ist relativ zu Frame-Zeit und Physics % ist relativ zu Physik-Zeit.
zh_tw: 如果精確的毫秒計數並不重要，並且您想要查看相對於影格其餘部分的時間比例，請使用百分比測量。影格 % 相對於影格時間，物理 % 相對於物理時間。

source: The last option is the scope of the time. **Inclusive** measures the time a function took **with** any nested function calls. For example:
de: Die letzte Option ist der Umfang der Zeit. **Inklusive** misst die Zeit, die eine Funktion **mit** allen verschachtelten Funktionsaufrufen benötigt hat. Zum Beispiel:
zh_tw: 最後一個選項是時間範圍。 **包含**測量函式**與**任何巢狀函式呼叫所花費的時間。例如：

source: `get_neighbors`, `find_nearest_neighbor` and `move_subject` all took a lot of time. You could be fooled into thinking that this is because all three of them are slow.
de: `get_neighbors`, `find_nearest_neighbor` und `move_subject` brauchten alle sehr viel Zeit. Man könnte meinen, dass dies daran liegt, dass alle drei langsam sind.
zh_tw: `get_neighbors`、`find_nearest_neighbor` 和 `move_subject` 都花了很多時間。您可能會誤以為這是因為它們三個都很慢。

source: But when changed to **Self**, Godot measures the time spent in the function body without considering function calls it made itself.
de: Bei der Änderung auf **Self** misst Godot jedoch die im Funktionsrumpf verbrachte Zeit, ohne die Funktionsaufrufe zu berücksichtigen, die er selbst vorgenommen hat.
zh_tw: 但是當更改為 **Self** 時，Godot 會測量在函式體中花費的時間，而不考慮它自己進行的函式呼叫。

source: You can see that `get_neighbors` and `move_subject` have lost a lot of their importance. In effect, that means that `get_neighbors` and `move_subject` have spent more time waiting for some other function call to finish than not, and `find_nearest_neighbor` is **actually** slow.
de: Sie können sehen, dass `get_neighbors` und `move_subject` viel von ihrer Bedeutung verloren haben. Das bedeutet, dass `get_neighbors` und `move_subject` mehr Zeit damit verbracht haben, auf die Beendigung eines anderen Funktionsaufrufs zu warten, als nicht, und `find_nearest_neighbor` ist **tatsächlich** langsam.
zh_tw: 您可以看到 `get_neighbors` 和 `move_subject` 已經失去了很多重要性。實際上，這意味著“get_neighbors”和“move_subject”花了更多時間等待其他函式呼叫完成，而“find_nearest_neighbor”實際上很慢。

source: Debugging slow code with the profiler
de: Debugging von langsamem Code mit dem Profiler
zh_tw: 對專案進行除錯

source: Finding slow code with the profiler boils down to running your game and watching the performance graph as it draws. When an unacceptable spike occurs in the frame time, you can click on the graph to pause your game and narrow the _Frame #_ to the spike's start. You may need to jump back and forth between frames and functions to find the root cause.
de: Um langsamen Code mit dem Profiler zu finden, müssen Sie Ihr Spiel laufen lassen und das Performance-Diagramm beobachten, während es gezeichnet wird. Wenn eine inakzeptable Spitze in der Frame-Zeit auftritt, können Sie auf das Diagramm klicken, um Ihr Spiel anzuhalten und den _Frame #_ zum Beginn der Spitze einzugrenzen. Möglicherweise müssen Sie zwischen Frames und Funktionen hin- und herspringen, um die Ursache zu finden.
zh_tw: 使用探查器尋找慢速程式碼可以歸結為運作遊戲並觀察繪製的效能圖。當影格時間內出現不可接受的尖峰時，您可以點擊圖表來暫停遊戲並將_Frame #_ 縮小到尖峰的開始處。您可能需要在框架和函式之間來回跳轉才能找到根本原因。

source: Under the Script functions, turn on the checkboxes for some functions to find which take time. These are the functions you need to review and optimize.
de: Aktivieren Sie unter den Skriptfunktionen die Kontrollkästchen für einige Funktionen, um herauszufinden, welche davon Zeit benötigen. Dies sind die Funktionen, die Sie überprüfen und optimieren müssen.
zh_tw: 在腳本函式下，開啟某些函式的複選框以尋找哪些函式需要時間。這些是您需要檢查和優化的功能。

source: Measuring manually in microseconds
de: Manuelles Messen in Mikrosekunden
zh_tw: 以微秒為單位手動測量

source: If your function is complex, it could be challenging to figure out which part needs optimization. Is it your math or the way you access other pieces of data to do the math with? Is it the `for` loop? The `if` statements?
de: Wenn Ihre Funktion komplex ist, kann es schwierig sein, herauszufinden, welcher Teil optimiert werden muss. Ist es Ihre Mathematik oder die Art und Weise, wie Sie auf andere Daten zugreifen, mit denen Sie die Mathematik durchführen? Ist es die `for`-Schleife? Die `if`-Anweisungen?
zh_tw: 如果您的函式很複雜，那麼找出哪個部分需要最佳化可能會很困難。是你的數學還是你存取其他資料進行數學計算的方式？是「for」循環嗎？ “if”敘述？

source: You can narrow down the measurement by manually counting ticks as the code runs with some temporary functions. The two functions are part of the `Time` class object. They are `get_ticks_msec` and `get_ticks_usec`. The first measures in milliseconds (1,000 per second), and the second measures in microseconds (1,000,000 per second).
de: Sie können die Messung eingrenzen, indem Sie manuell die Ticks zählen, während der Code mit einigen temporären Funktionen ausgeführt wird. Die beiden Funktionen sind Teil des Objekts der Klasse `Time`. Sie heißen `get_ticks_msec` und `get_ticks_usec`. Die erste misst in Millisekunden (1.000 pro Sekunde), die zweite in Mikrosekunden (1.000.000 pro Sekunde).
zh_tw: 當程式碼使用一些臨時函式運作時，您可以透過手動計算刻度來縮小測量範圍。這兩個函式是「Time」類別物件的一部分。它們是“get_ticks_msec”和“get_ticks_usec”。第一個以毫秒為單位（每秒 1,000 個），第二個以微秒為單位（每秒 1,000,000 個）。

source: Either one returns the amount of time since the game engine started in their respective time frame.
de: Beide geben die Zeit zurück, die seit dem Start der Spiel-Engine im jeweiligen Zeit-Frame vergangen ist.
zh_tw: 任一者都會返回自遊戲引擎在各自時間範圍內啟動以來的時間量。

source: If you wrap a piece of code with a start and end count of microseconds, the difference between the two is the amount of time it took to run that piece of code.
de: Wenn Sie ein Codestück mit einem Start- und End-Zähler von Mikrosekunden versehen, ist die Differenz zwischen den beiden die Zeit, die für die Ausführung dieses Codestücks benötigt wurde.
zh_tw: 如果您用微秒的開始和結束計數包裝一段程式碼，則兩者之間的差異就是運作該程式碼段所花費的時間。

source: As you become a more experienced programmer, this technique becomes less necessary. You begin to learn what parts of a running program are slow. Knowing that loops and branches can be slow comes from experience, and you gain experience by measuring and doing research.
de: Wenn Sie ein erfahrener Programmierer werden, wird diese Technik immer weniger notwendig. Man beginnt zu lernen, welche Teile eines laufenden Programms langsam sind. Das Wissen, dass Schleifen und Verzweigungen langsam sein können, kommt aus der Erfahrung, und man sammelt Erfahrung, indem man misst und recherchiert.
zh_tw: 當您成為一名更有經驗的程式設計師時，這種技術就變得不再那麼必要了。您開始了解正在運作的程式的哪些部分速度較慢。知道循環和分支可能會很慢來自於經驗，並且您可以透過測量和研究來獲得經驗。

source: But between the profiler and the ticks functions, you should have enough to get started finding which parts of your code need optimization.
de: Aber mit dem Profiler und den Tick-Funktionen sollten Sie genug in der Hand haben, um herauszufinden, welche Teile Ihres Codes optimiert werden müssen.
zh_tw: 但是在探查器和ticks函式之間，您應該有足夠的知識來開始搜尋程式碼的哪些部分需要最佳化。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
