Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bisecting_regressions.po
Languages: de, zh_cn

source: Bisecting regressions
de: Regressions-Bugs durch Bisecting finden
zh_cn: Regression 的二分查找

source: Bisecting is a way to find regressions in software. After reporting a bug on the `Godot repository on GitHub <https://github.com/godotengine/godot>`__, you may be asked by a contributor to *bisect* the issue. Bisecting makes it possible for contributors to fix bugs faster, as they can know in advance which commit caused the regression. Your effort will be widely appreciated :)
de: Bisecting (Halbierung) ist ein Weg, um Regressions-Bugs in Software zu finden. Nachdem Sie einen Bug im `Godot-Repository in GitHub <https://github.com/godotengine/godot>`__ gemeldet haben, werden Sie möglicherweise von einem Mitwirkenden gebeten, Bisecting auf das Problem anzuwenden. Durch Bisecting können Mitwirkende Bugs schneller beheben, da sie im Voraus wissen, welches Commit den Regression-Bug verursacht hat. Ihre Bemühungen werden sehr geschätzt werden :)
zh_cn: 二分查找是在软件中查找回归的一种方法。在 GitHub 上的 `Godot 仓库 <https://github.com/godotengine/godot>`__\ 中报告了一个错误之后，贡献者可能会要求你去做\ *二分查找*\ 。二分查找可以让贡献者更快地修复错误，因为他们可以提前知道是哪个提交导致了回归。你的努力将受到广泛赞赏 :)

source: The guide below explains how to find a regression by bisecting.
de: In der folgenden Anleitung wird erläutert, wie Sie einen Regressions-Bug durch Bisecting finden.
zh_cn: 以下指南说明了如何通过二等分查找回归.

source: What is bisecting?
de: Was ist Bisecting?
zh_cn: 什么是两分法？

source: Godot developers use the `Git <https://git-scm.com/>`__ version control system. In the context of Git, bisecting is the process of performing a manual `binary search <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ to determine when a regression appeared. While it's typically used for bugs, it can also be used to find other kinds of unexpected changes such as performance regressions.
de: Godot-Entwickler verwenden das Versionskontrollsystem `Git <https://git-scm.com/>`__. Im Kontext von Git ist Bisecting der Prozess der Durchführung für eine manuelle `binäre Suche <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ , um festzustellen, wann ein Regressions-Bug aufgetreten ist. Während es normalerweise für Bugs verwendet wird, können damit auch andere Arten unerwarteter Änderungen gefunden werden, z.B. Performance-Regressions-Bugs.
zh_cn: Godot开发人员使用 `Git <https://git-scm.com/>`__ 版本控制系统. 在Git的上下文中, 二等分是执行手动 `二进制搜索 <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ 的过程, 以确定什么时候出现了回归. 尽管它通常用于错误, 但也可以用于查找其他种类的意外更改, 例如性能下降.

source: Using official builds to speed up bisecting
de: Verwenden Sie offizielle Builds, um den Bisecting-Prozess zu beschleunigen
zh_cn: 使用官方版本加快平分

source: Before using Git's ``bisect`` command, we strongly recommend trying to reproduce the bug with an older (or newer) official release. This greatly reduces the range of commits that potentially need to be built from source and tested. You can find binaries of official releases, as well as alphas, betas, and release candidates `here <https://downloads.tuxfamily.org/godotengine/>`__.
de: Bevor Sie den ``bisect``-Befehl von Git verwenden, empfehlen wir dringend, den Bug mit einer älteren (oder neueren) offiziellen Version zu reproduzieren. Das reduziert die Bandbreite der Commits, die potentiell aus dem Quellcode gebaut und getestet werden müssen, erheblich. Sie können Binärdateien von offiziellen Versionen, sowie Alphas, Betas und Release Candidates `hier <https://downloads.tuxfamily.org/godotengine/>`__ finden.
zh_cn: 在使用Git的 ``bisect`` 命令之前, 我们强烈建议尝试使用较旧的(或较新的)正式版本重现该错误. 这大大减少了可能需要从源构建和测试的提交范围. 你可以在 `此处 <https://downloads.tuxfamily.org/godotengine/>`__ 找到官方发行版的二进制文件以及alpha,beta和发行候选文件.

source: If you have experience with Godot 3.x and can reproduce an issue with Godot 4.0, we recommend trying to reproduce the issue in the latest Godot 3.x version (if the feature exhibiting the bug is present in 3.x). This can be used to check whether the issue is a regression in 4.0 or not.
de: Wenn Sie Erfahrung mit Godot 3.x haben und ein Problem mit Godot 4.0 reproduzieren können, empfehlen wir, das Problem in der neuesten Godot 3.x-Version zu reproduzieren (wenn das Feature, das den Bug aufweist, in 3.x vorhanden ist). Auf diese Weise lässt sich überprüfen, ob es sich bei dem Problem um einen Regressions-Bug in 4.0 handelt oder nicht.

source: If the issue **is present** in 3.x, then you'll need to check whether the issue occurs in older 3.x versions as well.
de: Wenn das Problem **in 3.x vorhanden** ist, müssen Sie prüfen, ob das Problem auch in älteren 3.x-Versionen auftritt.

source: If the issue is **not present** in 3.x, then you can try older 4.0 alphas and betas to determine when the regression started.
de: Wenn das Problem **nicht** in 3.x auftritt, können Sie ältere 4.0 Alphas und Betas ausprobieren, um festzustellen, wann der Regressions-Bug begann.

source: Project files may be incompatible between Godot versions. **Make a backup of your project** before starting the bisection process.
de: Projektdateien können zwischen Godot-Versionen inkompatibel sein. **Erstellen Sie eine Sicherungskopie Ihres Projekts**, bevor Sie mit dem Bisecting-Prozess beginnen.

source: Going from the oldest to the newest build generally reduces the risk of the project not being able to successfully open in the editor, thanks to backwards compatibility. Try to reduce your project to the smallest repeatable example too. The more minimal the project is, the more likely you'll be able to open it without compatibility issues in newer engine versions.
de: Wenn Sie vom ältesten zum neuesten Build wechseln, verringert sich dank der Abwärtskompatibilität in der Regel das Risiko, dass sich das Projekt nicht erfolgreich im Editor öffnen lässt. Versuchen Sie auch, Ihr Projekt auf das kleinste wiederholbare Beispiel zu reduzieren. Je kleiner das Projekt ist, desto wahrscheinlicher ist es, dass Sie es ohne Kompatibilitätsprobleme in neueren Engine-Versionen öffnen können.

source: The Git bisect command
de: Der Git-Befehl bisect
zh_cn: Git bisect 命令

source: If you've found a build that didn't exhibit the bug in the above testing process, you can now start bisecting the regression. The Git version control system offers a built-in command for this: ``git bisect``. This makes the process semi-automated as you only have to build the engine, run it and try to reproduce the bug.
de: Wenn Sie einen Build gefunden haben, der den Bug im obigen Testprozess nicht aufwies, können Sie nun damit beginnen, den Regressions-Bug zu bisektieren. Das Git-Versionskontrollsystem bietet dafür einen eingebauten Befehl: ``git bisect``. Das macht den Prozess halbautomatisch, da Sie nur die Engine bauen müssen, sie laufen lassen und versuchen, den Bug zu reproduzieren.
zh_cn: 如果你发现在上述测试过程中未显示该错误的构建，则可以立即将回归二等分。Git 版本控制系统为此提供了一个内置命令：\ ``git bisect``\ 。这使过程成为半自动化的过程，因为你只需要构建引擎，运行它并尝试重现该错误即可。

source: Before bisecting a regression, you need to set up a build environment to compile Godot from source. To do so, read the :ref:`Compiling <toc-devel-compiling>` page for your target platform. (Compiling Godot from source doesn't require C++ programming knowledge.)
de: Bevor Sie einen Regressions-Bug bisektieren, müssen Sie eine Build-Umgebung einrichten, um Godot aus dem Quellcode zu kompilieren. Lesen Sie dazu die Seite :ref:`Kompilieren <toc-devel-compiling>` für Ihre Target-Plattform. (Zum Kompilieren von Godot aus dem Quellcode sind keine C++-Programmierkenntnisse erforderlich.)
zh_cn: 在平分回归之前, 你需要设置一个构建环境以从源代码编译Godot. 为此, 请阅读目标平台的 :ref:`Compiling <toc-devel-compiling>` 页面. (从源代码编译Godot不需要C ++编程知识.)

source: Note that compiling Godot can take a while on slow hardware (up an hour for each full rebuild on a slow dual-core CPU). This means the full process can take up to several hours. If your hardware is too slow, you may want to stop there and report the results of your "pre-bisecting" on the GitHub issue so another contributor can continue bisecting from there.
de: Beachten Sie, dass das Kompilieren von Godot auf langsamer Hardware eine Weile dauern kann (bis zu einer Stunde für jeden vollständigen Rebuild auf einer langsamen Dual-Core-CPU). Das bedeutet, dass der gesamte Prozess bis zu mehrere Stunden dauern kann. Wenn Ihre Hardware zu langsam ist, möchten Sie vielleicht dort aufhören und die Ergebnisse Ihrer "Vor-Bisektierung" in der GitHub-Issue berichten, so dass ein anderer Mitwirkender von dort aus das Bisecting fortsetzen kann.
zh_cn: 请注意, 编译 Godot 可能需要在缓慢的硬件上一段时间(在缓慢的双核 CPU 上, 每次完全重建需要一个小时). 这意味着整个过程最多可能需要几个小时. 如果你的硬件太慢, 你可能希望停止并报告 GitHub 问题的 "预分节" 结果, 以便其他参与者可以继续从该部分开始参与.

source: Determine the commit hashes
de: Ermitteln der Commit-Hashes
zh_cn: 确定提交哈希

source: To start bisecting, you must first determine the commit hashes (identifiers) of the "bad" and "good" build. "bad" refers to the build that exhibits the bug, whereas "good" refers to the version that doesn't exhibit the bug. If you're using a pre-release build as the "good" or "bad" build, browse the `download mirror <https://downloads.tuxfamily.org/godotengine/>`__, go to the folder that contains the pre-release you downloaded and look for the ``README.txt`` file. The commit hash is written inside that file.
de: Um mit dem Bisecting zu beginnen, müssen Sie zunächst die Commit-Hashes (Identifier) des "schlechten" und "guten" Builds ermitteln. "Schlecht" bezieht sich auf den Build, der den Bug aufweist, während "gut" sich auf die Version bezieht, die den Bug nicht aufweist. Wenn Sie einen Pre-Release-Build als "guten" oder "schlechten" Build verwenden, durchsuchen Sie den `Download-Mirror <https://downloads.tuxfamily.org/godotengine/>`__, gehen Sie in den Ordner, der Ihren heruntergeladenen Pre-Release enthält und suchen Sie nach der Datei ``README.txt``. Der Commit-Hash wird in diese Datei geschrieben.
zh_cn: 要开始划分, 你必须首先确定 "坏" 和 "好" 的版本提交散列值(标识符)."坏" 指的是表现出错误的版本, 而 "好" 指的是没有表现出错误的版本. 如果你使用一个预发布版本作为 "好" 或 "坏" `下载镜像 <https://downloads.tuxfamily.org/godotengine/>`__, 进入包含你下载的预发布版本的文件夹, 寻找 ``README.txt`` 文件. 提交的哈希值就写在该文件中.

source: If you're using a stable release as the "good" or "bad" build, use one of the following commit hashes depending on the version:
de: Wenn Sie ein stable Release als "guten" oder "schlechten" Build verwenden, benutzen Sie je nach Version einen der folgenden Commit-Hashes:
zh_cn: 如果你使用稳定版本作为“好”或“坏”版本，请根据版本使用以下提交哈希之一：

source: You can also use this Bash function to retrieve the Git commit hash of a pre-release build (add it to your ``$HOME/.bashrc`` or similar):
de: Sie können auch diese Bash-Funktion verwenden, um den Git-Commit-Hash eines Pre-Release-Builds abzurufen (fügen Sie ihn zu Ihrer ``$HOME/.bashrc`` oder ähnlichem hinzu):

source: Example usage:
de: Anwendungsbeispiel:
zh_cn: 示例用法：

source: To refer to the latest state of the master branch, you can use ``master`` instead of a commit hash. Note that unlike tagged releases or snapshot commit hashes, ``master`` is a perpetually moving target.
de: Um auf den letzten Stand des Master-Branchs zu verweisen, können Sie ``master`` anstelle eines Commit-Hashes verwenden. Beachten Sie, dass sich ``master`` im Gegensatz zu getaggten Releases oder Snapshot-Commit-Hashes ständig verändern wird.

source: Build the engine
de: Bauen der Engine
zh_cn: 构建引擎

source: :ref:`Get Godot's source code using Git <doc_getting_source>`. Once this is done, in the terminal window, use ``cd`` to reach the Godot repository folder and enter the following command:
de: :ref:`Holen Sie sich Godots Quellcode mit Git <doc_getting_source>`. Sobald dies geschehen ist, verwenden Sie im Terminalfenster ``cd``, um den Godot-Repository-Ordner zu erreichen, und geben Sie den folgenden Befehl ein:
zh_cn: :ref:`使用 Git 获取 Godot 的源代码 <doc_getting_source>`\ 。完成后，在终端窗口中，使用 ``cd`` 进入 Godot 仓库文件夹并输入以下命令：

source: Compile Godot. This assumes you've set up a build environment:
de: Kompilieren Sie Godot. Dies setzt voraus, dass Sie eine Build-Umgebung eingerichtet haben:
zh_cn: 编译 Godot。这假定你已经设置好了构建环境：

source: Run the engine
de: Starten der Engine
zh_cn: 运行引擎

source: Run the binary located in the ``bin/`` folder and try to reproduce the bug.
de: Führen Sie die Binärdatei im Ordner ``bin /`` aus und versuchen Sie, den Bug zu reproduzieren.
zh_cn: 运行位于 ``bin/`` 文件夹中的二进制文件并尝试重现该错误。

source: :ref:`Double-check the output file name <doc_introduction_to_the_buildsystem_resulting_binary>` in ``bin/`` to make sure you're actually running the binary you've just compiled. Different Godot versions will output binaries with different names.
de: :ref:`Überprüfen Sie den Namen der Ausgabedatei <doc_introduction_to_the_buildsystem_resulting_binary>` in ``bin/``, um sicherzustellen, dass Sie tatsächlich die Binärdatei ausführen, die Sie gerade kompiliert haben. Verschiedene Godot-Versionen werden Binärdateien mit unterschiedlichen Namen erzeugen.

source: If the build **still** exhibits the bug, run the following command:
de: Wenn der Build **immer noch** den Bug aufweist, führen Sie den folgenden Befehl aus:
zh_cn: 如果构建\ **仍然**\ 显示错误，请运行以下命令：

source: If the build **does not** exhibit the bug, run the following command:
de: Wenn der Build den Bug **nicht** aufweist, führen Sie den folgenden Befehl aus:
zh_cn: 如果构建\ **没有**\ 显示错误，请运行以下命令：

source: After entering one of the commands above, Git will switch to a different commit. You should now build Godot again, try to reproduce the bug, then enter ``git bisect good`` or ``git bisect bad`` depending on the result. You'll have to repeat this several times. The longer the commit range, the more steps will be required. 5 to 10 steps are usually sufficient to find most regressions; Git will remind you of the number of steps remaining (in the worst case scenario).
de: Nachdem Sie einen der obigen Befehle eingegeben haben, wird Git zu einem anderen Commit wechseln. Sie sollten nun Godot erneut kompilieren, versuchen, den Bug zu reproduzieren, und dann je nach Ergebnis ``git bisect good`` oder ``git bisect bad`` eingeben. Dies müssen Sie mehrere Male wiederholen. Je länger der Commit-Bereich ist, desto mehr Schritte werden benötigt. 5 bis 10 Schritte reichen normalerweise aus, um die meisten Regressions-Bugs zu finden; Git wird Sie an die Anzahl der verbleibenden Schritte erinnern (im worst-case Fall).
zh_cn: 输入上述命令之一后,Git 将切换到其他提交. 现在, 你应该再次构建 Godot, 尝试重现 Bug, 然后根据结果输入"git 一部分好 "或"git 一次坏". 你必须重复几次. 提交范围越长, 所需的步骤就越多.5 到 10 个步骤通常足以查找大多数回归;Git 将提醒你剩余步骤数(在最坏的情况下).

source: Once you've completed enough steps, Git will display the commit hash where the regression appeared. Write this commit hash as a comment to the GitHub issue you've bisected. This will help in solving the issue. Thanks again for contributing to Godot :)
de: Wenn Sie genügend Schritte durchgeführt haben, zeigt Git den Commit-Hash an, wo der Regression-Bug aufgetreten ist. Schreiben Sie diesen Commit-Hash als Kommentar zu der GitHub-Issue, die Sie bisektiert haben. Dies wird bei der Lösung des Problems helfen. Nochmals vielen Dank für Ihren Beitrag zu Godot :)
zh_cn: 完成足够的步骤后,Git将在出现回归的位置显示提交哈希. 将此提交哈希值写成对一分为二的GitHub问题的评论. 这将有助于解决问题. 再次感谢你对Godot的贡献:)

source: You can read the full documentation on ``git bisect`` `here <https://git-scm.com/docs/git-bisect>`__.
de: Sie können die vollständige Dokumentation über ``git bisect`` `hier <https://git-scm.com/docs/git-bisect>`__ lesen.
zh_cn: 你可以在 ``git bisect`` 上阅读完整文档, `这里 <https://git-scm.com/docs/git-bisect>`__ .

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
