Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: de, es, zh_tw

source: *Navigation*: relates to the navigation system (including A* and navmeshes).
de: *Navigation*: bezieht sich auf das Navigationssystem (einschließlich A* und Navmeshes).
es: *Navigation*: se refiere al sistema de navegación (que incluye A* y navmeshes).
zh_tw: *Navigation*：與導覽系統（包括 A* 和導覽網格）有關。

source: *Network*: relates to (lot-level) networking.
de: *Network*: bezieht sich auf (Lot-Level) Netzwerke.
zh_tw: **Network**: 與網路有關。

source: *Particles*: particles, particle systems and their editors.
de: *Particles*: Partikel, Partikelsysteme und ihre Editoren.
zh_tw: :ref:`doc_particle_shader`

source: *Physics*: relates to the physics engine (2D/3D).
de: *Physics*: bezieht sich auf die Physik-Engine (2D/3D).
es: *Physics*: se refiere al motor de físicas (2D/3D).
zh_tw: **Physics**: 與物理引擎有關 (2D/3D)。

source: *Plugin*: relates to problems encountered while writing plugins.
de: *Plugin*: bezieht sich auf Probleme beim Schreiben von Plugins.
es: *Plugin*: se refiere a problemas encontrados al escribir complementos (plugins).
zh_tw: **Plugin**: 與撰寫外掛時遇到的問題有關。

source: *Porting*: relates to some specific platforms or exporting projects.
de: *Porting*: bezieht sich auf bestimmte Plattformen oder den Export von Projekten.
es: *Porting*: se refiere a plataformas específicas o a la exportación de proyectos.
zh_tw: **Porting**: 與某些特定平台有關。

source: *Rendering*: relates to the 2D and 3D rendering engines.
de: *Rendering*: bezieht sich auf die 2D- und 3D-Rendering-Engine.
es: *Rendering*: se refiere a los motores de renderizado 2D y 3D.
zh_tw: **Rendering**: 與 2D、3D 算繪引擎有關。

source: *Shaders*: relates to the Godot shader language or visual shaders.
de: *Shader*: bezieht sich auf die Godot-Shader-Sprache oder visuelle Shader.
es: *Shaders*: se refiere al lenguaje de sombreado de Godot o a los sombreadores visuales.
zh_tw: *Shaders*：與 Godot 著色器語言或視覺化著色器有關。

source: *Tests*: relates to unit tests.
de: *Tests*: bezieht sich auf Unit-Tests.
es: *Tests*: se refiere a las pruebas unitarias.
zh_tw: **Network**: 與網路有關。

source: *Thirdparty*: relates to third-party libraries used in Godot.
de: *Thirdparty*: bezieht sich auf Bibliotheken von Drittanbietern, die in Godot verwendet werden.
es: *Thirdparty*: se refiere a bibliotecas de terceros utilizadas en Godot.
zh_tw: *Thirdparty*：與 Godot 所使用的協力廠商庫有關。

source: *XR*: relates to Augmented Reality or Virtual Reality.
de: *XR*: bezieht sich auf Augmented Reality oder Virtual Reality.
es: *XR*: se refiere a la Realidad Aumentada o Realidad Virtual.
zh_tw: *XR*：與增強現實（AR）或虛擬實境（VR）有關。

source: Issues would typically correspond to only one topic, though it's not unthinkable to see issues that fit two bills. The general idea is that there will be specialized contributors teams behind all topics, so they can focus on the issues labelled with their team's topic.
de: Issues werden in der Regel nur einem Thema entsprechen, obwohl es nicht undenkbar ist, dass Issues zu zwei Themen passen. Der Grundgedanke ist, dass es für alle Themen spezialisierte Teams gibt, so dass sie sich auf die Themen konzentrieren können, die mit dem Thema ihres Teams gekennzeichnet sind.
es: Las issues típicamente corresponderán a un solo tema, aunque no es impensable ver issues que encajen en dos categorías. La idea general es que habrá equipos de colaboradores especializados para cada tema, para que puedan centrarse en las issues etiquetadas con el tema de su equipo.
zh_tw: Issue 通常只會對應到一個主題，雖然很難想像會有 Issue 同時符合兩個主題。主要的概念是希望每個主題背後都有專門的貢獻者團隊，這樣這些團隊就能各自專注於標上該主題標籤的 Issue。

source: **Platforms:**
de: **Plattformen:**
es: Plataformas
zh_tw: **平台：**

source: By default, it is assumed that a given issue applies to all platforms. If one of the platform labels is used, it is then exclusive and the previous assumption doesn't stand anymore (so if it's a bug on e.g. Android and Linux exclusively, select those two platforms).
de: Standardmäßig wird davon ausgegangen, dass eine bestimmte Issue für alle Plattformen gilt. Wenn eines der Plattform-Labels verwendet wird, ist es exklusiv und die vorherige Annahme gilt nicht mehr (wenn es sich also ausschließlich um einen Bug unter Android und Linux handelt, wählen Sie diese beiden Plattformen aus).
es: Por defecto, se asume que una determinada issue se aplica a todas las plataformas. Si se utiliza una de las etiquetas de plataforma, entonces esa etiqueta se considera exclusiva y la suposición anterior ya no se aplica (por lo tanto, si es un bug exclusivo de Android y Linux, selecciona esas dos plataformas).
zh_tw: 預設情況下，我們都假設某個 Issue 適用於所有平台。但如果使用了其中一個平台的 Label，則表示剛才這個假設不適用 (也就是如這個 Bug 是在 Android 或 Linux 上才會出現的，那麼就加上這兩個平台)。

source: Documentation labels
de: Dokumentations-Labels
es: Etiquetas de documentación
zh_tw: 說明文件修改記錄

source: In the `documentation repository <https://github.com/godotengine/godot-docs>`__, we use the following labels:
de: Im `Dokumentations-Repository <https://github.com/godotengine/godot-docs>`__ verwenden wir die folgenden Labels:
es: En el `repositorio de la documentación <https://github.com/godotengine/godot-docs>`__, usaremos las siguientes etiquetas:
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: *Bug*: Incorrect information in an existing page. Not to be used for *missing* information.
de: *Bug*: Falsche Informationen auf einer bestehenden Seite. Nicht zu verwenden für *fehlende* Informationen.
es: *Bug*: Información incorrecta en una página existente. No se debe usar para información que falta.
zh_tw: *Bug*：現有頁面中的錯誤資訊。請勿對*缺失*資訊使用。

source: *Dependencies*: describes pull requests that update a dependency file.
de: *Dependencies*: beschreibt Pull Requests, die eine Abhängigkeitsdatei aktualisieren.
zh_tw: *依賴項*：描述更新相依性檔案的拉取請求。

source: *Enhancememnt*: new information to be added in an existing page.
de: *Enhancement*: neue Informationen, die einer bestehenden Seite hinzugefügt werden sollen.
es: *Enhancement*: Nueva información que debe agregarse en una página existente de documentación.
zh_tw: *Enhancememnt*：為現有頁面加入新資訊。

source: *Python*: Pull requests that update Python code.
de: *Python*: Pull Requests, die Python-Code aktualisieren.
zh_tw: *Python*：更新 Python 程式碼的拉取請求。

source: **Area:**
de: **Abschnitt:**
zh_tw: **相機：**

source: *About*: Issues and PRs related to the About section of the documentation and other general articles.
de: *About*: Issues und PRs im Zusammenhang mit dem About-Abschnitt der Dokumentation und anderen allgemeinen Artikeln.
zh_tw: *關於*：與檔案的「關於」部分和其他一般文章相關的問題和 PR。

source: *Class reference*: the issue is about the class reference, not a documentation page.
de: *Class reference*: Die Issue behandelt die Klassenreferenz, nicht eine Dokumentationsseite.
es: *Class reference*: El problema se refiere a la referencia de clase, no a una página de documentación.
zh_tw: *Class reference*：類參考的問題，非文件頁面。

source: *Community*: Issues and PRs related to the Community section of the documentation.
de: *Community*: Probleme und PRs, die sich auf den Community-Bereich der Dokumentation beziehen.
zh_tw: *社區*：與檔案的社區部分相關的問題和 PR。

source: *Contributing*: Issues and PRs related to the Contributing/Development section of the documentation.
de: *Contributing*: Probleme und PRs, die sich auf den Abschnitt "Mitwirken/Engine-Entwicklung" der Dokumentation beziehen.
zh_tw: *貢獻*：與檔案的貢獻/開發部分相關的問題和 PR。

source: *Getting started*: Issues and PRs related to the Getting Started section of the documentation.
de: *Getting started*: Probleme und PRs im Zusammenhang mit dem Abschnitt "Erste Schritte" in der Dokumentation.
zh_tw: *入門*：與檔案的入門部分相關的問題和 PR。

source: *Manual*: Issues and PRs related to the Manual/Tutorials section of the documentation.
de: *Manual*: Probleme und PRs, die sich auf den Abschnitt "Handbuch" in der Dokumentation beziehen.
zh_tw: *手冊*：與檔案的手冊/教學部分相關的問題和 PR。

source: **Content:**
de: **Inhalte:**
zh_tw: 常數

source: *Images*: Issues and PRs involving outdated or incorrect images in articles.
de: *Images*: Probleme und PRs im Zusammenhang mit veralteten oder falschen Bildern in Artikeln.
zh_tw: *圖片*：涉及文章中過時或不正確圖像的問題和 PR。

source: *New page*: Issues and PRs related to creation of new documentation pages for new or undocumented features.
de: *New page*: Probleme und PRs im Zusammenhang mit der Erstellung neuer Dokumentationsseiten für neue oder undokumentierte Features.
zh_tw: *新頁面*：與為新功能或未記錄功能建立新檔案頁面相關的問題和 PR 。

source: *Organization*: Issues and PRs related to reorganizing the content.
de: *Organization*: Probleme und PRs im Zusammenhang mit der Umstrukturierung der Dokumentation.
zh_tw: *Organization*：這個問題涉及移動頁面或者重新組織內容。

source: *Proofreading*: Issues and PRs related to proofreading the documentation.
de: *Proofreading*: Probleme und PRs im Zusammenhang mit dem Korrekturlesen der Dokumentation.
zh_tw: *校對*：與校對檔案相關的問題和 PR。

source: *Redirect*: Issues and PRs involving moving content and adding a redirect rule on the backend.
de: *Redirect*: Issues und PRs, die das Verschieben von Inhalten und das Hinzufügen einer Umleitungsregel im Backend betreffen.
zh_tw: *重定向*：涉及移動內容和在後端新增重定向規則的問題和 PR。

source: *Website*: Issues related to adding website features and fixing bugs, whether on the front or back-end,
de: *Website*: Fragen im Zusammenhang mit dem Hinzufügen von Website-Features und der Behebung von Bugs, sowohl im Front- als auch im Backend.
zh_tw: *網站*：與新增網站功能和修復錯誤相關的問題，無論是在前端或後端，

source: **Topic:**
de: **Thema:**
zh_tw: **主題：**

source: The available topics describe the same content as the topics in the main repository.
de: Die verfügbaren Themen beschreiben denselben Inhalt wie die Themen im Haupt-Repository.
zh_tw: 可用主題描述與主儲存庫中的主題相同的內容。

source: Milestones
es: Hitos
zh_tw: Milestone (里程碑)

source: `Milestones <https://github.com/godotengine/godot/milestones>`_ correspond to planned future versions of Godot for which there is an existing roadmap. Issues that fit in the said roadmap should be filed under the corresponding milestone; if they don't correspond to any current roadmap, they should be left without milestone. As a rule of thumb, an issue corresponds to a given milestone if it concerns a feature that is new in the milestone, or a critical bug that can't be accepted in any future stable release, or anything that Juan wants to work on right now. :)
de: `Milestones <https://github.com/godotengine/godot/milestones>`_ entsprechen geplanten zukünftigen Versionen von Godot, für die es eine bestehende Roadmap gibt. Probleme, die in diese Roadmap passen, sollten unter dem entsprechenden Milestone eingereicht werden. Wenn sie keiner aktuellen Roadmap entsprechen, sollten sie ohne Milestone bleiben. Als Faustregel gilt, dass ein Problem einem bestimmten Milestone entspricht, wenn es sich um ein neues Feature in diesem Milestone handelt, oder um einen kritischen Bug, der in keinem zukünftigen stable Release akzeptiert werden kann, oder um etwas, an dem Juan gerade arbeiten möchte :)
es: Los `hitos o etapas <https://github.com/godotengine/godot/milestones>`_ corresponden a versiones futuras planificadas de Godot para las cuales existe una hoja de ruta establecida. Los problemas que encajan en dicha hoja de ruta deben ser archivados bajo el hito correspondiente; si no se ajustan a ninguna hoja de ruta actual, deben dejarse sin hito. Como regla general, un problema corresponde a un hito determinado si se refiere a una característica nueva en el hito, o a un error crítico que no puede ser aceptado en ninguna versión estable futura, o cualquier cosa en la que Juan quiera trabajar en este momento. :)
zh_tw: `Milestone (里程碑) <https://github.com/godotengine/godot/milestones>`_ 對應到現有 Godot 藍圖中已計劃的未來版本。當有 Issue 符合這個藍圖中的計劃，則應該列在相應的 Milestone 中。如果是不對應任何目前藍圖的 Issue，就應該保持沒有 Milestone 的狀態。依照經驗法則，如果 Issue 涉及在 Milestone 中的新功能、任何絕對不該在未來穩定版更新中出現的 Bug、或是任何 Juan 馬上就想處理的東西，就該對應到相關 Milestone :)

source: Contributors are free to pick issues regardless of their assigned milestone; if a fix is proposed for a bug that was not deemed urgent and thus without milestone, it would likely still be very welcome.
de: Es steht den Mitwirkenden frei, Issues unabhängig von ihrem zugewiesenen Milestone auszuwählen. Wenn ein Fix für einen Bug vorgeschlagen wird, der nicht als dringend und damit ohne Milestone eingestuft wurde, wäre er wahrscheinlich immer noch sehr willkommen.
es: Los colaboradores son libres de elegir problemas independientemente de su hito asignado; si se propone una solución para un error que no se consideró urgente y, por lo tanto, no tiene un hito asignado, probablemente aún sería muy bienvenida.
zh_tw: 不管 Issue 設定了什麼 Milestone，都歡迎貢獻者自由選擇 Issue 處理。若是某個不緊急且沒設定 Milestone 的 Bug 也依然歡迎處理。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
zh_tw: 翻譯狀態
