Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: de, es, zh_tw

source: Bug triage guidelines
de: Richtlinien für die Bug-Behebung
es: Directrices para el triaje de errores
zh_tw: Bug 分級方針

source: This page describes the typical workflow of the bug triage team aka bugsquad when handling issues and pull requests on Godot's `GitHub repository <https://github.com/godotengine/godot>`__. It is bound to evolve together with the bugsquad, so do not hesitate to propose modifications to the following guidelines.
de: Diese Seite beschreibt den typischen Workflow des Bug-Analyse-Teams, auch Bugsquad genannt, bei der Bearbeitung von Problemen und Pull Requests auf Godots `GitHub Repository <https://github.com/godotengine/godot>`__. Sie wird sich zusammen mit dem Bugsquad weiterentwickeln - zögern Sie also nicht, Änderungen an den folgenden Richtlinien vorzuschlagen.
es: Esta página describe el flujo de trabajo típico del equipo de triaje de errores, también conocido como "bugsquad", al manejar problemas y solicitudes de extracción en el repositorio de Godot en GitHub. Está destinado a evolucionar junto con el bugsquad, así que no dudes en proponer modificaciones a las siguientes directrices.
zh_tw: 本頁說明了在 Godot 的 `GitHub <https://github.com/godotengine/godot>`_ 儲存庫上處理 Issue 與 PR (Pull Request) 的 Bug 分級團隊 (亦稱為 Bugsquad) 的一般工作流程。這個工作流程與 Bugsquad 一起發展，對於下列方針有任何修改建議都歡迎提出。

source: Issues management
de: Issue-Management
es: Gestión de problemas (issues)
zh_tw: Issue 管理

source: GitHub proposes various features to manage issues:
de: GitHub bietet verschiedene Features zum Verwalten von Issues an:
es: GitHub propone varias características para gestionar problemas (issues):
zh_tw: GitHub 提供了各種管理 Issue 的功能：

source: Set one or several labels from a predefined list
de: Setzen eines oder mehrerer Labels aus einer vordefinierten Liste
es: Establecer una o varias etiquetas de una lista predefinida
zh_tw: 從預先定義的列表中設定一個或多個 Label (標籤)

source: Set one milestone from a predefined list
de: Setzen eines Milestones aus einer vordefinierten Liste
es: Establecer un hito (milestone) de una lista predefinida
zh_tw: 從預先定義的列表中設定 Milestone (里程碑)

source: Keep track of the issue in the project dashboard
de: Verfolgen der Issue im Projekt-Dashboard
es: Hacer seguimiento del problema en el tablero del proyecto
zh_tw: 在專案 Dashboard (儀表板) 中持續追蹤 Issue

source: Define one contributor as "assignee" among the Godot engine organization members
de: Ernennen eines Mitgliedern der Godot Engine-Organisation als "Assignee"
es: Definir a un colaborador como "asignado" (assignee) entre los miembros de la organización Godot engine
zh_tw: 將 Godot Engine 組織成員中其中一位貢獻者設定為「Assignee (負責人)」

source: As the Godot engine organization on GitHub currently has a restricted number of contributors, we do not use assignees extensively for now. All contributors are welcome to take on any issue, if relevant after mentioning it on the issue ticket and/or discussing the best way to resolve it with other developers.
de: Da die Godot-Engine-Organisation auf GitHub derzeit nur eine begrenzte Anzahl von Mitwirkenden hat, werden momentan nur wenige Assignees benötigt. Alle Mitwirkenden können sich jedes Problems annehmen, wenn dies relevant ist, nachdem sie es auf dem Problemticket erwähnt haben und/oder mit anderen Entwicklern besprochen haben, wie es am besten gelöst werden kann.
es: Como la organización Godot engine en GitHub actualmente tiene un número limitado de colaboradores, no utilizamos asignaciones de manera extensa por ahora. Todos los colaboradores son bienvenidos a trabajar en cualquier problema, si es relevante, después de mencionarlo en el ticket del problema y/o discutir la mejor manera de resolverlo con otros desarrolladores.
zh_tw: 由於 Godot Engine 在 GitHub 上的組織目前還只有有限的貢獻者，因此我們還沒很常用到負責人的功能。歡迎所有貢獻者參與，當遇到相關問題時在 Issue 上提出並與其他開發人員討論是解決問題最好的方法。。

source: For the time being, we do not use the project dashboard feature either.
de: Auch das Feature des Projekt-Dashboards nutzen wir vorerst nicht.
es: Por el momento, tampoco utilizamos la función del tablero de proyectos.
zh_tw: 目前我們也還沒使用到 Project Dashboard (專案儀表板) 功能。

source: As far as possible, we try to assign labels (and milestones, when relevant) to both issues and pull requests.
de: Wir versuchen so weit wie möglich, sowohl Issues als auch Pull Requests Labels zuzuweisen (und gegebenenfalls Milestones).
es: En la medida de lo posible, tratamos de asignar etiquetas (y hitos, cuando sea relevante) tanto a los problemas como a las solicitudes de extracción (pull requests).
zh_tw: 我們會儘量給 Issue 與 PR 上加上 Label (必要的時候也會加上 Milestone)。

source: Labels
es: Etiquetas
zh_tw: Label (標齊)

source: The following labels are currently defined in the Godot repository:
de: Die folgenden Labels sind derzeit im Godot-Repository definiert:
es: Las siguientes etiquetas están actualmente definidas en el repositorio de Godot:
zh_tw: 在 Godot 儲存庫中目前有設定下列 Label：

source: **Categories:**
de: **Kategorien:**
es: Categorías
zh_tw: **分類：**

source: *Archived*: either a duplicate of another issue, or invalid. Such an issue would also be closed.
de: *Archived*: entweder ein Duplikat einer anderen Issue oder ungültig. Eine solche Issue würde ebenfalls geschlossen werden.
es: *Archived*: Se refiere a problemas que son duplicados de otro problema o que son inválidos. Estos problemas también serán cerrados.
zh_tw: **Archived**: 封存。可能是與其他 Issue 重複或無效的 Issue。這種 Issue 也會被 Close (關閉)。

source: *Breaks compat*: describes something that can only be fixed by breaking compatibility with existing projects.
de: *Breaks compat*: beschreibt etwas, das nur behoben werden kann, indem die Kompatibilität mit bestehenden Projekten gebrochen wird.
es: *Breaks compat*: Describe algo que solo puede solucionarse rompiendo la compatibilidad con proyectos existentes.
zh_tw: *Breaks compat*：用於描述需要破壞已有專案相容性才能修復的內容。

source: *Bug*: describes something that is not working properly.
de: *Bug*: beschreibt etwas, das nicht richtig funktioniert.
es: *Bug*: Describe algo que no está funcionando correctamente.
zh_tw: **Bug**: 代表某東西沒有正常運作。

source: *Cherrypick*: describes something that can be backported to a stable branch after being merged in the ``master`` branch.
de: *Cherrypick*: beschreibt etwas, das in einen stable Branch zurückportiert werden kann, nachdem es in den ``master``-Branch eingefügt wurde.
es: *Cherrypick*: Describe algo que se puede aplicar en una rama estable después de haber sido fusionado en la rama ``master``.
zh_tw: *Cherrypick*：用於描述合併入 ``master`` 分支後還可以移植回穩定分支的內容。

source: *Confirmed*: has been confirmed by at least one other contributor than the bug reporter (typically for *Bug* reports). The purpose of this label is to let developers know which issues are still reproducible when they want to select what to work on. It is therefore a good practice to add in a comment on what platform and what version or commit of Godot the issue could be reproduced; if a developer looks at the issue one year later, the *Confirmed* label may not be relevant anymore.
de: *Confirmed*: wurde durch mindestens einen anderen Mitwirkenden als den Bug-Reporter bestätigt (typischerweise für *Bug*-Reports). Der Zweck dieses Labels besteht darin, die Entwickler wissen zu lassen, welche Probleme noch reproduzierbar sind, wenn sie auswählen wollen, woran sie arbeiten sollen. Es ist daher gute Praxis, einen Kommentar hinzuzufügen, auf welcher Plattform und in welcher Version oder Commit von Godot die Issue reproduziert werden konnte; wenn ein Entwickler die Issue ein Jahr später betrachtet, ist das Label *Confirmed* möglicherweise nicht mehr relevant.
es: *Confirmed*: Ha sido confirmado por al menos otro colaborador aparte del reportador del error (normalmente para informes de *Bugs*). El propósito de esta etiqueta es permitir a los desarrolladores saber qué problemas siguen siendo reproducibles cuando desean seleccionar en qué trabajar. Por lo tanto, es una buena práctica agregar en un comentario en qué plataforma y qué versión o commit de Godot se pudo reproducir el problema; si un desarrollador mira el problema un año después, la etiqueta *Confirmed* puede no ser relevante.
zh_tw: **Confirmed**: 已確認。由至少一位除了回報 Bug 的人以外的開發者確認 (通常用於 **Bug** 回報)。設定該 Label 是要讓其他開發人員在要處理 Issue 時知道那些 Issue 目前仍可重現。因此，在註解中寫上能復現該 Issue 的平台與 Godot 版本或 Commit 是好習慣。當某個開發人員過了一年之後回來看這個 Issue，則 **Confirmed** Label 可能不再適用。

source: *Crash:* describes a bug that causes the engine to crash. This label is only used for "hard" crashes, not freezes.
de: *Crash:* beschreibt einen Bug, der die Engine zum Absturz bringt. Dieses Label wird nur für "harte" Abstürze verwendet, nicht für Freezes.
es: *Crash*: Describe un error que hace que el motor se cierre inesperadamente. Esta etiqueta se utiliza solo para "crashes" (cierres abruptos) reales, no para bloqueos.
zh_tw: *Crash：*用於描述導致引擎當機的問題。這個標籤僅適用於“硬”當機，卡死不算。

source: *Discussion*: the issue is not consensual and needs further discussion to define what exactly should be done to address the topic.
de: *Discussion*: Das Problem ist nicht einstimmig bewertet und bedarf weiterer Diskussion, um zu definieren, was genau getan werden soll, um das Thema anzugehen.
es: *Discussion*: El problema no es consensual y requiere más discusión para definir qué exactamente se debe hacer para abordar el tema.
zh_tw: **Discussion**: 討論。該 Issue 尚未取得共識，需要進一步討論以確認對於該議題確切該怎麼處理。

source: *Documentation*: issue related to the documentation. Mainly to request enhancements in the API documentation. Issues related to the ReadTheDocs documentation should be filed on the `godot-docs <https://github.com/godotengine/godot-docs>`_ repository.
de: *Documentation*: Problem im Zusammenhang mit der Dokumentation, hauptsächlich, um Verbesserungen in der API-Dokumentation anzufordern. Probleme im Zusammenhang mit der ReadTheDocs-Dokumentation sollten im `godot-docs <https://github.com/godotengine/godot-docs>`_ Repository eingereicht werden.
es: *Documentation*: Problema relacionado con la documentación. Principalmente para solicitar mejoras en la documentación de la API. Los problemas relacionados con la documentación de ReadTheDocs deben presentarse en el repositorio `godot-docs <https://github.com/godotengine/godot-docs>`_.
zh_tw: **Documentation**: 說明文件。與說明文件有關的 Issue。通常是要求要改進 API 說明文件。有關 ReadTheDocs 說明文件的 Issue 應開在 `godot-docs <https://github.com/godotengine/godot-docs>`_ 儲存庫內。

source: *Enhancement*: describes a proposed enhancement to an existing functionality.
de: *Enhancement*: Beschreibt eine vorgeschlagene Erweiterung einer vorhandenen Funktionalität.
es: *Enhancement*: Describe una mejora propuesta para una funcionalidad existente.
zh_tw: **Enhancement**: 改進。對現有功能的改進建議。

source: *Feature proposal*: describes a wish for a new feature to be implemented. Note that the main Godot repository no longer accepts feature requests. Please use `godot-proposals <https://github.com/godotengine/godot-proposals>`__ instead.
de: *Feature Proposal*: beschreibt den Wunsch nach einem neuen Feature, das implementiert werden soll. Beachten Sie, dass das Godot-Hauptrepository keine Feature Requests mehr annimmt. Bitte verwenden Sie stattdessen `godot-proposals <https://github.com/godotengine/godot-proposals>`__.
es: *Feature proposal*: Describe un deseo de que se implemente una nueva funcionalidad. Tenga en cuenta que el repositorio principal de Godot ya no acepta solicitudes de nuevas características. Por favor, use `godot-proposals <https://github.com/godotengine/godot-proposals>`__ en su lugar.
zh_tw: *Feature proposal*：用於描述實作新功能的願望。請注意 Godot 主倉庫不再接受功能請求。請換用 `godot-proposals <https://github.com/godotengine/godot-proposals>`__。

source: *For PR meeting*: the issue needs to be discussed in a pull request meeting. These meetings are public and are held on the `Godot Contributors Chat <https://chat.godotengine.org/>`_.
de: *For PR meeting*: Das Problem muss in einem Pull Request-Meeting diskutiert werden. Diese Treffen sind öffentlich und werden im `Godot-Mitwirkenden-Chat <https://chat.godotengine.org/>`_ abgehalten.
es: *For PR meeting*: El problema necesita ser discutido en una reunión de solicitudes de extracción (pull request). Estas reuniones son públicas y se llevan a cabo en el `Godot Contributors Chat <https://chat.godotengine.org/>`_.
zh_tw: *For PR meeting*：該問題需要在拉取請求會議中進行討論。會議是公開的，在 `Godot 貢獻者聊天 <https://chat.godotengine.org/>`_中舉行。

source: *Good first issue*: the issue is *assumed* to be an easy one to fix, which makes it a great fit for new contributors who want to become familiar with the code base. It should be removed while an active PR is available, that resolves this issue.
de: *Good first issue*: Es wird *angenommen*, dass das Problem einfach zu beheben ist, was es für neue Mitwirkende, die sich mit der Codebasis vertraut machen wollen, sehr gut geeignet macht. Es sollte entfernt werden, solange ein aktiver PR verfügbar ist, der dieses Problem behebt.
zh_tw: **Junior job**: 初階工作。我們 **假設** 該 Issue 很容易修正，因此對於想熟悉原始碼的初級貢獻者是再適合不過的工作了。

source: *High priority:* the issue is particularly important as it can prevent people from releasing their projects or cause data loss.
de: *High Priority:* Das Problem ist besonders wichtig, da es Menschen daran hindern kann, ihre Projekte zu releasen, oder da es zu Datenverlust führen kann.
es: *High priority*: El problema es particularmente importante ya que puede evitar que las personas lancen sus proyectos o causar pérdida de datos.
zh_tw: *High priority：*該問題非常重要，可能導致人們無法發行他們的專案或造成資料丟失。

source: *Needs testing*: the issue/pull request could not be completely tested and thus need further testing. This can mean that it needs to be tested on different hardware/software configurations or even that the steps to reproduce are not certain.
de: *Needs testing*: Die Issue oder der Pull Request konnte nicht vollständig getestet werden und bedarf somit weiterer Tests. Dies kann bedeuten, dass es auf verschiedenen Hardware-/Softwarekonfigurationen getestet werden muss oder dass die zu reproduzierenden Schritte nicht klar sind.
es: *Needs testing*: El issue o pull request no ha sido completamente probado y necesita pruebas adicionales. Esto puede significar que necesita ser probado en diferentes configuraciones de hardware o software, o incluso que los pasos para reproducir el problema no están claros.
zh_tw: **Needs testing**: 需要測試。該 Issue/PR 無法完整被測試，並需要進一步測試。這可能表示該 Issue 需要在不同的硬體或軟體設定上測試，甚至是測試所需要的重現步驟不一定的情況。

source: *Needs work*: the pull request needs additional work before it can be merged.
de: *Needs work*: Der Pull Request benötigt zusätzliche Arbeit, bevor er gemergt werden kann.
es: *Needs work*: El pull request necesita trabajo adicional antes de que pueda ser fusionado.
zh_tw: **Needs rebase**: 需要 Rebase。該 Issue 需要進行 Git Rebase 才能合併。

source: *Performance*: issues that directly impact engine or editor performance. Can also be used for pull requests that improve performance or add low-end-friendly options. Should not be coupled with *Usability*.
de: *Performance*: Issues, die sich direkt auf die Performance der Engine oder des Editors auswirken. Kann auch für Pull Requests verwendet werden, die Godots Performance verbessern oder die Optionen für Low-End-Geräte hinzufügen. Sollte nicht gemeinsam mit *Usability* verwendet werden.
es: *Performance*: problemas que impactan directamente en el rendimiento del motor o del editor. También puede usarse para pull requests que mejoran el rendimiento o añaden opciones para dispositivos de baja gama. No debería usarse junto con *Usabilidad*.
zh_tw: *Performance*: 直接影響引擎或編輯器性能的問題。也可用於改善性能或增加低端友好選項的拉取請求。不應與 *Usability* 可用性結合在一起。

source: *Production*: Relates to the production team.
de: *Production*: Bezieht sich auf das Produktionsteam.
zh_tw: **GDScript**: 與 GDScript 有關。

source: *Regression*: the bug appeared after a stable release not exhibiting the bug was released.
de: *Regression*: Der Bug trat auf, nachdem eine stable Version veröffentlicht wurde, die den Bug nicht aufwies.
es: *Regresión*: el error apareció después de que se lanzara una versión estable que no presentaba el error.
zh_tw: *Regression*: 在沒有表現出該錯誤的穩定版本發行之後，該錯誤出現。

source: *Salvageable*: the pull request can't be merged due to design issues or merge conflicts and its author is not active anymore. However, it can still be picked up by an external contributor to bring it to a mergeable state. To do so, you need to open a new pull request based on the original pull request.
de: *Salvageable*: der Pull Request kann aufgrund von Designproblemen oder Merge-Konflikten nicht gemergt werden und sein Autor ist nicht mehr aktiv. Sie kann jedoch immer noch von einem externen Mitwirkenden aufgegriffen werden, um sie in einen merge-fähigen Zustand zu bringen. Um dies zu tun, müssen Sie einen neuen Pull Request öffnen, der auf dem ursprünglichen Pull Request basiert.
es: *Salvable*: el pull request no puede ser fusionado debido a problemas de diseño o conflictos de fusión, y su autor ya no está activo. Sin embargo, todavía puede ser retomado por un colaborador externo para llevarlo a un estado que pueda ser fusionado. Para hacerlo, necesitas abrir un nuevo pull request basado en el pull request original.
zh_tw: *Salvageable*: 由於設計問題或合併衝突，該拉動請求不能被合併，其作者也不再活躍。然而，它仍然可以被一個外部貢獻者拾取，以使其達到可合併狀態。為此，您需要基於原始拉取請求打開一個新的拉取請求。

source: *Tracker*: issue used to track other issues (like all issues related to the plugin system).
de: *Tracker*: Issue, die verwendet wird, um andere Issues zu tracken (wie etwa alle Probleme im Zusammenhang mit dem Plugin-System).
es: *Tracker*: issue utilizado para rastrear otros problemas (como todos los problemas relacionados con el sistema de complementos).
zh_tw: **Tracker**: 追蹤用。用來跟進其他 Issue 的 Issue (如所有與外掛系統有關的 Issue)。

source: *Usability*: issues that directly impact user usability. Should not be coupled with *Performance*.
de: *Usability*: Fragen, die sich direkt auf die Benutzerfreundlichkeit auswirken. Sollte nicht gemeinsam mit *Performance* verwendet werden.
es: *Usabilidad*: problemas que impactan directamente la usabilidad para los usuarios. No debe estar relacionado con *Rendimiento*.
zh_tw: **Usability**: 可用性。直接影響使用者可用性的 Issue。

source: The categories are used for general triage of the issues. They can be combined in some way when relevant, e.g. an issue can be labelled *Enhancement* and *Usability* at the same time if it's an issue to improve usability. Or *Feature proposal* and *Discussion* if it's a non-consensual feature request, or one that is not precise enough to be worked on. At least one of the categories *Bug*, *Enhancement* or *Discussion* is used to describe an issue or pull request.
de: Die Kategorien werden für die allgemeine Einteilung der Probleme verwendet. Sie können bei Bedarf kombiniert werden, z.B. kann ein Problem gleichzeitig als *Enhancement* und *Usability* bezeichnet werden, wenn es sich um ein Problem zur Verbesserung der Benutzerfreundlichkeit handelt. Oder *Feature proposal* und *Discussion*, wenn es sich um ein Feature-Request ohne einstimmige Bewertung handelt, oder eine, die nicht präzise genug ist, um bearbeitet zu werden. Mindestens eine der Kategorien *Bug*, *Enhancement* oder *Discussion* wird verwendet, um eine Issue oder einen Pull Request zu beschreiben.
zh_tw: 這些分類用來對 Issue 進行一般性的分級。當有必要是這些 Label 也可能會組合使用，如某個用於提升可用性的 Issue 可以同時被標上 **Enhancement** 與 **Usability**。某個未達共識或描述不夠精確的功能請求會同時被標上 **Feature proposal** 與 **Discussion**。

source: **Topics:**
de: **Themen:**
es: Tópicos
zh_tw: **主題：**

source: *2D*: relates to 2D-specific issues. Should be coupled with one of the labels below, and should not be coupled with *3D*.
de: *2D*: bezieht sich auf 2D-spezifische Issues. Sollte gemeinsam mit einem der nachstehenden Labels verwendet werden und nicht mit *3D*.
es: *2D*: se refiere a problemas específicos de 2D. Debe combinarse con una de las siguientes etiquetas y no debe combinarse con *3D*.
zh_tw: *2D*: 涉及 2D 特定問題。應該與下面的某個標籤組合使用，而不應該與 *3D* 組合。

source: *3D*: relates to 3D-specific issues. Should be coupled with one of the labels below, and should not be coupled with *2D*.
de: *3D*: bezieht sich auf 3D-spezifische Issues. Sollte gemeinsam mit einem der nachstehenden Labels verwendet werden und nicht mit *2D*.
es: *3D*: se refiere a problemas específicos de 3D. Debe combinarse con una de las siguientes etiquetas y no debe combinarse con *2D*.
zh_tw: *3D*: 涉及 3D 特定問題。應該與下面的某個標籤組合使用，而不應該與 *2D* 組合。

source: *Animation*: relates to the Animation system, editors and importers.
de: *Animation*: bezieht sich auf das Animationssystem, die Editoren und Importer.
zh_tw: **Editor**: 與編輯器有關的 Issue (主要為 UI)。

source: *Assetlib*: relates to issues with the asset library.
de: *Assetlib*: Bezieht sich auf Probleme mit der Asset-Bibliothek.
es: *Assetlib*: se refiere a problemas relacionados con la biblioteca de activos (asset library).
zh_tw: **Assetlib**: 與素材庫有關的 Issue。

source: *Audio*: relates to the audio features (low and high level).
de: *Audio*: bezieht sich auf die Audio-Features (Low-Level und High-Level).
es: *Audio*: se refiere a características relacionadas con el audio (nivel bajo y alto).
zh_tw: **Audio**: 與音訊功能有關的 Issue (不論低階或高階)。

source: *Buildsystem*: relates to building issues, either linked to the SCons buildsystem or to compiler peculiarities.
de: *Buildsystem*: bezieht sich auf Build-Issues, die entweder mit dem SCons-Buildsystem oder mit den Besonderheiten des Compilers zusammenhängen.
es: *Buildsystem*: se refiere a problemas de construcción, ya sea relacionados con el sistema de construcción SCons o con peculiaridades del compilador.
zh_tw: **Buildsystem**: 與建置有關的 Issue，可能與 SCons 建置系統或其他特定編譯器有關。

source: *Codestyle*: relates to the programming style used within the codebase.
de: *Codestyle*: bezieht sich auf den in der Codebasis verwendeten Programmierstil.
es: *Codestyle*: se refiere al estilo de programación utilizado dentro del código fuente.
zh_tw: *Codestyle*：與程式碼庫所使用的程式設計風格有關。

source: *Core*: anything related to the core engine. Specific topics are split off separately as they crop up.
de: *Core*: alles, was mit der Kern-Engine zu tun hat. Spezifische Themen werden separat behandelt, wenn sie auftauchen.
zh_tw: **Core**: 任何與核心引擎有關的 Issue。如果是足夠大的主題，可能會進一步被拆分成多個 Issue。

source: *Dotnet*: relates to the C# / Dotnet bindings.
de: *Dotnet*: bezieht sich auf die C#/Dotnet-Bindings.
zh_tw: **Mono**: 與 C# / Mono 繫結有關。

source: *Editor*: relates to issues in the editor (mainly UI).
de: *Editor*: bezieht sich auf Probleme im Editor (hauptsächlich UI).
es: *Editor*: se refiere a problemas en el editor (principalmente la interfaz de usuario).
zh_tw: **Editor**: 與編輯器有關的 Issue (主要為 UI)。

source: *Export*: relates to the export system and templates.
de: *Export*: bezieht sich auf das Exportsystem und die Export-Vorlagen.
zh_tw: **GDScript**: 與 GDScript 有關。

source: *GDExtension*: relates to the GDExtension system for native extensions.
de: *GDExtension*: bezieht sich auf das GDExtension-System für native Erweiterungen.
zh_tw: *GDExtension*：與本機擴充的 GDExtension 系統相關。

source: *GDScript*: relates to GDScript.
de: *GDScript*: bezieht sich auf GDScript.
es: *GDScript*: se refiere a GDScript.
zh_tw: **GDScript**: 與 GDScript 有關。

source: *GUI*: relates to GUI (Control) nodes or to Nodes that compose user interfaces.
de: *GUI*: bezieht sich auf GUI (Control)-Nodes oder auf Nodes zur Erstellung von Benutzeroberflächen.
zh_tw: **Mono**: 與 C# / Mono 繫結有關。

source: *Import*: relates to the resource import system.
de: *Import*: bezieht sich auf das System für den Import von Ressourcen.
es: *Import*: se refiere al sistema de importación de recursos.
zh_tw: *Import*：與資源匯入系統有關。

source: *Input*: relates to the input system.
de: *Input*: bezieht sich auf das Eingabesystem.
zh_tw: **GDScript**: 與 GDScript 有關。

source: *Multiplayer*: relates to multiplayer (high-level networking) systems.
de: *Multiplayer*: bezieht sich auf Multiplayer-Systeme (High-Level-Networking).
zh_tw: *多人遊戲*：涉及多人遊戲（進階網路）系統。
