Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/pr_review_guidelines.po
Languages: de, zh_tw

source: This will make it more obvious which version would include the submitted changes, should the pull request be merged now. Note, that the milestone is not a binding contract and does not guarantee that this version is definitely going to include the PR. If the pull request is not merged before the version is released, the milestone will be moved (and the PR itself may require a target branch change).
de: Dadurch wird es offensichtlicher, welche Version die eingereichten Änderungen enthalten würde, sollte der Pull Request jetzt gemergt werden. Beachten Sie, dass der Milestone kein verbindlicher Vertrag ist und nicht garantiert, dass diese Version definitiv den PR enthalten wird. Wenn der Pull Request nicht vor der Freigabe der Version gemergt wird, wird der Milestone verschoben (und der PR selbst kann eine Änderung des Ziel-Branchs erfordern).
zh_tw: 如果現在合併拉取請求，這將使哪個版本將包含提交的變更更加明顯。請注意，里程碑不是具有約束力的合同，並且不保證此版本一定會包含 PR。如果在版本發布之前未合併拉取請求，則里程碑將被移動（且 PR 本身可能需要目標分支變更）。

source: Similarly, when merging a PR with a higher milestone than the current version, or a "wildcard" milestone (e.g. "4.x"), ensure to update the milestone to the current version.
de: Wenn Sie einen PR mit einem höheren Milestone als der aktuellen Version oder einem "Wildcard"-Milestone (z.B. "4.x") gemergt haben, stellen Sie sicher, dass Sie den Milestone auf die aktuelle Version aktualisieren.
zh_tw: 同樣，當合併具有比目前版本更高的里程碑或「通配符」里程碑（例如「4.x」）的 PR 時，請確保將里程碑更新至目前版本。

source: **Make sure that the opening message of the PR contains the magic words "Closes #..." or "Fixes #...".**
de: **Vergewissern Sie sich, dass die Einleitungs-Message des PR die magischen Worte "Closes #..." oder "Fixes #..." enthält.**
zh_tw: **確保 PR 消息的開頭包含“Closes #...”或“Fixes #...”咒語。**

source: These link the PR and the referenced issue together and allow GitHub to auto-close the latter when you merge the changes. Note, that this only works for the PRs that target the ``master`` branch. For others you need to pay attention and close the related issues manually. Do it with *"Fixed by #..."* or *"Resolved by #..."* comment to clearly indicate the act for future contributors.
de: Diese verknüpfen den PR und die referenzierte Issue miteinander und erlauben es GitHub, die letztere automatisch zu schließen, wenn Sie die Änderungen mergen. Beachten Sie, dass dies nur für die PRs funktioniert, die auf den ``master``-Branch abzielen. Bei anderen müssen Sie aufpassen und die zugehörigen Issues manuell schließen. Machen Sie dies mit einem *"Fixed by #... "* oder *"Resolved by #... "*-Kommentar, um den Vorgang für zukünftige Mitwirkende deutlich zu machen.
zh_tw: 這些將 PR 和引用的問題連結在一起，並允許 GitHub 在您合併更改時自動關閉後者。請注意，這僅適用於針對「master」分支的 PR。對於其他問題，您需要關注並手動關閉相關問題。使用 *“Fixed by #...”* 或 *“Resolved by #...”* 註解來明確指示未來貢獻者的行為。

source: **For the issues that get closed by the PR add the closest relevant milestone.**
de: **Für die Issues, die durch den PR geschlossen werden, fügen Sie den nächstgelegenen relevanten Milestone hinzu.**
zh_tw: **為 PR 所關閉的 Issue 新增最近的相關里程碑。**

source: In other words, if the PR is targeting the ``master`` branch, but is then also cherrypicked for ``3.x``, the next ``3.x`` release would be the appropriate milestone for the closed issue.
de: Mit anderen Worten, wenn der PR auf den ``master``-Branch abzielt, aber dann auch für ``3.x`` ausgewählt wird, wäre das nächste ``3.x``-Release der passende Milestone für die geschlossene Issue.
zh_tw: 換句話說，如果 PR 的目標是“master”分支，但隨後也被挑選為“3.x”，則下一個“3.x”版本將是已解決問題的適當里程碑。

source: 5. Merge the pull request
de: 5. Den Pull Request mergen
zh_tw: 更改 PR

source: If it is appropriate for you to be merging a pull request (i.e. you are on the production team or you are the team leader for that area), you are confident that the pull request has been sufficiently reviewed, and once you carry out these steps you can go ahead and merge the pull request.
de: Wenn es für Sie angemessen ist, einen Pull Request zu mergen (d.h. Sie gehören zum Produktionsteam oder sind der Teamleiter für diesen Bereich), Sie zuversichtlich sind, dass der Pull Request ausreichend gereviewt wurde, und sobald Sie diese Schritte ausgeführt haben, können Sie fortfahren und den Pull Request mergen.
zh_tw: 如果您適合合併拉取請求（即您是生產團隊的成員或您是該領域的團隊領導），那麼您確信該拉取請求已得到充分審查，並且一旦執行了這些步驟您可以繼續合併拉取請求。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
