Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/pr_review_guidelines.po
Languages: de, zh_tw

source: Pull request review process
de: Pull Request-Reviewprozess
zh_tw: Pull Request 工作流程

source: This page is intended to provide insight into the pull request (PR) review process that we aspire to. As such, it is primarily targeted at engine maintainers who are responsible for reviewing and approving pull requests. That being said, much of the content is useful for prospective contributors wanting to know how to ensure that their PR is merged.
de: Diese Seite soll einen Einblick in den von uns angestrebten Prozess des Reviews von Pull Requests (PRs) geben. Sie richtet sich daher in erster Linie an Engine-Maintainer, die für das Reviewen und die Genehmigung von Pull Requests verantwortlich sind. Dennoch ist ein Großteil des Inhalts auch für potenzielle Mitwirkende nützlich, die wissen wollen, wie sie sicherstellen können, dass ihr PR gemergt wird.
zh_tw: 此頁面旨在深入了解我們渴望的拉取請求 (PR) 審核流程。因此，它主要針對負責審查和批准拉取請求的引擎維護人員。話雖如此，大部分內容對於想要了解如何確保其 PR 被合併的潛在貢獻者來說都是有用的。

source: From a high level, the ideal life cycle of a pull request looks like the following:
de: Im Groben sieht der ideale Lebenszyklus eines Pull Requests wie folgt aus:
zh_tw: 從高層次來看，拉取請求的理想生命週期如下所示：

source: A contributor opens a PR that fixes a specific problem (optimally closing a GitHub `issue <https://github.com/godotengine/godot>`_ or implementing a `proposal <https://github.com/godotengine/godot-proposals>`_).
de: Ein Mitwirkender öffnet einen PR, der ein bestimmtes Problem behebt (im Idealfall schließt er eine GitHub-`Issue <https://github.com/godotengine/godot>`_ oder implementiert ein `Proposal <https://github.com/godotengine/godot-proposals>`_).
zh_tw: 貢獻者開啟修復特定問題的 PR（最好關閉 GitHub `issue <https://github.com/godotengine/godot>`_ 或實作 `proposal <https://github.com/godotengine/godot-建議>` _)。

source: Other contributors provide feedback on the PR (including reviewing and/or approving the PR, as appropriate).
de: Andere Mitwirkende geben Feedback zum PR (einschließlich des Reviews und/oder Genehmigung des PRs, je nach Bedarf).
zh_tw: 其他貢獻者提供有關 PR 的回饋（包括酌情審查和/或批准 PR）。

source: An engine maintainer reviews the code and provides feedback, requests changes, or approves the pull request, as appropriate.
de: Ein Engine-Maintainer prüft den Code und gibt Feedback, fordert Änderungen an oder genehmigt den Pull Request, je nach Bedarf.
zh_tw: 引擎維護人員審查程式碼並根據需要提供回饋、請求變更或批准拉取請求。

source: Another maintainer reviews the code with a focus on code style/clarity and approves it once satisfied.
de: Ein weiterer Mitwirkender prüft den Code mit Schwerpunkt auf Stil/Klarheit und gibt ihn frei, sobald er zufrieden ist.
zh_tw: 另一位維護人員審查程式碼，重點關注程式碼風格/清晰度，並在滿意後批准它。

source: A team leader or a member of the `production team <https://godotengine.org/teams#production>`_ merges the pull request if satisfied that it has been sufficiently reviewed.
de: Ein Teamleiter oder ein Mitglied des `Produktionsteams <https://godotengine.org/teams#production>`_ mergt den Pull Request, wenn er überzeugt ist, dass er ausreichend geprüft wurde.
zh_tw: 如果團隊領導者或「生產團隊<https://godotengine.org/teams#product>」的成員認為拉取請求已充分審查，則可以合併拉取請求。

source: This document will explain steps 2, 3, 4, and 5 in more detail. For a more detailed explanation of the pull request workflow please see the :ref:`pull request workflow document <doc_pr_workflow>`.
de: In diesem Dokument werden die Schritte 2, 3, 4 und 5 näher erläutert. Für eine detailliertere Erklärung des Pull Request-Workflows lesen Sie bitte das :ref:`Dokument über den Pull Request-Workflow <doc_pr_workflow>`.
zh_tw: 本文件將更詳細地解釋步驟 2、3、4 和 5。有關拉取請求工作流程的更詳細說明，請參閱拉取請求工作流程檔案 <doc_pr_workflow>`。

source: In practice these steps may blend together. Oftentimes maintainers will provide comments on code style and code quality at the same time and will approve a pull request for both.
de: In der Praxis können diese Schritte ineinander übergehen. Oftmals geben die Maintainer gleichzeitig Kommentare zum Code-Stil und zur Code-Qualität ab und genehmigen einen Pull Request für beide.
zh_tw: 在實踐中，這些步驟可以混合在一起。通常，維護人員會同時提供有關程式碼風格和程式碼品質的評論，並批准對兩者的拉取請求。

source: Typically the first interaction on a pull request will be an engine maintainer assigning tags to the pull request and flagging it for review by someone familiar with that area of code.
de: Normalerweise besteht die erste Interaktion bei einem Pull Request darin, dass ein Engine-Maintainer dem Pull Request Tags zuweist und ihn zum Review durch jemanden kennzeichnet, der mit dem betreffenden Codebereich vertraut ist.
zh_tw: 通常，拉取請求的第一次互動將是引擎維護人員為拉取請求分配標籤，並將其標記為供熟悉該程式碼區域的人員審查。

source: Engine maintainers are folks who are "members" of the Godot project repository on GitHub and/or are listed on the `Teams page <https://godotengine.org/teams>`_ on the Godot website. Maintainers are responsible for a given area of the engine. Typically this means they are the people who are given more trust to approve and recommend pull requests for merging.
de: Engine-Maintainer sind Leute, die "Mitglieder" des Godot-Projekt-Repositorys auf GitHub sind und/oder die auf der `Teams-Seite <https://godotengine.org/teams>`_ auf der Godot-Website aufgeführt sind. Maintainer sind für einen bestimmten Bereich der Engine verantwortlich. In der Regel bedeutet dies, dass ihnen mehr Vertrauen entgegengebracht wird, wenn es darum geht, Pull Requests zum Mergen zu genehmigen und zu empfehlen.
zh_tw: 和/或在 Godot 網站上的「團隊頁面 <https://godotengine.org/teams>」上列出的人員。維護人員負責發動機的特定區域。通常，這意味著他們被給予更多信任來批准和推薦合併拉取請求。

source: Even if you are not a maintainer, you can still help by reviewing code, providing feedback on PRs and testing PRs locally on your machine to confirm that they work as intended. Many of the currently active maintainers started out doing this before they became maintainers.
de: Auch wenn Sie kein Maintainer sind, können Sie helfen, indem Sie den Code überprüfen, Feedback zu PRs geben und PRs lokal auf Ihrem Rechner testen, um zu bestätigen, dass sie wie vorgesehen funktionieren. Viele der derzeit aktiven Maintainer haben mit diesen Dingen angefangen, bevor sie Maintainer wurden.
zh_tw: 即使您不是維護者，您仍然可以透過檢查程式碼、提供 PR 回饋以及在您的電腦上本地測試 PR 來確認它們是否按預期工作來提供協助。許多目前活躍的維護者在成為維護者之前就開始這樣做了。

source: Code review and testing
de: Code-Reviews und Tests
zh_tw: 程式碼評審與測試

source: The following is a list of things that contributors and engine maintainers can do to conduct a substantive code review of a pull request.
de: Im Folgenden finden Sie eine Liste von Dingen, die Mitwirkende und Engine-Maintainer tun können, um ein substantielles Code-Review eines Pull Requests durchzuführen.
zh_tw: 以下是貢獻者和引擎維護者可以對拉取請求進行實質程式碼審查的一系列操作。

source: If you want to conduct a code review, but can't do everything on this list, say that in your review comment. For example, it is still very helpful to provide comments on code, even if you can't build the pull request locally to test the pull request (or vice versa). Feel free to review the code, just remember to make a note at the end of your review that you have reviewed the code only and have not tested the changes locally.
de: Wenn Sie ein Code-Review durchführen wollen, aber nicht alles auf dieser Liste tun können, sagen Sie das in Ihrem Review-Kommentar. Zum Beispiel ist es immer noch sehr hilfreich, Kommentare zum Code abzugeben, auch wenn Sie den Pull Request nicht lokal bauen können, um ihn zu testen (oder umgekehrt). Fühlen Sie sich frei, den Code zu reviewen, denken Sie nur daran, am Ende Ihres Reviews zu vermerken, dass Sie nur den Code angeschaut haben und die Änderungen nicht lokal getestet haben.
zh_tw: 如果您想要進行程式碼審查，但無法執行此列表中的所有操作，請在您的審查評論中註明。例如，即使您無法在本機上建立拉取請求來測試拉取請求（反之亦然），提供程式碼註解仍然非常有幫助。請隨意審查程式碼，只需記住在審查結束時記下您僅審查了程式碼，尚未在本地測試更改。

source: 1. Confirm that the problem exists
de: 1. Bestätigen Sie, dass das Problem besteht
zh_tw: 1、確認存在問題

source: PRs need to solve problems and problems need to be documented. Make sure that the pull request links and closes (or at least addresses) a bug or a proposal. If it doesn't, consider asking the contributor to update the opening message of the PR to explain the problem that the PR aims to solve in more detail.
de: PRs müssen Probleme lösen und Probleme müssen dokumentiert werden. Stellen Sie sicher, dass der Pull Request einen Link zu einem Bug oder Proposal enthält und diesen schließt (oder zumindest anspricht). Wenn dies nicht der Fall ist, sollten Sie den Mitwirkenden bitten, die einleitende Nachricht des PRs zu aktualisieren, um das Problem, das der PR lösen soll, genauer zu erklären.
zh_tw: PR 需要解決問題，問題需要記錄下來。確保拉取請求連結並關閉（或至少解決）錯誤或提案。如果沒有，請考慮要求貢獻者更新 PR 的開頭訊息，以更詳細地解釋 PR 旨在解決的問題。

source: It should be clear _why_ a pull request is needed before it is merged. This assists reviewers in determining whether a PR does what it says it does and it helps contributors in the future understand why the code is the way it is.
de: Es sollte klar sein, *warum* ein Pull Request benötigt wird, bevor er gemergt wird. Dies hilft den Prüfern bei der Feststellung, ob ein PR das tut, was er vorgibt zu tun, und es hilft zukünftigen Mitwirkenden, zu verstehen, warum der Code so ist, wie er ist.
zh_tw: 在合併之前應該要清楚_為什麼_需要拉取請求。這有助於審閱者確定 PR 是否按照其所說的那樣進行操作，並幫助將來的貢獻者理解為什麼程式碼是這樣的。

source: 2. Test the PR and look for regressions
de: 2. Testen Sie den PR und suchen Sie nach Regressions-Bugs
zh_tw: 2、測試 PR 並搜尋 Regression

source: While strict code review and CI help to ensure that all pull requests work as intended, mistakes happen and sometimes contributors push code that creates a problem in addition to solving a problem. Maintainers will avoid merging code that contains a regression even if it solves the problem as intended.
de: Auch wenn strenge Code-Reviews und CI dazu beitragen, dass alle Pull Requests wie beabsichtigt funktionieren, passieren Fehler, und manchmal bringen Mitwirkende Code ein, der nicht nur ein Problem löst, sondern auch ein Problem schafft. Maintainer werden es vermeiden, Code zu mergen, der einen Regressions-Bug enthält, selbst wenn er das Problem wie beabsichtigt löst.
zh_tw: 雖然嚴格的程式碼審查和 CI 有助於確保所有拉取請求按預期工作，但錯誤還是會發生，有時貢獻者推送的程式碼除了解決問題之外還會產生問題。維護者將避免合併包含回歸的程式碼，即使它按預期解決了問題。

source: When reviewing a pull request, ensure that the PR does what it says it does (i.e. fixes the linked bug or implements the new feature) and nothing outside of the PR target area is broken by the change. You can do this by running the editor and trying out some common functions of the editor (adding objects to a scene, running GDScript, opening and closing menus etc.). Also, while reviewing the code, look for suspicious changes in other parts of the engine. Sometimes during rebasing changes slip through that contributors are not aware of.
de: Stellen Sie beim Review eines Pull Requests sicher, dass der PR das tut, was er behauptet (d.h. den verlinkten Bug behebt oder das neue Feature implementiert) und dass nichts außerhalb des PR-Ziels durch die Änderung kaputt geht. Sie können dies tun, indem Sie den Editor starten und einige gängige Features des Editors ausprobieren (Objekte zu einer Szene hinzufügen, GDScript ausführen, Menüs öffnen und schließen usw.). Achten Sie beim Review des Codes auch auf verdächtige Änderungen in anderen Teilen der Engine. Manchmal schleichen sich während des Rebasings Änderungen ein, deren sich die Mitwirkenden nicht bewusst sind.
zh_tw: 在審查拉取請求時，請確保 PR 按照其規定執行（即修復連結的錯誤或實作新功能），並且 PR 目標區域以外的任何內容都不會因更改而受到破壞。您可以透過執行編輯器並嘗試編輯器的一些常見功能（為場景新增物件、執行 GDScript、開啟和關閉功能表等）來完成此操作。此外，在檢查程式碼時，請尋找引擎其他部分中的可疑變更。有時，在變基過程中，貢獻者沒有意識到更改會被忽略。

source: 3. Do a code review
de: 3. Führen Sie ein Code-Review durch
zh_tw: 3、進行程式碼評審

source: Code reviews are usually done by people who are already experienced in a given area. They may be able to provide ideas to make code faster, more organized, or more idiomatic. But, even if you are not very experienced, you may want to conduct a code review to provide feedback within the scope of what you are comfortable reviewing. Doing so is valuable for the area maintainer (as a second set of eyes on a problem is always helpful) and it is also helpful for you as it will help you get more familiar with that area of code and will expose you to how other people solve problems. In fact, reviewing the code of experienced engine maintainers is a great way to get to know the codebase.
de: Code-Reviews werden in der Regel von Personen durchgeführt, die bereits Erfahrung in einem bestimmten Bereich haben. Sie können vielleicht Ideen liefern, um den Code schneller, besser organisiert oder idiomatischer zu machen. Aber auch wenn Sie nicht sehr erfahren sind, können Sie ein Code-Review durchführen, um Feedback im Rahmen dessen zu geben, was Sie selbst reviewen können. Dies ist für den Maintainer des Bereichs wertvoll (da ein zweiter Blick auf ein Problem immer hilfreich ist), und es ist auch für Sie hilfreich, da es Ihnen hilft, sich mit diesem Bereich des Codes vertrauter zu machen und Ihnen zeigt, wie andere Leute Probleme lösen. Tatsächlich ist das Review des Codes von erfahrenen Engine-Maintainern eine großartige Möglichkeit, die Codebasis kennen zu lernen.
zh_tw: 程式碼審查通常由在特定領域已經有經驗的人來完成。他們也許能夠提供一些想法，讓程式碼更快、更有條理、或更慣用。但是，即使您經驗不足，您也可能希望進行程式碼審查，以在您願意審查的範圍內提供回饋。這樣做對於區域維護人員來說很有價值（因為對問題的第二雙眼睛總是有幫助的），而且對您也有幫助，因為它將幫助您更熟悉該區域的程式碼，並使您了解其他人是如何做的解決問題。事實上，查看經驗豐富的引擎維護人員的程式碼是了解程式碼庫的好方法。

source: Here are some things to think about and look out for as you review the code:
de: Hier sind einige Dinge, an die Sie denken und auf die Sie achten sollten, wenn Sie den Code reviewen:
zh_tw: 評審程式碼時，可以對這些內容進行檢查：

source: **Code only touches the areas announced in the PR (and the commit message).**
de: **Berührt der Code nur die im PR (und in der Commit-Nachricht) beschriebenen Bereiche?**
zh_tw: **程式碼僅涉及 PR（和提交資訊）中提及的領域。**

source: It can be tempting to fix random things in the code, as you see them. However, this can quickly make a pull request difficult to review and can make it hard to dig through in the commit history. Small touch-ups next to the related area are alright, but often bugs that you can find along the way are better fixed in their own PRs.
de: Es kann verlockend sein, wahllos Dinge im Code zu korrigieren, wenn man sie sieht. Dies kann jedoch schnell dazu führen, dass ein Pull Request schwer zu reviewen wird, und es kann es erschweren, die Commit-Historie zu durchsuchen. Kleine Ausbesserungen neben dem verwandten Bereich sind in Ordnung, aber oft werden Bugs, die man unterwegs findet, besser in eigenen PRs behoben.
zh_tw: 正如您所看到的，修復程式碼中的隨機內容可能很誘人。然而，這很快就會使拉取請求難以審查，並且難以深入挖掘提交歷史記錄。相關區域旁邊的小修改是可以的，但通常您可以在自己的 PR 中找到的錯誤得到更好的修復。

source: **Code properly uses Godot's own APIs and patterns.**
de: **Verwendet der Code Godots eigene APIs und Muster korrekt?**
zh_tw: **程式碼正確使用了 Godot 自己的 API 和模式。**

source: Consistency is very important, and a solution that already exists in the codebase is preferable to an ad-hoc solution.
de: Konsistenz ist sehr wichtig, und eine Lösung, die bereits in der Codebasis vorhanden ist, ist einer Ad-hoc-Lösung vorzuziehen.
zh_tw: 一致性非常重要，程式碼庫中已經存在的解決方案比臨時解決方案更可取。

source: **Are core areas affected by the change?**
de: **Sind Kernbereiche von der Änderung betroffen?**
zh_tw: **修改影響核心區域嗎？**

source: Sometimes a PR that is supposed to solve a local problem can have a far-reaching effect way outside of its scope. Usually it is best to keep code changes local to where the problem arises. If you think that the solution requires changes outside the scope of the problem, it is usually best to seek the opinion of a team leader who may have another idea for how to solve the problem.
de: Manchmal kann ein PR, der ein lokales Problem lösen soll, weitreichende Auswirkungen haben, die weit über seinen Geltungsbereich hinausgehen. In der Regel ist es am besten, Codeänderungen dort vorzunehmen, wo das Problem auftritt. Wenn Sie der Meinung sind, dass die Lösung Änderungen außerhalb des Geltungsbereichs des Problems erfordert, ist es in der Regel am besten, die Meinung eines Teamleiters einzuholen, der vielleicht eine andere Idee hat, wie das Problem zu lösen ist.
zh_tw: 有時，旨在解決當地問題的公關可能會產生超出其範圍的深遠影響。通常最好將程式碼變更保留在出現問題的本地位置。如果您認為解決方案需要在問題範圍之外進行更改，通常最好尋求團隊領導的意見，他可能對如何解決問題有其他想法。

source: 4. Iterate with the contributor and improve the PR
de: 4. Iterieren Sie mit dem Mitwirkenden und verbessern Sie den PR
zh_tw: 4、與貢獻者反覆運算改進 PR

source: Maintainers should provide feedback and suggestions for improvement if they spot things in the code that they would like changed. Preferably, suggestions should come in order of importance: first, address overall code design and the approach to solving the problem, then make sure the code is complying with the engine's best practices, and lastly, do the :ref:`code style review <doc_code_style_review>`.
de: Maintainer sollten Feedback und Verbesserungsvorschläge geben, wenn sie Dinge im Code entdecken, die sie gerne geändert hätten. Vorzugsweise sollten die Vorschläge in der Reihenfolge ihrer Wichtigkeit erfolgen: Zuerst sollten sie sich mit dem allgemeinen Code-Design und dem Lösungsansatz für das Problem befassen, dann sicherstellen, dass der Code den Best Practices der Engine entspricht, und zuletzt das :ref:`Code Style Review <doc_code_style_review>` durchführen.
zh_tw: 如果維護人員發現程式碼中需要更改的內容，他們應該提供回饋和改進建議。最好，建議應該按重要性順序排列：首先，解決整體程式碼設計和解決問題的方法，然後確保程式碼符合引擎的最佳實踐，最後，進行程式碼風格審查< doc_code_style_review>`。

source: **Communicate barriers to merging early in the review process.**
de: **Kommunizieren Sie Hindernisse, die einem Merge entgegenstehen, frühzeitig im Review-Prozess.**
zh_tw: **在審查過程中儘早溝通合併的障礙。**

source: If the PR has clear blockers or will likely not get merged for whatever other reason, that fact should be communicated as early and clearly as possible. We want to avoid stringing people along because it feels bad to say "sorry, no".
de: Wenn der PR klare Blocker hat oder aus anderen Gründen wahrscheinlich nicht gemergt wird, sollte diese Tatsache so früh und klar wie möglich kommuniziert werden. Wir wollen vermeiden, dass wir die Leute hinhalten, nur weil wir uns schlecht dabei fühlen würden, "Sorry, nein" zu sagen.
zh_tw: 如果 PR 有明顯的阻礙，或者可能由於任何其他原因而不會被合併，那麼應該儘早、清楚地傳達這一事實。我們希望避免欺騙別人，因為說「對不起，不」感覺很不好。

source: As you review pull requests, keep the Godot `Code of Conduct <https://godotengine.org/code-of-conduct>`_ in mind. Especially the following:
de: Wenn Sie Pull Requests reviewen, denken Sie an den `Godot-Verhaltenskodex <https://godotengine.org/code-of-conduct>`_. Insbesondere das Folgende:
zh_tw: 當您審查拉取請求時，請牢記 Godot `行為準則 <https://godotengine.org/code-of-conduct>`_。特別是以下內容：

source: Politeness is expected at all times. Be kind and courteous.
de: Höflichkeit wird zu jeder Zeit erwartet. Seien Sie freundlich und zuvorkommend.
zh_tw: 任何時候都應該保持禮貌。保持友善和禮貌。

source: Always assume positive intent from others.
de: Gehen Sie bei anderen immer von positiven Absichten aus.
zh_tw: 始終假設他人有正面的意圖。

source: Feedback is always welcome but keep your criticism constructive.
de: Feedback ist immer willkommen, aber halten Sie Ihre Kritik konstruktiv.
zh_tw: 我們隨時歡迎提供回饋，但請保持您的批評具有建設性。

source: Here are some things to avoid as you iterate on a pull request with a contributor:
de: Hier sind einige Dinge, die Sie vermeiden sollten, wenn Sie über einen Pull Request mit einem Mitwirkenden iterieren:
zh_tw: 與貢獻者反覆運算拉取請求時，請避免以下情況：

source: **Needless double reviews.**
de: **Überflüssige Doppelreviews.**
zh_tw: **不必要的多次評審。**

source: In other words, review the full PR at once and avoid coming back endless times to point out issues that you could have noted in the first review. Of course, this can't always be avoided, but we should try to catch everything at once.
de: Mit anderen Worten: Reviewen Sie den gesamten PR auf einmal und vermeiden Sie es, endlose Male zurückzukommen, um auf Probleme hinzuweisen, die Sie bereits beim ersten Reviewen hätten feststellen können. Natürlich lässt sich das nicht immer vermeiden, aber wir sollten versuchen, alles auf einmal zu erfassen.
zh_tw: 換句話說，立即審查完整的 PR，避免無休止地回來指出您在第一次審查中可能注意到的問題。當然，這並不總是可以避免的，但我們應該嘗試一次抓住一切。

source: **Being overly nitpicky.**
de: **Übermäßig pingelig sein.**
zh_tw: **過於吹毛求疵。**

source: Code quality can be flexible depending on the area of the engine you are working in. In general, our standard for code quality is much higher in core areas and in performance-sensitive areas than it is in editor code for example.
de: Die Codequalität kann je nach dem Bereich der Engine, in dem Sie arbeiten, flexibel sein. Im Allgemeinen ist unser Standard für die Codequalität in Kernbereichen und in Performance-sensiblen Bereichen viel höher als z.B. im Editor-Code.
zh_tw: 程式碼品質可以很靈活，這取決於您所使用的引擎區域。一般來說，我們的程式碼品質標準在核心區域和效能敏感區域比在編輯器程式碼中要高得多。

source: **Expanding the scope of a pull request.**
de: **Erweiterung des Geltungsbereichs eines Pull Requests.**
zh_tw: **擴大拉取請求的範圍。**

source: Providing context or related/similar issues or proposals that may be fixed similarly can be helpful, but adding a "may as well fix that thing over there as well while at it" or "could we add to this as well?" isn't always fair to the contributor. Use your judgement when deciding whether additional fixes are within scope, but try to keep the scope as close to the original pull request as possible.
de: Es kann hilfreich sein, den Kontext oder verwandte/ähnliche Probleme oder Vorschläge zu nennen, die auf ähnliche Weise behoben werden können, aber der Zusatz "Wir können auch das da drüben beheben, wenn wir schon dabei sind" oder "Könnten wir das auch noch hinzufügen?" ist dem Mitwirkenden gegenüber nicht immer fair. Benutzen Sie Ihr Urteilsvermögen, wenn Sie entscheiden, ob zusätzliche Korrekturen innerhalb des Umfangs liegen, aber versuchen Sie, den Umfang so nah wie möglich am ursprünglichen Pull Request zu halten.
zh_tw: 提供本文或相關/類似的問題或可以類似解決的建議可能會有所幫助，但新增“也可以解決那裡的問題”或“我們也可以新增到此嗎？”對貢獻者並不總是公平的。在決定其他修復是否在範圍內時，請使用您的判斷，但請嘗試使範圍盡可能接近原始拉取請求。

source: And ultimately, don't feel pressured to deal with the PR all alone. Feel free to ask for a helping hand on the `Godot Contributors Chat <https://chat.godotengine.org>`_, in the appropriate channel or in #general. Other teams may already be tagged for review, so you can also wait or ask for their assistance.
de: Und schließlich sollten Sie sich nicht unter Druck gesetzt fühlen, den PR ganz allein zu bewältigen. Bitten Sie im `Godot-Mitwirkenden-Chat <https://chat.godotengine.org>`_, im entsprechenden Kanal oder in #general um Hilfe. Es kann sein, dass andere Teams bereits für das Reviewen markiert sind, also können Sie auch warten oder um deren Hilfe bitten.
zh_tw: 最後，不要因為獨自處理公關而感到壓力。請隨時透過適當的管道或 #general在「Godot 貢獻者聊天 <https://chat.godotengine.org>」_ 上尋求協助。其他團隊可能已經被標記為需要審核，因此您也可以等待或要求他們的協助。

source: 5. Approve the pull request
de: 5. Den Pull Request genehmigen
zh_tw: 開啟 PR
