Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/pr_review_guidelines.po
Languages: de, zh_tw

source: After reviewing the code, if you think that the code is ready to be merged into the engine, then go ahead and "approve" it. Make sure to also comment and specify the nature of your review (i.e. say whether you ran the code locally, whether you reviewed for style as well as correctness, etc.). Even if you are not an engine maintainer, approving a pull request signals to others that the code is good and likely solves the problem the PR says it does. Approving a pull request as a non-engine maintainer does not guarantee that the code will be merged, other people will still review it, so don't be shy.
de: Wenn Sie nach dem Reviewen des Codes der Meinung sind, dass der Code bereit ist, in die Engine gemergt zu werden, dann "genehmigen" Sie ihn. Stellen Sie sicher, dass Sie auch einen Kommentar abgeben und die Art Ihres Reviews beschreiben (d.h. sagen Sie, ob Sie den Code lokal ausgeführt haben, ob Sie sowohl den Stil als auch die Korrektheit überprüft haben, usw.). Auch wenn Sie kein Engine-Maintainer sind, signalisiert die Genehmigung eines Pull Requests anderen, dass der Code gut ist und wahrscheinlich das Problem löst, das der PR beschreibt. Einen Pull Request als Nicht-Engine-Maintainer zu genehmigen, ist keine Garantie dafür, dass der Code gemergt wird, andere Leute werden ihn trotzdem reviewen, also seien Sie nicht schüchtern.
zh_tw: 檢查程式碼後，如果您認為程式碼已準備好合併到引擎中，那麼請繼續並「批准」它。確保也會評論並指定您的審查的性質（即說明您是否在本地運作程式碼，您是否審查了風格和正確性等）。即使您不是引擎維護者，批准拉取請求也會向其他人發出訊號，表明程式碼很好，並且可能解決 PR 所說的問題。作為非引擎維護者批准拉取請求並不能保證程式碼會被合併，其他人仍然會審查它，所以不要害羞。

source: Code style review
de: Codestil-Review
zh_tw: 程式碼樣式方針

source: Generally speaking, we aim to conduct a code review before a style/clarity review as contributors typically want to know if their general approach is acceptable before putting in the effort to make nitpicky changes to style. In other words, maintainers shouldn't ask contributors to change the style of code that may need to be rewritten in subsequent reviews. Similarly, maintainers should avoid asking for contributors to rebase PRs if the PR has not been reviewed.
de: Im Allgemeinen ist es unser Ziel, ein Code-Review vor einem Stil/Verständlichkeits-Review durchzuführen, da die Mitwirkenden in der Regel wissen wollen, ob ihr allgemeiner Ansatz akzeptabel ist, bevor sie sich die Mühe machen, pingelige Änderungen am Stil vorzunehmen. Mit anderen Worten, die Maintainer sollten die Mitwirkenden nicht bitten, den Stil des Codes zu ändern, der in späteren Reviews möglicherweise neu geschrieben werden muss. Ebenso sollten Maintainer es vermeiden, Mitwirkende zu bitten, PRs zu überarbeiten, wenn der PR noch nicht gereviewt wurde.
zh_tw: 一般來說，我們的目標是在風格/清晰度審查之前進行程式碼審查，因為貢獻者通常想知道他們的一般方法是否可以接受，然後再對風格進行挑剔的更改。換句話說，維護者不應該要求貢獻者更改可能需要在後續審查中重寫的程式碼風格。同樣，如果 PR 未經審查，維護者應避免要求貢獻者重新調整 PR。

source: That being said, not everyone feels confident enough to provide a review on code correctness, in that case, providing comments on code style and clarity ahead of a more substantive code review is totally appropriate and more than welcome.
de: Trotz alledem: Nicht jeder fühlt sich jedoch sicher genug, um die Korrektheit des Codes zu reviewen. In diesem Fall sind Kommentare zu Stil und Klarheit des Codes vor einem umfassenderen Code-Review durchaus angebracht und mehr als willkommen.
zh_tw: 話雖如此，並不是每個人都有足夠的信心來對程式碼的正確性進行審查，在這種情況下，在進行更實質性的程式碼審查之前提供對程式碼風格和清晰度的評論是完全合適的，並且非常受歡迎。

source: In practice the code style review can be done as part of the substantive code review. The important thing is that both the substantive code and the code style need to be reviewed and considered before a pull request is merged.
de: In der Praxis kann das Codestil-Review als Teil des substantiellen Code-Reviews durchgeführt werden. Wichtig ist, dass sowohl der inhaltliche Code als auch der Codestil überprüft und berücksichtigt werden müssen, bevor ein Pull Request gemergt wird.
zh_tw: 在實踐中，程式碼風格審查可以作為實質程式碼審查的一部分來完成。重要的是，在合併拉取請求之前，需要審查和考慮實質程式碼和程式碼風格。

source: When reviewing code style pay particular attention to ensuring that the pull request follows the :ref:`doc_code_style_guidelines`. While ``clang-format`` and various CI checks can catch a lot of inconsistencies, they are far from perfect and are unable to detect some issues. For example, you should check that:
de: Achten Sie beim Reviewen des Codestils besonders darauf, dass der Pull Request den :ref:`doc_code_style_guidelines` folgt. Während ``clang-format`` und verschiedene CI-Prüfungen viele Inkonsistenzen abfangen können, sind sie weit davon entfernt, perfekt zu sein und sind nicht in der Lage, einige Probleme zu erkennen. Zum Beispiel sollten Sie überprüfen, dass:
zh_tw: 在審查程式碼風格時，請特別注意確保拉取請求遵循 doc_code_style_guidelines`。雖然「clang-format」和各種 CI 檢查可以發現很多不一致之處，但它們遠非完美，無法偵測到某些問題。例如，您應該檢查：

source: The style of header includes is respected.
de: Der Stil der Header-Includes beachtet wird.
zh_tw: 標題包含的樣式受到尊重。

source: Identifiers use ``snake_case`` and follow our naming conventions.
de: Bezeichner ``snake_case`` verwenden und unseren Namenskonventionen folgen.
zh_tw: 標識符使用“snake_case”並遵循我們的命名約定。

source: Method parameters start with ``p_*`` or ``r_*`` (if they are used to return a value).
de: Methodenparameter mit ``p_*`` oder ``r_*`` beginnen (falls sie zur Rückgabe eines Wertes verwendet werden).
zh_tw: 方法參數以``p_*`` 或``r_*`` 開頭（如果它們用於傳回值）。

source: Braces are used appropriately, even for one-liner conditionals.
de: Klammern in angemessener Weise verwendet werden, auch für Einzeiler-Conditionals.
zh_tw: 即使是單行條件敘述，也可以適當地使用大括號。

source: Code is properly spaced (exactly one empty line between methods, no unnecessary empty lines inside of method bodies).
de: Der Code die richtigen Abstände verwendet (genau eine Leerzeile zwischen den Methoden, keine unnötigen Leerzeilen innerhalb von Methodenrümpfen).
zh_tw: 程式碼間隔適當（方法之間只有一個空行，方法體內沒有不必要的空行）。

source: This list is not complete and doesn't aim to be complete. Refer to the linked style guide document for a complete set of rules. Keep in mind that ``clang-format`` may not catch things you hope it would, so pay attention and try to build a sense of what exactly it can and cannot detect.
de: Diese Liste ist nicht vollständig und hat auch nicht den Anspruch, vollständig zu sein. Eine vollständige Liste der Regeln finden Sie im verlinkten Style Guide Dokument. Denken Sie daran, dass ``clang-format`` möglicherweise nicht die Dinge erkennt, die Sie sich erhoffen, also seien Sie aufmerksam und versuchen Sie, ein Gefühl dafür zu entwickeln, was genau es erkennen kann und was nicht.
zh_tw: 此列表並不完整，也無意完整。有關完整的規則集，請參閱連結的樣式指南檔案。請記住，「clang-format」可能無法捕捉您希望捕獲的內容，因此請注意並嘗試了解它到底可以偵測到什麼，不能偵測到什麼。

source: Merging pull requests
de: Mergen von Pull Requests
zh_tw: 開啟 PR

source: In general, pull requests should only be merged by members of the production team or team leaders for pull requests in their area of the engine. For example, the networking team leader could merge a networking pull request that doesn't substantially change non-networking sections of code.
de: Im Allgemeinen sollten Pull Requests nur von Mitgliedern des Produktionsteams oder Teamleitern für Pull Requests in ihrem Bereich der Engine gemergt werden. Zum Beispiel könnte der Leiter des Netzwerkteams einen Pull Request für das Netzwerk mergen, der keine wesentlichen Änderungen an den nicht-netzwerkbezogenen Abschnitten des Codes vornimmt.
zh_tw: 一般來說，拉取請求只能由生產團隊成員或團隊負責人在其引擎區域內合併拉取請求。例如，網路團隊負責人可以合併網路拉取請求，該請求不會實質更改程式碼的非網路部分。

source: In practice it is best to wait for a member of the production team to merge the pull request as they keep a close eye on the entire codebase and will likely have a better sense of what other recent/upcoming changes this pull request may conflict with (or any other reason that it may make sense to delay the pull request). Feel free to leave a comment saying that the PR should be ready to merge.
de: In der Praxis ist es am besten, auf ein Mitglied des Produktionsteams zu warten, um den Pull Request zu mergen, da sie ein genaues Auge auf die gesamte Codebasis haben und wahrscheinlich ein besseres Gespür dafür haben, mit welchen anderen kürzlichen/künftigen Änderungen dieser Pull Request in Konflikt stehen könnte (oder andere Gründe, die es sinnvoll machen, den Pull Request zu verzögern). Sie können gerne einen Kommentar hinterlassen, dass der PR zum Mergen bereit sein sollte.
zh_tw: 在實踐中，最好等待生產團隊的成員合併拉取請求，因為他們密切關注整個程式碼庫，並且可能會更好地了解此拉取請求可能與哪些其他最近/即將發生的變更發生衝突（或延遲拉取請求可能有意義的任何其他原因）。請隨意發表評論說 PR 應該準備好合併。

source: The following are the steps to take before merging a pull request. The degree to which you adhere to these steps can be flexible for simple/straightforward pull requests, but they should be carefully taken for complex or risky pull requests.
de: Im Folgenden sind die Schritte aufgeführt, die vor dem Mergen eines Pull Requests zu beachten sind. Der Umfang, in dem Sie diese Schritte befolgen, kann bei einfachen/geradlinigen Pull Requests flexibel sein, aber bei komplexen oder riskanten Pull Requests sollten sie sorgfältig durchgeführt werden.
zh_tw: 以下是合併拉取請求之前要執行的步驟。對於簡單/直接的拉取請求，您遵守這些步驟的程度可以很靈活，但對於複雜或有風險的拉取請求，應謹慎對待。

source: As a contributor you can help move a pull request forward by doing some of these steps yourself.
de: Als Mitwirkender können Sie dazu beitragen, einen Pull Request voranzubringen, indem Sie einige dieser Schritte selbst ausführen.
zh_tw: 作為貢獻者，您可以透過自己執行其中一些步驟來幫助推動拉取請求。

source: 1. Get feedback from the right people/teams
de: 1. Feedback von den richtigen Personen/Teams einholen
zh_tw: 1、從正確的人/團隊獲取回饋

source: Production team members should ensure that the right people look at a pull request before it is merged. In some cases this may require multiple people to weigh in. In other cases, only one substantive approval is needed before the code can be merged.
de: Die Mitglieder des Produktionsteams sollten sicherstellen, dass sich die richtigen Personen einen Pull Request ansehen, bevor er gemergt wird. In einigen Fällen kann es erforderlich sein, dass sich mehrere Personen dazu äußern. In anderen Fällen ist nur eine einzige inhaltliche Genehmigung erforderlich, bevor der Code gemergt werden kann.
zh_tw: 生產團隊成員應確保在合併拉取請求之前由合適的人員查看。在某些情況下，這可能需要多人參與。在其他情況下，只需獲得一項實質批准即可合併程式碼。

source: In general, try not to merge things based on one review alone, especially if it is your own. Get a second opinion from another maintainer, and make sure all the teams that may be impacted have been reasonably represented by the reviewers. For example, if a pull request adds to the documentation, it's often useful to let the area maintainers check it for factual correctness and let documentation maintainers check it for formatting, style, and grammar.
de: Versuchen Sie im Allgemeinen nicht, Dinge aufgrund eines einzigen Reviews zu mergen, besonders wenn es Ihr eigenes ist. Holen Sie eine zweite Meinung von einem anderen Maintainer ein, und stellen Sie sicher, dass alle Teams, die davon betroffen sein könnten, durch die Reviewer angemessen vertreten sind. Wenn ein Pull Request zum Beispiel die Dokumentation erweitert, ist es oft sinnvoll, ihn von den Bereichs-Maintainern auf sachliche Korrektheit und von den Dokumentations-Maintainern auf Formatierung, Stil und Grammatik prüfen zu lassen.
zh_tw: 一般來說，盡量不要僅根據一項評論來合併內容，特別是如果它是您自己的。從另一位維護者那裡獲取第二意見，並確保所有可能受影響的團隊都得到了審核者的合理代表。例如，如果拉取請求新增到檔案中，那麼讓區域維護人員檢查它的事實正確性並讓檔案維護人員檢查它的格式、樣式和語法通常很有用。

source: A good rule of thumb is that at least one subject matter expert should have approved the pull request for correctness, and at least one other maintainer should have approved the pull request for code style. Either of those people could be the person merging the pull request.
de: Eine gute Faustregel ist, dass mindestens ein Fachexperte den Pull Request für die Korrektheit und mindestens ein anderer Maintainer den Pull Request für den Codestil genehmigt haben sollte. Jede dieser Personen könnte die Person sein, die den Pull Request mergen wird.
zh_tw: 一個好的經驗法則是，至少一名主題專家應該批准拉取請求的正確性，並且至少有一名其他維護人員應該批准拉取請求的程式碼樣式。這些人中的任何一個都可能是合併拉取請求的人。

source: Make sure that the reviews and approvals were left by people competent in that specific engine area. It is possible that even a long-standing member of the Godot organization left a review without having the relevant expertise.
de: Vergewissern Sie sich, dass die Reviews und Genehmigungen von Personen stammen, die in diesem speziellen Bereich der Engine kompetent sind. Es ist möglich, dass sogar ein langjähriges Mitglied der Godot-Organisation ein Review abgegeben hat, ohne über das entsprechende Fachwissen zu verfügen.
zh_tw: 確保審查和批准是由該特定引擎領域的主管人員留下的。即使是戈多組織的長期成員也有可能在不具備相關專業知識的情況下留下評論。

source: An easy way to find PRs that may be ready for merging is filtering by approved PRs and sorting by recently updated. For example, in the main Godot repository, you can use `this link <https://github.com/godotengine/godot/pulls?q=is%3Apr+is%3Aopen+review%3Aapproved+sort%3Aupdated-desc>`_.
de: Eine einfache Möglichkeit, PRs zu finden, die zum Mergen bereit sein könnten, ist das Filtern nach genehmigten PRs und das Sortieren nach "kürzlich aktualisiert". Im Godot-Haupt-Repository können Sie zum Beispiel `diesen Link <https://github.com/godotengine/godot/pulls?q=is%3Apr+is%3Aopen+review%3Aapproved+sort%3Aupdated-desc>`_ verwenden.
zh_tw: 尋找可能已準備好合併的 PR 的簡單方法是按已批准的 PR 進行篩選並按最近更新進行排序。例如，在主 Godot 儲存庫中，您可以使用「此連結 <https://github.com/godotengine/godot/pulls?q=is%3Apr+is%3Aopen+review%3Aapproved+sort%3Aupdated-desc> `_。

source: 2. Get feedback from the community
de: 2. Einholen von Feedback aus der Community
zh_tw: 2、從社區獲取回饋

source: If a pull request is having trouble attracting reviewers, you may need to reach out more broadly to ask for help reviewing. Consider asking:
de: Wenn ein Pull Request Schwierigkeiten hat, Reviewer anzuziehen, müssen Sie sich vielleicht breiter aufstellen und um Hilfe beim Reviewen bitten. Erwägen Sie folgenden Personen zu fragen:
zh_tw: 如果拉取請求難以吸引審閱者，您可能需要更廣泛地尋求協助進行審查。考慮詢問：

source: the person who reported the bug if the pull request fixes the bug for them,
de: die Person, die den Bug gemeldet hat, ob der Pull Request den Bug für sie behebt,
zh_tw: 如果拉取請求為他們修復了錯誤，則報告該錯誤的人，

source: contributors who have recently edited that file if they could take a look, or
de: Mitwirkende, die diese Datei kürzlich bearbeitet haben, ob sie einen Blick darauf werfen könnten, oder
zh_tw: 最近編輯過該檔案的貢獻者（如果他們可以看一下），或者

source: a more experienced maintainer from another area if they could provide feedback.
de: einen erfahreneren Maintainer aus einem anderen Bereich, ob dieser ein Feedback geben könnte.
zh_tw: 來自其他領域的更有經驗的維護人員（如果他們可以提供回饋）。

source: 3. Git checklist
de: 3. Git-Checkliste
zh_tw: 3、Git 注意事項

source: **Make sure that the PR comes in one commit.**
de: **Stellen Sie sicher, dass der PR in einem einzelnen Commit erstellt wird.**
zh_tw: **確保 PR 中只有一個提交。**

source: When each commit is self-contained and could be used to build a clean and working version of the engine, it may be okay to merge a pull request with multiple commits, but in general, we require that all pull requests only have one commit. This helps us keep the Git history clean.
de: Wenn jeder Commit in sich abgeschlossen ist und verwendet werden kann, um eine saubere und funktionierende Version der Engine zu erstellen, kann es in Ordnung sein, einen Pull Request mit mehreren Commits zu mergen, aber im Allgemeinen verlangen wir, dass alle Pull Requests nur einen Commit haben. Dies hilft uns, die Git-Historie sauber zu halten.
zh_tw: 當每個提交都是獨立的並且可用於建構引擎的乾淨且可工作的版本時，將一個拉取請求與多個提交合併可能是可以的，但一般來說，我們要求所有拉取請求只有一個提交。這有助於我們保持 Git 歷史記錄的乾淨。

source: **Fixes made during the review process must be squashed into the main commit.**
de: **Korrekturen, die während des Review-Prozesses vorgenommen werden, müssen in den Haupt-Commit gesquasht werden.**
zh_tw: **評審過程中作出的修改必須 Squash 到主提交中。**

source: For multi-commit PRs check that those fixes are amended in the relevant commits, and are not just applied on top of everything.
de: Bei PRs mit mehreren Commits sollten Sie darauf achten, dass die Korrekturen in die entsprechenden Commits integriert werden und nicht einfach oben draufgepackt werden.
zh_tw: 對於多提交 PR，請檢查這些修復是否在相關提交中進行了修改，而不僅僅是應用於所有內容。

source: **Make sure that the PR has no merge conflicts.**
de: **Stellen Sie sicher, dass der PR keine Merge-Konflikte hat.**
zh_tw: **確保 PR 沒有合併衝突。**

source: Contributors may need to rebase their changes on top of the relevant branch (e.g. ``master`` or ``3.x``) and manually fix merge conflicts. Even if there are no merge conflicts, contributors may need to rebase especially old PRs as the GitHub conflict checker may not catch all conflicts, or the CI may have changed since it was originally run.
de: Mitwirkende müssen ihre Änderungen möglicherweise auf den entsprechenden Branch (z.B. ``master`` oder ``3.x``) rebasen und Merge-Konflikte manuell beheben. Selbst wenn es keine Merge-Konflikte gibt, kann es sein, dass Mitwirkende vor allem alte PRs rebasen müssen, da der GitHub-Konflikt-Checker möglicherweise nicht alle Konflikte erkennt oder sich die CI seit der ursprünglichen Ausführung geändert hat.
zh_tw: 貢獻者可能需要在相關分支（例如“master”或“3.x”）之上重新調整其更改，並手動修復合併衝突。即使不存在合併衝突，貢獻者也可能需要重新設定特別是舊 PR 的基準，因為 GitHub 衝突屬性面板可能無法捕獲所有衝突，或者 CI 自最初運作以來可能已發生更改。

source: **Check for proper commit attribution.**
de: **Prüfen Sie, ob die Attribution des Commits korrekt ist.**
zh_tw: **檢查正確的提交歸屬。**

source: If a contributor uses an author signature that is not listed in their GitHub account, GitHub won't link the merged pull request to their account. This keeps them from getting proper credit in the GitHub history and makes them appear like a new contributor on the GitHub UI even after several contributions.
de: Wenn ein Mitwirkender eine Autorensignatur verwendet, die nicht in seinem GitHub-Konto aufgeführt ist, verknüpft GitHub den gemergten Pull Request nicht mit seinem Konto. Dies verhindert, dass er in der GitHub-Historie richtig gewürdigt wird, und lässt ihn auf der GitHub-Benutzeroberfläche selbst nach mehreren Beiträgen wie einen neuen Mitwirkenden erscheinen.
zh_tw: 如果貢獻者使用的作者簽章未在其 GitHub 帳戶中列出，則 GitHub 不會將合併的拉取請求連結到其帳戶。這使他們無法在 GitHub 歷史記錄中獲得適當的榮譽，並使他們在 GitHub UI 上看起來像新貢獻者，即使在多次貢獻之後也是如此。

source: Ultimately, it's up to the user if they want to fix it, but they can do so by authoring the Git commit with the same email they use for their GitHub account, or by adding the email they used for the Git commit to their GitHub profile.
de: Letztendlich bleibt es dem Benutzer überlassen, ob er das Problem beheben möchte, aber er kann dies tun, indem er den Git Commit mit der gleichen E-Mail verfasst, die er für sein GitHub-Konto verwendet, oder indem er die für den Git-Commit verwendete E-Mail zu seinem GitHub-Profil hinzufügt.
zh_tw: 最終，使用者是否想要修復該問題取決於使用者，但他們可以透過使用用於GitHub 帳戶的相同電子郵件來編寫Git 提交，或者將用於Git 提交的電子郵件新增到其GitHub 設定檔中來實作此目的。

source: **Check for proper commit messages.**
de: **Auf korrekte Commit-Messages achten.**
zh_tw: **檢查正確的提交消息。**

source: While we don't have a very strict ruleset for commit messages, we still require them to be short yet descriptive and use proper English. As a maintainer you've probably written them enough times to know how to make one, but for a general template think about *"Fix <issue> in <part of codebase>"*. For a more detailed recommendation see the `contributing.md <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#format-your-commit-messages-with-readability-in-mind>`_ page in the main Godot repository.
de: Wir haben zwar keine sehr strengen Regeln für Commit-Messages, aber wir verlangen trotzdem, dass sie kurz, aber aussagekräftig sind und korrektes Englisch verwenden. Als Maintainer haben Sie wahrscheinlich schon oft genug welche geschrieben, um zu wissen, wie man sie erstellt, eine allgemein gute Form wäre *"Fix <issue> in <part of codebase>"*. Für eine detailliertere Empfehlung siehe die Seite `contributing.md <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#format-your-commit-messages-with-readability-in-mind>`_ im Godot-Haupt-Repository.
zh_tw: 雖然我們沒有非常嚴格的提交訊息規則集，但我們仍然要求它們簡短而具有描述性，並使用正確的英語。作為維護者，您可能已經編寫了足夠的程式碼來了解如何製作它們，但對於通用模板，請考慮「修復<程式碼庫的一部分>中的<問題>」*。更詳細的建議，請參閱`contributing.md <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#format-your-commit-messages-with-readability-in-mind>` _ Godot 主儲存庫中的頁面。

source: 4. GitHub checklist
de: 4. GitHub-Checkliste
zh_tw: 4、GitHub 注意事項

source: **Validate the target branch of the PR.**
de: **Ziel-Branch des PR validieren.**
zh_tw: **確認 PR 的目標分支。**

source: Most Godot development happens around in the ``master`` branch. Therefore most pull requests must be made against it. From there pull requests can then be backported to other branches. Be wary of people making PRs on the version they are using (e.g, ``3.3``) and guide them to make a change against a higher-order branch (e.g. ``3.x``). If the change is not applicable for the ``master`` branch, the initial PR can be made against the current maintenance branch, such as ``3.x``. It's okay for people to make multiple PRs for each target branch, especially if the changes cannot be easily backported. Cherry-picking is also an option, if possible. Use the appropriate labels if the PR can be cherrypicked (e.g. ``cherrypick:3.x``).
de: Die meiste Godot-Entwicklung findet im ``master``-Branch statt. Daher müssen die meisten Pull Requests gegen diesen Branch gestellt werden. Von dort aus können Pull Requests dann auf andere Branches zurückportiert werden. Achten Sie auf Leute, die PRs für die Version machen, die sie benutzen (z.B. ``3.3``) und leiten Sie sie an, eine Änderung gegen einen höherwertigen Branch (z.B. ``3.x``) zu machen. Wenn die Änderung nicht für den ``master``-Branch gilt, kann der erste PR gegen den aktuellen Wartungs-Branch gemacht werden, wie ``3.x``. Es ist in Ordnung, wenn Leute mehrere PRs für jeden Ziel-Branch machen, besonders wenn die Änderungen nicht einfach zurückportiert werden können. Cherry-Picking ist auch eine Option, wenn möglich. Verwenden Sie die entsprechenden Labels, wenn der für den PR Cherrypicking möglich ist (z.B. ``cherrypick:3.x``).
zh_tw: 大多數 Godot 開發都發生在「master」分支。因此，大多數拉取請求必須針對它提出。然後，拉取請求可以從那裡向後移植到其他分支。警惕在他們正在使用的版本（例如“3.3”）上製作 PR 的人，並引導他們針對更高階的分支（例如“3.x”）進行更改。如果變更不適用於「master」分支，則可以針對目前維護分支（例如「3.x」）進行初始 PR。人們可以為每個目標分支建立多個 PR，特別是在變更無法輕鬆向後移植的情況下。如果可能的話，挑選櫻桃也是一種選擇。如果可以對 PR 進行挑選（例如“cherrypick:3.x”），請使用適當的標籤。

source: It is possible to change the target branch of the PR, that has already been submitted, but be aware of the consequences. As it cannot be synchronized with the push, the target branch change will inevitable tag the entire list of maintainers for review. It may also render the CI incapable of running properly. A push should help with that, but if nothing else, recommend opening a new, fresh PR.
de: Es ist möglich, den Ziel-Branch des PRs zu ändern, der bereits eingereicht wurde, aber seien Sie sich der Konsequenzen bewusst. Da sie nicht mit dem Push synchronisiert werden kann, wird die Änderung des Ziel-Branchs unweigerlich die gesamte Liste der Maintainer zum Reviewen markieren. Es kann auch dazu führen, dass die CI nicht mehr richtig läuft. Ein Push sollte hier Abhilfe schaffen, aber wenn nichts anderes hilft, sollten Sie einen neuen, frischen PR eröffnen.
zh_tw: 可以更改已提交的 PR 的目標分支，但請注意後果。由於無法與推送同步，目標分支的變更必然會標記整個維護者列表以供審核。它還可能導致 CI 無法正常運作。推動應該會有所幫助，但如果沒有別的辦法，建議開設一個新的 PR。

source: **Make sure that the appropriate milestone is assigned.**
de: **Vergewissern Sie sich, dass der entsprechende Milestone zugewiesen ist.**
zh_tw: **確保分配了合適的里程碑。**
