Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/pr_workflow.po
Languages: de

source: Pull request workflow
de: Workflow eines Pull Requests

source: The so-called "PR workflow" used by Godot is common to many projects using Git, and should be familiar to veteran free software contributors. The idea is that only a small number (if any) commit directly to the *master* branch. Instead, contributors *fork* the project (i.e. create a copy of it, which they can modify as they wish), and then use the GitHub interface to request a *pull* from one of their fork's branches to one branch of the original (often named *upstream*) repository.
de: Der so genannte "PR-Workflow", der von Godot verwendet wird, ist bei vielen Projekten, die Git verwenden, üblich und sollte erfahrenen Mitwirkenden an freier Software bekannt sein. Die Idee ist, dass nur eine kleine Anzahl von Personen (wenn überhaupt welche) direkt in den *master*-Branch einchecken. Stattdessen *forken* die Mitwirkenden das Projekt (d.h. sie erstellen eine Kopie davon, die sie nach Belieben verändern können), und verwenden dann die GitHub-Benutzeroberfläche, um einen *Pull* von einem der Branches ihres Forks in einen Branch des ursprünglichen (oft *upstream* genannten) Repositorys zu beantragen.

source: The resulting *pull request* (PR) can then be reviewed by other contributors, which might approve it, reject it, or most often request that modifications be done. Once approved, the PR can then be merged by one of the core developers, and its commit(s) will become part of the target branch (usually the *master* branch).
de: Der daraus resultierende *Pull Request* (PR) kann dann von anderen Mitwirkenden geprüft werden, die ihn genehmigen oder ablehnen können, oder meistens Änderungen verlangen. Sobald der PR genehmigt ist, kann er von einem der Kernentwickler gemergt werden, und seine Commits werden Teil des Ziel-Branchs (üblicherweise der *master*-Branch).

source: We will go together through an example to show the typical workflow and associated Git commands. But first, let's have a quick look at the organization of Godot's Git repository.
de: Wir werden gemeinsam ein Beispiel durchgehen, um den typischen Workflow und die zugehörigen Git-Befehle zu zeigen. Aber werfen wir zuerst einen kurzen Blick auf die Organisation von Godots Git-Repository.

source: Git source repository
de: Git Quellcode-Repository

source: The `repository on GitHub <https://github.com/godotengine/godot>`_ is a `Git <https://git-scm.com>`_ code repository together with an embedded issue tracker and PR system.
de: Das `Repository auf GitHub <https://github.com/godotengine/godot>`_ ist ein `Git <https://git-scm.com>`_ Code-Repository mit einem eingebetteten Issue-Tracker und einem PR-System.

source: If you are contributing to the documentation, its repository can be found `here <https://github.com/godotengine/godot-docs>`_.
de: Wenn Sie einen Beitrag zur Dokumentation leisten möchten, finden Sie das Repository `hier <https://github.com/godotengine/godot-docs>`_.

source: The Git version control system is the tool used to keep track of successive edits to the source code - to contribute efficiently to Godot, learning the basics of the Git command line is *highly* recommended. There exist some graphical interfaces for Git, but they usually encourage users to take bad habits regarding the Git and PR workflow, and we therefore recommend not to use them. In particular, we advise not to use GitHub's online editor for code contributions (although it's tolerated for small fixes or documentation changes) as it enforces one commit per file and per modification, which quickly leads to PRs with an unreadable Git history (especially after peer review).
de: Das Git-Versionskontrollsystem ist das Tool, mit dem aufeinanderfolgende Änderungen am Quellcode verfolgt werden. Um einen effizienten Beitrag zu Godot zu leisten, wird *dringend* empfohlen, die Grundlagen der Git-Kommandozeile zu erlernen. Es gibt einige grafische Oberflächen für Git, aber sie ermutigen Benutzer normalerweise, schlechte Gewohnheiten in Bezug auf den Git- und PR-Workflow anzunehmen. Wir empfehlen daher, diese nicht zu verwenden. Insbesondere empfehlen wir, den Online-Editor von GitHub nicht für Code-Beiträge zu verwenden (obwohl er für kleine Korrekturen oder Dokumentationsänderungen toleriert wird), da er ein Commit pro Datei und pro Änderung erzwingt, was schnell zu PRs mit einem unlesbaren Git-Verlauf führt (insbesondere nach einem Peer-Review).

source: The first sections of Git's "Book" are a good introduction to the tool's philosophy and the various commands you need to master in your daily workflow. You can read them online on the `Git SCM <https://git-scm.com/book/en/v2>`_ website. You can also try out `GitHub's interactive guide <https://try.github.io/>`__.
de: Die ersten Abschnitte des Git-"Buchs" sind eine gute Einführung in die Philosophie des Tools und die verschiedenen Befehle, die Sie in Ihrem täglichen Arbeitsablauf beherrschen müssen. Sie können sie online auf der Website von `Git SCM <https://git-scm.com/book/en/v2>`_ lesen. Sie können auch die `interaktiven Anleitung von GitHub <https://try.github.io/>`__ ausprobieren.

source: The branches on the Git repository are organized as follows:
de: Die Branches im Git-Repository sind wie folgt organisiert:

source: The ``master`` branch is where the development of the next major version occurs. As a development branch, it can be unstable and is not meant for use in production. This is where PRs should be done in priority.
de: Im ``master``-Branch findet die Entwicklung der nächsten Hauptversion statt. Als Entwicklungsbranch kann er instabil sein und ist nicht für den Einsatz in der Produktion vorgesehen. Hier sollten PRs vorrangig durchgeführt werden.

source: The stable branches are named after their version, e.g. ``3.1`` and ``2.1``. They are used to backport bugfixes and enhancements from the ``master`` branch to the currently maintained stable release (e.g. 3.1.2 or 2.1.6). As a rule of thumb, the last stable branch is maintained until the next minor version (e.g. the ``3.0`` branch was maintained until the release of Godot 3.1). If you want to make PRs against a maintained stable branch, please check first if your changes are also relevant for the ``master`` branch, and if so make the PR for the ``master`` branch in priority. Release managers can then cherry-pick the fix to a stable branch if relevant.
de: Die stable Branches sind nach ihrer Version benannt, z.B. ``3.1`` und ``2.1``. Sie werden verwendet, um Bugfixes und Verbesserungen aus dem ``master``-Branch in die aktuell gepflegte stable Version (z.B. 3.1.2 oder 2.1.6) zurückzuportieren. Als Faustregel gilt, dass der letzte stable Branch bis zur nächsten Minor-Version gepflegt wird (z.B. wurde der ``3.0``-Branch bis zur Veröffentlichung von Godot 3.1 gepflegt). Wenn Sie PRs gegen einen gepflegten stable Branch machen wollen, prüfen Sie bitte zuerst, ob Ihre Änderungen auch für den ``master``-Branch relevant sind, und wenn ja, geben Sie dem PR für den ``master``-Branch höhere Priorität. Die Release-Manager können dann die Korrektur für einen stable Branch cherry-picken, wenn dies relevant ist.

source: There might occasionally be feature branches, usually meant to be merged into the ``master`` branch at some time.
de: Es kann gelegentlich Feature-Branches geben, die normalerweise zu einem bestimmten Zeitpunkt in den ``master``-Branch integriert werden sollen.

source: Forking and cloning
de: Forking und Cloning

source: The first step is to *fork* the `godotengine/godot <https://github.com/godotengine/godot>`_ repository on GitHub. To do so, you will need to have a GitHub account and to be logged in. In the top right corner of the repository's GitHub page, you should see the "Fork" button as shown below:
de: Der erste Schritt besteht darin, das `godotengine/godot <https://github.com/godotengine/godot>`_ repository auf GitHub *zu forken*. Dazu benötigen Sie ein GitHub-Konto und müssen angemeldet sein. In der oberen rechten Ecke der GitHub-Seite des Repositorys sollten Sie den "Fork"-Button wie unten gezeigt sehen:

source: Click it, and after a while you should be redirected to your own fork of the Godot repo, with your GitHub username as namespace:
de: Klicken Sie darauf und nach einer Weile sollten Sie mit Ihrem GitHub-Benutzernamen als Namespace zu Ihrem eigenen Fork des Godot-Repos weitergeleitet werden:

source: You can then *clone* your fork, i.e. create a local copy of the online repository (in Git speak, the *origin remote*). If you haven't already, download Git from `its website <https://git-scm.com>`_ if you're using Windows or macOS, or install it through your package manager if you're using Linux.
de: Sie können dann Ihren Fork *klonen*, d.h. eine lokale Kopie des Online-Repositorys erstellen (in Git-Sprache den *Origin Remote*). Wenn Sie dies noch nicht getan haben, laden Sie Git von `der Website <https://git-scm.com>`_ herunter, wenn Sie Windows oder MacOS verwenden oder installieren Sie es über Ihren Paketmanager, wenn Sie Linux verwenden.

source: If you are on Windows, open Git Bash to type commands. macOS and Linux users can use their respective terminals.
de: Wenn Sie unter Windows arbeiten, öffnen Sie Git Bash um Befehle einzugeben. Benutzer von MacOS und Linux können ihre jeweiligen Terminals verwenden.

source: To clone your fork from GitHub, use the following command:
de: Verwenden Sie den folgenden Befehl, um Ihren Fork von GitHub zu klonen:

source: In our examples, the "$" character denotes the command line prompt on typical UNIX shells. It is not part of the command and should not be typed.
de: In unseren Beispielen kennzeichnet das Zeichen "$" die Eingabeaufforderung in typischen UNIX-Shells. Es ist nicht Teil des Befehls und sollte nicht eingegeben werden.

source: After a little while, you should have a ``godot`` directory in your current working directory. Move into it using the ``cd`` command:
de: Nach einer Weile sollten Sie ein ``Godot``-Verzeichnis in Ihrem aktuellen Arbeitsverzeichnis haben, in das Sie mit dem Befehl ``cd`` hineinwechseln können:

source: We will start by setting up a reference to the original repository that we forked:
de: Wir beginnen mit der Einrichtung eines Verweises auf das ursprüngliche Repository, das wir geforkt haben:

source: This will create a reference named ``upstream`` pointing to the original ``godotengine/godot`` repository. This will be useful when you want to pull new commits from its ``master`` branch to update your fork. You have another remote reference named ``origin``, which points to your fork (``USERNAME/godot``).
de: Dadurch wird eine Referenz mit dem Namen ``Upstream`` erstellt, die auf das ursprüngliche ``Godotengine/Godot``-Repository verweist. Dies ist nützlich, wenn Sie neue Commits aus dem ``master``-Branch ziehen möchten, um Ihren Fork zu aktualisieren. Sie haben eine weitere Remote-Referenz namens ``origin``, die auf Ihren Fork zeigt (``USERNAME/godot``).

source: You only need to do the above steps once, as long as you keep that local ``godot`` folder (which you can move around if you want, the relevant metadata is hidden in its ``.git`` subfolder).
de: Sie müssen die obigen Schritte nur einmal ausführen, solange Sie den lokalen ``godot``-Ordner behalten (den Sie nach Belieben verschieben können; die relevanten Metadaten sind in seinem ``.git``-Unterordner versteckt).

source: This bad take on Daft Punk's *Technologic* shows the general conception Git beginners have of its workflow: lots of strange commands to learn by copy and paste, hoping they will work as expected. And that's actually not a bad way to learn, as long as you're curious and don't hesitate to question your search engine when lost, so we will give you the basic commands to know when working in Git.
de: Diese schlechte Interpretation von Daft Punks *Technologic* zeigt die allgemeine Vorstellung, die Git-Anfänger von seinem Workflow haben: viele seltsame Befehle, die man durch Kopieren und Einfügen lernen muss, in der Hoffnung, dass sie wie erwartet funktionieren werden. Und das ist eigentlich keine schlechte Art zu lernen, solange man neugierig ist und nicht zögert, seine Suchmaschine zu befragen, wenn man sich verirrt hat, also geben wir Ihnen die grundlegenden Befehle, die man bei der Arbeit mit Git kennen sollte.

source: In the following, we will assume as an example that you want to implement a feature in Godot's Project Manager, which is coded in the ``editor/project_manager.cpp`` file.
de: Im Folgenden nehmen wir als Beispiel an, dass Sie ein Feature in Godots Projektmanager implementieren wollen, die in der Datei ``editor/project_manager.cpp`` programmiert ist.

source: Branching
de: Branches erzeugen

source: By default, the ``git clone`` should have put you on the ``master`` branch of your fork (``origin``). To start your own feature development, we will create a feature branch:
de: Standardmäßig sollte ``git clone`` Sie auf den ``master``-Branch Ihres Forks (``origin``) gebracht haben. Um mit der Entwicklung Ihrer eigenen Features zu beginnen, werden wir einen Feature-Branch erstellen:

source: This command is equivalent:
de: Dieser Befehl macht das gleiche wie oben:

source: If you want to go back to the ``master`` branch, you'd use:
de: Wenn Sie zum ``master``-Branch zurückkehren möchten, verwenden Sie:

source: You can see which branch you are currently on with the ``git branch`` command:
de: Mit dem Befehl ``git branch`` können Sie sehen, auf welchem Branch Sie sich gerade befinden:

source: Be sure to always go back to the ``master`` branch before creating a new branch, as your current branch will be used as the base for the new one. Alternatively, you can specify a custom base branch after the new branch's name:
de: Stellen Sie sicher, dass Sie immer zum ``master``-Branch zurückkehren, bevor Sie einen neuen Branch erstellen, da Ihr aktueller Branch als Basis für den neuen Branch verwendet wird. Alternativ können Sie nach dem Namen des neuen Branchs einen benutzerdefinierten Basis-Branch angeben:

source: Updating your branch
de: Ihren Branch aktualisieren

source: This would not be needed the first time (just after you forked the upstream repository). However, the next time you want to work on something, you will notice that your fork's ``master`` is several commits behind the upstream ``master`` branch: pull requests from other contributors would have been merged in the meantime.
de: Das wäre beim ersten Mal (kurz nachdem Sie das Upstream-Repository geforkt haben) nicht nötig. Wenn Sie jedoch das nächste Mal an etwas arbeiten wollen, werden Sie feststellen, dass der ``master``-Branch Ihres Forks mehrere Commits hinter dem ``master``-Branch des Upstreams liegt: Pull Requests von anderen Mitwirkenden wären in der Zwischenzeit gemergt worden.

source: To ensure there won't be conflicts between the feature you develop and the current upstream ``master`` branch, you will have to update your branch by *pulling* the upstream branch.
de: Um sicherzustellen, dass es keine Konflikte zwischen dem von Ihnen entwickelten Feature und dem aktuellen Upstream ``master``-Branch gibt, müssen Sie Ihren Branch aktualisieren, indem Sie den Upstream-Branch *pullen*.

source: The ``--rebase`` argument will ensure that any local changes that you committed will be re-applied *on top* of the pulled branch, which is usually what we want in our PR workflow. This way, when you open a pull request, your own commits will be the only difference with the upstream ``master`` branch.
de: Das Argument ``--rebase`` stellt sicher, dass alle lokalen Änderungen, die Sie vorgenommen haben, *oben auf* den gepullten Branch angewendet werden, was normalerweise das ist, was wir in unserem PR-Workflow wollen. Auf diese Weise werden, wenn Sie einen Pull Request öffnen, Ihre eigenen Commits der einzige Unterschied zum Upstream ``master``-Branch sein.

source: While rebasing, conflicts may arise if your commits modified code that has been changed in the upstream branch in the meantime. If that happens, Git will stop at the conflicting commit and will ask you to resolve the conflicts. You can do so with any text editor, then stage the changes (more on that later), and proceed with ``git rebase --continue``. Repeat the operation if later commits have conflicts too, until the rebase operation completes.
de: Während des Rebasings können Konflikte auftreten, wenn Ihre Commits Code ändern, der in der Zwischenzeit im Upstream-Branch geändert worden ist. In diesem Fall hält Git bei dem Commit, der den Konflikt verursacht, an und fordert Sie auf, die Konflikte zu lösen. Sie können dies mit einem beliebigen Texteditor tun, dann die Änderungen stagen (mehr dazu später) und mit ``git rebase --continue`` fortfahren. Wiederholen Sie den Vorgang, wenn spätere Commits ebenfalls Konflikte aufweisen, bis der Rebase-Vorgang abgeschlossen ist.

source: If you're unsure about what is going on during a rebase and you panic (no worry, we all do the first few times), you can abort the rebase with ``git rebase --abort``. You will then be back to the original state of your branch before calling ``git pull --rebase``.
de: Wenn Sie sich nicht sicher sind, was während eines rebase passiert und Sie in Panik geraten (keine Sorge, das tun wir alle bei den ersten paar Malen), können Sie den rebase mit ``git rebase --abort`` abbrechen. Sie sind dann wieder in dem ursprünglichen Zustand Ihres Branches, bevor Sie ``git pull --rebase`` aufgerufen haben.

source: If you omit the ``--rebase`` argument, you will instead create a merge commit which tells Git what to make of the two distinct branches. If any conflicts arise, they would be resolved all at once via this merge commit.
de: Wenn Sie das Argument ``--rebase`` weglassen, erzeugen Sie stattdessen einen Merge-Commit, der Git mitteilt, was es aus den beiden unterschiedlichen Branches machen soll. Sollten Konflikte auftreten, würden sie durch diesen Merge-Commit auf einmal aufgelöst werden.

source: While this is a valid workflow and the default behavior of ``git pull``, merge commits within PRs are frowned upon in our PR workflow. We only use them when merging PRs into the upstream branch.
de: Während dies ein gültiger Workflow und das Standardverhalten von ``git pull`` ist, sind Merge-Commits innerhalb von PRs in unserem PR-Workflow verpönt. Wir verwenden sie nur beim Mergen von PRs in den Upstream-Branch.

source: The philosophy is that a PR should represent the final stage of the changes made to the codebase, and we are not interested in mistakes and fixes that would have been done in intermediate stages before merging. Git gives us great tools to "rewrite the history" and make it as if we got things right the first time, and we're happy to use it to ensure that changes are easy to review and understand long after they have been merged.
de: Die Philosophie ist, dass ein PR die letzte Stufe der Änderungen an der Codebasis darstellen sollte, und wir sind nicht an Fehlern und Korrekturen interessiert, die in Zwischenstufen vor dem Mergen gemacht worden wären. Git gibt uns großartige Werkzeuge, um "die Geschichte umzuschreiben" und es so aussehen zu lassen, als ob wir die Dinge beim ersten Mal richtig gemacht hätten, und wir nutzen sie gerne, um sicherzustellen, dass Änderungen noch lange nach dem Mergen einfach zu überprüfen und zu verstehen sind.

source: If you have already created a merge commit without using ``rebase``, or have made any other changes that have resulted in undesired history, the best option is to use an *interactive rebase* on the upstream branch. See the :ref:`dedicated section <doc_pr_workflow_rebase>` for instructions.
de: Wenn Sie bereits einen Merge-Commit erstellt haben, ohne ``rebase`` zu verwenden, oder andere Änderungen vorgenommen haben, die zu einem unerwünschten Verlauf geführt haben, ist die beste Option, ein *interaktives Rebase* auf dem Upstream-Branch zu anzuwenden. Siehe den :ref:`entsprechenden Abschnitt <doc_pr_workflow_rebase>` für Hinweise.

source: If at any time you want to *reset* a local branch to a given commit or branch, you can do so with ``git reset --hard <commit ID>`` or ``git reset --hard <remote>/<branch>`` (e.g. ``git reset --hard upstream/master``).
de: Wenn Sie zu irgendeinem Zeitpunkt einen lokalen Branch auf einen bestimmten Commit oder Branch *zurücksetzen* wollen, können Sie dies mit ``git reset --hard <commit ID>`` oder ``git reset --hard <remote>/<branch>`` (z.B. ``git reset --hard upstream/master``) tun.

source: Be warned that this will remove any changes that you might have committed in this branch. If you ever lose commits by mistake, use the ``git reflog`` command to find the commit ID of the previous state that you would like to restore, and use it as argument of ``git reset --hard`` to go back to that state.
de: Seien Sie gewarnt, dass dadurch alle Änderungen entfernt werden, die Sie in diesem Branch möglicherweise vorgenommen haben. Sollten Sie jemals versehentlich Commits verlieren, verwenden Sie den Befehl ``git reflog``, um die Commit-ID des vorherigen Zustands zu finden, den Sie wiederherstellen möchten, und verwenden Sie diese als Argument von ``git reset --hard``, um zu diesem Zustand zurückzukehren.

source: Making changes
de: Änderungen vornehmen

source: You would then do your changes to our example's ``editor/project_manager.cpp`` file with your usual development environment (text editor, IDE, etc.).
de: Sie würden dann Ihre Änderungen an unserer Beispieldatei ``editor/project_manager.cpp`` mit Ihrer üblichen Entwicklungsumgebung (Texteditor, IDE usw.) vornehmen.

source: By default, those changes are *unstaged*. The staging area is a layer between your working directory (where you make your modifications) and the local Git repository (the commits and all the metadata in the ``.git`` folder). To bring changes from the working directory to the Git repository, you need to *stage* them with the ``git add`` command, and then to commit them with the ``git commit`` command.
de: Standardmäßig sind diese Änderungen *unstaged*. Der Staging-Bereich ist eine Schicht zwischen Ihrem Arbeitsverzeichnis (wo Sie Ihre Änderungen vornehmen) und dem lokalen Git-Repository (die Commits und alle Metadaten im Ordner ``.git``). Um Änderungen aus dem Arbeitsverzeichnis in das Git-Repository zu bringen, müssen Sie sie mit dem Befehl ``git add`` *stagen* und anschließend mit dem Befehl ``git commit`` committen.

source: There are various commands you should know to review your current work, before staging it, while it is staged, and after it has been committed.
de: Es gibt verschiedene Befehle, die Sie kennen sollten, um Ihre aktuelle Arbeit zu überprüfen, bevor sie gestaged wird, während sie gestaged wird und nachdem sie commited wurde.

source: ``git diff`` will show you the current unstaged changes, i.e. the differences between your working directory and the staging area.
de: ``git diff`` zeigt Ihnen die aktuellen nicht gestageten Änderungen an, d.h. die Unterschiede zwischen Ihrem Arbeitsverzeichnis und dem Staging-Bereich.

source: ``git checkout -- <files>`` will undo the unstaged changes to the given files.
de: ``git checkout -- <files>`` macht die nicht gestageten Änderungen an den angegebenen Dateien rückgängig.

source: ``git add <files>`` will *stage* the changes on the listed files.
de: ``git add <files>`` *staget* die Änderungen an den aufgelisteten Dateien.

source: ``git diff --staged`` will show the current staged changes, i.e. the differences between the staging area and the last commit.
de: ``git diff --staged`` zeigt die aktuell gestageten Änderungen an, d.h. die Unterschiede zwischen dem Staging-Bereich und dem letzten Commit.
