Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/pr_workflow.po
Languages: de

source: ``git reset HEAD <files>`` will *unstage* changes to the listed files.
de: ``git reset HEAD <files>`` *nimmt das Stagen* von Änderungen an den aufgelisteten Dateien *zurück*.

source: ``git status`` will show you what are the currently staged and unstaged modifications.
de: ``git status`` zeigt Ihnen die aktuell gestageten und nicht gestageten Änderungen an.

source: ``git commit`` will commit the staged files. It will open a text editor (you can define the one you want to use with the ``GIT_EDITOR`` environment variable or the ``core.editor`` setting in your Git configuration) to let you write a commit log. You can use ``git commit -m "Cool commit log"`` to write the log directly.
de: ``git commit`` *committet* die gestageten Dateien. Öffnet einen Texteditor (Sie können den gewünschten Editor mit der Umgebungsvariablen ``GIT_EDITOR`` oder der Einstellung ``core.editor`` in Ihrer Git-Konfiguration definieren), damit Sie ein Commit-Log schreiben können. Sie können ``git commit -m "Cooles Commit-Log"`` verwenden, um das Log direkt zu schreiben.

source: ``git commit --amend`` lets you amend the last commit with your currently staged changes (added with ``git add``). This is the best option if you want to fix a mistake in the last commit (bug, typo, style issue, etc.).
de: Mit ``git commit --amend`` können Sie den letzten Commit mit Ihren aktuellen Änderungen (hinzugefügt mit ``git add``) ergänzen. Dies ist die beste Option, wenn Sie einen Fehler im letzten Commit beheben wollen (Bugs, Tippfehler, Stilprobleme, etc.).

source: ``git log`` will show you the last commits of your current branch. If you did local commits, they should be shown at the top.
de: ``git log`` zeigt Ihnen die letzten Commits Ihres aktuellen Branchs an. Wenn Sie lokale Commits vorgenommen haben, müssten diese ganz oben angezeigt werden.

source: ``git show`` will show you the changes of the last commit. You can also specify a commit hash to see the changes for that commit.
de: ``git show`` zeigt Ihnen die Änderungen des letzten Commits an. Sie können auch einen Commit-Hash angeben, um die Änderungen für diesen Commit zu sehen.

source: That's a lot to memorize! Don't worry, just check this cheat sheet when you need to make changes, and learn by doing.
de: Das ist eine Menge zum Auswendiglernen! Keine Sorge, schauen Sie einfach auf diesem Spickzettel nach, wenn Sie Änderungen vornehmen müssen, und prägen Sie es sich durch wiederholtes Anwenden ein.

source: Here's how the shell history could look like on our example:
de: So könnte die Shell-Historie in unserem Beispiel aussehen:

source: With this, we should have two new commits in our ``better-project-manager`` branch which were not in the ``master`` branch. They are still only local though, the remote fork does not know about them, nor does the upstream repo.
de: Damit sollten wir zwei neue Commits in unserem ``better-project-manager``-Branch haben, die nicht im ``master``-Branch waren. Sie sind aber immer noch nur lokal - der entfernte Fork kennt sie nicht, ebenso wenig wie das Upstream-Repository.

source: Pushing changes to a remote
de: Änderungen auf einen Remote-Rechner pushen

source: That's where ``git push`` will come into play. In Git, a commit is always done in the local repository (unlike Subversion where a commit will modify the remote repository directly). You need to *push* the new commits to a remote branch to share them with the world. The syntax for this is:
de: An dieser Stelle kommt ``git push`` ins Spiel. In Git wird ein Commit immer im lokalen Repository durchgeführt (im Gegensatz zu Subversion, wo ein Commit direkt das Remote-Repository verändert). Sie müssen die neuen Commits in einen Remote-Branch *pushen*, um sie mit der Welt zu teilen. Die Syntax dafür ist:

source: The part about the remote branch can be omitted if you want it to have the same name as the local branch, which is our case in this example, so we will do:
de: Der Teil mit dem Remote-Branch kann weggelassen werden, wenn Sie möchten, dass er denselben Namen wie der lokale Branch hat. Dies ist in diesem Beispiel der Fall. Wir werden also Folgendes tun:

source: Git will ask you for your username and password. For your password, enter your GitHub Personal Access Token (PAT). If you do not have a GitHub Personal Access Token, or do not have one with the correct permissions for your newly forked repository, you will need to create one. Follow this link to create your Personal Access Token: `Creating a personal access token <https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token>`_.
de: Git fragt Sie nach Ihrem Benutzernamen und Passwort. Geben Sie für Ihr Passwort Ihr GitHub Personal Access Token (PAT) ein. Wenn Sie kein GitHub Personal Access Token haben oder keins mit den richtigen Berechtigungen für Ihr neu geforktes Repository, müssen Sie eines erstellen. Folgen Sie diesem Link, um Ihr persönliches Zugriffstoken zu erstellen: `Verwalten deiner persönlichen Zugriffstoken <https://docs.github.com/de/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token>`_.

source: After you have successfully verified your account using your PAT, the changes will be sent to your remote repository. If you check the fork's page on GitHub, you should see a new branch with your added commits.
de: Git wird Sie nach Ihrem Benutzernamen und Kennwort fragen, und die Änderungen werden an Ihr Remote-Repository gesendet. Wenn Sie die Seite des Forks auf GitHub überprüfen, sollten Sie einen neuen Branch mit Ihren hinzugefügten Commits sehen.

source: Issuing a pull request
de: Einen Pull Request aufsetzen

source: When you load your fork's branch on GitHub, you should see a line saying *"This branch is 2 commits ahead of godotengine:master."* (and potentially some commits behind, if your ``master`` branch was out of sync with the upstream ``master`` branch).
de: Wenn Sie den Branch Ihres Forks auf GitHub laden, sollten Sie eine Zeile sehen, die sagt *"This branch is 2 commits ahead of godotengine:master."* (und möglicherweise einige Commits dahinter, wenn Ihr ``master``-Branch nicht mit dem Upstream-Branch ``master`` synchronisiert war).

source: On that line, there is a "Pull request" link. Clicking it will open a form that will let you issue a pull request on the ``godotengine/godot`` upstream repository. It should show you your two commits, and state "Able to merge". If not (e.g. it has way more commits, or says there are merge conflicts), don't create the PR yet, something went wrong. Go to our `Godot Contributors Chat <https://chat.godotengine.org/>`_ and ask for support :)
de: In dieser Zeile befindet sich ein "Pull request"-Link. Wenn Sie darauf klicken, öffnet sich ein Formular, mit dem Sie einen Pull Request für das ``godotengine/godot`` Upstream-Repository erstellen können. Es sollte Ihnen Ihre beiden Commits zeigen und "Able to merge" anzeigen. Wenn das nicht der Fall ist (z.B. weil es viel mehr Commits hat oder weil es Merge-Konflikte gibt), erstellen Sie den PR noch nicht, irgendetwas ist schief gelaufen. Gehen Sie zu unserem `Godot-Mitwirkenden-Chat <https://chat.godotengine.org/>`_ und bitten Sie um Unterstützung :)

source: Use an explicit title for the PR and put the necessary details in the comment area. You can drag and drop screenshots, GIFs or zipped projects if relevant, to showcase what your work implements. Click "Create a pull request", and tadaa!
de: Verwenden Sie einen eindeutigen Titel für den PR und geben Sie die notwendigen Details im Kommentarbereich an. Sie können Screenshots, GIFs oder gezippte Projekte per Drag & Drop einfügen, um zu zeigen, was Ihr Beitrag beinhaltet. Klicken Sie auf "Create a pull request" und tadaa!

source: Modifying a pull request
de: Einen Pull Request verändern

source: While it is reviewed by other contributors, you will often need to make changes to your yet-unmerged PR, either because contributors requested them, or because you found issues yourself while testing.
de: Während er von anderen Mitwirkenden gereviewt wird, müssen Sie häufig Änderungen an Ihrem noch nicht gemergten PR vornehmen, entweder weil die Mitwirkenden darum gebeten haben oder weil Sie beim Testen selbst Probleme festgestellt haben.

source: The good news is that you can modify a pull request simply by acting on the branch you made the pull request from. You can e.g. make a new commit on that branch, push it to your fork, and the PR will be updated automatically:
de: Die gute Nachricht ist, dass Sie einen Pull Request ändern können, indem Sie einfach auf dem Branch arbeiten, von dem aus Sie den Pull Request gestellt haben. Sie können z.B. einen neuen Commit für diesen Branch erstellen, ihn auf Ihren Fork pushen, und der PR wird automatisch aktualisiert:

source: However, be aware that in our PR workflow, we favor commits that bring the codebase from one functional state to another functional state, without having intermediate commits fixing up bugs in your own code or style issues. Most of the time, we will prefer a single commit in a given PR (unless there's a good reason to keep the changes separate). Instead of authoring a new commit, consider using ``git commit --amend`` to amend the previous commit with your fixes. The above example would then become:
de: Seien Sie sich jedoch bewusst, dass wir in unserem PR-Workflow Commits bevorzugen, die unsere Codebasis von einem funktionalen Zustand in einen anderen funktionalen Zustand bringen, ohne dass es Zwischen-Commits gibt, die Bugs in Ihrem eigenen Code oder Stilprobleme beheben. In den meisten Fällen bevorzugen wir einen einzigen Commit in einem bestimmten PR (es sei denn, es gibt einen guten Grund, die Änderungen getrennt zu halten). Anstatt einen neuen Commit zu erstellen, sollten Sie ``git commit --amend`` verwenden, um den vorherigen Commit mit Ihren Korrekturen zu ergänzen. Das obige Beispiel würde dann so aussehen:

source: The interactive rebase
de: Das interaktive Rebase

source: Indeed, if some commits have been made following reviews to fix bugs, typos, etc. in the original commit, they are not relevant to a future changelog reader who would want to know what happened in the Godot codebase, or when and how a given file was last modified.
de: Wenn nämlich einige Commits nach Reviews vorgenommen wurden, um Bugs, Tippfehler usw. im ursprünglichen Commit zu beheben, sind sie für einen zukünftigen Leser des Change-Log, der wissen möchte, was in der Godot-Codebasis geschehen ist, oder wann und wie eine bestimmte Datei zuletzt geändert wurde, nicht relevant.

source: To squash those extraneous commits into the main one, we will have to *rewrite history*. Right, we have that power. You may read that it's a bad practice, and it's true when it comes to branches of the upstream repo. But in your fork, you can do whatever you want, and everything is allowed to get neat PRs :)
de: Um diese fremden Commits in die Haupt-Commits zu vereinen, müssen wir *die Geschichte umschreiben*. Richtig, wir haben diese Macht. Sie haben vielleicht schonmal gelesen, dass es eine schlechte Praxis sei, und das stimmt auch, wenn es um Branches des Upstream-Repos geht. Aber in Ihrem Fork können Sie machen was Sie wollen, und alles ist erlaubt, um ordentliche PRs zu bekommen :)

source: We will use the *interactive rebase* ``git rebase -i`` to do this. This command takes a commit ID or a branch name as argument, and will let you modify all commits between that commit/branch and the last one in your working branch, the so-called ``HEAD``.
de: Wir werden dazu das *interaktive Rebase* ``git rebase -i`` verwenden. Dieser Befehl nimmt eine Commit-ID oder einen Branch-Namen als Argument und lässt Sie alle Commits zwischen diesem Commit/Branch und dem letzten in Ihrem Arbeits-Branch, dem sogenannten ``HEAD``, ändern.

source: While you can give any commit ID to ``git rebase -i`` and review everything in between, the most common and convenient workflow involves rebasing on the upstream ``master`` branch, which you can do with:
de: Sie können zwar eine beliebige Commit-ID an ``git rebase -i`` übergeben und alles, was dazwischen liegt, reviewen, aber der gängigste und bequemste Workflow beinhaltet das Rebasen auf den Upstream-Branch ``master``, was Sie wie folgt machen können:

source: Referencing branches in Git is a bit tricky due to the distinction between remote and local branches. Here, ``upstream/master`` (with a `/`) is a local branch which has been pulled from the ``upstream`` remote's ``master`` branch.
de: Das Referenzieren von Branches in Git ist ein wenig knifflig, wegen der Unterscheidung zwischen Remote- und lokalen Branches. Hier ist ``upstream/master`` (mit einem `/`) ein lokaler Branch, der aus dem ``master``-Branch des Remote-``upstream`` gezogen wurde.

source: Interactive rebases can only be done on local branches, so the `/` is important here. As the upstream remote changes frequently, your local ``upstream/master`` branch may become outdated, so you can update it with ``git fetch upstream master``. Contrarily to ``git pull --rebase upstream master`` which would update your currently checked out branch, ``fetch`` will only update the ``upstream/master`` reference (which is distinct from your local ``master`` branch... yes it's confusing, but you'll become familiar with this little by little).
de: Interaktive Rebases können nur auf lokalen Branches durchgeführt werden, daher ist das `/` hier wichtig. Da sich der Upstream-Branch häufig ändert, kann Ihr lokaler ``upstream/master``-Branch veraltet sein, so dass Sie ihn mit ``git fetch upstream master`` aktualisieren können. Im Gegensatz zu ``git pull --rebase upstream master``, das Ihren aktuell ausgecheckten Branch aktualisieren würde, wird ``fetch`` nur die ``upstream/master``-Referenz aktualisieren (die sich von Ihrem lokalen ``master``-Branch unterscheidet... ja, es ist verwirrend, aber Sie werden sich nach und nach daran gewöhnen).

source: This will open a text editor (``vi`` by default, see `Git docs <https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_core_editor>`_ to configure your favorite one) with something which may look like this:
de: Dies öffnet einen Texteditor (standardmäßig ``vi``, siehe `Git docs <https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_core_editor>`_ um Ihren Lieblingseditor zu konfigurieren) mit etwas, das so aussehen könnte:

source: The editor will also show instructions regarding how you can act on those commits. In particular, it should tell you that "pick" means to use that commit (do nothing), and that "squash" and "fixup" can be used to *meld* the commit in its parent commit. The difference between "squash" and "fixup" is that "fixup" will discard the commit log from the squashed commit. In our example, we are not interested in keeping the log of the "Fix a typo" commit, so we use:
de: Der Editor zeigt auch Anweisungen an, wie Sie auf diese Commits reagieren können. Insbesondere sollte er Ihnen sagen, dass "pick" bedeutet, diesen Commit zu verwenden (nichts tun), und dass "squash" und "fixup" verwendet werden können, um den Commit in seinen Parent-Commit *zu verschmelzen*. Der Unterschied zwischen "squash" und "fixup" ist, dass "fixup" das Commit-Log des gesquashten Commits verwirft. In unserem Beispiel sind wir nicht daran interessiert, das Log des "Fix a typo"-Commits zu behalten, also verwenden wir:

source: Upon saving and quitting the editor, the rebase will occur. The second commit will be melded into the first one, and ``git log`` and ``git show`` should now confirm that you have only one commit with the changes from both previous commits.
de: Nach dem Speichern und Beenden des Editors wird der Rebase durchgeführt. Der zweite Commit wird mit dem ersten verschmolzen, und ``git log`` und ``git show`` sollten nun bestätigen, dass Sie nur einen Commit mit den Änderungen der beiden vorherigen Commits haben.

source: But! You rewrote the history, and now your local and remote branches have diverged. Indeed, commit 1b4aad7 in the above example will have changed, and therefore got a new commit hash. If you try to push to your remote branch, it will raise an error:
de: Aber! Sie haben die Historie umgeschrieben, und nun sind Ihr lokaler und der Remote-Branch auseinandergeklafft. In der Tat hat sich Commit 1b4aad7 im obigen Beispiel geändert und daher einen neuen Commit-Hash erhalten. Wenn Sie versuchen, zu Ihrem Remote-Branch zu pushen, wird dies einen Fehler auslösen:

source: And tadaa! Git will happily *replace* your remote branch with what you had locally (so make sure that's what you wanted, using ``git log``). This will also update the PR accordingly.
de: Und tadaa! Git wird fröhlich den Remote-Branch mit dem *ersetzen*, was Sie lokal hatten (stellen Sie also sicher, dass es das ist, was Sie wollten, indem Sie ``git log`` benutzen). Dies wird auch die PRs entsprechend aktualisieren.

source: Deleting a Git branch
de: Löschen eines Git-Branchs

source: After your pull request gets merged, there's one last thing you should do: delete your Git branch for the PR. There won't be issues if you don't delete your branch, but it's good practice to do so. You'll need to do this twice, once for the local branch and another for the remote branch on GitHub.
de: Nachdem Ihr Pull Request gemergt wurde, sollten Sie noch etwas tun: Löschen Sie Ihren Git-Branch für den PR. Es ist kein Problem, wenn Sie Ihren Branch nicht löschen, aber es wird empfohlen, dies zu tun. Sie müssen dies zweimal tun, einmal für den lokalen Branch und einmal für den Remote-Branch auf GitHub.

source: To delete our better Project Manager branch locally, use this command:
de: Um unseren better-project-manager-Branch lokal zu löschen, verwenden Sie diesen Befehl:

source: Alternatively, if the branch hadn't been merged yet and we wanted to delete it anyway, instead of ``-d`` you would use ``-D``.
de: Wenn der Branch noch nicht gemergt wurde und wir ihn trotzdem löschen wollen, würden Sie ``-D`` statt ``-d`` verwenden.

source: Next, to delete the remote branch on GitHub use this command:
de: Verwenden Sie als nächstes den folgenden Befehl, um den Remote-Branch auf GitHub zu löschen:

source: You can also delete the remote branch from the GitHub PR itself, a button should appear once it has been merged or closed.
de: Sie können den Remote-Branch auch aus dem GitHub PR selbst löschen. Nach dem Mergen oder Schließen sollte dort ein Button angezeigt werden.

source: Translation status
de: Übersetzungsstatus
