Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/testing_pull_requests.po
Languages: de, zh_tw

source: Testing pull requests
de: Testen von Pull Requests
zh_tw: 開啟 PR

source: Many people are developing new features or fixing bugs on GitHub. To help with engine development, you may be asked to test those pull requests with a Godot build that includes code from the pull request in question.
de: Viele Leute entwickeln neue Features oder beheben Bugs auf GitHub. Um bei der Engine-Entwicklung zu helfen, werden Sie möglicherweise gebeten, diese Pull Requests mit einem Godot-Build zu testen, der Code aus dem betreffenden Pull Request enthält.
zh_tw: 許多人正在GitHub上開發新功能或修復錯誤。為了説明引擎開發，你可能會被要求用Godot建構來測試這些拉取請求，該建構包括有關拉取請求中的程式碼。

source: Thanks to GitHub Actions, all `pull requests <https://github.com/godotengine/godot/pulls>`__ have continuous builds available. These builds let you try out pull requests without having to compile anything from source.
de: Dank GitHub Actions sind für alle `Pull Requests <https://github.com/godotengine/godot/pulls>`__ Continuous Builds verfügbar. Mit diesen Builds können Sie Pull Requests ausprobieren, ohne selbst den Quellcode kompilieren zu müssen.
zh_tw: 感謝GitHub Actions，所有的 `拉取請求pull requests <https://github.com/godotengine/godot/pulls>`__ 都有持續建構。這些建構可以讓你嘗試拉取請求，而不需要從原始程式碼編譯任何東西。

source: Downloading a compiled build
de: Herunterladen eines kompilierten Builds
zh_tw: 下載編譯後的版本

source: You can download pull request builds from GitHub Actions. Since only signed in users may download builds directly from GitHub Actions, the procedure varies depending on whether you have a GitHub account or not.
de: Sie können Pull Request-Builds von GitHub Actions herunterladen. Da nur angemeldete Benutzer Builds direkt von GitHub Actions herunterladen können, variiert die Vorgehensweise, je nachdem, ob Sie ein GitHub-Konto haben oder nicht.
zh_tw: 你可以從GitHub Actions中下載拉取請求建構。由於只有已登錄的使用者可以直接從GitHub Actions下載建構，因此根據你是否有GitHub帳戶，程式會有所不同。

source: Due to a GitHub Actions limitation, builds are only available for 90 days after the pull request was last updated. If you still wish to try a pull request locally, you can :ref:`compile the pull request branch from source <doc_testing_pull_requests_compile>` instead.
de: Aufgrund einer Einschränkung der GitHub-Aktionen sind Builds nur für 90 Tage nach der letzten Aktualisierung der Pull Request verfügbar. Wenn Sie einen Pull Request dennoch lokal ausprobieren möchten, können Sie stattdessen :ref:`den Pull Request-Branch aus dem Quellcode kompilieren <doc_testing_pull_requests_compile>`.
zh_tw: 由於GitHub Actions的限制，建構只在拉取請求最後更新後的90天內可用。如果你仍然希望在本地嘗試拉取請求，你可以 :ref:`從原始程式碼編譯拉取請求 <doc_testing_pull_requests_compile>` 分支來代替。

source: If you have a GitHub account
de: Wenn Sie ein GitHub-Konto haben
zh_tw: 如果你有 GitHub 帳戶

source: Open the pull request page. Click the **Checks** tab near the top of the page:
de: Öffnen Sie die Pull Request-Seite. Klicken Sie auf den Tab **Checks** oben auf der Seite:
zh_tw: 打開拉取請求頁面。點擊頁面頂部附近的 **檢查Checks** 標籤:

source: Click the **Artifacts** dropdown on the right of the page:
de: Klicken Sie auf das Dropdown-Menü **Artifacts** rechts auf der Seite:
zh_tw: 點擊頁面右側的 **工件Artifacts** 下拉式功能表，然後點擊工件的名稱來下載它:

source: In the dropdown, click the artifact's name to download it. Remember to scroll if you cannot see the name of the platform you're looking for:
de: Klicken Sie in der Dropdown-Liste auf den Namen des Artefakts, um es herunterzuladen. Denken Sie daran, zu scrollen, wenn Sie den Namen der gesuchten Plattform nicht sehen können:
zh_tw: 在下拉列表中，按一下工件的名稱進行下載。如果您看不到您要搜尋的平台的名稱，請記住滾動：

source: Extract the ZIP archive then run the executable. Note that Windows and macOS binaries are **not** code signed. This means you may have to bypass a security warning before you can run the executable. On Windows, if you frequently test pull request builds, it may be better to disable Windows SmartScreen permanently in the Windows security settings. On macOS, see :ref:`doc_running_on_macos` for instructions on bypassing Gatekeeper.
de: Extrahieren Sie das ZIP-Archiv und führen Sie die ausführbare Datei aus. Beachten Sie, dass Windows- und macOS-Binärdateien **nicht** code-signiert sind. Das bedeutet, dass Sie möglicherweise eine Sicherheitswarnung umgehen müssen, bevor Sie die ausführbare Datei ausführen können. Wenn Sie unter Windows häufig Pull Request-Builds testen, ist es möglicherweise besser, Windows SmartScreen in den Windows-Sicherheitseinstellungen dauerhaft zu deaktivieren. Unter macOS finden Sie unter :ref:`doc_running_on_macos` eine Anleitung zur Umgehung von Gatekeeper.
zh_tw: 提取ZIP檔案，然後運作可執行檔。注意，Windows和macOS的二進位檔案是沒有程式碼簽章的。這意味著你可能必須在運作可執行檔之前繞過安全警告。如果你經常測試拉取請求的建構，可能最好永久地禁用Windows SmartScreen或 `禁用macOS Gatekeeper <https://disable-gatekeeper.github.io/>`__ 。

source: If you don't have a GitHub account
de: Wenn Sie kein GitHub-Konto haben
zh_tw: 如果你沒有 GitHub 帳戶

source: If you don't have a GitHub account and can't sign up for one, you can use the third-party `nightly.link <https://nightly.link>`__ service to generate a universal download link.
de: Wenn Sie kein GitHub-Konto haben und sich auch nicht dafür anmelden können, können Sie stattdessen den Drittanbieter-Dienst `nightly.link <https://nightly.link>`__ verwenden, um einen universellen Download-Link zu erzeugen.
zh_tw: 如果你沒有GitHub帳戶，也無法註冊，你可以使用協力廠商的 `nightly.link <https://nightly.link>`__ 服務來生成一個通用的下載連結。

source: Open the pull request page. Click the *fork*'s branch name near the top of the page:
de: Öffnen Sie die Pull Request-Seite. Klicken Sie auf den Branch-Namen des *Forks* am oberen Rand der Seite:
zh_tw: 打開拉取請求頁面。點擊頁面頂部附近的 *fork* 分支名稱:

source: Now that you are on the fork's branch page, click the ``.github`` folder at the top of the file list. Then, click on the ``workflows`` folder (whicb is inside the ``.github`` folder). Click the workflow file for the platform you wish to download artifacts for. *After* clicking on the file (which opens the file view), copy the page URL from your browser's address bar.
de: Wenn Sie sich nun auf der Seite des Forks befinden, klicken Sie auf den Ordner ``.github`` am Anfang der Dateiliste. Klicken Sie dann auf den Ordner ``workflows`` (der sich innerhalb des Ordners ``.github`` befindet). Klicken Sie auf die Workflow-Datei für die Plattform, für die Sie Artefakte herunterladen möchten. *Nach* dem Klicken auf die Datei (wodurch sich die Dateiansicht öffnet), kopieren Sie die URL der Seite aus der Adressleiste Ihres Browsers.
zh_tw: 現在你在 fork 的分支頁面上，點擊檔列表頂部的 ``.github`` 資料夾。然後，點擊 ``workflows`` 資料夾（位於 ``.github`` 資料夾內）。點擊你想下載工件的平臺的工作流程檔。在點擊檔（打開檔視圖）*之後*，從瀏覽器的位址欄複製頁面 URL。

source: Open the `nightly.link <https://nightly.link>`__ website and paste the URL you just copied into the text field located below the heading **Paste a GitHub link, get a nightly.link!**. After pasting the URL, click **Get links** on the right. If the format of the URL you pasted is correct, you should be presented with a page like this:
de: Öffnen Sie die Website `nightly.link <https://nightly.link>`__ und fügen Sie die soeben kopierte URL in das Textfeld unter der Überschrift **Paste a GitHub link, get a nightly.link!** ein. Nachdem Sie die URL eingefügt haben, klicken Sie auf **Get links** auf der rechten Seite. Wenn das Format der URL, die Sie eingefügt haben, korrekt ist, sollten Sie eine Seite wie diese sehen:
zh_tw: 打開 `nightly.link <https://nightly.link>`__ 網站，將剛才複製的 URL 貼上到 **Paste a GitHub link, get a nightly.link!** 標題下的文字欄位。貼上完 URL 後，點擊右側的 **Get Links** 。如果你貼上的 URL 格式正確，你應該看到一個像這樣的頁面：

source: Click the URL of the artifact you wish to download.
de: Klicken Sie auf die URL des Artefakts, das Sie herunterladen möchten.
zh_tw: 點擊你想下載的工件的URL。

source: Extract the ZIP archive then run the executable. Note that Windows and macOS binaries are not code signed. This means you may have to bypass a security warning before you can run the executable. If you frequently test pull request builds, it may be better to disable Windows SmartScreen or `disable macOS Gatekeeper <https://disable-gatekeeper.github.io/>`__ permanently.
de: Extrahieren Sie das ZIP-Archiv und führen Sie die ausführbare Datei aus. Beachten Sie, dass Windows- und macOS-Binärdateien nicht code-signiert sind. Das bedeutet, dass Sie möglicherweise eine Sicherheitswarnung umgehen müssen, bevor Sie die Datei ausführen können. Wenn Sie häufig Pull Request-Builds testen, ist es möglicherweise besser, Windows SmartScreen oder `macOS Gatekeeper <https://disable-gatekeeper.github.io/>`__ dauerhaft zu deaktivieren.
zh_tw: 提取ZIP檔案，然後運作可執行檔。注意，Windows和macOS的二進位檔案是沒有程式碼簽章的。這意味著你可能必須在運作可執行檔之前繞過安全警告。如果你經常測試拉取請求的建構，可能最好永久地禁用Windows SmartScreen或 `禁用macOS Gatekeeper <https://disable-gatekeeper.github.io/>`__ 。

source: Compiling a pull request branch from source
de: Kompilieren eines Pull Request-Branchs aus dem Quellcode
zh_tw: 從源編譯拉取請求分支

source: This approach may be needed for pull requests that were last updated more than 90 days ago, or to test on platforms and configurations that are not supported by Godot's GitHub Actions setup.
de: Dieser Ansatz kann für Pull Requests erforderlich sein, die vor mehr als 90 Tagen zuletzt aktualisiert wurden, oder um auf Plattformen und Konfigurationen zu testen, die von Godots GitHub Actions-Setup nicht unterstützt werden.
zh_tw: 對於最後一次更新超過90天的拉取請求，或者在Godot的GitHub Actions設定不支援的平臺和配置上進行測試，可能需要採用這種方法。

source: Now that you are on the fork's branch page, click the green **Code** button on the right of the page then choose **Download ZIP** in the dropdown:
de: Wenn Sie sich nun auf der Seite des Forks befinden, klicken Sie auf den grünen **Code**-Button rechts auf der Seite und wählen Sie dann **ZIP herunterladen** im Dropdown-Menü:
zh_tw: 現在你在fork的分支頁面上，點擊頁面右側的綠色 **Code** 按鈕，然後在下拉式功能表中選擇 **下載ZIP** :

source: Extract the ZIP archive and follow the :ref:`compiling <toc-devel-compiling>` instructions for your operating system.
de: Entpacken Sie das ZIP-Archiv und befolgen Sie die :ref:`Kompilier <toc-devel-compiling>`-Anweisungen für Ihr Betriebssystem.
zh_tw: 提取 ZIP 壓縮包，按照你的作業系統的:ref:`編譯 <toc-devel-compiling>`說明操作。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
