Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/vertex_animation/animating_thousands_of_fish.po
Languages: de, zh_tw

source: Animating thousands of fish with MultiMeshInstance3D
de: Animieren von Tausenden von Fischen mit MultiMeshInstance3D
zh_tw: 用 MultiMeshInstance3D 動畫化數以千計條魚

source: This tutorial explores a technique used in the game `ABZU <https://www.gdcvault.com/play/1024409/Creating-the-Art-of-ABZ>`_ for rendering and animating thousands of fish using vertex animation and static mesh instancing.
de: Dieses Tutorial beschäftigt sich mit einer Methode, die in dem Spiel `ABZU <https://www.gdcvault.com/play/1024409/Creating-the-Art-of-ABZ>`_ verwendet wird, um Tausende von Fischen mit Hilfe von Vertex-Animation und statischem Mesh-Instancing zu rendern und zu animieren.
zh_tw: 本教學探索了遊戲 `ABZU <https://www.gdcvault.com/play/1024409/Creating-the-Art-of-ABZ>`_ 中使用的一種技術, 該技術使用頂點動畫和靜態網格實例, 來算繪和製作成千上萬的魚動畫.

source: In Godot, this can be accomplished with a custom :ref:`Shader <class_Shader>` and a :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. Using the following technique you can render thousands of animated objects, even on low end hardware.
de: In Godot kann dies mit einem eigenen :ref:`Shader <class_Shader>` und einem :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>` erreicht werden. Mit der folgenden Methode können Sie Tausende von animierten Objekten rendern, sogar auf Low-End-Hardware.
zh_tw: 在 Godot 中，這可以通過自訂 :ref:`Shader <class_Shader>` 和 :ref:`MultiMeshInstance <class_MultiMeshInstance>` 實作。使用下面的技術，即使是在低端硬體上你也可以算繪成千上萬的動畫物件。

source: We will start by animating one fish. Then, we will see how to extend that animation to thousands of fish.
de: Wir beginnen mit der Animation eines einzelnen Fisches. Dann werden wir sehen, wie wir diese Animation auf Tausende von Fischen ausweiten können.
zh_tw: 我們將從一條魚的動畫開始. 然後, 我們將看到如何將該動畫擴充到數千條魚.

source: Animating one Fish
de: Animieren eines Fischs
zh_tw: 動畫化一條魚

source: We will start with a single fish. Load your fish model into a :ref:`MeshInstance3D <class_MeshInstance3D>` and add a new :ref:`ShaderMaterial <class_ShaderMaterial>`.
de: Wir werden mit einem einzelnen Fisch beginnen. Laden Sie Ihr Fischmodell in eine :ref:`MeshInstance3D <class_MeshInstance3D>` und fügen Sie ein neues :ref:`ShaderMaterial <class_ShaderMaterial>` hinzu.
zh_tw: 按一下下面的材質 :ref:`Plane Mesh <class_MeshInstance>` 功能表並建立一個新的 :ref:`ShaderMaterial <class_ShaderMaterial>`.

source: Here is the fish we will be using for the example images, you can use any fish model you like.
de: Hier ist der Fisch, den wir für die Beispielbilder verwenden werden. Sie können jedes beliebige Fischmodell verwenden, das Ihnen gefällt.
zh_tw: 這是我們用於範例圖像的魚, 您可以使用任何您喜歡的魚模型.

source: The fish model in this tutorial is made by `QuaterniusDev <https://quaternius.com>`_ and is shared with a creative commons license. CC0 1.0 Universal (CC0 1.0) Public Domain Dedication https://creativecommons.org/publicdomain/zero/1.0/
de: Das Fischmodell in diesem Tutorial stammt von `QuaterniusDev <https://quaternius.com>`_ und wird unter einer Creative Commons Lizenz zur Verfügung gestellt. CC0 1.0 Universal (CC0 1.0) Public Domain Dedication https://creativecommons.org/publicdomain/zero/1.0/
zh_tw: 本教學中的魚模型由 `QuaterniusDev<http://quaternius.com>` 製作, 使用如下知識共用許可.CC0 1.0通用(CC0 1.0)公共領域貢獻https://creativecommons.org/publicdomain/zero/1.0/

source: Typically, you would use bones and a :ref:`Skeleton3D <class_Skeleton3D>` to animate objects. However, bones are animated on the CPU and so you end having to calculate thousands of operations every frame and it becomes impossible to have thousands of objects. Using vertex animation in a vertex shader, you avoid using bones and can instead calculate the full animation in a few lines of code and completely on the GPU.
de: Normalerweise würden Sie Knochen und ein :ref:`Skeleton3D <class_Skeleton3D>` verwenden, um Objekte zu animieren. Knochen werden jedoch auf der CPU animiert, so dass Sie am Ende Tausende von Operationen pro Frame berechnen müssen und es unmöglich wird, Tausende von Objekten zu haben. Wenn Sie die Vertex-Animation in einem Vertex-Shader verwenden, vermeiden Sie die Verwendung von Knochen und können stattdessen die gesamte Animation in wenigen Codezeilen und vollständig auf der GPU berechnen.
zh_tw: 通常情況下，您將使用骨骼和 :ref:`Skeleton <class_Skeleton>` 為對象做動畫。然而，骨骼的動畫是在 CPU 上做的，所以你必須為每一影格計算成千上萬的操作，因此就不可能有成千上萬的物件。在頂點著色器中使用頂點動畫，你就可以避免使用骨骼，而是完全在 GPU 上，使用幾行程式碼來計算完整的動畫。

source: The animation will be made of four key motions:
de: Die Animation soll aus vier Hauptbewegungen bestehen:
zh_tw: 動畫由四個關鍵影格動作組成:

source: A side to side motion
de: Eine Bewegung von Seite zu Seite
zh_tw: 從一邊運動到另一邊

source: A pivot motion around the center of the fish
de: Eine Pivot-Drehbewegung um das Zentrum des Fisches
zh_tw: 繞著魚的中心作旋轉運動

source: A panning wave motion
de: Eine schwenkende Wellenbewegung
zh_tw: 平移波動運動

source: A panning twist motion
de: Eine schwenkende Drehbewegung
zh_tw: 平移扭轉運動

source: All the code for the animation will be in the vertex shader with uniforms controlling the amount of motion. We use uniforms to control the strength of the motion so that you can tweak the animation in editor and see the results in real time, without the shader having to recompile.
de: Der gesamte Code für die Animation befindet sich im Vertex-Shader, wobei Uniforms den Umfang der Bewegung steuern. Wir verwenden Uniforms, um die Stärke der Bewegung zu steuern, so dass Sie die Animation im Editor optimieren und die Ergebnisse in Echtzeit sehen können, ohne dass der Shader neu kompiliert werden muss.
zh_tw: 所有的動畫程式碼都在頂點著色器中，並由 uniform 控制運動量。我們使用 uniform 來控制運動的強度，這樣你就可以在編輯器中調整動畫，並即時看到結果，而不用重新編譯著色器。

source: All the motions will be made using cosine waves applied to ``VERTEX`` in model space. We want the vertices to be in model space so that the motion is always relative to the orientation of the fish. For example, side-to-side will always move the fish back and forth in its left to right direction, instead of on the ``x`` axis in the world orientation.
de: Alle Bewegungen werden mit Kosinuswellen ausgeführt, die auf ``VERTEX`` im Model-Space angewendet werden. Wir wollen, dass die Eckpunkte im Model-Space liegen, so dass die Bewegung immer relativ zur Ausrichtung des Fisches ist. Zum Beispiel wird der Fisch bei einer Seitwärtsbewegung immer von links nach rechts hin- und herbewegt, anstatt entlang der ``x``-Achse im World-Space.
zh_tw: 所有的運動都將使用餘弦波應用於模型空間中的 ``VERTEX`` . 我們希望頂點在模型空間中, 使運動總是相對於魚的方向. 例如,side-to-side將始終使魚在其左至右的方向上來回移動, 而不是在世界方向的 ``x`` 軸上.

source: In order to control the speed of the animation, we will start by defining our own time variable using ``TIME``.
de: Um die Geschwindigkeit der Animation zu steuern, definieren wir zunächst unsere eigene Zeitvariable mit ``TIME``.
zh_tw: 為了控制動畫的速度，我們將通過使用 ``TIME`` 定義自己的時間變數開始。

source: The first motion we will implement is the side to side motion. It can be made by offsetting ``VERTEX.x`` by ``cos`` of ``TIME``. Each time the mesh is rendered, all the vertices will move to the side by the amount of ``cos(time)``.
de: Die erste Bewegung, die wir implementieren werden, ist die Bewegung von Seite zu Seite. Sie kann durch eine Verschiebung von ``VERTEX.x`` um ``cos`` von ``TIME`` erzeugt werden. Jedes Mal, wenn das Mesh gerendert wird, werden alle Vertices um den Betrag von ``cos(time)`` zur Seite bewegt.
zh_tw: 我們將實施的第一項議案是左右運動. 它可以通過 ``TIME`` 的 ``cos`` 抵消 ``VERTEX.x`` 來製作. 每次算繪網格時, 所有頂點都會移動到 "cos(時間)" 的數量.

source: The resulting animation should look something like this:
de: Die resultierende Animation sollte in etwa so aussehen:
zh_tw: 生成的動畫看起來是這樣的:

source: Next, we add the pivot. Because the fish is centered at (0, 0), all we have to do is multiply ``VERTEX`` by a rotation matrix for it to rotate around the center of the fish.
de: Als nächstes fügen wir den Pivot-Punkt hinzu. Da der Fisch bei (0, 0) zentriert ist, müssen wir nur ``VERTEX`` mit einer Rotationsmatrix multiplizieren, damit er sich um den Mittelpunkt des Fisches rotiert.
zh_tw: 接下來，我們新增軸心點。因為魚以 (0, 0) 為中心，我們所要做的只是將 ``VERTEX`` 乘以旋轉矩陣，使其圍繞魚的中心旋轉。

source: We construct a rotation matrix like so:
de: Wir konstruieren eine Rotationsmatrix wie folgt:
zh_tw: 我們建構一個旋轉矩陣, 如下所示:

source: And then we apply it in the ``x`` and ``z`` axes by multiplying it by ``VERTEX.xz``.
de: Und dann wenden wir es auf die Achsen ``x`` und ``z`` an, indem wir es mit ``VERTEX.xz`` multiplizieren.
zh_tw: 然後我們把它乘以 ``VERTEX.xz``，應用到 ``x`` 和 ``z`` 軸上。

source: With only the pivot applied you should see something like this:
de: Wenn Sie nur den Pivot anwenden, sollten Sie etwa so etwas sehen:
zh_tw: 在只應用軸心的情況下，您會看到這個：

source: The next two motions need to pan down the spine of the fish. For that, we need a new variable, ``body``. ``body`` is a float that is ``0`` at the tail of the fish and ``1`` at its head.
de: Die nächsten beiden Bewegungen müssen die Wirbelsäule des Fisches abwärts schwenken. Dafür brauchen wir eine neue Variable, ``body``. ``body`` ist ein Float, der am Schwanz des Fisches den Wert ``0`` und am Kopf den Wert ``1`` hat.
zh_tw: 接下來的兩個動作需要沿著魚的脊柱平移. 為此, 我們需要一個新的變數, ``body`` . ``body`` 是一個浮點數，在魚的尾部是 ``0`` ，在頭部是 ``1`` .

source: The next motion is a cosine wave that moves down the length of the fish. To make it move along the spine of the fish, we offset the input to ``cos`` by the position along the spine, which is the variable we defined above, ``body``.
de: Die nächste Bewegung ist eine Kosinuswelle, die sich entlang der Länge des Fisches bewegt. Damit sie sich entlang der Wirbelsäule des Fisches bewegt, verschieben wir den Eingangswert von ``cos`` um die Position entlang der Wirbelsäule, was die Variable ``body`` ist, die wir oben definiert haben.
zh_tw: 下一個運動是沿著魚的長度向下移動的餘弦波. 為了讓它沿著魚的脊柱移動, 我們用脊柱的位置來偏移輸入到 ``cos`` 的位置, 也就是我們在上面定義的變數 ``body``。

source: This looks very similar to the side to side motion we defined above, but in this one, by using ``body`` to offset ``cos`` each vertex along the spine has a different position in the wave making it look like a wave is moving along the fish.
de: Dies sieht sehr ähnlich aus wie die Bewegung von Seite zu Seite, die wir oben definiert haben, aber in diesem Fall hat jeder Vertex entlang der Wirbelsäule eine andere Position in der Welle, so dass es so aussieht, als würde sich eine Welle entlang des Fisches bewegen, indem wir ``body`` als Offset für ``cos`` verwenden.
zh_tw: 這看起來很像我們上面定義的左右運動, 但在這個例子中, 通過使用 ``body`` 來偏移 ``cos``，沿著脊柱的每個頂點在波浪中都有不同的位置, 使它看起來像是沿著魚移動的波浪.

source: The last motion is the twist, which is a panning roll along the spine. Similarly to the pivot, we first construct a rotation matrix.
de: Die letzte Bewegung ist die Verdrehung, die eine schwenkende Rollbewegung entlang der Wirbelsäule ist. Ähnlich wie bei der Pivot-Rotation konstruieren wir zunächst eine Rotationsmatrix.
zh_tw: 最後一個動作是扭轉，也就是沿著脊柱滾動。類似軸心運動，我們首先建構一個旋轉矩陣。

source: We apply the rotation in the ``xy`` axes so that the fish appears to roll around its spine. For this to work, the fish's spine needs to be centered on the ``z`` axis.
de: Wir wenden die Rotation in der ``xy``-Achse an, so dass der Fisch um seine Wirbelsäule zu rollen scheint. Damit dies funktioniert, muss die Wirbelsäule des Fisches auf der ``z``-Achse zentriert sein.
zh_tw: 我們在 ``xy`` 軸上應用旋轉, 使魚看起來繞著它的脊柱滾動. 要做到這一點, 魚的脊柱需要以 ``z`` 軸為中心.

source: Here is the fish with twist applied:
de: Hier ist der Fisch mit angewendeter Verdrehung:
zh_tw: 這是應用扭曲的魚:

source: If we apply all these motions one after another, we get a fluid jelly-like motion.
de: Wenn wir alle diese Bewegungen nacheinander anwenden, erhalten wir eine flüssige geleeartige Bewegung.
zh_tw: 如果我們一個接一個地應用這些運動, 就得到一個類似液體凝膠似的運動.

source: Normal fish swim mostly with the back half of their body. Accordingly, we need to limit the panning motions to the back half of the fish. To do this, we create a new variable, ``mask``.
de: Normale Fische schwimmen hauptsächlich mit der hinteren Hälfte ihres Körpers. Dementsprechend müssen wir die Schwenkbewegungen auf die hintere Hälfte des Fisches beschränken. Zu diesem Zweck erstellen wir eine neue Variable, ``mask``.
zh_tw: 通常魚主要使用身體的後半部分游泳，所以我們需要將平移運動限制在魚的後半部分。為此，我們建立一個新變數 ``mask`` （遮罩）。

source: ``mask`` is a float that goes from ``0`` at the front of the fish to ``1`` at the end using ``smoothstep`` to control the point at which the transition from ``0`` to ``1`` happens.
de: ``mask`` ist ein Float, der von ``0`` an der Vorderseite des Fisches bis ``1`` am Ende reicht und ``smoothstep`` benutzt, um den Punkt zu steuern, an dem der Übergang von ``0`` zu ``1`` stattfindet.
zh_tw: ``mask`` 是個浮點數，從魚頭的 ``0`` 過渡到魚尾的 ``1`` ，我們用 ``smoothstep`` 來控制在哪裡進行由 ``0`` 到 ``1`` 的過渡。

source: Below is an image of the fish with ``mask`` used as ``COLOR``:
de: Unten sehen Sie ein Bild des Fisches, der ``mask`` als ``COLOR`` verwendet:
zh_tw: 下面是把 ``COLOR`` 設定成 ``mask`` 後這條魚的樣子：

source: For the wave, we multiply the motion by ``mask`` which will limit it to the back half.
de: Für die Welle multiplizieren wir die Bewegung mit ``mask``, wodurch sie auf die hintere Hälfte beschränkt wird.
zh_tw: 我們在做波浪運動的地方乘以 ``mask`` 就可以把動作限制在後半部分。

source: In order to apply the mask to the twist, we use ``mix``. ``mix`` allows us to mix the vertex position between a fully rotated vertex and one that is not rotated. We need to use ``mix`` instead of multiplying ``mask`` by the rotated ``VERTEX`` because we are not adding the motion to the ``VERTEX`` we are replacing the ``VERTEX`` with the rotated version. If we multiplied that by ``mask``, we would shrink the fish.
de: Um die Maske auf die Verdrehung anzuwenden, benutzen wir ``mix``. ``mix`` erlaubt es uns, die Position des Vertex zwischen einem vollständig rotierten Vertex und einem nicht rotierten zu mischen. Wir müssen ``mix`` benutzen, anstatt ``mask`` mit dem rotierten ``VERTEX`` zu multiplizieren, weil wir die Bewegung nicht zum ``VERTEX`` hinzufügen, sondern den ``VERTEX`` durch die rotierte Version ersetzen. Wenn wir das mit ``mask`` multiplizieren würden, würden wir den Fisch schrumpfen.
zh_tw: 為了將遮罩應用於扭曲, 我們使用 ``mix`` . ``mix`` 允許在完全旋轉的頂點和未旋轉的頂點之間混合頂點位置. 需要使用 ``mix`` 而不是將 ``mask`` 乘以旋轉後的 ``VERTEX`` , 因為不是將運動加到 ``VERTEX`` 上, 而是用旋轉後的版本替換 ``VERTEX`` . 如果把它乘以 ``mask`` , 就會把魚縮小.

source: Putting the four motions together gives us the final animation.
de: Wenn man die vier Bewegungen zusammenfügt, erhält man die endgültige Animation.
zh_tw: 將四個動作組合在一起, 就得到了最終的動畫效果.

source: Go ahead and play with the uniforms in order to alter the swim cycle of the fish. You will find that you can create a wide variety of swim styles using these four motions.
de: Spielen Sie mit den Uniforms, um den Schwimmzyklus des Fisches zu verändern. Sie werden feststellen, dass Sie mit diesen vier Bewegungen eine große Vielfalt an Schwimmstilen erzeugen können.
zh_tw: 繼續發揮 uniform 的作用, 以改變魚的游泳週期. 你會發現, 你可以用這四個動作創造出各種各樣的游泳方式.

source: Making a school of fish
de: Erstellen eines Fischschwarms
zh_tw: 製作一群魚

source: Godot makes it easy to render thousands of the same object using a MultiMeshInstance3D node.
de: Godot macht es einfach, Tausende von ein und demselben Objekt mit einem MultiMeshInstance3D-Node zu rendern.
zh_tw: 在 Godot 中可以很輕鬆地在屬性面板中建立自定資源。

source: A MultiMeshInstance3D node is created and used the same way you would make a MeshInstance3D node. For this tutorial, we will name the MultiMeshInstance3D node ``School``, because it will contain a school of fish.
de: Ein MultiMeshInstance3D-Node wird auf die gleiche Weise erstellt und verwendet wie ein MeshInstance3D-Node. Für dieses Tutorial werden wir den MultiMeshInstance3D Node ``School`` nennen, da er einen Fischschwarm (engl. school of fish) enthalten wird.
zh_tw: MultiMeshInstance 節點的建立和使用與 MeshInstance 節點相同。在本教學中，我們將把 MultiMeshInstance 節點命名為 ``School``（魚群），因為裡面會有一群魚。

source: Once you have a MultiMeshInstance3D add a :ref:`MultiMesh <class_MultiMesh>`, and to that MultiMesh add your :ref:`Mesh <class_Mesh>` with the shader from above.
de: Sobald Sie eine MultiMeshInstance3D haben, fügen Sie ein :ref:`MultiMesh <class_MultiMesh>` hinzu, und zu diesem MultiMesh fügen Sie Ihr :ref:`Mesh <class_Mesh>` mit dem Shader von oben hinzu.
zh_tw: 有了 MultiMeshInstance 之後就再新增一個 :ref:`MultiMesh <class_MultiMesh>`，然後在 MultiMesh 上新增使用上述著色器的 :ref:`Mesh <class_Mesh>`。

source: MultiMeshes draw your Mesh with three additional per-instance properties: Transform (rotation, translation, scale), Color, and Custom. Custom is used to pass in 4 multi-use variables using a :ref:`Color <class_Color>`.
de: MultiMeshes zeichnen Ihr Mesh mit drei zusätzlichen Propertys pro Instanz: Transform (Rotation, Translation, Skalierung), Color und Custom. Custom wird verwendet, um 4 mehrfach verwendbare Variablen mit einem :ref:`Color <class_Color>` zu übergeben.
zh_tw: MultiMeshes 使用三個額外的實例屬性來繪製 Mesh：變換（旋轉、平移、縮放）、顏色和自訂。自訂用於使用 :ref:`Color <class_Color>` 傳入 4 個多用途變數。

source: ``instance_count`` specifies how many instances of the mesh you want to draw. For now, leave ``instance_count`` at ``0`` because you cannot change any of the other parameters while ``instance_count`` is larger than ``0``. We will set ``instance count`` in GDScript later.
de: ``instance_count`` gibt an, wie viele Instanzen des Meshes Sie zeichnen wollen. Für den Moment lassen Sie ``instance_count`` auf ``0`` stehen, da Sie keinen der anderen Parameter ändern können, solange ``instance_count`` größer als ``0`` ist. Wir werden ``instance count`` später in GDScript einstellen.
zh_tw: ``instance_count`` 指定要繪製的網格的實例數量。現在，將 ``instance_count`` 保留為 ``0``，因為當 ``instance_count`` 大於 ``0`` 時，您不能更改任何其他參數。我們稍後將在 GDScript 中設定 ``instance_count``。

source: ``transform_format`` specifies whether the transforms used are 3D or 2D. For this tutorial, select 3D.
de: Mit ``transform_format`` wird angegeben, ob die verwendeten Transformationen 3D oder 2D sind. Für dieses Tutorial wählen Sie 3D.
zh_tw: ``transform_format`` 指定使用的變換是 3D 還是 2D。對於本教學，請選擇 3D。

source: For both ``color_format`` and ``custom_data_format`` you can choose between ``None``, ``Byte``, and ``Float``. ``None`` means you won't be passing in that data (either a per-instance ``COLOR`` variable, or ``INSTANCE_CUSTOM``) to the shader. ``Byte`` means each number making up the color you pass in will be stored with 8 bits while ``Float`` means each number will be stored in a floating-point number (32 bits). ``Float`` is slower but more precise, ``Byte`` will take less memory and be faster, but you may see some visual artifacts.
de: Sowohl für ``color_format`` als auch für ``custom_data_format`` können Sie zwischen ``None``, ``Byte`` und ``Float`` wählen. ``None`` bedeutet, dass Sie diese Daten (entweder eine ``COLOR``-Variable pro Instanz, oder ``INSTANCE_CUSTOM``) nicht an den Shader weitergeben werden. ``Byte`` bedeutet, dass jede Zahl, aus der die Farbe besteht, die Sie übergeben, mit 8 Bits gespeichert wird, während ``Float`` bedeutet, dass jede Zahl in einem Float (32 Bits) gespeichert wird. ``Float`` ist langsamer, aber präziser, ``Byte`` benötigt weniger Speicherplatz und ist schneller, aber Sie könnten möglicherweise einige visuelle Artefakte sehen.
zh_tw: 對於 ``color_format`` 和 ``custom_data_format``，你可以在 ``None``、``Byte``、``Float`` 之間選擇。``None`` 意味著你不會將這些資料（無論是每個實例的 ``COLOR`` 變數還是 ``INSTANCE_CUSTOM``）傳遞給著色器。``Byte`` 意味著組成你傳入的顏色的每一個數位將被儲存為 8 位元，而 ``Float`` 意味著每一個數位將被儲存為浮點數（32 位）。``Float`` 速度較慢但更精確，``Byte`` 佔用記憶體較少、速度較快，但你可能會看到一些視覺上的偽像。

source: Now, set ``instance_count`` to the number of fish you want to have.
de: Setzen Sie nun ``instance_count`` auf die Anzahl der Fische, die Sie haben möchten.
zh_tw: 現在，將 ``instance_count`` 設定為您想要的魚的數量。

source: Next we need to set the per-instance transforms.
de: Als nächstes müssen wir die Transformationen für jede Instanz festlegen.
zh_tw: 接下來, 我們需要設定每個實例的變換.

source: There are two ways to set per-instance transforms for MultiMeshes. The first is entirely in editor and is described in the :ref:`MultiMeshInstance3D tutorial <doc_using_multi_mesh_instance>`.
de: Es gibt zwei Möglichkeiten, Transformationen pro Instanz für MultiMeshes zu setzen. Die erste erfolgt vollständig im Editor und wird im :ref:`MultiMeshInstance3D-Tutorial <doc_using_multi_mesh_instance>` beschrieben.
zh_tw: 有兩種方法可以為多個時間軸設定每個實例的變換。第一個完全在編輯器中，在 :ref:`MultiMeshInstance tutorial <doc_using_multi_mesh_instance>` 中進行了描述。

source: The second is to loop over all the instances and set their transforms in code. Below, we use GDScript to loop over all the instances and set their transform to a random position.
de: Die zweite Möglichkeit besteht darin, eine Schleife über alle Instanzen zu bilden und ihre Transformationen im Code festzulegen. Im Folgenden verwenden wir GDScript, um eine Schleife über alle Instanzen zu bilden und ihre Transformation auf eine zufällige Position zu setzen.
zh_tw: 第二種方法是, 走訪所有實例, 並在程式碼中設定它們的變換. 下面, 我們使用GDScript走訪所有實例, 並將它們的變換設定為隨機位置.

source: Running this script will place the fish in random positions in a box around the position of the MultiMeshInstance3D.
de: Wenn dieses Skript ausgeführt wird, werden die Fische an zufälligen Positionen in einer Box um die Position der MultiMeshInstance3D platziert.
zh_tw: 運作此腳本, 會在多重網格實例位置周圍的框中隨機放置魚.

source: If performance is an issue for you, try running the scene with fewer fish.
de: Wenn die Performance für Sie ein Problem darstellt, versuchen Sie, die Szene mit weniger Fischen auszuführen.
zh_tw: 如果你關注性能問題, 試著使用GLES2運作場景或擺放更少的魚.

source: Notice how all the fish are all in the same position in their swim cycle? It makes them look very robotic. The next step is to give each fish a different position in the swim cycle so the entire school looks more organic.
de: Haben Sie bemerkt, dass alle Fische in ihrem Schwimmzyklus die gleiche Position einnehmen? Das lässt sie sehr roboterhaft aussehen. Der nächste Schritt besteht darin, jedem Fisch eine andere Position im Schwimmzyklus zu geben, damit der gesamte Schwarm organischer aussieht.
zh_tw: 你應該已經注意到所有魚的游泳動作都是同步的了吧？這樣看上去非常機械。下一步我們要做的就是讓每一條魚都處於游泳週期的不同位置，這樣整個魚群看起來就會更自然。

source: Animating a school of fish
de: Animieren eines Fischschwarmes
zh_tw: 動畫魚群

source: One of the benefits of animating the fish using ``cos`` functions is that they are animated with one parameter, ``time``. In order to give each fish a unique position in the swim cycle, we only need to offset ``time``.
de: Einer der Vorteile der Animation der Fische mit Hilfe von ``cos``-Funktionen ist, dass sie mit einem einzigen Parameter, ``time``, animiert werden. Um jedem Fisch eine eindeutige Position im Schwimmzyklus zu geben, müssen wir nur die ``time`` verschieben.
zh_tw: 使用 ``cos`` 函式給魚做動畫的一個好處是，它們只需要一個 ``time`` 參數。為了讓每條魚在游泳週期中處於單獨的位置，我們只需要偏移 ``time``。

source: We do that by adding the per-instance custom value ``INSTANCE_CUSTOM`` to ``time``.
de: Wir tun dies, indem wir den pro Instanz benutzerdefinierten Wert ``INSTANCE_CUSTOM`` zu ``time`` addieren.
zh_tw: 為此，我們將每個實例的自訂值 ``INSTANCE_CUSTOM`` 新增到 ``time`` 中。

source: Next, we need to pass a value into ``INSTANCE_CUSTOM``. We do that by adding one line into the ``for`` loop from above. In the ``for`` loop we assign each instance a set of four random floats to use.
de: Als nächstes müssen wir einen Wert in ``INSTANCE_CUSTOM`` übergeben. Wir tun dies, indem wir eine Zeile in die ``for``-Schleife von oben einfügen. In der ``for``-Schleife weisen wir jeder Instanz einen Satz von vier zufälligen Floats zu, die sie verwenden soll.
zh_tw: 接下來，我們需要向 ``INSTANCE_CUSTOM`` 傳遞一個值。通過在上面的 ``for`` 迴圈中新增一行來實作這一點。在 ``for`` 迴圈中，為每個實例分配一組四個隨機浮點數來使用。
