Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/vertex_animation/animating_thousands_of_fish.po
Languages: de, zh_tw

source: Now the fish all have unique positions in the swim cycle. You can give them a little more individuality by using ``INSTANCE_CUSTOM`` to make them swim faster or slower by multiplying by ``TIME``.
de: Jetzt haben die Fische alle einzigartige Positionen im Schwimmzyklus. Du kannst ihnen ein wenig mehr Individualität geben, indem du ``INSTANCE_CUSTOM`` benutzt, um sie schneller oder langsamer schwimmen zu lassen, indem du mit ``TIME`` multiplizierst.
zh_tw: 現在這些魚在游泳週期中都有獨特的位置。你可以通過使用 ``INSTANCE_CUSTOM`` 乘以 ``TIME`` 讓它們游泳更快或更慢，從而讓它們更個性化。

source: You can even experiment with changing the per-instance color the same way you changed the per-instance custom value.
de: Sie können sogar damit experimentieren, die Farbe pro Instanz auf dieselbe Weise zu ändern, wie Sie den benutzerdefinierten Wert pro Instanz geändert haben.
zh_tw: 甚至您還可以像更改每個實例的自訂值一樣, 嘗試更改每個實例的顏色.

source: One problem that you will run into at this point is that the fish are animated, but they are not moving. You can move them by updating the per-instance transform for each fish every frame. Although doing so will be faster than moving thousands of MeshInstance3Ds per frame, it'll still likely be slow.
de: Ein Problem, auf das Sie an dieser Stelle stoßen werden, ist, dass die Fische zwar animiert sind, sich aber nicht bewegen. Sie können sie durch Aktualisieren der pro-Instanz-Transformation für jeden Fisch in jedem Frame bewegen. Obwohl dies schneller ist als die Bewegung von Tausenden von MeshInstance3Ds pro Frame, wird es wahrscheinlich immer noch langsam sein.
zh_tw: 這時你會遇到一個問題, 那就是魚是有動畫的, 但是它們沒有移動. 你可以通過每一影格更新每個魚的實例變換來移動它們. 雖然這樣做會比每影格移動數千個MeshInstances要快, 但還是可能會很慢.

source: In the next tutorial we will cover how to use :ref:`GPUParticles3D <class_GPUParticles3D>` to take advantage of the GPU and move each fish around individually while still receiving the benefits of instancing.
de: Im nächsten Tutorial werden wir uns damit beschäftigen, wie man :ref:`GPUParticles3D <class_GPUParticles3D>` verwendet, um die Vorteile der GPU zu nutzen und jeden Fisch einzeln zu bewegen, ohne auf die Vorteile der Instanziierung zu verzichten.
zh_tw: 下一個教學中，我們將介紹如何使用:ref:`粒子 <class_Particles>`來利用 GPU，分別移動每條魚，同時還能獲得產生實體的好處。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
