Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/vertex_animation/controlling_thousands_of_fish.po
Languages: de, zh_tw

source: Controlling thousands of fish with Particles
de: Steuern von Tausenden von Fischen mittels Partikeln
zh_tw: 用粒子控制數千條魚

source: The problem with :ref:`MeshInstance3D <class_MeshInstance3D>` is that it is expensive to update their transform array. It is great for placing many static objects around the scene. But it is still difficult to move the objects around the scene.
de: Das Problem mit :ref:`MeshInstance3D <class_MeshInstance3D>` ist, dass es teuer ist, ihr Transform-Array zu aktualisieren. Es ist großartig, um viele statische Objekte in der Szene zu platzieren. Aber es ist immer noch schwierig, die Objekte in der Szene zu bewegen.
zh_tw: :ref:`MeshInstance <class_MeshInstance>` 的問題是，更新轉換陣列的代價很高。它非常適合在場景周圍放置許多靜態物件。但在場景中移動物體仍然很困難。

source: To make each instance move in an interesting way, we will use a :ref:`GPUParticles3D <class_GPUParticles3D>` node. Particles take advantage of GPU acceleration by computing and setting the per-instance information in a :ref:`Shader <class_Shader>`.
de: Um jede Instanz auf interessante Weise zu bewegen, werden wir einen :ref:`GPUParticles3D <class_GPUParticles3D>`-Node verwenden. Partikel nutzen die Vorteile der GPU-Beschleunigung, indem sie die Informationen pro Instanz in einem :ref:`Shader <class_Shader>` berechnen und einstellen.
zh_tw: 為了使每個實例以有趣的方式移動, 我們將使用一個 :ref:`Particles <class_Particles>` 節點.Particles通過在 :ref:`Shader <class_Shader>` 中計算和設定每個實例的資訊來利用GPU加速.

source: First create a Particles node. Then, under "Draw Passes" set the Particle's "Draw Pass 1" to your :ref:`Mesh <class_Mesh>`. Then under "Process Material" create a new :ref:`ShaderMaterial <class_ShaderMaterial>`.
de: Erstellen Sie zunächst einen Particles-Node. Dann setzen Sie unter "Draw Passes" den "Draw Pass 1" des Partikels auf Ihr :ref:`Mesh <class_Mesh>`. Dann erstellen Sie unter "Process Material" ein neues :ref:`ShaderMaterial <class_ShaderMaterial>`.
zh_tw: 首先建立一個 Particles 節點。然後在“Draw Passes”下將粒子的“Draw Pass 1”設定為你的 :ref:`Mesh <class_Mesh>`。然後在“Process Material”下建立一個新的 :ref:`ShaderMaterial <class_ShaderMaterial>`。

source: Set the ``shader_type`` to ``particles``.
de: Setzen Sie den ``shader_type`` auf ``particles``.
zh_tw: 將 ``shader_type`` 設定為 ``particles``。

source: Then add the following two functions:
de: Anschließend fügen Sie die folgenden beiden Funktionen hinzu:
zh_tw: 然後新增以下兩個函式：

source: These functions come from the default :ref:`ParticleProcessMaterial <class_ParticleProcessMaterial>`. They are used to generate a random number from each particle's ``RANDOM_SEED``.
de: Diese Funktionen kommen von dem Default-:ref:`ParticleProcessMaterial <class_ParticleProcessMaterial>`. Sie werden verwendet, um eine Zufallszahl aus dem ``RANDOM_SEED`` jedes Partikels zu erzeugen.
zh_tw: 這些函式來自預設的 :ref:`ParticlesMaterial <class_ParticlesMaterial>`，可以用來根據每個粒子的 ``RANDOM_SEED`` 生成亂數。

source: A unique thing about particle shaders is that some built-in variables are saved across frames. ``TRANSFORM``, ``COLOR``, and ``CUSTOM`` can all be accessed in the shader of the mesh, and also in the particle shader the next time it is run.
de: Einzigartig an Partikel-Shadern ist, dass einige Built-in-Variablen über Frames hinweg gespeichert werden. Auf ``TRANSFORM``, ``COLOR`` und ``CUSTOM`` kann im Shader des Meshes zugegriffen werden und auch im Partikel-Shader, wenn er das nächste Mal ausgeführt wird.
zh_tw: 粒子著色器的一個獨特之處在於, 一些內建的變數可以跨影格保存. ``TRANSFORM`` , ``COLOR`` 和 ``CUSTOM`` 都可以在網格的Spatial shader 中存取, 下次運作時也可以在粒子著色器中存取.

source: Next, setup your ``start()`` function. Particles shaders contain a ``start()`` function and a ``process()`` function.
de: Als nächstes richten Sie Ihre ``start()`` Funktion ein. Partikel-Shader enthalten eine ``start()`` Funktion und eine ``process()`` Funktion.
zh_tw: 接下來，設定您的 ``vertex`` 函式。粒子著色器只包含一個頂點函式，不包含其他函式。

source: The code in the ``start()`` function only runs when the particle system starts. The code in the ``process()`` function will always run.
de: Der Code in der ``start()``-Funktion läuft nur, wenn das Partikelsystem startet. Der Code in der ``process()``-Funktion wird immer ausgeführt.
zh_tw: “start()”函式中的程式碼僅在粒子系統啟動時運作。 “process()”函式中的程式碼將始終運作。

source: We need to generate 4 random numbers: 3 to create a random position and one for the random offset of the swim cycle.
de: Wir müssen 4 Zufallszahlen erzeugen: 3, um eine zufällige Position zu erzeugen, und eine für den zufälligen Offset des Schwimmzyklus.
zh_tw: 接下來, 我們需要生成4個亂數:3個用於建立一個隨機位置,1個用於游泳週期的隨機偏移量.

source: First, generate 4 seeds inside the ``start()`` function using the ``hash()`` function provided above:
de: Erzeugen Sie zunächst 4 Seeds innerhalb der ``start()``-Funktion unter Verwendung der oben angegebenen ``hash()``-Funktion:
zh_tw: 首先，使用上面提供的 ``hash`` 函式在 ``RESTART`` 塊中生成 4 個種子：

source: Then, use those seeds to generate random numbers using ``rand_from_seed``:
de: Dann verwenden Sie diese Seeds, um Zufallszahlen unter Verwendung von ``rand_from_seed`` zu erzeugen:
zh_tw: 然後，使用這些種子生成亂數，使用 ``rand_from_seed``：

source: Finally, assign ``position`` to ``TRANSFORM[3].xyz``, which is the part of the transform that holds the position information.
de: Abschließend weisen Sie ``Position`` dem Wert ``TRANSFORM[3].xyz`` zu, die den Teil der Transformation darstellt, der die Positionsinformationen enthält.
zh_tw: 最後，將 ``position`` 賦值給 ``TRANSFORM[3].xyz``，它是保存位置資訊的變換的一部分。

source: Remember, all this code so far goes inside the ``start()`` function.
de: Denken Sie daran, dass der gesamte bisherige Code innerhalb der Funktion ``start()`` steht.
zh_tw: 記住，到目前為止，所有這些程式碼都位於 ``RESTART`` 塊中。

source: The vertex shader for your mesh can stay the exact same as it was in the previous tutorial.
de: Der Vertex-Shader für Ihr Mesh kann genau so bleiben, wie er im vorherigen Tutorial war.
zh_tw: 網格的頂點著色器, 可以完全複用前一教學中的.

source: Now you can move each fish individually each frame, either by adding to the ``TRANSFORM`` directly or by writing to ``VELOCITY``.
de: Jetzt können Sie jeden Fisch einzeln in jedem Frame bewegen, entweder indem Sie die ``TRANSFORM`` direkt hinzufügen oder indem Sie in die ``VELOCITY`` schreiben.
zh_tw: 現在每一影格你都可以單獨移動每條魚了，可以直接增加 ``TRANSFORM`` 也可以設定 ``VELOCITY``。

source: Let's transform the fish by setting their ``VELOCITY`` in the ``start()`` function.
de: Lassen Sie uns die Fische transformieren, indem wir ihre ``VELOCITY`` in der ``start()`` Funktion setzen.
zh_tw: 讓我們通過設定魚的 ``VELOCITY`` 來對它們進行變換。

source: This is the most basic way to set ``VELOCITY`` every particle (or fish) will have the same velocity.
de: Dies ist der einfachste Weg, um die ``VELOCITY`` einzustellen, da jeder Partikel (oder Fisch) die gleiche Geschwindigkeit hat.
zh_tw: 這是設定 ``VELOCITY`` 的最基本方法，每個粒子（或魚）都有相同的速度。

source: Just by setting ``VELOCITY`` you can make the fish swim however you want. For example, try the code below.
de: Indem Sie einfach ``VELOCITY`` einstellen, können Sie den Fisch schwimmen lassen, wie Sie wollen. Probieren Sie zum Beispiel den folgenden Code aus.
zh_tw: 只要設定 ``VELOCITY``，你就可以讓魚自由遊動。例如，嘗試下面的程式碼。

source: This will give each fish a unique speed between ``2`` and ``10``.
de: Dadurch erhält jeder Fisch eine einzigartige Geschwindigkeit zwischen ``2`` und ``10``.
zh_tw: 這將為每條魚在 ``2`` 和 ``10`` 之間設定不同的速度。

source: You can also let each fish change its velocity over time if you set the velocity in the ``process()`` function.
de: Sie können auch jeden Fisch seine Geschwindigkeit über die Zeit ändern lassen, wenn Sie die Geschwindigkeit in der Funktion ``process()`` festlegen.
zh_tw: 如果您在「process()」函式中設定速度，您也可以讓每條魚隨著時間的推移改變其速度。

source: If you used ``CUSTOM.y`` in the last tutorial, you can also set the speed of the swim animation based on the ``VELOCITY``. Just use ``CUSTOM.y``.
de: Wenn Sie ``CUSTOM.y`` im letzten Tutorial benutzt haben, können Sie auch die Geschwindigkeit der Schwimmanimation basierend auf der ``VELOCITY`` einstellen. Verwenden Sie einfach ``CUSTOM.y``.
zh_tw: 如果你在上一個教學中使用了 ``CUSTOM.y``，你也可以基於 ``VELOCITY`` 來設定游泳動畫的速度。直接用 ``CUSTOM.y`` 就好了。

source: This code gives you the following behavior:
de: Dieser Code führt zu folgendem Ergebnis:
zh_tw: 程式碼產生的效果如圖:

source: Using a ParticleProcessMaterial you can make the fish behavior as simple or complex as you like. In this tutorial we only set Velocity, but in your own Shaders you can also set ``COLOR``, rotation, scale (through ``TRANSFORM``). Please refer to the :ref:`Particles Shader Reference <doc_particle_shader>` for more information on particle shaders.
de: Mit einem ParticleProcessMaterial kann man das Verhalten der Fische so einfach oder komplex gestalten, wie man möchte. In diesem Tutorial stellen wir nur die Geschwindigkeit ein, aber in Ihren eigenen Shadern können Sie auch ``COLOR``, Rotation, Skalierung (durch ``TRANSFORM``) einstellen. Bitte lesen Sie die :ref:`Partikel-Shader-Referenz <doc_particle_shader>` für weitere Informationen über Partikel Shader.
zh_tw: 使用 ParticlesMaterial 可以隨意讓魚的行為變得簡單或複雜。在本教學中，我們只設定了速度，但是在你自己的著色器中，你也可以設定 ``COLOR``、旋轉、縮放（通過 ``TRANSFORM``）。有關粒子著色器的更多資訊，請參閱:ref:`《粒子著色器參考》 <doc_particle_shader>`。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
