Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/android_gradle_build.po
Languages: de, zh_cn

source: Gradle builds for Android
de: Gradle-Builds für Android
zh_cn: Android 的 Gradle 构建

source: Godot provides the option to build using the gradle buildsystem. Instead of using the already pre-built template that ships with Godot, an Android Java project gets installed into your project folder. Godot will then build it and use it as an export template every time you export the project.
de: Godot bietet die Möglichkeit, mit dem Gradle-Buildsystem zu bauen. Anstatt die bereits vorgefertigte Vorlage zu verwenden, die mit Godot geliefert wird, wird ein Android-Java-Projekt in Ihrem Projektordner installiert. Godot baut es dann und verwendet es als Exportvorlage, wenn Sie das Projekt exportieren.
zh_cn: Godot 提供了使用 gradle 构建系统进行构建的选项。使用 gradle 构建时，不会使用 Godot 自带的已经构建好的模板，而是会在你的项目文件夹中安装一个 Android Java 项目。这样每次导出项目时，Godot 都会构建这个项目，用它作为导出模板。

source: There are some reasons why you may want to do this:
de: Es gibt einige Gründe, warum Sie dies vielleicht tun möchten:
zh_cn: 需要使用这种方法的原因可能有：

source: Modify the project before it's built.
de: Ändern des Projekts, bevor es erstellt wird.
zh_cn: 在构建项目前进行修改。

source: Add external SDKs that build with your project.
de: Externe SDKs hinzufügen, die mit Ihrem Projekt verarbeitet werden.
zh_cn: 添加需要与项目一同构建的外部 SDK。

source: Configuring the gradle build is a fairly straightforward process. But first you need to follow the steps in :ref:`exporting for android<doc_exporting_for_android>` up to **Setting it up in Godot**. After doing that, follow the steps below.
de: Die Konfiguration des Gradle-Builds ist ein ziemlich geradliniger Prozess. Aber zuerst müssen Sie die Schritte in :ref:`exporting for android<doc_exporting_for_android>` bis zu **Einrichtung in Godot** befolgen. Danach führen Sie die folgenden Schritte aus.
zh_cn: Gradle 构建的配置过程相当简单。但首先你需要按照\ :ref:`导出到 Android <doc_exporting_for_android>` 中的步骤进行操作，做到\ **在 Godot 中进行设置**\ 为止。做完这些后，请按照下面的步骤进行操作。

source: Set up the gradle build environment
de: Einrichten der Gradle-Build-Umgebung
zh_cn: 设置 gradle 构建环境

source: Go to the Project menu, and install the *Gradle Build* template:
de: Rufen Sie das Menü Projekt auf und installieren Sie die Vorlage *Gradle Build*:
zh_cn: 前往“项目”菜单，安装 *Gradle 构建*\ 模板：

source: Make sure export templates are downloaded. If not, this menu will help you download them.
de: Stellen Sie sicher, dass Exportvorlagen heruntergeladen werden. Falls nicht, hilft Ihnen dieses Menü beim Herunterladen.
zh_cn: 请确保已下载导出模板。如果尚未下载，则这个菜单会帮你下载。

source: A Gradle-based Android project will be created under ``res://android/build``. Editing these files is not needed unless you really need to modify the project.
de: Ein Gradle-basiertes Android-Projekt wird unter ``res://android/build`` erstellt. Es ist nicht notwendig, diese Dateien zu bearbeiten, es sei denn, Sie müssen das Projekt wirklich ändern.
zh_cn: ``res://android/build`` 下会生成一个基于 Gradle 的 Android 项目。你不需要编辑里面的文件，除非真的有修改这个项目的需求。

source: Enabling the gradle build and exporting
de: Aktivieren des Gradle-Builds und Exportieren
zh_cn: 启用 gradle 构建和导出

source: When setting up the Android project in the **Project > Export** dialog, **Gradle Build** needs to be enabled:
de: Beim Einrichten des Android-Projekts im Dialog **Projekt > Export** muss **Gradle Build** aktiviert sein:
zh_cn: 在\ **项目 > 导出**\ 对话框中设置 Android 项目时，需要启用 **Gradle 构建**\ ：

source: From now on, attempting to export the project or one-click deploy will call the `Gradle <https://gradle.org/>`__ build system to generate fresh templates (this window will appear every time):
de: Von nun an wird bei dem Versuch das Projekt zu exportieren oder Ein-Klick-Ausliefern auszuführen, das `Gradle <https://gradle.org/>`__-Buildsystem aufgerufen, um neue Vorlagen zu generieren (dieses Fenster erscheint jedes Mal):
zh_cn: 从现在开始，尝试导出项目或一键部署就会调用 `Gradle <https://gradle.org/>`__ 构建系统来生成新的模板（每次都会出现这个窗口）：

source: The templates built will be used automatically afterwards, so no further configuration is needed.
de: Die erstellten Vorlagen werden anschließend automatisch verwendet, sodass keine weitere Konfiguration erforderlich ist.
zh_cn: 后续步骤中会自动使用生成的模板，不需要进一步的配置。

source: When using the gradle Android build system, assets that are placed within a folder whose name begins with an underscore will not be included in the generated APK. This does not apply to assets whose *file* name begins with an underscore.
de: Bei Verwendung des Gradle Android-Build-Systems werden Assets, die sich in einem Ordner befinden, dessen Name mit einem Unterstrich beginnt, nicht in das generierte APK aufgenommen. Dies gilt nicht für Assets, deren *Dateiname* mit einem Unterstrich beginnt.
zh_cn: 使用基于 gradle 的 Android 构建系统时，如果放置资产的文件夹以下划线开头，就不会包含在生成的 APK 里。这个规则不适用于\ *文件名*\ 以下划线开头的资源。

source: For example, ``_example/image.png`` will **not** be included as an asset, but ``_image.png`` will.
de: Zum Beispiel wird ``_example/image.png`` **nicht** als Asset aufgenommen, aber ``_image.png`` schon.
zh_cn: 例如，\ **不会**\ 包含名为 ``_example/image.png`` 的资产，但是会包含 ``_image.png``\ 。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
