Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_pcks.po
Languages: de

source: Exporting packs, patches, and mods
de: Exportieren von Packs, Patches und Mods

source: Use cases
de: Anwendungsfälle

source: Oftentimes one would like to add functionality to one's game after it has been deployed.
de: Oft möchte man seinem Spiel nach der Auslieferung noch Funktionalität hinzufügen.

source: Examples of this include...
de: Beispiele hierfür sind...

source: Downloadable Content: the ability to add features and content to one's game.
de: Herunterladbare Inhalte: die Möglichkeit, Features und Inhalte zu seinem Spiel hinzuzufügen.

source: Patches: the ability to fix a bug that is present in a shipped product.
de: Patches: die Fähigkeit, einen Bug zu beheben, der in einem ausgelieferten Produkt vorhanden ist.

source: Mods: grant other people the ability to create content for one's game.
de: Mods: anderen Personen die Möglichkeit geben, Inhalte für das eigene Spiel zu erstellen.

source: These tools help developers to extend their development beyond the initial release.
de: Diese Tools helfen Entwicklern, ihre Entwicklung über das ursprüngliche Release hinaus zu erweitern.

source: Overview of PCK files
de: Übersicht der PCK-Dateien

source: Godot enables this via a feature called **resource packs** (PCK files, with extension ``.pck``).
de: Godot ermöglicht dies über ein Feature namens **Resource Packs** (PCK-Dateien, mit der Erweiterung ``.pck``).

source: **Advantages:**
de: **Vorteile:**

source: incremental updates/patches
de: inkrementelle Aktualisierungen/Patches

source: offer DLCs
de: Anbieten von DLCs

source: offer mod support
de: Anbieten von Mod-Unterstützung

source: no source code disclosure needed for mods
de: keine Quellcode-Offenlegung für Mods erforderlich

source: more modular project structure
de: modularere Projektstruktur

source: users don't have to replace the entire game
de: Benutzer müssen nicht das gesamte Spiel ersetzen

source: The first part of using them involves exporting and delivering the project to players. Then, when one wants to add functionality or content later on, they just deliver the updates via PCK files to the users.
de: Der erste Teil ihrer Verwendung besteht darin, das Projekt zu exportieren und den Spielern zu übergeben. Wenn man dann später Funktionen oder Inhalte hinzufügen möchte, liefert man die Updates einfach über PCK-Dateien an die Benutzer.

source: PCK files usually contain, but are not limited to:
de: PCK-Dateien enthalten in der Regel, aber nicht ausschließlich:

source: scripts
de: Skripte

source: scenes
de: Szenen

source: shaders
de: Shader

source: models
de: Modelle

source: textures
de: Texturen

source: sound effects
de: Sound-Effekte

source: music
de: Musik

source: any other asset suitable for import into the game
de: jedes andere Asset, das sich für den Import in das Spiel eignet

source: The PCK files can even be an entirely different Godot project, which the original game loads in at runtime.
de: Die PCK-Dateien können sogar ein völlig anderes Godot-Projekt sein, welches das Originalspiel zur Laufzeit lädt.

source: Generating PCK files
de: Erzeugen von PCK-Dateien

source: In order to pack all resources of a project into a PCK file open the project and go to Project/Export and click on "Export PCK/Zip". Also make sure to have an export template selected while doing so.
de: Um alle Ressourcen eines Projekts in eine PCK-Datei zu packen, öffnen Sie das Projekt und gehen Sie zu Projekt/Export und klicken Sie auf "PCK/Zip Exportieren". Stellen Sie dabei sicher, dass Sie eine Exportvorlage ausgewählt haben.

source: Another method would be to :ref:`export from the command line <doc_command_line_tutorial_exporting>`. If the output file ends with a PCK or ZIP file extension, then the export process will build that type of file for the chosen platform.
de: Eine andere Methode wäre: :ref:`exportieren von der Kommandozeile <doc_command_line_tutorial_exporting>`. Wenn die Ausgabedatei mit einer PCK- oder ZIP-Dateierweiterung endet, dann wird der Exportprozess diesen Dateityp für die gewählte Plattform erstellen.

source: If one wishes to support mods for their game, they will need their users to create similarly exported files. Assuming the original game expects a certain structure for the PCK's resources and/or a certain interface for its scripts, then either...
de: Wenn das eigene Spiel eine Mod-Unterstützung erhalten soll, müssen die Nutzer ähnlich exportierte Dateien erstellen. Angenommen, das ursprüngliche Spiel erwartet eine bestimmte Struktur für die Ressourcen des PCK und/oder eine bestimmte Schnittstelle für seine Skripte, dann...

source: The developer must publicize documentation of these expected structures/ interfaces, expect modders to install Godot Engine, and then also expect those modders to conform to the documentation's defined API when building mod content for the game (so that it will work). Users would then use Godot's built in exporting tools to create a PCK file, as detailed above.
de: muss der Entwickler die Dokumentation dieser erwarteten Strukturen/Schnittstellen veröffentlichen, von den Moddern erwarten, dass sie die Godot Engine installieren, und dann auch erwarten, dass diese Modder sich an die in der Dokumentation definierte API halten, wenn sie Mod-Inhalte für das Spiel erstellen (damit es funktioniert). Die Benutzer würden dann die in Godot eingebauten Export-Tools verwenden, um wie oben beschrieben eine PCK-Datei zu erstellen.

source: The developer uses Godot to build a GUI tool for adding their exact API content to a project. This Godot tool must either run on a tools-enabled build of the engine or have access to one (distributed alongside or perhaps in the original game's files). The tool can then use the Godot executable to export a PCK file from the command line with :ref:`OS.execute() <class_OS_method_execute>`. The game itself shouldn't use a tool-build of the engine (for security), so it's best to keep the modding tool and game separate.
de: verwendet der Entwickler Godot und erstellt ein GUI-Tool zum Hinzufügen des genauen API-Inhalts zu einem Projekt. Dieses Godot-Tool muss entweder auf einem für Tools konfigurierten Build der Engine ausgeführt werden oder Zugriff auf eines haben (das neben oder möglicherweise in den Originaldateien des Spiels veröffentlicht ist). Das Tool kann dann die ausführbare Godot-Datei verwenden, um eine PCK-Datei von der Kommandozeile zu exportieren, etwa mit :ref:`OS.execute () <class_OS_method_execute>`. Da das Spiel (aus Sicherheitsgründen) keinen Tool-Build der Engine benutzen sollte, ist es am besten, das Modding-Tool und das Spiel seperat zu halten.

source: Opening PCK files at runtime
de: Öffnen von PCK-Dateien zur Laufzeit

source: To import a PCK file, one uses the ProjectSettings singleton. The following example expects a “mod.pck” file in the directory of the games executable. The PCK file contains a “mod_scene.tscn” test scene in its root.
de: Um eine PCK-Datei zu importieren, verwendet man das ProjectSettings-Singleton. Das folgende Beispiel erwartet eine "mod.pck"-Datei im Verzeichnis der ausführbaren Datei des Spiels. Die PCK-Datei enthält in ihrem Stammverzeichnis eine "mod_scene.tscn"-Testszene.

source: By default, if you import a file with the same file path/name as one you already have in your project, the imported one will replace it. This is something to watch out for when creating DLC or mods. You can solve this problem by using a tool that isolates mods to a specific mods subfolder. However, it is also a way of creating patches for one's own game. A PCK file of this kind can fix the content of a previously loaded PCK.
de: Wenn Sie eine Datei mit demselben Dateipfad/Namen importieren wie eine Datei, die Sie bereits in Ihrem Projekt haben, wird sie standardmäßig durch die importierte Datei ersetzt. Dies ist etwas, worauf Sie achten müssen, wenn Sie DLC oder Mods erstellen. Sie können dieses Problem lösen, indem Sie ein Tool verwenden, das Mods in einem bestimmten Mods-Unterordner isoliert. Es ist aber auch eine Möglichkeit, Patches für das eigene Spiel zu erstellen. Eine solche PCK-Datei kann den Inhalt eines zuvor geladenen PCKs korrigieren.

source: To opt out of this behavior, pass ``false`` as the second argument to :ref:`ProjectSettings.load_resource_pack() <class_ProjectSettings_method_load_resource_pack>`.
de: Um dieses Verhalten auszuschalten, übergeben Sie als zweites Argument ``false`` an :ref:`ProjectSettings.load_resource_pack() <class_ProjectSettings_method_load_resource_pack>`.

source: For a C# project, you need to build the DLL and place it in the project directory first. Then, before loading the resource pack, you need to load its DLL as follows: ``Assembly.LoadFile("mod.dll")``
de: Für ein C#-Projekt müssen Sie zuerst eine DLL erstellen und sie in den Projektordner legen. Vor dem Laden des Ressourcenpaketes muss die DLL dann wie folgt geladen werden: ``Assembly.LoadFile(mod.dll)``

source: Summary
de: Zusammenfassung

source: This tutorial explains how to add mods, patches, or DLC to a game. The most important thing is to identify how one plans to distribute future content for their game and develop a workflow that is customized for that purpose. Godot should make that process smooth regardless of which route a developer pursues.
de: Dieses Tutorial erklärt, wie man Mods, Patches oder DLC zu einem Spiel hinzufügt. Das Wichtigste ist, herauszufinden, wie man zukünftige Inhalte für sein Spiel verteilen will, und einen Workflow zu entwickeln, der auf diesen Zweck zugeschnitten ist. Godot sollte diesen Prozess reibungslos gestalten, unabhängig davon, welchen Weg ein Entwickler wählt.

source: Translation status
de: Übersetzungsstatus
