Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_web.po
Languages: de, zh_tw

source: The other exported files are served as they are, next to the ``.html`` file, names unchanged. The ``.wasm`` file is a binary WebAssembly module implementing the engine. The ``.pck`` file is the Godot main pack containing your game. The ``.js`` file contains start-up code and is used by the ``.html`` file to access the engine. The ``.png`` file contains the boot splash image. It is not used in the default HTML page, but is included for :ref:`custom HTML pages <doc_customizing_html5_shell>`.
de: Die anderen exportierten Dateien werden so, wie sie sind, neben der ``.html``-Datei, mit unveränderten Namen, bereitgestellt. Die ``.wasm``-Datei ist ein binäres WebAssembly-Modul, das die Engine implementiert. Die ``.pck`` Datei ist das Godot-Hauptpaket, das Ihr Spiel enthält. Die ``.js`` Datei enthält den Startcode und wird von der ``.html``-Datei benutzt, um auf die Engine zuzugreifen. Die ``.png``-Datei enthält das Boot-Splash-Bild. Es wird nicht in der Standard-HTML-Seite verwendet, ist aber für :ref:`eigene HTML Seiten <doc_customizing_html5_shell>` enthalten.
zh_tw: 除了 ``.html`` 外其他的檔案都是以原本的樣子來提供，名稱不變。 ``.wasm`` 檔案為實作引擎的二進位 WebAssembly 模組。 ``.pck`` 檔案則是包含遊戲的 Godot 主要套件。 ``.js`` 檔案包含了由 ``.html`` 檔案用來存取引擎的啟動程式碼。 ``.png`` 檔案包含了啟動畫面，預設的 HTML 頁面不會使用到，但可以用 :ref:`自定 HTML 頁面 <doc_customizing_html5_shell>` 來顯示。

source: The ``.pck`` file is binary, usually delivered with the MIME-type :mimetype:`application/octet-stream`. The ``.wasm`` file is delivered as :mimetype:`application/wasm`.
de: Die ``.pck``-Datei ist binär und wird normalerweise mit dem MIME-Typ :mimetype:`application/octet-stream` geliefert. Die Datei ``.wasm`` wird als :mimetype:`application/wasm` geliefert.
zh_tw: ``.pck`` 檔案為二進位形式，通常會以 MIME 型別 :mimetype:`application/octet-strem` 來傳送。 ``.wasm`` 則是 :mimetype:`application/wasm` 。

source: Delivering the WebAssembly module (``.wasm``) with a MIME-type other than :mimetype:`application/wasm` can prevent some start-up optimizations.
de: Die Auslieferung des WebAssembly-Moduls (``.wasm``) mit einem anderen MIME-Typ als :mimetype:`application/wasm` kann einige Start-Optimierungen verhindern.
zh_tw: 使用 :mimetype:`application/wasm` 之外的 MIME 型別來傳遞 WebAssembly 模組 (``.wasm`) 可以防止一些啟動最佳化。

source: Delivering the files with server-side compression is recommended especially for the ``.pck`` and ``.wasm`` files, which are usually large in size. The WebAssembly module compresses particularly well, down to around a quarter of its original size with gzip compression. Consider using Brotli precompression if supported on your web server for further file size savings.
de: Die Auslieferung der Dateien mit serverseitiger Komprimierung wird insbesondere für die Dateien ``.pck`` und ``.wasm`` empfohlen, die in der Regel sehr groß sind. Das WebAssembly-Modul lässt sich besonders gut komprimieren, mit gzip-Komprimierung auf etwa ein Viertel der ursprünglichen Größe. Ziehen Sie die Verwendung der Brotli-Vorkomprimierung in Erwägung, falls Ihr Webserver diese unterstützt, um die Dateigröße weiter zu verringern.

source: **Hosts that provide on-the-fly compression:** GitHub Pages (gzip)
de: **Hosts, die on-the-fly Komprimierung anbieten:** GitHub Pages (gzip)
zh_tw: **提供即時壓縮的主機:** GitHub Pages (gzip)

source: **Hosts that don't provide on-the-fly compression:** itch.io, GitLab Pages (`supports manual gzip precompression <https://webd97.de/post/gitlab-pages-compression/>`__)
de: **Hosts, die keine on-the-fly-Komprimierung anbieten:** itch.io, GitLab Pages (`unterstützt manuelle gzip-Vorkomprimierung <https://webd97.de/post/gitlab-pages-compression/>`__)
zh_tw: **不提供即時壓縮的主機:** itch.io, GitLab 頁面 ( `支援手動gzip預壓縮 <https://webd97.de/post/gitlab-pages-compression/>`__ )

source: The Godot repository includes a `Python script to host a local web server <https://raw.githubusercontent.com/godotengine/godot/master/platform/web/serve.py>`__. This script is intended for testing the web editor, but it can also be used to test exported projects.
de: Das Godot-Repository enthält ein `Python-Skript zum Hosten eines lokalen Webservers <https://raw.githubusercontent.com/godotengine/godot/master/platform/web/serve.py>`__. Dieses Skript ist für den Test des Webeditors gedacht, kann aber auch zum Testen exportierter Projekte verwendet werden.
zh_tw: Godot 儲存庫包含一個「託管本機 Web 伺服器的 Python 腳本 <https://raw.githubusercontent.com/godotengine/godot/master/platform/web/serve.py>」。該腳本旨在測試 Web 編輯器，但也可用於測試匯出的專案。

source: Save the linked script to a file called ``serve.py``, move this file to the folder containing the exported project's ``index.html``, then run the following command in a command prompt within the same folder:
de: Speichern Sie das verlinkte Skript in eine Datei mit dem Namen ``serve.py``, verschieben Sie diese Datei in den Ordner, der die ``index.html`` des exportierten Projekts enthält, und führen Sie dann den folgenden Befehl in einer Eingabeaufforderung im selben Ordner aus:
zh_tw: 將連結的腳本儲存到名為「serve.py」的檔案中，將此檔案移至包含匯出專案的「index.html」的資料夾，然後在同一資料夾中的命令提示字元中執行以下命令：

source: On Windows, you can open a command prompt in the current folder by holding :kbd:`Shift` and right-clicking on empty space in Windows Explorer, then choosing **Open PowerShell window here**.
de: Unter Windows können Sie eine Eingabeaufforderung im aktuellen Ordner öffnen, indem Sie bei gedrückter :kbd:`Umschalt`-Taste mit der rechten Maustaste auf einen leeren Bereich im Windows Explorer klicken und dann **PowerShell-Fenster hier öffnen** wählen.
zh_tw: 在 Windows 上，您可以按住 Shift 並右鍵單擊 Windows 資源管理器中的空白區域，然後選擇 **在此處開啟 PowerShell 視窗**，在目前資料夾中開啟命令提示字元。

source: This will serve the contents of the current folder and open the default web browser automatically.
de: Dadurch wird der Inhalt des aktuellen Ordners angezeigt und der Default-Webbrowser automatisch geöffnet.
zh_tw: 這將提供目前資料夾的內容並自動開啟預設的 Web 瀏覽器。

source: Note that for production use cases, this Python-based web server should not be used. Instead, you should use an established web server such as Apache or nginx.
de: Beachten Sie, dass dieser auf Python basierende Webserver nicht für Produktionszwecke verwendet werden sollte. Stattdessen sollten Sie einen etablierten Webserver wie Apache oder nginx verwenden.
zh_tw: 請注意，對於生產用例，不應使用此基於 Python 的 Web 伺服器。相反，您應該使用已建立的 Web 伺服器，例如 Apache 或 nginx。

source: Calling JavaScript from script
de: Aufruf von JavaScript aus dem Skript
zh_tw: 從腳本中呼叫 JavaScript

source: In web builds, the ``JavaScriptBridge`` singleton is implemented. It offers a single method called ``eval`` that works similarly to the JavaScript function of the same name. It takes a string as an argument and executes it as JavaScript code. This allows interacting with the browser in ways not possible with script languages integrated into Godot.
de: In Web-Builds ist das Singleton ``JavaScriptBridge`` implementiert. Es bietet eine einzige Methode namens ``eval``, die ähnlich wie die gleichnamige JavaScript-Funktion funktioniert. Sie nimmt einen String als Argument und führt ihn als JavaScript-Code aus. Dies ermöglicht die Interaktion mit dem Browser auf eine Art und Weise, die mit in Godot integrierten Skriptsprachen nicht möglich ist.
zh_tw: 在網頁建置中有實作 ``JavaScript`` 單例。該單例只提供了一個名為 ``eval`` 的方法，類似 JavaScript 中相同名稱的函式。該方法接受單一字串參數，會將該字串作為 JavaScript 程式碼來執行。這樣便可用 Godot 整合腳本中無法實作的方法來與瀏覽器互動。

source: The value of the last JavaScript statement is converted to a GDScript value and returned by ``eval()`` under certain circumstances:
de: Der Wert der letzten JavaScript-Anweisung wird in einen GDScript-Wert konvertiert und unter bestimmten Umständen von ``eval()`` zurückgegeben:
zh_tw: 特定情況下，最後一個 JavaScript 陳述式的回傳值會轉換為 GDScript 值，並由 ``eval()`` 回傳：

source: JavaScript ``number`` is returned as :ref:`class_float`
de: JavaScript ``number`` wird als :ref:`class_float` zurückgegeben
zh_tw: JavaScript ``number`` 型會以 GDScript :ref:`class_float` 回傳

source: JavaScript ``boolean`` is returned as :ref:`class_bool`
de: JavaScript ``boolean`` wird als :ref:`class_bool` zurückgegeben
zh_tw: JavaScript ``bool`` 型會以 GDScript :ref:`class_bool` 回傳

source: JavaScript ``string`` is returned as :ref:`class_String`
de: JavaScript ``string`` wird als :ref:`class_String` zurückgegeben
zh_tw: JavaScript ``string`` 型會以 GDScript :ref:`class_String` 回傳

source: JavaScript ``ArrayBuffer``, ``TypedArray`` and ``DataView`` are returned as :ref:`PackedByteArray<class_PackedByteArray>`
de: JavaScript ``ArrayBuffer``, ``TypedArray`` und ``DataView`` werden als :ref:`PackedByteArray<class_PackedByteArray>` zurückgegeben
zh_tw: JavaScript ``ArrayBuffer``, ``TypedArray`` 與 ``DataView`` 型會以 GDScript :ref:`class_PoolByteArray` 回傳

source: Any other JavaScript value is returned as ``null``.
de: Jeder andere JavaScript-Wert wird zurückgegeben als ``null``.
zh_tw: 其他的 JavaScript 值則會回傳為 ``null`` 。

source: HTML5 export templates may be :ref:`built <doc_compiling_for_web>` without support for the singleton to improve security. With such templates, and on platforms other than HTML5, calling ``JavaScriptBridge.eval`` will also return ``null``. The availability of the singleton can be checked with the ``web`` :ref:`feature tag <doc_feature_tags>`:
de: HTML5-Exportvorlagen können :ref:`gebaut werden <doc_compiling_for_web>` ohne Unterstützung für das Singleton, um die Sicherheit zu verbessern. Mit solchen Vorlagen und auf anderen Plattformen als HTML5 wird der Aufruf von ``JavaScriptBridge.eval`` ebenfalls ``null`` zurückgeben. Die Verfügbarkeit des Singletons kann mit dem ``web`` :ref:`feature tag <doc_feature_tags>` überprüft werden:
zh_tw: 建置的 HTML5 匯出樣板也有可能為了提升安全性而被 :ref:`建置 <doc_compiling_for_web>` 為不支援該單例的版本。當使用這種樣板或是在非 HTML5 的平台上時，呼叫 ``JavaScript.eval`` 也會回傳 ``null`` 。可以通過 ``JavaScript`` :ref:`功能標籤` 來檢查是否可使用該單例：

source: GDScript's multi-line strings, surrounded by 3 quotes ``"""`` as in ``my_func3()`` above, are useful to keep JavaScript code readable.
de: Die mehrzeiligen Strings von GDScript, umgeben von 3 Anführungszeichen ``"""`` wie in ``my_func3()`` oben, sind nützlich, um JavaScript-Code lesbar zu halten.
zh_tw: GDScript 的多行字串是由三個引號 ``"""`` 來包圍，如同上方 ``my_func3()`` 中的範例，適用於讓 JavaScript 更容易閱讀。

source: The ``eval`` method also accepts a second, optional Boolean argument, which specifies whether to execute the code in the global execution context, defaulting to ``false`` to prevent polluting the global namespace:
de: Die Methode ``eval`` akzeptiert auch ein zweites, optionales boolesches Argument, das angibt, ob der Code im globalen Ausführungskontext ausgeführt werden soll. Die Voreinstellung ist ``false``, um den globalen Namespace nicht zu vermüllen:
zh_tw: ``eval`` 方法也接受第二個可選的布林參數，可以用來指定是否要在全域執行本文中執行程式碼。預設值為 ``false`` ，以防止汙染全域命名空間：

source: Environment variables
de: Umgebungsvariablen
zh_tw: 環境變數

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
de: Sie können die folgenden Umgebungsvariablen verwenden, um Exportoptionen außerhalb des Editors festzulegen. Während des Exportvorgangs überschreiben diese die Werte, die Sie im Exportmenü festgelegt haben.
zh_tw: 您可以使用下列環境變數在編輯器外部設定匯出選項。在匯出過程中，這些值會覆寫您在匯出選單中設定的值。

source: HTML5 export environment variables
de: HTML5-Export-Umgebungsvariablen
zh_tw: 環境變數

source: Environment variable
de: Umgebungsvariable
zh_tw: 環境變數

source: Encryption / Encryption Key
de: Verschlüsselung / Verschlüsselungsschlüssel
zh_tw: 加密/加密金鑰

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: WebGL version
zh_tw: Godot 版本

source: Audio
zh_tw: 音訊

source: Gamepads
zh_tw: 遊戲手柄

source: Export option
zh_tw: 匯出選項
