Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_projects.po
Languages: de

source: Exporting projects
de: Projekte exportieren

source: Why export?
de: Warum exportieren?

source: Originally, Godot did not have any means to export projects. The developers would compile the proper binaries and build the packages for each platform manually.
de: Ursprünglich bot Godot keine Möglichkeit, Projekte zu exportieren. Die Entwickler kompilierten die entsprechenden Binärdateien und Bibliotheken für jede Plattform per Hand.

source: When more developers (and even non-programmers) started using it, and when our company started taking more projects at the same time, it became evident that this was a bottleneck.
de: Als immer mehr Entwickler (und Nicht-Programmierer) begannen, Godot einzusetzen, und auch gleichzeitig unser Unternehmen immer mehr Aufträge annahm, stellte sich das als Bottleneck heraus.

source: On PC
de: Auf dem PC

source: Distributing a game project on PC with Godot is rather easy. Drop the Godot binary in the same directory as the ``project.godot`` file, then compress the project directory and you are done.
de: Ein Projekt für den PC zu veröffentlichen, ist vergleichsweise einfach. Sie legen die ausführbare Godot-Datei im selben Verzeichnis wie die ``project.godot`` ab, komprimieren den Projektordner und das war's.

source: It sounds simple, but there are probably a few reasons why the developer may not want to do this. The first one is that it may not be desirable to distribute loads of files. Some developers may not like curious users peeking at how the game was made, others may find it inelegant, and so on. Another reason is that the developer might prefer a specially-compiled binary, which is smaller in size, more optimized and does not include tools like the editor and debugger.
de: Das klingt zunächst einmal simpel, doch es gibt einige Gründe, warum ein Entwickler sich gegen diese Methode auszusprechen mag. Einer davon kann sein, dass es nicht gewünscht ist, viele einzelne Dateien zu veröffentlichen, entweder um den internen Spielaufbau vor neugierigen Blicken zu schützen, oder weil es unelegant ist, etc. Ein anderer Grund wäre, stattdessen eine speziell kompilierte Binärdatei auszuliefern, die optimiert ist und eine kleinere Dateigröße aufweist und ohne Entwicklungs-Tools, wie Editor und Debugger auskommt.

source: Finally, Godot has a simple but efficient system for :ref:`creating DLCs as extra package files <doc_exporting_pcks>`.
de: Schließlich hat Godot ein einfaches, aber effizientes System zum :ref:`Erstellen von DLCs als zusätzliche Paketdateien <doc_exporting_pcks>`.

source: On mobile
de: Auf mobilen Geräten

source: The same scenario on mobile platforms is a little worse. To distribute a project on those devices, a binary for each of those platforms is built, then added to a native project together with the game data.
de: Das gleiche Szenario ist auf mobilen Plattformen etwas komplizierter. Um ein Projekt für diese Geräte zu veröffentlichen, wird eine Binärdatei für jede Zielplattform individuell kompiliert und diese im Anschluss in einem nativen Projekt eingebettet, zusammen mit den Spielinhalten.

source: This can be troublesome because it means that the developer must be familiarized with the SDK of each platform before even being able to export. While learning each SDK is always encouraged, it can be frustrating to be forced to do it at an undesired time.
de: Dies kann sich als problematisch erweisen, denn der Entwickler muss sich im Vorfeld mit dem SDK der jeweiligen mobilen Plattform vertraut machen, ehe er damit überhaupt etwas exportieren kann. Das Erlernen der einzelnen SDKs wird zwar immer empfohlen, aber es kann frustrierend sein, wenn man dazu gezwungen wird, dies zu einem unerwünschten Zeitpunkt zu tun.

source: There is also another problem with this approach: different devices prefer some data in different formats to run. The main example of this is texture compression. All PC hardware uses S3TC (BC) compression and that has been standardized for more than a decade, but mobile devices use different formats for texture compression, such as ETC1 and ETC2.
de: Es gibt noch ein weiteres Problem bei diesem Ansatz: Verschiedene Geräte bevorzugen verschiedene Datenformate. Das wichtigste Beispiel hierfür ist die Texturkomprimierung. Die gesamte PC-Hardware verwendet die S3TC (BC)-Komprimierung, die seit mehr als einem Jahrzehnt standardisiert ist, aber mobile Geräte verwenden unterschiedliche Formate für die Texturkomprimierung, wie ETC1 und ETC2.

source: Export menu
de: Exportmenü

source: After many attempts at different export workflows, the current one has proven to work the best. At the time of this writing, not all platforms are supported yet, but the supported platforms continue to grow.
de: Nachdem verschiedene Lösungen für den Arbeitsablauf des Exports evaluiert wurden, hat sich der gegenwärtige als am besten herausgestellt. Zum Zeitpunkt der Erstellung dieses Artikels werden noch nicht alle Plattformen unterstützt, aber die Zahl der unterstützten Plattformen wächst ständig.

source: To open the export menu, click the **Export** button:
de: Um das Exportmenü zu öffnen, klicken Sie auf den **Exportieren**-Button:

source: The export menu will open. However, it will be completely empty. This is because we need to add an export preset.
de: Das Exportmenü wird geöffnet. Es ist jedoch noch völlig leer. Das liegt daran, dass wir ein Exportprofil hinzufügen müssen.

source: To create an export preset, click the **Add…** button at the top of the export menu. This will open a drop-down list of platforms to choose from for an export preset.
de: Um ein Exportprofil anzulegen, klicken Sie auf **Hinzufügen…** oben im Exportmenü. Daraufhin klappt ein Drop-Down-Menü mit einer Liste von Plattformen auf, für die ein Profil gewählt werden kann.

source: The default options are often enough to export, so tweaking them is usually not necessary. However, many platforms require additional tools (SDKs) to be installed to be able to export. Additionally, Godot needs export templates installed to create packages. The export menu will complain when something is missing and will not allow the user to export for that platform until they resolve it:
de: Die Default-Optionen für den Export sind häufig ausreichend, eine Anpassung ist daher üblicherweise nicht notwendig. Allerdings erfordern viele Plattformen zusätzliche Werkzeuge (SDKs), die vor dem Export installiert sein müssen. Außerdem benötigt Godot Exportvorlagen, die ebenfalls vorher installiert sein müssen. Das Exportmenü weist darauf hin, wenn eine Abhängigkeit fehlt und lässt den Export nicht zu, solange nicht alle Probleme behoben worden sind:

source: At that time, the user is expected to come back to the documentation and follow instructions on how to properly set up that platform.
de: Zu diesem Zeitpunkt wird vom Benutzer erwartet, dass er auf die Dokumentation zurückgreift und die Anweisungen zur ordnungsgemäßen Einrichtung dieser Plattform befolgt.

source: Export templates
de: Exportvorlagen

source: Apart from setting up the platform, the export templates must be installed to be able to export projects. They can be obtained as a TPZ file (which is a renamed ZIP archive) from the `download page of the website <https://www.godotengine.org/download>`_.
de: Abgesehen von der grundsätzlichen Einrichtung müssen auch die Exportvorlagen installiert sein, um Projekte zu exportieren. Sie können als TPZ-Dateien (ein umbenanntes ZIP-Archiv) aus dem `Download-Bereich der Webseite <https://www.godotengine.org/download>`_ bezogen werden.

source: Once downloaded, they can be installed using the **Install Export Templates** option in the editor:
de: Einmal heruntergeladen, können sie unter **Exportvorlage Installieren** im Editor installiert werden:

source: Resource options
de: Ressourcenoptionen

source: When exporting, Godot makes a list of all the files to export and then creates the package. There are 3 different modes for exporting:
de: Beim Exportieren erzeugt Godot eine Liste aller zu exportierenden Dateien und erstellt dann das Paket. Es gibt 3 verschiedene Export-Modi:

source: Export all resources in the project
de: Alle Ressourcen des Projekts exportieren

source: Export selected scenes (and dependencies)
de: Ausgewählte Szenen (inklusive Abhängigkeiten) exportieren

source: Export selected resources (and dependencies)
de: Ausgewählte Ressourcen (inklusive Abhängigkeiten) exportieren

source: **Export all resources in the project** will export every resource in the project. **Export selected scenes** and **Export selected resources** gives you a list of the scenes or resources in the project, and you have to select every scene or resource you want to export.
de: **Alle Ressourcen des Projekts exportieren** wird jede Ressource im Projekt exportieren. **Ausgewählte Szenen exportieren** und **Ausgewählte Ressourcen exportieren** gibt Ihnen eine Liste der Szenen oder Ressourcen im Projekt, und Sie müssen jede Szene oder Ressource auswählen, die Sie exportieren möchten.

source: Files and folders whose name begin with a period will never be included in the exported project. This is done to prevent version control folders like ``.git`` from being included in the exported PCK file.
de: Dateien und Ordner, deren Namen mit einem Punkt beginnen, werden nie in das exportierte Projekt aufgenommen. Dies geschieht, um zu verhindern, dass Versionskontrollordner wie ``.git`` in die exportierte PCK-Datei aufgenommen werden.

source: Below the list of resources are two filters that can be setup. The first allows non resource files such as ``.txt``, ``.json`` and ``.csv`` to be exported with the project. The second filter can be used to exclude every file of a certain type without manually deselecting every one. For example, ``.png`` files.
de: Unterhalb der Ressourcenliste befinden sich zwei Filter, die eingerichtet werden können. Der erste erlaubt es, Nicht-Ressourcen-Dateien wie ``.txt``, ``.json`` und ``.csv`` mit dem Projekt zu exportieren. Der zweite Filter kann verwendet werden, um alle Dateien eines bestimmten Typs auszuschließen, ohne dass jede einzelne Datei manuell abgewählt werden muss. Zum Beispiel, ``.png`` Dateien.

source: Configuration files
de: Konfigurationsdateien

source: The export configuration is stored in two files that can both be found in the project directory:
de: Die Exportkonfiguration wird in zwei Dateien gespeichert, die beide im Projektverzeichnis zu finden sind:

source: ``export_presets.cfg``: This file contains the vast majority of the export configuration and can be safely committed to version control. There is nothing in here that you would normally have to keep secret.
de: ``export_presets.cfg``: Diese Datei enthält den größten Teil der Exportkonfiguration und kann sicher in die Versionsverwaltung commitet werden. Hier gibt es nichts, was Sie normalerweise geheim halten müssten.

source: ``.godot/export_credentials.cfg``: This file contains export options that are considered confidential, like passwords and encryption keys. It should generally **not** be committed to version control or shared with others unless you know exactly what you are doing.
de: ``.godot/export_credentials.cfg``: Diese Datei enthält Exportoptionen, die als vertraulich gelten, wie Passwörter und Verschlüsselungsschlüssel. Sie sollte im Allgemeinen **nicht** in die Versionsverwaltung committet oder mit anderen geteilt werden, es sei denn, Sie wissen genau, was Sie tun.

source: Since the credentials file is usually kept out of version control systems, some export options will be missing if you clone the project to a new machine. The easiest way to deal with this is to copy the file manually from the old location to the new one.
de: Da die Datei mit den Anmeldeinformationen normalerweise nicht in Versionsverwaltungssystemen gespeichert wird, fehlen einige Exportoptionen, wenn Sie das Projekt auf einen neuen Rechner klonen. Am einfachsten ist es, die Datei manuell vom alten Speicherort zum neuen zu kopieren.

source: Exporting from the command line
de: Von der Kommandozeile exportieren

source: In production, it is useful to automate builds, and Godot supports this with the ``--export`` and ``--export-debug`` command line parameters. Exporting from the command line still requires an export preset to define the export parameters. A basic invocation of the command would be:
de: Im Produktionsbetrieb ist es nützlich, Builds zu automatisieren, und Godot unterstützt dies mit den Kommandozeilenparametern ``--export`` und ``--export-debug``. Der Export von der Kommandozeile aus erfordert immer noch ein Exportprofil, um die Exportparameter zu definieren. Ein einfacher Aufruf des Befehls würde wie folgt aussehen:

source: This will export to ``some_name.exe``, assuming there is a preset called "Windows Desktop" and the template can be found. (The export preset name must be written within quotes if it contains spaces or special characters.) The output path is *relative to the project path* or *absolute*; **it does not respect the directory the command was invoked from**.
de: Es wird nach ``some_name.exe`` exportiert, vorausgesetzt, es gibt ein Profil namens "Windows Desktop" und die Vorlage kann gefunden werden. (Der Name des Exportprofils muss in Anführungszeichen geschrieben werden, wenn er Leer- oder Sonderzeichen enthält) Der Ausgabepfad ist *relativ zum Projektpfad* oder *absolut*; **er beachtet nicht das Verzeichnis, aus dem der Befehl aufgerufen wurde**.

source: The output file extension should match the one used by the Godot export process:
de: Die Dateierweiterung der Ausgabedatei sollte mit derjenigen übereinstimmen, die vom Godot-Exportprozess verwendet wird:

source: macOS: ``.zip`` (from all platforms) or ``.dmg`` (only when exporting *from* macOS). ``.app`` is not supported directly, although the generated ZIP archive contains an ``.app`` bundle.
de: macOS: ``.zip`` (von allen Plattformen) oder ``.dmg`` (nur beim Exportieren *von* macOS). ``.app`` wird nicht direkt unterstützt, obwohl das erzeugte ZIP-Archiv ein ``. app``-Bundle enthält.

source: Linux: Any extension (including none). ``.x86_64`` is typically used for 64-bit x86 binaries.
de: Linux: Jede Erweiterung (auch keine). ``.x86_64`` wird typischerweise für 64-Bit-x86-Binärdateien verwendet.

source: You can also configure it to export *only* the PCK or ZIP file, allowing a single exported main pack file to be used with multiple Godot executables. When doing so, the export preset name must still be specified on the command line:
de: Sie können es auch so konfigurieren, dass *nur* die PCK- oder ZIP-Datei exportiert wird, so dass ein einziger Export mit mehreren ausführbaren Godot-Programmen verwendet werden kann. Wenn Sie dies tun, muss der Name des Exportprofils weiterhin in der Kommandozeile angegeben werden:

source: It is often useful to combine the ``--export`` flag with the ``--path`` flag, so that you do not need to ``cd`` to the project folder before running the command:
de: Es ist oft nützlich, das ``--export``-Flag mit dem ``--path``-Flag zu kombinieren, um nicht mit ``cd`` in den Projektordner wechseln zu müssen:

source: See :ref:`doc_command_line_tutorial` for more information about using Godot from the command line.
de: Siehe :ref:`doc_command_line_tutorial` für weitere Informationen über die Verwendung von Godot über die Kommandozeile.

source: PCK versus ZIP pack file formats
de: PCK vs. ZIP Pack-Dateiformat

source: Each format has its upsides and downsides. PCK is the default and recommended format for most use cases, but you may want to use a ZIP archive instead depending on your needs.
de: Jedes Format hat seine Vor- und Nachteile. PCK ist der Default und das empfohlene Format für die meisten Anwendungsfälle. Abhängig von Ihren Anforderungen können Sie jedoch stattdessen ein ZIP-Archiv verwenden.

source: Uncompressed format. Larger file size, but faster to read/write.
de: Unkomprimiertes Format. Größere Datei, aber schneller zu lesen/schreiben.

source: Not readable and writable using tools normally present on the user's operating system, even though there are `third-party tools <https://github.com/hhyyrylainen/GodotPckTool>`__ to extract and create PCK files.
de: Nicht lesbar und beschreibbar mit Tools, die normalerweise auf dem Betriebssystem des Benutzers vorhanden sind, obwohl es `Tools von Drittanbietern <https://github.com/hhyyrylainen/GodotPckTool>`__ zum Extrahieren und Erstellen von PCK-Dateien gibt.

source: Compressed format. Smaller file size, but slower to read/write.
de: Komprimiertes Format. Kleinere Dateigröße, aber langsamer zu lesen/schreiben.

source: Readable and writable using tools normally present on the user's operating system. This can be useful to make modding easier (see also :ref:`doc_exporting_pcks`).
de: Lesbar und Schreibbar mit Tools, die normalerweise auf dem Betriebssystem des Benutzers vorhanden sind. Dies kann nützlich sein, um das Modden zu vereinfachen (siehe auch :ref:`doc_exporting_pcks`).

source: Due to a `known bug <https://github.com/godotengine/godot/pull/42123>`__, when using a ZIP file as a pack file, the exported binary will not try to use it automatically. Therefore, you have to create a *launcher script* that the player can double-click or run from a terminal to launch the project::
de: Aufgrund eines `bekannten Bugs <https://github.com/godotengine/godot/pull/42123>`__, wenn Sie eine ZIP-Datei als Pack-Datei verwenden, versucht die exportierte Binärdatei nicht, diese automatisch zu verwenden. Daher müssen Sie ein *Launcher-Skript* erstellen, das der Spieler per Doppelklick oder über ein Terminal ausführen kann, um das Projekt zu starten::

source: Save the launcher script and place it in the same folder as the exported binary. On Linux, make sure to give executable permissions to the launcher script using the command ``chmod +x launch.sh``.
de: Speichern Sie das Launcher-Skript und legen Sie es im selben Ordner wie die exportierte Binärdatei ab. Erteilen Sie unter Linux dem Launcher-Skript mit dem Befehl ``chmod +x launch.sh`` die Berechtigung zur Ausführung.

source: Translation status
de: Übersetzungsstatus
