Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_web.po
Languages: de, zh_tw

source: Exporting for the Web
de: Exportieren für das Web
zh_tw: 為 Web 匯出

source: This page describes how to export a Godot project to HTML5. If you're looking to compile editor or export template binaries from source instead, read :ref:`doc_compiling_for_web`.
de: Diese Seite beschreibt, wie man ein Godot-Projekt nach HTML5 exportiert. Wenn Sie stattdessen Editor- oder Exportvorlagen-Binärdateien aus dem Quellcode kompilieren möchten, lesen Sie :ref:`doc_compiling_for_web`.
zh_tw: 這個頁面描述的是如何將 Godot 專案匯出到 HTML。如果你想要找的是從源碼編譯編輯器或匯出範本二進位檔案，請閱讀 :ref:`doc_compiling_for_web`。

source: HTML5 export allows publishing games made in Godot Engine to the browser. This requires support for `WebAssembly <https://webassembly.org/>`__, `WebGL <https://www.khronos.org/webgl/>`__ and `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`_ in the user's browser.
de: Der HTML5-Export ermöglicht die Veröffentlichung von Spielen im Browser, die in der Godot Engine erstellt wurden. Dies erfordert Unterstützung für `WebAssembly <https://webassembly.org/>`__, `WebGL <https://www.khronos.org/webgl/>`__ und `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`_ im Browser des Benutzers.
zh_tw: 匯出 HTML5 可以將 Godot Engine 做的遊戲發行在瀏覽器上。該功能需要使用者瀏覽器有支援 `WebAssembly <https://webassembly.org/>`__ 與 `WebGL <https://www.khronos.org/webgl/>`__ 。

source: Projects written in C# using Godot 4 currently cannot be exported to the web. To use C# on web platforms, use Godot 3 instead.
de: Projekte, die in C# mit Godot 4 geschrieben wurden, können derzeit nicht ins Web exportiert werden. Für die Verwendung von C# auf Web-Plattformen sollten Sie stattdessen Godot 3 verwenden.
zh_tw: 使用 Godot 4 以 C# 編寫的專案目前無法匯出到 Web。若要在 Web 平台上使用 C#，請改用 Godot 3。

source: Use the browser-integrated developer console, usually opened with :kbd:`F12` (:kbd:`Cmd + Option + I` on macOS), to view **debug information** like JavaScript, engine, and WebGL errors.
de: Verwenden Sie die in den Browser integrierte Entwicklerkonsole, die normalerweise mit :kbd:`F12` (:kbd:`Cmd + Option + I` unter macOS) geöffnet wird, um **Debug-Informationen** wie JavaScript-, Engine- und WebGL-Fehler anzuzeigen.

source: Godot 4's HTML5 exports currently cannot run on macOS and iOS due to upstream bugs with SharedArrayBuffer and WebGL 2.0. We recommend using :ref:`macOS <doc_exporting_for_macos>` and :ref:`iOS <doc_exporting_for_ios>` native export functionality instead, as it will also result in better performance.
de: Die HTML5-Exporte von Godot 4 können derzeit aufgrund von Upstream-Fehlern mit SharedArrayBuffer und WebGL 2.0 nicht auf macOS und iOS ausgeführt werden. Wir empfehlen, stattdessen die nativen Exportfunktionen :ref:`macOS <doc_exporting_for_macos>` und :ref:`iOS <doc_exporting_for_ios>` zu verwenden, da diese auch eine bessere Performance bieten.
zh_tw: 由於 SharedArrayBuffer 和 WebGL 2.0 的上游錯誤，Godot 4 的 HTML5 匯出目前無法在 macOS 和 iOS 上運作。我們建議改用 macOS <doc_exporting_for_macos>` 和 iOS <doc_exporting_for_ios>` 本機匯出功能，因為它也會帶來更好的效能。

source: Godot 3's HTML5 exports are more compatible with various browsers in general, especially when using the GLES2 rendering backend (which only requires WebGL 1.0).
de: Die HTML5-Exporte von Godot 3 sind im Allgemeinen besser mit verschiedenen Browsern kompatibel, insbesondere bei Verwendung des GLES2-Rendering-Backends (das nur WebGL 1.0 erfordert).
zh_tw: 一般來說，Godot 3 的 HTML5 匯出與各種瀏覽器更相容，特別是在使用 GLES2 算繪後端（只需要 WebGL 1.0）時。

source: Godot 4.0 and later can only target WebGL 2.0 (using the Compatibility rendering method). There is no stable way to run Vulkan applications on the web yet.
de: Godot 4.0 und spätere Versionen können nur WebGL 2.0 (unter Verwendung der Kompatibilitäts-Rendering-Methode) ansteuern. Es gibt noch keine stabile Möglichkeit, Vulkan-Anwendungen im Web auszuführen.
zh_tw: Godot 4.0 及更高版本只能針對 WebGL 2.0（使用相容性算繪方法）。目前還沒有穩定的方法在網路上運作 Vulkan 應用程式。

source: See `Can I use WebGL 2.0 <https://caniuse.com/webgl2>`__ for a list of browser versions supporting WebGL 2.0. Note that Safari has several issues with WebGL 2.0 support that other browsers don't have, so we recommend using a Chromium-based browser or Firefox if possible.
de: Eine Liste der Browser-Versionen, die WebGL 2.0 unterstützen, finden Sie unter `Kann ich WebGL 2.0 verwenden <https://caniuse.com/webgl2>`__. Beachten Sie, dass Safari einige Probleme mit der Unterstützung von WebGL 2.0 hat, die andere Browser nicht haben. Wir empfehlen daher, wenn möglich einen Chromium-basierten Browser oder Firefox zu verwenden.
zh_tw: 有關支援 WebGL 2.0 的瀏覽器版本列表，請參閱「我可以使用 WebGL 2.0 <https://caniuse.com/webgl2>」。請注意，Safari 在 WebGL 2.0 支援方面存在一些其他瀏覽器不具備的問題，因此我們建議盡可能使用基於 Chromium 的瀏覽器或 Firefox 。

source: Export options
de: Exportoptionen
zh_tw: 匯出選項

source: If a runnable web export template is available, a button appears between the *Stop scene* and *Play edited Scene* buttons in the editor to quickly open the game in the default browser for testing.
de: Wenn eine ausführbare Web-Exportvorlage verfügbar ist, wird im Editor ein Button zwischen den Buttons *Szene stoppen* und *Bearbeitete Szene abspielen* angezeigt, um das Spiel schnell im Default-Browser zum Testen zu öffnen.
zh_tw: 若有可執行的網頁匯出樣板，則在編輯器上 **[停止場景]** 與 **[執行編輯的場景]** 按鈕中間會多一個按鈕，可以用來在預設瀏覽器中快速開啟遊戲來測試。

source: If you plan to use :ref:`VRAM compression <doc_importing_images>` make sure that **Vram Texture Compression** is enabled for the targeted platforms (enabling both **For Desktop** and **For Mobile** will result in a bigger, but more compatible export).
de: Wenn Sie :ref:`VRAM-Komprimierung <doc_importing_images>` verwenden wollen, stellen Sie sicher, dass **Vram-Texturkompression** für die Target-Plattformen aktiviert ist (wenn Sie sowohl **Für Desktop** als auch **Für Mobile** aktivieren, wird der Export größer, aber kompatibler).
zh_tw: 如果你打算使用 :ref:`VRAM compression <doc_import_images>` ，請確保為目標平臺啟用 **Vram Texture Compression** （同時啟用 **For Desktop** 和 **For Mobile** 將導致更大，但更相容的匯出）。

source: If a path to a **Custom HTML shell** file is given, it will be used instead of the default HTML page. See :ref:`doc_customizing_html5_shell`.
de: Wenn man einen Pfad zu einer **benutzerdefinierten HTML-Shell**-Datei angibt, wird dieser anstelle der Standard-HTML-Seite verwendet. Siehe :ref:`doc_customizing_html5_shell`.
zh_tw: 若有設定 **預設 HTML Shell** 檔案，則會用這個檔案而非預設 HTML 頁面。請參考 :ref:doc_customizing_html5_shell` 。

source: **Head Include** is appended into the ``<head>`` element of the generated HTML page. This allows to, for example, load webfonts and third-party JavaScript APIs, include CSS, or run JavaScript code.
de: **Head Include** wird an das Element ``<head>`` der generierten HTML-Seite angehängt. Auf diese Weise können Sie beispielsweise Webfonts und JavaScript-APIs von Drittanbietern laden, CSS hinzufügen oder JavaScript-Code ausführen.
zh_tw: **Head Include** 會被加到產生的 HTML 頁面中 ``<head>`` 元素的尾端。這樣便可以達成如載入 Webfont 或第三方 JavaScript API、加上 CSS 或執行 JavaScript 等功能。

source: Each project must generate their own HTML file. On export, several text placeholders are replaced in the generated HTML file specifically for the given export options. Any direct modifications to that HTML file will be lost in future exports. To customize the generated file, use the **Custom HTML shell** option.
de: Jedes Projekt muss seine eigene HTML-Datei generieren. Beim Export werden einige Textplatzhalter in der generierten HTML-Datei speziell für die gegebenen Exportoptionen ersetzt. Alle direkten Änderungen an dieser HTML-Datei gehen bei zukünftigen Exporten verloren. Um die generierte Datei anzupassen, verwenden Sie die Option **Custom HTML shell**.
zh_tw: 每個專案都會產生自己的 HTML 檔案。匯出時，**產生的 HTML 檔案** 中的各個預留位置都會依據給定的匯出選項取代。若直接修改 **產生的 HTML 檔案** ，則未來匯出的時候都會遺失這些修改。若要自定產生的檔案，請參考 :ref:`doc_customizing_html5_shell` 。

source: Limitations
de: Einschränkungen
zh_tw: 限制

source: For security and privacy reasons, many features that work effortlessly on native platforms are more complicated on the web platform. Following is a list of limitations you should be aware of when porting a Godot game to the web.
de: Aus Sicherheits- und Datenschutzgründen sind viele Funktionen, die auf nativen Plattformen mühelos funktionieren, auf der Webplattform komplizierter. Im Folgenden finden Sie eine Liste der Einschränkungen, die Sie beim Portieren eines Godot-Spiels ins Web beachten sollten.
zh_tw: 由於安全性與隱私權問題，要將許多在原生平台上能輕鬆運作的功能放到 Web 平台上會很複雜。以下列出了一些在將 Godot 遊戲移植到網頁時應注意的限制。

source: Browser vendors are making more and more functionalities only available in `secure contexts <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>`_, this means that such features are only be available if the web page is served via a secure HTTPS connection (localhost is usually exempt from such requirement).
de: Browser-Hersteller stellen immer mehr Funktionen nur in `sicheren Kontexten <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>`_ zur Verfügung, d.h. solche Funktionen sind nur verfügbar, wenn die Webseite über eine sichere HTTPS-Verbindung bedient wird (localhost ist in der Regel von dieser Anforderung ausgenommen).
zh_tw: 瀏覽器供應商正在使越來越多的功能只在 `安全本文 <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>`_ 中可用，這意味著這些功能只有在通過安全的HTTPS連接提供網頁時才可用（localhost通常不受這種要求影響）。

source: Using cookies for data persistence
de: Verwenden von Cookies für die Datenbeständigkeit
zh_tw: 使用 Cookie 來保留資料

source: Users must **allow cookies** (specifically IndexedDB) if persistence of the ``user://`` file system is desired. When playing a game presented in an ``iframe``, **third-party** cookies must also be enabled. Incognito/private browsing mode also prevents persistence.
de: Benutzer müssen **Cookies** (insbesondere IndexedDB) zulassen, wenn die Beständigkeit des ``user://``-Dateisystems gewünscht ist. Beim Spielen eines Spiels, das in einem ``iframe`` präsentiert wird, müssen **Cookies von Drittanbietern** ebenfalls zugelassen werden. Der Inkognito/Private-Browsing-Modus verhindert ebenfalls die Beständigkeit.
zh_tw: 若要保留 ``user://`` 檔案系統中的資料，則使用者必須要 **允許 Cookie** (尤其是 IndexedDB)。若在 ``iframe`` 內玩遊戲的話，則必須同時啟用 **第三方** Cookie。隱私模式也會防止保留資料。

source: The method ``OS.is_userfs_persistent()`` can be used to check if the ``user://`` file system is persistent, but can give false positives in some cases.
de: Die Methode ``OS.is_userfs_persistent()`` kann verwendet werden um zu überprüfen, ob das ``user: //``-Dateisystem nutzbar ist, kann aber in einigen Fällen Falsch-Positive liefern.
zh_tw: ``OS.is_userfs_persistent()`` 方法可以用來檢查 ``user://`` 檔案系統是否會被保留，但有時候檢查結果不會是正確的。

source: Background processing
de: Hintergrundverarbeitung
zh_tw: 背景

source: The project will be paused by the browser when the tab is no longer the active tab in the user's browser. This means functions such as ``_process()`` and ``_physics_process()`` will no longer run until the tab is made active again by the user (by switching back to the tab). This can cause networked games to disconnect if the user switches tabs for a long duration.
de: Das Projekt wird vom Browser pausiert, wenn der Tab nicht mehr der aktive Tab im Browser des Benutzers ist. Das bedeutet, daß Funktionen wie ``_process()`` und ``_physics_process()`` nicht mehr ausgeführt werden, bis der Tab vom Benutzer wieder aktiv gemacht wird (durch Zurückschalten auf den Tab). Dies kann dazu führen, daß Netzwerkspiele die Verbindung unterbrechen, wenn der Benutzer für längere Zeit die Tabs wechselt.
zh_tw: 這個標籤頁不再是使用者瀏覽器的活動標籤頁時，專案就會被瀏覽器暫停。也就是說不會運作 ``_process()``、``_physics_process()`` 等函式，除非使用者重新啟動了這個標籤頁（切換到這個標籤頁）。如果使用者在標籤頁外停留了過長的時間，就可能造成網路遊戲的掉線。

source: This limitation does not apply to unfocused browser *windows*. Therefore, on the user's side, this can be worked around by running the project in a separate *window* instead of a separate tab.
de: Diese Einschränkung gilt nicht für nicht fokussierte Browser-*Fenster*. Auf der Benutzerseite kann dies daher umgangen werden, indem das Projekt in einem separaten *Fenster* statt in einem separaten Tab ausgeführt wird.
zh_tw: 這一限制不適用於丟失焦點的瀏覽器*視窗*。因此，對於使用者而言，變通方法是讓專案運作在一個單獨的*視窗*中，而不是標籤頁。

source: Full screen and mouse capture
de: Aufnahme des gesamten Bildschirms und der Maus
zh_tw: 全螢幕與滑鼠截取

source: Browsers do not allow arbitrarily **entering full screen**. The same goes for **capturing the cursor**. Instead, these actions have to occur as a response to a JavaScript input event. In Godot, this means entering full screen from within a pressed input event callback such as ``_input`` or ``_unhandled_input``. Querying the :ref:`class_Input` singleton is not sufficient, the relevant input event must currently be active.
de: Die Browser erlauben es nicht, willkürlich **den Vollbildmodus** zu aktivieren. Dasselbe gilt für das **Erfassen des Cursors**. Stattdessen müssen diese Aktionen als Antwort auf ein JavaScript-Eingabeereignis erfolgen. In Godot bedeutet dies, den Vollbildmodus aus einem gedrückten Eingabe-Ereignis-Callback wie ``_input`` oder ``_unhandled_input``. Die Abfrage des :ref:`class_Input`-Singletons reicht nicht aus, das entsprechende Eingabeereignis muss aktuell aktiv sein.
zh_tw: 瀏覽器不允許任意 **進入全螢幕** 模式。同樣地，也不允許隨時 **截取滑鼠遊標** 。這些操作必須要改為用 JavaScript 輸入事件來處理。這代表，在 Godot 中必須要在按鍵輸入事件回呼 (如 ``_input`` 或 ``_unhandled_input``) 中才能進入全螢幕。用 :ref:``class_Input``單例來查詢還不夠，必須要啟用相關的輸入事件。

source: For the same reason, the full screen project setting doesn't work unless the engine is started from within a valid input event handler. This requires :ref:`customization of the HTML page <doc_customizing_html5_shell>`.
de: Aus dem gleichen Grund funktioniert die Vollbild-Projekteinstellung nur, wenn die Engine in einem gültigen Eingabe-Event-Handler gestartet wird. Dies erfordert eine :ref:`Anpassung der HTML-Seite <doc_customizing_html5_shell>`.
zh_tw: 出於相同原因，除非引擎是從有效的輸入事件處理常式中開始的，否則無法使用全螢幕專案設定。要設定則需要 :ref:`自定 HTML 頁面 <doc_customizing_html5_shell>` 。

source: Some browsers restrict autoplay for audio on websites. The easiest way around this limitation is to request the player to click, tap or press a key/button to enable audio, for instance when displaying a splash screen at the start of your game.
de: Einige Browser schränken die automatische Wiedergabe von Audio auf Websites ein. Die einfachste Möglichkeit, diese Einschränkung zu umgehen, besteht darin, den Spieler aufzufordern, einen Button anzuklicken, zu berühren oder eine Taste zu drücken, um den Ton zu aktivieren, z.B. wenn ein Startbildschirm zu Beginn des Spiels angezeigt wird.

source: Google offers additional information about their `Web Audio autoplay policies <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
de: Google bietet zusätzliche Informationen zu den Richtlinien für die `automatische Wiedergabe von Web-Audio <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
zh_tw: Google 有提供關於 `網頁音訊自動播放政策 (英文) <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__ 的額外資訊。

source: Apple's Safari team also posted additional information about their `Auto-Play Policy Changes for macOS <https://webkit.org/blog/7734/auto-play-policy-changes-for-macos/>`__.
de: Das Safari-Team von Apple hat außerdem zusätzliche Informationen über die `Änderungen der Auto-Play-Richtlinie für macOS <https://webkit.org/blog/7734/auto-play-policy-changes-for-macos/>`__ veröffentlicht.

source: Access to microphone requires a :ref:`secure context <doc_javascript_secure_contexts>`.
de: Der Zugriff auf das Mikrofon erfordert einen :ref:`sicheren Kontext <doc_javascript_secure_contexts>`.
zh_tw: 存取麥克風需要:ref:`安全本文 <doc_javascript_secure_contexts>`。

source: Networking
de: Netzwerkfunktionen
zh_tw: 網路

source: Low level networking is not implemented due to lacking support in browsers.
de: Low-Level-Networking ist aufgrund mangelnder Unterstützung in Browsern nicht implementiert.
zh_tw: 由於缺乏瀏覽器的支援，低級別的網路沒有實作。

source: Currently, only :ref:`HTTP client <doc_http_client_class>`, :ref:`HTTP requests <doc_http_request_class>`, :ref:`WebSocket (client) <doc_websocket>` and :ref:`WebRTC <doc_webrtc>` are supported.
de: Derzeit werden nur :ref:`HTTP-Client <doc_http_client_class>`, :ref:`HTTP-Anfragen <doc_http_request_class>`, :ref:`WebSocket (Client) <doc_websocket>` und :ref:`WebRTC <doc_webrtc>` unterstützt.
zh_tw: 目前，只有 :ref:`HTTP client <doc_http_client_class>`, :ref:`HTTP requests <doc_http_request_class>`, :ref:`WebSocket (client) <doc_websocket>` 和 :ref:`WebRTC <doc_webrtc>` 被支援。

source: The HTTP classes also have several restrictions on the HTML5 platform:
de: Die HTTP-Klassen haben verschiedene Einschränkungen für die HTML5-Plattform:
zh_tw: 在 HTML5 平台上，HTTP 類別有一些限制：

source: Accessing or changing the ``StreamPeer`` is not possible
de: Der Zugriff auf den ``StreamPeer`` ist nicht möglich
zh_tw: 無法存取或更改 ``StreamPeer``

source: Threaded/Blocking mode is not available
de: Threaded/Blocking-Modus ist nicht verfügbar
zh_tw: 無法使用 Threaded/Blocking 模式

source: Cannot progress more than once per frame, so polling in a loop will freeze
de: Der Fortschritt kann nicht mehr als einmal pro Frame ausgeführt werden, sodass Polling in einer Schleife zum Einfrieren führt
zh_tw: 每影格無法處理多次，因此在迴圈內輪詢會導致程式凍結

source: No chunked responses
de: Keine Chunked Responses
zh_tw: 無法區塊回覆

source: Host verification cannot be disabled
de: Die Host-Verifizierung kann nicht deaktiviert werden
zh_tw: 無法禁用主機驗證

source: Subject to `same-origin policy <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
de: Vorbehaltlich der `same-origin policy <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
zh_tw: 必須遵守 `同源政策 (Same-origin policy) <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__

source: Clipboard
de: Zwischenablage
zh_tw: 剪貼簿

source: Clipboard synchronization between engine and the operating system requires a browser supporting the `Clipboard API <https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API>`__, additionally, due to the API asynchronous nature might not be reliable when accessed from GDScript.
de: Die Synchronisierung der Zwischenablage zwischen der Engine und dem Betriebssystem erfordert einen Browser, der die `Clipboard-API <https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API>`__ unterstützt, außerdem kann es aufgrund der asynchronen Natur der API sein, dass der Zugriff von GDScript aus nicht zuverlässig ist.
zh_tw: 在引擎和作業系統之間同步剪貼板需要瀏覽器 `剪貼板 API <https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API>`__ ，此外，由於該 API 的非同步性，從 GDScript 存取時可能不可靠。

source: Requires a :ref:`secure context <doc_javascript_secure_contexts>`.
de: Erfordert einen :ref:`sicheren Kontext <doc_javascript_secure_contexts>`.
zh_tw: 需要:ref:`安全本文 <doc_javascript_secure_contexts>`。

source: Gamepads will not be detected until one of their button is pressed. Gamepads might have the wrong mapping depending on the browser/OS/gamepad combination, sadly the `Gamepad API <https://developer.mozilla.org/en-US/docs/Web/API/Gamepad_API/Using_the_Gamepad_API>`__ does not provide a reliable way to detect the gamepad information necessary to remap them based on model/vendor/OS due to privacy considerations.
de: Gamepads werden nicht erkannt, bis eine ihrer Tasten gedrückt wird. Gamepads können je nach Browser/OS/Gamepad-Kombination eine falsche Zuordnung haben. Leider bietet die `Gamepad-API <https://developer.mozilla.org/en-US/docs/Web/API/Gamepad_API/Using_the_Gamepad_API>`__ aus Datenschutzgründen keine zuverlässige Möglichkeit, die Gamepad-Informationen zu erkennen, die für eine Neuzuordnung auf Basis von Modell/Hersteller/OS erforderlich sind.
zh_tw: 按下遊戲手柄上面的任一按鈕之後，這個遊戲手柄才能被偵測到。根據瀏覽器、作業系統、遊戲手柄三者的組合不同，遊戲手柄的對應可能有誤，可惜由於隱私方面的考慮， `遊戲手柄 API <https://developer.mozilla.org/en-US/docs/Web/API/Gamepad_API/Using_the_Gamepad_API>`__ 並沒有提供可靠的方法來偵測遊戲手柄的資訊，因而無法根據模型、供應商、作業系統來進行重新對應。

source: Boot splash is not displayed
de: Boot-Splash wird nicht angezeigt
zh_tw: 不會顯示啟動畫面

source: The default HTML page does not display the boot splash while loading. However, the image is exported as a PNG file, so :ref:`custom HTML pages <doc_customizing_html5_shell>` can display it.
de: Auf der Default-HTML-Seite wird beim Laden kein Boot Splash angezeigt. Das Bild wird jedoch als PNG-Datei exportiert, sodass :ref:`benutzerdefinierte HTML-Seiten <doc_customizing_html5_shell>` es anzeigen können.
zh_tw: 預設 HTML 頁面不會在載入時顯示啟動畫面。但，圖片是匯出為 PNG 檔案，所以 :ref:`自定 HTML 頁面 <doc_customizing_html5_shell>` 可以顯示圖片。

source: Serving the files
de: Dateien bereitstellen
zh_tw: 提供檔案

source: Exporting for the web generates several files to be served from a web server, including a default HTML page for presentation. A custom HTML file can be used, see :ref:`doc_customizing_html5_shell`.
de: Beim Exportieren für das Web werden mehrere Dateien erzeugt, die von einem Webserver bereitgestellt werden, einschließlich einer Standard-HTML-Seite für die Präsentation. Eine benutzerdefinierte HTML-Datei kann verwendet werden, siehe :ref:`doc_customizing_html5_shell`.
zh_tw: 匯出網頁會產生多個用來在網頁伺服器上提供的檔案，其中包含一個用來顯示的預設 HTML 頁面。可以使用自定 HTML 檔案，請參考 :ref:`doc_customizing_html5_shell` 。

source: To ensure low audio latency and the ability to use :ref:`class_Thread` in web exports, Godot 4 web exports always use `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`__. This requires a :ref:`secure context <doc_javascript_secure_contexts>`, while also requiring the following CORS headers to be set when serving the files:
de: Um eine niedrige Audio-Latenz und die Fähigkeit zur Verwendung von :ref:`class_Thread` in Web-Exporten zu gewährleisten, verwenden Godot 4-Web-Exporte immer `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`__. Dies erfordert einen :ref:`sicheren Kontext <doc_javascript_secure_contexts>`, wobei auch die folgenden CORS-Header beim Servieren der Dateien gesetzt werden müssen:

source: If you don't control the web server or are unable to add response headers, use `coi-serviceworker <https://github.com/gzuidhof/coi-serviceworker>`__ as a workaround.
de: Wenn Sie keine Kontrolle über den Webserver haben oder nicht in der Lage sind, Response-Header hinzuzufügen, verwenden Sie `coi-serviceworker <https://github.com/gzuidhof/coi-serviceworker>`__ als Workaround.

source: If the client doesn't receive the required response headers, **the project will not run**.
de: Wenn der Client die erforderlichen Antwort-Header nicht erhält, wird **das Projekt nicht ausgeführt**.

source: The generated ``.html`` file can be used as ``DirectoryIndex`` in Apache servers and can be renamed to e.g. ``index.html`` at any time. Its name is never depended on by default.
de: Die erzeugte ``.html``-Datei kann als ``DirectoryIndex`` in Apache-Servern verwendet werden und kann jederzeit in z.B. ``index.html`` umbenannt werden. Auf ihren Namen wird standardmäßig nie zurückgegriffen.

source: The HTML page draws the game at maximum size within the browser window. This way, it can be inserted into an ``<iframe>`` with the game's size, as is common on most web game hosting sites.
de: Die HTML-Seite zeichnet das Spiel in maximaler Größe innerhalb des Browserfensters. Auf diese Weise kann sie in einen ``<iframe>`` mit der Größe des Spiels eingefügt werden, wie es auf den meisten Web-Spiele-Hosting-Seiten üblich ist.
