Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_android.po
Languages: de

source: Exporting for Android
de: Exportieren für Android

source: This page describes how to export a Godot project to Android. If you're looking to compile export template binaries from source instead, read :ref:`doc_compiling_for_android`.
de: Diese Seite beschreibt, wie man ein Godot-Projekt nach Android exportiert. Wenn Sie stattdessen Exportvorlagen-Binärdateien aus dem Quellcode kompilieren möchten, lesen Sie :ref:`doc_compiling_for_android`.

source: Exporting for Android has fewer requirements than compiling Godot for Android. The following steps detail what is needed to set up the Android SDK and the engine.
de: Das Exportieren für Android stellt weniger Anforderungen als das Kompilieren von Godot. In den folgenden Schritten wird detailliert beschrieben, was zum Einrichten des SDK und der Engine erforderlich ist.

source: Projects written in C# can be exported to Android as of Godot 4.2, but support is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
de: In C# geschriebene Projekte können ab Godot 4.2 nach Android exportiert werden, aber die Unterstützung ist experimentell und :ref:`Es gelten einige Einschränkungen <doc_c_sharp_platforms>`.

source: Install OpenJDK 17
de: OpenJDK 17 installieren

source: Download and install `OpenJDK 17 <https://adoptium.net/temurin/releases/?variant=openjdk17>`__.
de: Laden Sie `OpenJDK 17 <https://adoptium.net/temurin/releases/?variant=openjdk17>`__ herunter und installieren Sie es.

source: Download the Android SDK
de: Android-SDK herunterladen

source: Download and install the Android SDK.
de: Laden Sie das Android SDK herunter und installieren Sie es.

source: You can install the Android SDK using `Android Studio version 4.1 or later <https://developer.android.com/studio/>`__.
de: Sie können das Android SDK mit `Android Studio Version 4.1 oder höher <https://developer.android.com/studio/>`__ installieren.

source: Run it once to complete the SDK setup using these `instructions <https://developer.android.com/studio/intro/update#sdk-manager>`__.
de: Führen Sie es einmal aus, um das SDK-Setup mithilfe dieser `Anweisungen <https://developer.android.com/studio/intro/update#sdk-manager>` __ abzuschließen.

source: Ensure that the `required packages <https://developer.android.com/studio/intro/update#recommended>`__ are installed as well.
de: Stellen Sie sicher, dass auch die `erforderlichen Pakete <https://developer.android.com/studio/intro/update#recommended>`__ installiert sind.

source: Android SDK Platform-Tools version 30.0.5 or later
de: Android SDK Platform-Tools Version 30.0.5 oder höher

source: Android SDK Platform 33
de: Android SDK Plattform 33

source: Android SDK Command-line Tools (latest)
de: Android SDK-Kommandozeilentools (aktuell)

source: Once the command line tools are installed, run the `sdkmanager <https://developer.android.com/studio/command-line/sdkmanager>`__ command to complete the setup process:
de: Führen Sie nach der Installation des Kommandozeilen-Tools den Befehl `sdkmanager <https://developer.android.com/studio/command-line/sdkmanager>` __ aus, um den Installationsvorgang abzuschließen:

source: If you are using Linux, **do not use an Android SDK provided by your distribution's repositories as it will often be outdated**.
de: Wenn Sie Linux verwenden, **verwenden Sie kein Android-SDK, das in den Repositorys Ihrer Distribution bereitgestellt wird, da es oft veraltet ist**.

source: Create a debug.keystore
de: Erstellen eines Debug-Keystore

source: Android needs a debug keystore file to install to devices and distribute non-release APKs. If you have used the SDK before and have built projects, ant or eclipse probably generated one for you (in the ``~/.android`` directory on Linux and macOS, in the ``C:\Users\<user>\.android\`` directory on Windows).
de: Android benötigt eine Debug-Keystore-Datei, um sie auf Geräten zu installieren und nicht freigegebene APKs zu veröffentlichen. Wenn Sie das SDK bereits verwendet und Projekte erstellt haben, hat Ant oder Eclipse wahrscheinlich eines für Sie generiert (im Verzeichnis ``~/.android`` unter Linux und MacOS, im ``C:\Benutzer\<Benutzer>\.android \`` Verzeichnis unter Windows).

source: If you can't find it or need to generate one, the keytool command from the JDK can be used for this purpose::
de: Wenn Sie diese nicht finden können oder eine solche generieren müssen, kann der Befehl keytool aus dem JDK dafür verwendet werden::

source: This will create a ``debug.keystore`` file in your current directory. You should move it to a memorable location such as ``%USERPROFILE%\.android\``, because you will need its location in a later step. For more information on ``keytool`` usage, see `this Q&A article <https://ask.godotengine.org/21349/jdk-android-file-missing>`__.
de: Dadurch wird eine Datei ``debug.keystore`` in Ihrem aktuellen Verzeichnis erstellt. Sie sollten diese Datei an einen einprägsamen Ort wie z.B. ``%USERPROFILE%\.android\`` verschieben, da Sie diesen Ort in einem späteren Schritt benötigen werden. Weitere Informationen über die Verwendung von ``keytool`` finden Sie in `diesem Q&A Artikel <https://ask.godotengine.org/21349/jdk-android-file-missing>`__.

source: It is important that the password is the same for the keystore and the key. This is a `known Android studio issue <https://developer.android.com/studio/known-issues#ki-key-keystore-warning>`__ that also affects Godot projects.
de: Es ist wichtig, dass das Passwort für den Keystore und den Schlüssel gleich ist. Dies ist ein `bekanntes Android-Studio-Problem <https://developer.android.com/studio/known-issues#ki-key-keystore-warning>`__, das auch Godot-Projekte betrifft.

source: Setting it up in Godot
de: Einrichtung in Godot

source: Enter the Editor Settings screen. This screen contains the editor settings for the user account in the computer (it's independent of the project).
de: Rufen Sie den Bildschirm Editoreinstellungen auf. Dieser Bildschirm enthält die Editoreinstellungen für das Benutzerkonto auf dem Computer (unabhängig vom Projekt).

source: Scroll down to the section where the Android settings are located:
de: Scrollen Sie nach unten zu dem Abschnitt, in dem sich die Android-Einstellungen befinden:

source: In that screen, 2 paths need to be set:
de: In diesem Bildschirm müssen 2 Pfade festgelegt werden:

source: The ``Android Sdk Path`` should be the location where the Android SDK was installed. - For example ``%LOCALAPPDATA%\Android\Sdk\`` on Windows or ``/Users/$USER/Library/Android/sdk/`` on macOS.
de: Der ``Android Sdk Path`` sollte der Ort sein, an dem das Android SDK installiert wurde. - Zum Beispiel ``%LOCALAPPDATA%\Android\Sdk\`` unter Windows oder ``/Users/$USER/Library/Android/sdk/`` unter macOS.

source: The debug ``.keystore`` file - It can be found in the folder where you put the ``debug.keystore`` file you created above.
de: Die Debug-Datei ``.keystore`` - Sie finden Sie in dem Ordner, in dem Sie die ``debug.keystore`` Datei abgelegt haben, die Sie oben erstellt haben.

source: Once that is configured, everything is ready to export to Android!
de: Sobald dies konfiguriert ist, kann alles auf Android exportiert werden!

source: If you get an error saying *"Could not install to device."*, make sure you do not have an application with the same Android package name already installed on the device (but signed with a different key).
de: Wird die Fehlermeldung *"Could not install to device"* angezeigt, sollte sichergestellt werden, dass nicht bereits eine andere Applikation mit dem selben Android Package-Namen auf dem Gerät installiert, aber mit einem anderen Schlüssel signiert ist.

source: If you have an application with the same Android package name but a different signing key already installed on the device, you **must** remove the application in question from the Android device before exporting to Android again.
de: Ist auf dem Gerät bereits eine Applikation mit demselben Android-Paketnamen, aber einem anderen Signierschlüssel installiert, muss die betroffene Applikation vom Android Gerät entfernt werden, bevor wieder zu Android exportiert werden kann.

source: Providing launcher icons
de: Bereitstellung von Launcher-Icons

source: Launcher icons are used by Android launcher apps to represent your application to users. Godot only requires high-resolution icons (for ``xxxhdpi`` density screens) and will automatically generate lower-resolution variants.
de: Launcher-Icons werden von Android Launcher-Apps verwendet, um Ihre Anwendung den Benutzern zu präsentieren. Godot benötigt nur hochauflösende Icons (für Bildschirme mit ``xxxhdpi``-Dichte) und generiert automatisch Varianten mit niedrigerer Auflösung.

source: There are two types of icons required by Godot:
de: Godot benötigt zwei Arten von Icons:

source: **Main Icon:** The "classic" icon. This will be used on all Android versions up to Android 8 (Oreo), exclusive. Must be at least 192×192 px.
de: **Haupt-Icon:** Das "klassische" Symbol. Dies wird exklusiv für alle Android-Versionen bis Android 8 (Oreo) verwendet. Es muss mindestens 192×192 px groß sein.

source: **Adaptive Icons:** Starting from Android 8 (inclusive), `Adaptive Icons <https://developer.android.com/guide/practices/ui_guidelines/icon_design_adaptive>`_ were introduced. Applications will need to include separate background and foreground icons to have a native look. The user's launcher application will control the icon's animation and masking. Must be at least 432×432 px.
de: ** Adaptive Icons: ** Ab (einschließlich) Android 8 wurden `Adaptive Icons <https://developer.android.com/guide/practices/ui_guidelines/icon_design_adaptive>` _ eingeführt. Anwendungen müssen separate Hintergrund- und Vordergrund-Icons enthalten, um ein natives Aussehen zu erhalten. Die Launcher-Anwendung des Benutzers steuert die Animation und Maskierung des Icons. Es muss mindestens 432×432 px groß sein.

source: It's important to adhere to some rules when designing adaptive icons. `Google Design has provided a nice article <https://medium.com/google-design/designing-adaptive-icons-515af294c783>`_ that helps to understand those rules and some of the capabilities of adaptive icons.
de: Es ist wichtig, beim Entwerfen adaptiver Icons einige Regeln einzuhalten. `Google Design hat einen schönen Artikel <https://medium.com/google-design/designing-adaptive-icons-515af294c783>`_ bereitgestellt, der hilft, diese Regeln und einige der Funktionen adaptiver Icons zu verstehen.

source: The most important adaptive icon design rule is to have your icon critical elements inside the safe zone: a centered circle with a diameter of 66dp (264 pixels on ``xxxhdpi``) to avoid being clipped by the launcher.
de: Die wichtigste Regel für das Design adaptiver Icons besteht darin, dass sich Ihre Icon-kritischen Elemente in der sicheren Zone befinden: ein zentrierter Kreis mit einem Durchmesser von 66 dp (264 Pixel auf ``xxxhdpi``), um zu vermeiden, dass er vom Launcher abgeschnitten wird.

source: If you don't provide some of the requested icons, Godot will replace them using a fallback chain, trying the next in line when the current one fails:
de: Wenn Sie einige der angeforderten Icons nicht bereitstellen, ersetzt Godot sie durch eine Reihe von Alternativen und versucht das nächste Icon in der Reihe, wenn das Aktuelle fehlschlägt:

source: **Main Icon:** Provided main icon -> Project icon -> Default Godot main icon.
de: **Haupt-Icon:** Mitgeliefertes Haupt-Icon -> Projekt-Icon -> Default-Godot-Haupt-Icon.

source: **Adaptive Icon Foreground:** Provided foreground icon -> Provided main icon -> Project icon -> Default Godot foreground icon.
de: **Adaptiver Icon-Vordergrund:** Mitgeliefertes Vordergrund-Icon -> Mitgeliefertes Haupt-Icon -> Projekt-Icon -> Default-Godot-Vordergrund-Icon.

source: **Adaptive Icon Background:** Provided background icon -> Default Godot background icon.
de: **Adaptiver Icon-Hintergrund:** Mitgeliefertes Hintergrund-Icon -> Default-Godot-Hintergrund-Icon.

source: It's highly recommended to provide all the requested icons with their specified resolutions. This way, your application will look great on all Android devices and versions.
de: Es wird dringend empfohlen, alle angeforderten Icons mit ihren angegebenen Auflösungen bereitzustellen. Auf diese Weise wird Ihre Anwendung auf allen Android-Geräten und -Versionen gut aussehen.

source: Exporting for Google Play Store
de: Export für den Google Play Store

source: Uploading an APK to Google's Play Store requires you to sign using a non-debug keystore file; such file can be generated like this:
de: Das Hochladen eines APKs in Googles Play Store erfordert eine Signierung mit einer Nicht-Debug-Keystore-Datei; eine solche Datei kann wie folgt generiert werden:

source: This keystore and key are used to verify your developer identity, remember the password and keep it in a safe place! Use Google's Android Developer guides to learn more about `APK signing <https://developer.android.com/studio/publish/app-signing>`__.
de: Dieser Keystore und Schlüssel werden verwendet, um Ihre Entwickleridentität zu überprüfen, sich an das Passwort zu erinnern und es an einem sicheren Ort aufzubewahren! Verwenden Sie die Google-Anleitungen für Android-Entwickler, um mehr über die `APK-Signierung <https://developer.android.com/studio/publish/app-signing>`__ zu erfahren.

source: Now fill in the following forms in your Android Export Presets:
de: Füllen Sie nun die folgenden Formulare in Ihrem Android-Export-Profil aus:

source: **Release:** Enter the path to the keystore file you just generated.
de: **Release:** Geben Sie den Pfad zu der gerade generierten Keystore-Datei ein.

source: **Release User:** Replace with the key alias.
de: **Release User:** Ersetzen durch den Schlüssel-Alias.

source: **Release Password:** Key password. Note that the keystore password and the key password currently have to be the same.
de: **Release Password:** Schlüssel-Passwort. Beachten Sie, dass das Keystore-Passwort und das Schlüsselpasswort derzeit identisch sein müssen.

source: Don't forget to uncheck the **Export With Debug** checkbox while exporting.
de: Vergessen Sie nicht, beim Exportieren die Checkbox **Exportieren mit Debug** zu deaktivieren.

source: Optimizing the APK size
de: Optimieren der APK-Größe

source: By default, the APK will contain native libraries for both ARMv7 and ARMv8 architectures. This increases its size significantly. To create a smaller APK, uncheck either **Armeabi-v 7a** or **Arm 64 -v 8a** in your project's Android export preset. This will create an APK that only contains a library for a single architecture. Note that applications targeting ARMv7 can also run on ARMv8 devices, but the opposite is not true.
de: Standardmäßig enthält das APK native Bibliotheken sowohl für ARMv7- als auch für ARMv8-Architekturen. Dadurch erhöht sich seine Größe erheblich. Um ein kleineres APK zu erstellen, deaktivieren Sie entweder **Armeabi-v 7a** oder **Arm 64 -v 8a** im Android-Export-Profil Ihres Projekts. Dadurch wird ein APK erstellt, das nur eine Bibliothek für eine einzelne Architektur enthält. Beachten Sie, dass Anwendungen, die auf ARMv7 abzielen, auch auf ARMv8-Geräten laufen können, aber nicht umgekehrt.

source: Since August 2019, Google Play requires all applications to be available in 64-bit form. This means you cannot upload an APK that contains *just* an ARMv7 library. To solve this, you can upload several APKs to Google Play using its `Multiple APK support <https://developer.android.com/google/play/publishing/multiple-apks>`__. Each APK should target a single architecture; creating an APK for ARMv7 and ARMv8 is usually sufficient to cover most devices in use today.
de: Seit August 2019 verlangt Google Play, dass alle Anwendungen in 64-Bit-Form verfügbar sind. Das bedeutet, dass Sie kein APK hochladen können, das *nur* eine ARMv7-Bibliothek enthält. Um dieses Problem zu lösen, können Sie mehrere APKs in Google Play hochladen, indem Sie die `Mehrfach-APK-Unterstützung <https://developer.android.com/google/play/publishing/multiple-apks>`__ verwenden. Jedes APK sollte auf eine einzelne Architektur abzielen; die Erstellung eines APKs für ARMv7 und ARMv8 reicht in der Regel aus, um die meisten heute verwendeten Geräte abzudecken.

source: You can optimize the size further by compiling an Android export template with only the features you need. See :ref:`doc_optimizing_for_size` for more information.
de: Sie können die Größe weiter optimieren, indem Sie eine Android-Exportvorlage mit nur den Funktionen erstellen, die Sie benötigen. Weitere Informationen finden Sie unter :ref:`doc_optimizing_for_size`.

source: Environment variables
de: Umgebungsvariablen

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
de: Sie können die folgenden Umgebungsvariablen verwenden, um Exportoptionen außerhalb des Editors festzulegen. Während des Exportvorgangs überschreiben diese die Werte, die Sie im Exportmenü festgelegt haben.

source: Android export environment variables
de: Android-Export-Umgebungsvariablen

source: Environment variable
de: Umgebungsvariable

source: Encryption / Encryption Key
de: Verschlüsselung / Verschlüsselungsschlüssel

source: Options / Keystore / Debug
de: Optionen / Keystore/ Debug

source: Options / Keystore / Debug User
de: Optionen / Keystore / Debug Benutzer

source: Options / Keystore / Debug Password
de: Optionen / Keystore / Debug Passwort

source: Options / Keystore / Release
de: Optionen / Keystore / Release

source: Options / Keystore / Release User
de: Optionen / Keystore / Release Benutzer

source: Options / Keystore / Release Password
de: Optionen / Keystore / Release Passwort

source: Translation status
de: Übersetzungsstatus
