Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_ios.po
Languages: de, es, ru, zh_tw

source: Exporting for iOS
de: Exportieren für iOS
es: Exportando para iOS
ru: Экспорт для iOS
zh_tw: 為 iOS 匯出

source: This page describes how to export a Godot project to iOS. If you're looking to compile export template binaries from source instead, read :ref:`doc_compiling_for_ios`.
de: Diese Seite beschreibt, wie man ein Godot-Projekt für iOS exportiert. Wenn Sie stattdessen Exportvorlagen-Binärdateien aus dem Quellcode kompilieren möchten, lesen Sie :ref:`doc_compiling_for_ios`.
es: Esta página describe cómo exportar un proyecto de Godot a iOS. Si estás buscando compilar plantillas de exportación binarias desde la fuente en su lugar, lee :ref:`doc_compiling_for_ios`.
zh_tw: 這個頁面描述的是如何將 Godot 專案匯出到 iOS。如果你想要找的是從源碼編譯編輯器或匯出範本二進位檔案，請閱讀 :ref:`doc_compiling_for_ios`。

source: These are the steps to load a Godot project in Xcode. This allows you to build and deploy to an iOS device, build a release for the App Store, and do everything else you can normally do with Xcode.
de: Dies sind die Schritte zum Laden eines Godot-Projekts in Xcode. Auf diese Weise können Sie ein iOS-Gerät erstellen und bereitstellen, eine Version für den App Store erstellen und alles andere tun, was Sie normalerweise mit Xcode tun können.
es: Estos son los pasos para cargar un proyecto de Godot en Xcode. Esto permite compilar e implementar en un dispositivo iOS, compilar una versión de distribución para la App Store y todo lo que normalmente puede hacerse con Xcode.
ru: Это шаги для загрузки проекта Godot в Xcode. Это позволяет вам создавать и развёртывать на устройстве iOS, создавать выпуск для App Store и делать всё остальное, что вы обычно можете делать с Xcode.
zh_tw: 下列步驟為在 Xcode 中載入 Godot 專案的方法。這些步驟能用來建置與部署專案至 iOS 裝置上、為 App Store 建置發行版本，並可在 Xcode 中執行各種其他一般操作。

source: Projects written in C# can be exported to iOS as of Godot 4.2, but support is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
de: In C# geschriebene Projekte können ab Godot 4.2 nach iOS exportiert werden, aber die Unterstützung ist experimentell und :ref:`Es gelten einige Einschränkungen <doc_c_sharp_platforms>`.
ru: Проекты, написанные на C#, можно экспортировать в Android, начиная с Godot 4.2, но поддержка является экспериментальной и :ref:`присутствуют некоторые ограничения <doc_c_sharp_platforms>`.

source: Requirements
de: Anforderungen
es: Requerimientos
ru: Требования
zh_tw: 系統需求

source: You must export for iOS from a computer running macOS with Xcode installed.
de: Sie müssen für iOS von einem Computer exportieren, auf dem ein MacOS mit installiertem Xcode läuft.
es: Deberás exportar a iOS desde una computadora con macOS y Xcode instalado.
ru: Вы должны экспортировать для iOS с компьютера под управлением macOS с установленным Xcode.
zh_tw: 必須從有安裝 Xcode 的 macOS 電腦上為 iOS 匯出。

source: Download the Godot export templates. Use the Godot menu: Editor > Manage Export Templates
de: Laden Sie die Godot-Exportvorlagen herunter. Verwenden Sie das Godot-Menü: Editor > Exportvorlagen verwalten
es: Descarga los templates de Godot. Usa el menu de Godot: Editor > Cargar Plantillas de Exportación
ru: Загрузите шаблоны экспорта Godot. Используйте меню Godot: Editor > Manage Export Templates (Редактор> Управление шаблонами экспорта)
zh_tw: 下載 Godot 匯出樣板。使用 Godot 選單：[編輯器] > [管理匯出樣板]

source: Export a Godot project to Xcode
de: Exportieren eines Godot Projekts nach Xcode
es: Exportar un proyecto de Godot a Xcode
ru: Экспорт проекта Godot в Xcode
zh_tw: 匯出 Godot 專案至 Xcode

source: In the Godot editor, open the **Export** window from the **Project** menu. When the Export window opens, click **Add..** and select **iOS**.
de: Öffnen Sie im Godot-Editor das Fenster **Exportieren** aus dem Menü **Projekt**. Wenn das Exportfenster geöffnet wird, klicken Sie auf **Hinzufügen ..** und wählen Sie **iOS**.
es: En el editor de Godot, abrir la ventana **Exportar** del menú **Proyecto**. Cuando la ventana Exportar se abra, hacer clic en **Añadir** y seleccionar **iOS**.
ru: В редакторе Godot откройте окно **Export** (Экспорт) из меню **Project** (Проект). Когда откроется окно экспорта, нажмите **Add..** (Добавить..) и выберите **iOS**.
zh_tw: 在 Godot 編輯器中，打開 **[專案]** 選單中的 **[匯出]** 視窗。[匯出] 視窗開啟後，點擊 **[新增...]** 然後選擇 **[iOS]** 。

source: The **App Store Team ID** and (Bundle) **Identifier** options in the **Application** category are required. Leaving them blank will cause the exporter to throw an error.
de: Die **App Store Team ID** und (Bundle-) **Identifier** Optionen in der Kategorie **Application** sind notwendig. Der Exporter erzeugt eine Fehlermeldung, wenn diese ausgelassen werden.
es: Las opciones **App Store Team ID** e **Identifier** de la categoría **Application** son obligatorias. Si se dejan en blanco, el exportador generará un error.
ru: Требуются следующие параметры экспорта: **App Store Team ID** и**Identifier** в категории **Application**. Если их не заполнить, экспортёр выдаст ошибку.
zh_tw: 必須設定下列匯出選項。將任何選項留空都會導致匯出工具拋出錯誤：

source: If you encounter an error during export similar to
de: Wenn während des Exports ein Fehler ähnlich dem folgenden auftritt
zh_tw: 如果您在匯出過程中遇到類似以下錯誤

source: ``JSON text did not start with array or object and option to allow fragments not set``
de: ``JSON-Text begann nicht mit Array oder Objekt und Option zum Zulassen von Fragmenten nicht gesetzt``
zh_tw: “JSON 文字未以陣列或物件開頭，且未設定允許片段的選項”

source: then it might be due to a malformated **App Store Team ID**!
de: dann könnte es an einer fehlerhaften **App Store Team ID** liegen!
zh_tw: 那麼可能是由於 **App Store 團隊 ID** 格式錯誤！

source: The exporter expects a (10 characters long) code like ``ABCDE12XYZ`` and not, e.g., your name as Xcode likes to display in the *Signing & Capabilities* tab.
de: Der Exporter erwartet einen (10 Zeichen langen) Code wie ``ABCDE12XYZ`` und nicht z.B. Ihren Namen, wie ihn Xcode gerne im Tab *Signing & Capabilities* anzeigt.
zh_tw: 匯出器需要一個（10 個字元長）程式碼，例如“ABCDE12XYZ”，而不是例如 Xcode 喜歡在“簽章和功能”標籤中顯示的您的姓名。

source: You can find the code over at `developer.apple.com <https://developer.apple.com/account/resources/certificates/list>`_ next to your name in the top right corner.
de: Sie finden den Code unter `developer.apple.com <https://developer.apple.com/account/resources/certificates/list>`_ neben Ihrem Namen in der oberen rechten Ecke.
zh_tw: 您可以在右上角您姓名旁的「developer.apple.com <https://developer.apple.com/account/resources/certificates/list>」找到程式碼。

source: After you click **Export Project**, there are still two important options left:
de: Nachdem Sie auf **Projekt exportieren** geklickt haben, gibt es noch zwei wichtige Optionen:
es: Después de hacer clic en **Exportar Proyecto**, quedan dos opciones importantes:
ru: После того, как вы нажмете **Export Project** (экспорт проекта), останутся два важных параметра:
zh_tw: 點擊 **[匯出專案]** 後，還有兩個重要的選項要填：

source: **Path** is an empty folder that will contain the exported Xcode project files.
de: **Path** ist ein leerer Ordner, der die exportierten Xcode-Projektdateien enthält.
es: **Path** es una carpeta vacía que contendrá los archivos de proyecto de Xcode exportados .
ru: **Path** (Путь) - это пустая папка, которая будет содержать экспортированные файлы проекта Xcode.
zh_tw: **[路徑]** 為一個空資料夾，會用來儲存匯出後的 Xcode 專案檔案。

source: **File** will be the name of the Xcode project and several project specific files and directories.
de: **Datei** wird der Name des Xcode-Projekts und mehrerer projektspezifischer Dateien und Verzeichnisse sein.
es: **File** será el nombre del proyecto Xcode y varios archivos y directorios específicos del proyecto.
ru: **File** (Файл) будет именем проекта Xcode и нескольких файлов и каталогов, относящихся к проекту.
zh_tw: **[檔案]** 為 Xcode 專案的名稱，以及各種專案特定檔案與資料夾的名稱。

source: This tutorial uses **exported_xcode_project_name**, but you will use your project's name. When you see **exported_xcode_project_name** in the following steps, replace it with the name you used instead.
de: Dieses Tutorial verwendet **exported_xcode_project_name**, aber Sie können den Namen Ihres Projekts verwenden. Wenn Sie in den folgenden Schritten **exported_xcode_project_name** sehen, ersetzen Sie ihn stattdessen durch den von Ihnen verwendeten Namen.
es: Este tutorial utiliza **exported_xcode_project_name**, pero utilizarás el nombre de tu proyecto. Cuando veas **exported_xcode_project_name** en los siguientes pasos, reemplázalo con el nombre que usaste en su lugar.
ru: В этом руководстве используется **exported_xcode_project_name**, но вы будете использовать имя вашего проекта. Когда вы увидите **exported_xcode_project_name** на следующих шагах, замените его именем, которое вы использовали вместо этого.
zh_tw: 本教學使用 **exported_xcode_project_name** ，但實際應該使用專案名稱。在接下來的步驟看到 **exported_xcode_project_name** 時，請自行替換。

source: Avoid using spaces when you choose your **exported_xcode_project_name** as this can lead to corruption in your XCode project file.
de: Vermeiden Sie die Verwendung von Leerzeichen, wenn Sie Ihren **exported_xcode_project_name** wählen, da dies zu einer Beschädigung Ihrer XCode-Projektdatei führen kann.
es: Evita usar espacios cuando seleccionas tu **exported_xcode_project_name** ya que esto puede corromper tu archivo de proyecto XCode.
ru: Избегайте использования пробелов при выборе **exported_xcode_project_name**, так как это может привести к повреждению вашего файла проекта XCode.
zh_tw: 選擇 **exported_xcode_project_name** 時請避免使用空格，可能會導致 Xcode 專案檔案出錯。

source: When the export completes, the output folder should look like this:
de: Nach Abschluss des Exports sollte der Ausgabeordner folgendermaßen aussehen:
es: Cuando la exportación se completa, la carpeta de salida debe tener el siguiente aspecto:
ru: Когда экспорт завершится, выходная папка должна выглядеть так:
zh_tw: 匯出完成後，輸出資料夾應該長得像這樣：

source: Opening **exported_xcode_project_name.xcodeproj** lets you build and deploy like any other iOS app.
de: Wenn Sie **exported_xcode_project_name.xcodeproj** öffnen, können Sie diese wie jede andere iOS-Anwendung erstellen und ausliefern.
es: Al abrir **exported_xcode_project_name.xcodeproj** te permite compilar y desplegar como cualquier otra aplicación iOS.
ru: Открытие **exported_xcode_project_name.xcodeproj** позволяет создавать и развёртывать, как и любое другое приложение iOS.
zh_tw: 開啟 **exported_xcode_project_name.xcodeproj** 即可像其他 iOS 應用程式一樣進行建置與部署。

source: Active development considerations
de: Überlegungen zur aktiven Entwicklung
es: Consideraciones activas del desarrollo
ru: Действующие соглашения о разработке
zh_tw: 活躍開發中的注意事項

source: The above method creates an exported project that you can build for release, but you have to re-export every time you make a change in Godot.
de: Mit der obigen Methode wird ein exportiertes Projekt erstellt, das Sie zur Veröffentlichung erstellen können. Sie müssen es jedoch jedes Mal neu exportieren, wenn Sie eine Änderung in Godot vornehmen.
es: El método anterior crea un proyecto exportado que puedes compilar para su publicación, pero tienes que reexportar cada vez que haces un cambio en Godot.
ru: Вышеупомянутый метод создаёт экспортированный проект, который вы можете создать для выпуска, но вам придется повторно экспортировать каждый раз, когда вы вносите изменения в Godot.
zh_tw: 上述方法能建立匯出專案，並用於建置發行版本，但每次於 Godot 中修改後都必須重新匯出。

source: While developing, you can speed this process up by linking your Godot project files directly into your app.
de: Während der Entwicklung können Sie diesen Prozess beschleunigen, indem Sie Ihre Godot-Projektdateien direkt mit Ihrer App verknüpfen.
es: Durante el desarrollo, puedes acelerar este proceso enlazando tus archivos de proyecto Godot directamente a tu aplicación.
ru: Во время разработки вы можете ускорить этот процесс, связав файлы проекта Godot непосредственно с вашим приложением.
zh_tw: 開發時，可通過直接將 Godot 專案檔案串聯到應用程式中來加速這個過程。

source: In the following example:
de: Im folgenden Beispiel:
es: En el siguiente ejemplo:
ru: В следующем примере:
zh_tw: 在下方範例中：

source: **exported_xcode_project_name** is the name of the exported iOS application (as above).
de: **exported_xcode_project_name** ist der Name der exportierten iOS-Anwendung (wie oben).
es: **exported_xcode_project_name** es el nombre de la aplicación iOS exportada (como arriba).
ru: **exported_xcode_project_name** - имя экспортированного приложения iOS (как указано выше).
zh_tw: **exported_xcode_project_name** 為匯出的 iOS 應用程式名稱 (如上)。

source: **godot_project_to_export** is the name of the Godot project.
de: **godot_project_to_export** ist der Name des Godot-Projekts.
es: **godot_project_to_export** es el nombre del proyecto Godot.
ru: **godot_project_to_export** - это название проекта Godot.
zh_tw: **godot_project_to_export** 為 Godot 專案名稱。

source: **godot_project_to_export** must not be the same as **exported_xcode_project_name** to prevent signing issues in Xcode.
de: **godot_project_to_export** darf nicht mit **exported_xcode_project_name** identisch sein, um Signaturprobleme in Xcode zu vermeiden.
es: **nombre_del_proyecto_de_exportar** no debe ser el mismo que **nombre_del_proyecto_de_xcode_de_exportación** para evitar problemas de firma en Xcode.
ru: **godot_project_to_export** не должен совпадать с **exported_xcode_project_name** для предотвращения проблем с подписью в Xcode.
zh_tw: **godot_project_to_export** 不可與 **exported_xcode_project_name** 相同，以避免 Xcode 上產生簽署問題。

source: Steps to link a Godot project folder to Xcode
de: Schritte zum Verknüpfen eines Godot-Projektordners mit Xcode
es: Pasos para enlazar una carpeta de proyecto Godot a Xcode
ru: Шаги по привязке папки проекта Godot к Xcode
zh_tw: 將 Godot 專案資料夾串聯至 Xcode 的步驟

source: Start from an exported iOS project (follow the steps above).
de: Beginnen Sie mit einem exportierten iOS-Projekt (folgen Sie den obigen Schritten).
es: Empieza desde un proyecto iOS exportado (sigue los pasos anteriores).
ru: Начните с экспортированного проекта iOS (следуйте инструкциям выше).
zh_tw: 先從匯出的 iOS 專案開始 (依照上面的步驟)。

source: In Finder, drag the Godot project folder into the Xcode file browser.
de: Ziehen Sie im Finder den Godot-Projektordner in den Xcode-Dateibrowser.
es: En Finder, arrastra la carpeta del proyecto Godot al navegador de archivos Xcode.
ru: В Finder перетащите папку проекта Godot в браузер файлов Xcode.
zh_tw: 在 Finder 中，將 Godot 專案資料夾拖曳到 Xcode 檔案瀏覽器中。

source: 3. In the dialog, make sure **Create folder references** is selected. This means you will be able to continue to edit your Godot project in its current location.
de: 3. Stellen Sie im Dialogfeld sicher, dass **Ordnerverweise erstellen** ausgewählt ist. Dies bedeutet, dass Sie Ihr Godot-Projekt an seinem aktuellen Standort weiter bearbeiten können.
es: 3. En el cuadro de diálogo, asegúrate de que **Crear referencias de carpeta** está seleccionado. Esto significa que podrás continuar editando tu proyecto Godot en su ubicación actual.
ru: 3. Убедитесь, что в диалоговом окне выбрано **Create folder references** (Создать ссылки на папки). Это означает, что вы сможете продолжить редактировать свой проект Godot в его текущем местоположении.
zh_tw: 3. 在對話框中，請確定有選中 **Create folder references** 。設定該選項即代表能繼續以現有位置來編輯 Godot 專案。

source: See the **godot_project_to_export** folder in the Xcode file browser.
de: Siehe den Ordner **godot_project_to_export** im Xcode-Dateibrowser.
es: Visualiza la carpeta **godot_project_to_export** en el navegador de archivos Xcode.
ru: См. папку **godot_project_to_export** в браузере файлов Xcode.
zh_tw: 在 Xcode 檔案瀏覽器中檢視 **godot_project_to_export** 資料夾。

source: Delete **exported_xcode_project_name.pck** from the Xcode project.
de: Löschen Sie **exported_xcode_project_name.pck** aus dem Xcode-Projekt.
es: Eliminar **exported_xcode_project_name.pck** del proyecto Xcode.
ru: Удалите **exported_xcode_project_name.pck** из проекта Xcode.
zh_tw: 從 Xcode 專案中刪除 **exported_xcode_project_name.pck** 。

source: 6. Open **exported_xcode_project_name-Info.plist** and add a string property named **godot_path** (this is the real key name) with a value **godot_project_to_export** (this is the name of your project)
de: 6. Öffnen Sie **exported_xcode_project_name-Info.plist** und fügen eine String-Property namens **godot_path** (dies ist der echte Key-Name) mit einem Wert **godot_project_to_export** (dies ist der Name Ihres Projekts) hinzu
es: 6. Abre **exported_xcode_project_name-Info.plist** y añade una propiedad string llamada **godot_path** (este es el nombre real de la clave) con un valor **godot_project_to_export** (este es el nombre de tu proyecto)
ru: 6. Откройте **exported_xcode_project_name-Info.plist** и добавьте строковое свойство с именем **godot_path** (это настоящее имя ключа) со значением **godot_project_to_export** (это имя вашего проекта)
zh_tw: 6. 開啟 **exported_xcode_project_name-Info.plist** 並新增一個名為 **godot_path** 的字串屬性 (索引鍵名稱就是「godot_path」)，值則設為 **godot_project_to_export** (值為專案的名稱)

source: That's it! You can now edit your project in the Godot editor and build it in Xcode when you want to run it on a device.
de: Das wars! Sie können Ihr Projekt jetzt im Godot-Editor bearbeiten und in Xcode bauen, wenn Sie es auf einem Gerät ausführen möchten.
es: ¡Eso es todo! Ahora puedes editar tu proyecto en el editor Godot y compilarlo en Xcode cuando quieras ejecutarlo en un dispositivo.
ru: Вот так! Теперь вы можете редактировать свой проект в редакторе Godot и создавать его в Xcode, если хотите запустить его на устройстве.
zh_tw: 就這樣！現在可以在 Godot 編輯器中編輯專案並於準備好在裝置上執行時於 Xcode 中進行建置。

source: Plugins for iOS
de: Plugins für iOS
es: Complementos para iOS
ru: Плагины для iOS
zh_tw: 為 iOS 進行編譯

source: Special iOS plugins can be used in Godot. Check out the :ref:`doc_plugins_for_ios` page.
de: Spezielle iOS-Plugins können in Godot verwendet werden. Siehe hierzu die :ref:`doc_plugins_for_ios`-Seite.
es: Se pueden utilizar complementos especiales de iOS en Godot. Consulta la página :ref:`doc_plugins_for_ios` para obtener más información.
ru: В Godot можно использовать специальные iOS плагины. Посетите страницу :ref:`doc_services_for_ios`.
zh_tw: Godot 中可使用特殊的 iOS 服務。請參考 :ref:`doc_services_for_ios` 一頁。

source: Environment variables
de: Umgebungsvariablen
es: Variables de entorno
zh_tw: 環境變數

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
de: Sie können die folgenden Umgebungsvariablen verwenden, um Exportoptionen außerhalb des Editors festzulegen. Während des Exportvorgangs überschreiben diese die Werte, die Sie im Exportmenü festgelegt haben.
zh_tw: 您可以使用下列環境變數在編輯器外部設定匯出選項。在匯出過程中，這些值會覆寫您在匯出選單中設定的值。

source: iOS export environment variables
de: iOS-Export-Umgebungsvariablen
zh_tw: 環境變數

source: Environment variable
de: Umgebungsvariable
zh_tw: 環境變數

source: Encryption / Encryption Key
de: Verschlüsselung / Verschlüsselungsschlüssel
zh_tw: 加密/加密金鑰

source: Options / Application / Provisioning Profile UUID Debug
de: Optionen / Anwendung / Bereitstellungsprofil UUID-Debug
zh_tw: 選項/應用程式/設定檔 UUID 偵錯

source: Options / Application / Provisioning Profile UUID Release
de: Optionen / Anwendung / Bereitstellungsprofil UUID-Freigabe
zh_tw: 選項/應用程式/設定檔 UUID 發布

source: Troubleshooting
de: Fehlersuche
es: Solución De Problemas
ru: Устранение неполадок
zh_tw: 疑難排解

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
ru: Статус перевода
zh_tw: 翻譯狀態

source: Export option
zh_tw: 匯出選項
