Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_dedicated_servers.po
Languages: de, zh_tw

source: Exporting for dedicated servers
de: Exportieren für dedizierte Server
zh_tw: 為專用伺服器匯出

source: If you want to run a dedicated server for your project on a machine that doesn't have a GPU or display server available, you'll need to run Godot with the ``headless`` display server and ``Dummy`` :ref:`audio driver <class_ProjectSettings_property_audio/driver/driver>`.
de: Wenn Sie einen dedizierten Server für Ihr Projekt auf einem Rechner laufen lassen wollen, der weder eine GPU oder einen Display-Server zur Verfügung hat, müssen Sie Godot mit dem ``headless`` Display-Server und ``Dummy`` :ref:`Audio-Treiber <class_ProjectSettings_property_audio/driver/driver>` laufen lassen.

source: Since Godot 4.0, this can be done by running a Godot binary on any platform with the ``--headless`` command line argument, or running a project exported as dedicated server. You do not need to use a specialized server binary anymore, unlike Godot 3.x.
de: Seit Godot 4.0 kann dies durch Ausführen einer Godot-Binärdatei auf einer beliebigen Plattform mit dem Kommandozeilenargument ``--headless`` oder durch Ausführen eines als dedizierten Server exportierten Projekts geschehen. Im Gegensatz zu Godot 3.x müssen Sie keine spezielle Server-Binärdatei mehr verwenden.
zh_tw: 從 Godot 4.0 開始，這可以透過在任何平台上使用「--headless」命令列參數來執行 Godot 二進位檔案或執行匯出為專用伺服器的專案來完成。與 Godot 3.x 不同，您不再需要使用專門的伺服器二進位。

source: Editor versus export template
de: Editor vs. Exportvorlage
zh_tw: 使用匯出樣板

source: It is possible to use either an editor or export template (debug or release) binary in headless mode. Which one you should use depends on your use case:
de: Es ist möglich, im Headless-Modus entweder ein Editor- oder ein Export-Template-Binary (Debug oder Release) zu verwenden. Welche Variante Sie verwenden sollten, hängt von Ihrem Anwendungsfall ab:
zh_tw: 可以在無頭模式下使用編輯器或匯出範本（偵錯或發布）二進位。您應該使用哪一種取決於您的用例：

source: **Export template:** Use this one for running dedicated servers. It does not contain editor functionality, and is therefore smaller and more optimized.
de: **Exportvorlage:** Verwenden Sie diese Vorlage für den Betrieb dedizierter Server. Sie enthält keine Editorfunktionen und ist daher kleiner und optimierter.
zh_tw: **Server (伺服器)：** 用於在專用伺服器上執行。不包含編輯器的功能，因此比較小，也更最佳化。

source: **Editor:** This binary contains editor functionality and is intended to be used for exporting projects. This binary *can* be used to run dedicated servers, but it's not recommended as it's larger and less optimized.
de: **Editor:** Diese Binärdatei enthält Editor-Funktionen und ist für den Export von Projekten gedacht. Diese Binärdatei *kann* für den Betrieb von dedizierten Servern verwendet werden, aber es wird nicht empfohlen, da sie größer und weniger optimiert ist.
zh_tw: **Headless (無週邊)：** 包含編輯器功能的二進位檔，目的是用來匯出專案。該二進位檔 **可以** 用來執行專用伺服器，但因為檔案比較大，也比較沒最佳化，所以不建議這樣用。

source: Export approaches
de: Exportansätze
zh_tw: 匯出 Preset

source: There are two ways to export a project for a server:
de: Es gibt zwei Möglichkeiten, ein Projekt für einen Server zu exportieren:
zh_tw: 有兩種方法可以為伺服器匯出專案：

source: Create a separate export preset for the platform that will host the server, then export your project as usual.
de: Erstellen Sie ein separates Exportprofil für die Plattform, auf der Sie den Server hosten möchten, und exportieren Sie dann Ihr Projekt wie gewohnt.
zh_tw: 建立 Linux/X11 匯出預設設定，並定義指向伺服器二進位檔的自定 Release 匯出樣板，然後照往常一樣匯出專案即可。

source: Export a PCK file only, preferably for the platform that matches the platform that will host the server. Place this PCK file in the same folder as an export template binary, rename the binary to have the same name as the PCK (minus the file extension), then run the binary.
de: Exportieren Sie nur eine PCK-Datei, vorzugsweise für die Plattform, die mit der Plattform übereinstimmt, auf der Sie den Server hosten werden. Legen Sie diese PCK-Datei in denselben Ordner wie eine Exportvorlagen-Binärdatei, benennen Sie die Binärdatei in denselben Namen wie die PCK-Datei um (ohne die Dateierweiterung) und führen Sie die Binärdatei aus.
zh_tw: 僅匯出 PCK 檔案，最好是與將託管伺服器的平台相配對的平台。將此 PCK 檔案放在與匯出範本二進位檔案相同的資料夾中，將二進位檔案重新命名為與 PCK 相同的名稱（減去檔案副檔名），然後執行該二進位檔案。

source: Both methods should result in identical output. The rest of the page will focus on the first approach.
de: Beide Methoden sollten zu einem identischen Ergebnis führen. Der Rest der Seite konzentriert sich auf die erste Methode.
zh_tw: 這兩種方法產生的結果都相同。下方說明了 PCK 檔的這個方法。

source: See :ref:`doc_exporting_projects` for more information.
de: Siehe :ref:`doc_exporting_projects` für weitere Informationen.
zh_tw: 更多資訊請參考 :ref:`doc_exporting_projects` 。

source: Exporting a project for a dedicated server
de: Exportieren eines Projekts für einen dedizierten Server
zh_tw: 為專用伺服器匯出

source: If you export a project as usual when targeting a server, you will notice that the PCK file is just as large as for the client. This is because it includes all resources, including those the server doesn't need (such as texture data). Additionally, headless mode won't be automatically used; the user will have to specify ``--headless`` to make sure no window spawns.
de: Wenn Sie ein Projekt wie üblich exportieren, wenn Sie einen Server als Ziel haben, werden Sie feststellen, dass die PCK-Datei genauso groß ist wie die des Clients. Das liegt daran, dass sie alle Ressourcen enthält, einschließlich derer, die der Server nicht benötigt (wie z.B. Texturdaten). Außerdem wird der Headless-Modus nicht automatisch verwendet; der Benutzer muss ``--headless`` angeben, um sicherzustellen, dass kein Fenster erzeugt wird.
zh_tw: 如果您在以伺服器為目標時照常匯出專案，您會注意到 PCK 檔案與客戶端一樣大。這是因為它包含所有資源，包括伺服器不需要的資源（例如紋理資料）。此外，不會自動使用無頭模式；使用者必須指定“--headless”以確保沒有視窗生成。

source: Many resources such as textures can be stripped from the PCK file to greatly reduce its size. Godot offers a way to do this for textures and materials in a way that preserves references in scene or resource files (built-in or external).
de: Viele Ressourcen, wie z. B. Texturen, können aus der PCK-Datei entfernt werden, um ihre Größe zu verringern. Godot bietet eine Möglichkeit, dies für Texturen und Materialien auf eine Weise zu tun, die Referenzen in Szenen- oder Ressourcendateien (eingebaut oder extern) beibehält.
zh_tw: 許多資源（例如紋理）可以從 PCK 檔案中剝離，以大大減少其大小。 Godot 提供了一種對紋理和材質執行此操作的方法，可保留場景或資源檔案（內建或外部）中的參考。

source: To begin doing so, make sure you have a dedicated export preset for your server, then select it, go to its **Resources** tab and change its export mode:
de: Um damit zu beginnen, stellen Sie sicher, dass Sie ein spezielles Exportprofil für Ihren Server haben, wählen Sie dieses aus, gehen Sie auf den **Ressourcen**-Tab und ändern Sie den Exportmodus:
zh_tw: 首先，請確保您的伺服器有專用的匯出預設，然後選擇它，轉到其**資源**標籤並更改其匯出模式：

source: Choosing the **Export as dedicated server** export mode in the export preset
de: Auswahl des Exportmodus **Export als dedizierter Server** im Exportprofil
zh_tw: 在匯出預設中選擇 **匯出為專用伺服器** 匯出模式

source: When this export mode is chosen, the ``dedicated_server`` feature tag is automatically added to the exported project.
de: Wenn dieser Exportmodus gewählt wird, wird das Feature-Tag ``dedicated_server`` automatisch zum exportierten Projekt hinzugefügt.
zh_tw: 選擇此匯出模式後，「dedicated_server」功能標記將自動新增至匯出的專案。

source: If you do not wish to use this export mode but still want the feature tag, you can write the name ``dedicated_server`` in the **Features** tab of the export preset. This will also force ``--headless`` when running the exported project.
de: Wenn Sie diesen Exportmodus nicht verwenden möchten, aber trotzdem das Feature-Tag haben wollen, können Sie den Namen ``dedicated_server`` im **Features**-Tab des Exportprofils schreiben. Dies wird auch ``--headless`` erzwingen, wenn das exportierte Projekt ausgeführt wird.
zh_tw: 如果您不想使用此匯出模式但仍需要功能標籤，則可以在匯出預設的 **功能** 標籤中寫入名稱``dedicated_server``。當運作匯出的專案時，這也會強制“--headless”。

source: After selecting this export mode, you will be presented with a list of resources in the project:
de: Nachdem Sie diesen Exportmodus ausgewählt haben, wird Ihnen eine Liste der Ressourcen im Projekt angezeigt:
zh_tw: 選擇此匯出模式後，您將看到專案中的資源列表：

source: Choosing resources to keep, keep with stripped visuals or remove
de: Auswahl von Ressourcen, die beibehalten, mit gestripptem Bildmaterial versehen oder entfernt werden sollen
zh_tw: 選擇要保留的資源、保留剝離的視覺效果或刪除

source: Ticking a box allows you to override options for the specified file or folder. Checking boxes does **not** affect which files are exported; this is done by the options selected for each checkbox instead.
de: Wenn Sie eine Checkbox ankreuzen, können Sie die Optionen für die angegebene Datei oder den angegebenen Ordner außer Kraft setzen. Das Markieren von Checkboxen hat **keine** Auswirkung darauf, welche Dateien exportiert werden; dies geschieht stattdessen durch die für jede Chechbox ausgewählten Optionen.
zh_tw: 勾選複選框可讓您覆寫指定檔案或資料夾的選項。複選框**不會**影響匯出哪些檔案；這是透過為每個複選框選擇的選項來完成的。

source: Files within a checked folder will automatically use the parent's option by default, which is indicated by the **(Inherited)** suffix for the option name (and the option name being grayed out). To change the option for a file whose option is currently inherited, you must tick the box next to it first.
de: Dateien innerhalb eines markierten Ordners verwenden standardmäßig automatisch die Option des übergeordneten Ordners, was durch das Suffix **(Vererbt)** für den Optionsnamen angezeigt wird (und dadurch, dass der Optionsname ausgegraut ist). Um die Option für eine Datei zu ändern, deren Option derzeit vererbt wird, müssen Sie zunächst die Checkbox neben der Datei ankreuzen.
zh_tw: 預設情況下，選取資料夾中的檔案將自動使用父級選項，這由選項名稱的 **(Inherited)** 後綴表示（並且選項名稱呈灰色）。若要變更目前繼承選項的檔案的選項，必須先勾選該檔案旁的方塊。

source: **Strip Visuals:** Export this resource, with visual files (textures and materials) replaced by placeholder classes. Placeholder classes store the image size (as it's sometimes used to position elements in a 2D scene), but nothing else.
de: **Strip Visuals:** Exportieren Sie diese Ressource, wobei die visuellen Dateien (Texturen und Materialien) durch Platzhalterklassen ersetzt werden. Platzhalterklassen speichern die Bildgröße (da sie manchmal zur Positionierung von Elementen in einer 2D-Szene verwendet wird), aber nichts anderes.
zh_tw: **剝離視覺效果：** 匯出此資源，並將視覺檔案（紋理和材質）替換為佔位符類別。佔位符類別儲存影像大小（因為它有時用於在 2D 場景中定位元素），但不儲存其他內容。

source: **Keep:** Export this resource as usual, with visual files interact.
de: **Beibehalten:** Exportieren Sie diese Ressource wie gewohnt, wobei visuelle Dateien interagieren.
zh_tw: **保留：**照常匯出此資源，與視覺檔案互動。

source: **Remove:** The file is not included in the PCK. This is useful to ignore scenes and resources that only the client needs. If you do so, make sure the server doesn't reference these client-only scenes and resources in any way.
de: **Entfernen:** Die Datei wird nicht in das PCK aufgenommen. Dies ist nützlich, um Szenen und Ressourcen zu ignorieren, die nur der Client benötigt. Wenn Sie dies tun, stellen Sie sicher, dass der Server diese Client-Only Szenen und Ressourcen in keiner Weise referenziert.
zh_tw: **刪除：** 該檔案不包含在 PCK 中。這對於忽略只有客戶端需要的場景和資源很有用。如果這樣做，請確保伺服器不會以任何方式引用這些僅限客戶端的場景和資源。

source: The general recommendation is to use **Strip Visuals** whenever possible, unless the server needs to access image data such as pixels' colors. For example, if your server generates collision data based on an image's contents, you need to use **Keep** for that particular image.
de: Die allgemeine Empfehlung lautet, **Strip Visuals** zu verwenden, wann immer dies möglich ist, es sei denn, der Server muss auf Bilddaten wie die Farben der Pixel zugreifen. Wenn Ihr Server z.B. Kollisionsdaten auf der Grundlage des Inhalts eines Bildes generiert, müssen Sie **Beibehalten** für dieses bestimmte Bild verwenden.
zh_tw: 一般建議是盡可能使用**Strip Visuals**，除非伺服器需要存取影像資料（例如像素顏色）。例如，如果您的伺服器根據圖像的內容產生碰撞資料，則您需要對該特定圖像使用 **Keep**。

source: To check the file structure of your exported PCK, use the **Export PCK/ZIP...** button with a ``.zip`` file extension, then open the resulting ZIP file in a file manager.
de: Um die Dateistruktur Ihres exportierten PCKs zu überprüfen, benutzen Sie den **Export PCK/ZIP...**-Button mit einer ``.zip`` Dateierweiterung und öffnen Sie die resultierende ZIP-Datei in einem Dateimanager.
zh_tw: 若要檢查匯出的 PCK 的檔案結構，請使用帶有「.zip」檔案副檔名的「**匯出 PCK/ZIP...**」按鈕，然後在檔案管理器中開啟產生的 ZIP 檔案。

source: Be careful when using the **Remove** mode, as scenes/resources that reference a removed file will no longer be able to load successfully.
de: Seien Sie vorsichtig, wenn Sie den Modus **Entfernen** verwenden, da Szenen/Ressourcen, die auf eine entfernte Datei verweisen, nicht mehr erfolgreich geladen werden können.
zh_tw: 使用 **刪除** 模式時要小心，因為引用已刪除檔案的場景/資源將無法再成功載入。

source: If you wish to remove specific resources but make the scenes still be able to load without them, you'll have to remove the reference in the scene file and load the files to the nodes' properties using ``load()`` in a script. This approach can be used to strip resources that Godot doesn't support replacing with placeholders yet, such as audio.
de: Wenn Sie bestimmte Ressourcen entfernen möchten, die Szenen aber trotzdem ohne sie laden können, müssen Sie die Referenz in der Szenendatei entfernen und die Dateien mit ``load()`` in einem Skript in die Propertys der Nodes laden. Dieser Ansatz kann verwendet werden, um Ressourcen zu entfernen, die Godot noch nicht durch Platzhalter ersetzen kann, wie z.B. Audio.
zh_tw: 如果您希望刪除特定資源但使場景在沒有它們的情況下仍然能夠加載，則必須刪除場景檔案中的參考並使用「load()」中的「load()」將檔案載入到節點的屬性中。腳本。這種方法可用於剝離 Godot 尚不支援用佔位符取代的資源，例如音訊。

source: Removing textures is often what makes the greatest impact on the PCK size, so it is recommended to stick with **Strip Visuals** at first.
de: Das Entfernen von Texturen hat oft die größte Auswirkung auf die PCK-Größe, daher wird empfohlen, zunächst bei **Strip Visuals** zu bleiben.
zh_tw: 刪除紋理通常對 PCK 大小影響最大，因此建議先堅持使用 **Strip Visuals**。

source: With the above options used, a PCK for the client (which exports all resources normally) will look as follows:
de: Bei Verwendung der oben genannten Optionen sieht ein PCK für den Client (der alle Ressourcen normal exportiert) wie folgt aus:
zh_tw: 使用上面的選項後，使用者端的 PCK（正常匯出所有資源）是這樣的：

source: The PCK's file structure for the server will look as follows:
de: Die Dateistruktur des PCK für den Server sieht wie folgt aus:
zh_tw: 伺服器的 PCK 檔結構是這樣的：

source: Starting the dedicated server
de: Starten des dedizierten Servers
zh_tw: 開啟專用伺服器

source: If both your client and server are part of the same Godot project, you will have to add a way to start the server directly using a command-line argument.
de: Wenn sowohl Ihr Client als auch Ihr Server Teil desselben Godot-Projekts sind, müssen Sie eine Möglichkeit hinzufügen, den Server direkt über ein Kommandozeilenargument zu starten.
zh_tw: 若使用者端與伺服器端都屬於相同的 Godot 專案，則必須要加上能直接以命令行參數來開啟伺服器的方法。可以通過在主要場景 (或單例) 的 ``_ready()`` 方法中加上下列程式碼片段來實作：

source: If you :ref:`exported the project <doc_exporting_for_dedicated_servers_exporting_project>` using the **Export as dedicated server** export mode (or have added ``dedicated_server`` as a custom feature tag), you can use the ``dedicated_server`` feature tag to detect whether a dedicated server PCK is being used:
de: Wenn Sie :ref:`das Projekt <doc_exporting_for_dedicated_servers_exporting_project>` mit dem Exportmodus **Export als dedizierter Server** exportiert haben (oder ``dedicated_server`` als benutzerdefiniertes Feature-Tag hinzugefügt haben), können Sie das Feature-Tag ``dedicated_server`` verwenden, um zu erkennen, ob ein PCK für dedizierte Server verwendet wird:
zh_tw: 如果您使用 **匯出為專用伺服器** 匯出模式匯出了專案 <doc_exporting_for_dedicated_servers_exporting_project>`（或已新增 ``dedicated_server`` 作為自訂功能標記），則可以使用 ``dedicated_server``用於偵測是否正在使用專用伺服器PCK 的功能標記：

source: If you also wish to host a server when using the built-in ``--headless`` command line argument, this can be done by adding the following code snippet in your main scene (or an autoload)'s ``_ready()`` method:
de: Wenn Sie auch einen Server hosten wollen, wenn Sie das Built-in-``--headless`` Kommandozeilenargument verwenden, können Sie dies tun, indem Sie den folgenden Codeschnipsel in die ``_ready()`` Methode Ihrer Hauptszene (oder eines Autoloads) einfügen:
zh_tw: 若使用者端與伺服器端都屬於相同的 Godot 專案，則必須要加上能直接以命令行參數來開啟伺服器的方法。可以通過在主要場景 (或單例) 的 ``_ready()`` 方法中加上下列程式碼片段來實作：

source: If you wish to use a custom command line argument, this can be done by adding the following code snippet in your main scene (or an autoload)'s ``_ready()`` method:
de: Wenn Sie ein benutzerdefiniertes Kommandozeilenargument verwenden möchten, können Sie den folgenden Codeschnipsel in die ``_ready()``-Methode Ihrer Hauptszene (oder eines Autoloads) einfügen:
zh_tw: 若使用者端與伺服器端都屬於相同的 Godot 專案，則必須要加上能直接以命令行參數來開啟伺服器的方法。可以通過在主要場景 (或單例) 的 ``_ready()`` 方法中加上下列程式碼片段來實作：

source: It's a good idea to add at least one of the above command-line arguments to start a server, as it can be used to test server functionality from the command line without having to export the project.
de: Es ist eine gute Idee, mindestens eines der oben genannten Kommandozeilenargumente zum Starten eines Servers hinzuzufügen, da es dazu verwendet werden kann, die Serverfunktionalität von der Kommandozeile aus zu testen, ohne das Projekt exportieren zu müssen.
zh_tw: 最好新增至少一個上述命令列參數來啟動伺服器，因為它可用於從命令列測試伺服器功能，而無需匯出專案。

source: If your client and server are separate Godot projects, your server should most likely be configured in a way where running the main scene starts a server automatically.
de: Wenn Ihr Client und Ihr Server separate Godot-Projekte sind, sollte Ihr Server höchstwahrscheinlich so konfiguriert sein, dass beim Ausführen der Hauptszene ein Server automatisch gestartet wird.
zh_tw: 如果使用者端與伺服器端是分開的兩個 Godot 專案，則伺服器通常應該都設定好會在主要場景開啟時自動執行伺服器。

source: Next steps
de: Nächste Schritte
zh_tw: 下一步

source: On Linux, to make your dedicated server restart after a crash or system reboot, you can `create a systemd service <https://medium.com/@benmorel/creating-a-linux-service-with-systemd-611b5c8b91d6>`__. This also lets you view server logs in a more convenient fashion, with automatic log rotation provided by systemd.
de: Unter Linux können Sie einen `systemd-Dienst einrichten <https://medium.com/@benmorel/creating-a-linux-service-with-systemd-611b5c8b91d6>`__, damit Ihr dedizierter Server nach einem Absturz oder Systemneustart neu startet. Dadurch können Sie auch die Serverprotokolle auf bequemere Weise anzeigen, wobei systemd für eine automatische Protokollrotation sorgt.
zh_tw: 在 Linux 中，請確保專用伺服器會在當機或系統重開機的時候重新啟動，可以 `建立 systemd 服務 (英文) <https://medium.com/@benmorel/creating-a-linux-service-with-systemd-611b5c8b91d6>`__ 。這樣也可以更方便地檢視伺服器紀錄，並且 systemd 會提供自動紀錄切割 (log rotatioin)。

source: If you have experience with containers, you could also look into wrapping your dedicated server in a `Docker <https://www.docker.com/>`__ container. This way, it can be used more easily in an automatic scaling setup (which is outside the scope of this tutorial).
de: Wenn Sie Erfahrung mit Containern haben, könnten Sie auch erwägen, Ihren dedizierten Server in einen `Docker <https://www.docker.com/>`__-Container zu verpacken. Auf diese Weise kann er leichter in einer Einrichtung mit automatischer Skalierung verwendet werden (was den Rahmen dieses Tutorials sprengen würde).
zh_tw: 若有 Container 的使用經驗，也可以試試將專屬伺服器包裝在 `Docker <https://www.docker.com/>`__ Container 中。這樣一來要設定自動縮放就更簡單了 (但這不在本教學的討論範圍內)。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
