Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_macos.po
Languages: de

source: Options / Notarization / API Key
de: Optionen / Notarisierung / API-Schlüssel

source: Options / Notarization / API Key ID
de: Optionen / Notarisierung / API-Schlüssel-ID

source: Options / Notarization / Apple ID Name
de: Optionen / Notarisierung / Apple ID-Name

source: Options / Notarization / Apple ID Password
de: Optionen / Notarisierung / Apple ID-Passwort

source: Translation status
de: Übersetzungsstatus
