Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_macos.po
Languages: de

source: Exporting for macOS
de: Exportieren für macOS

source: This page describes how to export a Godot project to macOS. If you're looking to compile editor or export template binaries from source instead, read :ref:`doc_compiling_for_macos`.
de: Diese Seite beschreibt, wie man ein Godot-Projekt nach macOS exportiert. Wenn Sie stattdessen Editor- oder Exportvorlagen-Binärdateien aus dem Quellcode kompilieren möchten, lesen Sie :ref:`doc_compiling_for_macos`.

source: Requirements
de: Anforderungen

source: Download the Godot export templates. Use the Godot menu: ``Editor > Manage Export Templates``.
de: Laden Sie die Godot-Exportvorlagen herunter. Verwenden Sie das Godot-Menü: ``Editor> Exportvorlagen verwalten``.

source: A valid and unique ``Bundle identifier`` should be set in the ``Application`` section of the export options.
de: Ein gültiger und eindeutiger ``Bundle-Identifikator`` sollte im Abschnitt ``Anwendung`` der Exportoptionen angegeben werden.

source: Projects exported without code signing and notarization will be blocked by Gatekeeper if they are downloaded from unknown sources, see the :ref:`Running Godot apps on macOS <doc_running_on_macos>` page for more information.
de: Projekte, die ohne Code-Signierung und Notarisierung exportiert werden, werden von Gatekeeper blockiert, wenn sie aus unbekannten Quellen heruntergeladen werden. Weitere Informationen finden Sie auf der Seite :ref:`Ausführen von Godot-Anwendungen unter macOS <doc_running_on_macos>`.

source: Code signing and notarization
de: Unterzeichnung und Notarisierung des Codes

source: By default, macOS will run only applications that are signed and notarized. If you use any other signing configuration, see :ref:`Running Godot apps on macOS <doc_running_on_macos>` for workarounds.
de: Standardmäßig werden unter macOS nur Anwendungen ausgeführt, die signiert und notarialisiert sind. Wenn Sie eine andere Signierkonfiguration verwenden, finden Sie unter :ref:`Ausführen von Godot-Anwendungen unter macOS <doc_running_on_macos>` Workarounds.

source: To notarize an app, you **must** have a valid `Apple Developer ID Certificate <https://developer.apple.com/>`__.
de: Um eine App zu notarisieren, **müssen** Sie ein gültiges `Apple Developer ID-Zertifikat <https://developer.apple.com/>`__ haben.

source: If you have an Apple Developer ID Certificate and exporting from macOS
de: Wenn Sie ein Apple Developer ID-Zertifikat haben und aus macOS exportieren

source: Install `Xcode <https://developer.apple.com/xcode/>`__ command line tools and open Xcode at least once or run the ``sudo xcodebuild -license accept`` command to accept license agreement.
de: Installieren Sie die `Xcode <https://developer.apple.com/xcode/>`__-Kommandozeilentools und öffnen Sie Xcode mindestens einmal oder führen Sie den Befehl ``sudo xcodebuild -license accept`` aus, um die Lizenzvereinbarung zu akzeptieren.

source: To sign exported app
de: Signieren der exportierten App

source: Select ``Xcode codesign`` in the ``Code Signing > Codesign`` option.
de: Wählen Sie ``Xcode Codesign`` in der Option ``Code Signing > Codesign``.

source: Set valid Apple ID certificate identity (certificate "Common Name") in the ``Code Signing > Identity`` section.
de: Stellen Sie eine gültige Apple ID Zertifikatsidentität (Zertifikat "Common Name") im Abschnitt ``Code Signing > Identity`` ein.

source: To notarize exported app
de: Notarisieren der exportierten App

source: Select ``Xcode altool`` in the ``Notarization > Notarization`` option.
de: Wählen Sie ``Xcode altool`` in der Option ``Notarization > Notarization``.

source: Disable the ``Debugging`` entitlement.
de: Deaktivieren Sie die Berechtigung ``Debugging``.

source: Set valid Apple ID login / app. specific password or `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API UUID / Key in the ``Notarization`` section.
de: Setzen Sie ein gültiges Apple ID Login / App-spezifisches Passwort oder `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API UUID / Key im Abschnitt ``Notarization``.

source: You can use the ``xcrun notarytool history`` command to check notarization status and use the ``xcrun notarytool log {ID}`` command to download the notarization log.
de: Sie können den Befehl ``xcrun notarytool history`` verwenden, um den Notarisierungsstatus zu überprüfen und den Befehl ``xcrun notarytool log {ID}`` verwenden, um das Notarisierungsprotokoll herunterzuladen.

source: If you encounter notarization issues, see `Resolving common notarization issues <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/resolving_common_notarization_issues>`__ for more info.
de: Wenn Sie auf Probleme bei der Notarisierung stoßen, finden Sie weitere Informationen unter `Lösung allgemeiner Notarisierungsprobleme <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/resolving_common_notarization_issues>`__.

source: After notarization is completed, `staple the ticket <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/customizing_the_notarization_workflow>`__ to the exported project.
de: Nachdem die Notarisierung abgeschlossen ist, `heften Sie das Ticket <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/customizing_the_notarization_workflow>`__ an das exportierte Projekt.

source: If you have an Apple Developer ID Certificate and exporting from Linux or Windows
de: Wenn Sie ein Apple Developer ID-Zertifikat haben und von Linux oder Windows exportieren

source: Install `PyOxidizer rcodesign <https://github.com/indygreg/apple-platform-rs/tree/main/apple-codesign>`__, and configure the path to ``rcodesign`` in the ``Editor Settings > Export > macOS > rcodesign``.
de: Installieren Sie `PyOxidizer rcodesign <https://github.com/indygreg/apple-platform-rs/tree/main/apple-codesign>`__, und konfigurieren Sie den Pfad zu ``rcodesign`` in den ``Editor-Einstellungen > Export > macOS > rcodesign``.

source: Select ``PyOxidizer rcodesign`` in the ``Code Signing > Codesign`` option.
de: Wählen Sie ``PyOxidizer rcodesign`` in der Option ``Code Signing > Codesign``.

source: Set valid Apple ID PKCS #12 certificate file and password in the ``Code Signing`` section.
de: Setzen Sie eine gültige Apple ID PKCS #12 Zertifikatsdatei und ein Passwort im Abschnitt ``Code Signing``.

source: Select ``PyOxidizer rcodesign`` in the ``Notarization > Notarization`` option.
de: Wählen Sie ``PyOxidizer rcodesign`` in der Option ``Notarization > Notarization``.

source: Set valid `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API UUID / Key in the ``Notarization`` section.
de: Setzen Sie gültige `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__-API UUID / Schlüssel im Abschnitt ``Notarisierung``.

source: You can use the ``rcodesign notary-log`` command to check notarization status.
de: Sie können den Befehl ``rcodesign notary-log`` verwenden, um den Status der Notarisierung zu überprüfen.

source: After notarization is completed, use the ``rcodesign staple`` command to staple the ticket to the exported project.
de: Nachdem die Notarisierung abgeschlossen ist, verwenden Sie den Befehl ``rcodesign staple``, um das Ticket an das exportierte Projekt zu heften.

source: If you do not have an Apple Developer ID Certificate
de: Wenn Sie kein Apple Developer ID-Zertifikat besitzen

source: Select ``Built-in (ad-hoc only)`` in the ``Code Signing > Codesign`` option.
de: Wählen Sie ``Built-in (nur ad-hoc)`` in der Option ``Code Signing > Codesign``.

source: Select ``Disabled`` in the ``Notarization > Notarization`` option.
de: Wählen Sie ``Deaktiviert`` in der Option ``Notarization > Notarization``.

source: In this case Godot will use a ad-hoc signature, which will make running an exported app easier for the end users, see the :ref:`Running Godot apps on macOS <doc_running_on_macos>` page for more information.
de: In diesem Fall wird Godot eine Ad-hoc-Signatur verwenden, die das Ausführen einer exportierten Anwendung für den Endbenutzer einfacher macht. Weitere Informationen finden Sie auf der Seite :ref:`Ausführen von Godot-Anwendungen auf macOS <doc_running_on_macos>`.

source: Signing Options
de: Signieroptionen

source: Description
de: Beschreibung

source: Tool to use for code signing.
de: Tool für die Codesignierung.

source: Identity
de: Identität

source: The "Full Name" or "Common Name" of the signing identity, store in the macOS keychain. [1]_
de: Der "Full Name" oder "Common Name" der signierenden Identität, gespeichert in der macOS-Keychain. [1]_

source: Certificate File
de: Zertifikatsdatei

source: The PKCS #12 certificate file. [2]_
de: Die PKCS #12-Zertifikatsdatei. [2]_

source: Certificate Password
de: Zertifikatspasswort

source: Password for the certificate file. [2]_
de: Passwort für die Zertifikatsdatei. [2]_

source: Custom Options
de: Benutzerdefinierte Optionen

source: Array of command line arguments passed to the code signing tool.
de: Array von Kommandozeilenargumenten, die an das Code Signing Tool übergeben werden.

source: This option is visible only when signing with Xcode codesign.
de: Diese Option ist nur beim Signieren mit Xcode Codesign sichtbar.

source: These options are visible only when signing with PyOxidizer rcodesign.
de: Diese Optionen sind nur beim Signieren mit PyOxidizer rcodesign sichtbar.

source: Notarization Options
de: Notarisierungsoptionen

source: Notarization
de: Notarisierung

source: Tool to use for notarization.
de: Tool für die Notarisierung.

source: Apple ID account name (email address). [3]_
de: Apple ID Account-Name (E-Mail-Adresse). [3]_

source: Apple ID app-specific password. See `Using app-specific passwords <https://support.apple.com/en-us/HT204397>`__ to enable two-factor authentication and create app password. [3]_
de: Apple ID App-spezifisches Passwort. Siehe `Verwendung von app-spezifischen Passwörtern <https://support.apple.com/en-us/HT204397>`__, um die Zwei-Faktor-Authentifizierung zu aktivieren und ein App-Passwort zu erstellen. [3]_

source: Team ID ("Organization Unit"), if your Apple ID belongs to multiple teams (optional). [3]_
de: Team-ID ("Organisationseinheit"), wenn Ihre Apple ID zu mehreren Teams gehört (optional). [3]_

source: Apple `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API issuer UUID.
de: Apple `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API-Aussteller UUID.

source: API Key
de: API-Schlüssel

source: Apple `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API key.
de: Apple `App Store Connect <https://developer.apple.com/documentation/appstoreconnectapi>`__ API-Schlüssel.

source: You should set either Apple ID Name/Password or App Store Connect API UUID/Key.
de: Sie sollten entweder Apple ID Name/Passwort oder App Store Connect API UUID/Key einstellen.

source: These options are visible only when notarizing with Xcode altool.
de: Diese Optionen sind nur beim Notarisieren mit Xcode altool sichtbar.

source: See `Notarizing macOS Software Before Distribution <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution?language=objc>`__ for more info.
de: Weitere Informationen finden Sie unter `Notarisierung von macOS-Software vor der Verteilung <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution?language=objc>`__.

source: Entitlements
de: Berechtigungen

source: Hardened Runtime Entitlements
de: Gehärtete Laufzeitberechtigungen

source: Hardened Runtime entitlements manage security options and resource access policy. See `Hardened Runtime <https://developer.apple.com/documentation/security/hardened_runtime?language=objc>`__ for more info.
de: Die gehärteten Laufzeitberechtigungen verwalten die Sicherheitsoptionen und die Richtlinien für den Ressourcenzugriff. Siehe `Gehärtete Laufzeit <https://developer.apple.com/documentation/security/hardened_runtime?language=objc>`__ für weitere Informationen.

source: Entitlement
de: Berechtigung

source: Allow JIT Code Execution [4]_
de: JIT-Code-Ausführung zulassen [4]_

source: Allows creating writable and executable memory for JIT code. If you are using add-ons with dynamic or self-modifying native code, enable them according to the add-on documentation.
de: Ermöglicht die Erstellung von beschreibbarem und ausführbarem Speicher für JIT-Code. Wenn Sie Add-ons mit dynamischem oder selbstmodifizierendem nativen Code verwenden, aktivieren Sie diese gemäß der Dokumentation des Add-ons.

source: Allow Unsigned Executable Memory [4]_
de: Unsigned Executable Memory zulassen [4]_

source: Allows creating writable and executable memory without JIT restrictions. If you are using add-ons with dynamic or self-modifying native code, enable them according to the add-on documentation.
de: Ermöglicht die Erstellung von beschreibbarem und ausführbarem Speicher ohne JIT-Einschränkungen. Wenn Sie Add-ons mit dynamischem oder selbstmodifizierendem nativen Code verwenden, aktivieren Sie diese gemäß der Dokumentation des Add-ons.

source: Allow DYLD Environment Variables [4]_
de: DYLD-Umgebungsvariablen zulassen [4]_

source: Allows app to uss dynamic linker environment variables to inject code. If you are using add-ons with dynamic or self-modifying native code, enable them according to the add-on documentation.
de: Ermöglicht der Anwendung die Verwendung von dynamischen Linker-Umgebungsvariablen zum Einfügen von Code. Wenn Sie Add-ons mit dynamischem oder selbstmodifizierendem nativen Code verwenden, aktivieren Sie diese gemäß der Dokumentation des Add-ons.

source: Disable Library Validation
de: Bibliotheksvalidierung deaktivieren

source: Allows app to load arbitrary libraries and frameworks. Enable it if you are using GDExtension add-ons or ad-hoc signing, or want to support user-provided external add-ons.
de: Erlaubt der Anwendung, beliebige Bibliotheken und Frameworks zu laden. Aktivieren Sie dies, wenn Sie GDExtension-Add-ons oder Ad-hoc-Signierung verwenden oder vom Benutzer bereitgestellte externe Add-ons unterstützen möchten.

source: Audio Input
de: Audioeingang

source: Enable if you need to use the microphone or other audio input sources, if it's enabled you should also provide usage message in the `privacy/microphone_usage_description` option.
de: Aktivieren Sie diese Option, wenn Sie das Mikrofon oder andere Audio-Eingangsquellen verwenden müssen. Wenn sie aktiviert ist, sollten Sie in der Option `privacy/microphone_usage_description` auch eine Nutzungsmeldung angeben.

source: Camera
de: Kamera

source: Enable if you need to use the camera, if it's enabled you should also provide usage message in the `privacy/camera_usage_description` option.
de: Aktivieren Sie die Option, wenn Sie die Kamera verwenden müssen. Wenn sie aktiviert ist, sollten Sie auch eine Nutzungsmeldung in der Option `privacy/camera_usage_description` angeben.

source: Location
de: Ort

source: Enable if you need to use location information from Location Services, if it's enabled you should also provide usage message in the `privacy/location_usage_description` option.
de: Aktivieren Sie diese Option, wenn Sie Standortinformationen aus den Standortdiensten verwenden müssen. Wenn sie aktiviert ist, sollten Sie in der Option `privacy/location_usage_description` auch eine Nutzungsmeldung angeben.

source: Address Book
de: Adressbuch

source: [5]_ Enable to allow access contacts in the user's address book, if it's enabled you should also provide usage message in the `privacy/address_book_usage_description` option.
de: [5]_ Aktivieren Sie diese Option, um den Zugriff auf die Kontakte im Adressbuch des Benutzers zuzulassen. Wenn Sie diese Option aktivieren, sollten Sie auch eine Nutzungsmeldung in der Option `privacy/address_book_usage_description` angeben.

source: Calendars
de: Kalender

source: [5]_ Enable to allow access to the user's calendar, if it's enabled you should also provide usage message in the `privacy/calendar_usage_description` option.
de: [5]_ Aktivieren Sie diese Option, um den Zugriff auf den Kalender des Benutzers zu ermöglichen. Wenn Sie diese Option aktivieren, sollten Sie in der Option `privacy/calendar_usage_description` auch eine Nutzungsmeldung angeben.

source: Photo Library
de: Fotobibliothek

source: [5]_ Enable to allow access to the user's Photos library, if it's enabled you should also provide usage message in the `privacy/photos_library_usage_description` option.
de: [5]_ Aktivieren Sie diese Option, um den Zugriff auf die Fotobibliothek des Benutzers zu erlauben. Wenn Sie diese Option aktivieren, sollten Sie auch eine Nachricht über die Verwendung in der Option `privacy/photos_library_usage_description` angeben.

source: [5]_ Enable to allow app to send Apple events to other apps.
de: [5]_ Aktivieren Sie diese Option, damit die Anwendung Apple-Events an andere Anwendungen senden kann.

source: [6]_ You can temporarily enable this entitlement to use native debugger (GDB, LLDB) with the exported app. This entitlement should be disabled for production export.
de: [6]_ Sie können diese Berechtigung vorübergehend aktivieren, um den nativen Debugger (GDB, LLDB) mit der exportierten Anwendung zu verwenden. Diese Berechtigung sollte für den Produktionsexport deaktiviert werden.

source: The ``Allow JIT Code Execution``, ``Allow Unsigned Executable Memory`` and ``Allow DYLD Environment Variables`` entitlements are always enabled for the Godot Mono exports, and are not visible in the export options.
de: Die Berechtigungen ``JIT-Code-Ausführung zulassen``, ``Unsigned Executable Memory zulassen`` und ``DYLD-Umgebungsvariablen zulassen`` sind für die Godot-Mono-Exporte immer aktiviert und in den Exportoptionen nicht sichtbar.

source: These features aren't supported by Godot out of the box, enable them only if you are using add-ons which require them.
de: Diese Features werden von Godot nicht von Haus aus unterstützt. Aktivieren Sie sie nur, wenn Sie Add-ons verwenden, die sie benötigen.

source: To notarize an app, you must disable the ``Debugging`` entitlement.
de: Um eine Anwendung zu notarisieren, müssen Sie die Berechtigung ``Debugging`` deaktivieren.

source: App Sandbox Entitlement
de: App Sandbox-Berechtigung

source: The App Sandbox restricts access to user data, networking and devices. Sandboxed apps can't access most of the file system, can't use custom file dialogs and execute binaries (using ``OS.execute`` and ``OS.create_process``) outside the ``.app`` bundle. See `App Sandbox <https://developer.apple.com/documentation/security/app_sandbox?language=objc>`__ for more info.
de: Die App-Sandbox schränkt den Zugriff auf Benutzerdaten, Netzwerke und Geräte ein. Apps in der Sandbox können nicht auf den größten Teil des Dateisystems zugreifen, können keine benutzerdefinierten Dateidialoge verwenden und führen Binärdateien (mit ``OS.execute`` und ``OS.create_process``) außerhalb des ``. app``-Bundles aus. Siehe `App Sandbox <https://developer.apple.com/documentation/security/app_sandbox?language=objc>`__ für weitere Informationen.

source: To distribute an app through the App Store, you must enable the App Sandbox.
de: Um eine App über den App Store zu vertreiben, müssen Sie die App Sandbox aktivieren.

source: Enabled
de: Aktiviert

source: Enables App Sandbox.
de: Aktiviert die App-Sandbox.

source: Network Server
de: Netzwerk-Server

source: Enable to allow app to listen for incoming network connections.
de: Aktivieren Sie diese Option, damit die Anwendung auf eingehende Netzwerkverbindungen warten kann.

source: Network Client
de: Netzwerk-Client

source: Enable to allow app to establish outgoing network connections.
de: Aktivieren Sie diese Option, damit die Anwendung ausgehende Netzwerkverbindungen herstellen kann.

source: Device USB
de: Gerät USB

source: Enable to allow app to interact with USB devices. This entitlement is required to use wired controllers.
de: Aktivieren Sie diese Option, damit die App mit USB-Geräten interagieren kann. Diese Berechtigung ist für die Verwendung von kabelgebundenen Controllern erforderlich.

source: Device Bluetooth
de: Gerät Bluetooth

source: Enable to allow app to interact with Bluetooth devices. This entitlement is required to use wireless controllers.
de: Aktivieren Sie diese Option, damit die App mit Bluetooth-Geräten interagieren kann. Diese Berechtigung ist für die Verwendung von drahtlosen Controllern erforderlich.

source: Files Downloads [7]_
de: Dateien Downloads [7]_

source: Allows read or write access to the user's "Downloads" folder.
de: Ermöglicht den Lese- oder Schreibzugriff auf den Ordner "Downloads" des Benutzers.

source: Files Pictures [7]_
de: Dateien Bilder [7]_

source: Allows read or write access to the user's "Pictures" folder.
de: Ermöglicht den Lese- oder Schreibzugriff auf den Ordner "Bilder" des Benutzers.

source: Files Music [7]_
de: Dateien Musik [7]_

source: Allows read or write access to the user's "Music" folder.
de: Ermöglicht den Lese- oder Schreibzugriff auf den Ordner "Musik" des Benutzers.

source: Files Movies [7]_
de: Dateien Filme [7]_

source: Allows read or write access to the user's "Movies" folder.
de: Ermöglicht den Lese- oder Schreibzugriff auf den Ordner "Filme" des Benutzers.

source: Files User Selected [7]_
de: Dateien Benutzerdefiniert [7]_

source: Allows read or write access to arbitrary folder. To gain access, a folder must be selected from the native file dialog by the user.
de: Erlaubt Lese- oder Schreibzugriff auf beliebige Ordner. Um Zugriff zu erhalten, muss der Benutzer einen Ordner aus dem nativen Dateidialog auswählen.

source: Helper Executable
de: Helfer Ausführbare Datei

source: List of helper executables to embedded to the app bundle. Sandboxed app are limited to execute only these executable.
de: Liste der ausführbaren Hilfsprogramme, die in das App-Bundle eingebettet werden. Sandbox-Apps können nur diese ausführbaren Dateien ausführen.

source: You can optionally provide usage messages for various folders in the `privacy/*_folder_usage_description` options.
de: Sie können in den Optionen `privacy/*_folder_usage_description` optional Nutzungsmeldungen für verschiedene Ordner angeben.

source: You can override default entitlements by selecting custom entitlements file, in this case all other entitlement are ignored.
de: Sie können die Standardberechtigungen außer Kraft setzen, indem Sie eine benutzerdefinierte Berechtigungsdatei auswählen; in diesem Fall werden alle anderen Berechtigungen ignoriert.

source: Environment variables
de: Umgebungsvariablen

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
de: Sie können die folgenden Umgebungsvariablen verwenden, um Exportoptionen außerhalb des Editors festzulegen. Während des Exportvorgangs überschreiben diese die Werte, die Sie im Exportmenü festgelegt haben.

source: macOS export environment variables
de: macOS Export-Umgebungsvariablen

source: Environment variable
de: Umgebungsvariable

source: Encryption / Encryption Key
de: Verschlüsselung / Verschlüsselungsschlüssel

source: Options / Codesign / Certificate File
de: Optionen / Codesign / Zertifikatsdatei

source: Options / Codesign / Certificate Password
de: Optionen / Codesign / Zertifikatspasswort

source: Options / Codesign / Provisioning Profile
de: Optionen / Codesign / Bereitstellungsprofil

source: Options / Notarization / API UUID
de: Optionen / Notarisierung / API UUID
