Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_windows.po
Languages: de, zh_cn

source: Exporting for Windows
de: Exportieren für Windows
zh_cn: 为 Windows 导出

source: This page describes how to export a Godot project to Windows. If you're looking to compile editor or export template binaries from source instead, read :ref:`doc_compiling_for_windows`.
de: Diese Seite beschreibt, wie man ein Godot-Projekt nach Windows exportiert. Wenn Sie stattdessen Editor- oder Exportvorlagen-Binärdateien aus dem Quellcode kompilieren möchten, lesen Sie :ref:`doc_compiling_for_windows`.
zh_cn: 这个页面描述的是如何将 Godot 项目导出到 Windows。如果你想要找的是从源码编译编辑器或导出模板二进制文件，请阅读 :ref:`doc_compiling_for_windows`\ 。

source: The simplest way to distribute a game for PC is to copy the executable (``godot.exe``), compress the folder and send it to someone else. However, this is often not desired.
de: Der einfachste Weg, ein Spiel für den PC zu verbreiten, besteht darin, die ausführbare Datei (``godot.exe``) zu kopieren, den Ordner zu komprimieren und ihn an jemand anderen zu schicken. Dies ist jedoch oft nicht erwünscht.
zh_cn: 在 PC 上分发游戏的最简单方法是复制可执行文件（\ ``godot.exe``\ ），将文件夹压缩，然后发送给别人。然而，这样一般并不理想。

source: Godot offers a more elegant approach for PC distribution when using the export system. When exporting for Windows, the exporter takes all the project files and creates a ``data.pck`` file. This file is bundled with a specially optimized binary that is smaller, faster and does not contain the editor and debugger.
de: Godot bietet einen eleganteren Ansatz für die PC-Verteilung, wenn das Exportsystem verwendet wird. Beim Export für Windows nimmt der Exporter alle Projektdateien und erstellt eine Datei ``data.pck``. Diese Datei ist mit einer speziell optimierten Binärdatei gebündelt, die kleiner und schneller ist und den Editor und Debugger nicht enthält.
zh_cn: Godot 在使用导出系统时，为 PC 分发提供了一种更为优雅的方法。为 Windows 导出时，导出器将提取所有项目文件并创建一个 ``data.pck`` 文件。该文件与特别优化的二进制文件捆绑在一起，更小、更快，并且不包含编辑器和调试器。

source: Code signing
de: Code-Signierung
zh_cn: 启用代码签名

source: Godot is capable of automatic code signing on export. To do this you must have the ``Windows SDK`` (on Windows) or `osslsigncode <https://github.com/mtrojnar/osslsigncode>`__ (on any other OS) installed. You will also need a package signing certificate, information on creating one can be found `here <https://docs.microsoft.com/en-us/windows/win32/appxpkg/how-to-create-a-package-signing-certificate?redirectedfrom=MSDN>`__.
de: Godot ist in der Lage, Code beim Export automatisch zu signieren. Dazu müssen Sie das ``Windows SDK`` (unter Windows) oder `osslsigncode <https://github.com/mtrojnar/osslsigncode>`__ (unter jedem anderen Betriebssystem) installiert haben. Sie benötigen auch ein Paket-Signierungszertifikat. Informationen zur Erstellung eines solchen Zertifikats finden Sie `hier <https://docs.microsoft.com/en-us/windows/win32/appxpkg/how-to-create-a-package-signing-certificate?redirectedfrom=MSDN>`__.

source: If you export for Windows with embedded PCK files, you will not be able to sign the program as it will break.
de: Wenn Sie für Windows mit eingebetteten PCK-Dateien exportieren, können Sie das Programm nicht signieren, da es dann kaputt geht.
zh_cn: 如果你用内嵌的PCK文件导出到Windows, 你将无法签名程序, 因为它会崩溃.

source: On Windows, PCK embedding is also known to cause false positives in antivirus programs. Therefore, it's recommended to avoid using it unless you're distributing your project via Steam as it bypasses code signing and antivirus checks.
de: Unter Windows ist die PCK-Einbettung auch dafür bekannt, dass sie bei Antiviren-Programmen zu Fehlalarmen führt. Daher wird empfohlen, es nicht zu verwenden, es sei denn, Sie veröffentlichen Ihr Projekt über Steam, da es die Code-Signierung und Antiviren-Prüfungen umgeht.
zh_cn: 在Windows上,PCK嵌入也会在杀毒软件中造成误报. 因此, 建议避免使用它, 除非你的项目通过Steam发布, 因为这样就绕过了代码签名和防病毒检查.

source: Setup
de: Einrichtung
zh_cn: 场景布置

source: Settings need to be changed in two places. First, in the editor settings, under **Export > Windows**. Click on the folder next to the ``Sign Tool`` setting, if you're using Windows navigate to and select ``SignTool.exe``, if you're on a different OS select ``osslsigncode``.
de: Die Einstellungen müssen an zwei Stellen geändert werden. Erstens in den Editoreinstellungen unter **Export > Windows**. Klicken Sie auf den Ordner neben der Einstellung ``Sign Tool``. Wenn Sie Windows verwenden, navigieren Sie zu ``SignTool.exe`` und wählen Sie es aus, wenn Sie ein anderes Betriebssystem verwenden, wählen Sie ``osslsigncode``.

source: The second location is the Windows export preset, which can be found in **Project > Export...**. Add a windows desktop preset if you haven't already. Under options there is a code signing category.
de: Der zweite Ort ist das Windows-Exportprofil, die Sie unter **Projekt > Exportieren...** finden können. Fügen Sie eom Windows-Desktop-Profil hinzu, wenn Sie dies noch nicht getan haben. Unter Optionen gibt es eine Kategorie für Code Signing.

source: ``Enabled`` must be set to true, and ``Identity`` must be set to the signing certificate. The other settings can be adjusted as needed. Once this is Done Godot will sign your project on export.
de: ``Aktiviert`` muss auf "true" gesetzt werden, und ``Identität`` muss auf das Signierzertifikat gesetzt werden. Die anderen Einstellungen können nach Bedarf angepasst werden. Sobald dies erledigt ist, wird Godot Ihr Projekt beim Export signieren.

source: Environment variables
de: Umgebungsvariablen
zh_cn: 环境变量

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
de: Sie können die folgenden Umgebungsvariablen verwenden, um Exportoptionen außerhalb des Editors festzulegen. Während des Exportvorgangs überschreiben diese die Werte, die Sie im Exportmenü festgelegt haben.
zh_cn: 你可以使用以下环境变量在编辑器外部设置导出选项。在导出过程中，这些值会覆盖你在导出菜单中设置的值。

source: Windows export environment variables
de: Windows-Export-Umgebungsvariablen
zh_cn: Windows 导出环境变量

source: Environment variable
de: Umgebungsvariable
zh_cn: 环境变量

source: Encryption / Encryption Key
de: Verschlüsselung / Verschlüsselungsschlüssel
zh_cn: 加密 / 密钥

source: Options / Codesign / Identity Type
de: Optionen / Codesign / Identitätstyp
zh_cn: 选项 / 代码签名 / 身份类型

source: Options / Codesign / Identity
de: Optionen / Codesign / Identität
zh_cn: 选项 / 代码签名 / 身份

source: Options / Codesign / Password
de: Optionen / Codesign / Passwort
zh_cn: 选项 / 代码签名 / 密码

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态

source: Export option
zh_cn: 导出选项
