Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/feature_tags.po
Languages: de, zh_tw

source: Feature tags
zh_tw: 功能標籤

source: Introduction
de: Einführung
zh_tw: 前言

source: Godot has a special system to tag availability of features. Each *feature* is represented as a string, which can refer to many of the following:
de: Godot verfügt über ein spezielles System zur Kennzeichnung der Verfügbarkeit von Features. Jedes *Feature* wird als String dargestellt, der sich auf viele der folgenden Elemente beziehen kann:
zh_tw: Godot 中有一個特殊的系統，能夠用來標記一個功能是否可用。每個 **功能** 都以字串來表示，可以參照下列各種東西：

source: Platform name.
de: Plattformname.
zh_tw: 平台名稱。

source: Platform architecture (64-bit or 32-bit, x86 or ARM).
de: Plattformarchitektur (64-Bit oder 32-Bit, x86 oder ARM).
zh_tw: 平台架構 (64 位元或 32 位元，x86 或 ARM)。

source: Platform type (desktop, mobile, Web).
de: Plattformtyp (Desktop, Mobile, Web).
zh_tw: 平台型別 (桌面、行動裝置、網頁)。

source: Supported texture compression algorithms on the platform.
de: Unterstützte Texturkomprimierungsalgorithmen auf der Plattform.
zh_tw: 平台所支援的紋理壓縮演算法。

source: Whether a build is ``debug`` or ``release`` (``debug`` includes the editor).
de: Ob ein Build ``debug`` oder ``release`` ist (``debug`` enthält den Editor).
zh_tw: 建置為 ``debug`` 還是 ``release`` (``debug`` 包含編輯器)。

source: Whether the project is running from the editor or a "standalone" binary.
de: Ob das Projekt über den Editor oder eine "eigenständige" Binärdatei ausgeführt wird.
zh_tw: 專案是在編輯器中執行還是以「獨立」二進位檔執行。

source: Many more things.
de: Viele weitere Dinge.
zh_tw: 許多其他功能。

source: Features can be queried at run-time from the singleton API by calling:
de: Features können zur Laufzeit über die Singleton-API abgefragt werden, indem Folgendes aufgerufen wird:
zh_tw: 可以在執行時呼叫單例 API 來查詢功能：

source: OS feature tags are used by GDExtension to determine which libraries to load. For example, a library for ``linux.debug.editor.x86_64`` will be loaded only on a debug editor build for Linux x86_64.
de: GDExtension verwendet die Betriebssystem-Tags, um zu bestimmen, welche Bibliotheken geladen werden sollen. Zum Beispiel wird eine Bibliothek für ``linux.debug.editor.x86_64`` nur auf einem Debug-Editor geladen, der für Linux x86_64 gebaut wurde.
zh_tw: GDExtension 使用作業系統功能標籤來決定要載入的庫。例如，「linux.debug.editor.x86_64」的程式庫將僅在 Linux x86_64 的偵錯編輯器版本上載入。

source: Default features
de: Default-Funktionen
zh_tw: 預設功能

source: Here is a list of most feature tags in Godot. Keep in mind they are **case-sensitive**:
de: Hier ist eine Liste der meisten Feature-Tags in Godot. Beachten Sie, dass bei ihnen die Groß- und Kleinschreibung wichtig ist:
zh_tw: 以下列出了 Godot 中大多數的功能標籤。請注意，這些標籤有 **區分大小寫** ：

source: **Feature tag**
zh_tw: **功能標籤**

source: **Description**
de: **Beschreibung**
zh_tw: **描述**

source: Running on Android (but not within a Web browser)
de: Läuft auf Android (aber nicht innerhalb eines Webbrowsers)
zh_tw: 在 Android 上運作（非 Web 瀏覽器）

source: Running on \*BSD (but not within a Web browser)
de: Läuft auf \*BSD (aber nicht in einem Webbrowser)
zh_tw: 在 \*BSD 上運行（非 Web 瀏覽器）

source: **linux**
zh_tw: **Alpine Linux**

source: Running on Linux (but not within a Web browser)
de: Läuft unter Linux (aber nicht innerhalb eines Webbrowsers)
zh_tw: 在 Linux 上運作（非 Web 瀏覽器）

source: Running on macOS (but not within a Web browser)
de: Läuft unter macOS (aber nicht in einem Webbrowser)
zh_tw: 在 macOS 上運作（非 Web 瀏覽器）

source: Running on iOS (but not within a Web browser)
de: Läuft unter iOS (aber nicht innerhalb eines Webbrowsers)
zh_tw: 在 iOS 上運作（非 Web 瀏覽器）

source: Running on Windows
de: Läuft unter Windows
zh_tw: 在 Windows 上執行

source: **linuxbsd**
zh_tw: **Alpine Linux**

source: Running on Linux or \*BSD
de: Läuft unter Linux oder \*BSD
zh_tw: 在 iOS 上執行

source: Running on a debug build (including the editor)
de: Läuft auf einem Debug-Build (einschließlich des Editors)
zh_tw: 在除錯建置中執行 (包含編輯器)

source: Running on a release build
de: Läuft auf einem Release-Build
zh_tw: 在發行版本建置上執行

source: Running on an editor build
de: Läuft auf einem Editor-Build
zh_tw: 在編輯器建置中執行

source: **template**
zh_tw: **釋出日期**

source: Running on a non-editor (export template) build
de: Läuft auf einem Nicht-Editor-Build (Exportvorlage)
zh_tw: 在非編輯器建置中執行

source: **double**
zh_tw: **mobile**

source: Running on a double-precision build
de: Läuft auf einem Double-Precision-Build
zh_tw: 在非編輯器建置中執行

source: **single**
zh_tw: **mobile**

source: Running on a single-precision build
de: Läuft auf einem Single-Precision-Build
zh_tw: 在非編輯器建置中執行

source: Running on a 64-bit build (any architecture)
de: Läuft auf einem 64-bit Build (jede Architektur)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: Running on a 32-bit build (any architecture)
de: Läuft auf einem 32-bit Build (jede Architektur)
zh_tw: 在 32 位元建置上執行 (不限架構)

source: Running on a 64-bit x86 build
de: Läuft auf einem 64-bit x86 Build
zh_tw: 在 64 位元 x86 建置上執行

source: **x86_32**
zh_tw: **x86**

source: Running on a 32-bit x86 build
de: Läuft auf einem 32-bit x86 Build
zh_tw: 在 32 位元 x86 建置上執行

source: Running on an x86 build (any bitness)
de: Läuft auf einem x86 Build (jede Bitgröße)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: Running on a 64-bit ARM build
de: Läuft auf einem 64-bit ARM Build
zh_tw: 在 64 位元 ARM 建置上執行

source: **arm32**
zh_tw: **arm**

source: Running on a 32-bit ARM build
de: Läuft auf einem 32-Bit ARM Build
zh_tw: 在 32 位元 ARM 建置上執行

source: Running on an ARM build (any bitness)
de: Läuft auf einem 64-bit Build (jede Bitgröße)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: Running on a 64-bit RISC-V build
de: Läuft auf einem 64-bit RISC-V Build
zh_tw: 在 64 位元 ARM 建置上執行

source: Running on a RISC-V build (any bitness)
de: Läuft auf einem RISC-V-Build (jede Bitgröße)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: Running on a 64-bit PowerPC build
de: Läuft auf einem 64-Bit-PowerPC-Build
zh_tw: 在 64 位元 x86 建置上執行

source: Running on a 32-bit PowerPC build
de: Läuft auf einem 32-Bit-PowerPC-Build
zh_tw: 在 32 位元 x86 建置上執行

source: **ppc**
zh_tw: **pc**

source: Running on a PowerPC build (any bitness)
de: Läuft auf einem PowerPC-Build (jede Bitgröße)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: **wasm64**
zh_tw: **arm64**

source: Running on a 64-bit WebAssembly build (not yet possible)
de: Läuftg auf einem 64-Bit-WebAssembly-Build (noch nicht möglich)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: Running on a 32-bit WebAssembly build
de: Läuft auf einem 32-Bit-WebAssembly-Build
zh_tw: 在 32 位元 ARM 建置上執行

source: Running on a WebAssembly build (any bitness)
de: Läuft auf einem WebAssembly-Build (beliebige Bitgröße)
zh_tw: 在 64 位元建置上執行 (不限架構)

source: Host OS is a mobile platform
de: Host-Betriebssystem ist eine mobile Plattform
zh_tw: 主機作業系統為行動裝置平台

source: Host OS is a PC platform (desktop/laptop)
de: Host-Betriebssystem ist eine PC-Plattform (Desktop/Laptop)
zh_tw: 主機作業系統為 PC 平台 (桌上型電腦／膝上型電腦)

source: Host OS is a Web browser
de: Das Host-Betriebssystem ist ein Webbrowser
zh_tw: 主機作業系統為網頁瀏覽器

source: **web_android**
zh_tw: **Android**

source: Host OS is a Web browser running on Android
de: Host OS ist ein Webbrowser, der auf Android läuft
zh_tw: 主機作業系統為網頁瀏覽器

source: **web_ios**
zh_tw: **web**

source: Host OS is a Web browser running on iOS
de: Host OS ist ein Webbrowser, der auf iOS läuft
zh_tw: 主機作業系統為網頁瀏覽器

source: **web_linuxbsd**
zh_tw: **web**

source: Host OS is a Web browser running on Linux or \*BSD
de: Host-Betriebssystem ist ein Webbrowser, der unter Linux oder \*BSD läuft
zh_tw: 主機作業系統為網頁瀏覽器

source: **web_macos**
zh_tw: **web**

source: Host OS is a Web browser running on macOS
de: Host OS ist ein Webbrowser, der unter macOS läuft
zh_tw: 主機作業系統為網頁瀏覽器

source: **web_windows**
zh_tw: **Windows**

source: Host OS is a Web browser running on Windows
de: Host-Betriebssystem ist ein Webbrowser, der unter Windows läuft
zh_tw: 主機作業系統為網頁瀏覽器

source: Textures using ETC1 compression are supported
de: Texturen mit ETC1-Komprimierung werden unterstützt
zh_tw: 支援以 ETC1 壓縮紋理

source: Textures using ETC2 compression are supported
de: Texturen mit ETC2-Komprimierung werden unterstützt
zh_tw: 支援以 ETC2 壓縮紋理

source: Textures using S3TC (DXT/BC) compression are supported
de: Texturen die S3TC (DXT/BC)-Kompression nutzen, werden unterstützt
zh_tw: 支援以 S3TC (DXT/BC) 壓縮紋理

source: **movie**
zh_tw: **mobile**

source: :ref:`Movie Maker mode <doc_creating_movies>` is active
de: :ref:`Movie Maker mode <doc_creating_movies>` ist aktiv
zh_tw: :ref:`Movie Maker 模式 <doc_creating_movies>` 已激活

source: With the exception of texture compression and ``movie`` feature tags, default feature tags are **immutable**. This means that they will *not* change depending on run-time conditions. For example, ``OS.has_feature("mobile")`` will return ``false`` when running a project exported to HTML5 on a mobile device.
de: Mit Ausnahme von Texturkompression und ``movie``-Featuretags sind die Default-Featuretags **unveränderlich**. Das bedeutet, dass sie sich *nicht* abhängig von den Laufzeitbedingungen ändern können. Zum Beispiel wird ``OS.has_feature("mobile")`` den Wert ``false`` zurückgeben, wenn ein nach HTML5 exportiertes Projekt auf einem mobilen Gerät läuft.
zh_tw: 除了紋理壓縮功能標籤之外，預設的功能標籤都是**不可修改**的。這意味著它們*不會*根據運作時的情況變化。例如，在移動裝置上運作匯出為 HTML5 的專案時， ``OS.has_feature("mobile")`` 返回的是 ``false``。

source: To check whether a project exported to HTML5 is running on a mobile device, :ref:`call JavaScript code <doc_javascript_eval>` that reads the browser's user agent.
de: Um zu prüfen, ob ein nach HTML5 exportiertes Projekt auf einem mobilen Gerät läuft, :ref:`rufen Sie den JavaScript-Code <doc_javascript_eval>` auf, der den User-Agenten des Browsers ausliest.
zh_tw: 要檢查匯出為 HTML5 的專案是否是在移動裝置上運作，請:ref:`呼叫 JavaScript 程式碼 <doc_javascript_eval>`讀取瀏覽器的使用者代理。

source: Custom features
de: Benutzerdefinierte Features
zh_tw: 自定功能

source: It is possible to add custom features to a build; use the relevant field in the *export preset* used to generate it:
de: Es ist möglich, benutzerdefinierte Features zu einem Build hinzuzufügen; verwenden Sie dazu das entsprechende Feld in der *Exportvorgabe*, die zur Erstellung des Builds verwendet wurde:
zh_tw: 可以在建置中新增自定功能。在 **匯出預設** 中使用相應的欄位來產生自定功能：

source: Custom feature tags are only used when running the exported project (including with :ref:`doc_one-click_deploy`). They are **not used** when running the project from the editor, even if the export preset marked as **Runnable** for your current platform has custom feature tags defined.
de: Benutzerdefinierte Feature-Tags werden nur verwendet, wenn das exportierte Projekt ausgeführt wird (auch mit :ref:`doc_one-click_deploy`). Sie werden **nicht** verwendet, wenn das Projekt vom Editor aus ausgeführt wird, selbst wenn die Exportvorgabe, die für Ihre aktuelle Plattform als **Runnable** markiert ist, benutzerdefinierte Featuretags definiert hat.
zh_tw: 自訂功能標籤只會在運作匯出後的專案中使用（包括 :ref:`doc_one-click_deploy`）。從編輯器中運作專案時**不會使用**，即便標記為**可執行**的匯出預設對應的平臺上存在自訂功能標籤。

source: Overriding project settings
de: Projekteinstellungen überschreiben
zh_tw: 覆寫專案設定

source: Features can be used to override specific configuration values in the *Project Settings*. This allows you to better customize any configuration when doing a build.
de: Features können verwendet werden, um bestimmte Konfigurationswerte in den *Projekteinstellungen* außer Kraft zu setzen. Dadurch können Sie eine beliebige Konfiguration beim Erstellen eines Builds besser anpassen.
zh_tw: 可以用功能來在 **[專案設定]** 中覆寫指定的組態設定值。這樣一來便能在建置時自定各種設定。

source: In the following example, a different icon is added for the demo build of the game (which was customized in a special export preset, which, in turn, includes only demo levels).
de: Im folgenden Beispiel wird ein anderes Icon für den Demo-Build des Spiels hinzugefügt (der in einer speziellen Exportvorgabe angepasst wurde, die wiederum nur Demo-Levels enthält).
zh_tw: 在下列範例中，Demo 版的遊戲使用不同的圖示 (圖示在林一個匯出預設設定中自定，並只會包含 Demo 關卡)。

source: After overriding, a new field is added for this specific configuration:
de: Nach dem Überschreiben wird ein neues Feld für diese spezielle Konfiguration hinzugefügt:
zh_tw: 覆寫後，組態設定中會多一個用於該建置的新欄位：

source: When using the :ref:`project settings "override.cfg" functionality <class_ProjectSettings>` (which is unrelated to feature tags), remember that feature tags still apply. Therefore, make sure to *also* override the setting with the desired feature tag(s) if you want them to override base project settings on all platforms and configurations.
de: Wenn Sie die :ref:`Projekteinstellungen "override.cfg"-Funktionalität <class_ProjectSettings>` verwenden (die nichts mit Featuretags zu tun hat), denken Sie daran, dass Featuretags weiterhin gelten. Stellen Sie daher sicher, dass Sie *auch* die Einstellung mit dem/den gewünschten Featuretag(s) überschreiben, wenn Sie wollen, dass diese die Basisprojekteinstellungen auf allen Plattformen und Konfigurationen überschreiben.
zh_tw: 當使用:ref:`專案設定的“override.cfg”功能 <class_ProjectSettings>`時（與功能標籤無關），記住功能標籤仍然適用。因此，如果你想讓它們覆蓋所有平臺和配置上的基本專案設定，請確保*同時*用所需的功能標籤覆蓋設定。

source: Default overrides
de: Default-Überschreibungen
zh_tw: 預設覆寫

source: There are already a lot of settings that come with overrides by default; they can be found in many sections of the project settings.
de: Es gibt bereits eine Vielzahl von Einstellungen, die standardmäßig mit Überschreibungen versehen sind; sie sind in vielen Abschnitten der Projekteinstellungen zu finden.
zh_tw: 預設已經有許多設定會被覆蓋。專案設定中各個地方都有。

source: Customizing the build
de: Anpassen des Builds
zh_tw: 自定建置

source: Feature tags can be used to customize a build process too, by writing a custom **ExportPlugin**. They are also used to specify which shared library is loaded and exported in **GDExtension**.
de: Featuretags können auch verwendet werden, um einen Build-Prozess anzupassen, indem man ein eigenes **ExportPlugin** schreibt. Sie werden auch verwendet, um festzulegen, welche Shared Library in **GDExtension** geladen und exportiert wird.
zh_tw: 可以通過撰寫自定 **ExportPlugin** 來使用功能標籤自定建置過程。ExportPlugin 也可以用來指定 **GDNative** 中要載入與匯出哪些共用程式庫。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
