Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/running_on_macos.po
Languages: de, zh_tw

source: Running Godot apps on macOS
de: Ausführen von Godot-Anwendungen unter macOS
zh_tw: 在 macOS 上運作 Godot 套用

source: This page covers running Godot projects on macOS. If you haven't exported your project yet, read :ref:`doc_exporting_for_macos` first.
de: Diese Seite behandelt die Ausführung von Godot-Projekten unter macOS. Wenn Sie Ihr Projekt noch nicht exportiert haben, lesen Sie zuerst :ref:`doc_exporting_for_macos`.
zh_tw: 這個頁面描述的是在 macOS 上運作 Godot 專案。如果你還沒有匯出專案，請先閱讀 :ref:`doc_exporting_for_macos`。

source: By default, macOS will run only applications that are signed and notarized.
de: Standardmäßig führt macOS nur Programme aus, die signiert und notarisiert sind.
zh_tw: 預設情況下，macOS 只會運作簽章並公證後的應用程式。

source: When running an app from the Downloads folder or when still in quarantine, Gatekeeper will perform *path randomization* as a security measure. This breaks access to relative paths from the app, which the app relies upon to work. To resolve this issue, move the app to the ``/Applications`` folder.
de: Wenn eine Anwendung aus dem Downloads-Ordner ausgeführt wird oder sich noch in Quarantäne befindet, führt Gatekeeper als Sicherheitsmaßnahme eine *Pfad-Randomisierung* durch. Dies unterbricht den Zugriff auf relative Pfade von der Anwendung, auf die von der Anwendung benötigt werden, um zu funktionieren. Um dieses Problem zu beheben, verschieben Sie die Anwendung in den Ordner ``/Applications``.
zh_tw: 當從下載資料夾執行應用程式或仍處於隔離狀態時，Gatekeeper 將執行*路徑隨機化*作為安全措施。這會中斷對應用程式依賴的相對路徑的存取。若要解決此問題，請將應用程式移至“/Applications”資料夾。

source: In general, macOS apps should avoid relying on relative paths from the application folder.
de: Im Allgemeinen sollten macOS-Anwendungen es vermeiden, sich auf relative Pfade aus dem Anwendungsordner zu verlassen.
zh_tw: 一般來說，macOS 應用程式應避免依賴應用程式資料夾中的相對路徑。

source: Depending on the way a macOS app is signed and distributed, the following scenarios are possible:
de: Abhängig von der Art und Weise, wie eine macOS-App signiert und verteilt wird, sind die folgenden Szenarien möglich:
zh_tw: 根據 macOS 應用簽章和分發方法的不同，可能出現下列情況：

source: App is signed, notarized and distributed via App Store
de: App wird signiert, notarisiert und über den App Store vertrieben
zh_tw: App 已簽章並公證，通過 App Store 分發

source: App developers need to join the Apple Developer Program, and configure signing and notarization options during export, then upload the app to the App Store.
de: App-Entwickler müssen dem Apple Developer Program beitreten und die Optionen zum Signieren und Notarisieren während des Exports konfigurieren und die App dann in den App Store hochladen.
zh_tw: App 開發者需要加入 Apple 開發者計畫，然後在匯出時配置簽章和公證選項，最後將 App 上傳到 App Store。

source: The app should run out of the box, without extra user interaction required.
de: Die Anwendung sollte sofort einsatzbereit sein, ohne dass eine zusätzliche Benutzerinteraktion erforderlich ist.
zh_tw: App 應該是可以開箱即用的，無需額外的使用者互動。

source: App is signed, notarized and distributed outside App Store
de: App wird signiert, notarisiert und außerhalb des App Stores vertrieben
zh_tw: App 已簽章並公證，在 App Store 外分發

source: App developers need to join the Apple Developer Program, and configure signing and notarization options during export, then distribute the app as ".DMG" or ".ZIP" archive.
de: App-Entwickler müssen dem Apple Developer Program beitreten und die Optionen zum Signieren und Notarisieren während des Exports konfigurieren und die App dann als ".DMG" oder ".ZIP" Archiv verteilen.
zh_tw: App 開發者需要加入 Apple 開發者計畫，然後在匯出時配置簽章和公證選項，最後將 App 以“.DMG”或“.ZIP”歸檔檔的形式分發。

source: When you run the app for the first time, the following dialog is displayed:
de: Wenn Sie die Anwendung zum ersten Mal starten, wird der folgende Dialog angezeigt:
zh_tw: 首次運作該 App 時，會出現如下對話方塊：

source: Click ``Open`` to start the app.
de: Klicken Sie auf ``Open``, um die Anwendung zu starten.
zh_tw: 按一下 ``打開`` 啟動應用。

source: If you see the following warning dialog, your Mac is set up to allow apps only from the App Store.
de: Wenn Sie die folgende Warnung sehen, ist Ihr Mac so eingestellt, dass er nur Anwendungen aus dem App Store zulässt.
zh_tw: 如果你看到了如下的警告對話方塊，那麼你的 Mac 是被設定成了只允許來自 App Store 的應用。

source: To allow third-party apps, open ``System Preferences``, click ``Security & Privacy``, then click ``General``, unlock settings, and select ``App Store and identified developers``.
de: Um Anwendungen von Drittanbietern zuzulassen, öffnen Sie ``Systemeinstellungen``, klicken Sie auf ``Sicherheit und Datenschutz``, dann auf ``Allgemein``, entsperren Sie die Einstellungen und wählen Sie ``App Store und identifizierte Entwickler``.
zh_tw: 要允許協力廠商程式，請打開 ``系統設定``，點擊 ``安全性與隱私``，然後點擊 ``通用``，解鎖設定，然後選擇 ``App Store 和被認可的開發者``。

source: App is signed (including ad-hoc signatures) but not notarized
de: App ist signiert (einschließlich Ad-hoc-Signaturen), aber nicht notarisiert
zh_tw: 應用已簽章（包括 Ad-hoc 簽章）但未公證

source: App developer used self-signed certificate or ad-hoc signing (default Godot behavior for exported project).
de: Der App-Entwickler hat ein selbstsigniertes Zertifikat oder eine Ad-hoc-Signierung verwendet (Default-Verhalten von Godot für exportierte Projekte).
zh_tw: 應用開發者使用了自簽章憑證或 Ad-hoc 簽章（Godot 匯出專案的預設行為）。

source: To run this app, you can temporarily override Gatekeeper:
de: Um diese Anwendung auszuführen, können Sie Gatekeeper vorübergehend außer Kraft setzen:
zh_tw: 要運作此應用，你可以臨時覆蓋 Gatekeeper：

source: Either open ``System Preferences``, click ``Security & Privacy``, then click ``General``, and click ``Open Anyway``.
de: Öffnen Sie entweder ``Systemeinstellungen``, klicken Sie auf ``Sicherheit und Datenschutz``, dann auf ``Allgemein`` und klicken Sie auf ``Trotzdem öffnen``.
zh_tw: 可以打開 ``系統設定``，點擊 ``安全性與隱私``，然後點擊 ``通用``，再點擊 ``仍然打開``。

source: Or, right-click (Control-click) on the app icon in the Finder window and select ``Open`` from the menu.
de: Oder klicken Sie mit der rechten Maustaste (Control-Klick) auf das Anwendungs-Icon im Finder-Fenster und wählen Sie ``Öffnen`` aus dem Menü.
zh_tw: 也可以在訪達視窗中按右鍵（Control-按一下）應用圖示，選擇功能表中的 ``打開``。

source: Then click ``Open`` in the confirmation dialog.
de: Klicken Sie dann im Bestätigungsdialog auf ``Öffnen``.
zh_tw: 然後在確認對話方塊中按一下 ``打開``。

source: Enter your password if you're prompted.
de: Geben Sie Ihr Passwort ein, wenn Sie dazu aufgefordert werden.
zh_tw: 如出現提示就輸入密碼。

source: Another option is to disable Gatekeeper entirely. Note that this does decrease the security of your computer by allowing you to run any software you want. To do this, run ``sudo spctl --master-disable`` in the Terminal, enter your password, and then the **Anywhere** option will be available:
de: Eine andere Möglichkeit besteht darin, Gatekeeper vollständig zu deaktivieren. Beachten Sie, dass dies die Sicherheit Ihres Computers beeinträchtigt, da Sie dann jede beliebige Software ausführen können. Um dies zu tun, führen Sie ``sudo spctl --master-disable`` im Terminal aus, Geben Sie Ihr Passwort ein, und die Option **Anywhere** wird verfügbar sein:
zh_tw: 另一個選擇是完全停用 Gatekeeper。請注意，這會允許您運作任何您想要的軟體，從而降低電腦的安全性。為此，請在終端機中執行“sudo spctl --master-disable”，輸入密碼，然後 **Anywhere** 選項將可用：

source: Note that Gatekeeper will re-enable itself when macOS updates.
de: Beachten Sie, dass Gatekeeper sich selbst wieder aktiviert, wenn macOS aktualisiert wird.
zh_tw: 請注意，當 macOS 更新時，Gatekeeper 將重新啟用自身。

source: App is not signed, executable is linker-signed
de: App ist nicht signiert, ausführbare Datei ist Linker-signiert
zh_tw: App 未簽章，可執行檔由連結器簽章

source: App is built using official export templates, but it is not signed.
de: Die App wird unter Verwendung offizieller Exportvorlagen erstellt, ist aber nicht signiert.
zh_tw: App 使用官方匯出範本建構，但未簽章。

source: To run this app, you should remove the quarantine extended file attribute manually:
de: Um diese App auszuführen, sollten Sie das Attribut für die erweiterte Quarantäne-Datei manuell entfernen:
zh_tw: 要運作這個 App，你應該手動移除“隔離”（quarantine）擴充檔案屬性：

source: Open ``Terminal.app`` (press :kbd:`Cmd + Space` and enter ``Terminal``).
de: Öffnen Sie ``Terminal.app`` (drücken Sie :kbd:`Cmd + Space` und geben Sie ``Terminal`` ein).
zh_tw: 打開 ``Terminal.app``（按 ``Cmd + 空格``，輸入 ``Terminal``）。

source: Navigate to the folder containing the target application.
de: Navigieren Sie zum Godot-Stammverzeichnis und wählen Sie es aus.
zh_tw: 前往 Godot 根目錄並選擇該資料夾。

source: Use the ``cd path_to_the_app_folder`` command, e.g. ``cd ~/Downloads/`` if it's in the ``Downloads`` folder.
de: Benutzen Sie den Befehl ``cd path_to_the_app_folder``, z.B. ``cd ~/Downloads/``, wenn es sich im ``Downloads``-Ordner befindet.
zh_tw: 使用 ``cd 到_App_資料夾的路徑`` 命令，例如在 ``Downloads`` 資料夾中的話就是 ``cd ~/Downloads/``。

source: Run the command ``xattr -dr com.apple.quarantine "Unsigned Game.app"`` (including quotation marks and ``.app`` extension).
de: Führen Sie den Befehl ``xattr -dr com.apple.quarantine "Unsigned Game.app"`` aus (einschließlich Anführungszeichen und der Erweiterung ``.app``).
zh_tw: 執行命令 ``xattr -dr com.apple.quarantine "未簽章遊戲.app"``（包括引號和“.app”副檔名）。

source: Neither app nor executable is signed (relevant for Apple Silicon Macs only)
de: Weder App noch ausführbare Datei sind signiert (nur für Apple Silicon Macs relevant)
zh_tw: App 和可執行檔都沒有簽章（僅適用於 Apple Slilicon 的 mac）

source: App is built using custom export templates, compiled using OSXCross, and it is not signed at all.
de: Die App wird mit benutzerdefinierten Exportvorlagen erstellt, mit OSXCross kompiliert und ist nicht signiert.
zh_tw: App 使用自訂匯出範本建構，使用 OSXCross 編譯，完全沒有簽章。

source: To run this app, you can ad-hoc sign it yourself:
de: Um diese Anwendung auszuführen, können Sie sie selbst ad-hoc signieren:
zh_tw: 要運作這個 App，你可以自己進行 Ad-hoc 簽章：

source: Install ``Xcode`` for the App Store, start it and confirm command line tools installation.
de: Installieren Sie ``Xcode`` für den App Store, starten Sie es und bestätigen Sie die Installation der Kommandozeilentools.
zh_tw: 從 App Store 安裝 ``Xcode``，運作並確認安裝命令列工具。

source: Run the following commands:
de: Führen Sie folgende Befehle aus:
zh_tw: 在下方範例中：

source: ``xattr -dr com.apple.quarantine "Unsigned Game.app"`` (including quotation marks and ".app" extension).
de: ``xattr -dr com.apple.quarantine "Unsigned Game.app"`` (einschließlich Anführungszeichen und ".app" Dateiendung).
zh_tw: ``xattr -dr com.apple.quarantine "未簽章遊戲.app"``（包括引號和“.app”副檔名）。

source: ``codesign -s - --force --deep "Unsigned Game.app"`` (including quotation marks and ".app" extension).
de: ``codesign -s - --force --deep "Unsigned Game.app"`` (einschließlich Anführungszeichen und ".app" Dateiendung).
zh_tw: ``codesign -s - --force --deep "未簽章遊戲.app"``（包括引號和“.app”副檔名）。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
