Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/import_process.po
Languages: de, zh_cn, zh_tw

source: Import process
de: Import-Prozess
zh_cn: 导入流程
zh_tw: 匯入流程

source: Importing assets in Godot
de: Assets in Godot importieren
zh_cn: 在 Godot 中导入资产
zh_tw: 於 Godot 3.0+ 匯入素材

source: To import assets in Godot, place your assets (image files, scenes, audio files, fonts, etc) directly in the project folder. There are 2 ways to achieve this:
de: Um Assets in Godot zu importieren, legen Sie Ihre Assets (Bilddateien, Szenen, Audiodateien, Schriftarten usw.) direkt in den Projektordner. Es gibt 2 Möglichkeiten, dies zu erreichen:
zh_cn: 要在 Godot 中导入资产，请将资产（图像文件、场景、音频文件、字体等）直接放置在项目文件夹中。有两种方法可以实现：
zh_tw: 要在 Godot 中匯入素材，請將素材（影像檔、場景、音訊檔、字形等）直接放置在專案檔案夾中。有兩種方法可以實作：

source: **For any file type:** Copy files manually with your operating system's file manager.
de: **Für beliebige Dateitypen:** Kopieren Sie Dateien manuell mit dem Dateimanager Ihres Betriebssystems.
zh_cn: **任何文件类型：**\ 使用操作系统的文件管理器手动复制文件。
zh_tw: **任何檔案型別：**使用作業系統的檔案管理員手動複製檔。

source: **For file types that can be imported by Godot:** Drag-and-drop files from the operating system's file manager to the editor's FileSystem dock. This only works with *resource* file types (i.e. file types that Godot can import).
de: **Für Dateitypen, die von Godot importiert werden können:** Ziehen Sie Dateien aus dem Dateimanager des Betriebssystems per Drag&Drop in das Dateisystem-Dock des Editors. Dies funktioniert nur mit *Ressourcen*-Dateitypen (d. h. Dateitypen, die Godot importieren kann).
zh_cn: **Godot 能够导入的文件类型：**\ 将文件从操作系统的文件管理器拖放至编辑器的“文件系统”面板。只适用于\ *资源*\ 文件类型（即 Godot 能够导入的文件类型）。
zh_tw: **Godot 能夠匯入的檔案型別：**將檔從作業系統的檔案管理員拖放至編輯器的“檔案系統”面板。只適用於*資源*檔案型別（即 Godot 能夠匯入的檔案型別）。

source: Godot will automatically import these files internally and keep the imported resources hidden in a ``res://.godot/imported/`` folder.
de: Godot wird diese Dateien automatisch intern importieren und die importierten Ressourcen in einem ``res://.godot/imported/``-Ordner versteckt halten.
zh_cn: Godot 内部会自动导入这些文件，将导入后的资源存放在隐藏的 ``res://.godot/imported/`` 文件夹中。
zh_tw: Godot 內部會自動匯入這些檔，將匯入後的資源存放在隱藏的 ``res://.godot/imported/`` 資料夾中。

source: This means that when trying to access imported assets through code, you need to use the :ref:`Resource Loader<class_ResourceLoader>` as it will automatically take into account where the internal files are saved. If you try and access an imported asset using the :ref:`FileAccess <class_FileAccess>` class, it will work in the editor, but **it will break in the exported project**.
de: Das bedeutet, dass Sie, wenn Sie versuchen, über den Code auf importierte Assets zuzugreifen, die Klasse :ref:`Resource Loader<class_ResourceLoader>` verwenden müssen, da sie automatisch berücksichtigt, wo die internen Dateien gespeichert sind. Wenn Sie versuchen, mit der Klasse :ref:`FileAccess <class_FileAccess>` auf ein importiertes Asset zuzugreifen, wird es im Editor funktionieren, aber **im exportierten Projekt** wird es nicht funktionieren.
zh_cn: 这样一来，在代码中尝试访问导入后的资产就需要使用\ :ref:`资源加载器 <class_ResourceLoader>`\ ，因为会自动考虑内部文件的存储位置。如果用 :ref:`FileAccess <class_FileAccess>` 尝试访问导入后的资产，虽然在编辑器中是可行的，但是\ **在导出后的项目中会失败**\ 。
zh_tw: 這表示，要在程式碼中存取匯入的素材，就必須使用 :ref:`ResourceLoader<class_ResourceLoader>` ，因為 ResourceLoader 會自己處理要在內部將檔案存在哪裡。若使用 :ref:`File <class_File>` 來存取匯入的素材，則只能在編輯器中正常運作，而匯出的專案中則會出問題。

source: However, the :ref:`Resource Loader<class_ResourceLoader>` cannot access non-imported files. Only the :ref:`FileAccess <class_FileAccess>` class can.
de: Die Klasse :ref:`Resource Loader<class_ResourceLoader>` kann jedoch nicht auf nicht-importierte Dateien zugreifen. Nur die Klasse :ref:`FileAccess <class_FileAccess>` kann dies.
zh_cn: 然而\ :ref:`资源加载器 <class_ResourceLoader>`\ 无法访问未经导入的文件，只有 :ref:`FileAccess <class_FileAccess>` 类可以。
zh_tw: 然而，:ref:`ResourceLoader<class_ResourceLoader>` 無法存取非匯入的檔案，只有 :ref:`File <class_File>` 可以存取。

source: Changing import parameters
de: Importparameter ändern
zh_cn: 更改导入参数
zh_tw: 更改匯入參數

source: Import parameters are only present in *non-native* Godot resource types. This means Godot's own scene and resource file formats (``.tscn``, ``.scn``, ``.tres``, ``.res``) don't have import options you can select in the Import dock.
de: Importparameter sind nur in *nicht-nativen* Godot-Ressourcentypen vorhanden. Das bedeutet, dass Godots eigene Szenen- und Ressourcendateiformate (``.tscn``, ``.scn``, ``.tres``, ``.res``) keine Importoptionen haben, die Sie im Import-Dock auswählen können.
zh_cn: *非原生* Godot 资源类型才有导入参数。也就是说，Godot 自己的场景和资源文件格式（\ ``.tscn``\ 、\ ``.scn``\ 、\ ``.tres``\ 、\ ``.res``\ ）在“导入”面板中没有选项可用。
zh_tw: *非原生* Godot 資源型別才有匯入參數。也就是說，Godot 自己的場景和資源檔格式（``.tscn``、``.scn``、``.tres``、``.res``）在“匯入”面板中沒有選項可用。

source: To change the import parameters of an asset in Godot, select the relevant resource in the FileSystem dock:
de: Um die Importparameter eines Assets in Godot zu ändern, wählen Sie die entsprechende Ressource im Dateisystem-Dock aus:
zh_cn: 要在 Godot 中更改资产的导入参数，请在“文件系统”面板中选中相关的资源：
zh_tw: 若要在 Godot 中更改素材的匯入參數，於檔案系統 Dock 中選擇相應的資源即可 (但請記得只有非原生 Godot 資源型別有匯入參數)。：

source: After adjusting the parameters, click **Reimport**. Be careful: if you select another file in the FileSystem dock before clicking **Reimport**, changes will be discarded. After clicking **Reimport**, the chosen parameters will only be used for this asset and on future reimports.
de: Nachdem Sie die Parameter angepasst haben, klicken Sie auf **Neuimport**. Vorsicht: Wenn Sie eine andere Datei im Dateisystem-Dock auswählen, bevor Sie auf **Neuimport** klicken, werden die Änderungen verworfen. Nachdem Sie auf **Neuimport** geklickt haben, werden die gewählten Parameter nur für dieses Asset und für zukünftige Neu-Importe verwendet.
zh_cn: 参数调整完毕后，请单击\ **重新导入**\ 。小心：如果在单击\ **重新导入**\ 之前在“文件系统”面板中选中其他文件，那么你做出的更改就会被丢弃。单击\ **重新导入**\ 之后，选中的参数只会对该资产生效，后续重新导入时也会生效。
zh_tw: 參數調整完畢後，請按一下**重新匯入**。小心：如果在按一下**重新匯入**之前在“檔案系統”面板中選中其他檔，那麼你做出的更改就會被丟棄。按一下**重新匯入**之後，選中的參數只會對該素材生效，後續重新匯入時也會生效。

source: Changing the import parameters of several assets at the same time is also possible. Simply select all of them together in the resources dock and the exposed parameters will apply to all of them when reimporting.
de: Es ist auch möglich, die Importparameter mehrerer Assets gleichzeitig zu ändern. Wählen Sie einfach alle zusammen im Ressourcen-Dock aus, und die angezeigten Parameter gelten beim erneuten Importieren für alle.
zh_cn: 同时更改多个资产的导入参数也是可能的. 只需在资源停靠面板中一起选择所有这些资产, 当重新导入时, 所暴露的参数将应用于它们.
zh_tw: 也可以同時更改多個素材的匯入參數。只需要在資源 Dock 中一次選擇所有要修改的資源，重新匯入時，參數將套用在這些資源上。

source: Reimporting multiple assets
de: Mehrere Assets erneut importieren
zh_cn: 重新导入多个资产
zh_tw: 重新匯入多個素材

source: While working on a project you may find that several assets need to have the same parameters changed, such as enabling mipmaps, but you only want those specific parameters changed. To do this, select every asset you want to reimport in the file system. In the import tab there will now be a checkbox to the left of every import parameter.
de: Während der Arbeit an einem Projekt müssen möglicherweise für mehrere Assets dieselben Parameter geändert werden, z.B. das Aktivieren von MipMaps. Es sollten jedoch nur diese spezifischen Parameter geändert werden. Wählen Sie dazu jedes Asset aus, das Sie erneut in das Dateisystem importieren möchten. Im "Importieren"-Tab befindet sich jetzt links neben jedem Importparameter eine Checkbox.
zh_cn: 在进行项目时，你可能会发现有数个资产都需要修改同一个参数的情况，例如启用 mipmap，但你只想改动特定的参数。为此，请在文件系统中选择你要重新导入的资产。现在导入选项卡的每个导入参数的左边都会出现一个复选框。
zh_tw: 在處理專案時，我們有時候會需要對多個素材上更改同一個參數，如開啟 Mipmap 等，通常這種情況只需要更改特定的幾個參數。為此，可以在檔案系統中選擇所有要重新匯入的素材，然後在匯入分頁中，每個匯入參數的左邊會出現一個勾選框。

source: Select the checkbox of the parameters you want to change on your imported assets, then change the parameters normally. Finally, click the reimport button and every selected asset will be reimported with only those parameters changed.
de: Aktivieren Sie die Checkbox der Parameter, die Sie für Ihre importierten Assets ändern möchten und ändern Sie die Parameter wie gewohnt. Klicken Sie abschließend auf den "Neuimport"-Button. Jedes ausgewählte Asset wird erneut importiert, wobei nur die Parameter geändert werden.
zh_cn: 勾选导入资产中你想更改的参数，然后照常修改参数。最后点击“重新导入”按钮。这样就重新导入了只有选定部分参数被修改过的资产。
zh_tw: 勾選匯入素材中要更改的參數，接著就照常更改參數即可。最後，選擇 [重新匯入] 按鈕，所有選擇的素材都只會套用這些參數的更改並重新匯入。

source: Automatic reimport
de: Automatischer Neu-Import
zh_cn: 自动重新导入
zh_tw: 自動重新匯入

source: When the MD5 checksum of the source asset changes, Godot will perform an automatic reimport of it, applying the preset configured for that specific asset.
de: Wenn sich die MD5-Prüfsumme des Quell-Assets ändert, führt Godot einen automatischen Neu-Import durch, wobei die für dieses bestimmte Asset konfigurierte Vorgabe angewendet wird.
zh_cn: 当源资产的 MD5 校验发生变化时,Godot 将执行自动重新导入, 应用为该特定资产配置的预设.
zh_tw: 若原始素材的 MD5 檢查碼發生變化時，Godot 會自動重新匯入該素材，並將預設設定套用至特定素材上。

source: Files generated
de: Erzeugte Dateien
zh_cn: 生成的文件
zh_tw: 產生的檔案

source: Importing will add an extra ``<asset>.import`` file next to the source file, containing the import configuration.
de: Beim Importieren wird eine zusätzliche Datei ``<asset>.import`` neben der Quelldatei hinzugefügt, in der sich die Importkonfiguration befindet.
zh_cn: 导入时会在源文件的旁边生成额外的 ``<资产>.import`` 文件，包含的是导入配置。
zh_tw: 匯入過程會產生一個額外的 <asset>.import 檔案，其中包含了匯入組態設定。

source: **Make sure to commit these files to your version control system**, as these files contain important metadata.
de: **Stellen Sie sicher, dass Sie diese Dateien in Ihr Versionsverwaltungssystem** übertragen, da diese Dateien wichtige Metadaten enthalten.
zh_cn: **请务必将这些文件提交进版本控制系统**\ ，因为这些文件包含了重要的元数据。
zh_tw: **請務必將這些檔提交進版本控制系統**，因為這些檔包含了重要的中繼資料。

source: Additionally, extra assets will be present in the hidden ``res://.godot/imported/`` folder:
de: Zusätzlich werden weitere Assets im versteckten Ordner ``res://.godot/imported/`` vorliegen:
zh_cn: 此外，额外的资产会被放在隐藏的 ``res://.godot/imported/`` 文件夹中：
zh_tw: 另外，``res://.import`` 隱藏資料夾中也包含了額外的素材：

source: If any of the files present in this folder is erased (or the whole folder), the asset or assets will be reimported automatically. As such, committing the ``.godot/`` folder to the version control system is not recommended. While committing this folder can shorten reimporting time when checking out on another computer, it requires considerably more space and bandwidth.
de: Wenn eine der Dateien in diesem Ordner (oder der gesamte Ordner) gelöscht wird, wird das Asset oder die Assets automatisch neu importiert. Es wird daher nicht empfohlen, den Ordner ``.godot/`` in das Versionsverwaltungssystem zu übertragen. Das Committen dieses Ordners kann zwar die Zeit für den Neu-Import beim Auschecken auf einem anderen Computer verkürzen, erfordert aber erheblich mehr Speicherplatz und Bandbreite.
zh_cn: 如果此文件夹中的任何文件（或整个文件夹）被删除，则会自动重新导入资产。因此，不建议将 ``.godot/`` 文件夹提交给版本控制系统。提交这个文件夹虽然能够缩短在另一台计算机上检出后重新导入的时间，但是需要相当多的空间和带宽。
zh_tw: 若刪除該資料夾中的檔案 (或整個資料夾)，則素材會被自動重新匯入。因此，不一定要將該資料夾簽入版本控制系統中。有該資料夾可加速在其他電腦上簽出專案後重新匯入的時間，但就需要更多空間與傳輸時間。

source: The default version control metadata that can be generated on project creation will automatically ignore the ``.godot/`` folder.
de: Die Default-Metadaten der Versionsverwaltung, die bei der Projekterstellung erzeugt werden können, ignorieren automatisch den Ordner ``.godot/``.
zh_cn: 在项目创建时生成的默认版本控制元数据将自动忽略 ``.godot/`` 文件夹。
zh_tw: 在專案建立時產生的預設版本控制元資料將自動忽略“.godot/”資料夾。

source: Changing import resource type
de: Ändern des Importressourcentyps
zh_cn: 更改导入资源类型
zh_tw: 更改匯入資源型別

source: Some source assets can be imported as different types of resources. For this, select the relevant type of resource desired then click **Reimport**:
de: Einige Quell-Assets können als verschiedene Ressourcentypen importiert werden. Wählen Sie dazu den gewünschten Ressourcentyp aus und klicken Sie auf **Neuimport**:
zh_cn: 一些源资产可以作为不同类型的资源被导入。为此，选择所需资源的相关类型，然后点击 **重新导入** 即可：
zh_tw: 有些素材可以匯入為不同型別的資源。若要匯入為不同型別，選擇需要的資源型別並點擊 [重新匯入]：

source: Changing default import parameters
de: Ändern der Default-Importparameter
zh_cn: 更改默认导入参数
zh_tw: 更改預設匯入參數

source: Different types of projects might require different defaults. Changing the import options to a predefined set of options can be achieved by using the **Preset...** Menu. Besides some resource types offering presets, the default settings can be saved and cleared too:
de: Verschiedene Projekttypen können unterschiedliche Default-Einstellungen erfordern. Das Ändern der Importoptionen auf einen vordefinierten Satz von Optionen kann über das Menü **Vorgabe...** erreicht werden. Neben einigen Ressourcentypen, die Vorgaben anbieten, können auch die Standardeinstellungen gespeichert und gelöscht werden:
zh_cn: 不同类型的游戏可能需要不同的默认值。通过使用 **预设...** 菜单可以将导入选项更改为预定义的选项集。除了某些提供预设的资产类型外，还可以保存和清除默认设置：
zh_tw: 依據遊戲型別的不同可能需要不同預設值。可以使用 [預設設定...] 選單來設定各專案的預設值。除了某些預設提供的資源型別，也可以保存或清除預設設定：

source: The default import parameters for a given resource type can be changed project-wide using the **Import Defaults** tab of the Project Settings dialog:
de: Die Default-Importparameter für einen bestimmten Ressourcentyp können über den Tab **Import-Default-Werte** des Dialogs Projekteinstellungen projektweit geändert werden:
zh_cn: 可以使用“项目设置”对话框的 **默认导入设置** 选项卡，在项目范围内更改给定资源类型的默认导入参数：
zh_tw: 可使用「專案設定」對話方塊的「**匯入預設值**」標籤在專案範圍內變更給定資源型別的預設匯入參數：

source: Further reading
de: Weitere Lektüre
zh_cn: 扩展阅读
zh_tw: 多執行緒

source: This workflow takes a little time to get used to, but it enforces a more correct way to deal with resources.
de: Dieser Workflow ist etwas gewöhnungsbedürftig, gewährleistet aber einen korrekteren Umgang mit Ressourcen.
zh_cn: 这个工作流程需要一些时间来适应，但它会强制使用更正确的方式来处理资源。
zh_tw: 這個工作流程很簡短，要習慣應該不需要花上太多時間。此外，本工作流程也能強制以更正確的方式來處理資源。

source: There are many types of assets available for import. Continue reading to understand how to work with all of them:
de: Es gibt viele Arten von Assets, die importiert werden können. Lesen Sie weiter, um zu erfahren, wie Sie mit allen arbeiten können:
zh_cn: 可以导入的资产类型有很多。如果想要了解用法，请继续阅读：
zh_tw: 也有許多可匯入的素材型別，請繼續閱讀以瞭解如何處理這些素材:

source: :ref:`doc_importing_images`
zh_tw: :ref:`doc_exporting`

source: :ref:`doc_importing_audio_samples`
zh_tw: :ref:`doc_exporting`

source: :ref:`doc_importing_3d_scenes`
zh_tw: :ref:`doc_exporting`

source: :ref:`doc_importing_translations`
zh_tw: :ref:`doc_exporting`

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
