Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_audio_samples.po
Languages: de, zh_cn, zh_tw

source: Importing audio samples
de: Audio-Samples importieren
zh_cn: 导入音频采样
zh_tw: 匯入音訊樣本

source: Supported audio formats
de: Unterstützte Audioformate
zh_cn: 支持的音频格式
zh_tw: 支援的圖片格式

source: Godot provides 3 options to import your audio data: WAV, Ogg Vorbis and MP3.
de: Godot bietet 3 Optionen für den Import Ihrer Audiodaten: WAV, Ogg Vorbis und MP3.
zh_cn: Godot 提供了三个选项来导入音频数据：WAV、Ogg Vorbis 和 MP3。
zh_tw: 原始音訊檔通常都很大，而且我們通常都不會想用原始檔。Godot 中提供了兩個主要選項來匯入音訊資料：WAV 與 Ogg Vorbis。

source: Each format has different advantages:
de: Jedes Format hat unterschiedliche Vorteile:
zh_cn: 不同的格式各有优点：
zh_tw: 各有優點。

source: WAV files use raw data or light compression (IMA-ADPCM). They are lightweight on the CPU to play back (hundreds of simultaneous voices in this format are fine). The downside is that they take up a lot of disk space.
de: WAV-Dateien verwenden Rohdaten oder eine leichte Komprimierung (IMA-ADPCM). Sie belasten die CPU bei der Wiedergabe nur wenig (Hunderte von gleichzeitigen Stimmen in diesem Format sind in Ordnung). Der Nachteil ist, dass sie sehr viel Speicherplatz benötigen.
zh_cn: WAV 文件使用原始数据或轻度压缩（IMA-ADPCM）。播放这种格式的 CPU 开销很小（同时播放上千个都没问题）。缺点是会占用大量的磁盘空间。
zh_tw: WAV 檔使用原始資料或輕度壓縮，播放時不太吃 CPU (使用該格式可同時播放數百個聲音)，但該檔案格式會佔用許多空間。

source: Ogg Vorbis files use a stronger compression that results in much smaller file size, but require significantly more processing power to play back.
de: Ogg Vorbis-Dateien verwenden eine stärkere Komprimierung, die zu einer viel kleineren Dateigröße führt, für die Wiedergabe jedoch erheblich mehr Rechenleistung benötigt.
zh_cn: Ogg Vorbis 文件使用更强的压缩，因此文件更小，但需要更多的处理能力才能播放。
zh_tw: Ogg Vorbis 檔使用強力壓縮，因此檔案大小較小，但需要更多的效能才能播放。

source: MP3 files use better compression than WAV with IMA-ADPCM, but worse than Ogg Vorbis. This means that a MP3 file with roughly equal quality to Ogg Vorbis will be significantly larger. On the bright side, MP3 requires less CPU usage to play back compared to Ogg Vorbis.
de: MP3-Dateien werden mit IMA-ADPCM besser komprimiert als WAV, aber schlechter als Ogg Vorbis. Das bedeutet, dass eine MP3-Datei, die in etwa die gleiche Qualität wie Ogg Vorbis hat, deutlich größer ist. Positiv ist, dass MP3 im Vergleich zu Ogg Vorbis eine geringere CPU-Auslastung bei der Wiedergabe erfordert.
zh_cn: MP3 文件使用的压缩比使用 IMA-ADPCM 的 WAV 更好，但比 Ogg Vorbis 差。这意味着，一个与 Ogg Vorbis 质量大致相同的 MP3 文件将明显更大。而从好的方面看，与 Ogg Vorbis 相比，MP3 播放所需的 CPU 使用率更少。
zh_tw: MP3 檔案的壓縮比的 WAV 的 IMA-ADPCM 好，但比 Ogg Vorbis 差。這意味著，一個與 Ogg Vorbis 品質大致相同的 MP3 檔明顯更大。從好的方面來看，與 Ogg Vorbis 相比，MP3 在播放時需要使用更少的 CPU。這使得 MP3 對於 CPU 資源有限的移動端和 HTML5 專案非常有用，特別是在同時播放多個壓縮過的聲音時（如長的環境音）。

source: If you've compiled the Godot editor from source with specific modules disabled, some formats may not be available.
de: Wenn Sie den Godot-Editor aus dem Quellcode mit bestimmten deaktivierten Modulen kompiliert haben, sind einige Formate möglicherweise nicht verfügbar.
zh_cn: 如果你从源代码编译 Godot 编辑器时禁用了特定的模块，某些格式可能无法使用。
zh_tw: 若使用自行從原始碼編譯的 Godot 編輯器時禁用了特定模組，可能會無法使用某些格式。

source: Here is a comparative chart representing the file size of 1 second of audio with each format:
de: Hier ist eine Vergleichstabelle für die Dateigröße von 1 Sekunde Audio mit jedem Format:
zh_cn: 以下是一个比较图表，展示了每种格式1秒音频的文件大小：
zh_tw: 以下是每種格式 1 秒音訊檔案大小的比較圖表：

source: Format
zh_cn: 格式
zh_tw: 格式

source: 1 second of audio
de: 1 Sekunde Audio
zh_cn: 1秒的音频
zh_tw: 1 秒的音訊

source: WAV 24-bit, 96 kHz, stereo
zh_cn: WAV 24 bits,96 kHz, 立体声
zh_tw: WAV 24 位元, 96 kHz, 立體聲

source: WAV 16-bit, 44 kHz, mono
zh_cn: WAV 16-bit,44 kHz, 单声道
zh_tw: WAV 16 位元, 44 kHz, 單聲道

source: WAV 16-bit, IMA-ADPCM, mono
zh_cn: WAV 16-bit,IMA-ADPCM, 单声道
zh_tw: WAV 16 位元, IMA-ADPCM, 單聲道

source: MP3 192 Kb/s, stereo
zh_cn: MP3 192 Kb/s, 立体声
zh_tw: Ogg Vorbis 128 Kb/秒, 立體聲

source: Ogg Vorbis 128 Kb/s, stereo
zh_cn: Ogg Vorbis 128 Kb/s, 立体声
zh_tw: Ogg Vorbis 128 Kb/秒, 立體聲

source: Ogg Vorbis 96 Kb/s, stereo
zh_cn: Ogg Vorbis 96 Kb/s, 立体声
zh_tw: Ogg Vorbis 96Kb/秒, 立體聲

source: Note that the MP3 and Ogg Vorbis figures can vary depending on the encoding type. The above figures use :abbr:`CBR (Constant Bit Rate)` encoding for simplicity, but most Ogg Vorbis and MP3 files you can find online are encoded with :abbr:`VBR (Variable Bit Rate)` encoding which is more efficient. VBR encoding makes the effective audio file size depend on how "complex" the source audio is.
de: Beachten Sie, dass die Zahlen für MP3 und Ogg Vorbis je nach Kodierungstyp variieren können. Die obigen Zahlen beziehen sich der Einfachheit halber auf :abbr:`CBR (Constant Bit Rate)`-Kodierung, aber die meisten Ogg Vorbis- und MP3-Dateien, die Sie online finden können, sind mit :abbr:`VBR (Variable Bit Rate)`-Kodierung kodiert, die effizienter ist. Bei der VBR-Kodierung hängt die effektive Größe der Audiodatei davon ab, wie "komplex" die Audioquelle ist.
zh_cn: 请注意，MP3 和 Ogg Vorbis 的大小可能会因编码类型而异。为简单起见，上表中使用 :abbr:`CBR (Constant Bit Rate, 恒定比特率)`编码，但你可以在网上找到的大多数 Ogg Vorbis 和 MP3 文件都使用的是效率更高的 :abbr:`VBR (Variable Bit Rate, 可变比特率)` 编码。 VBR 编码使有效音频文件大小取决于源音频的“复杂程度”。
zh_tw: 請注意，MP3 和 Ogg Vorbis 的數字可能會因編碼型別而異。為簡單起見，上圖使用 CBR（恆定位元率）編碼，但您可以在網路上找到的大多數 Ogg Vorbis 和 MP3 檔案都使用 VBR（可變位元速率）編碼，效率更高。 VBR 編碼使有效音訊檔案大小取決於來源音訊的「複雜程度」。

source: Consider using WAV for short and repetitive sound effects, and Ogg Vorbis for music, speech, and long sound effects. MP3 is useful for mobile and web projects where CPU resources are limited, especially when playing multiple compressed sounds at the same time (such as long ambient sounds).
de: Verwenden Sie WAV für kurze und sich wiederholende Soundeffekte und Ogg Vorbis für Musik, Sprache und lange Soundeffekte. MP3 ist nützlich für Mobile- und Web-Projekte, bei denen die CPU-Ressourcen begrenzt sind, insbesondere wenn mehrere komprimierte Sounds gleichzeitig abgespielt werden (z. B. lange Umgebungsgeräusche).
zh_cn: 请考虑使用 WAV 来实现短且重复的音效，使用 Ogg Vorbis 来实现音乐、语音和长音效。 MP3 对于 CPU 资源有限的移动端项目和 Web 项目来说很有用，特别是在同时播放多个压缩声音（例如长环境声）时。
zh_tw: MP3 檔案的壓縮比的 WAV 的 IMA-ADPCM 好，但比 Ogg Vorbis 差。這意味著，一個與 Ogg Vorbis 品質大致相同的 MP3 檔明顯更大。從好的方面來看，與 Ogg Vorbis 相比，MP3 在播放時需要使用更少的 CPU。這使得 MP3 對於 CPU 資源有限的移動端和 HTML5 專案非常有用，特別是在同時播放多個壓縮過的聲音時（如長的環境音）。

source: Several options are available in the Import dock after selecting a WAV file in the FileSystem dock:
de: Nach der Auswahl einer WAV-Datei im Dateisystem-Dock stehen im Import-Dock mehrere Optionen zur Verfügung:
zh_cn: 在文件系统面板中选择 WAV 文件后，导入面板中会提供多个选项：
zh_tw: 在檔案系統擴充座中選擇 WAV 檔案後，匯入擴充座中會提供多個選項：

source: Import options in the Import dock after selecting a WAV file in the FileSystem dock
de: Importoptionen im Import-Dock nach Auswahl einer WAV-Datei im Dateisystem-Dock
zh_cn: 在文件系统面板中选择 WAV 文件后，导入面板中的导入选项
zh_tw: 在檔案系統擴充座中選擇 WAV 檔案後，匯入擴充座中的匯入選項

source: The set of options available after selecting a Ogg Vorbis or MP3 file is different:
de: Die Optionen, die nach der Auswahl einer Ogg Vorbis- oder MP3-Datei zur Verfügung stehen, sind unterschiedlich:
zh_cn: 选择 Ogg Vorbis 或 MP3 文件后可用的选项集合有所不同：
zh_tw: 選擇 Ogg Vorbis 或 MP3 檔案後可用的選項集有所不同：

source: Import options in the Import dock after selecting a MP3 file in the FileSystem dock
de: Importoptionen im Import-Dock nach Auswahl einer MP3-Datei im Dateisystem-Dock
zh_cn: 在文件系统面板中选择 MP3 文件后，导入面板中的导入选项
zh_tw: 在檔案系統擴充座中選擇 MP3 檔案後，匯入擴充塢中的匯入選項

source: Import options in the Import dock after selecting a MP3 file in the FileSystem dock. Options are identical for Ogg Vorbis files.
de: Importoptionen im Import-Dock nach Auswahl einer MP3-Datei im Dateisystem-Dock. Die Optionen sind für Ogg Vorbis-Dateien identisch.
zh_cn: 在文件系统面板中选择 MP3 文件后，导入面板中的导入选项。 Ogg Vorbis 文件的选项相同。
zh_tw: 在檔案系統擴充座中選擇 MP3 檔案後，匯入擴充塢中的匯入選項。 Ogg Vorbis 檔案的選項相同。

source: After importing a sound, you can play it back using the AudioStreamPlayer, AudioStreamPlayer2D or AudioStreamPlayer3D nodes. See :ref:`doc_audio_streams` for more information.
de: Nachdem Sie einen Sound importiert haben, können Sie ihn mit den Nodes AudioStreamPlayer, AudioStreamPlayer2D oder AudioStreamPlayer3D wiedergeben. Siehe :ref:`doc_audio_streams` für weitere Informationen.
zh_cn: 导入声音后，可以使用 AudioStreamPlayer、AudioStreamPlayer2D 或 AudioStreamPlayer3D 节点进行播放。请参阅 :ref:`doc_audio_streams` 了解更多信息。
zh_tw: 匯入聲音後，您可以使用 AudioStreamPlayer、AudioStreamPlayer2D 或 AudioStreamPlayer3D 節點進行播放。請參閱 doc_audio_streams 以了解更多資訊。

source: Import options (WAV)
de: Import-Optionen (WAV)
zh_cn: 导入选项（WAV）
zh_tw: 匯入選項

source: Force > 8 Bit
de: Erzwingen > 8 Bit
zh_cn: 强制 > 8 位
zh_tw: 強制 > 8 位

source: If enabled, forces the imported audio to use 8-bit quantization if the source file is 16-bit or higher.
de: Wenn diese Option aktiviert ist, werden die importierten Audiodaten auf 8-Bit-Quantisierung umgestellt, wenn die Quelldatei 16-Bit oder höher ist.
zh_cn: 启用后，如果源文件为 16 位量化或更高，则强制导入的音频使用 8 位量化。
zh_tw: 如果啟用，如果來源檔案為 16 位元或更高，則強制匯入的音訊使用 8 位元量化。

source: Enabling this is generally not recommended, as 8-bit quantization decreases audio quality significantly. If you need smaller file sizes, consider using Ogg Vorbis or MP3 audio instead.
de: Die Aktivierung dieser Option wird im Allgemeinen nicht empfohlen, da die 8-Bit-Quantisierung die Audioqualität erheblich beeinträchtigt. Wenn Sie kleinere Dateigrößen benötigen, sollten Sie stattdessen Ogg Vorbis oder MP3-Audio verwenden.
zh_cn: 通常不建议启用此功能，因为 8 位量化会显着降低音频质量。如果你需要较小的文件大小，请考虑使用 Ogg Vorbis 或 MP3 音频格式。
zh_tw: 通常不建議啟用此功能，因為 8 位元量化會顯著降低音訊品質。如果您需要較小的檔案大小，請考慮使用 Ogg Vorbis 或 MP3 音訊。

source: Force > Mono
de: Erzwingen > Mono
zh_cn: 强制 > 单声道
zh_tw: 力 > 單聲道

source: If enabled, forces the imported audio to be mono if the source file is stereo. This decreases the file size by 50% by merging the two channels into one.
de: Wenn diese Option aktiviert ist, wird das importierte Audiomaterial in Mono wiedergegeben, wenn die Quelldatei in Stereo vorliegt. Dadurch wird die Dateigröße um 50 % verringert, da die beiden Kanäle zu einem einzigen zusammengeführt werden.
zh_cn: 启用后，如果源文件是立体声，则强制导入的音频为单声道。通过将左右声道合并为一个，文件大小可减少 50%。
zh_tw: 如果啟用，如果來源檔案是立體聲，則強制匯入的音訊為單聲道。透過將兩個通道合併為一個，檔案大小可減少 50%。

source: Force > Max Rate
de: Erzwingen > Max. Rate
zh_cn: 强制 > 最大频率
zh_tw: 力 > 最大速率

source: If set to a value greater than ``0``, forces the audio's sample rate to be reduced to a value lower than or equal to the value specified here.
de: Wenn diese Option auf einen Wert größer als ``0`` gesetzt ist, wird die Abtastrate des Audios auf einen Wert kleiner oder gleich dem hier angegebenen Wert reduziert.
zh_cn: 如果设置为大于 ``0`` 的值，则会强制音频的采样率降低到低于或等于这里所指定的值。
zh_tw: 如果設定為大於「0」的值，則強制音訊的取樣率會降低到低於或等於此處指定的值。

source: This can decrease file size noticeably on certain sounds, without impacting quality depending on the actual sound's contents. See :ref:`doc_importing_audio_samples_best_practices` for more information.
de: Dies kann die Dateigröße bei bestimmten Sounds deutlich verringern, ohne die Qualität zu beeinträchtigen, je nach Inhalt des Sounds. Siehe :ref:`doc_importing_audio_samples_best_practices` für weitere Informationen.
zh_cn: 这可以在不影响质量的条件下，显着减小某些音频的文件大小，具体取决于实际音频的内容。请参阅 :ref:`doc_importing_audio_samples_best_practices`了解更多信息。
zh_tw: 這可以顯著減小某些聲音的檔案大小，而不會影響質量，具體取決於實際聲音的內容。請參閱 doc_importing_audio_samples_best_practices` 以了解更多資訊。

source: Edit > Trim
de: Bearbeiten > Beschneiden
zh_cn: 编辑 > 修剪
zh_tw: 編輯 > 修剪

source: The source audio file may contain long silences at the beginning and/or the end. These silences are inserted by :abbr:`DAWs (Digital Audio Workstations)` when saving to a waveform, which increases their size unnecessarily and add latency to the moment they are played back.
de: Die Quell-Audiodatei kann am Anfang und/oder am Ende lange Pausen enthalten. Diese Pausen werden von :abbr:`DAWs (Digital Audio Workstations)` beim Speichern in eine Waveform eingefügt, was die Größe der Datei unnötig erhöht und die Latenzzeit bei der Wiedergabe verlängert.
zh_cn: 源音频文件可能在开始和/或结束时包含长时间的静音。这些静音是由 :abbr:`DAW(Digital Audio Workstation, 数字音频工作站)` 在保存到波形时插入的，这不必要地增加了它们的大小并增加了播放时的延迟。
zh_tw: 音訊檔前後有很長一段無聲音的時間也是其中一種常見問題。這段無聲的時間通常是由 DAW 在保存波形時插入的，這會導致檔案大小沒必要地增加，並讓播放時產生延遲。

source: Enabling **Trim** will automatically trim the beginning and end of the audio if it's lower than -50 dB *after* normalization (see **Edit > Normalize** below). A fade-in/fade-out period of 500 samples is also used during trimming to avoid audible pops.
de: Wenn Sie **Beschneiden** aktivieren, werden Anfang und Ende des Audios automatisch beschnitten, wenn der Pegel *nach* der Normalisierung (siehe **Bearbeiten > Normalisieren** unten) unter -50 dB liegt. Beim Beschneiden wird außerdem eine Fade-in-/Fade-out-Zeit von 500 Samples verwendet, um hörbare Knackser zu vermeiden.
zh_cn: 如果标准化 *后* 音频的开头和结尾低于 -50 dB，则启用 **修剪** 将自动修剪掉它们（请参阅下面的 **编辑 > 归一化** ）。修剪期间还使用 500 个样本的淡入/淡出周期，以避免发出爆音。
zh_tw: 如果*標準化後音訊低於 -50 dB，則啟用 **修剪** 將自動修剪音訊的開頭和結尾（請參閱下方的 **編輯 > 標準化**）。修剪期間也使用 500 個樣本的淡入/淡出週期，以避免發出爆音。

source: Edit > Normalize
de: Bearbeiten > Normalisieren
zh_cn: 编辑 > 归一化
zh_tw: 編輯器使用手冊

source: If enabled, audio volume will be *normalized* so that its peak volume is equal to 0 dB. When enabled, normalization will make audio sound louder depending on its original peak volume.
de: Wenn diese Option aktiviert ist, wird die Audiolautstärke *normalisiert*, so dass die Peak-Lautstärke gleich 0 dB ist. Wenn die Normalisierung aktiviert ist, wird der Ton in Abhängigkeit von seiner ursprünglichen Peak-Lautstärke lauter.
zh_cn: 如果启用，音频音量将被 *归一化* ，使其峰值音量等于 0 dB。启用后，归一化将使音频听起来更响亮，具体取决于其原始峰值音量。
zh_tw: 如果啟用，音訊音量將被“標準化”，使其峰值音量等於 0 dB。啟用後，標準化將使音訊聽起來更響亮，具體取決於其原始峰值音量。

source: Edit > Loop Mode
de: Bearbeiten > Loop-Modus
zh_cn: 编辑 > 循环模式
zh_tw: 迴圈模式

source: Unlike Ogg Vorbis and MP3, WAV files can contain metadata to indicate whether they're looping (in addition to loop points). By default, Godot will follow this metadata, but you can choose to apply a specific loop mode:
de: Im Gegensatz zu Ogg Vorbis und MP3 können WAV-Dateien Metadaten enthalten, die anzeigen, ob sie in einer Loop laufen (zusätzlich zu den Loop-Punkten). Standardmäßig befolgt Godot diese Metadaten, aber Sie können auch einen spezifischen Loop-Modus wählen:
zh_cn: 与 Ogg Vorbis 和 MP3 不同，WAV 文件可以包含元数据来指示它们是否正在循环（除了循环点之外）。默认情况下，Godot 将遵循此元数据，但你可以选择应用特定的循环模式：
zh_tw: 與 Ogg Vorbis 和 MP3 不同，WAV 檔案可以包含元資料來指示它們是否正在循環（除了循環點之外）。預設情況下，Godot 將遵循此元資料，但您可以選擇套用特定的循環模式：

source: **Disabled:** Don't loop audio, even if metadata indicates the file should be played back looping.
de: **Deaktiviert:** Audio nicht in Loops wiedergeben, auch wenn die Metadaten darauf hinweisen, dass die Datei in Loops wiedergegeben werden soll.
zh_cn: **Disabled：** （禁用）不要循环音频，即使元数据指示文件应该循环播放。
zh_tw: **停用：** 不要循環音頻，即使元資料指示檔案應該循環播放。

source: **Forward:** Standard audio looping.
de: **Vorwärts:** Standard-Audio-Looping.
zh_cn: **Forward：** （向前）标准音频循环。
zh_tw: **前進：** 標準音訊循環。

source: **Ping-Pong:** Play audio forward until it's done playing, then play it backward and repeat. This is similar to mirrored texture repeat, but for audio.
de: **Ping-Pong:** Audio vorwärts abspielen, bis die Wiedergabe beendet ist, dann rückwärts abspielen und wiederholen. Dies ist ähnlich wie die gespiegelte Texturwiederholung, aber für Audio.
zh_cn: **Ping-Pong：** （乒乓）向前播放音频直至播放完毕，然后向后播放并重复。这类似于镜像纹理重复，但适用于音频播放。
zh_tw: **乒乓球：** 向前播放音訊直至播放完畢，然後向後播放並重複。這類似於鏡像紋理重複，但適用於音訊。

source: **Backward:** Play audio in reverse and loop back to the end when done playing.
de: **Rückwärts:** Audio rückwärts abspielen und nach der Wiedergabe in einer Loop zum Ende zurückgehen.
zh_cn: **Backward：** （向后）反向播放音频，播放完毕后循环回到末尾。
zh_tw: **向後：** 反向播放音頻，播放完畢後循環回到最後。

source: When choosing one of the **Forward**, **Ping-Pong** or **Backward** loop modes, loop points can also be defined to make only a specific part of the sound loop. **Loop Begin** is set in samples after the beginning of the audio file. **Loop End** is also set in samples after the beginning of the audio file, but will use the end of the audio file if set to ``-1``.
de: Wenn Sie einen der Loop-Modi **Vorwärts**, **Ping-Pong** oder **Rückwärts** wählen, können Sie auch Loop-Punkte definieren, um nur einen bestimmten Teil des Tons zu loopen. **Loop-Beginn** wird in Samples nach dem Beginn der Audiodatei festgelegt. **Loop-Ende** wird ebenfalls in Samples nach dem Anfang der Audiodatei gesetzt, verwendet aber das Ende der Audiodatei, wenn es auf ``-1`` gesetzt wird.
zh_cn: 当选择 **Forward** 、 **Ping-Pong** 或 **Backward** 循环模式之一时，还可以定义循环点以仅制作声音循环的特定部分。 **循环起点** 在音频文件开始后的采样中设置。 **循环终点** 也在音频文件开始后的采样中设置，但如果设置为 ``-1`` ，将使用音频文件的结尾。

source: In AudioStreamPlayer, the ``finished`` signal won't be emitted for looping audio when it reaches the end of the audio file, as the audio will keep playing indefinitely.
de: Im AudioStreamPlayer wird das Signal ``finished`` nicht mehr ausgegeben, wenn das Ende der Audiodatei erreicht ist, da die Audiodaten unbegrenzt weiter abgespielt werden.
zh_cn: 在 AudioStreamPlayer 中，当循环音频到达音频文件末尾时，不会发出 ``finished`` 信号，因为音频将无限期地继续播放。
zh_tw: 在 AudioStreamPlayer 中，當循環音訊到達音訊檔案末尾時，不會發出「finished」訊號，因為音訊將無限期地繼續播放。

source: Compress > Mode
de: Komprimieren > Modus
zh_cn: 压缩 > 模式
zh_tw: 壓縮模式

source: Two compression modes can be chosen for WAV files: **Disabled** (default) or **RAM (Ima-ADPCM)**. **RAM (Ima-ADPCM)** reduces file size and memory usage a little, at the cost of decreasing quality in an audible manner.
de: Für WAV-Dateien können zwei Komprimierungsmodi gewählt werden: **Deaktiviert** (Default) oder **RAM (Ima-ADPCM)**. **RAM (Ima-ADPCM)** reduziert die Dateigröße und die Speichernutzung ein wenig, auf Kosten einer hörbaren Qualitätsminderung.
zh_cn: WAV 文件可以选择两种压缩模式： **Disabled** （默认）或 **RAM (Ima-ADPCM)** 。 **RAM (Ima-ADPCM)** 稍微减少了文件大小和内存使用量，但代价是以可被听觉察觉的方式降低了音频质量。
zh_tw: WAV 檔案可以選擇兩種壓縮模式：**停用**（預設）或**RAM (Ima-ADPCM)**。 **RAM (Ima-ADPCM)** 稍微減少了檔案大小和記憶體使用量，但代價是以可聽見的方式降低了品質。

source: Ogg Vorbis and MP3 don't decrease quality as much and can provide greater file size reductions, at the cost of higher CPU usage during playback. This higher CPU usage is usually not a problem (especially with MP3), unless playing dozens of compressed sounds at the same time on mobile/web platforms.
de: Ogg Vorbis und MP3 verringern die Qualität nicht so stark und können die Dateigröße stärker reduzieren, allerdings zum Preis einer höheren CPU-Auslastung während der Wiedergabe. Diese höhere CPU-Auslastung ist in der Regel kein Problem (insbesondere bei MP3), es sei denn, Sie spielen Dutzende von komprimierten Sounds gleichzeitig auf Mobile-/Web-Plattformen ab.
zh_cn: Ogg Vorbis 和 MP3 不会降低那么多质量，并且可以更大程度地减小文件大小，但相应代价是播放期间 CPU 使用率更高。这种较高的 CPU 使用率通常不是什么问题（尤其是 MP3），除非在移动端/web 平台上同时播放数十个压缩过的音频。
zh_tw: Ogg Vorbis 和 MP3 不會降低品質那麼多，可以更大程度地減少檔案大小，但代價是播放期間 CPU 使用率更高。這種較高的 CPU 使用率通常不是問題（尤其是 MP3），除非在行動/網路平台上同時播放數十個壓縮聲音。

source: Import options (Ogg Vorbis and MP3)
de: Importoptionen (Ogg Vorbis und MP3)
zh_cn: 导入选项（Ogg Vorbis 和 MP3）
zh_tw: 有許多匯入選項：

source: Loop
zh_cn: 循环
zh_tw: 迴圈

source: If enabled, the audio will begin playing at the beginning after playback ends by reaching the end of the audio.
de: Wenn diese Option aktiviert ist, beginnt die Wiedergabe am Anfang, wenn die Wiedergabe am Ende der Audiodaten endet.
zh_cn: 如果启用，播放至音频末尾后会从开头开始播放。
zh_tw: 如果啟用，播放至音訊末尾後會從開頭開始播放。

source: Loop Offset
de: Loop-Versatz
zh_cn: 循环偏移
zh_tw: 迴圈偏移

source: The loop offset determines where audio will start to loop after playback reaches the end of the audio. This can be used to only loop a part of the audio file, which is useful for some ambient sounds or music. The value is determined in seconds relative to the beginning of the audio, so ``0`` will loop the entire audio file.
de: Der Loop-Versatz bestimmt, an welcher Stelle die Loop beginnt, wenn die Wiedergabe das Ende der Audiodaten erreicht. Dies kann verwendet werden, um nur einen Teil der Audiodatei in einer Loop laufen zu lassen, was für einige Umgebungsgeräusche oder Musik nützlich ist. Der Wert wird in Sekunden relativ zum Anfang der Audiodaten angegeben, so dass ``0`` die gesamte Audiodatei wiederholt.
zh_cn: 循环偏移用于确定当播放到达音频末尾后，音频再次开始循环的位置。这可用于仅循环音频文件的一部分，对于某些环境声音或音乐会很有用。该值由相对于音频开头的秒数确定，因此设置为 ``0`` 将循环整个音频文件。
zh_tw: 循環偏移決定播放到達音訊末端後音訊將開始循環的位置。這可用於僅循環音訊檔案的一部分，這對於某些環境聲音或音樂很有用。該值以相對於音訊開頭的秒數確定，因此「0」將循環整個音訊檔案。

source: Only has an effect if **Loop** is enabled.
de: Wirkt sich nur aus, wenn **Loop** aktiviert ist.
zh_cn: 仅当启用 **循环** 时才有效。
zh_tw: 僅當啟用 **Loop** 時才有效。

source: A more convenient editor for **Loop Offset** is provided in the :ref:`Advanced import settings <doc_importing_audio_samples_advanced_import_settings>` dialog, as it lets you preview your changes without having to reimport the audio.
de: Ein komfortablerer Editor für den **Loop-Versatz** wird in den :ref:`Erweiterten Importeinstellungen <doc_importing_audio_samples_advanced_import_settings>` angeboten, da er eine Vorschau der Änderungen ermöglicht, ohne dass die Audiodaten erneut importiert werden müssen.
zh_cn: :ref:`高级导入设置 <doc_importing_audio_samples_advanced_import_settings>`对话框中提供了更方便的 **循环偏移** 编辑器，它可以让你来预览更改，而无需重新导入音频。
zh_tw: 進階匯入設定 <doc_importing_audio_samples_advanced_import_settings> 對話方塊中提供了更方便的 **循環偏移** 編輯器，因為它可以讓您預覽更改，而無需重新匯入音訊。

source: The Beats Per Minute of the audio track. This should match the BPM measure that was used to compose the track. This is only relevant for music that wishes to make use of interactive music functionality (not implemented yet), not sound effects.
de: Die Beats pro Minute des Audio-Tracks. Dieser Wert sollte mit dem BPM-Maß übereinstimmen, das für die Komposition des Tracks verwendet wurde. Dies ist nur für Musik relevant, die interaktive Musikfunktionen nutzen soll (noch nicht implementiert), nicht für Soundeffekte.
zh_cn: 音轨的每分钟节拍数（Beats Per Minute）。该数值应该与用于创作曲目的 BPM 测量相匹配。该功能仅与希望利用交互式音乐功能（尚未实现）的音乐相关，与声音效果无关。
zh_tw: 音軌的每分鐘節拍數。這應該與用於創作曲目的 BPM 測量相配對。這僅與希望利用互動式音樂功能（尚未實作）的音樂相關，與聲音效果無關。

source: A more convenient editor for **BPM** is provided in the :ref:`Advanced import settings <doc_importing_audio_samples_advanced_import_settings>` dialog, as it lets you preview your changes without having to reimport the audio.
de: Ein komfortablerer Editor für **BPM** wird in den :ref:`Erweiterten Importeinstellungen <doc_importing_audio_samples_advanced_import_settings>` zur Verfügung gestellt, da er Ihnen eine Vorschau Ihrer Änderungen ermöglicht, ohne dass Sie die Audiodaten erneut importieren müssen.
zh_cn: :ref:`高级导入设置 <doc_importing_audio_samples_advanced_import_settings>`对话框中提供了更方便的 **BPM** 编辑器，它可以让你预览更改，而无需重新导入音频。
zh_tw: 進階匯入設定 <doc_importing_audio_samples_advanced_import_settings>` 對話方塊中提供了更方便的 **BPM** 編輯器，因為它可以讓您預覽更改，而無需重新匯入音訊。

source: Beat Count
de: Beat-Zahl
zh_cn: 拍数
zh_tw: 節拍計數

source: The beat count of the audio track. This is only relevant for music that wishes to make use of interactive music functionality (not implemented yet), not sound effects.
de: Die Beat-Anzahl des Audio Tracks. Dies ist nur für Musik relevant, die interaktive Musikfunktionalität nutzen soll (noch nicht implementiert), nicht für Soundeffekte.
zh_cn: 音轨的节拍数。该功能仅与希望利用交互式音乐功能（尚未实现）的音乐相关，与声音效果无关。
zh_tw: 音軌的節拍數。這僅與希望利用互動式音樂功能（尚未實作）的音樂相關，與聲音效果無關。

source: A more convenient editor for **Beat Count** is provided in the :ref:`Advanced import settings <doc_importing_audio_samples_advanced_import_settings>` dialog, as it lets you preview your changes without having to reimport the audio.
de: Ein komfortablerer Editor für **Beat-Anzahl** wird in den :ref:`Erweiterten Importeinstellungen <doc_importing_audio_samples_advanced_import_settings>` zur Verfügung gestellt, da er Ihnen eine Vorschau Ihrer Änderungen ermöglicht, ohne dass Sie die Audiodaten erneut importieren müssen.
zh_cn: :ref:`高级导入设置 <doc_importing_audio_samples_advanced_import_settings>`对话框中提供了更方便的 **拍数** 编辑器，它可以让你预览更改，而无需重新导入音频。
zh_tw: 進階匯入設定 <doc_importing_audio_samples_advanced_import_settings>` 對話方塊中提供了更方便的 **Beat Count** 編輯器，因為它可以讓您預覽更改，而無需重新匯入音訊。

source: Bar Beats
de: Takt-Beats
zh_cn: 节拍
zh_tw: 節拍
