Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_audio_samples.po
Languages: de, zh_cn, zh_tw

source: The number of bars within a single beat in the audio track. This is only relevant for music that wishes to make use of interactive music functionality (not implemented yet), not sound effects.
de: Die Anzahl der Beats innerhalb eines einzelnen Takts im Audio-Track. Dies ist nur für Musik relevant, die interaktive Musikfunktionen nutzen soll (noch nicht implementiert), nicht für Soundeffekte.
zh_cn: 音轨中单个节拍内的小节数。该功能仅与希望利用交互式音乐功能（尚未实现）的音乐相关，与声音效果无关。
zh_tw: 音軌中單一節拍內的小節數。這僅與希望利用互動式音樂功能（尚未實作）的音樂相關，與聲音效果無關。

source: A more convenient editor for **Bar Beats** is provided in the :ref:`Advanced import settings <doc_importing_audio_samples_advanced_import_settings>` dialog, as it lets you preview your changes without having to reimport the audio.
de: Ein komfortablerer Editor für **Takt-Beats** wird im :ref:`Erweiterte Importeinstellungen <doc_importing_audio_samples_advanced_import_settings>` zur Verfügung gestellt, da er Ihnen eine Vorschau Ihrer Änderungen ermöglicht, ohne dass Sie die Audiodaten erneut importieren müssen.
zh_cn: :ref:`高级导入设置 <doc_importing_audio_samples_advanced_import_settings>`对话框中提供了更方便的 **Bar Beats** 编辑器，它可以让你预览更改，而无需重新导入音频。
zh_tw: 進階匯入設定 <doc_importing_audio_samples_advanced_import_settings>` 對話方塊中提供了更方便的 **Bar Beats** 編輯器，因為它可以讓您預覽更改，而無需重新匯入音訊。

source: Advanced import settings (Ogg Vorbis and MP3)
de: Erweiterte Importeinstellungen (Ogg Vorbis und MP3)
zh_cn: 高级导入设置（Ogg Vorbis 和 MP3）
zh_tw: 高級匯入設定（Ogg Vorbis 和 MP3）

source: If you double-click an Ogg Vorbis or MP3 file in the FileSystem dock (or choose **Advanced…** in the Import dock), you will see a dialog appear:
de: Wenn Sie auf eine Ogg Vorbis- oder MP3-Datei im Dateisystem-Dock doppelklicken (oder **Erweitert...** im Import-Dock wählen), wird ein Dialogfeld angezeigt:
zh_cn: 双击文件系统面板中的 Ogg Vorbis 或 MP3 文件（或者在导入面板中选择\ **高级...**\ ），就会出现一个对话框：
zh_tw: 按兩下檔案系統面板中的 Ogg Vorbis 或 MP3 檔（或者在匯入面板中選擇**高級...**），就會出現一個對話方塊：

source: Advanced dialog when double-clicking a Ogg Vorbis or MP3 file in the FileSystem dock
de: Erweiterter Dialog beim Doppelklick auf eine Ogg Vorbis- oder MP3-Datei im Dateisystem-Dock
zh_cn: 双击文件系统面板中的 Ogg Vorbis 或 MP3 文件时的高级对话框
zh_tw: 按兩下檔案系統面板中的 Ogg Vorbis 或 MP3 檔案時的高級對話方塊

source: This dialog allows you to edit the audio's loop point with a real-time preview, in addition to the :abbr:`BPM (Beats Per Minute)`, beat count and bar beats. These 3 settings are currently unused, but they will be used in the future for interactive music support (which allows smoothly transitioning between different music tracks).
de: In diesem Dialogfeld können Sie den Loop-Punkt der Audiodaten mit einer Echtzeitvorschau bearbeiten, zusätzlich zu den :abbr:`BPM (Beats Per Minute)`, der Beat-Anzahl und den Takt-Beats. Diese 3 Einstellungen werden derzeit nicht verwendet, aber sie werden in Zukunft für die Unterstützung interaktiver Musik verwendet (was einen reibungslosen Übergang zwischen verschiedenen Tracks ermöglicht).
zh_cn: 除了 :abbr:`BPM (Beats Per Minute)`、节拍数和小节节拍之外，此对话框还允许你通过实时预览编辑音频的循环点。这 3 个设置目前未启用，但将来将用于交互式音乐的支持（允许在不同音乐曲目之间平滑过渡）。
zh_tw: 除了 BPM（每分鐘節拍數）、節拍數和小節節拍之外，此對話方塊還可讓您透過即時預覽編輯音訊的循環點。這 3 個設定目前未使用，但將來將用於互動式音樂支援（允許在不同音樂曲目之間平滑過渡）。

source: Unlike WAV files, Ogg Vorbis and MP3 only support a "loop begin" loop point, not a "loop end" point. Looping can also be only be standard forward looping, not ping-pong or backward.
de: Im Gegensatz zu WAV-Dateien unterstützen Ogg Vorbis und MP3 nur einen "Loop-Anfang"-Loop-Punkt, keinen "Loop-Ende"-Punkt. Loops können auch nur standardmäßig vorwärts geloopt werden, nicht per Ping-Pong oder rückwärts.
zh_cn: 与 WAV 文件不同，Ogg Vorbis 和 MP3 仅支持“循环开始”循环点，而不支持“循环结束”点。循环也可以只是标准的向前循环，而不是乒乓类型或向后循环。
zh_tw: 與 WAV 檔案不同，Ogg Vorbis 和 MP3 僅支援「循環開始」循環點，而不支援「循環結束」點。循環也可以只是標準的向前循環，而不是乒乓或向後循環。

source: Best practices
de: Bewährte Praktiken
zh_cn: 最佳实践
zh_tw: 最佳實踐

source: Use appropriate quality settings
de: Geeignete Qualitätseinstellungen verwenden
zh_cn: 使用合适的质量设置
zh_tw: 取得專案或編輯器設定

source: While keeping pristine-quality audio sources is important if you're performing editing, using the same quality in the exported project is not necessary. For WAV files, Godot offers several import options to reduce the final file size without modifying the source file on disk.
de: Während es für die Bearbeitung wichtig ist, dass die Audioquellen in erstklassiger Qualität vorliegen, ist es nicht notwendig, die gleiche Qualität für das exportierte Projekt zu verwenden. Für WAV-Dateien bietet Godot mehrere Importoptionen, um die endgültige Dateigröße zu reduzieren, ohne die Quelldatei auf der Festplatte zu verändern.
zh_cn: 虽然在执行编辑时保持原始质量的音频源很重要，但在导出的项目中没有必要使用相同的质量。对于 WAV 文件，Godot 提供了多个导入选项，在无需修改磁盘上源文件的情况下来减小最终的文件大小。
zh_tw: 雖然在執行編輯時保持原始品質的音訊來源很重要，但在匯出的專案中沒有必要使用相同的品質。對於 WAV 檔案，Godot 提供了多個匯入選項來減少最終檔案大小，而無需修改磁碟上的來源檔案。

source: To reduce memory usage and file size, choose an appropriate quantization, sample rate and number of channels for your audio:
de: Um den Speicherbedarf und die Dateigröße zu reduzieren, wählen Sie eine geeignete Quantisierung, Abtastrate und Anzahl der Kanäle für Ihre Audiodaten:
zh_cn: 为了减少内存使用量和文件大小，请为音频选择适当的量化、采样率和通道数：
zh_tw: 若要減少記憶體使用量和檔案大小，請為音訊選擇適當的量化、取樣率和頻道數：

source: There's no *audible* benefit to using 24-bit audio, especially in a game where several sounds are often playing at the same time (which makes it harder to appreciate individual sounds).
de: Es gibt keinen *hörbaren* Vorteil bei der Verwendung von 24-Bit-Audio, insbesondere in einem Spiel, in dem oft mehrere Sounds gleichzeitig abgespielt werden (was es schwieriger macht, einzelne Sounds zu erkennen).
zh_cn: 使用 24 位音频并没有 *听觉上* 的好处，尤其是在经常同时播放多种声音的游戏中（这会使得欣赏单个声音变得更加困难）。
zh_tw: 使用 24 位元音訊並沒有「聽覺上」的好處，尤其是在經常同時播放多種聲音的遊戲中（這使得欣賞單一聲音變得更加困難）。

source: Unless you are slowing down the audio at run-time, there's no *audible* benefit to using a sample rate greater than 48 kHz. If you wish to keep a source with a higher sample rate for editing, use the **Force > Max Rate** import option to limit the sample rate of the imported sound (only available for WAV files).
de: Sofern Sie das Audiomaterial nicht zur Laufzeit verlangsamen, gibt es keinen *hörbaren* Vorteil, wenn Sie eine Abtastrate von mehr als 48 kHz verwenden. Wenn Sie eine Quelle mit einer höheren Abtastrate für die Bearbeitung behalten möchten, verwenden Sie die Importoption **Erzwingen > Max. Rate**, um die Abtastrate des importierten Sounds zu begrenzen (nur für WAV-Dateien verfügbar).
zh_cn: 除非你要在运行时减慢音频速度，否则使用大于 48 kHz 的采样率没有任何 *听觉上* 的好处。如果你希望保留具有较高采样率的源来进行编辑，请使用 **强制 > 最大频率** 导入选项来限制导入声音的采样率（仅适用于 WAV 文件）。
zh_tw: 除非您在運作時減慢音訊速度，否則使用大於 48 kHz 的取樣率沒有任何「聽得見」的好處。如果您希望保留具有較高取樣率的來源進行編輯，請使用 **強制 > 最大速率** 匯入選項來限制匯入聲音的取樣率（僅適用於 WAV 檔案）。

source: Many sound effects can generally be converted to mono as opposed to stereo. If you wish to keep a source with stereo for editing, use the **Force > Mono** import option to convert the imported sound to mono (only available for WAV files).
de: Viele Soundeffekte können in der Regel in Mono und nicht in Stereo konvertiert werden. Wenn Sie eine Quelle mit Stereo für die Bearbeitung behalten möchten, verwenden Sie die Importoption **Erzwingen > Mono**, um den importierten Sound in Mono zu konvertieren (nur für WAV-Dateien verfügbar).
zh_cn: 许多音效通常可以转换为单声道而不是立体声。如果你希望保留立体声的源文件来进行编辑，请使用 **强制 > 单声道** 导入选项将导入的声音转换为单声道（仅适用于 WAV 文件）。
zh_tw: 許多音效通常可以轉換為單聲道而不是立體聲。如果您希望保留立體聲來源進行編輯，請使用 **強制 > 單聲道** 匯入選項將匯入的聲音轉換為單聲道（僅適用於 WAV 檔案）。

source: Voices can generally be converted to mono, but can also have their sample rate reduced to 22 kHz without a noticeable loss in quality (unless the voice is very high-pitched). This is because most human voices never go past 11 kHz.
de: Stimmen können in der Regel in Mono umgewandelt werden, aber auch ihre Abtastrate kann ohne merklichen Qualitätsverlust auf 22 kHz reduziert werden (es sei denn, die Stimme ist sehr hoch). Dies liegt daran, dass die meisten menschlichen Stimmen nie über 11 kHz hinausgehen.
zh_cn: 语音（voice）通常可以转换为单声道，但也可以在不明显降低质量的条件下（除非声音的音调非常高）将采样率降低到 22 kHz。这是因为大多数人的声音永远不会超过 11 kHz。
zh_tw: 聲音通常可以轉換為單聲道，但也可以將取樣率降低到 22 kHz，而不會明顯降低品質（除非聲音非常高音調）。這是因為大多數人的聲音永遠不會超過 11 kHz。

source: Use real-time audio effects to reduce file size
de: Verwendung von Echtzeit-Audioeffekten zur Reduzierung der Dateigröße
zh_cn: 使用实时音频效果降低文件大小
zh_tw: 使用即時音訊效果降低檔大小

source: Godot has an :ref:`extensive bus system <doc_audio_buses>` with built-in effects. This saves SFX artists the need to add reverb to the sound effects, reducing their size greatly and ensuring correct trimming.
de: Godot hat ein :ref:`umfangreiches Bussystem <doc_audio_buses>` mit eingebauten Effekten. Dies erspart den Soundeffekt-Designern das Hinzufügen von Reverb zu den Soundeffekten, reduziert deren Größe erheblich und gewährleistet ein korrektes Beschneiden.
zh_cn: Godot 有一个\ :ref:`庞大的总线系统 <doc_audio_buses>`\ ，提供了内置的效果。因此 SFX 艺术家无需在音效中添加混响，从而大大缩减了文件大小并且能确保剪辑正确。
zh_tw: Godot 中有自帶許多特效的 :ref:`豐富匯流排系統 <doc_audio_buses>` 。得益於該系統，SFX 藝術家便無需在音效檔中處理殘響，可有效降低檔案大小並能確保剪輯正確。再也不需要烘焙殘響 SFX 了。

source: As you can see above, sound effects become much larger in file size with reverb added.
de: Wie Sie oben sehen können, wird die Dateigröße von Soundeffekten durch Hinzufügen von Reverb wesentlich größer.
zh_cn: 如上所示，音效在添加混响后文件大小会变得非常巨大。
zh_tw: 就像這樣，包含殘響的音效檔變得很大。

source: Audio samples can be loaded and saved at runtime using :ref:`runtime file loading and saving <doc_runtime_file_loading_and_saving_audio_video_files>`, including from an exported project.
de: Audio-Samples können zur Laufzeit mit :ref:`Laufzeit-Laden und -Speichern <doc_runtime_file_loading_and_saving_audio_video_files>` geladen und gespeichert werden, auch aus einem exportierten Projekt.
zh_cn: 可以使用 :ref:`运行时文件加载和保存 <doc_runtime_file_loading_and_saving_audio_video_files>`在运行时加载和保存音频样本，包括从导出的项目中加载和保存音频样本。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
