Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/retargeting_3d_skeletons.po
Languages: de, zh_cn, zh_tw

source: Retargeting 3D Skeletons
de: Neuzuweisung von 3D-Skeletten
zh_cn: 3D 骨架重定向
zh_tw: 重定向 3D 骨架

source: To share animations among multiple Skeletons
de: Animationen von mehreren Skeletten gemeinsam nutzen
zh_cn: 在多个骨架之间共享动画
zh_tw: 在多骨架之間共用動畫

source: Godot has Position/Rotation/Scale 3D tracks (which this document calls "Transform" tracks) with Nodepaths to bones for Skeleton bone animation. This means you can't share animations between multiple Skeletons just by using the same bone names.
de: Godot hat Positions/Rotations/Scalkalierungs-3D-Tracks (in diesem Dokument "Transform"-Tracks genannt) mit Nodepaths zu Knochen für Skelett-Knochen-Animation. Das bedeutet, dass Sie Animationen nicht von mehreren Skeletten nutzen können, indem Sie einfach die gleichen Knochen-Namen verwenden.
zh_cn: Godot 具有 Position/Rotation/Scale 3D 轨道（本文称为“Transform”轨道），其中包含用于骨架骨骼动画的节点路径。这意味着你不能仅通过使用相同的骨骼名称在多个骨架之间共享动画。
zh_tw: Godot 具有位置/旋轉/縮放 3D 軌跡（本文件稱為「變換」軌跡）以及用於骨架骨骼動畫的骨骼的節點路徑。這意味著您不能僅透過使用相同的骨骼名稱在多個骨架之間共用動畫。

source: Godot allows each bone to have a parent-child relationship and can have rotation and scale as well as position, which means that bones that share a name can still have different Transform values.
de: Godot erlaubt es jedem Knochen, eine Parent-Child-Beziehung zu haben und kann Rotation und Skalierung sowie Position haben, was bedeutet, dass Knochen, die den gleichen Namen haben, trotzdem unterschiedliche Transform-Werte haben können.
zh_cn: Godot 允许每个骨骼之间存在父子关系，并可以具有旋转、缩放和位置属性，这意味着即使共享相同名称的骨骼也可以具有不同的 Transform 值。
zh_tw: Godot 允許每個骨骼具有父子關係，並且可以具有旋轉、縮放以及位置，這意味著共享名稱的骨骼仍然可以具有不同的 Transform 值。

source: The Skeleton stores the Transform values necessary for the default pose as Bone Rest. If Bone Pose is equal to Bone Rest, it means that the Skeleton is in the default pose.
de: Das Skelett speichert die Transform-Werte, die für die Standard-Pose erforderlich sind, als Knochen-Standardpose. Wenn die Knochenpose gleich Knochen-Standardpose ist, bedeutet dies, dass sich das Skelett in der Standard-Pose befindet.
zh_cn: 骨骼将默认姿势所需的变换值存储为 Bone Rest（骨骼放松）。如果骨骼姿势等于 Bone Rest，则表示骨架处于默认姿势。
zh_tw: 骨骼將預設姿勢所需的變換值儲存為骨骼休息。如果 Bone Pose 等於 Bone Rest，則表示骨架處於預設姿勢。

source: Godot 3.x and Godot 4.0+ have different Bone Pose behaviors. In Godot 3.x, Bone Pose is relative to Bone Rest, but in Godot 4.0+, it includes Bone Rest. See this `article <https://godotengine.org/article/animation-data-redesign-40>`__.
de: Godot 3.x und Godot 4.0+ haben ein unterschiedliches Verhalten der Knochenpose. In Godot 3.x ist die Knochenpose relativ zur Knochen-Standardpose, aber in Godot 4.0+ umfasst sie die Knochen-Standardpose. Siehe diesen `Artikel <https://godotengine.org/article/animation-data-redesign-40>`__.
zh_cn: Godot 3.x 和 Godot 4.0+ 具有不同的骨骼姿势行为。在 Godot 3.x 中，骨骼姿势是相对于 Bone Rest 而言的，但在 Godot 4.0+ 中，骨骼姿势包括 Bone Rest。具体请参阅这篇 `文章 <https://godotengine.org/article/animation-data-redesign-40>`__ 。
zh_tw: Godot 3.x 和 Godot 4.0+ 有不同的骨骼姿勢行為。在 Godot 3.x 中，Bone Pose 是相對於 Bone Rest 而言的，但在 Godot 4.0+ 中，它包括 Bone Rest。請參閱這篇文章<https://godotengine.org/article/animation-data-redesign-40>`__。

source: Skeletal models have different Bone Rests depending on the environment from which they were exported. For example, the bones of a glTF model output from Blender have "Edit Bone Orientation" as the Bone Rest rotation. However, there are skeletal models without any Bone Rest rotations, such as the glTF model output from Maya.
de: Skelettmodelle haben je nach der Umgebung, aus der sie exportiert wurden, unterschiedliche Knochen-Standardposen. Zum Beispiel haben die Knochen eines glTF-Modells, das aus Blender ausgegeben wurde, "Edit Bone Orientation" als Knochen-Standard-Rotation. Es gibt jedoch auch Skelettmodelle ohne Knochen-Standard-Rotation, wie z. B. die glTF-Modellausgabe aus Maya.
zh_cn: 骨骼模型具有不同的 Bone Rest，具体取决于导出的环境。例如，Blender 输出的 glTF 模型的骨骼将“编辑骨骼方向”作为 Bone Rest 旋转。然而，一些骨骼模型没有任何 Bone Rest 旋转，比如 Maya 输出的 glTF 模型。
zh_tw: 骨骼模型具有不同的骨托，取決於匯出的環境。例如，Blender 輸出的 glTF 模型的骨骼將「編輯骨骼方向」作為骨骼休息旋轉。但是，有些骨骼模型沒有任何 Bone Rest 旋轉，例如 Maya 輸出的 glTF 模型。

source: To share animations in Godot, it is necessary to match Bone Rests as well as Bone Names to remove unwanted tracks in some cases. In Godot 4.0+, you can do that using the scene importer.
de: Um Animationen in Godot gemeinsam zu nutzen, ist es notwendig, sowohl Knochen-Standardpose als auch Knochen-Namen abzugleichen, um in einigen Fällen unerwünschte Tracks zu entfernen. In Godot 4.0+ können Sie dies mit dem Szenenimporter tun.
zh_cn: 要在 Godot 中共享动画，需要匹配 Bone Rest 和骨骼名称，以在某些情况下删除不需要的轨道。在 Godot 4.0+ 中，可以使用场景导入器来实现。
zh_tw: 要在 Godot 中共享動畫，需要配對骨骼休息和骨骼名稱，以在某些情況下刪除不需要的軌跡。在 Godot 4.0+ 中，您可以使用場景匯入器來做到這一點。

source: Options for Retargeting
de: Optionen für Neuzuweisung
zh_cn: 重定向选项
zh_tw: 重定向選項

source: Bone Map
de: Knochen-Map
zh_cn: 骨骼映射
zh_tw: 骨骼對映

source: When you select the Skeleton3D node in the advanced scene import menu, a menu will appear on the right-hand side containing the "Retarget" section. The Retarget section has a single property ``bone_map``.
de: Wenn Sie den Skeleton3D-Node im erweiterten Szenenimportmenü auswählen, erscheint auf der rechten Seite ein Menü, das den Abschnitt "Neuzuweisen" enthält. Der Abschnitt "Neuzuweisen" hat eine einzige Property ``bone_map``.
zh_cn: 当在高级场景导入菜单中选择 Skeleton3D 节点时，右侧将出现一个菜单，其中包含“重定向”部分。重定向部分中有一个属性 ``bone_map`` 。
zh_tw: 當您在進階場景匯入選單中選擇 Skeleton3D 節點時，右側將出現一個選單，其中包含「重新定位」部分。重定向部分有一個屬性``bone_map``。

source: With the Skeleton node selected, first set up a new :ref:`class_bonemap` and :ref:`class_skeletonprofile`. Godot has a preset called :ref:`class_skeletonprofilehumanoid` for humanoid models. This tutorial proceeds with the assumption that you are using :ref:`class_skeletonprofilehumanoid`.
de: Wenn der Skeleton-Node ausgewählt ist, legen Sie zunächst eine neue :ref:`class_bonemap` und :ref:`class_skeletonprofile` an. Godot hat eine Vorgabe namens :ref:`class_skeletonprofilehumanoid` für humanoide Modelle. Dieses Tutorial geht davon aus, dass Sie :ref:`class_skeletonprofilehumanoid` verwenden.
zh_cn: 选择 Skeleton 节点后，首先设置一个新的 :ref:`class_bonemap` 和 :ref:`class_sculptureprofile`。 Godot 有一个用于人形模型的预设，名为 :ref:`class_sculptureprofile humanoid`。本教程假设你使用的就是 :ref:`class_sculptureprofile humanoid`。
zh_tw: 選擇 Skeleton 節點後，先設定一個新的 class_bonemap 和 class_sculptureprofile。 Godot 有一個人形模型的預設，名稱為 :ref:`class_sculptureprofile humanoid`。本教學假設您使用的是:ref:`class_sculptureprofile humanoid`。

source: If you need a profile for a model such as a beast or creature, you can export a :ref:`class_skeletonprofile` from SkeletonEditor with some information converted from Skeleton.
de: Wenn Sie ein Profil für ein Modell wie ein Tier oder eine Kreatur benötigen, können Sie ein :ref:`class_skeletonprofile` aus SkeletonEditor mit einigen aus Skeleton konvertierten Informationen exportieren.
zh_cn: 如果你需要一只野兽或者其他生物的模型的配置文件，可以从 SkeletonEditor 导出一个 :ref:`class_sculptureprofile` ，其中包含从 Skeleton 转换出的一些信息。
zh_tw: 如果您需要模型（例如野獸或生物）的配置檔案，您可以從 SkeletonEditor 匯出一個 class_sculptureprofile ，其中包含從 Skeleton 轉換的一些資訊。

source: When you use :ref:`class_skeletonprofilehumanoid`, auto-mapping will be performed when the :ref:`class_skeletonprofile` is set. If the auto-mapping does not work well, you can map bones manually.
de: Wenn Sie :ref:`class_skeletonprofilehumanoid` verwenden, wird ein automatisches Zuordnung durchgeführt, wenn das :ref:`class_skeletonprofile` gesetzt ist. Wenn die automatische Zuordnung nicht gut funktioniert, können Sie Knochen manuell zuordnen.
zh_cn: 当使用 :ref:`class_sculptureprofile humanoid`时，将在设置 :ref:`class_sculptureprofile`时执行自动映射。如果自动映射的效果不佳，你也可以手动映射骨骼。
zh_tw: 當您使用:ref:`class_sculptureprofile humanoid`時，將在設定:ref:`class_sculptureprofile`時執行自動對應。如果自動對應效果不佳，您可以手動對應骨骼。

source: Any missing, duplicate or incorrect parent-child relationship mappings will be indicated by a magenta / red button (depending on the editor setting). It does not block the import process, but it warns that animations may not be shared correctly.
de: Fehlende, doppelte oder falsche Zuordnungen von Parent-Child-Beziehungen werden durch eine magentafarbene/rote Schaltfläche angezeigt (je nach Editoreinstellung). Sie blockiert den Importvorgang nicht, warnt aber davor, dass Animationen möglicherweise nicht korrekt geteilt werden.
zh_cn: 任何缺失、重复或不正确的父子关系映射，都将由洋红色/红色按钮指示（取决于编辑器设置）。它不会阻止导入过程，但会警告动画可能无法正确共享。
zh_tw: 任何缺失、重複或不正確的父子關係對應都將由洋紅色/紅色按鈕指示（取決於編輯器設定）。它不會阻止匯入過程，但會警告動畫可能無法正確共享。

source: The auto-mapping uses pattern matching for the bone names. So we recommend to use common English names for bones.
de: Die automatische Zuordnung verwendet Pattern Matching für die Knochennamen. Wir empfehlen daher, gebräuchliche englische Namen für Knochen zu verwenden.
zh_cn: 自动映射使用骨骼名称进行模式匹配。所以建议骨骼都使用常见的英文名称。
zh_tw: 自動對應使用骨骼名稱的模式配對。所以我們建議骨骼使用常見的英文名稱。

source: After you set up the ``bone_map``, several options are available in the sections below.
de: Nachdem Sie die ``bone_map`` eingerichtet haben, stehen Ihnen in den folgenden Abschnitten verschiedene Optionen zur Verfügung.
zh_cn: 设置 ``bone_map`` 后，以下部分中提供了多个选项。
zh_tw: 設定“bone_map”後，以下部分提供了多個選項。

source: Remove Tracks
de: Tracks entfernen
zh_cn: 移除轨道
zh_tw: 刪除動畫軌

source: If you import resources as an :ref:`class_animationlibrary` that will be shared, we recommend to enable these options. However, if you import resources as scenes, these should be disabled in some cases. For example, if you import a character with animated accessories, these options may cause the accessories to not animate.
de: Wenn Sie Ressourcen als :ref:`class_animationlibrary` importieren, die gemeinsam genutzt werden sollen, empfehlen wir, diese Optionen zu aktivieren. Wenn Sie jedoch Ressourcen als Szenen importieren, sollten diese Optionen in einigen Fällen deaktiviert werden. Wenn Sie zum Beispiel einen Charakter mit animierten Accessoires importieren, können diese Optionen dazu führen, dass die Accessoires nicht animiert werden.
zh_cn: 当你要将资源导入为要共享的 :ref:`class_animationlibrary`时，建议启用这些选项。然而，如果将资源导入为场景，则在某些情况下应禁用这些选项。例如，如果导入带有动画配件的角色，这些选项可能会导致配件没有动画。
zh_tw: 如果您將資源匯入為要共用的 class_animationlibrary，我們建議啟用這些選項。但是，如果將資源匯入為場景，則在某些情況下應停用這些資源。例如，如果您匯入具有動畫配件的角色，這些選項可能會導致配件不具有動畫效果。

source: Except Bone Transform
de: Außer Knochen-Transform
zh_cn: 额外的变换矩阵
zh_tw: 排除骨骼變換

source: Removes any tracks except the bone Transform track from the animations.
de: Entfernt alle Tracks außer dem Knochen-Transform-Track aus den Animationen.
zh_cn: 从动画中删除除骨骼变换轨道之外的所有轨道。
zh_tw: 從動畫中刪除除骨骼變換軌跡之外的所有軌跡。

source: Unimportant Positions
de: Unwichtige Positionen
zh_cn: 非重要位置
zh_tw: 非重要位置

source: Removes Position tracks other than ``root_bone`` and ``scale_base_bone`` defined in :ref:`class_skeletonprofile` from the animations. In :ref:`class_skeletonprofilehumanoid`, this means that to remove Position tracks other than "Root" and "Hips". Since Godot 4.0+, animations include Bone Rest in the Transform value. If you disable this option, the animation may change the body shape unpredictably.
de: Entfernt andere Positions-Tracks als ``root_bone`` und ``scale_base_bone``, die in :ref:`class_skeletonprofile` definiert sind, aus den Animationen. In :ref:`class_skeletonprofilehumanoid` bedeutet dies, dass andere Positions-Tracks als "Root" und "Hips" entfernt werden sollen. Seit Godot 4.0+ schließen Animationen die Knochen-Standardpose in den Transform-Wert ein. Wenn Sie diese Option deaktivieren, kann die Animation die Körperform unvorhersehbar verändern.
zh_cn: 从动画中删除除了在 :ref:`class_sculptureprofile` 中定义过的 ``root_bone`` 和 ``scale_base_bone`` 以外的 Position 轨道。在 :ref:`class_sculptureprofile humanoid` 中，这意味着要删除除 ``Root`` 和 ``Hips`` 之外的 Position 轨道。自 Godot 4.0+ 起，动画在变换值中包含 Bone Rest。如果禁用此选项，动画可能会意外地改变身体形状。
zh_tw: 從動畫中刪除除了在 class_sculptureprofile 中定義的「root_bone」和「scale_base_bone」以外的位置軌跡。在 class_sculptureprofile humanoid 中，這表示要刪除「Root」和「Hips」之外的位置軌跡。自 Godot 4.0+ 起，動畫在變換值中包含骨骼休息。如果停用此選項，動畫可能會意外地改變身體形狀。

source: Unmapped Bones
de: Nicht-zugeordnete Knochen
zh_cn: 未映射骨骼
zh_tw: 未對映骨骼

source: Removes unmapped bone Transform tracks from the animations.
de: Entfernt nicht zugeordnete Bone-Transform-Tracks aus den Animationen.
zh_cn: 从动画中删除未映射的骨骼变换轨道。
zh_tw: 從動畫中刪除未對應的骨骼變換軌跡。

source: Bone Renamer
de: Knochen-Umbenenner
zh_cn: 骨骼命名器
zh_tw: 重命名骨骼

source: Rename Bones
de: Knochen umbenennen
zh_cn: 重命名骨骼
zh_tw: 重新命名節點

source: Rename the mapped bones.
de: Umbenennen der zugeordneten Knochen.
zh_cn: 重命名映射的骨骼。
zh_tw: 重命名對應的骨骼。

source: Unique Node
de: Einzigartiger Node
zh_cn: 唯一节点
zh_tw: 唯一節點

source: Makes Skeleton a unique node with the name specified in the ``skeleton_name``. This allows the animation track paths to be unified independent of the scene hierarchy.
de: Macht das Skelett zu einem eindeutigen Node mit dem in ``skeleton_name`` angegebenen Namen. Dies ermöglicht die Vereinheitlichung der Animationspfade unabhängig von der Szenenhierarchie.
zh_cn: 使 Skeleton 成为一个唯一的节点，其名称在 ``skeleton_name`` 中指定。这会使得动画轨道路径能够独立于场景层次结构而统一。
zh_tw: 使 Skeleton 成為一個唯一的節點，其名稱在「sculpture_name」中指定。這使得動畫軌道路徑能夠獨立於場景層次結構而均勻。

source: Rest Fixer
de: Ruheposen-Fixer
zh_cn: 放松修复器
zh_tw: 放鬆修復器

source: Reference poses defined in :ref:`class_skeletonprofilehumanoid` have the following rules:
de: Für die in :ref:`class_skeletonprofilehumanoid` definierten Referenzposen gelten die folgenden Regeln:
zh_cn: ref:`class_skeletonprofilehumanoid` 中定义参考姿势有以下规则：
zh_tw: ref:`class_skeletonprofilehumanoid` 中定義的參考姿勢有以下規則：

source: The humanoid is T-pose
de: Für Humanoide gilt die T-Pose
zh_cn: 人形物体呈 T 形姿势
zh_tw: 人形機器人呈 T 字姿勢

source: The humanoid is facing +Z in the Right-Handed Y-UP Coordinate System
de: Der Humanoide ist im rechtshändigen Y-oben-Koordinatensystem nach +Z ausgerichtet
zh_cn: 人形物体在右手 Y-UP 坐标系中朝向 +Z
zh_tw: 人形機器人面向右手 Y-UP 座標系中的 +Z

source: The humanoid should not have a Transform as Node
de: Der Humanoide sollte keinen Transform als Node haben
zh_cn: 人形物体不应该有一个Transform作为节点
zh_tw: 人形機器人不應該有一個 Transform 作為節點

source: Directs the +Y axis from the parent joint to the child joint
de: Richtet die +Y-Achse vom Parent-Gelenk zum Child-Gelenk
zh_cn: 将 +Y 轴从父关节指向子关节
zh_tw: 將 +Y 軸從父關節指向子關節

source: +X rotation bends the joint like a muscle contracting
de: Die +X-Rotation beugt das Gelenk wie ein Muskel, der sich zusammenzieht
zh_cn: +X 旋转使关节像肌肉收缩一样弯曲
zh_tw: +X 旋轉使關節像肌肉收縮一樣彎曲

source: These rules are convenient definitions for blend animation and Inverse Kinematics (IK). If your model does not match this definition, you need to fix it with these options.
de: Diese Regeln sind praktische Definitionen für Blend-Animationen und Inverse Kinematik (IK). Wenn Ihr Modell nicht dieser Definition entspricht, müssen Sie es mit diesen Optionen korrigieren.
zh_cn: 这些规则是混合动画和反向动力学（IK）的便捷定义。如果你的模型与此定义不符，你需要用这些选项来进行修正。
zh_tw: 這些規則是混合動畫和反向運動學 (IK) 的便捷定義。如果您的模型與此定義不配對，您需要使用這些選項進行修復。

source: Apply Node Transform
de: Node-Transform anwenden
zh_cn: 应用节点变换
zh_tw: 清除變換

source: If the asset is not exported correctly for sharing, the imported Skeleton may have a Transform as a Node. For example, a glTF exported from Blender with no "Apply Transform" executed is one such case. It looks like the model matches the definition, but the internal Transforms are different from the definition. This option fixes such models by applying Transforms on import.
de: Wenn das Asset nicht korrekt für die gemeinsame Nutzung exportiert wurde, kann das importierte Skelett einen Transform als Node haben. Ein aus Blender exportiertes glTF, bei dem kein "Apply Transform" ausgeführt wurde, ist beispielsweise ein solcher Fall. Es sieht so aus, als ob das Modell mit der Definition übereinstimmt, aber die internen Transforms unterscheiden sich von der Definition. Diese Option behebt solche Modelle, indem Transforms beim Import angewendet werden.
zh_cn: 如果没有正确导出资产进行共享，导入的骨骼可能会将Transform作为节点。例如，从 Blender 导出的但没有执行 "应用变换"的glTF就是这样的情况。看起来模型与定义相符，但内部Tranforms与定义不同。此选项可通过在导入时应用变换来修复此类模型。
zh_tw: 如果資源未正確匯出以進行共享，則匯入的骨架可能會將變換作為節點。例如，從 Blender 匯出但未執行「套用變換」的 glTF 就是這樣的情況。看起來模型與定義配對，但內部 Transforms 與定義不同。此選項透過在匯入時套用變換來修復此類模型。

source: If the imported scene contains objects other than Skeletons, this option may have a negative effect.
de: Wenn die importierte Szene andere Objekte als Skelette enthält, kann sich diese Option nachteilig auswirken.
zh_cn: 如果导入的场景包含骷髅以外的其他对象，该选项可能会产生负面影响。
zh_tw: 如果匯入的場景包含骨架以外的對象，此選項可能會產生負面影響。

source: Normalize Position Tracks
de: Positions-Tracks normalisieren
zh_cn: 归一化位置轨道
zh_tw: 正規化位置軌道

source: Position track is used mostly for model movement, but sharing the moving animation between models with different heights may cause the appearance of slipping due to the difference in stride length. This option normalizes the Position track values based on the ``scale_base_bone`` height. The ``scale_base_bone`` height is stored in the Skeleton as the ``motion_scale``, and the normalized Position track values is multiplied by that value on playback. If this option is disabled, the Position tracks is not normalized and the Skeleton's ``motion_scale`` is always imported as ``1.0``.
de: Der Positions-Track wird hauptsächlich für die Bewegung des Modells verwendet, aber die gemeinsame Nutzung der Bewegungsanimation durch Modelle mit unterschiedlichen Höhen kann aufgrund der unterschiedlichen Schrittlänge zu einem Verrutschen führen. Diese Option normalisiert die Werte des Positions-Tracks basierend auf der ``scale_base_bone``-Höhe. Die ``scale_base_bone``-Höhe wird im Skelett als ``motion_scale`` gespeichert, und die normalisierten Position-Track-Werte werden beim Abspielen mit diesem Wert multipliziert. Wenn diese Option deaktiviert ist, werden die Positions-Tracks nicht normalisiert und die ``motion_scale`` des Skeletts wird immer als ``1.0`` importiert.
zh_cn: 位置轨道主要用于模型的移动，但在不同高度的模型之间共享移动动画可能会由于步长的差异而导致滑倒现象。该选项会根据 ``scale_base_bone`` 高度标准化位置轨道。 ``scale_base_bone`` 高度作为 ``motion_scale`` 存储在骨骼中，并且标准化的位置轨道值在播放时将乘以该值。如果禁用此选项，则位置轨道不会被标准化，骨架的 ``motion_scale`` 始终以 ``1.0`` 的形式导入。
zh_tw: 位置軌跡主要用於模型移動，但在不同高度的模型之間共享移動動畫可能會因步幅差異而導致滑倒現象。此選項根據“scale_base_bone”高度標準化位置追蹤值。 「scale_base_bone」高度作為「motion_scale」儲存在骨架中，並且標準化位置軌道值在播放時乘以該值。如果停用此選項，則位置軌跡不會標準化，且骨架的「motion_scale」始終匯入為「1.0」。

source: With :ref:`class_skeletonprofilehumanoid`, ``scale_base_bone`` is "Hips", therefore the Hips' height is used as the ``motion_scale``.
de: Bei :ref:`class_skeletonprofilehumanoid` ist ``scale_base_bone`` "Hips", daher wird die Höhe der Hüfte als ``motion_scale`` verwendet.
zh_cn: 对于 :ref:`class_sculptureprofile humanoid`， ``scale_base_bone`` 是“臀部”，因此臀部的高度用作 ``motion_scale`` 。
zh_tw: 對於 :ref:`class_sculptureprofile humanoid`，``scale_base_bone`` 是“臀部”，因此臀部的高度用作“motion_scale”。

source: Overwrite Axis
de: Achse überschreiben
zh_cn: 覆盖轴
zh_tw: 覆蓋軸

source: Unifies the models' Bone Rests by overwriting it to match the reference poses defined in the :ref:`class_skeletonprofile`.
de: Vereinheitlicht die Knochen-Standardposen der Modelle durch Überschreiben, damit sie mit den im :ref:`class_skeletonprofile` definierten Referenzposen übereinstimmen.
zh_cn: 通过覆盖模型的 Bone Rest 来统一模型的 Bone Rest，以匹配 :ref:`class_sculptureprofile` 中定义的参考姿势。
zh_tw: 透過覆蓋模型的骨骼休息來均勻模型的骨骼休息，以配對 class_sculptureprofile 中定義的參考姿勢。

source: This is the most important option for sharing animations in Godot 4.0+, but be aware that this option can produce horrible results **if the original Bone Rest set externally is important**. If you want to share animations with keeping the original Bone Rest, consider to use the `Realtime Retarget Module <https://github.com/TokageItLab/realtime_retarget>`__.
de: Dies ist die wichtigste Option für die gemeinsame Nutzung von Animationen in Godot 4.0+, aber seien Sie sich bewusst, dass diese Option zu schrecklichen Ergebnissen führen kann, **wenn die ursprüngliche, extern gesetzte Knochen-Ruhepose wichtig ist**. Wenn Sie Animationen unter Beibehaltung der ursprünglichen Knochen-Ruhepose teilen möchten, sollten Sie das `Realtime Retarget Module <https://github.com/TokageItLab/realtime_retarget>`__ verwenden.
zh_cn: 该选项是 Godot 4.0+ 中共享动画的最重要的选项，但请注意， **如果外部设置的原始 Bone Rest 很重要** ，则此选项可能会产生可怕的结果。如果你想在保留原始 Bone Rest 的情况下共享动画，请考虑使用 `实时重定向模块 <https://github.com/TokageItLab/realtime_retarget>`__ 。
zh_tw: 這是 Godot 4.0+ 中共享動畫的最重要選項，但請注意，如果外部設定的原始 Bone Rest 很重要，則此選項可能會產生可怕的結果**。如果您想在保留原始 Bone Rest 的情況下共享動畫，請考慮使用「即時重定向模組 <https://github.com/TokageItLab/realtime_retarget>`__。

source: Fix Silhouette
de: Korrigieren der Silhouette
zh_cn: 修复剪影
zh_tw: 修復剪影

source: Attempts to make the model's silhouette match that of the reference poses defined in the :ref:`class_skeletonprofile`, such as T-Pose. This cannot fix silhouettes which are too different, and it may not work for fixing bone roll.
de: Versucht, die Silhouette des Modells an die in :ref:`class_skeletonprofile` definierten Referenzposen, wie z. B. T-Pose, anzupassen. Dies kann keine Silhouetten korrigieren, die zu unterschiedlich sind, und es funktioniert möglicherweise nicht für die Korrektur von Knochen-Rollen.
zh_cn: 尝试让模型的剪影与 :ref:`class_sculptureprofile` 中定义的参考姿势相匹配，例如 T-Pose。该功能无法修复差异太大的剪影，并且可能不适用于修复骨骼滚动。
zh_tw: 嘗試將模型的輪廓與 class_sculptureprofile 中定義的參考姿勢相配對，例如 T 形姿勢。這無法修復差異太大的輪廓，並且可能不適用於修復骨骼滾動。

source: With :ref:`class_skeletonprofilehumanoid`, this option does not need to be enabled for T-pose models, but should be enabled for A-pose models. However in that case, the fixed foot results may be bad depending on the heel height of the model, so it may be necessary to add the :ref:`class_skeletonprofile` bone names you do not want fixed in the ``filter`` array, as in the below example.
de: Mit :ref:`class_skeletonprofilehumanoid` muss diese Option für T-Pose-Modelle nicht aktiviert werden, sollte aber für A-Pose-Modelle aktiviert werden. In diesem Fall können die Ergebnisse für den fixierten Fuß jedoch schlecht sein, abhängig von der Fersenhöhe des Modells, so dass es notwendig sein kann, die :ref:`class_skeletonprofile` Knochen-Namen, die nicht fixiert werden sollen, in das ``Filter``-Array einzufügen, wie im folgenden Beispiel.
zh_cn: 使用 :ref:`class_sculptureprofile humanoid` 时，不需要为 T-Pose 模型启用此选项，但应为 A-Pose 模型启用。然而，在这种情况下，根据模型的脚跟高度，固定脚的结果有可能会很糟糕，因此，可能需要添加你并不希望在 ``filter`` 数组中固定的 :ref:`class_sculptureprofile` 骨骼名称，如下例所示。
zh_tw: 使用 class_sculptureprofile humanoid 時，無需為 T 姿勢模型啟用此選項，但應為 A 姿勢模型啟用。然而，在這種情況下，根據模型的腳跟高度，固定腳的結果可能會很差，因此可能需要新增您不希望在“filter”陣列中固定的 :ref:`class_sculptureprofile` 骨骼名稱，如下例所示。

source: Also, for models with bent knees or feet, it may be necessary to adjust the ``scale_base_bone`` height. For that, you can use ``base_height_adjustment`` option.
de: Außerdem kann es bei Modellen mit gebeugten Knien oder Füßen notwendig sein, die Höhe der ``scale_base_bone`` anzupassen. Hierfür können Sie die Option ``base_height_adjustment`` verwenden.
zh_cn: 此外，对于膝盖或脚弯曲的模型，可能需要调整 ``scale_base_bone`` 高度。为此可以使用 ``base_height_ adjustment`` 选项。
zh_tw: 此外，對於膝蓋或腳彎曲的模型，可能需要調整“scale_base_bone”高度。為此，您可以使用“base_height_ adjustment”選項。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
