Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: de

source: Internationalizing games
de: Übersetzung von Spielen

source: Introduction
de: Einführung

source: Sería excelente que el mundo hablara solo un idioma (It would be great if the world spoke only one language). Unfortunately for us developers, that is not the case. While indie or niche games usually do not need localization, games targeting a more massive market often require localization. Godot offers many tools to make this process more straightforward, so this tutorial is more like a collection of tips and tricks.
de: Sería excelente que el mundo hablara solo un idioma (Es wäre gut wenn die Welt nur eine Sprache sprechen würde). Zum Leidwesen für uns Entwickler ist dem nicht so. Kleine Indie- oder Nischenspiele benötigen keine Lokalisierung, größere Spiele die auf den breiten Massenmarkt zielen, benötigen dies aber auf jeden Fall. Godot bietet viele Tools, um diesen Prozess einfacher zu gestalten. Daher ähnelt diese Anleitung eher einer Sammlung von Tipps und Tricks.

source: Localization is usually done by specific studios hired for the job. Despite the huge amount of software and file formats available for this, the most common way to do localization to this day is still with spreadsheets. The process of creating the spreadsheets and importing them is already covered in the :ref:`doc_importing_translations` tutorial. If you haven't read the Importing translations page before, we recommend you give it a read before reading this page.
de: Die Lokalisierung wird in der Regel von speziellen Studios durchgeführt, die mit dieser Aufgabe betraut sind. Trotz der riesigen Menge an Software und Dateiformaten, die dafür zur Verfügung stehen, wird die Lokalisierung bis heute am häufigsten mit Tabellenkalkulationsprogrammen durchgeführt. Der Prozess der Erstellung von Tabellenkalkulationen und des Imports wurde bereits im Tutorial :ref:`doc_importing_translations` behandelt. Wenn Sie die Seite zum Importieren von Übersetzungen noch nicht gelesen haben, empfehlen wir Ihnen, dies zu tun, bevor Sie diese Seite lesen.

source: We will be using the official demo as an example; you can `download it from the Asset Library <https://godotengine.org/asset-library/asset/134>`_.
de: Wir werden die offizielle Demo als Beispiel verwenden. Sie können sie aus der `Asset-Bibliothek <https://godotengine.org/asset-library/asset/134>`_ herunterladen.

source: Configuring the imported translation
de: Konfigurieren der importierten Übersetzung

source: Translations can get updated and re-imported when they change, but they still have to be added to the project. This is done in **Project → Project Settings → Localization**:
de: Übersetzungen können aktualisiert und neu importiert werden, wenn sie sich ändern, aber sie müssen noch zum Projekt hinzugefügt werden. Dies geschieht in **Projekt → Projekteinstellungen → Lokalisierung**:

source: The above dialog is used to add or remove translations project-wide.
de: Der obige Dialog wird verwendet, um Übersetzungen projektweit hinzuzufügen oder zu entfernen.

source: Localizing resources
de: Ressourcen lokalisieren

source: It is also possible to instruct Godot to use alternate versions of assets (resources) depending on the current language. This can be used for localized images such as in-game billboards or localized voices.
de: Es ist auch möglich, Godot anzuweisen, je nach aktueller Sprache alternative Versionen von Assets (Ressourcen) zu verwenden. Dies kann für lokalisierte Bilder wie Anzeigen im Spiel oder lokalisierte Stimmen verwendet werden.

source: The **Remaps** tab can be used for this:
de: Dazu kann das **Neuzuweisungen**-Tab verwendet werden:

source: Select the resource to be remapped then add some alternatives for each locale.
de: Wählen Sie die neu zuzuordnende Ressource aus und fügen Sie dann für jedes Gebietsschema einige Alternativen hinzu.

source: The resource remapping system isn't supported for DynamicFonts. To use different fonts depending on the language's script, use the DynamicFont fallback system instead, which lets you define as many fallback fonts as you want.
de: Das Resource-Remapping-System wird für DynamicFonts nicht unterstützt. Um je nach Schrift der Sprache unterschiedliche Schriftarten zu verwenden, verwenden Sie stattdessen das DynamicFont-Fallback-System, mit dem Sie beliebig viele Fallback-Schriftarten definieren können.

source: The upside of the DynamicFont fallback system is that it works regardless of the current language, making it ideal for things like multiplayer chat where the text language may not match the client's language.
de: Der Vorteil des DynamicFont-Fallback-Systems ist, dass es unabhängig von der aktuellen Sprache funktioniert, was es ideal für Dinge wie Multiplayer-Chat macht, bei denen die Textsprache möglicherweise nicht mit der Sprache des Clients übereinstimmt.

source: Converting keys to text
de: Schlüsselwörter in Text konvertieren

source: Some controls, such as :ref:`Button <class_Button>` and :ref:`Label <class_Label>`, will automatically fetch a translation if their text matches a translation key. For example, if a label's text is "MAIN_SCREEN_GREETING1" and that key exists in the current translation, then the text will automatically be translated.
de: Einige Steuerelemente, wie :ref:`Button <class_Button>` und :ref:`Label <class_Label>`, holen automatisch eine Übersetzung, wenn ihr Text mit einem Übersetzungsschlüsselwort übereinstimmt. Wenn der Text eines Labels zum Beispiel "MAIN_SCREEN_GREETING1" lautet und dieses Schlüsselwort in der aktuellen Übersetzung existiert, wird der Text automatisch übersetzt.

source: This automatic translation behavior may be undesirable in certain cases. For instance, when using a Label to display a player's name, you most likely don't want the player's name to be translated if it matches a translation key. To disable automatic translation on a specific node, disable **Localization > Auto Translate** in the inspector.
de: Dieses automatische Übersetzungsverhalten kann in bestimmten Fällen unerwünscht sein. Wenn Sie beispielsweise ein Label verwenden, um den Namen eines Spielers anzuzeigen, möchten Sie wahrscheinlich nicht, dass der Name des Spielers übersetzt wird, wenn er einem Übersetzungsschlüsselwort entspricht. Um die automatische Übersetzung für einen bestimmten Node zu deaktivieren, deaktivieren Sie **Lokalisierung > Automatisch übersetzen** im Inspektor.

source: In code, the :ref:`Object.tr() <class_Object_method_tr>` function can be used. This will just look up the text in the translations and convert it if found:
de: Im Code kann die Funktion :ref:`Object.tr() <class_Object_method_tr>` verwendet werden. Diese sucht den Text in den Übersetzungen und konvertiert ihn, wenn er gefunden wird:

source: If no text is displayed after changing the language, try to use a different font. The default project font only supports a subset of the Latin-1 character set, which cannot be used to display languages like Russian or Chinese.
de: Wenn nach dem Ändern der Sprache kein Text angezeigt wird, versuchen Sie, eine andere Schriftart zu verwenden. Die Standard-Projektschriftart unterstützt nur eine Teilmenge des Latin-1-Zeichensatzes, der nicht zur Anzeige von Sprachen wie Russisch oder Chinesisch verwendet werden kann.

source: A good resource for multilingual fonts is `Noto Fonts <https://www.google.com/get/noto/>`__. Make sure to download the correct variation if you're using a less common language.
de: Eine gute Quelle für mehrsprachige Schriftarten ist `Noto Fonts <https://www.google.com/get/noto/>`__. Stellen Sie sicher, dass Sie die richtige Variante herunterladen, wenn Sie eine weniger verbreitete Sprache verwenden.

source: Once you've downloaded the font, load the TTF file into a DynamicFont resource and use it as a custom font of your Control node. For better reusability, associate a new a Theme resource to your root Control node and define the DynamicFont as the Default Font in the theme.
de: Sobald Sie die Schriftart heruntergeladen haben, laden Sie die TTF-Datei in eine DynamicFont-Ressource und verwenden Sie sie als benutzerdefinierte Schriftart für Ihren Control-Node. Um die Wiederverwendbarkeit zu verbessern, verknüpfen Sie eine neue Ressource für ein Thema mit Ihrem Root Control-Node und definieren Sie die DynamicFont als Standardschriftart im Theme.

source: Placeholders
de: Platzhalter

source: To feature placeholders in your translated strings, use :ref:`doc_gdscript_printf` or the equivalent feature in C#. This lets translators move the location of the placeholder in the string freely, which allows translations to sound more natural. Named placeholders with the ``String.format()`` function should be used whenever possible, as they also allow translators to choose the *order* in which placeholders appear:
de: Um Platzhalter in Ihre übersetzten Strings einzufügen, verwenden Sie :ref:`doc_gdscript_printf` oder die entsprechende Funktion in C#. Dadurch können Übersetzer die Position des Platzhalters im String frei verschieben, was die Übersetzungen natürlicher klingen lässt. Benannte Platzhalter mit der Funktion ``String.format()`` sollten wann immer möglich verwendet werden, da sie es dem Übersetzer auch erlauben, die *Reihenfolge* der Platzhalter zu wählen:

source: Translation contexts
de: Übersetzungskontexte

source: If you're using plain English as source strings (rather than message codes ``LIKE_THIS``), you may run into ambiguities when you have to translate the same English string to different strings in certain target languages. You can optionally specify a *translation context* to resolve this ambiguity and allow target languages to use different strings, even though the source string is identical:
de: Wenn Sie einfaches Englisch als Quellstrings verwenden (anstelle von Nachrichtencodes wie ``LIKE_THIS``), können Sie auf Mehrdeutigkeiten stoßen, wenn Sie denselben englischen String in verschiedene Strings in bestimmten Zielsprachen übersetzen müssen. Sie können optional einen *Übersetzungskontext* angeben, um diese Mehrdeutigkeit aufzulösen und den Zielsprachen zu erlauben, unterschiedliche Strings zu verwenden, auch wenn der Quellstring identisch ist:

source: Pluralization
de: Pluralbildung

source: Most languages require different strings depending on whether an object is in singular or plural form. However, hardcoding the "is plural" condition depending on whether there is more than 1 object is not valid in all languages.
de: Die meisten Sprachen verlangen unterschiedliche Strings, je nachdem, ob ein Objekt im Singular oder Plural vorliegt. Die Hardcodierung der Bedingung "ist Plural" in Abhängigkeit davon, ob es mehr als ein Objekt gibt, ist jedoch nicht in allen Sprachen gültig.

source: Some languages have more than two plural forms, and the rules on the number of objects required for each plural form vary. Godot offers support for *pluralization* so that the target locales can handle this automatically.
de: Einige Sprachen haben mehr als zwei Pluralformen, und die Regeln für die Anzahl der für jede Pluralform erforderlichen Objekte sind unterschiedlich. Godot bietet Unterstützung für *Pluralbildung*, so dass die Zielsprachensysteme dies automatisch handhaben können.

source: Pluralization is meant to be used with positive (or zero) integer numbers only. Negative and floating-point values usually represent physical entities for which singular and plural don't clearly apply.
de: Die Pluralbildung ist nur für positive (oder Null-) Integer-Zahlen gedacht. Negative und Float-Zahlen stellen in der Regel physikalische Einheiten dar, für die Singular und Plural nicht eindeutig gelten.

source: This can be combined with a context if needed:
de: Dies kann bei Bedarf mit einem Kontext kombiniert werden:

source: Providing pluralized translations is only supported with :ref:`doc_localization_using_gettext`, not CSV.
de: Die Bereitstellung von pluralisierten Übersetzungen wird nur mit :ref:`doc_localization_using_gettext` unterstützt, nicht mit CSV.

source: Making controls resizable
de: Größenänderung von Steuerelementen

source: The same text in different languages can vary greatly in length. For this, make sure to read the tutorial on :ref:`doc_size_and_anchors`, as dynamically adjusting control sizes may help. :ref:`Container <class_Container>` can be useful, as well as the text wrapping options available in :ref:`Label <class_Label>`.
de: Derselbe Text kann in verschiedenen Sprachen sehr unterschiedlich lang sein. Lesen Sie hierzu unbedingt das Tutorial zu :ref:`doc_size_and_anchors`, da eine dynamische Anpassung der Kontrollgrößen hilfreich sein kann. :ref:`Container <class_Container>` kann nützlich sein, ebenso wie die in :ref:`Label <class_Label>` verfügbaren Textumbruchoptionen.

source: To check whether your UI can accommodate translations with longer strings than the original, you can enable *pseudolocalization* in the advanced Project Settings. This will replace all your localizable strings with longer versions of themselves, while also replacing some characters in the original strings with accented versions (while still being readable). Placeholders are kept as-is, so that they keep working when pseudolocalization is enabled.
de: Um zu prüfen, ob Ihre Benutzeroberfläche Übersetzungen mit längeren Strings als dem Original aufnehmen kann, können Sie in den erweiterten Projekteinstellungen die *Pseudolokalisierung* aktivieren. Dadurch werden alle lokalisierbaren Strings durch längere Versionen ersetzt, wobei auch einige Zeichen in den ursprünglichen Zeichenfolgen durch akzentuierte Versionen ersetzt werden (wobei sie immer noch lesbar sind). Platzhalter werden unverändert beibehalten, so dass sie auch bei aktivierter Pseudolokalisierung weiterhin funktionieren.

source: For example, the string ``Hello world, this is %s!`` becomes ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]`` when pseudolocalization is enabled.
de: Zum Beispiel wird der String ``Hallo Welt, hier ist %s!`` zu ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]`` wenn die Pseudolokalisierung aktiviert ist.

source: While looking strange at first, pseudolocalization has several benefits:
de: Die Pseudolokalisierung sieht zwar auf den ersten Blick seltsam aus, hat aber mehrere Vorteile:

source: It lets you spot non-localizable strings quickly, so you can go over them and make them localizable (if it makes sense to do so).
de: Sie erlaubt Ihnen, nicht lokalisierbare Strings schnell zu erkennen, so dass sie überarbeitet und lokalisierbar gemacht werden können (falls dies sinnvoll ist).

source: It lets you check UI elements that can't fit long strings. Many languages will feature much longer translations than the source text, so it's important to ensure your UI can accommodate longer-than-usual strings.
de: Es erlaubt Ihnen, Elemente der Benutzeroberfläche zu überprüfen, die nicht für lange Strings geeignet sind. In vielen Sprachen sind die Übersetzungen viel länger als der Ausgangstext. Daher muss sichergestellt werden, dass die Benutzeroberfläche auch längere Strings als üblich aufnehmen kann.

source: It lets you check whether your font contains all the characters required to support various languages. However, since the goal of pseudolocalization is to keep the original strings readable, it's not an effective test for checking whether a font can support :abbr:`CJK (Chinese, Japanese, Korean)` or right-to-left languages.
de: Es erlaubt Ihnen, zu überprüfen, ob Ihre Schriftart alle Zeichen enthält, die zur Unterstützung verschiedener Sprachen erforderlich sind. Da das Ziel der Pseudolokalisierung jedoch darin besteht, die ursprünglichen Strings lesbar zu halten, ist dies kein effektiver Test, um zu prüfen, ob eine Schriftart :abbr:`CJK (Chinesisch, Japanisch, Koreanisch)` oder Rechts-nach-Links-Sprachen unterstützen kann.

source: The project settings allow you to tune pseudolocalization behavior, so that you can disable parts of it if desired.
de: In den Projekteinstellungen können Sie das Verhalten der Pseudolokalisierung anpassen, so dass Sie bei Bedarf Teile davon deaktivieren können.

source: Godot has a server handling low-level translation management called the :ref:`TranslationServer <class_TranslationServer>`. Translations can be added or removed during run-time; the current language can also be changed at run-time.
de: Godot verfügt über einen Server für die Low-Level-Verwaltung von Übersetzungen, den :ref:`TranslationServer <class_TranslationServer>`. Übersetzungen können während der Laufzeit hinzugefügt oder entfernt werden; die aktuelle Sprache kann auch während der Laufzeit geändert werden.

source: Bidirectional text and UI Mirroring
de: Bidirektionaler Text und UI-Spiegelung

source: Arabic and Hebrew are written from right to left (except for the numbers and Latin words mixed in), and the user interface for these languages should be mirrored as well. In some languages the shape of a glyph changes depending on the surrounding characters.
de: Arabisch und Hebräisch werden von rechts nach links geschrieben (mit Ausnahme der Zahlen und der lateinischen Wörter), und die Benutzeroberfläche für diese Sprachen sollte ebenfalls spiegelverkehrt sein. In einigen Sprachen ändert sich die Form einer Glyphe in Abhängigkeit von den umgebenden Zeichen.

source: Support for bidirectional writing systems and UI mirroring is transparent, you don't usually need to change anything or have any knowledge of the specific writing system.
de: Die Unterstützung für bidirektionale Schreibsysteme und die Spiegelung der Benutzeroberfläche ist transparent, Sie müssen in der Regel nichts ändern und keine Kenntnisse über das jeweilige Schreibsystem haben.

source: For RTL languages, Godot will automatically do the following changes to the UI:
de: Für RTL-Sprachen wird Godot automatisch die folgenden Änderungen an der Benutzeroberfläche vornehmen:

source: Mirrors left/right anchors and margins.
de: Spiegelt linke/rechte Anker und Seitenränder.

source: Swaps left and right text alignment.
de: Vertauscht die linke und rechte Textausrichtung.

source: Mirrors horizontal order of the child controls in the containers, and items in Tree/ItemList controls.
de: Spiegelt die horizontale Reihenfolge der untergeordneten Steuerelemente in den Containern und der Elemente in Tree/ItemList-Controls.

source: Uses mirrored order of the internal control elements (e.g. OptionButton dropdown button, checkbox alignment, List column order, Tree item icons and connecting line alignment, e.t.c.), in some cases mirrored controls use separate theme styles.
de: Verwendet eine gespiegelte Reihenfolge der internen Control-Elemente (z.B. OptionButton Dropdown-Button, Ausrichtung der Checkboxen, Reihenfolge der Listenspalten, Symbole für Baumelemente und Ausrichtung der Verbindungslinien, usw.), in einigen Fällen verwenden gespiegelte Steuerelemente separate Theme-Stile.

source: Coordinate system is not mirrored, and non-UI nodes (sprites, e.t.c) are not affected.
de: Das Koordinatensystem wird nicht gespiegelt, und Nicht-UI-Nodes (Sprites usw.) sind davon nicht betroffen.

source: It is possible to override text and control layout direction by using the following control properties:
de: Es ist möglich, die Richtung des Textes und der Controls mit Hilfe der folgenden Control-Propertys außer Kraft zu setzen:

source: ``text_direction``, sets the base text direction. When set to "auto", direction depends on the first strong directional character in the text according to the Unicode Bidirectional Algorithm,
de: ``text_direction``, legt die Grundrichtung des Textes fest. Wenn es auf "auto" gesetzt ist, hängt die Richtung vom ersten starken Richtungszeichen im Text gemäß dem Unicode Bidirectional Algorithm ab,

source: ``language``, overrides current project locale.
de: ``language``, überschreibt das aktuelle Gebietsschema des Projekts.

source: ``structured_text_bidi_override`` property and ``_structured_text_parser`` callback, enables special handling for structured text.
de: ``structured_text_bidi_override``-Property und ``_structured_text_parser``-Callback, ermöglicht eine spezielle Behandlung von strukturiertem Text.

source: ``layout_direction``, overrides control mirroring.
de: ``layout_direction``, setzt die Spiegelung des Controls außer Kraft.

source: You can see how right-to-left typesetting works in action using the `BiDI and Font Features demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
de: Wie der Rechts-nach-Links-Schriftsatz in der Praxis funktioniert, können Sie anhand des `BiDI and Font Features-Demoprojekts <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__ sehen.

source: Adding break iterator data to exported project
de: Hinzufügen von Zeilenumbruch-Iterator-Daten zum exportierten Projekt

source: Some languages are written without spaces, and word and line breaking requires more than rules over character sequences. Godot includes ICU rule and dictionary based, break iterator data, but this data is not included into exported projects by default. To include it go to **Project → Project Settings → Localization → Text Server Data** and click **Install support data...**. Break iterator data is about 4 MB large.
de: Einige Sprachen werden ohne Leerzeichen geschrieben, und Wort- sowie Zeilenumbruch erfordert mehr als nur Regeln über Zeichenfolgen. Godot enthält ICU-Regeln und wörterbuchbasierte Zeilenumbruch-Iterator-Daten, aber diese Daten sind nicht standardmäßig in exportierten Projekten enthalten. Um sie einzubeziehen, gehen Sie zu **Projekt → Projekteinstellungen → Lokalisierung → Textserverdaten** und klicken Sie auf **Unterstützungsdaten installieren...**. Die Zeilenumbruch-Iterator-Daten sind etwa 4 MB groß.

source: Structured text BiDi override
de: Strukturierter Text BiDi-Überschreibung

source: Unicode BiDi algorithm is designed to work with natural text and it's incapable of handling text with the higher level order, like file names, URIs, email addresses, regular expressions or source code.
de: Der Unicode-BiDi-Algorithmus wurde für die Arbeit mit natürlichem Text entwickelt und ist nicht in der Lage, Text mit höherer Ordnung, wie Dateinamen, URIs, E-Mail-Adressen, reguläre Ausdrücke oder Quellcode zu verarbeiten.

source: For example, the path for this shown directory structure will be displayed incorrectly (top "LineEdit" control). "File" type structured text override splits text into segments, then BiDi algorithm is applied to each of them individually to correctly display directory names in any language and preserve correct order of the folders (bottom "LineEdit" control).
de: Zum Beispiel wird der Pfad für diese angezeigte Verzeichnisstruktur nicht korrekt angezeigt (oberes "LineEdit"-Control). Die Überschreibung des Typs "Datei" für strukturierten Text teilt den Text in Segmente auf und wendet dann den BiDi-Algorithmus auf jedes dieser Segmente einzeln an, um die Verzeichnisnamen in jeder Sprache korrekt anzuzeigen und die richtige Reihenfolge der Ordner beizubehalten (unteres Steuerelement "LineEdit").

source: Custom callbacks provide a way to override BiDi for the other types of structured text.
de: Benutzerdefinierte Callbacks bieten eine Möglichkeit, BiDi für die anderen Arten von strukturiertem Text außer Kraft zu setzen.

source: Localizing numbers
de: Lokalisierung von Zahlen
