Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: de

source: Controls specifically designed for number input or output (e.g. ProgressBar, SpinBox) will use localized numbering system automatically, for the other control :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` can be used to convert Western Arabic numbers (0..9) to the localized numbering system and :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>` to convert it back.
de: Controls, die speziell für die Eingabe oder Ausgabe von Zahlen entwickelt wurden (z.B. ProgressBar, SpinBox), verwenden automatisch das lokalisierte Zahlensystem, für andere Controls kann :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` verwendet werden, um westarabische Zahlen (0..9) in das lokalisierte Zahlensystem zu konvertieren und :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>`, um sie zurück zu konvertieren.

source: Localizing icons and images
de: Lokalisierung von Icons und Bildern

source: Icons with left and right pointing arrows which may need to be reversed for Arabic and Hebrew locales, in case they indicate movement or direction (e.g. back/forward buttons). Otherwise, they can remain the same.
de: Symbole mit nach links und rechts zeigenden Pfeilen, die für arabische und hebräische Sprachumgebungen möglicherweise umgekehrt werden müssen, falls sie eine Bewegung oder eine Richtung anzeigen (z. B. Vor-/Zurück-Tasten). Ansonsten können sie gleich bleiben.

source: Testing translations
de: Testen von Übersetzungen

source: You may want to test a project's translation before releasing it. Godot provides two ways to do this.
de: Vielleicht möchten Sie die Übersetzung eines Projekts testen, bevor Sie sie freigeben. Godot bietet zwei Möglichkeiten, dies zu tun.

source: First, in the Project Settings, under **Internationalization > Locale** (with advanced settings enabled), there is a **Test** property. Set this property to the locale code of the language you want to test. Godot will run the project with that locale when the project is run (either from the editor or when exported).
de: Zunächst gibt es in den Projekteinstellungen unter **Internationalisierung > Gebietsschema** (bei aktivierten erweiterten Einstellungen) die Property **Test**. Setzen Sie diese Property auf den Gebietsschema-Code der Sprache, die Sie testen möchten. Godot führt das Projekt mit diesem Gebietsschema aus, wenn das Projekt ausgeführt wird (entweder vom Editor aus oder beim Exportieren).

source: Keep in mind that since this is a project setting, it will show up in version control when it is set to a non-empty value. Therefore, it should be set back to an empty value before committing changes to version control.
de: Beachten Sie, dass es sich hierbei um eine Projekteinstellung handelt, die in der Versionsverwaltung angezeigt wird, wenn sie auf einen nicht leeren Wert gesetzt ist. Daher sollte sie auf einen leeren Wert zurückgesetzt werden, bevor Änderungen in die Versionsverwaltung übertragen werden.

source: Translations can also be tested when :ref:`running Godot from the command line <doc_command_line_tutorial>`. For example, to test a game in French, the following argument can be supplied:
de: Übersetzungen können auch getestet werden, wenn :ref:`Godot von der Kommandozeile aus starten <doc_command_line_tutorial>`. Um zum Beispiel ein Spiel auf Französisch zu testen, kann das folgende Argument angegeben werden:

source: Translating the project name
de: Übersetzen des Projektnamens

source: The project name becomes the app name when exporting to different operating systems and platforms. To specify the project name in more than one language, create a new setting ``application/name`` in the **Project Settings** and append the locale identifier to it. For instance, for Spanish, this would be ``application/name_es``:
de: Der Projektname wird beim Export auf verschiedene Betriebssysteme und Plattformen zum Namen der Anwendung. Um den Projektnamen in mehr als einer Sprache anzugeben, erstellen Sie eine neue Einstellung ``Anwendung/Name`` in den **Projekteinstellungen** und fügen Sie den Gebietsschema-Bezeichner daran an. Für Spanisch wäre dies zum Beispiel ``application/name_es``:

source: If you are unsure about the language code to use, refer to the :ref:`list of locale codes <doc_locales>`.
de: Wenn Sie sich nicht sicher sind, welchen Sprachcode Sie verwenden sollen, sehen Sie in der :ref:`Liste der Gebietsschema-Codes <doc_locales>` nach.

source: Translation status
de: Übersetzungsstatus
