Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/localization_using_gettext.po
Languages: de, zh_tw

source: Localization using gettext
de: Lokalisierung mittels gettext
zh_tw: 使用 gettext 進行當地語系化

source: In addition to :ref:`doc_importing_translations` in CSV format, Godot also supports loading translation files written in the GNU gettext format (text-based ``.po`` and compiled ``.mo`` since Godot 4.0).
de: Zusätzlich zu :ref:`doc_importing_translations` im CSV-Format unterstützt Godot auch das Laden von Übersetzungsdateien, die im GNU gettext-Format geschrieben wurden (textbasierte ``.po`` und kompilierte ``.mo`` seit Godot 4.0).
zh_tw: 除了 CSV 格式的 :ref:`doc_importing_translations` 外，Godot 還支援載入 GNU gettext 格式的翻譯檔（基於文字的 ``.po``，Godot 3.5 起還支援編譯後的 ``.mo``）。

source: For an introduction to gettext, check out `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. It's written with C projects in mind, but much of the advice also applies to Godot (with the exception of ``xgettext``).
de: Eine Einführung in gettext finden Sie in `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. Es wurde mit Blick auf C-Projekte geschrieben, aber viele der Ratschläge gelten auch für Godot (mit Ausnahme von ``xgettext``).
zh_tw: 有關 gettext 的介紹，請查看 `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_。它是針對 C 專案編寫的，但是很多建議也適用於 Godot（除了 ``xgettext``）。

source: Advantages
de: Vorteile
zh_tw: 優勢

source: gettext is a standard format, which can be edited using any text editor or GUI editors such as `Poedit <https://poedit.net/>`_.
de: gettext ist ein Standardformat, dass mit jedem Texteditor oder GUI-Editor wie `Poedit <https://poedit.net/>`_ editiert werden kann.
zh_tw: gettext 是一種標準格式，可以使用任何文字編輯器或圖形化使用者介面編輯器（如 `Poedit <https://poedit.net/>`_）進行編輯。

source: gettext is supported by translation platforms such as `Transifex <https://www.transifex.com/>`_ and `Weblate <https://weblate.org/>`_, which makes it easier for people to collaborate to localization.
de: gettext wird von Übersetzungsplattformen wie `Transifex <https://www.transifex.com/>`_ und `Weblate <https://weblate.org/>`_ unterstützt, wodurch die Zusammenarbeit bei der Lokalisierung erleichtert wird.
zh_tw: `Transifex <https://www.transifex.com/>`_ 和 `Weblate <https://weblate.org/>`_ 等翻譯平臺也支援 gettext，讓人們可以更方便地進行當地語系化協作。

source: Compared to CSV, gettext works better with version control systems like Git, as each locale has its own messages file.
de: Im Vergleich zu CSV funktioniert gettext besser mit Versionsverwaltungssystemen wie Git, da jedes Gebietsschema seine eigene Übersetzungsdatei hat.
zh_tw: 與 CSV 相比，gettext 更適合 Git 這樣的版本控制系統，因為每個語言環境都有自己的消息檔。

source: Multiline strings are more convenient to edit in gettext files compared to CSV files.
de: Mehrzeilige Strings lassen sich in gettext-Dateien bequemer bearbeiten als in CSV-Dateien.
zh_tw: 與 CSV 檔相比，在 gettext 檔中編輯多行字串更方便。

source: Disadvantages
de: Nachteile
zh_tw: 缺點

source: gettext is a more complex format than CSV and can be harder to grasp for people new to software localization.
de: gettext ist ein komplexeres Format als CSV und kann für Personen, die neu in der Softwarelokalisierung sind, schwieriger zu verstehen sein.
zh_tw: gettext 是一種比 CSV 更複雜的格式，對於剛接觸軟體當地語系化的人來說可能更難理解。

source: People who maintain localization files will have to install gettext tools on their system. However, as Godot supports using text-based message files (``.po``), translators can test their work without having to install gettext tools.
de: Wer Lokalisierungsdateien pflegt, muss gettext-Tools auf seinem System installieren. Da Godot jedoch die Verwendung textbasierter Nachrichtendateien (``.po``) unterstützt, können Übersetzer ihre Arbeit testen, ohne gettext-Tools installieren zu müssen.
zh_tw: 維護當地語系化檔的人員必須在其系統上安裝 gettext 工具。但是，由於 Godot 支援使用基於文字的消息檔（``.po``），翻譯人員無需安裝 gettext 工具即可測試他們的工作。

source: Installing gettext tools
de: Installation der gettext-Tools
zh_tw: 安裝 gettext 工具

source: The command line gettext tools are required to perform maintenance operations, such as updating message files. Therefore, it's strongly recommended to install them.
de: Die gettext-Tools für die Kommandozeile sind erforderlich, um Wartungsarbeiten wie die Aktualisierung von Übersetzungsdateien durchzuführen. Es wird daher dringend empfohlen, sie zu installieren.
zh_tw: 需要命令列 gettext 工具來執行維護操作，如更新消息檔。因此，強烈建議您安裝它們。

source: **Windows:** Download an installer from `this page <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Any architecture and binary type (shared or static) works; if in doubt, choose the 64-bit static installer.
de: **Windows:** Laden Sie ein Installationsprogramm von `dieser Seite <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_ herunter. Jede Architektur und jeder Binärtyp (dynamisch oder statisch) funktioniert; im Zweifelsfall wählen Sie das statische 64-Bit-Installationsprogramm.
zh_tw: **Windows：**從`該頁面 <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_下載安裝程式。任何體系結構和二進位型別（共用或靜態）都可以；如果不確定，請選擇 64 位元靜態安裝程式。

source: **macOS:** Install gettext either using `Homebrew <https://brew.sh/>`_ with the ``brew install gettext`` command, or using `MacPorts <https://www.macports.org/>`_ with the ``sudo port install gettext`` command.
de: **macOS:** Installieren Sie gettext entweder über `Homebrew <https://brew.sh/>`_ mit dem Befehl ``brew install gettext``, oder über `MacPorts <https://www.macports.org/>`_ mit dem Befehl ``sudo port install gettext``.
zh_tw: **macOS：**使用 `Homebrew <https://brew.sh/>`_ 的 ``brew install gettext`` 命令來安裝 gettext，或使用 `MacPorts <https://www.macports.org/>`_ 的 ``sudo port install gettext`` 命令來安裝。

source: **Linux:** On most distributions, install the ``gettext`` package from your distribution's package manager.
de: **Linux:** Bei den meisten Distributionen installieren Sie das Paket ``gettext`` über den Paketmanager Ihrer Distribution.
zh_tw: **Linux：**在大多數發行版本上，請使用發行版本的包管理器安裝 ``gettext`` 包。

source: Creating the PO template
de: Erstellen der PO-Vorlage
zh_tw: 放置樣板

source: Automatic generation using the editor
de: Automatische Generierung über den Editor
zh_tw: 執行編輯器

source: Open the Project Settings' **Localization > POT Generation** tab, then use the **Add…** button to specify the path to your project's scenes and scripts that contain localizable strings:
de: Öffnen Sie in den Projekteinstellungen das Tab **Lokalisierung > POT-Generierung** und verwenden Sie den Button **Hinzufügen...**, um den Pfad zu den Szenen und Skripten Ihres Projekts anzugeben, die lokalisierbare Strings enthalten:
zh_tw: 打開專案設定的**當地語系化 > POT 生成**分頁，然後使用**新增...** 按鈕指定專案中包含可當地語系化字串的場景和腳本的路徑：

source: Creating a PO template in the Localization > POT Generation tab of the Project Settings
de: Erstellen einer PO-Vorlage auf dem Tab Lokalisierung > POT-Generierung in den Projekteinstellungen
zh_tw: 在專案設定的“當地語系化 > POT 生成”分頁中建立 PO 範本

source: Creating a PO template in the **Localization > POT Generation** tab of the Project Settings
de: Erstellen einer PO-Vorlage auf dem Tab **Lokalisierung > POT-Generierung** der Projekteinstellungen
zh_tw: 在專案設定的**當地語系化 > POT 生成**分頁中建立 PO 範本

source: After adding at least one scene or script, click **Generate POT** in the top-right corner, then specify the path to the output file. This file can be placed anywhere in the project directory, but it's recommended to keep it in a subdirectory such as ``locale``, as each locale will be defined in its own file.
de: Nachdem Sie mindestens eine Szene oder ein Skript hinzugefügt haben, klicken Sie auf **POT Erstellen** in der oberen rechten Ecke und geben dann den Pfad zur Ausgabedatei an. Diese Datei kann an beliebiger Stelle im Projektverzeichnis abgelegt werden, aber es wird empfohlen, sie in einem Unterverzeichnis wie ``locale`` abzulegen, da jedes Gebietsschema in einer eigenen Datei definiert wird.
zh_tw: Godot目前不支援使用 ``xgettext`` 提取源字串, 因此必須手動建立 ``.pot`` 檔案. 該檔可以放在專案目錄中的任何位置, 但建議將其放在子目錄中, 因為每個語言環境都將在其自己的檔中定義.

source: You can then move over to :ref:`creating a messages file from a PO template <doc_localization_using_gettext_messages_file>`.
de: Sie können dann zu :ref:`Erstellung einer Nachrichtendatei aus einer PO-Vorlage <doc_localization_using_gettext_messages_file>` übergehen.
zh_tw: 然後，您可以繼續從 PO 範本 <doc_localization_using_gettext_messages_file> 建立訊息檔案。

source: Remember to regenerate the PO template after making any changes to localizable strings, or after adding new scenes or scripts. Otherwise, newly added strings will not be localizable and translators won't be able to update translations for outdated strings.
de: Denken Sie daran, die PO-Vorlage neu zu generieren, nachdem Sie Änderungen an lokalisierbaren Strings vorgenommen oder neue Szenen oder Skripte hinzugefügt haben. Andernfalls werden neu hinzugefügte Strings nicht lokalisierbar sein und Übersetzer werden nicht in der Lage sein, Übersetzungen für veraltete Strings zu aktualisieren.
zh_tw: 請記住在對可本地化字串進行任何更改或新增新場景或腳本後重新生成 PO 模板。否則，新新增的字串將無法在地化，且翻譯人員將無法更新過時字串的翻譯。

source: Manual creation
de: Manuelle Erstellung
zh_tw: 手動使用

source: If the automatic generation approach doesn't work out for your needs, you can create a PO template by hand in a text editor. This file can be placed anywhere in the project directory, but it's recommended to keep it in a subdirectory, as each locale will be defined in its own file.
de: Wenn die automatische Generierung für Ihre Bedürfnisse nicht geeignet ist, können Sie eine PO-Vorlage von Hand in einem Texteditor erstellen. Diese Datei kann an beliebiger Stelle im Projektverzeichnis abgelegt werden, aber es wird empfohlen, sie in einem Unterverzeichnis zu speichern, da jedes Gebietsschema in einer eigenen Datei definiert wird.
zh_tw: Godot目前不支援使用 ``xgettext`` 提取源字串, 因此必須手動建立 ``.pot`` 檔案. 該檔可以放在專案目錄中的任何位置, 但建議將其放在子目錄中, 因為每個語言環境都將在其自己的檔中定義.

source: Create a directory named ``locale`` in the project directory. In this directory, save a file named ``messages.pot`` with the following contents:
de: Erstellen Sie ein Verzeichnis namens ``locale`` im Projektverzeichnis. Speichern Sie in diesem Verzeichnis eine Datei namens ``messages.pot`` mit folgendem Inhalt:
zh_tw: 在工程目錄下建立名為 `locale` 的目錄. 在該目錄下, 保存一個名為 ``messages.pot`` 的檔, 內容如下:

source: Messages in gettext are made of ``msgid`` and ``msgstr`` pairs. ``msgid`` is the source string (usually in English), ``msgstr`` will be the translated string.
de: Nachrichten in gettext werden aus ``msgid`` und ``msgstr``-Paaren gebildet. ``msgid`` ist der Quellstring (normalerweise in Englisch), ``msgstr`` ist der übersetzte String.
zh_tw: gettext 中的消息由 ``msgid`` 和 ``msgstr`` 對組成。``msgid`` 為源字串（一般為英文），``msgstr`` 為翻譯後的字串。

source: The ``msgstr`` value in PO template files (``.pot``) should **always** be empty. Localization will be done in the generated ``.po`` files instead.
de: Der Wert ``msgstr`` in PO-Vorlagendateien (``.pot``) sollte **immer** leer sein. Die Lokalisierung wird stattdessen in den erzeugten ``.po``-Dateien durchgeführt.
zh_tw: PO 範本檔（``.pot``）中的 ``msgstr`` 值應**始終**為空。當地語系化會在生成的 ``.po`` 檔中進行。

source: Creating a messages file from a PO template
de: Erstellen einer Übersetzungsdatei aus einer PO-Vorlage
zh_tw: 從 PO 範本建立消息檔

source: The ``msginit`` command is used to turn a PO template into a messages file. For instance, to create a French localization file, use the following command while in the ``locale`` directory:
de: Der Befehl ``msginit`` wird verwendet, um eine PO-Vorlage in eine Übersetzungsdatei zu verwandeln. Um zum Beispiel eine französische Lokalisierungsdatei zu erstellen, verwenden Sie den folgenden Befehl im Verzeichnis ``locale``:
zh_tw: ``msginit`` 命令用於將 PO 範本轉換為消息檔。例如，要建立法語當地語系化檔，請在 ``locale`` 目錄中使用以下命令：

source: The command above will create a file named ``fr.po`` in the same directory as the PO template.
de: Der obige Befehl erzeugt eine Datei namens ``fr.po`` im selben Verzeichnis wie die PO-Vorlage.
zh_tw: 上面的命令會在 PO 範本所在的目錄下建立一個名為 ``fr.po`` 的檔案。

source: Alternatively, you can do that graphically using Poedit, or by uploading the POT file to your web platform of choice.
de: Alternativ können Sie dies auch grafisch mit Poedit erledigen oder die POT-Datei auf die Webplattform Ihrer Wahl hochladen.
zh_tw: 或者，您可以使用 Poedit 以圖形方式完成此操作，或者通過將 POT 檔上傳到您選擇的 Web 平臺。

source: Loading a messages file in Godot
de: Laden einer Übersetzungsdatei in Godot
zh_tw: 在 Godot 中載入消息檔

source: To register a messages file as a translation in a project, open the **Project Settings**, then go to the **Localization** tab. In **Translations**, click **Add…** then choose the ``.po`` or ``.mo`` file in the file dialog. The locale will be inferred from the ``"Language: <code>\n"`` property in the messages file.
de: Um eine Übersetzungsdatei als Übersetzung in einem Projekt zu registrieren, öffnen Sie die **Projekteinstellungen** und gehen Sie dann auf den Tab **Lokalisierung**. In **Übersetzungen**, klicken Sie auf **Hinzufügen...** und wählen Sie die Datei ``.po`` oder ``.mo`` im Dateidialog. Das Gebietsschema wird aus der ``"Sprache: <code>\n"``-Property in der Übersetzungsdatei abgeleitet.
zh_tw: 如果要將消息檔註冊為專案的翻譯，請打開\ **項目設置**\ ，然後進入\ **本地化**\ 選項卡。在\ **翻譯**\ 中按下\ **添加...**\ ，然後在文件對話框中選擇該 ''.po'' 或者 ''.mo'' 檔。區域設置將從消息檔的 ''“Language： <code>\n”'' 屬性中推算出來。

source: See :ref:`doc_internationalizing_games` for more information on importing and testing translations in Godot.
de: Weitere Informationen zum Importieren und Testen von Übersetzungen in Godot finden Sie unter :ref:`doc_internationalizing_games`.
zh_tw: 關於在 Godot 中匯入和測試翻譯的更多資訊，請參閱 :ref:`doc_internationalizing_games`。

source: Updating message files to follow the PO template
de: Aktualisieren der Übersetzungsdateien, um der PO-Vorlage zu folgen
zh_tw: 按照 PO 範本更新消息檔

source: After updating the PO template, you will have to update message files so that they contain new strings, while removing strings that are no longer present in the PO template. This can be done automatically using the ``msgmerge`` tool:
de: Nach der Aktualisierung der PO-Vorlage müssen Sie die Übersetzungsdateien so aktualisieren, dass sie neue Strings enthalten, und gleichzeitig Strings entfernen, die in der PO-Vorlage nicht mehr vorhanden sind. Dies kann automatisch mit dem Tool ``msgmerge`` geschehen:
zh_tw: 更新 PO 範本後，您必須更新消息檔以使其包含新字串，同時刪除已經在 PO 範本中不復存在的字串。這可以使用 ``msgmerge`` 工具自動完成：

source: If you want to keep a backup of the original message file (which would be saved as ``fr.po~`` in this example), remove the ``--backup=none`` argument.
de: Wenn Sie eine Sicherungskopie der ursprünglichen Übersetzungsdatei behalten wollen (die in diesem Beispiel als ``fr.po~`` gespeichert würde), entfernen Sie das Argument ``--backup=none``.
zh_tw: 如果你想保留原始消息檔的備份，在本例中會保存為 ``fr.po~`` ，請刪除 ``--backup=none`` 參數。

source: After running ``msgmerge``, strings which were modified in the source language will have a "fuzzy" comment added before them in the ``.po`` file. This comment denotes that the translation should be updated to match the new source string, as the translation will most likely be inaccurate until it's updated.
de: Nach der Ausführung von ``msgmerge`` werden Strings, die in der Ausgangssprache geändert wurden, in der Datei ``.po`` mit einem "fuzzy"-Kommentar versehen. Dieser Kommentar zeigt an, dass die Übersetzung aktualisiert werden sollte, um mit dem neuen Quellstring übereinzustimmen, da die Übersetzung höchstwahrscheinlich ungenau sein wird, bis sie aktualisiert ist.
zh_tw: 運作 ``msgmerge`` 後，如果來源語言修改了某個字串，那麼在 ``.po`` 檔中就會在這個字串之前加入“fuzzy”注釋。這個注釋表示的是翻譯應當針對新字串進行更新，因為現有翻譯非常可能是不精確的。

source: Strings with "fuzzy" comments will **not** be read by Godot until the translation is updated and the "fuzzy" comment is removed.
de: Strings mit ""fuzzy"-Kommentaren werden **nicht** von Godot gelesen, bis die Übersetzung aktualisiert und der "fuzzy"-Kommentar entfernt wurde.
zh_tw: Godot **不會**讀取帶有“fuzzy”注釋的字串，需要更新翻譯並移除“fuzzy”注釋才行。

source: Checking the validity of a PO file or template
de: Überprüfen der Gültigkeit einer PO-Datei oder -Vorlage
zh_tw: 檢查 PO 檔或範本的有效性

source: It is possible to check whether a gettext file's syntax is valid by running the command below:
de: Sie können überprüfen, ob die Syntax einer gettext-Datei gültig ist, indem Sie den folgenden Befehl ausführen:
zh_tw: 可以通過運作以下命令來檢查 gettext 檔的語法是否有效：

source: If there are syntax errors or warnings, they will be displayed in the console. Otherwise, ``msgfmt`` won't output anything.
de: Wenn es Syntaxfehler oder Warnungen gibt, werden sie in der Konsole angezeigt. Ansonsten wird ``msgfmt`` nichts ausgeben.
zh_tw: 如果有語法錯誤或警告，他們將顯示在控制台。否則，``msgfmt`` 不會輸出任何東西。

source: Using binary MO files (useful for large projects only)
de: Verwendung von binären MO-Dateien (nur bei großen Projekten sinnvoll)
zh_tw: 使用二進位 MO 檔（僅適用於大型專案）

source: For large projects with several thousands of strings to translate or more, it can be worth it to use binary (compiled) MO message files instead of text-based PO files. Binary MO files are smaller and faster to read than the equivalent PO files.
de: Bei großen Projekten mit mehreren Tausend oder mehr zu übersetzenden Strings kann es sich lohnen, binäre (kompilierte) MO-Übersetzungsdateien anstelle von textbasierten PO-Dateien zu verwenden. Binäre MO-Dateien sind kleiner und schneller zu lesen als die entsprechenden PO-Dateien.
zh_tw: 大型專案會有成千上萬的字串要翻譯，相比於基於文字的 PO 檔，使用（編譯為）二進位的 MO 消息檔可能更加划算。二進位 MO 檔比對應的 PO 檔更小、讀起來更快。

source: You can generate a MO file with the command below:
de: Sie können eine MO-Datei mit dem folgenden Befehl erzeugen:
zh_tw: 你可以使用下面的命令生成 MO 檔：

source: If the PO file is valid, this command will create a ``fr.mo`` file besides the PO file. This MO file can then be loaded in Godot as described above.
de: Wenn die PO-Datei gültig ist, erzeugt dieser Befehl neben der PO-Datei eine ``fr.mo``-Datei. Diese MO-Datei kann dann wie oben beschrieben in Godot geladen werden.
zh_tw: 如果這個 PO 檔是有效的，這個命令就會在 PO 檔的旁邊建立一個 ``fr.mo`` 檔案。這個 MO 檔可以按照下文的方法載入進 Godot。

source: The original PO file should be kept in version control so you can update your translation in the future. In case you lose the original PO file and wish to decompile a MO file into a text-based PO file, you can do so with:
de: Die ursprüngliche PO-Datei sollte in der Versionsverwaltung aufbewahrt werden, damit Sie Ihre Übersetzung in Zukunft aktualisieren können. Falls Sie die ursprüngliche PO-Datei verlieren und eine MO-Datei in eine textbasierte PO-Datei dekompilieren möchten, können Sie dies mit tun:
zh_tw: 應該在版本控制中保留原始 PO 檔，這樣以後就可以更新翻譯。如果你丟失了原始的 PO 檔，希望將 MO 檔反編譯為基於文字的 PO 檔，你可以這樣做：

source: The decompiled file will not include comments or fuzzy strings, as these are never compiled in the MO file in the first place.
de: Die dekompilierte Datei enthält keine Kommentare oder Fuzzy-Strings, da diese in der MO-Datei gar nicht erst kompiliert werden.
zh_tw: 反編譯出的檔不包含注釋和模糊字串，因為它們一開始就沒有編譯進 MO 檔裡。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
