Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/file_formats/tscn.po
Languages: de, zh_tw

source: TSCN file format
de: TSCN Dateiformat
zh_tw: TSCN 檔案格式

source: The TSCN (text scene) file format represents a single scene tree inside Godot. Unlike binary SCN files, TSCN files have the advantage of being mostly human-readable and easy for version control systems to manage.
de: Das TSCN-Dateiformat (Text Scene) stellt einen einzelnen Szenenbaum innerhalb von Godot dar. Im Gegensatz zu binären SCN-Dateien haben TSCN-Dateien den Vorteil, dass sie größtenteils für Menschen lesbar und für Versionskontrollsysteme leicht zu verwalten sind.
zh_tw: TSCN (Text SCeNe) 檔案格式代表 Godot 內的單一節點樹。TSCN 檔具有人類可讀取且適合用於版本控制系統的特點。匯出時，TSCN 檔會被編譯為保存在 .import 資料夾內的二進位格式 ``.scn`` 檔，以減少資料大小並加速載入。

source: The ESCN (exported scene) file format is identical to the TSCN file format, but is used to indicate to Godot that the file has been exported from another program and should not be edited by the user from within Godot. Unlike SCN and TSCN files, during import, ESCN files are compiled to binary SCN files stored inside the ``.godot/imported/`` folder. This reduces the data size and speeds up loading, as binary formats are faster to load compared to text-based formats.
de: Das ESCN-Dateiformat (exportierte Szene) ist identisch mit dem TSCN-Dateiformat, wird aber verwendet, um Godot anzuzeigen, dass die Datei aus einem anderen Programm exportiert wurde und vom Benutzer nicht innerhalb von Godot bearbeitet werden sollte. Im Gegensatz zu SCN- und TSCN-Dateien werden ESCN-Dateien beim Import zu binären SCN-Dateien kompiliert, die im Ordner ``.godot/imported/`` gespeichert werden. Dadurch wird die Datengröße verringert und das Laden beschleunigt, da Binärformate im Vergleich zu textbasierten Formaten schneller geladen werden können.
zh_tw: ESCN (Exported SCeNe) 的檔案格式與 TSCN 檔案格式完全相容，但對 Godot 來說則表示該檔案是從另一個程式匯出的，且無法從 Godot 內進行編輯。

source: To make files more compact, properties equal to the default value are not stored in scene/resource files. It is possible to write them manually, but they will be discarded when saving the file.
de: Um die Dateien kompakter zu machen, werden Propertys, die dem Defaultwert entsprechen, nicht in Szenen-/Ressourcendateien gespeichert. Es ist möglich, sie manuell zu schreiben, aber sie werden beim Speichern der Datei verworfen.
zh_tw: 為了使檔案更加緊湊，等於預設值的屬性不會儲存在場景/資源檔案中。可以手動寫入它們，但在儲存檔案時它們將被丟棄。

source: For those looking for a complete description, the parsing is handled in the file `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ in the ``ResourceFormatLoaderText`` class.
de: Für diejenigen, die eine vollständige Beschreibung suchen, wird das Parsen in der Datei `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ in der Klasse ``ResourceFormatLoaderText`` behandelt.
zh_tw: 若需要完整的說明，請參考 ``ResourceFormatLoaderText`` 中負責剖析該格式的 `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ 檔案。

source: The scene and resource file formats have changed significantly in Godot 4, with the introduction of string-based UIDs to replace incremental integer IDs.
de: Die Formate der Szenen- und Ressourcendateien haben sich in Godot 4 mit der Einführung von stringbasierten UIDs, den Nachfolgern der inkrementellen Integer-IDs, erheblich geändert.
zh_tw: Godot 4 中的場景和資源檔案格式發生了顯著變化，引入了基於字串的 UID 來取代差異量整數 ID。

source: Mesh, skeleton and animation data is also stored differently compared to Godot 3. You can read about some of the changes in this article: `Animation data rework for 4.0 <https://godotengine.org/article/animation-data-redesign-40/>`__
de: Mesh-, Skelett- und Animationsdaten werden im Vergleich zu Godot 3 auch anders gespeichert. Sie können einige der Änderungen in diesem Artikel nachlesen: `Animationsdaten-Überarbeitung für 4.0 <https://godotengine.org/article/animation-data-redesign-40/>`__
zh_tw: 與Godot 3 相比，網格、骨架和動畫資料的儲存方式也有所不同。您可以閱讀本文中的一些變更：「4.0 的動畫資料返工<https://godotengine.org/article/animation-data- redesign- 40/>`__

source: Scenes and resources saved with Godot 4.x contain ``format=3`` in their header, whereas Godot 3.x uses ``format=2`` instead.
de: Szenen und Ressourcen, die mit Godot 4.x gespeichert werden, enthalten ``format=3`` in ihrem Header, während Godot 3.x stattdessen ``format=2`` verwendet.
zh_tw: 使用 Godot 4.x 儲存的場景和資源在其標頭中包含“format=3”，而 Godot 3.x 使用“format=2”代替。

source: File structure
de: Dateistruktur
zh_tw: 檔案結構

source: There are five main sections inside the TSCN file:
de: Es gibt 5 Hauptblöcke innerhalb der TSCN Datei:
zh_tw: 在 TSCN 檔中主要有五個區塊：

source: File descriptor
de: Datei-Deskriptor
zh_tw: 檔案描述元

source: External resources
de: Externe Quellen
zh_tw: 外部資源

source: Internal resources
de: Interne Quellen
zh_tw: 內部資源

source: Nodes
zh_tw: 節點

source: Connections
de: Verbindungen
zh_tw: 連接

source: The file descriptor looks like ``[gd_scene load_steps=4 format=3 uid="uid://cecaux1sm7mo0"]`` and should be the first entry in the file. The ``load_steps`` parameter is equal to the total amount of resources (internal and external) plus one (for the file itself). If the file has no resources, ``load_steps`` is omitted. The engine will still load the file correctly if ``load_steps`` is incorrect, but this will affect loading bars and any other piece of code relying on that value.
de: Der Dateideskriptor sieht aus wie ``[gd_scene load_steps=4 format=3 uid="uid://cecaux1sm7mo0"]`` und sollte der erste Eintrag in der Datei sein. Der Parameter ``load_steps`` ist gleich der Gesamtmenge der Ressourcen (intern und extern) plus eins (für die Datei selbst). Wenn die Datei keine Ressourcen hat, wird ``load_steps`` weggelassen. Die Engine wird die Datei trotzdem korrekt laden, wenn ``load_steps`` nicht korrekt ist, aber dies wird sich auf die Ladebalken und jedes andere Stück Code auswirken, das auf diesen Wert angewiesen ist.
zh_tw: 檔案描述資源類似 ``[gd_scene load_steps=1 format=2]`` ，且應放在檔案的最前面。``load_steps`` 參數 (理論上) 應為該檔案內含資源的數量。但，實務上，該值為多少應該無影響。

source: ``uid`` is an unique string-based identifier representing the scene. This is used by the engine to track files that are moved around, even while the editor is closed. Scripts can also load UID-based resources using the ``uid://`` path prefix to avoid relying on filesystem paths. This makes it possible to move around a file in the project, but still be able to load it in scripts without having to modify the script. Godot does not use external files to keep track of IDs, which means no central metadata storage location is required within the project. See `this pull request <https://github.com/godotengine/godot/pull/50786>`__ for detailed information.
de: ``uid`` ist ein eindeutiger stringbasierter Bezeichner, der die Szene repräsentiert. Sie wird von der Engine verwendet, um Dateien zu tracken, die verschoben werden, auch wenn der Editor geschlossen ist. Skripte können UID-basierte Ressourcen auch mit dem ``uid://`` Pfadpräfix laden, um von Dateisystempfade unabhängig zu sein. Dadurch ist es möglich, eine Datei im Projekt zu verschieben, sie aber trotzdem in Skripten zu laden, ohne das Skript ändern zu müssen. Godot verwendet keine externen Dateien, um die IDs zu verfolgen, was bedeutet, dass kein zentraler Speicherort für Metadaten innerhalb des Projekts erforderlich ist. Siehe `diesen Pull Request <https://github.com/godotengine/godot/pull/50786>`__ für detaillierte Informationen.
zh_tw: ``uid`` 是代表場景的基於字串的唯一識別碼。引擎使用它來追蹤移動的檔案，即使編輯器關閉時也是如此。腳本還可以使用「uid://」路徑前綴來載入基於 UID 的資源，以避免依賴檔案系統路徑。這使得可以在專案中移動檔案，但仍然能夠在腳本中加載它，而無需修改腳本。 Godot 不使用外部檔案來追蹤 ID，這意味著專案內不需要中央元資料儲存位置。有關詳細信息，請參閱“此拉取請求 <https://github.com/godotengine/godot/pull/50786>”。

source: These sections should appear in order, but it can be hard to distinguish them. The only difference between them is the first element in the heading for all of the items in the section. For example, the heading of all external resources should start with ``[ext_resource ...]``.
de: Diese Abschnitte sollten der Reihe nach erscheinen, aber sie sind möglicherweise schwer voneinader zu unterscheiden. Der einzige Unterschied zwischen ihnen ist das erste Element in der Überschrift für alle Elemente des Abschnitts. Zum Beispiel sollte die Überschrift aller externen Ressourcen mit ``[ext_resource ...]`` beginnen.
zh_tw: 這些區塊應照會順序排列，但要區分出各個段落可能有點困難。在這些區塊間的主要差異就是各個段落中所有專案標題的第一項元素。舉例來說，所有外部資源的標題都應以 ``[ext_resource ......]`` 開頭。

source: A TSCN file may contain single-line comments starting with a semicolon (``;``). However, comments will be discarded when saving the file using the Godot editor. Whitespace within a TSCN file is not significant (except within strings), but extraneous whitespace will be discarded when saving the file.
de: Eine TSCN-Datei kann einzeilige Kommentare enthalten, die mit einem Semikolon (``;``) beginnen. Kommentare werden jedoch beim Speichern der Datei mit dem Godot-Editor verworfen. Leerzeichen innerhalb einer TSCN-Datei sind nicht von Bedeutung (außer innerhalb von Zeichenketten), aber überflüssige Leerzeichen werden beim Speichern der Datei verworfen.
zh_tw: TSCN 檔案可以包含以分號 (``;``) 開頭的單行註解。但，以 Godot 編輯器保存時會移除註解。

source: Entries inside the file
de: Einträge innerhalb der Datei
zh_tw: 檔案內的專案

source: A heading looks like ``[<resource_type> key1=value1 key2=value2 key3=value3 ...]`` where resource_type is one of:
de: Eine Überschrift sieht aus wie ``[<resource_type> key1=value1 key2=value2 key3=value3 ...]``, wobei resource_type eine der folgenden Strings ist:
zh_tw: 當 resource_type 為下列其一時，標題看起來會像 ``[<resource_type> key=value key=value key=value ...]`` ：

source: Below every heading comes zero or more ``key = value`` pairs. The values can be complex datatypes such as Arrays, Transforms, Colors, and so on. For example, a Node3D looks like:
de: Unter jeder Überschrift stehen null oder mehr ``key = value``-Paare. Die Werte können komplexe Datentypen sein, wie Arrays, Transforms, Farben und so weiter. Ein Node3D sieht zum Beispiel so aus:
zh_tw: 在每個標題後都會有 0 或多個 ``key = value`` 索引鍵／值組。數值可以是複雜的資料型別，如 Array, Transform, Color …等。舉例來說，Spatial 節點可能會類似：

source: The scene tree
de: Der Szenenbaum
zh_tw: 場景樹

source: The scene tree is made up of… nodes! The heading of each node consists of its name, parent and (most of the time) a type. For example: ``[node name="PlayerCamera" type="Camera" parent="Player/Head"]``
de: Der Szenenbaum besteht aus... Nodes! Die Überschrift eines jeden Nodes besteht aus dem Namen, dem Parent-Element und (meistens) einem Typ. Zum Beispiel: ``[node name="PlayerCamera" type="Camera" parent="Player/Head"]``
zh_tw: 場景樹是由……節點構成的！各個節點的標題都是由名稱、母節點與 (大多數時候還會有) 型別所組成的。如， ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``

source: Other valid keywords include:
de: Andere gültige Schlüsselwörter sind unter anderem:
zh_tw: 其他有效的關鍵字包含：

source: ``index`` (sets the order of appearance in the tree; if absent, inherited nodes will take precedence over plain ones)
de: ``index`` (legt die Reihenfolge des Auftretens im Baum fest; wenn nicht vorhanden, haben vererbte Nodes Vorrang vor einfachen)
zh_tw: ``index``（設定在樹中的出現順序。不存在的話，繼承節點優先於普通節點）

source: The first node in the file, which is also the scene root, must **not** have a ``parent="Path/To/Node"`` entry in its heading. All scene files should have exactly *one* scene root. If it doesn't, Godot will fail to import the file. The parent path of other nodes should be absolute, but shouldn't contain the scene root's name. If the node is a direct child of the scene root, the path should be ``"."``. Here is an example scene tree (but without any node content):
de: Der erste Node in der Datei, der auch der Szenen-Root ist, darf **nicht** einen ``parent="Path/To/Node"``-Eintrag in seiner Überschrift haben. Alle Szenendateien sollten genau *einen* Szenen-Root haben. Wenn dies nicht der Fall ist, wird Godot die Datei nicht importieren können. Der übergeordnete Pfad der anderen Nodes sollte absolut sein, aber nicht den Namen des Szenen-Roots enthalten. Wenn der Node ein direktes Child des Szenen-Roots ist, sollte der Pfad ``"."`` sein. Hier ist ein Beispiel für einen Szenenbaum (allerdings ohne jeglichen Node-Inhalt):
zh_tw: 檔案中的第一個節點同時也是根節點，該節點的標題不得包含 ``parent=Path/To/Node`` 專案。所有的場景檔案都必須只有 **一個** 根節點，否則 Godot 將無法匯入該檔案。其他結點的母級節點必須使用絕對路徑，但不得包含場景的根名稱。若某個節點為場景根節點的直接子節點，則路徑為 `「 . 」``。下列為範例場景樹 (但無任何節點內容)：

source: To make the file structure easier to grasp, you can saving a file with any given node or resource then inspect it yourself in an external editor. You can also make incremental changes in the Godot editor, and keep an external text editor open on the ``.tscn`` or ``.tres`` file with auto-reload enabled to see what changes.
de: Um die Dateistruktur leichter zu verstehen, können Sie eine Datei mit einem bestimmten Node oder einer bestimmten Ressource speichern und sie dann selbst in einem externen Editor ansehen. Sie können auch schrittweise Änderungen im Godot-Editor vornehmen und einen externen Texteditor für die Datei ``.tscn`` oder ``.tres`` mit aktiviertem automatischen Neuladen geöffnet lassen, um die Änderungen zu sehen.
zh_tw: 為了使檔案結構更容易掌握，您可以使用任何給定的節點或資源來保存檔案，然後在外部編輯器中自行檢查它。您還可以在 Godot 編輯器中進行差異量更改，並在啟用自動重新加載的“.tscn”或“.tres”檔案上保持外部文字編輯器打開，以查看發生的更改。

source: Here is an example of a scene containing a RigidBody3D-based ball with collision, visuals (mesh + light) and a camera parented to the RigidBody3D:
de: Hier ist ein Beispiel für eine Szene, die einen RigidBody3D-basierten Ball mit Kollisionen, Visuals (Mesh + Licht) und eine dem RigidBody3D übergeordnete Kamera enthält:
zh_tw: 以下是一個場景範例，其中包含基於 RigidBody3D 的球，具有碰撞、視覺效果（網格 + 燈光）以及作為 RigidBody3D 父級的相機：

source: A tree structure is not enough to represent the whole scene. Godot uses a ``NodePath(Path/To/Node)`` structure to refer to another node or attribute of the node anywhere in the scene tree. Paths are relative to the current node, with ``NodePath(".")`` pointing to the current node and ``NodePath("")`` pointing to no node at all.
de: Eine Baumstruktur reicht nicht aus, um die gesamte Szene darzustellen. Godot verwendet eine ``NodePath(Path/To/Node)``-Struktur, um auf einen anderen Node oder ein Attribut des Nodes irgendwo im Szenenbaum zu verweisen. Pfade sind relativ zum aktuellen Node, wobei ``NodePath(".")`` auf den aktuellen Node und ``NodePath("")`` auf gar keinen Node zeigt.
zh_tw: 使用樹狀結構並無法代表完整的場景。Godot 使用 ``NodePath(Path/To/Node)`` 結構來參照場景樹中的某個節點或節點的屬性。舉例來說，MeshInstance 使用 ``NodePoint()`` 來指向其骨架。同樣地，動畫軌使用 ``NodePath()`` 來指向動畫的節點屬性。

source: For instance, MeshInstance3D uses ``NodePath()`` to point to its skeleton. Likewise, Animation tracks use ``NodePath()`` to point to node properties to animate.
de: Zum Beispiel benutzt MeshInstance3D ``NodePath()``, um auf sein Skelett zu zeigen. Ebenso benutzen Animation-Tracks ``NodePath()``, um auf Node-Propertys zu zeigen, die animiert werden sollen.
zh_tw: 使用樹狀結構並無法代表完整的場景。Godot 使用 ``NodePath(Path/To/Node)`` 結構來參照場景樹中的某個節點或節點的屬性。舉例來說，MeshInstance 使用 ``NodePoint()`` 來指向其骨架。同樣地，動畫軌使用 ``NodePath()`` 來指向動畫的節點屬性。

source: NodePath can also point to a property using a ``:property_name`` suffix, and even point to a specific component for vector, transform and color types. This is used by Animation resources to point to specific properties to animate. For example, ``NodePath("MeshInstance3D:scale.x")`` points to the ``x`` component of the ``scale`` Vector3 property in MeshInstance3D.
de: NodePath kann auch auf eine Property mit dem Suffix ``:property_name`` verweisen und sogar auf eine bestimmte Komponente für Vektor-, Transform- und Farbtypen. Dies wird von Animationsressourcen verwendet, um auf bestimmte Propertys zu zeigen, die animiert werden sollen. Zum Beispiel zeigt ``NodePath("MeshInstance3D:scale.x")`` auf die ``x``-Property der ``scale``-Vector3-Property in MeshInstance3D.
zh_tw: NodePath 也可以使用 :property_name 字尾指向屬性，甚至指向向量、變換和顏色型別的特定元件。動畫資源使用它來指向要製作動畫的特定屬性。例如， ``NodePath("MeshInstance3D:scale.x")`` 指向 MeshInstance3D 中``scale`` Vector3 屬性的``x`` 元件。

source: For example, the ``skeleton`` property in the MeshInstance3D node called ``mesh`` points to its parent, ``Armature01``:
de: Zum Beispiel zeigt die Property ``Skelett`` im MeshInstance3D-Nodes namens ``Mesh`` auf seinen Parent, ``Armature01``:
zh_tw: 例如，名為「mesh」的 MeshInstance3D 節點中的「骨骼」屬性指向其父節點「Armature01」：

source: Skeleton3D
zh_tw: 骨架

source: The :ref:`class_Skeleton3D` node inherits the Node3D node, but may alsohave a list of bones described in key-value pairs in the format ``bones/<id>/<attribute> = value``. The bone attributes consist of:
de: Der :ref:`class_Skeleton3D`-Node erbt den Node3D-Node, kann aber auch eine Liste von Knochen haben, die in Schlüssel-Wert-Paaren im Format ``bones/<id>/<attribute> = value`` beschrieben werden. Die Knochen-Attribute bestehen aus:
zh_tw: Skeleton 節點繼承自 Spatial 節點，但同時 Skeleton 也以 ``bones/Id/Attribute=Value`` 這樣的格式來儲存一組索引鍵／值格式的骨頭列表。骨頭屬性由下列這幾個屬性構成：

source: ``rotation``: Quaternion
zh_tw: ``Rotation``

source: These attributes are all optional. For instance, a bone may only define ``position`` or ``rotation`` without defining the other properties.
de: Diese Attribute sind alle optional. Zum Beispiel kann ein Knochen nur ``Position`` oder ``Rotation`` definieren, ohne die anderen Propertys zu definieren.
zh_tw: 這些屬性都是可選的。例如，骨骼可能只定義“位置”或“旋轉”，而不定義其他屬性。

source: Here's an example of a skeleton node with two bones:
de: Hier ist ein Beispiel für einen Skelett-Node mit zwei Knochen:
zh_tw: 下列為有兩個骨頭的骨骼節點範例：

source: The :ref:`class_BoneAttachment3D` node is an intermediate node to describe some node being parented to a single bone in a Skeleton node. The BoneAttachment has a ``bone_name = "name of bone"`` property, as well as a property for the matching bone index.
de: Der Node :ref:`class_BoneAttachment3D` ist ein Zwischen-Node zur Beschreibung eines Nodes, der einem einzelnen Knochen in einem Skelett-Node übergeordnet ist. Das BoneAttachment hat eine Property ``bone_name = "Name des Knochens"``, sowie eine Property für den passenden Knochen-Index.
zh_tw: BoneAttachment 節點為用來描述某個節點屬於某 Skeleton 節點的單一骨頭之子節點。BoneAttachment 有一個 ``bone_name=NameOfBone`` 屬性，而對應為母節點的骨頭之 ``bound_children`` 列表中則有 BoneAttachment 節點。

source: An example of a :ref:`class_Marker3D` node parented to a bone in Skeleton:
de: Ein Beispiel für einen :ref:`class_Marker3D`-Node, der einem Knochen im Skelett übergeordnet ist:
zh_tw: 下列為 Skeleton 中有骨頭母節點的 MeshInstance 範例：

source: The :ref:`class_AnimationPlayer` node works with one or more animation libraries stored in :ref:`class_AnimationLibrary` resources. An animation library is a collection of individual :ref:`class_Animation` resources, whose structure is documented :ref:`here <doc_tscn_animation>`.
de: Der :ref:`class_AnimationPlayer`-Node arbeitet mit einer oder mehreren Animationsbibliotheken, die in :ref:`class_AnimationLibrary`-Ressourcen gespeichert sind. Eine Animationsbibliothek ist eine Sammlung von einzelnen :ref:`class_Animation`-Ressourcen, deren Struktur :ref:`hier <doc_tscn_animation>` dokumentiert ist.
zh_tw: class_AnimationPlayer 節點與儲存在 class_AnimationLibrary 資源中的一個或多個動畫庫搭配使用。動畫庫是各個 :ref:`class_Animation` 資源的集合，其結構記錄在 :ref:`此處 <doc_tscn_animation>`。

source: This split between animations themselves and animation libraries was done in Godot 4, so that animations can be imported separately from 3D meshes, which is a common workflow in 3D animation software. See the `original pull request <https://github.com/godotengine/godot/pull/59980>`__ for details.
de: Diese Trennung zwischen Animationen selbst und Animationsbibliotheken wurde in Godot 4 vorgenommen, so dass Animationen getrennt von 3D-Meshes importiert werden können, was ein üblicher Workflow in 3D-Animationssoftware ist. Siehe den `ursprünglichen Pull Request <https://github.com/godotengine/godot/pull/59980>`__ für Details.
zh_tw: 動畫本身和動畫庫之間的這種分離是在 Godot 4 中完成的，以便動畫可以與 3D 網格分開匯入，這是 3D 動畫軟體中的常見工作流程。有關詳細信息，請參閱“原始拉取請求 <https://github.com/godotengine/godot/pull/59980>”。

source: If the library name is empty, then it acts acts the unique source of animations for this AnimationPlayer. This allows using ``<animation_name>`` directly to play animations from script. If you name the library, then you must play it as ``<library_name>/<animation_name>``. This ensures backwards compatibility and keeps the existing workflow if you don't want to use multiple animation libraries.
de: Wenn der Bibliotheksname leer ist, dann fungiert er als die einzige Quelle für Animationen für diesen AnimationPlayer. Dies erlaubt die direkte Verwendung von ``<Animation_name>``, um Animationen aus einem Skript abzuspielen. Wenn Sie die Bibliothek benennen, müssen Sie sie als ``<bibliothek_name>/<animation_name>`` abspielen. Dies stellt die Rückwärtskompatibilität sicher und behält den bestehenden Workflow bei, wenn Sie nicht mehrere Animationsbibliotheken verwenden wollen.
zh_tw: 如果庫名稱為空，則它充當此 AnimationPlayer 的唯一動畫來源。這允許直接使用``<animation_name>``從腳本播放動畫。如果您命名庫，則必須將其播放為``<library_name>/<animation_name>``。如果您不想使用多個動畫庫，這可以確保向後相容性並保留現有的工作流程。

source: Resources
de: Ressourcen
zh_tw: 資源

source: Resources are components that make up the nodes. For example, a MeshInstance3D node will have an accompanying ArrayMesh resource. The ArrayMesh resource may be either internal or external to the TSCN file.
de: Ressourcen sind Komponenten, aus denen die Nodes bestehen. Zum Beispiel hat ein MeshInstance3D-Node eine zugehörige ArrayMesh-Ressource. Die ArrayMesh-Ressource kann entweder intern oder extern in der TSCN-Datei sein.
zh_tw: 資源是組成各個節點的元件。舉例來說，MeshInstance 節點中會有附帶的 ArrayMesh 資源。該 ArrayMesh 資源可以在 TSCN 檔的內部或外部。

source: References to the resources are handled by unique string-based IDs in the resource's heading. This is different from the ``uid`` property, which each external resource also has (but subresources don't).
de: Verweise auf die Ressourcen werden durch eindeutige, auf Zeichenketten basierende IDs in der Überschrift der Ressource behandelt. Dies unterscheidet sich von der Property ``uid``, die jede externe Ressource ebenfalls hat (Unterressourcen jedoch nicht).
zh_tw: 對資源的引用由資源標題中基於字串的唯一 ID 處理。這與每個外部資源也具有的「uid」屬性不同（但子資源沒有）。

source: External resources and internal resources are referred to with ``ExtResource("id")`` and ``SubResource("id")``, respectively. Because there have different methods to refer to internal and external resources, you can have the same ID for both an internal and external resource.
de: Auf externe Ressourcen und interne Ressourcen wird mit ``ExtResource("id")`` bzw. ``SubResource("id")`` verwiesen. Da es unterschiedliche Methoden gibt, um auf interne und externe Ressourcen zu verweisen, können Sie dieselbe ID für eine interne und eine externe Ressource haben.
zh_tw: 資源的參照是以資源標題中的 ``id`` 數字來參照的。外部資源與內部資源分別使用 ``ExtResource(id)`` 與 ``SubResource(id)`` 來參照。由於用來參照內部與外部資源有不同的方法，因此同一個 ID 可能參照到不同的內部或外部資源。

source: For example, to refer to the resource ``[ext_resource type="Material" uid="uid://c4cp0al3ljsjv" path="res://material.tres" id="1_7bt6s"]``, you would use ``ExtResource("1_7bt6s")``.
de: Um zum Beispiel auf die Ressource ``[ext_resource type="Material" uid="uid://c4cp0al3ljsjv" path="res://material.tres" id="1_7bt6s"]`` zu verweisen, würden Sie ``ExtResource("1_7bt6s")`` verwenden.
zh_tw: 舉例來說，若要參照到資源 ``[ext_resource id=3 type="PackedScene" path=....]`` ，則可使用 ``ExtResource(3)`` 。
