Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/file_formats/tscn.po
Languages: de, zh_tw

source: External resources are links to resources not contained within the TSCN file itself. An external resource consists of a path, a type, an UID (used to map its filesystem location to an unique identifier) and an ID (used to refer to the resource in the scene file).
de: Externe Ressourcen sind Links zu Ressourcen, die nicht in der TSCN-Datei selbst enthalten sind. Eine externe Ressource besteht aus einem Pfad, einem Typ, einer UID (die dazu dient, den Speicherort im Dateisystem einem eindeutigen Bezeichner zuzuordnen) und einer ID (die dazu dient, in der Szenendatei auf die Ressource zu verweisen).
zh_tw: 外部資源會連結不包含 TSCN 檔自身的資源。外部資源由路徑、型別與 ID 組成。

source: Godot always generates absolute paths relative to the resource directory and thus prefixed with ``res://``, but paths relative to the TSCN file's location are also valid.
de: Godot erzeugt immer absolute Pfade ausgehend vom Stammverzeichnis und zeigt dieses als ``res://`` an, aber Pfade relativ zu TSCN Datei-Verzeichnisssen sind ebenso möglich.
zh_tw: Godot 會產生相對於資源目錄的絕對路徑，並以 ``res://`` 開頭。但也可以使用相對於 TSCN 檔位置的相對路徑。

source: Some example external resources are:
de: Einige Beispiele externer Quellen sind:
zh_tw: 一些外部資源的範例：

source: Like TSCN files, a TRES file may contain single-line comments starting with a semicolon (``;``). However, comments will be discarded when saving the resource using the Godot editor. Whitespace within a TRES file is not significant (except within strings), but extraneous whitespace will be discarded when saving the file.
de: Wie TSCN-Dateien kann auch eine TRES-Datei einzeilige Kommentare enthalten, die mit einem Semikolon (``;``) beginnen. Beim Speichern der Ressource mit dem Godot-Editor werden die Kommentare jedoch verworfen. Whitespace innerhalb einer TRES-Datei ist nicht von Bedeutung (außer innerhalb von Zeichenketten), aber überflüssiger Whitespace wird beim Speichern der Datei verworfen.
zh_tw: 與 TSCN 檔類似，TRES 檔可以包含使用分號 (``;``) 開頭的單行註解。但，在使用 Godot 編輯器保存資源時，註解會被移除。

source: A TSCN file can contain meshes, materials and other data. These are contained in the *internal resources* section of the file. The heading for an internal resource looks similar to those of external resources, except that it doesn't have a path. Internal resources also have ``key=value`` pairs under each heading. For example, a capsule collision shape looks like:
de: Eine TSCN-Datei kann Meshes, Materialien und andere Daten enthalten. Diese sind im Abschnitt *interne Ressourcen* der Datei enthalten. Die Überschrift für eine interne Ressource sieht ähnlich aus wie die von externen Ressourcen, mit dem Unterschied, dass sie keinen Pfad hat. Interne Ressourcen haben auch ``key=value``-Paare unter jeder Überschrift. Eine Capsule-Collision Shape sieht zum Beispiel so aus:
zh_tw: 一個 TSCN 檔可以包含網格、材質與其他資料。這些資料都放在 TSCN 檔中的 **內部資源** 區塊中。內部資源區塊的標題看起來與外部資源的標題類似，但內部資源的標題不含路徑。內部資源中的各個標題中也有 ``key=value`` 索引鍵／值組。舉例來說，膠囊型碰撞區域會像這樣：

source: Some internal resources contain links to other internal resources (such as a mesh having a material). In this case, the referring resource must appear *before* the reference to it. This means that order matters in the file's internal resources section.
de: Einige interne Ressourcen enthalten Verweise auf andere interne Ressourcen (z.B. ein Mesh, das ein Material hat). In diesem Fall muss die verweisende Ressource *vor* dem Verweis auf sie erscheinen. Das bedeutet, dass die Reihenfolge im Abschnitt "Interne Ressourcen" der Datei wichtig ist.
zh_tw: 有的內部資源會包含指向另一個內部資源的連結 (如網格會具有材質)。這種情況下，被參照的資源的資源必須要放在參照 **之前** 。這表示，在 TSCN 檔中，要注意檔案內部資源區塊的順序。

source: An ArrayMesh consists of several surfaces contained in the ``_surfaces`` array (notice the leading underscore). Each surface's data is stored in a dictionary with the following keys:
de: Ein ArrayMesh besteht aus mehreren Flächen, die in dem Array ``_surfaces`` enthalten sind (beachten Sie den Unterstrich am Anfang). Die Daten jeder Oberfläche werden in einem Dictionary mit den folgenden Keys gespeichert:
zh_tw: ArrayMesh 由包含在「_surfaces」陣列中的多個表面組成（注意前導底線）。每個表面的資料都儲存在具有以下鍵的字典中：

source: ``aabb``: The computed axis-aligned bounding box for visibility. ``Mesh.PrimitiveType`` Godot enum. ``0`` = points, ``1`` = lines, ``2`` = line strip, ``3`` = triangles (most common), ``4`` = triangle strip.
de: ``aabb``: Die berechnete an den Achsen ausgerichtete Bounding Box für die Sichtbarkeit. ``Mesh.PrimitiveType`` Godot enum. ``0`` = Punkte, ``1`` = Linien, ``2`` = Linienstreifen, ``3`` = Dreiecke (am häufigsten), ``4`` = Dreiecksstreifen.
zh_tw: ``aabb``：計算的可見性軸對齊邊界框。 ``Mesh.PrimitiveType`` Godot 列舉。 ``0`` = 點，``1`` = 線，``2`` = 線帶，``3`` = 三角形（最常見），``4`` = 三角形帶。

source: ``attribute_data``: Vertex attribute data, such as normals, tangents, vertex colors, UV1, UV2 and custom vertex data.
de: ``attribute_data``: Vertex-Attributdaten, wie Normalen, Tangenten, Vertexfarben, UV1, UV2 und benutzerdefinierte Vertexdaten.
zh_tw: ``attribute_data``：頂點屬性資料，例如法線、切線、頂點顏色、UV1、UV2 和自訂頂點資料。

source: ``bone_aabbs``: The axis-aligned bounding box of each bone for visibility.
de: ``bone_aabbs``: Die an den Achsen ausgerichtete Bounding Box jedes Bones für die Sichtbarkeit.
zh_tw: ``bone_aabbs``：每個骨骼的軸對齊邊界框以提高可見性。

source: ``format``: The surface's buffer format.
de: ``format``: Das Bufferformat der Oberfläche.
zh_tw: ``format``：表面的緩衝區格式。

source: ``index_count``: The number of indices in the surface. This must match ``index_data``'s size.
de: ``index_count``: Die Anzahl der Indizes in der Oberfläche. Sie muss mit der Größe von ``index_data`` übereinstimmen.
zh_tw: ``index_count``：表面中索引的數量。這必須與“index_data”的大小相符。

source: ``index_data``: The index data, which determines which vertices from ``vertex_data`` are drawn.
de: ``index_data``: Die Indexdaten, die bestimmen, welche Vertices aus ``vertex_data`` gezeichnet werden.
zh_tw: “index_data”：索參資料，它決定從“vertex_data”中繪製哪些頂點。

source: ``lods``: Level of detail variations, stored as an array. Each LOD level represents two values in the array. The first value is the percentage of screen space the LOD level is most suited for (edge length); the second value is the list of indices that should be drawn for the given LOD level.
de: ``lods``: Level of Detail-Variationen, gespeichert als Array. Jede LOD-Stufe repräsentiert zwei Werte in dem Array. Der erste Wert ist der Prozentsatz der Bildschirmfläche, für die diese LOD-Stufe am besten geeignet ist (Kantenlänge); der zweite Wert ist die Liste der Indizes, die für die gegebene LOD-Stufe gezeichnet werden sollten.
zh_tw: ``lods``：細節變化的級別，儲存為陣列。每個 LOD 等級代表陣列中的兩個值。第一個值是 LOD 等級最適合的螢幕空間百分比（邊緣長度）；第二個值是應為給定 LOD 等級繪製的索引列表。

source: ``material``: The material used when drawing the surface.
de: ``material``: Das Material, das beim Zeichnen der Oberfläche verwendet wird.
zh_tw: ``material``：繪製表面時所使用的材質。

source: ``name``: The surface's name. This can be used in scripts and is imported from 3D DCCs.
de: ``name``: Der Name der Oberfläche. Dieser kann in Skripten verwendet werden und wird von 3D DCCs importiert.
zh_tw: ``name``：表面的名稱。這可以在腳本中使用，並從 3D DCC 匯入。

source: ``primitive``: The surface's primitive type, matching the
de: ``primitive``: Der primitive Typ der Oberfläche, übereinstimmend mit dem
zh_tw: ``primitive``：表面的原始型別，配對

source: ``skin_data``: Bone weight data.
de: ``skin_data``: Knochengewicht-Daten.
zh_tw: ``skin_data``：骨骼重量資料。

source: ``vertex_count``: Number of vertices in the surface. This must match ``vertex_data``'s size.
de: ``vertex_count``: Anzahl der Vertices in der Oberfläche. Diese muss mit der Größe von ``vertex_data`` übereinstimmen.
zh_tw: ``vertex_count``：表面中的頂點數。這必須與“vertex_data”的大小相符。

source: ``vertex_data``: The vertex position data.
de: ``vertex_data``: Vertexpositions-Daten.
zh_tw: ``vertex_data``：頂點位置資料。

source: Here's an example of an ArrayMesh saved to its own ``.tres`` file. Some fields were shortened with ``...`` for brevity:
de: Hier ist ein Beispiel für ein ArrayMesh, das in seiner eigenen ``.tres`` Datei gespeichert wurde. Einige Felder wurden der Kürze halber mit ``...`` abgekürzt:
zh_tw: 這是保存到自己的 .tres 檔案中的 ArrayMesh 的範例。為了簡潔起見，一些字段被縮短為“...”：

source: Animation
zh_tw: 動畫

source: Each animation has the following properties:
de: Jede Animation hat die folgenden Eigenschaften:
zh_tw: 有下列事項需注意：

source: ``length``: The animation's length in seconds. Note that keyframes may be placed outside the ``[0; length]`` interval, but they may have no effect depending on the interpolation mode chosen.
de: ``length``: Die Länge der Animation in Sekunden. Beachten Sie, dass Keyframes außerhalb des ``[0; Länge]`` Intervalls platziert werden können, aber je nach gewähltem Interpolationsmodus keinen Effekt haben.
zh_tw: 「length」：動畫的長度（以秒為單位）。請注意，關鍵影格可以放置在「[0;」之外。 length]`` 間隔，但根據所選的插值模式，它們可能沒有效果。

source: ``loop_mode``: ``0`` = no looping, ``1`` = wrap-around looping, ``2`` = clamped looping.
de: ``loop_mode``: ``0`` = kein Looping, ``1`` = wrap-around Looping, ``2`` = geclamptes Looping.
zh_tw: ``loop_mode``：``0`` = 無循環，``1`` = 環繞循環，``2`` = 箝位循環。

source: ``step``: The step size to use when editing this animation in the editor. This is only used in the editor; it doesn't affect animation playback in any way.
de: ``step``: Die Schrittgröße, die bei der Bearbeitung der Animation im Editor verwendet wird. Dieser Wert wird nur im Editor verwendet; er hat keinen Einfluss auf die Wiedergabe der Animation.
zh_tw: ``step``：在編輯器中編輯此動畫時使用的步長。這只在編輯器中使用；它不會以任何方式影響動畫播放。

source: Each track is described by a list of key-value pairs in the format ``tracks/<id>/<attribute>``. Each track includes:
de: Jeder Track wird durch eine Liste von Key-Value-Paaren im Format ``Tracks/<id>/<Attribut>`` beschrieben. Jeder Track enthält:
zh_tw: 每個軌道都是由一組索引鍵／值配對所組成的，其格式為 ``tracks/Id/Attribute`` 。每個軌道都包含了：

source: ``type``: The track's type. This defines what kind of properties may be animated by this track, and how it'll be exposed to the user in the editor. Valid types are ``value`` (generic property track), ``position_3d``, ``rotation_3d``, ``scale_3d``, ``blend_shape`` (optimized 3D animation tracks), ``method`` (method call tracks), ``bezier`` (Bezier curve tracks), ``audio`` (audio playback tracks), ``animation`` (tracks that play other animations).
de: ``type``: Der Typ des Tracks. Dies definiert, welche Art von Propertys von diesem Track animiert werden können, und wie sie dem Benutzer im Editor angezeigt werden. Gültige Typen sind ``value`` (Track für generische Propertys), ``position_3d``, ``rotation_3d``, ``scale_3d``, ``blend_shape`` (optimierte 3D-Animations-Tracks), ``method`` (Methodenaufruf-Tracks), ``bezier`` (Bezierkurven-Tracks), ``audio`` (Audiowiedergabe-Tracks), ``animation`` (Tracks, die andere Animationen abspielen).
zh_tw: ``type``：軌道的型別。這定義了該軌道可以動畫化哪種屬性，以及如何在編輯器中向使用者公開它。有效型別為「value」（一般屬性軌道）、「position_3d」、「rotation_3d」、「scale_3d」、「blend_shape」（最佳化的 3D 動畫軌道）、「method」（方法呼叫軌道）、``bezier``（貝塞爾曲線軌道）、``audio``（音頻播放軌道）、``animation``（播放其他動畫的軌道）。

source: ``imported``: ``true`` if the track was created from an imported 3D scene, ``false`` if it was manually created by the user in the Godot editor or using a script.
de: ``imported``: ``true``, wenn der Track aus einer importierten 3D-Szene erzeugt wurde, ``false``, wenn er manuell vom Benutzer im Godot-Editor oder mit Hilfe eines Skripts erzeugt wurde.
zh_tw: 「imported」：如果軌道是從匯入的 3D 場景建立的，則為「true」；如果是由使用者在 Godot 編輯器中或使用腳本手動建立的，則為「false」。

source: ``enabled``: ``true`` if the track is effective, ``false`` if it was disabled in the editor.
de: ``enabled``: ``true`` wenn der Track aktiv ist, ``false`` wenn er im Editor deaktiviert wurde.
zh_tw: ``enabled``：如果軌道有效則為``true``，如果在編輯器中停用則為``false``。

source: ``path``: Path to the node property that will be affected by the track. The property is written after the node path with a ``:`` separator.
de: ``path``: Pfad zu der Node-Property, die vom Track betroffen sein wird. Die Property wird nach dem Nodepfad mit einem ``:``-Trennzeichen geschrieben.
zh_tw: ``path``：將受軌道影響的節點屬性的路徑。該屬性寫在節點路徑後面，並使用 ``:`` 分隔符號。

source: ``interp``: The interpolation mode to use. ``0`` = nearest, ``1`` = linear, ``2`` = cubic, ``3`` = linear angle, ``4`` = cubic angle.
de: ``interp``: Der zu verwendende Interpolationsmodus. ``0`` = nearest, ``1`` = linear, ``2`` = kubisch, ``3`` = linearer Winkel, ``4`` = kubischer Winkel.
zh_tw: ``interp``：要使用的內插模式。 ``0`` = 最近，``1`` = 線性，``2`` = 立方，``3`` = 線性角度，``4`` = 立方角度。

source: ``loop_wrap``: ``true`` if the track is designed to wrap around when the animation is looping, ``false`` if the track clamps to the first/last keyframes.
de: ``loop_wrap``: ``true``, wenn der Track so gestaltet ist, dass er sich beim Looping der Animation mitdreht, ``false``, wenn der Track an den ersten/letzten Keyframes geclampt wird.
zh_tw: 「loop_wrap」：如果軌道設計為在動畫循環時環繞，則為「true」；如果軌道夾在第一個/最後一個關鍵影格，則為「false」。

source: ``keys``: The animation track's values. This attribute's structure depends on the ``type``.
de: ``keys``: Die Werte des Animationstracks. Die Struktur dieses Attributs hängt vom ``Typ`` ab.
zh_tw: ``keys``：動畫軌道的值。此屬性的結構取決於“type”。

source: Here is a scene containing an AnimationPlayer that scales down a cube over time using a generic property track. The AnimationLibrary workflow was not used, so the animation library has an empty name (but the animation is still given a ``scale_down`` name). Note that the ``RESET`` track was not created in this AnimationPlayer for brevity:
de: Hier ist eine Szene, die einen AnimationPlayer enthält, der einen Würfel mit Hilfe eines Track für generische Propertys im Laufe der Zeit verkleinert. Der AnimationLibrary-Workflow wurde nicht verwendet, daher hat die Animationsbibliothek einen leeren Namen (aber die Animation hat trotzdem einen ``scale_down``-Namen). Beachten Sie, dass der ``RESET``-Track in diesem AnimationPlayer der Kürze halber nicht erstellt wurde:
zh_tw: 這是一個包含 AnimationPlayer 的場景，它使用通用屬性軌道隨時間縮小立方體。未使用 AnimationLibrary 工作流程，因此動畫庫的名稱為空（但動畫仍指定為「scale_down」名稱）。請注意，為了簡潔起見，沒有在此 AnimationPlayer 中建立「RESET」軌道：

source: For generic property ``value`` tracks, ``keys`` is a dictionary containing 3 arrays with positions in ``times`` (PackedFloat32Array), easing values in ``transitions`` (PackedFloat32Array) and values in ``values`` (Array). There is an additional ``update`` property, which is an integer with the values ``0`` = continuous, ``1`` = discrete, ``2`` = capture.
de: Für Tracks mit generischem Property-``Wert`` ist ``keys`` ein Wörterbuch, das 3 Arrays mit Positionen in ``times`` (PackedFloat32Array), Easing-Werten in ``transitions`` (PackedFloat32Array) und Werten in ``values`` (Array) enthält. Es gibt eine zusätzliche Property ``update``, die einen Integer mit den Werten ``0`` = kontinuierlich, ``1`` = diskret, ``2`` = einfangen ist.
zh_tw: 對於通用屬性「value」軌道，「keys」是一個字典，包含 3 個陣列，其位置位於「times」（PackedFloat32Array）中，緩動值位於「transitions」（PackedFloat32Array）中，值位於「values」中`` `（陣列）。還有一個附加的“update”屬性，它是一個整數，其值“0”=連續，“1”=離散，“2”=捕獲。

source: Here is a second Animation resource that makes use of the 3D Position and 3D Rotation tracks. These tracks (in addition to the 3D Scale track) replace Transform tracks from Godot 3. They are optimized for fast playback and can optionally be compressed.
de: Hier ist eine zweite Animationsressource zur Verwendung der 3D-Positions- und 3D-Rotations-Tracks. Diese Tracks (zusätzlich zum 3D Skalierungs-Track) ersetzen die Transform-Tracks von Godot 3. Sie sind für die schnelle Wiedergabe optimiert und können optional komprimiert werden.
zh_tw: 這是使用 3D 位置和 3D 旋轉軌道的第二個動畫資源。這些軌道（除了 3D Scale 軌道）取代了 Godot 3 中的 Transform 軌道。它們針對快速播放進行了最佳化，並且可以選擇壓縮。

source: The downside of these optimized track types is that they can't use custom easing values. Instead, all keyframes use linear interpolation. That said, you can still opt for using nearest or cubic interpolation for all keyframes in a given track by changing the track's interpolation mode.
de: Der Nachteil dieser optimierten Track-Typen ist, dass sie keine benutzerdefinierten Easing-Werte verwenden können. Stattdessen verwenden alle Keyframes lineare Interpolation. Dennoch können Sie für alle Keyframes eines Tracks die kubische Interpolation verwenden, indem Sie den Interpolationsmodus des Tracks ändern.
zh_tw: 這些最佳化軌道型別的缺點是它們無法使用自訂緩動值。相反，所有關鍵影格都使用線性插值。也就是說，您仍然可以透過更改軌道的插值模式來選擇對給定軌道中的所有關鍵影格使用最近插值或三次插值。

source: For 3D position, rotation and scale tracks, ``keys`` is a PackedFloat32Array with all values stored in a sequence.
de: Für 3D Positions-, Rotations- und Skalierungs-Tracks ist ``keys`` ein PackedFloat32Array, in dem alle Werte in einer Sequenz gespeichert sind.
zh_tw: 對於 3D 位置、旋轉和縮放軌跡，「keys」是一個 PackedFloat32Array，所有值都儲存在一個序列中。

source: In the visual guide below, ``T`` is the keyframe's time in seconds since the start of the animation, ``E`` is the keyframe's transition (currently always ``1``). For 3D position and scale tracks, ``X``, ``Y``, ``Z`` are the Vector3's coordinates. For 3D rotation tracks, ``X``, ``Y``, ``Z`` and ``W`` are the Quaternion's coordinates.
de: In der visuellen Anleitung unten ist ``T`` die Zeit des Keyframes in Sekunden seit dem Start der Animation, ``E`` ist der Übergang des Keyframes (derzeit immer ``1``). Für 3D-Positions- und Skalierungs-Tracks sind ``X``, ``Y``, ``Z`` die Koordinaten des Vector3. Für 3D-Rotationstracks sind ``X``, ``Y``, ``Z`` und ``W`` die Koordinaten des Quaternions.
zh_tw: 在下面的視覺指南中，「T」是自動畫開始以來關鍵影格的時間（以秒為單位），「E」是關鍵影格的轉換（目前始終為「1」）。對於 3D 位置和比例軌道，``X``、``Y``、``Z`` 是 Vector3 的座標。對於 3D 旋轉軌跡，「X」、「Y」、「Z」 和「W」 是四元數的座標。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
