Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/faking_global_illumination.po
Languages: de, zh_cn, zh_tw

source: Faking global illumination
de: Vortäuschen von Global Illumination
zh_cn: 伪造全局光照
zh_tw: 偽造全域光照

source: Why fake global illumination?
de: Warum Global Illumination vortäuschen?
zh_cn: 为什么要伪造全局光照？
zh_tw: 怎麼樣算是好的說明文件？

source: Godot provides several global illumination (GI) techniques, all with their advantages and drawbacks. Nonetheless, it remains possible to avoid using any GI technique and use a handmade approach instead. There are a few reasons for using a "handmade" approach to global illumination instead of VoxelGI, SDFGI or baked lightmaps:
de: Godot bietet mehrere Global Illumination (GI)-Methoden an, die alle ihre Vor- und Nachteile haben. Nichtsdestotrotz ist es möglich, alle GI-Methoden zu vermeiden und stattdessen einen handgemachten Ansatz zu verwenden. Es gibt einige Gründe für die Verwendung eines "handgemachten" Ansatzes zur Global Illumination anstelle von VoxelGI, SDFGI oder gebackenen Lightmaps:
zh_cn: Godot 提供了多种全局照明 (GI) 技术，各有其优点和缺点。 尽管如此，仍然可以避免使用任何 GI 技术并使用手工制作的方法。 使用“手工”方法进行全局照明而不是 VoxelGI、SDFGI 或烘焙光照贴图，有几个原因：
zh_tw: Godot 提供了多種全域照明 (GI) 技術，各有其優點和缺點。儘管如此，仍然可以避免使用任何地理旗標技術並使用手工製作方法。使用「手工」方法進行全域照明而不是 VoxelGI、SDFGI 或烘焙光照貼圖有幾個原因：

source: You need to have good rendering performance, but can't afford going through a potentially cumbersome lightmap baking process.
de: Sie benötigen eine gute Performance beim Rendern, können es sich aber nicht leisten, einen potenziell umständlichen Prozess zum Backen von Lightmaps zu durchlaufen.
zh_cn: 你需要具有良好的渲染性能，但无法承受潜在的繁琐的光照贴图烘焙过程。
zh_tw: 您需要具有良好的算繪性能，但無法承受潛在繁瑣的光照貼圖烘焙過程。

source: You need an approach to GI that is fully real-time *and* works in procedurally generated levels.
de: Sie brauchen einen Ansatz für GI, der vollständig in Echtzeit *und* in prozedural generierten Levels funktioniert.
zh_cn: 你需要一种完全实时 *且* 可在程序生成的关卡中工作的 GI 方法。
zh_tw: 您需要一種完全即時*且*可在程式產生的關卡中運作的 GI 方法。

source: You need an approach to GI that is fully real-time *and* does not suffer from significant light leaks.
de: Sie brauchen einen Ansatz für GI, der vollständig in Echtzeit funktioniert *und* nicht unter signifikanten Lichtlecks leidet.
zh_cn: 你需要一种完全实时的 GI 方法 *并且* 不会出现明显的漏光问题。
zh_tw: 您需要一種完全即時的 GI 方法*並且*不會出現明顯的漏光問題。

source: The approaches described below only cover indirect diffuse lighting, not specular lighting. For specular lighting, consider using ReflectionProbes which are usually cheap enough to be used in conjunction with this fake GI approach.
de: Die unten beschriebenen Ansätze decken nur die indirekte diffuse Beleuchtung ab, nicht die spiegelnde Beleuchtung. Für spiegelnde Beleuchtung, erwägen Sie die Verwendung von ReflectionProbes, die in der Regel billig genug sind, um in Verbindung mit diesem vorgetäuschten GI-Ansatz verwendet werden.
zh_cn: 下面描述的方法仅涵盖间接漫反射照明，而不涵盖镜面反射照明。 对于镜面反射照明，请考虑使用 ReflectionProbes，它通常足够便宜，且可以与这种假 GI 方法结合使用。
zh_tw: 以下所述的方法僅涵蓋間接漫射照明，而不涵蓋鏡面照明。對於鏡面照明，請考慮使用 ReflectionProbes，它通常足夠便宜，可以與這種假 GI 方法結合使用。

source: Not sure if faking global illumination with lights is suited to your needs? See :ref:`doc_introduction_to_global_illumination_comparison` for a comparison of GI techniques available in Godot 4.
de: Sie sind sich nicht sicher, ob das Vortäuschen von Global Illumination mit Lichtern für Ihre Bedürfnisse geeignet ist? Unter :ref:`doc_introduction_to_global_illumination_comparison` finden Sie einen Vergleich der in Godot 4 verfügbaren GI-Methoden.
zh_cn: 不确定用灯光伪造全局照明是否适合你的需求？ 请参阅 :ref:`doc_introduction_to_global_Illumination_comparison` 以了解 Godot 4 中可用的 GI 技术的比较。
zh_tw: 不確定用燈光偽造全域照明是否適合您的需求？請參閱 doc_introduction_to_global_Illumination_comparison` 以了解 Godot 4 中可用的 GI 技術的比較。

source: Faking DirectionalLight3D global illumination
de: Vortäuschen von DirectionalLight3D-Global Illumination
zh_cn: 伪造 DirectionalLight3D 的全局光照
zh_tw: 偽造 DirectionalLight3D 的全域光照

source: While the sky provides its own directional lighting, the scene's main DirectionalLight3D node typically emits a large amount of light. When using a GI technique, this light would be reflected on solid surfaces and would bounce back on most outdoors shaded surfaces.
de: Während der Himmel seine eigene gerichtete Beleuchtung liefert, strahlt der Haupt-DirectionalLight3D-Node der Szene normalerweise eine große Menge Licht aus. Bei Verwendung einer GI-Technik würde dieses Licht an festen Oberflächen reflektiert und an den meisten schattierten Oberflächen im Freien zurückgeworfen werden.
zh_cn: 虽然天空会提供自己的定向照明，但场景的主要 DirectionalLight3D 节点通常会发出大量的光。 当使用 GI 技术时，这种光会在固体表面上反射，并会在大多数户外阴影表面上反射回来。
zh_tw: 雖然天空提供自己的定向照明，但場景的主要 DirectionalLight3D 節點通常會發出大量的光。當使用 GI 技術時，這種光會在固體表面上反射，並會在大多數戶外陰影表面上反射回來。

source: We can fake this by adding a second DirectionalLight3D node with the following changes:
de: Wir können dies vortäuschen, indem wir einen zweiten DirectionalLight3D-Node mit den folgenden Änderungen hinzufügen:
zh_cn: 我们可以通过添加第二个 DirectionalLight3D 节点来伪造这一点，并进行以下更改：
zh_tw: 我們也可以通過在第一個向量的末尾加上第二個向量來直觀地看到這一點:

source: Rotate the light by 180 degrees. This allows it to represent lighting bounced by the main DirectionalLight3D node.
de: Rotieren Sie das Licht um 180 Grad. Dadurch kann es die vom Haupt-DirectionalLight3D-Node zurückgeworfene Beleuchtung darstellen.
zh_cn: 将灯光旋转 180 度。 这使得它能够表现由主 DirectionalLight3D 节点反射的光照。
zh_tw: 將燈光旋轉 180 度。這使得它能夠表示由主 DirectionalLight3D 節點反射的光照。

source: Set **Shadows** to **Off**. This reduces the secondary light's performance burden while also allowing shaded areas to receive *some* lighting (which is what we want here).
de: Setzen Sie **Schatten** auf **Aus**. Dies reduziert die Performance der sekundären Lichtquelle und ermöglicht gleichzeitig, dass schattige Bereiche *einigermaßen* beleuchtet werden (was wir hier wollen).
zh_cn: 将 **阴影（Shadows）** 设置为 **关闭** 。这减少了辅助光源的性能负担，同时也允许阴影区域接收 *一些* 光照（这正是我们想要的）。
zh_tw: 將 **陰影** 設定為 **關閉**。這減少了輔助光的性能負擔，同時還允許陰影區域接收“一些”照明（這就是我們在這裡想要的）。

source: Set **Energy** to 10-40% of the original value. There is no "perfect" value, so experiment with various energy values depending on the light and your typical material colors.
de: Stellen Sie **Energie** auf 10-40 % des ursprünglichen Wertes ein. Es gibt keinen "perfekten" Wert, experimentieren Sie also mit verschiedenen Energiewerten, je nach Licht und Ihren typischen Materialfarben.
zh_cn: 将 **能量（Energy）** 设置为原始值的 10-40% 。没有 "完美的" 值，所以请根据光线和你特有的材质颜色，尝试各种能量值。
zh_tw: 將**能量**設定為原始值的 10-40%。不存在“完美”值，因此請根據光線和典型材質顏色嘗試各種能量值。

source: Set **Specular** to ``0.0``. Indirect lighting shouldn't emit visible specular lobes, so we need to disable specular lighting entirely for the secondary light.
de: Setzen Sie **Specular** auf ``0.0``. Indirekte Beleuchtung sollte keine sichtbaren spiegelnden Flecken erzeugen, daher müssen wir die spiegelnde Beleuchtung für das sekundäre Licht vollständig deaktivieren.
zh_cn: 将 **镜面反射（Specular）** 设置为 ``0.0`` 。间接光照不应发出可见的镜面反射波瓣，因此我们需要完全禁用辅助光的镜面反射光照。
zh_tw: 將 **鏡面** 設定為“0.0”。間接照明不應發出可見的鏡面光波瓣，因此我們需要完全停用輔助光的鏡面照明。

source: This approach works best in scenes that are mostly outdoors. When going indoors, the secondary DirectionalLight3D's light will still be visible as this light has shadows disabled.
de: Dieser Ansatz funktioniert am besten in Szenen, die hauptsächlich im Freien stattfinden. In Innenräumen wird das Licht des sekundären DirectionalLight3D immer noch sichtbar sein, da bei diesem Licht die Schatten deaktiviert sind.
zh_cn: 这种方法最适合大多数户外场景。 当进入室内时，辅助 DirectionalLight3D 的灯光仍然可见，因为该灯光禁用了阴影。
zh_tw: 這種方法最適合大多數戶外場景。當進入室內時，輔助 DirectionalLight3D 的燈光仍然可見，因為該燈光禁用了陰影。

source: This can be worked around by smoothly decreasing the secondary DirectionalLight3D's energy when entering an indoor area (and doing the opposite when leaving the indoor area). For instance, this can be achieved using an Area3D node and AnimationPlayer.
de: Dies kann umgangen werden, indem die Energie des sekundären DirectionalLight3D beim Betreten eines Innenbereichs sanft verringert wird (und beim Verlassen des Innenbereichs das Gegenteil geschieht). Dies kann zum Beispiel mit einem Area3D-Node und AnimationPlayer erreicht werden.
zh_cn: 这可以通过在进入室内区域时，平滑地减少辅助 DirectionalLight3D 的能量（并在离开室内区域时执行相反的操作）来解决。 例如，可以使用 Area3D 节点和 AnimationPlayer 来实现。
zh_tw: 這可以透過在進入室內區域時平滑地減少輔助 DirectionalLight3D 的能量（並在離開室內區域時執行相反的操作）來解決。例如，這可以使用 Area3D 節點和 AnimationPlayer 來實作。

source: Faking positional light global illumination
de: Vortäuschen von Positionslicht-Global Illumination
zh_cn: 伪造位置灯光的全局光照
zh_tw: 偽造位置燈光的全域光照

source: It's possible to follow the same approach as DirectionalLight3D for positional lights (OmniLight3D and SpotLight3D). However, this will require more manual work as this operation needs to be repeated for every positional light node in the scene to look good.
de: Es ist möglich, den gleichen Ansatz wie DirectionalLight3D für Positionslichter (OmniLight3D und SpotLight3D) zu verfolgen. Dies erfordert jedoch mehr manuelle Arbeit, da dieser Vorgang für jeden Node mit Positionslicht in der Szene wiederholt werden muss, um gut auszusehen.
zh_cn: 对于位置光源（OmniLight3D 和 SpotLight3D），可以采用与 DirectionalLight3D 相同的方法。 然而，这将需要更多的手动处理，因为该方法需要对场景中的每个位置光照节点重复此操作，才能让效果看起来不错。
zh_tw: 對於位置光源（OmniLight3D 和 SpotLight3D），可以採用與 DirectionalLight3D 相同的方法。然而，這將需要更多的手動工作，因為需要對場景中的每個位置光節點重複此操作才能看起來不錯。

source: In an ideal scenario, additional OmniLight3Ds should be added at every location where a significant amount of light hits a bright enough surface. However, due to time constraints, this isn't always easily feasible (especially when performing procedural level generation).
de: Im Idealfall sollten zusätzliche OmniLight3Ds an jeder Stelle hinzugefügt werden, an der eine signifikante Lichtmenge auf eine ausreichend helle Oberfläche trifft. Aufgrund von Zeitbeschränkungen ist dies jedoch nicht immer leicht durchführbar (insbesondere bei der prozeduralen Generierung von Ebenen).
zh_cn: 在理想情况下，应在大量光线照射到足够明亮表面的每个位置，都添加额外的 OmniLight3D。 然而，由于时间限制，这个设想并不总是容易实现（特别是在执行程序关卡生成时）。
zh_tw: 在理想情況下，應在大量光線照射到足夠明亮表面的每個位置新增額外的 OmniLight3D。然而，由於時間限制，這並不總是容易實作（特別是在執行程式關卡產生時）。

source: If you're in a hurry, you can place a secondary OmniLight3D node at the same position as the main OmniLight3D node. You can add this node as a child of the main OmniLight3D node to make it easy to move and hide both nodes at the same time.
de: Wenn Sie es eilig haben, können Sie einen sekundären OmniLight3D-Node an der gleichen Position wie den Haupt-Node platzieren. Sie können diesen Node als Child-Element des Haupt-OmniLight3D-Nodes hinzufügen, um das gleichzeitige Verschieben und Ausblenden beider Nodes zu erleichtern.
zh_cn: 如果你赶时间，可以将辅助 OmniLight3D 节点放置在与主 OmniLight3D 节点相同的位置。 你可以将此节点添加为主 OmniLight3D 节点的子节点，以便轻松同时移动和隐藏这两个节点。
zh_tw: 如果您趕時間，可以將輔助 OmniLight3D 節點放置在與主 OmniLight3D 節點相同的位置。您可以將此節點新增為主 OmniLight3D 節點的子節點，以便輕鬆同時移動並隱藏這兩個節點。

source: In the secondary OmniLight3D node, perform the following changes:
de: Nehmen Sie im sekundären OmniLight3D-Node die folgenden Änderungen vor:
zh_cn: 在辅助 OmniLight3D 节点上执行以下修改：
zh_tw: 在輔助 OmniLight3D 節點中，執行下列變更：

source: Increase the light's **Range** by 25-50%. This allows the secondary light to lighten what was previously not lit by the original light.
de: Erhöhen Sie die **Reichweite** des Lichts um 25-50%. Dadurch kann das sekundäre Licht das erhellen, was zuvor nicht vom ursprünglichen Licht erhellt wurde.
zh_cn: 将灯光的 **范围** 提高25-50%。这使辅助光能够照亮原先的光线所未照亮的区域。
zh_tw: 將燈光的**範圍**增加 25-50%。這使得輔助光能夠照亮先前未被原始光照亮的區域。

source: Set **Energy** to 10-40% of the original value. There is no "perfect" value, so experiment with various energy values depending on the light and its surroundings.
de: Stellen Sie **Energie** auf 10-40 % des ursprünglichen Wertes ein. Es gibt keinen "perfekten" Wert, experimentieren Sie also je nach Licht und Umgebung mit verschiedenen Energiewerten.
zh_cn: 将 **能量** 设置为原先值的 10-40%。不存在“完美”值，因此请根据光线及其周围环境尝试各种能量值。
zh_tw: 將**能量**設定為原始值的 10-40%。不存在“完美”值，因此請根據光線及其周圍環境嘗試各種能量值。

source: Set **Specular** to 0. Indirect lighting shouldn't emit visible specular lobes, so we need to disable specular lighting entirely for the secondary light.
de: Setzen Sie **Specular** auf 0. Indirekte Beleuchtung sollte keine sichtbaren spiegelnden Flecken erzeugen, daher müssen wir die spiegelnde Beleuchtung für das sekundäre Licht vollständig deaktivieren.
zh_cn: 将 **镜面反射** 设置为0。间接照明不应发出可见的镜面光波瓣（lobe），因此我们需要完全禁用辅助光的镜面照明。
zh_tw: 將 **Specular** 設為 0。間接照明不應發出可見的鏡面反射波瓣，因此我們需要完全停用輔助光的鏡面反射照明。

source: For SpotLight3D, the same trick can be used. In this case, the secondary OmniLight3D should be placed in a way that reflects where *most* light will be bounced. This is usually close to the SpotLight3D's primary impact location.
de: Für SpotLight3D kann der gleiche Trick angewendet werden. In diesem Fall sollte das sekundäre OmniLight3D so platziert werden, dass es dort reflektiert wird, wo *das meiste* Licht zurückgeworfen wird. Dies ist normalerweise in der Nähe des primären Auftreffpunkts des SpotLight3D.
zh_cn: 对于 SpotLight3D，可以使用相同的技巧。 在这种情况下，辅助 OmniLight3D 的放置方式应能够反射 *大多数* 光线将被反射的位置。 这通常是靠近 SpotLight3D 的主要影响位置。
zh_tw: 對於 SpotLight3D，可以使用相同的技巧。在這種情況下，輔助 OmniLight3D 的放置方式應能反射「大多數」光線將被反射的位置。這通常靠近 SpotLight3D 的主要影響位置。

source: In the example below, a SpotLight3D node is used to light up the room's floor. However, since there is no indirect lighting, the rest of the room remains entirely dark. In real life, the room's walls and ceiling would be lit up by light bouncing around. Using an OmniLight3D node positioned between the SpotLight3D's origin and the floor allows simulating this effect:
de: Im folgenden Beispiel wird ein SpotLight3D-Node verwendet, um den Boden des Raumes zu beleuchten. Da jedoch keine indirekte Beleuchtung vorhanden ist, bleibt der Rest des Raums völlig dunkel. Im wirklichen Leben würden die Wände und die Decke des Raums durch das Licht beleuchtet werden, das von der Umgebung reflektiert wird. Mit einem OmniLight3D-Node, der zwischen dem Ursprung des SpotLight3D und dem Boden positioniert wird, kann dieser Effekt simuliert werden:
zh_cn: 在下面的示例中，SpotLight3D 节点用于照亮房间的地板。 然而，由于没有间接照明，房间的其余部分仍然完全黑暗。 在现实生活中，房间的墙壁和天花板会被周围反射的光照亮。 使用位于 SpotLight3D 的原点和地板之间的 OmniLight3D 节点可以模拟此效果：
zh_tw: 在下面的範例中，SpotLight3D 節點用於照亮房間的地板。然而，由於沒有間接照明，房間的其餘部分仍然完全黑暗。在現實生活中，房間的牆壁和天花板會被周圍反射的光線照亮。使用位於 SpotLight3D 的原點和地板之間的 OmniLight3D 節點可以模擬此效果：

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
