Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/introduction_to_global_illumination.po
Languages: de, zh_cn, zh_tw

source: **SDFGI:** |average| Good reflections and indirect lighting, but beware of leaks and visible cascade shifts.
de: **SDFGI:** |average| Gute Reflexionen und indirekte Beleuchtung, aber passen Sie auf Lecks und sichtbaren Kaskadenverschiebungen auf.
zh_cn: **SDFGI：** |average| 良好的反射和间接照明，但要注意泄漏和可见的级联偏移。
zh_tw: **SDFGI：** |平均|良好的反射和間接照明，但要注意洩漏和可見的級聯偏移。

source: GI level of detail varies depending on the distance between the camera and surface.
de: Der GI-Level of Detail variiert je nach dem Abstand zwischen Kamera und Oberfläche.
zh_cn: GI 细节层次（LOD）根据相机与表面之间的距离而变化。
zh_tw: GI 細節等級會根據相機與表面之間的距離而變化。

source: Leaks can be reduced significantly by enabling the **Use Occlusion** property. This has a small performance cost, but it often results in fewer leaks compared to VoxelGI.
de: Lecks können erheblich reduziert werden, indem die Property **Occlusion verwenden** aktiviert wird. Dies hat zwar einen geringen Performance-Aufwand zur Folge, führt aber im Vergleich zu VoxelGI oft zu weniger Lecks.
zh_cn: 通过启用 **使用遮挡（Use Occlusion）** 属性可以显着减少泄漏。 这具有较小的性能成本，但与 VoxelGI 相比，它通常会导致更少的泄漏。
zh_tw: 透過啟用 **使用遮蔽** 屬性可以顯著減少洩漏。這具有較小的性能成本，但與 VoxelGI 相比，它通常會導致更少的洩漏。

source: Cascade shifts may be visible when the camera moves fast. This can be made less noticeable by adjusting the cascade sizes or using fog.
de: Kaskadenverschiebungen können sichtbar sein, wenn sich die Kamera schnell bewegt. Dies kann durch Anpassen der Kaskadengrößen oder Verwendung von Nebel verringert werden.
zh_cn: 当相机快速移动时，可能会看到级联移位（cascade shifts）。 通过调整级联大小或使用雾可以使这种情况变得不那么明显。
zh_tw: 當相機快速移動時，可能會看到級聯移位。透過調整級聯大小或使用霧氣可以使這種情況變得不那麼明顯。

source: SDFGI in action.
de: SDFGI in Aktion.
zh_cn: SDFGI 的实际应用。
zh_tw: 定義一個函式。

source: **Screen-space indirect lighting (SSIL):** |average| Good *secondary* source of indirect lighting, but no reflections.
de: **Screen-Space indirekte Beleuchtung (SSIL):** |average| Gute *sekundäre* Quelle für indirekte Beleuchtung, aber keine Reflexionen.
zh_cn: **屏幕空间间接照明 (SSIL)：** |average| 良好的 *次要* 间接照明源，但没有反射。
zh_tw: **螢幕空間間接照明 (SSIL)：** |平均|良好的“次要”間接照明源，但沒有反射。

source: SSIL is designed to be used as a complement to another GI technique such as VoxelGI, SDFGI or LightmapGI. SSIL works best for small-scale details, as it cannot provide accurate indirect lighting for large structures on its own. SSIL can provide real-time indirect lighting in situations where other GI techniques fail to capture small-scale details or dynamic objects. Its screen-space nature will result in some artifacts, especially when objects enter and leave the screen. SSIL works using the last frame's color (before post-processing) which means that emissive decals and custom shaders are included (as long as they're present on screen).
de: SSIL ist als Ergänzung zu einer anderen GI-Technik wie VoxelGI, SDFGI oder LightmapGI gedacht. SSIL eignet sich am besten für kleinräumige Details, da es allein keine genaue indirekte Beleuchtung für große Strukturen liefern kann. SSIL kann indirekte Beleuchtung in Echtzeit in Situationen bieten, in denen andere GI-Techniken kleine Details oder dynamische Objekte nicht erfassen können. Da SSIL auf dem Bildschirm arbeitet, entstehen einige Artefakte, insbesondere wenn Objekte den Bildschirm betreten und verlassen. SSIL arbeitet mit der Farbe des letzten Frames (vor der Nachbearbeitung), was bedeutet, dass emittierende Decals und benutzerdefinierte Shader einbezogen werden (solange sie auf dem Bildschirm vorhanden sind).
zh_cn: SSIL 旨在用作另一种 GI 技术（例如 VoxelGI、SDFGI 或 LightmapGI）的补充。 SSIL 最适合小规模细节，因为它本身无法为大型结构提供准确的间接照明。 在其他 GI 技术无法捕捉小尺度细节或动态对象的情况下，SSIL 可以提供实时间接照明。 其屏幕空间性质会导致一些伪像，尤其是当对象进入和离开屏幕时。 SSIL 使用最后一帧的颜色（在后期处理之前）工作，这意味着包含自发光贴花和自定义着色器（只要它们出现在屏幕上）。
zh_tw: SSIL 旨在用作另一種 GI 技術（例如 VoxelGI、SDFGI 或 LightmapGI）的補充。 SSIL 最適合小規模細節，因為它本身無法為大型結構提供準確的間接照明。在其他 GI 技術無法捕捉小尺度細節或動態物件的情況下，SSIL 可以提供即時間接照明。其螢幕空間性質會導致一些偽影，尤其是當物件進入和離開螢幕時。 SSIL 使用最後一影格的顏色（在後處理之前）工作，這意味著包含自發光裝飾和自訂著色器（只要它們出現在螢幕上）。

source: SSIL in action (without any other GI technique). Notice the emissive lighting around the yellow box.
de: SSIL in Aktion (ohne jede andere GI-Technik). Beachten Sie die emittierende Beleuchtung um den gelben Kasten.
zh_cn: SSIL 的实际应用（没有任何其他 GI 技术）。 注意黄色盒子周围的自发光。
zh_tw: SSIL 的實際應用（沒有其他 GI 技術）。注意黃色框周圍的發射光。

source: **LightmapGI:** |good| Excellent indirect lighting, decent reflections (optional).
de: **LightmapGI:** |good| Ausgezeichnete indirekte Beleuchtung, anständige Reflexionen (optional).
zh_cn: **LightmapGI：** |good| 出色的间接照明，良好的反射（可选）。
zh_tw: **LightmapGI：** |好|出色的間接照明，良好的反射（可選）。

source: This is the only technique where the number of light bounces can be pushed above 2 (up to 16). When directional information is enabled, spherical harmonics (SH) are used to provide blurry reflections.
de: Dies ist die einzige Technik, bei der die Anzahl der Licht-Abprälle auf über 2 (bis zu 16) erhöht werden kann. Wenn die Richtungsinformationen aktiviert sind, werden Kugelflächenfunktionen (Spherical Harmonics, SH) verwendet, um unscharfe Reflexionen zu erzeugen.
zh_cn: 这是唯一可以将光反射次数提高到 2 以上（最多 16 个）的技术。 启用方向信息后，球谐函数 (spherical harmonics, SH) 用于提供模糊反射。
zh_tw: 這是唯一可以將光反射次數提高到 2 以上（最多 16 個）的技術。啟用方向資訊後，球諧函式 (SH) 用於提供模糊反射。

source: LightmapGI in action. Only indirect lighting is baked here, but direct light can also be baked.
de: LightmapGI in Aktion. Hier wird nur indirekte Beleuchtung gebacken, aber auch direktes Licht kann gebacken werden.
zh_cn: LightmapGI 的实际应用。 这里只烘焙间接光照，但也可以烘焙直接光照。
zh_tw: LightmapGI 的實際應用。這裡只烘焙間接光照，但也可以烘焙直接光照。

source: **ReflectionProbe:** |average| Good reflections, but poor indirect lighting.
de: **ReflectionProbe:** |average| Gute Reflexionen, aber schlechte indirekte Beleuchtung.
zh_cn: **ReflectionProbe：** |average| 反射良好，但间接照明较差。
zh_tw: **ReflectionProbe：** |平均|反射良好，但間接照明較差。

source: Indirect lighting can be disabled, set to a constant color spread throughout the probe, or automatically read from the probe's environment (and applied as a cubemap). This essentially acts as local ambient lighting. Reflections and indirect lighting are blended with other nearby probes.
de: Die indirekte Beleuchtung kann deaktiviert, auf eine konstante Farbverteilung in der Probe eingestellt oder automatisch aus der Umgebung der Probe ausgelesen (und als Cubemap angewendet) werden. Dies wirkt im Wesentlichen wie eine lokale Umgebungsbeleuchtung. Reflexionen und indirekte Beleuchtung werden mit anderen Probes in der Nähe gemischt.
zh_cn: 可以禁用间接照明，将其设置为整个探针的恒定颜色分布，或者自动从探针的环境中读取（并作为立方体贴图应用）。 这本质上在充当局部环境照明。 反射和间接照明与其他附近的探针混合。
zh_tw: 可以停用間接照明，將其設定為整個探查的恆定顏色分佈，或自動從探查的環境中讀取（並作為立方體貼圖應用）。這本質上充當局部環境照明。反射和間接照明與其他附近的探頭混合。

source: ReflectionProbe in action (without any other GI technique). Notice the reflective sphere.
de: ReflectionProbe in Aktion (ohne eine andere GI-Technik). Beachten Sie die reflektierende Kugel.
zh_cn: ReflectionProbe 的实际应用（没有任何其他 GI 技术）。 注意有反射效果球体。
zh_tw: ReflectionProbe 的實際應用（沒有任何其他 GI 技術）。注意反射球體。

source: Real-time ability
de: Echtzeitfähigkeit
zh_cn: 实时能力
zh_tw: **即時光照：**

source: **VoxelGI:** |good| Fully real-time.
de: **VoxelGI:** |good| Vollständig in Echtzeit.
zh_cn: **VoxelGI：** |good| 完全实时。
zh_tw: **VoxelGI：** |good| 完全即時。

source: Indirect lighting and reflections are fully real-time. Dynamic objects can receive GI *and* contribute to it with their emissive surfaces. Custom shaders can also emit their own light, which will be emitted accurately.
de: Indirekte Beleuchtung und Reflexionen sind vollständig in Echtzeit. Dynamische Objekte können GI empfangen *und* mit ihren emittierenden Oberflächen dazu beitragen. Benutzerdefinierte Shader können auch ihr eigenes Licht emittieren, das exakt emittiert wird.
zh_cn: 间接关照和反射是完全实时的。动态物体可以接收 GI， *并* 通过其自发光表面对 GI 做出贡献。自定义着色器也可以准确地发出自己的光。
zh_tw: 間接關照和反射是完全即時的。動態物體可以接收 GI， *並* 通過其發射表面對 GI 做出貢獻。自訂著色器也可以準確地發射自己的光線。

source: Viable for procedurally generated levels *if they are generated in advance* (and not during gameplay). Baking requires several seconds or more to complete, but it can be done from both the editor and an exported project.
de: Durchführbar für prozedural generierte Level *wenn sie im Voraus generiert werden* (und nicht während des Spiels). Das Backen dauert mehrere Sekunden oder länger, kann aber sowohl im Editor als auch in einem exportierten Projekt durchgeführt werden.
zh_cn: 适用于程序生成的关卡 *如果它们是提前生成的* （而不是在游戏过程中）。 烘焙需要几秒钟或更长时间才能完成，但可以从编辑器和导出的项目中完成。
zh_tw: 適用於程式生成的關卡*如果它們是提前生成的*（而不是在遊戲過程中）。烘焙需要幾秒鐘或更長時間才能完成，但可以從編輯器和匯出的專案中完成。

source: **SDFGI:** |average| Semi-real-time.
de: **SDFGI:** |average| Semi-Echtzeit.
zh_cn: **SDFGI：**\ |average| 半实时。
zh_tw: **SDFGI：**|average| 半即時。

source: Cascades are generated in real-time, making SDFGI viable for procedurally generated levels (including when structures are generated during gameplay).
de: Kaskaden werden in Echtzeit generiert, so dass SDFGI auch für prozedural generierte Level geeignet ist (auch wenn die Strukturen während des Spiels generiert werden).
zh_cn: 级联（Cascade）是实时生成的，使得 SDFGI 适用于程序生成的关卡（包括在游戏过程中生成结构时）。
zh_tw: 級聯是即時生成的，使得 SDFGI 適用於程式生成的關卡（包括在遊戲過程中生成結構時）。

source: Dynamic objects can *receive* GI, but not *contribute* to it. Emissive lighting will only update when an object enters a cascade, so it may still work for slow-moving objects.
de: Dynamische Objekte können GI *empfangen*, aber nicht zu ihr *beitragen*. Emissive Beleuchtung wird nur aktualisiert, wenn ein Objekt in eine Kaskade eintritt, so dass es bei sich langsam bewegenden Objekten noch funktionieren kann.
zh_cn: 动态对象可以 *接收* GI，但不能 *贡献* 它。 自发光光线仅在对象进入级联时才会更新，因此它可能仍然适用于缓慢移动的对象。
zh_tw: 動態物件可以「接收」GI，但不能「貢獻」它。發射照明僅在物件進入級聯時才會更新，因此它可能仍然適用於緩慢移動的物件。

source: **Screen-space indirect lighting (SSIL):** |good| Fully real-time.
de: **Screen-Space indirekte Beleuchtung (SSIL):** |good| Vollständig in Echtzeit.
zh_cn: **屏幕空间间接光照（SSIL）：**\ |good| 完全实时。
zh_tw: **螢幕空間間接光照（SSIL）：**|good| 完全即時。

source: SSIL works with both static and dynamic lights. It also works with both static and dynamic occluders (including emissive materials).
de: SSIL funktioniert sowohl mit statischen als auch mit dynamischen Lichtern. Außerdem funktioniert es sowohl mit statischen als auch mit dynamischen Occludern (einschließlich emissiver Materialien).
zh_cn: SSIL 适用于静态和动态灯光。 它还适用于静态和动态遮挡器（包括自发光材质）。
zh_tw: SSIL 適用於靜態和動態燈光。它也適用於靜態和動態遮擋器（包括發射材料）。

source: **LightmapGI:** |bad| Baked, and therefore not real-time.
de: **LightmapGI:** |bad| Gebacken, und daher nicht in Echtzeit.
zh_cn: **LightmapGI：**\ |bad| 进行了烘焙，因此非实时。
zh_tw: **LightmapGI：**|bad| 進行了烘焙，因此非即時。

source: bad
de: schlecht
zh_tw: 與

source: Both indirect lighting and SH reflections are baked and can't be changed at run-time. Real-time GI must be :ref:`simulated via other means <doc_faking_global_illumination>`, such as real-time positional lights. Dynamic objects receive indirect lighting via light probes, which can be placed automatically or manually by the user (LightmapProbe node). Not viable for procedurally generated levels, as baking lightmaps is only possible from the editor.
de: Sowohl indirekte Beleuchtung als auch SH-Reflexionen werden gebacken und können zur Laufzeit nicht geändert werden. Echtzeit-GI muss :ref:`durch andere Mittel simuliert werden <doc_faking_global_illumination>`, z.B. durch Echtzeit-Positionslichter. Dynamische Objekte erhalten indirekte Beleuchtung über Licht-Probes, die automatisch oder manuell vom Benutzer platziert werden können (LightmapProbe-Node). Nicht praktikabel für prozedural generierte Levels, da das Backen von Lightmaps nur im Editor möglich ist.
zh_cn: 间接光照和 SH 反射都是烘焙的，无法在运行时更改。 实时 GI 必须通过 :ref:`其他方式模拟 <doc_faking_global_illumination>`，例如实时位置灯光。 动态对象通过光探针接收间接光照，光探针可以自动或由用户手动放置（LightmapProbe 节点）。 对于程序生成的关卡则不可行，因为只能从编辑器中烘焙光照贴图。
zh_tw: 間接光照和 SH 反射都是烘焙的，無法在運作時更改。即時 GI 必須以其他方式模擬，例如即時位置燈。動態物件透過光探查接收間接光照，光探查可以自動或由使用者手動放置（LightmapProbe 節點）。對於程式產生的關卡不可行，因為只能從編輯器中烘焙光照貼圖。

source: **ReflectionProbe:** |average| Optionally real-time.
de: **ReflectionProbe:** |average| Optional in Echtzeit.
zh_cn: **ReflectionProbe：**\ |average| 可选实时。
zh_tw: **ReflectionProbe：**|average| 可選即時。

source: By default, reflections update when the probe is moved. They update as often as possible if the update mode is set to **Always** (which is expensive).
de: Standardmäßig werden die Reflexionen aktualisiert, wenn die Probe bewegt wird. Sie werden so oft wie möglich aktualisiert, wenn der Aktualisierungsmodus auf **Immer** eingestellt ist (was teuer ist).
zh_cn: 默认情况下，反射会在移动探针时更新。如果更新模式设置为 **始终** （这开销很大），则它们会尽可能频繁地更新。
zh_tw: 預設情況下，移動探查時反射會更新。如果更新模式設定為**始終**（這很昂貴），它們會盡可能頻繁地更新。

source: Indirect lighting must be configured manually by the user, but can be changed at run-time without causing an expensive computation to happen behind the scenes. This makes ReflectionProbes viable for procedurally generated levels.
de: Indirekte Beleuchtung muss vom Benutzer manuell konfiguriert werden, kann aber zur Laufzeit geändert werden, ohne dass eine teure Berechnung hinter den Kulissen durchgeführt werden muss. Dies macht ReflectionProbes für prozedural generierte Levels praktikabel.
zh_cn: 间接光照必须由用户手动配置，但它可以在运行时以一个不会导致后台进行大开销计算的方式更改。这使得 ReflectionProbes 可以用于程序化生成的级别。
zh_tw: 間接照明必須由使用者手動配置，但可以在運作時更改，而不會導致在幕後發生昂貴的計算。這使得 ReflectionProbes 對於程式產生的關卡是可行的。

source: User work needed
de: Aufwand für den Benutzer
zh_cn: 用户干预
zh_tw: 使用者干預

source: **VoxelGI:** One or more VoxelGI nodes need to be created and baked.
de: **VoxelGI:** Es müssen ein oder mehrere VoxelGI-Nodes erstellt und gebacken werden.
zh_cn: **VoxelGI：**\ 需要创建若干 VoxelGI 节点并烘焙。
zh_tw: **VoxelGI：**需要建立若干 VoxelGI 節點並烘焙。

source: Adjusting extents correctly is required to get good results. Additionally rotating the node and baking again can help combat leaks or streaking artifacts in certain situations. Bake times are fast – usually below 10 seconds for a scene of medium complexity.
de: Um gute Ergebnisse zu erzielen, müssen die Ausmaße korrekt angepasst werden. Zusätzlich kann das Drehen des Nodes und erneute Backen in bestimmten Situationen helfen, Lecks oder Streifenartefakte zu bekämpfen. Die Backzeiten sind schnell - in der Regel unter 10 Sekunden für eine Szene von mittlerer Komplexität.
zh_cn: 为了获得良好的结果，需要正确调整范围。此外，在某些情况下，旋转节点并再次烘焙可以帮助对抗泄漏或条纹伪影。烘焙时间很快——对于中等复杂度的场景，通常低于10秒。
zh_tw: 需要正確調整範圍才能獲得良好的結果。此外，旋轉節點並再次烘烤可以幫助消除某些情況下的洩漏或條紋偽影。烘焙時間很快 - 對於中等複雜度的場景，通常低於 10 秒。

source: **SDFGI:** Very little.
de: **SDFGI:** Sehr wenig.
zh_cn: **SDFGI：**\ 非常少。
zh_tw: **SDFGI：**非常少。

source: SDFGI is fully automatic; it only needs to be enabled in the Environment resource. The only manual work required is to set MeshInstances' bake mode property correctly. No node needs to be created, and no baking is required.
de: SDFGI ist vollautomatisch; es muss nur in der Environment-Ressource aktiviert werden. Die einzige manuelle Arbeit, die erforderlich ist, besteht darin, die Eigenschaft "Back-Modus" von MeshInstances korrekt einzustellen. Es muss kein Node erstellt werden, und es ist kein Backen erforderlich.
zh_cn: SDFGI 是全自动的；它只需要在环境资源中启用。所需的唯一手动操作是正确设置 MeshInstances 的烘焙模式属性。不需要创建节点，也不必须烘焙。
zh_tw: SDFGI是全自動的；它只需要在環境資源中啟用。唯一需要的手動工作是正確設定 MeshInstances 的烘焙模式屬性。不需要建立節點，也不需要烘焙。

source: **Screen-space indirect lighting (SSIL):** Very little.
de: **Screen-Space indirekte Beleuchtung (SSIL):** Sehr wenig.
zh_cn: **屏幕空间间接光照（SSIL）：**\ 非常少。
zh_tw: **螢幕空間間接光照（SSIL）：**非常少。

source: SSIL is fully automatic; it only needs to be enabled in the Environment resource. No node needs to be created, and no baking is required.
de: SSIL ist vollautomatisch; es muss nur in der Environment-Ressource aktiviert werden. Es muss kein Node erstellt werden, und es ist kein Backen erforderlich.
zh_cn: SSIL 是全自动的；它只需要在环境资源中启用。不需要创建节点，也不必须烘焙。
zh_tw: SSIL 是全自動的；它只需要在環境資源中啟用。不需要建立節點，也不需要烘焙。

source: **LightmapGI:** Requires UV2 setup and baking.
de: **LightmapGI:** Erfordert UV2-Setup und Backen.
zh_cn: **LightmapGI：**\ 需要设置 UV2 并烘焙。
zh_tw: **LightmapGI：**需要設定 UV2 並烘焙。

source: Static meshes must be reimported with UV2 and lightmap generation enabled. On a dedicated GPU, bake times are relatively fast thanks to the GPU-based lightmap baking – usually below 1 minute for a scene of medium complexity.
de: Statische Meshes müssen mit aktivierter UV2- und Lightmap-Generierung neu importiert werden. Auf einer dedicated GPU sind die Back-Zeiten dank des GPU-basierten Lightmap-Backens relativ schnell - in der Regel unter 1 Minute für eine Szene mittlerer Komplexität.
zh_cn: 静态网格必须在启用 UV2 和光照贴图生成的情况下重新导入。在专用 GPU 上，由于基于 GPU 的光照贴图烘焙，烘焙时间相对较快——对于中等复杂度的场景，通常低于1分钟。
zh_tw: 必須在啟用 UV2 和光照貼圖產生的情況下重新匯入靜態網格物件。在專用 GPU 上，由於基於 GPU 的光照貼圖烘焙，烘焙時間相對較快 – 對於中等複雜度的場景，烘焙時間通常低於 1 分鐘。

source: **ReflectionProbe:** Placed manually by the user.
de: **ReflectionProbe:** Wird manuell vom Benutzer platziert.
zh_cn: **ReflectionProbe：**\ 用户手动放置。
zh_tw: **ReflectionProbe：**使用者手動放置。

source: Summary
de: Zusammenfassung
zh_cn: 总结
zh_tw: 總結

source: If you are unsure about which GI technique to use:
de: Wenn Sie unsicher sind, welche GI-Technik Sie anwenden sollen:
zh_cn: 如果你不确定使用哪种 GI 技术：
zh_tw: 如果您不確定要使用哪種 GI 技術：

source: For desktop games, it's a good idea to start with :ref:`SDFGI <doc_using_sdfgi>` first as it requires the least amount of setup. Move to other GI techniques later if needed. To improve performance on low-end GPUs and integrated graphics, consider adding an option to disable SDFGI or :ref:`VoxelGI <doc_using_voxel_gi>` in your game's settings. SDFGI can be disabled in the Environment resource, and VoxelGI can be disabled by hiding the VoxelGI node(s). To further improve visuals on high-end setups, add an option to enable SSIL in your game's settings.
de: Für Desktop-Spiele ist es eine gute Idee, zunächst mit :ref:`SDFGI <doc_using_sdfgi>` zu beginnen, da es den geringsten Einrichtungsaufwand erfordert. Bei Bedarf können Sie später zu anderen GI-Techniken wechseln. Um die Performance auf leistungsschwachen GPUs und integrierten Grafikkarten zu verbessern, sollten Sie eine Option zur Deaktivierung von SDFGI oder :ref:`VoxelGI <doc_using_voxel_gi>` in den Spieleinstellungen hinzufügen. SDFGI kann in der Environment-Ressource deaktiviert werden, und VoxelGI kann durch Ausblenden der VoxelGI Node(s) deaktiviert werden. Um die Grafik auf High-End-Systemen weiter zu verbessern, fügen Sie eine Option zur Aktivierung von SSIL in den Spieleinstellungen hinzu.
zh_cn: 对于桌面游戏，最好先从 :ref:`SDFGI<doc_using_SDFGI>` 开始，因为它需要的设置最少。如果需要，稍后转到其他 GI 技术。要提高低端 GPU 和集成图形的性能，请考虑在游戏设置中添加禁用 SDFGI 或 :ref:`VoxelGI<doc_using_voxel_gi>` 的选项。SDFGI 可以在环境资源中禁用，VoxelGI 可以通过隐藏 VoxelGI 节点来禁用。要进一步改善高端设置的视觉效果，请在游戏设置中添加一个启用 SSIL 的选项。
zh_tw: 對於桌上遊戲，最好先從 SDFGI <doc_using_sdfgi>` 開始，因為它需要最少的設定。如果需要的話，稍後再轉向其他 GI 技術。若要提高低階 GPU 和整合顯示卡的效能，請考慮在遊戲設定中新增一個選項來停用 SDFGI 或 VoxelGI <doc_using_voxel_gi>`。可以在環境資源中停用 SDFGI，並且可以透過隱藏 VoxelGI 節點來停用 VoxelGI。為了進一步改善高階設定的視覺效果，請在遊戲設定中新增一個啟用 SSIL 的選項。

source: For mobile games, :ref:`LightmapGI <doc_using_lightmap_gi>` and :ref:`ReflectionProbes <doc_reflection_probes>` are the only supported options. See also :ref:`doc_introduction_to_global_illumination_alternatives`.
de: Für mobile Spiele sind :ref:`LightmapGI <doc_using_lightmap_gi>` und :ref:`ReflectionProbes <doc_reflection_probes>` die einzigen unterstützten Optionen. Siehe auch :ref:`doc_introduction_to_global_illumination_alternatives`.
zh_cn: 对于移动游戏，\ :ref:`LightmapGI <doc_using_lightmap_gi>` 和 :ref:`ReflectionProbe <doc_reflection_probes>` 是唯一受支持的选项。另见 :ref:`doc_introduction_to_global_illumination_alternatives`\ 。
zh_tw: 對於行動遊戲，LightmapGI <doc_using_lightmap_gi>` 和 ReflectionProbes <doc_reflection_probes>` 是唯一支援的選項。另請參閱:ref:`doc_introduction_to_global_Illumination_alternatives`。

source: You can compare global illumination techniques in action using the `Global Illumination demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/global_illumination>`__.
de: Sie können Global Illumination-Techniken in der Praxis vergleichen, indem Sie das `Global Illumination-Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/3d/global_illumination>`__ verwenden.
zh_cn: 你可以使用 `全局照明演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/global_illumination>`__ 比较实际的全局照明技术。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Which global illumination mode should I use on meshes and lights?
de: Welchen Global Illumination-Modus sollte ich für Meshes und Lichter verwenden?
zh_cn: 我应该在网格和灯光上使用哪种全局光照模式？
zh_tw: 我應該在網格和燈光上使用哪種全域照明模式？

source: Regardless of which global illumination technique you use, there is no universally "better" global illumination mode. Still, here are some recommendations for meshes:
de: Unabhängig davon, welche Global Illumination-Technik Sie verwenden, gibt es keinen universell "besseren" Global Illumination-Modus. Dennoch gibt es hier einige Empfehlungen für Meshes:
zh_cn: 无论使用哪种全局光照技术，都没有普遍 “更好” 的全局光照模式。不过，这里有一些关于网格的建议：
zh_tw: 無論您使用哪種全域照明技術，都不存在普遍「更好」的全域照明模式。儘管如此，這裡還是一些關於網格的建議：

source: For static level geometry, use the **Static** global illumination mode *(default)*.
de: Für statische Level-Geometrie verwenden Sie den Global Illumination-Modus **Static** *(Default)*.
zh_cn: 对于静态级别的几何体，请使用 **静态** 全局光照模式 *（默认）* 。
zh_tw: 對於靜態關卡幾何體，請使用**靜態**全域照明模式*（預設）*。

source: For small dynamic geometry and players/enemies, use the **Disabled** global illumination mode. Small dynamic geometry will not be able to contribute a significant amount of indirect lighting, due to the geometry being smaller than a voxel. If you need indirect lighting for small dynamic objects, it can be simulated using an OmniLight3D or SpotLight3D node parented to the object.
de: Verwenden Sie für kleine dynamische Geometrien und Spieler/Gegner den Global Illumination-Modus **Disabled** . Kleine dynamische Geometrie wird nicht in der Lage sein, eine signifikante Menge an indirekter Beleuchtung beizutragen, da die Geometrie kleiner als ein Voxel ist. Wenn Sie eine indirekte Beleuchtung für kleine dynamische Objekte benötigen, kann diese mit einem OmniLight3D oder SpotLight3D-Node simuliert werden, der dem Objekt übergeordnet ist.
zh_cn: 对于小型动态几何体和玩家/敌人，请使用 **禁用** 全局光照模式。由于几何体小于体素 ( voxel) ，小的动态几何体将无法提供大量的间接照明。如果小型动态对象需要间接光照，则可以使用对象的父级 OmniLight3D 或 SpotLight3D 节点对其进行模拟。
zh_tw: 對於小型動態幾何體和玩家/敵人，請使用**停用**全域照明模式。由於幾何體小於體素，小型動態幾何體將無法貢獻大量間接照明。如果您需要小型動態物件的間接照明，可以使用該物件的父級 OmniLight3D 或 SpotLight3D 節點進行模擬。

source: For *large* dynamic level geometry (such as a moving train), use the **Dynamic** global illumination mode. Note that this only has an effect with VoxelGI, as SDFGI and LightmapGI do not support global illumination with dynamic objects.
de: Für *große* dynamische Level-Geometrien (z.B. ein fahrender Zug) verwenden Sie den Global Illumination-Modus **Dynamisch** . Beachten Sie, dass sich dies nur bei VoxelGI auswirkt, da SDFGI und LightmapGI keine Global Illumination mit dynamischen Objekten unterstützen.
zh_cn: 对于 *大* 动态级别的几何体（例如移动的火车），请使用 **动态** 全局光照模式。请注意，这只对 VoxelGI 有影响，因为 SDFGI 和 LightmapGI 不支持动态对象的全局光照。
zh_tw: 對於*大型*動態關卡幾何體（例如移動中的火車），請使用**動態**全域照明模式。請注意，這僅對 VoxelGI 有效，因為 SDFGI 和 LightmapGI 不支援動態物件的全域照明。

source: Here are some recommendations for light bake modes:
de: Hier sind einige Empfehlungen für Licht-Backmodi:
zh_cn: 以下是一些关于光照烘焙模式的建议：
zh_tw: 以下是一些關於光烘焙模式的建議：

source: For static level lighting, use the **Static** bake mode. The **Static** mode is also suitable for dynamic lights that don't change much during gameplay, such as a flickering torch.
de: Für statische Level-Beleuchtung verwenden Sie den Back-Modus **Statisch**. Der Modus **Statisch** eignet sich auch für dynamische Lichter, die sich während des Spiels kaum verändern, wie z.B. eine flackernde Fackel.
zh_cn: 对于静态级别的光照，请使用 **静态** 烘焙模式。 **静态** 模式也适用于在游戏过程中变化不大的动态灯光，例如闪烁的手电筒。
zh_tw: 對於靜態水平照明，請使用**靜態**烘焙模式。 **靜態**模式也適用於遊戲過程中變化不大的動態燈光，例如閃爍的火炬。
