Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/introduction_to_global_illumination.po
Languages: de, zh_cn, zh_tw

source: For short-lived dynamic effects (such as a weapon), use the **Disabled** bake mode to improve performance.
de: Bei kurzlebigen dynamischen Effekten (z.B. einer Waffe) sollten Sie den Back-Modus **Deaktiviert** verwenden, um die Performance zu verbessern.
zh_cn: 对于短暂的动态效果（如武器），请使用 **禁用** 烘焙模式来提高性能。
zh_tw: 對於短暫的動態效果（例如武器），請使用**禁用**烘焙模式來提高性能。

source: For long-lived dynamic effects (such as a rotating alarm light), use the **Dynamic** bake mode to improve quality *(default)*. Note that this only has an effect with VoxelGI and SDFGI, as LightmapGI does not support global illumination with dynamic lights.
de: Für langlebige dynamische Effekte (z.B. ein rotierendes Alarmlicht) verwenden Sie den Back-Modus **Dynamic**, um die Qualität zu verbessern *(Default)*. Beachten Sie, dass dies nur bei VoxelGI und SDFGI Wirkung zeigt, da LightmapGI keine Global Illumination mit dynamischen Lichtern unterstützt.
zh_cn: 对于长期动态效果（如旋转报警灯），请使用 **动态** 烘焙模式来提高质量 *（默认值）* 。请注意，这只对 VoxelGI 和 SDFGI 有影响，因为 LightmapGI 不支持动态灯光的全局光照。
zh_tw: 對於長期動態效果（例如旋轉警報燈），請使用**動態**烘焙模式來提高品質*（預設）*。請注意，這僅對 VoxelGI 和 SDFGI 有效，因為 LightmapGI 不支援動態燈光的全域照明。

source: Alternatives to GI techniques
de: Alternativen zu GI-Techniken
zh_cn: GI 技术的替代方案
zh_tw: 另外，也可以執行

source: If none of the GI techniques mentioned above fits, it's still possible to :ref:`simulate GI by placing additional lights manually <doc_faking_global_illumination>`. This requires more manual work, but it can offer good performance *and* good visuals if done right. This approach is still used in many modern games to this day.
de: Wenn keine der oben erwähnten GI-Techniken passt, ist es immer noch möglich, :ref:`GI zu simulieren, indem man zusätzliche Lichter manuell platziert <doc_faking_global_illumination>`. Dies erfordert mehr manuelle Arbeit, aber es kann eine gute Performance *und* eine gute Grafikqualität bieten, wenn es richtig gemacht wird. Dieser Ansatz wird auch heute noch in vielen modernen Spielen verwendet.
zh_cn: 如果上面提到的 GI 技术都不适用，仍然可以\ :ref:`通过手动放置附加灯光来模拟 GI <doc_faking_global_illumination>`\ 。这需要更多的手动操作，但如果做得好，就可以提供良好的性能和视觉效果。这种方法至今仍在许多现代游戏中使用。
zh_tw: 如果上述的 GI 技術都不適合，仍然可以透過手動放置額外的燈光來模擬 GI <doc_faking_global_Illumination>`。這需要更多的手動工作，但如果做得正確，它可以提供良好的性能*和*良好的視覺效果。時至今日，這種方法仍在許多現代遊戲中使用。

source: When targeting low-end hardware in situations where using LightmapGI is not viable (such as procedurally generated levels), relying on environment lighting alone or a constant ambient light factor may be a necessity. This may result in flatter visuals, but adjusting the ambient light color and sky contribution still makes it possible to achieve acceptable results in most cases.
de: In Situationen, in denen die Verwendung von LightmapGI nicht möglich ist (z.B. bei prozedural generierten Levels), kann es notwendig sein, sich allein auf die Umgebungsbeleuchtung oder einen konstanten Umgebungslichtfaktor zu verlassen. Dies kann zu einer flacheren Optik führen, aber durch die Anpassung der Umgebungslichtfarbe und des Himmelsanteils können in den meisten Fällen immer noch akzeptable Ergebnisse erzielt werden.
zh_cn: 当在使用LightmapGI无效的情况下（例如程序生成的表面）或者配置的硬件较低，可能需要单独依靠环境照明或稳定的环境光。这可能会导致没有凹凸感的视觉效果，但调整环境光的颜色和天空贴图后仍然可以在大多数情况下能接受的效果。
zh_tw: 當在使用 LightmapGI 不可行的情況下（例如程式產生的等級）針對低端硬體時，可能需要單獨依賴環境照明或恆定的環境光係數。這可能會導致更平坦的視覺效果，但調整環境光顏色和天空貢獻仍然可以在大多數情況下獲得可接受的結果。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: good
de: gut
