Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/introduction_to_global_illumination.po
Languages: de, zh_cn, zh_tw

source: Introduction to global illumination
de: Einführung in Global Illumination
zh_cn: 全局光照简介
zh_tw: 序言

source: What is global illumination?
de: Was ist Global Illumination?
zh_cn: 什么是全局光照？
zh_tw: 怎麼樣算是好的說明文件？

source: *Global illumination* is a catch-all term used to describe a system of lighting that uses both direct light (light that comes directly from a light source) and indirect light (light that bounces from a surface). In a 3D rendering engine, global illumination is one of the most important elements to achieving realistic lighting. Global illumination aims to mimic how light behaves in real life, such as light bouncing on surfaces and light being emitted from emissive materials.
de: *Global Illumination* (Globale Beleuchtung) ist ein Sammelbegriff für ein Beleuchtungssystem, das sowohl direktes Licht (Licht, das direkt von einer Lichtquelle kommt) als auch indirektes Licht (Licht, das von einer Oberfläche abprallt) verwendet. In einer 3D-Render-Engine ist die globale Beleuchtung eines der wichtigsten Elemente, um eine realistische Beleuchtung zu erreichen. Mit der globalen Beleuchtung soll das Verhalten des Lichts in der Realität nachgeahmt werden, z. B. Licht, das von Oberflächen zurückgeworfen wird, und Licht, das von emittierenden Materialien ausgeht.
zh_cn: *全局光照* 是一个综合性术语，用于描述一种使用直接光（直接来自光源的光线）和间接光（从表面反射的光线）的照明系统。在3D渲染引擎中，全局光照是实现逼真照明的最重要要素之一。全局光照旨在模拟现实生活中光线的行为，例如光线在表面上反射以及从自发光材料中发出的光线。
zh_tw: *全域照明*是一個包羅萬象的術語，用於描述同時使用直接光（直接來自光源的光）和間接光（從表面反射的光）的照明系統。在 3D 算繪引擎中，全域照明是實作逼真照明的最重要元素之一。全局照明旨在模仿現實生活中光的行為方式，例如光在表面上反射以及光從發光材料發出。

source: In the example below, the entire scene is illuminated by an emissive material (the white square at the top). The white wall and ceiling on the back is tinted red and green close to the walls, as the light bouncing on the colored walls is being reflected back onto the rest of the scene.
de: Im folgenden Beispiel wird die gesamte Szene von einem emittierenden Material beleuchtet (das weiße Quadrat oben). Die weiße Wand und die Decke auf der Rückseite sind in der Nähe der Wände rot und grün eingefärbt, da das an den farbigen Wänden auftreffende Licht auf den Rest der Szene zurückgeworfen wird.
zh_cn: 在下面的示例中，整个场景由自发光材质（顶部的白色方块）照亮。背面的白色墙壁和天花板在靠近墙壁的地方被染成红色和绿色，因为彩色墙壁上反射的光线正在反射回场景的其余部分。
zh_tw: 在下面的範例中，整個場景由發光材質（頂部的白色方塊）照亮。背面的白色牆壁和天花板在靠近牆壁的地方被染成紅色和綠色，因為彩色牆壁上反射的光線被反射回場景的其餘部分。

source: Global illumination is composed of several key concepts:
de: Global Illumination setzt sich aus mehreren Schlüsselkonzepten zusammen:
zh_cn: 全局光照由以下几个关键概念组成：
zh_tw: 全局照明由幾個關鍵概念組成：

source: Indirect diffuse lighting
de: Indirekte diffuse Beleuchtung
zh_cn: 间接漫反射光照
zh_tw: 間接漫射照明

source: This is the lighting that does not change depending on the camera's angle. There are two main sources of indirect diffuse lighting:
de: Dies ist die Beleuchtung, die sich je nach Kamerawinkel nicht verändert. Es gibt zwei Hauptquellen für indirekte diffuse Beleuchtung:
zh_cn: 这种光照不会因为相机的角度而改变。间接漫反射光照有两个主要来源：
zh_tw: 這是不隨相機角度而改變的照明。間接漫射照明有兩個主要來源：

source: Light *bouncing* on surfaces. This bounced lighting is multiplied with the material's albedo color. The bounced lighting can then be reflected by other surfaces, with decreasing impact due to light attenuation. In real life, light bounces an infinite number of times. However, for performance reasons, this can't be simulated in a game engine. Instead, the number of bounces is typically limited to 1 or 2 (or up to 16 when baking lightmaps). A greater number of bounces will lead to more realistic light falloff in shaded areas, at the cost of lower performance or greater bake times.
de: Licht, das von Oberflächen *abprallt*. Dieses zurückgeworfene Licht wird mit der Albedofarbe des Materials multipliziert. Das abgeprallte Licht kann dann von anderen Oberflächen reflektiert werden, wobei die Wirkung aufgrund der Lichtabschwächung abnimmt. Im wirklichen Leben prallt das Licht unendlich oft ab. Aus Performance-Gründen kann dies jedoch nicht in einer Spiel-Engine simuliert werden. Stattdessen ist die Anzahl der Licht-Abprällen in der Regel auf 1 oder 2 begrenzt (oder auf bis zu 16 beim Backen von Lightmaps). Eine größere Anzahl von Abprällen führt zu einem realistischeren Lichtabfall in schattierten Bereichen, allerdings auf Kosten einer geringeren Performance oder längerer Bake-Zeiten.
zh_cn: 光*弹跳*在表面上。这种反射光照会与材质的反照率颜色相乘。然后，反射的照明可以被其他表面反射，由于光衰减，影响会减小。在现实生活中，光线会反射无数次。但是出于性能原因，无法在游戏引擎中模拟。相反，退回次数通常限制为 1 或 2（烘焙光照贴图时最多限制为 16）。更多的反弹将导致阴影区域更真实的光线衰减，而代价是导致性能较低或烘烤时间更长。
zh_tw: 光在表面上「反彈」。這種反射光會與材質的反照率顏色相乘。然後，反射的照明可以被其他表面反射，由於光衰減而減少影響。在現實生活中，光會反射無數次。然而，出於性能原因，這無法在遊戲引擎中模擬。相反，反彈次數通常限制為 1 或 2（或在烘焙光貼圖時最多為 16）。反射次數越多，陰影區域的光線衰減就越真實，但代價是效能降低或烘烤時間更長。

source: Emissive materials can also emit light that can be bounced on surfaces. This acts as a form of *area lighting*. Instead of having an infinitely small point emit light using an OmniLight3D or SpotLight3D node, an area of a determined size will emit light using its own surface.
de: Emissive Materialien können auch Licht ausstrahlen, das an Oberflächen abprallt. Dies stellt eine Form der *Flächenbeleuchtung* dar. Anstatt einen unendlich kleinen Punkt mit einem OmniLight3D oder SpotLight3D-Node zu beleuchten, wird ein Bereich einer bestimmten Größe mit seiner eigenen Oberfläche beleuchtet.
zh_cn: 自发光材质还可以发出可以在表面上反弹的光。这充当 *区域照明* 的一种形式。与使用 OmniLight3D 或 SpotLight3D 节点发光不同，确定大小的区域将使用自己的表面发光。
zh_tw: 發光材料還可以發射可在表面反射的光。這相當於“區域照明”的一種形式。確定大小的區域將使用自己的表面發光，而不是使用 OmniLight3D 或 SpotLight3D 節點讓無限小的點發光。

source: Direct diffuse lighting is already handled by the light nodes themselves, which means that global illumination algorithms only try to represent indirect lighting.
de: Direkte diffuse Beleuchtung wird bereits von den Licht-Nodes selbst behandelt, was bedeutet, dass Global Illumination-Algorithmen nur versuchen, indirekte Beleuchtung darzustellen.
zh_cn: 直接漫反射光照已经由灯光节点本身处理，这意味着全局光照算法只尝试表示间接光照。
zh_tw: 直接漫射照明已經由光節點本身處理，這意味著全局照明演算法僅嘗試表示間接照明。

source: Different global illumination techniques offer varying levels of accuracy to represent indirect diffuse lighting. See the comparison table at the bottom of this page for more information.
de: Verschiedene Global Illumination-Techniken bieten unterschiedliche Genauigkeitsgrade bei der Darstellung von indirekter diffuser Beleuchtung. In der Vergleichstabelle am Ende dieser Seite finden Sie weitere Informationen.
zh_cn: 不同的全局光照技术提供不同级别的精度来表示间接漫反射光照。有关详细信息请参阅本页底部的比较表。
zh_tw: 不同的全域照明技術提供不同等級的精確度來表示間接漫射照明。有關更多信息，請參閱本頁底部的比較表。

source: To provide more accurate ambient occlusion for small objects, screen-space ambient occlusion (SSAO) can be enabled in the :ref:`environment <doc_environment_and_post_processing>` settings. SSAO has a significant performance cost, so make sure to disable it when targeting low-end hardware.
de: Um eine genauere Umgebungs-Occlusion für kleine Objekte zu ermöglichen, kann die Screen-Space Ambient-Occlusion (SSAO) in den :ref:`Environment <doc_environment_and_post_processing>`-Einstellungen aktiviert werden. SSAO ist mit erheblichen Performance-Kosten verbunden, daher sollten Sie es deaktivieren, wenn Sie Low-End-Hardware verwenden.
zh_cn: 为较小的对象提供更精确的环境光遮蔽，屏幕空间环境光遮蔽（SSAO）可以在\ :ref:`环境 <doc_environment_and_post_processing>`\ 设置中启用。SSAO 具有较大的性能开销，因此在针对低端硬件时请确保禁用它。
zh_tw: 為了提供小物件更準確的環境光遮擋，可以在環境 <doc_environment_and_post_processing> 設定中啟用螢幕空間環境光遮擋 (SSAO)。 SSAO 具有顯著的效能成本，因此在針對低階硬體時請確保已停用它。

source: Indirect diffuse lighting may be a source of color banding in scenes with no detailed textures. This results in light gradients not being smooth, but having a visible "stepping" effect instead. See the :ref:`doc_3d_rendering_limitations_color_banding` section in the 3D rendering limitations documentation for ways to reduce this effect.
de: Indirektes diffuses Licht kann in Szenen ohne detaillierte Texturen zu Color Banding führen. Dies führt dazu, dass Lichtverläufe nicht gleichmäßig sind, sondern stattdessen einen sichtbaren "Treppeneffekt" haben. Siehe den Abschnitt :ref:`doc_3d_rendering_limitations_color_banding` in der Dokumentation der 3D-Rendering-Einschränkungen für Möglichkeiten, um diesen Effekt zu reduzieren.
zh_cn: 间接漫反射照明可能是没有细节纹理的场景中色带的来源。这导致光线梯度不平滑，而是具有可见的“步进”效果。减少这种效果的方法见 :ref:`doc_3d_rendering_limitations_color_banding` 部分。
zh_tw: 間接漫射照明可能是沒有詳細紋理的場景中色帶的來源。這會導致光線漸進不平滑，而是具有可見的“步進”效果。請參閱 3D 算繪限製檔案中的 doc_3d_rendering_limitations_color_banding 部分，以了解減少這種影響的方法。

source: Specular lighting
zh_cn: 镜面反射光效果
zh_tw: \|regular\| 稍微

source: Specular lighting is also referred to as *reflections*. This is the lighting that changes in intensity depending on the camera's angle. This specular lighting can be *direct* or *indirect*.
de: Specular Lighting wird auch als *Reflexionen* bezeichnet. Dabei handelt es sich um die Beleuchtung, deren Intensität sich je nach Kamerawinkel ändert. Dieses Specular Lighting kann *direkt* oder *indirekt* sein.
zh_cn: 镜面反射照明也被称为 *反射* 。这是根据摄像机角度而变化强度的照明。这种镜面照明可以是 *直接* 或 *间接* 。
zh_tw: 鏡面照明也稱為“反射”。這是根據相機角度改變強度的照明。這種鏡面照明可以是「直接」或「間接」。

source: Most global illumination techniques offer a way to render specular lighting. However, the degree of accuracy at which specular lighting is rendered varies greatly from technique to technique. See the comparison table at the bottom of this page for more information.
de: Die meisten Global Illumination-Techniken bieten eine Möglichkeit zum Rendern von Specular Lighting. Der Genauigkeitsgrad, mit dem das Specular Lighting gerendert wird, ist jedoch von Technik zu Technik sehr unterschiedlich. In der Vergleichstabelle am Ende dieser Seite finden Sie weitere Informationen.
zh_cn: 大多数全局光照技术都提供了一种渲染镜面反射光照的方法。然而，不同技术渲染镜面反射光照的精度差异很大。有关详细信息，请参阅本页底部的比较表。
zh_tw: 大多數全局照明技術都提供了算繪鏡面照明的方法。然而，不同技術算繪鏡面光照的精確度差異很大。有關更多信息，請參閱本頁底部的比較表。

source: To provide more accurate reflections for small objects, screen-space reflections (SSR) can be enabled in the :ref:`environment <doc_environment_and_post_processing>` settings. SSR has a significant performance cost (even more so than SSAO), so make sure to disable it when targeting low-end hardware.
de: Um genauere Reflexionen für kleine Objekte zu erhalten, kann die Screen-Space-Reflexion (SSR) in den :ref:`Environment <doc_environment_and_post_processing>`-Einstellungen aktiviert werden. SSR ist mit erheblichen Performance-Kosten verbunden (sogar noch mehr als SSAO), daher sollten Sie es deaktivieren, wenn Sie Low-End-Hardware verwenden.
zh_cn: 为了给较小的对象提供更准确的反射，可以在\ :ref:`环境 <doc_environment_and_post_processing>`\ 设置中启用屏幕空间反射（SSR）。SSR 的性能开销很大（甚至比 SSAO 更高），因此在针对低端硬件时一定要禁用它。
zh_tw: 為了提供小物件更準確的反射，可以在環境 <doc_environment_and_post_processing> 設定中啟用螢幕空間反射 (SSR)。 SSR 具有顯著的效能成本（甚至比 SSAO 更高），因此在針對低階硬體時請確保已停用它。

source: Which global illumination technique should I use?
de: Welche Global Illumination-Technik sollte ich verwenden?
zh_cn: 我应该使用哪种全局光照技术？
zh_tw: GDScript是什麼？為什麼我要用它？

source: When determining a global illumination (GI) technique to use, there are several criteria to keep in mind:
de: Bei der Auswahl einer Global Illumination (GI)-Technik sind mehrere Kriterien zu beachten:
zh_cn: 在确定要使用全局光照（GI）技术时，需要记住以下几个准则：
zh_tw: 在確定要使用的全域照明 (GI) 技術時，需要牢記幾個標準：

source: **Performance.** Real-time GI techniques are usually more expensive compared to semi-real-time or baked techniques. Note that most of the cost in GI rendering is spent on the GPU, rather than the CPU.
de: **Performance.** Echtzeit-GI-Techniken sind in der Regel teurer als Semi-Echtzeit- oder Back-Techniken. Beachten Sie, dass der Großteil der Kosten beim GI-Rendering auf der GPU und nicht auf der CPU anfällt.
zh_cn: **性能。** 与半实时或烘焙技术相比，实时 GI 技术通常开销更大。请注意，GI 渲染的大部分开销都花在了 GPU 上，而非 CPU 上。
zh_tw: **性能。** 與半實時或烘焙技術相比，實時 GI 技術通常更昂貴。請注意，GI 算繪的大部分成本都花在 GPU 上，而不是 CPU 上。

source: **Visuals.** On top of not performing the best, real-time GI techniques generally don't provide the best visual output. This is especially the case in a mostly static scene where the dynamic nature of real-time GI is not easily noticeable. If maximizing visual quality is your goal, baked techniques will often look better and will result in fewer light leaks.
de: **Grafikdarstellung.** Abgesehen davon, dass die Performance nicht die beste ist, bieten Echtzeit-GI-Techniken im Allgemeinen auch nicht die beste visuelle Ausgabe. Dies ist vor allem in einer überwiegend statischen Szene der Fall, in der die dynamische Natur der Echtzeit-GI nicht leicht zu erkennen ist. Wenn die Maximierung der visuellen Qualität Ihr Ziel ist, sehen gebackene Techniken oft besser aus und führen zu weniger Lichtlecks.
zh_cn: **视觉效果。** 除了不能达到最佳效果外，实时 GI 技术通常不能提供最佳的视觉输出。尤其是在大多数静态场景中，其中实时 GI 的动态特性不容易被注意到。如果你的目标是最大限度地提高视觉质量，那么烘焙技术通常会看起来更好，并且会减少漏光。
zh_tw: **視覺效果。** 除了表現不佳之外，即時 GI 技術通常無法提供最佳的視覺輸出。在大多數靜態場景中尤其如此，即時 GI 的動態功能不容易被注意到。如果最大化視覺品質是您的目標，烘焙技術通常會看起來更好，並且會減少漏光。

source: **Real-time ability.** Some GI techniques are fully real-time, whereas others are only semi-real-time or aren't real-time at all. Semi-real-time techniques have restrictions that fully real-time techniques don't. For instance, dynamic objects may not contribute emissive lighting to the scene. Non-real-time techniques do not support *any* form of dynamic GI, so it must be faked using other techniques if needed (such as placing positional lights near emissive surfaces). Real-time ability also affects the GI technique's viability in procedurally generated levels.
de: **Echtzeitfähigkeit** Einige GI-Techniken sind vollständig echtzeitfähig, während andere nur semi-echtzeitfähig oder überhaupt nicht echtzeitfähig sind. Semi-Echtzeit-Techniken haben Einschränkungen, die bei vollständig Echtzeit-Techniken nicht gegeben sind. So können dynamische Objekte beispielsweise keine emittierende Beleuchtung zur Szene beitragen. Nicht-Echtzeit-Techniken unterstützen *keine* Form von dynamischem GI, so dass es bei Bedarf mit anderen Techniken vorgetäuscht werden muss (z.B. durch Platzierung von Positionslichtern in der Nähe von emittierenden Oberflächen). Die Echtzeitfähigkeit wirkt sich auch auf die Realisierbarkeit der GI-Technik in prozedural generierten Levels aus.
zh_cn: **实时能力。** 一些 GI 技术是完全实时的，而其他技术只是半实时的或根本不是实时的。半实时技术有完全实时技术没有的限制。例如，动态对象可能不会为场景提供自发光照明。非实时技术不支持任何形式的动态 GI ，因此如果需要，必须使用其他技术进行伪造（例如在发射表面附近放置定位灯）。实时能力也会影响 GI 技术在程序化生成关卡上的可行性。
zh_tw: **實時能力。** 一些 GI 技術是完全實時的，而另一些則只是半實時或根本不是實時的。半實時技術具有全實時技術沒有的限制。例如，動態物件可能不會向場景提供發射照明。非即時技術不支援「任何」形式的動態 GI，因此如果需要，必須使用其他技術來偽造它（例如將位置光放置在發光錶面附近）。即時能力也會影響 GI 技術在程式產生關卡中的可行性。

source: **User work needed.** Some GI techniques are fully automatic, whereas others require careful planning and manual work on the user's side. Depending on your time budget, some GI techniques may be preferable to others.
de: *Aufwand für den Benutzer.* Einige GI-Techniken sind vollautomatisch, während andere eine sorgfältige Planung und manuelle Arbeit auf Seiten des Benutzers erfordern. Je nach Ihrem Zeitbudget sind einige GI-Techniken anderen vorzuziehen.
zh_cn: **需要用户工作。** 一些 GI 技术是完全自动的，而另一些则需要用户仔细规划和手动操作。根据你的时间预算，某些 GI 技术可能比其他技术更可取。
zh_tw: **需要使用者工作。** 有些 GI 技術是全自動的，而其他技術則需要使用者仔細規劃和手動工作。根據您的時間預算，某些 GI 技術可能比其他技術更好。

source: Here's a comparison of all the global illumination techniques available in Godot:
de: Hier finden Sie einen Vergleich aller in Godot verfügbaren Global Illumination-Techniken:
zh_cn: 以下是 Godot 中可用的所有全局光照技术的比较：
zh_tw: 以下是 Godot 中可用的所有全域照明技術的比較：

source: Performance
zh_cn: 性能
zh_tw: 效能

source: In order of performance from fastest to slowest:
de: In der Reihenfolge der Performance vom Schnellsten zum Langsamsten:
zh_cn: 按照性能从最快到最慢的顺序：
zh_tw: 按照效能從最快到最慢的順序：

source: **ReflectionProbe:**
zh_cn: **反射探针：**
zh_tw: **反射：**

source: ReflectionProbes with their update mode set to **Always** are much more expensive than probes with their update mode set to **Once** (the default). Suited for integrated graphics when using the **Once** update mode. *Available when using the Forward Mobile backend. Will be available in the Compatibility backend in later releases.*
de: ReflectionProbes, deren Aktualisierungsmodus auf **Immer** eingestellt ist, sind viel teurer als Probes, deren Aktualisierungsmodus auf **Einmal** eingestellt ist (die Default-Einstellung). Geeignet für integrierte Grafiken bei Verwendung des Aktualisierungsmodus **Einmal**. *Verfügbar, wenn das Forward Mobile-Backend verwendet wird. Wird in späteren Releases im Kompatibilitäts-Backend verfügbar sein.*
zh_cn: 更新模式设置为 **总是** 的反射探针比更新模式设置为 **一次**（默认值）的探针贵得多。适用于使用 **一次** 更新模式时的集成图形。*使用转发移动后端时可用。将在更高版本的兼容性后端中提供。*
zh_tw: 更新模式設定為 **Always** 的 ReflectionProbes 比更新模式設定為 **Once** （預設）的探查昂貴得多。適用於使用 **Once** 更新模式時的整合式顯示卡。 *使用 Forward Mobile 後端時可用。將在以後版本的兼容性後端中提供。*

source: **LightmapGI:**
zh_tw: **字面值**

source: Lights can be baked with indirect lighting only, or fully baked on a per-light basis to further improve performance. Hybrid setups can be used (such as having a real-time directional light and fully baked positional lights). Directional information can be enabled before baking to improve visuals at a small performance cost (and at the cost of larger file sizes). Suited for integrated graphics. *Available when using the Forward Mobile backend. Will be available in the Compatibility backend in later releases.*
de: Lichter können entweder nur mit indirektem Licht oder vollständig pro Licht gebacken werden, um die Performance weiter zu verbessern. Es können hybride Setups verwendet werden (z.B. mit einem Echtzeit-gerichteten Licht und vollständig gebackenen Positionslichtern). Richtungsinformationen können vor dem Backen aktiviert werden, um die Grafik zu verbessern, ohne dass die Performance darunter leidet (und auf Kosten der Dateigröße). Geeignet für integrierte Grafikkarten. *Verfügbar, wenn das Forward Mobile-Backend verwendet wird. Wird in späteren Versionen im Kompatibilitäts-Backend verfügbar sein.*
zh_cn: 灯光可以仅使用间接照明进行烘焙，也可以基于每个灯光进行完全烘焙，以进一步提高性能。 也可以使用混合设置（例如具有实时平行光和完全烘焙的位置光）。 可以在烘焙之前启用方向信息，以较小的性能成本（并且以较大的文件大小为代价）改善视觉效果。 适合集成显卡。 *使用 Forward Mobile 后端时可用。 将在以后版本的兼容性后端中提供。*
zh_tw: 燈光可以僅使用間接照明進行烘焙，也可以基於每個燈光進行完全烘焙，以進一步提高性能。可以使用混合設定（例如具有即時定向光和完全烘焙的位置光）。可以在烘焙之前啟用方向訊息，以較小的性能成本（並以較大的檔案大小為代價）改善視覺效果。適合整合顯示卡。 *使用 Forward Mobile 後端時可用。將在以後版本的兼容性後端中提供。*

source: The bake's number of subdivisions can be adjusted to balance between performance and quality. The VoxelGI rendering quality can be adjusted in the Project Settings. The rendering can optionally be performed at half resolution (and then linearly scaled) to improve performance significantly. **Not available** *when using the Forward Mobile or Compatibility backends.*
de: Die Anzahl der Unterteilungen des gebackenen Lichtern kann angepasst werden, um ein Gleichgewicht zwischen Performance und Qualität herzustellen. Die Qualität des VoxelGI-Renderings kann in den Projekteinstellungen angepasst werden. Das Rendering kann optional mit halber Auflösung durchgeführt werden (und dann linear skaliert werden), um die Performance deutlich zu verbessern. **Nicht verfügbar** *bei Verwendung der Forward Mobile oder Kompatibilitäts-Backends.*
zh_cn: 可以调整烘焙的细分数量以平衡性能和质量。 VoxelGI 渲染质量可以在项目设置中调整。 渲染可以选择以半分辨率执行（然后线性缩放）以显着提高性能。 **不可用于** *使用 Forward Mobile 或兼容性后端时。*
zh_tw: 可以調整烘焙的細分數量以平衡性能和品質。 VoxelGI 算繪品質可以在專案設定中調整。算繪可以選擇以半解析度執行（然後線性縮放）以顯著提高效能。 **不可用** *使用 Forward Mobile 或相容性後端時。*

source: **Screen-space indirect lighting (SSIL):**
de: **Screen-Space indirekte Beleuchtung (SSIL):**
zh_cn: **屏幕空间间接照明（Screen-space indirect lighting, SSIL）：**
zh_tw: **GLES3:** 螢幕空間週遭遮擋。

source: The SSIL quality and number of blur passes can be adjusted in the Project Settings. By default, SSIL rendering is performed at half resolution (and then linearly scaled) to ensure a reasonable performance level. **Not available** *when using the Forward Mobile or Compatibility backends.*
de: Die SSIL-Qualität und die Anzahl der Unschärfedurchläufe können in den Projekteinstellungen angepasst werden. Standardmäßig wird das SSIL-Rendering mit halber Auflösung durchgeführt (und dann linear skaliert), um eine angemessene Performance zu gewährleisten. **Nicht verfügbar** *bei Verwendung der Forward Mobile oder Kompatibilitäts-Backends.*
zh_cn: 以在项目设置中调整 SSIL 质量和模糊通道数量。 默认情况下，SSIL 渲染以一半分辨率执行（然后线性缩放）以确保合理的性能水平。 **不可用于** *使用 Forward Mobile 或兼容性后端时。*
zh_tw: 可以在「專案設定」中調整 SSIL 品質和模糊頻道數量。預設情況下，SSIL 算繪以一半解析度執行（然後線性縮放）以確保合理的效能等級。 **不可用** *使用 Forward Mobile 或相容性後端時。*

source: The number of cascades can be adjusted to balance performance and quality. The number of rays thrown per frame can be adjusted in the Project Settings. The rendering can optionally be performed at half resolution (and then linearly scaled) to improve performance significantly. **Not available** *when using the Forward Mobile or Compatibility backends.*
de: Die Anzahl der Kaskaden kann angepasst werden, um ein Gleichgewicht zwischen Performance und Qualität herzustellen. Die Anzahl der pro Frame geworfenen Strahlen kann in den Projekteinstellungen angepasst werden. Das Rendering kann optional mit halber Auflösung durchgeführt werden (und dann linear skaliert werden), um die Performance deutlich zu verbessern. **Nicht verfügbar** *bei Verwendung der Forward Mobile oder Kompatibilitäts-Backends.*
zh_cn: 可以调整级联的数量以平衡性能和质量。 每帧投射的光线数量可以在“项目设置”中调整。 渲染可以选择以半分辨率执行（然后线性缩放）以显着提高性能。 **不可用于** *使用 Forward Mobile 或兼容性后端时。*
zh_tw: 可以調整級聯的數量以平衡性能和品質。每影格投射的光線數量可以在「專案設定」中調整。算繪可以選擇以半解析度執行（然後線性縮放）以顯著提高效能。 **不可用** *使用 Forward Mobile 或相容性後端時。*

source: Visuals
de: Grafikqualität
zh_tw: 視覺腳本 (VisualScript)

source: For comparison, here's a 3D scene with no global illumination options used:
de: Zum Vergleich sehen Sie hier eine 3D-Szene ohne Global Illumination-Optionen:
zh_cn: 为了进行比较，这里有一个未使用全局照明选项的 3D 场景：
zh_tw: 為了進行比較，這裡有一個未使用全域照明選項的 3D 場景：

source: A 3D scene without any form of global illumination (only constant environment lighting). The box and sphere near the camera are both dynamic objects.
de: Eine 3D-Szene ohne jegliche Form von Global Illumination (nur konstante Umgebungsbeleuchtung). Die Box und die Kugel in der Nähe der Kamera sind beide dynamische Objekte.
zh_cn: 没有使用任何形式的全局照明的 3D 场景（只有恒定的环境照明）。 相机附近的盒子和球体都是动态对象。
zh_tw: 沒有任何形式的全局照明的 3D 場景（只有恆定的環境照明）。相機附近的盒子和球體都是動態物體。

source: Here's how Godot's various global illumination techniques compare:
de: Im Folgenden werden die verschiedenen Global Illumination-Techniken von Godot verglichen:
zh_cn: 以下是 Godot 的各种全局照明技术的比较：
zh_tw: 以下是 Godot 的各種全域照明技術的比較：

source: **VoxelGI:** |average| Good reflections and indirect lighting, but beware of leaks.
de: **VoxelGI:** |average| Gute Reflexionen und indirekte Beleuchtung, aber passen Sie auf Lecks auf.
zh_cn: **VoxelGI：** |average| 良好的反射和间接照明，但要小心泄漏。
zh_tw: **VoxelGI：** |平均|良好的反射和間接照明，但要小心洩漏。

source: average
de: Durchschnitt
zh_tw: 走訪

source: Due to its voxel-based nature, VoxelGI will exhibit light leaks if walls and floors are too thin. It's recommended to make sure all solid surfaces are at least as thick as one voxel.
de: Da VoxelGI auf Voxeln basiert, kommt es zu Lichtlecks, wenn Wände und Böden zu dünn sind. Es wird empfohlen, sicherzustellen, dass alle festen Oberflächen mindestens so dick wie ein Voxel sind.
zh_cn: 由于其基于体素的性质，如果墙壁和地板太薄，VoxelGI 将出现漏光。 建议确保所有实体表面至少与一个体素一样厚。
zh_tw: 由於其基於體素的性質，如果牆壁和地板太薄，VoxelGI 將出現漏光。建議確保所有實體表面至少與一個體素一樣厚。

source: Streaking artifacts may also be visible on sloped surfaces. In this case, tweaking the bias properties or rotating the VoxelGI node can help combat this.
de: Auf schrägen Oberflächen können auch Streifenartefakte sichtbar sein. In diesem Fall kann die Anpassung der Bias-Eigenschaften oder das Drehen des VoxelGI-Nodes helfen, dies zu verhindern.
zh_cn: 在倾斜的表面上也可能会看到条纹伪影（streaking artifacts）。 在这种情况下，调整偏置属性或旋转 VoxelGI 节点可以对解决这个问题有帮助。
zh_tw: 在傾斜的表面上也可能會看到條紋偽影。在這種情況下，調整偏移屬性或旋轉 VoxelGI 節點可以幫助解決這個問題。

source: VoxelGI in action.
de: VoxelGI in Aktion.
zh_cn: VoxelGI 的实际应用。
zh_tw: VoxelGI 的實際應用。
