Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/reflection_probes.po
Languages: de, zh_cn, zh_tw

source: Reflection probes
zh_cn: 反射探针
zh_tw: 反射探查

source: Reflection probes are only supported in the Clustered Forward and Forward Mobile rendering backends, not the Compatibility backend.
de: Reflection-Probes werden nur in den Rendering-Backends Clustered Forward und Forward Mobile unterstützt, nicht im Kompatibilität-Backend.
zh_cn: 反射探针仅在集群 Forward 和 Forward 移动渲染后端中受支持，在兼容性后端中则不受支持。

source: As stated in the :ref:`doc_standard_material_3d`, objects can show reflected and/or diffuse light. Reflection probes are used as a source of reflected *and* ambient light for objects inside their area of influence. They can be used to provide more accurate reflections than :ref:`VoxelGI <doc_using_voxel_gi>` and :ref:`SDFGI <doc_using_sdfgi>` while being fairly cheap on system resources.
de: Wie in der :ref:`doc_standard_material_3d` angegeben, können Objekte reflektiertes und/oder diffuses Licht darstellen. Reflection-Probes werden als Quelle von reflektiertem *und* Umgebungslicht für Objekte innerhalb ihres Einflussbereichs verwendet. Sie können verwendet werden, um genauere Reflexionen als :ref:`VoxelGI <doc_using_voxel_gi>` und :ref:`SDFGI <doc_using_sdfgi>` zu erreichen, während sie relativ wenig Systemressourcen benötigen.
zh_cn: 如 :ref:`doc_standard_material_3d` 中所述，物体可以显示反射光和/或漫射光。 反射探针用作影响区域内物体的反射 *和* 环境光源。 它们可用于提供比 :ref:`VoxelGI <doc_using_voxel_gi>` 和 :ref:`SDFGI <doc_using_sdfgi>` 更准确的反射，同时占用的系统资源相当便宜。
zh_tw: 如下所示 :ref:`doc_spatial_material` , 物件可以顯示反射光或漫反射光. 反射探頭用作其影響區域內物體的反射光和環境光源.

source: Since reflection probes can also store ambient light, they can be used as a low-end alternative to VoxelGI and SDFGI when :ref:`baked lightmaps <doc_using_lightmap_gi>` aren't viable (e.g. in procedurally generated levels).
de: Da Reflection-Probes auch Umgebungslicht speichern können, können sie als einfache Alternative zu VoxelGI und SDFGI verwendet werden, wenn :ref:`gebackene Lightmaps <doc_using_lightmap_gi>` nicht praktikabel sind (z.B. in prozedural generierten Levels).
zh_cn: 由于反射探针还可以存储环境光，因此当 :ref:`烘焙光照贴图 <doc_using_lightmap_gi>` 不可用时（例如在程序生成的关卡中），它们可以用作 VoxelGI 和 SDFGI 的低端替代品。
zh_tw: 由於反射探查還可以儲存環境光，因此當烘焙光照貼圖 <doc_using_lightmap_gi> 不可行時（例如在程式產生的關卡中），它們可以用作 VoxelGI 和 SDFGI 的低端替代品。

source: Reflection probes can also be used at the same time as screen-space reflections to provide reflections for off-screen objects. In this case, Godot will blend together the screen-space reflections and reflections from reflection probes.
de: Reflection-Probes können auch gleichzeitig mit Screen-Space-Reflexionen verwendet werden, um Reflexionen für Objekte außerhalb des Bildschirms zu erzeugen. In diesem Fall mischt Godot die Screen-Space-Reflexionen und die Reflexionen der Reflection-Probes zusammen.
zh_cn: 反射探针还可以与屏幕空间反射同时使用，为屏幕外的对象提供反射。 在这种情况下，Godot 会将屏幕空间反射和反射探针的反射混合在一起。
zh_tw: 反射探查還可以與螢幕空間反射同時使用，為螢幕外物件提供反射。在這種情況下，Godot 會將螢幕空間反射和反射探頭的反射混合在一起。

source: Not sure if ReflectionProbe is suited to your needs? See :ref:`doc_introduction_to_global_illumination_comparison` for a comparison of GI techniques available in Godot 4.
de: Sie sind nicht sicher, ob ReflectionProbe für Ihre Bedürfnisse geeignet ist? Unter :ref:`doc_introduction_to_global_illumination_comparison` finden Sie einen Vergleich der in Godot 4 verfügbaren GI-Techniken.
zh_cn: 不确定 ReflectionProbe 是否符合你的需求？那么请到 :ref:`doc_introduction_to_global_illumination_comparison` 来查阅 Godot 中可用的 GI 技术的比较。
zh_tw: 不確定 ReflectionProbe 是否適合您的需求？請參閱 doc_introduction_to_global_Illumination_comparison` 以了解 Godot 4 中可用的 GI 技術的比較。

source: Visual comparison
de: Visueller Vergleich
zh_cn: 视觉比较
zh_tw: 視覺比較

source: Reflection probe disabled. Environment sky is used as a fallback.
de: Reflection-Probe deaktiviert. Der Umgebungshimmel wird als Ausweichlösung verwendet.
zh_cn: 反射探针禁用。环境天空作为反馈使用。
zh_tw: 反射探頭禁用。環境天空用作後備。

source: Reflection probe enabled.
de: Reflection-Probe aktiviert.
zh_cn: 反射探针启用。
zh_tw: 必須開啟「Repeat」

source: Reflection probe enabled with LightmapGI used at the same time. The lightmap appears in the reflection.
de: Reflection-Probe aktiviert mit gleichzeitiger Verwendung von LightmapGI. Die Lightmap erscheint in der Reflexion.
zh_cn: 反射探针与 LightmapGI 同时启用。光照贴图出现在反射中。

source: By combining reflection probes with screen-space reflections, you can get the best of both worlds: high-quality reflections for general room structure (that remain present when off-screen), while also having real-time reflections for small details.
de: Durch die Kombination von Reflection-Probes mit Screen-Space-Reflexionen erhalten Sie das Beste aus beiden Welten: hochwertige Reflexionen für die allgemeine Raumstruktur (die auch außerhalb des Bildschirms erhalten bleiben) und gleichzeitig Echtzeit-Reflexionen für kleine Details.
zh_cn: 通过将反射探针与屏幕空间反射相结合，你可以两全其美：既能够一般房间结构提供高质量反射（在屏幕外时仍然存在），还可以为小的细节提供实时反射。
zh_tw: 透過將反射探頭與螢幕空間反射相結合，您可以兩全其美：一般房間結構的高品質反射（在螢幕外時仍然存在），同時還可以對小細節進行即時反射。

source: Reflections in a room using ReflectionProbe only.
de: Reflexionen in einem Raum nur mit ReflectionProbe.
zh_cn: 仅使用 ReflectionProbe 在房间中进行的反射。
zh_tw: 僅使用 ReflectionProbe 在房間中進行反射。

source: Reflections in a room using ReflectionProbe only. Notice how small details don't have any reflections.
de: Reflexionen in einem Raum nur mit ReflectionProbe. Beachten Sie, dass kleine Details keine Reflektionen aufweisen.
zh_cn: 仅使用 ReflectionProbe 在房间中进行的反射。注意，小的细节没有任何反射。
zh_tw: 僅使用 ReflectionProbe 在房間中進行反射。請注意，小細節沒有任何反射。

source: Reflections in a room using screen-space reflections only.
de: Reflexionen in einem Raum, der nur Screen-Space-Reflexionen verwendet.
zh_cn: 仅使用屏幕空间反射在房间中进行的反射。
zh_tw: 僅使用螢幕空間反射在房間中進行反射。

source: Reflections in a room using screen-space reflections only. Notice how the reflection on the sides of the room's walls is partly missing due to being off-screen.
de: Reflexionen in einem Raum, der nur Screen-Space-Reflexionen verwendet. Beachten Sie, dass die Reflexion an den Seitenwänden des Raums teilweise fehlt, da sie sich außerhalb des Bildschirms befindet.
zh_cn: 仅使用屏幕空间反射在房间中进行的反射。注意，由于房间的墙面侧面已经在屏幕之外，其上的反射出现了部分缺失。
zh_tw: 僅使用螢幕空間反射在房間中進行反射。請注意，房間牆壁側面的反射由於不在螢幕上而部分遺失。

source: Reflections in a room using ReflectionProbe and screen-space reflections together.
de: Reflexionen in einem Raum mit ReflectionProbe und Screen-Space-Reflexionen zusammen.
zh_cn: 同时使用了 RefectionProbe 和屏幕空间反射在房间中进行的反射。
zh_tw: 房間中的反射同時使用 ReflectionProbe 和螢幕空間反射。

source: Reflections in a room using ReflectionProbe and screen-space reflections together. The screen-space reflections are blended with the reflection probe, acting as a fallback in situations where the reflection probe fails to display any reflection.
de: Reflexionen in einem Raum mit ReflectionProbe und Screen-Space-Reflexionen zusammen. Die Screen-Space-Reflexionen werden mit der Reflection-Probe gemischt und dienen als Ausweichlösung, wenn die Reflection-Probe keine Reflexion anzeigt.
zh_cn: 同时使用了 RefectionProbe 和屏幕空间反射在房间中进行的反射。屏幕空间反射和反射探针相混合，在反射探针无法显示任何反射的情况下充当后备。
zh_tw: 房間中的反射同時使用 ReflectionProbe 和螢幕空間反射。螢幕空間反射與反射探查混合，在反射探查無法顯示任何反射的情況下充當後備。

source: Setting up a ReflectionProbe
de: Einrichten einer ReflectionProbe
zh_cn: 设置 ReflectionProbe
zh_tw: 測試開發版本

source: Add a :ref:`class_ReflectionProbe` node.
de: Hinzufügen eines :ref:`class_ReflectionProbe` Nodes.
zh_cn: 添加一个 :ref:`class_ReflectionProbe` 节点.
zh_tw: :ref:`class_NodePath` 或 StringName

source: Configure the ReflectionProbe's extents in the inspector to fit your scene. To get reasonably accurate reflections, you should generally have one ReflectionProbe node per room (sometimes more for large rooms).
de: Konfigurieren Sie die Ausdehnung der ReflectionProbe im Inspektor so, dass sie zu Ihrer Szene passt. Um einigermaßen genaue Reflexionen zu erhalten, sollten Sie in der Regel einen ReflectionProbe-Node pro Raum haben (bei großen Räumen manchmal mehr).
zh_cn: 在检查器中配置 ReflectionProbe 的范围以适应你的场景。 为了获得准确的反射，每个房间通常应该有一个 ReflectionProbe 节点（有时，对于大房间来说会有更多）。
zh_tw: 在屬性面板中配置 ReflectionProbe 的範圍以適合您的場景。為了獲得相當準確的反射，每個房間通常應該有一個 ReflectionProbe 節點（有時對於大房間來說更多）。

source: Remember that ReflectionProbe extents don't have to be square, and you can even rotate the ReflectionProbe node to fit rooms that aren't aligned with the X/Z grid. Use this to your advantage to better cover rooms without having to place too many ReflectionProbe nodes.
de: Denken Sie daran, dass die ReflectionProbe-Ausdehnung nicht quadratisch sein muss, und Sie können den ReflectionProbe-Node sogar drehen, um Räume abzudecken, die nicht am X/Z-Raster ausgerichtet sind. Nutzen Sie dies zu Ihrem Vorteil, um Räume besser abzudecken, ohne zu viele ReflectionProbe-Nodes platzieren zu müssen.
zh_cn: 请记住，ReflectionProbe 范围不必是正方形，你甚至可以旋转 ReflectionProbe 节点以适应未与 X/Z 网格对齐的房间。 利用这一点可以更好地覆盖房间，而无需放置太多 ReflectionProbe 节点。
zh_tw: 請記住，ReflectionProbe 範圍不必是正方形，您甚至可以旋轉 ReflectionProbe 節點以適應未與 X/Z 網格對齊的房間。利用這一點可以更好地覆蓋房間，而無需放置太多 ReflectionProbe 節點。

source: ReflectionProbe properties
de: ReflectionProbe-Propertys
zh_cn: ReflectionProbe 属性
zh_tw: 節點屬性

source: **Update Mode:** Controls when the reflection probe updates. **Once** only renders the scene once every time the ReflectionProbe is moved. This makes it much faster to render compared to the **Always** update mode, which forces the probe to re-render everything around it every frame. Leave this property on **Once** (default) unless you need the reflection probe to update every frame.
de: **Aktualisierungsmodus:** Steuert, wann die Reflection-Probe aktualisiert wird. Bei **Einmal** wird die Szene nur einmal gerendert, wenn die ReflectionProbe bewegt wird. Dies macht das Rendern viel schneller als der **Immer** Aktualisierungsmodus, der die Probe zwingt, alles um sie herum bei jedem Frame neu zu rendern. Lassen Sie diese Property auf **Einmal** ("Default"), wenn Sie die Reflection-Probe nicht bei jedem Frame aktualisieren wollen.
zh_cn: **Update Mode（更新模式）：** 控制反射探针何时更新。 每次移动 ReflectionProbe 时 **Once** 仅渲染场景一次。 与 **Always** 更新模式相比，这使得渲染速度更快，后者强制探针每帧重新渲染周围的所有内容。 将此属性保留为 **Once** （默认），除非你需要反射探针来更新每一帧。
zh_tw: **更新模式：** 控制反射探查何時更新。每次移動 ReflectionProbe 時 **Once** 僅算繪場景一次。與 **Always** 更新模式相比，這使得算繪速度更快，後者強制探查每影格重新算繪周圍的所有內容。將此屬性保留為**一次**（預設），除非您需要反射探查來更新每個畫面。

source: **Intensity:** The brightness of the reflections and ambient lighting. This usually doesn't need to be changed from its default value of ``1.0``, but you can decrease it ``1.0`` if you find that reflections look too strong.
de: **Intensität:** Die Helligkeit der Reflexionen und der Umgebungsbeleuchtung. Normalerweise muss dieser Wert von seinem Default-Wert ``1.0`` nicht verändert werden, aber Sie können den Wert ``1.0`` verringern, wenn Sie finden, dass die Reflexionen zu stark wirken.
zh_cn: **Intensity（强度）：** 反射和环境照明的亮度。 通常不需要更改其默认值 ``1.0`` ，但如果你发现反射看起来太强，可以将其减小 ``1.0`` 。
zh_tw: **強度：** 反射和環境照明的亮度。通常不需要更改其預設值“1.0”，但如果您發現反射看起來太強，可以將其減小為“1.0”。

source: **Max Distance:** Controls the maximum distance used by the ReflectionProbe's internal camera. The distance is always at least equal to the **Extents**, but this can be increased to make objects located outside the extents visible in reflections. *This property does not affect the maximum distance at which the ReflectionProbe itself is visible.*
de: **Max Distanz:** Steuert die maximale Distanz, die von der internen Kamera der ReflectionProbe verwendet wird. Der Abstand ist immer mindestens so groß wie **Ausmaße**, kann aber vergrößert werden, um Objekte, die sich außerhalb der Ausmaße befinden, in Reflexionen sichtbar zu machen. *Diese Property hat keinen Einfluss auf die maximale Entfernung, in der die ReflectionProbe selbst sichtbar ist.*
zh_cn: **Max Distance（最大距离）：** 控制 ReflectionProbe 内部摄像头使用的最大距离。 该距离始终至少等于 **Extents** （范围） ，但可以增加该距离以使位于范围之外的对象在反射中可见。 *此属性不会影响 ReflectionProbe 本身可见的最大距离。*
zh_tw: **最大距離：** 控制 ReflectionProbe 內部相機使用的最大距離。該距離始終至少等於**範圍**，但可以增加該距離以使位於範圍之外的物件在反射中可見。 *此屬性不會影響 ReflectionProbe 本身可見的最大距離。*

source: **Extents:** The area that will be affected by the ReflectionProbe's lighting and reflections.
de: **Ausmaße:** Der Bereich, der von der Beleuchtung und den Reflexionen der ReflectionProbe betroffen ist.
zh_cn: **Extents（范围）：** 将受到 ReflectionProbe 照明和反射影响的区域。
zh_tw: **範圍：** 將受到 ReflectionProbe 照明和反射影響的區域。

source: **Origin Offset:** The origin to use for the internal camera used for reflection probe rendering. This must always be constrained within the **Extents**. If needed, adjust this to prevent the reflection from being obstructed by a solid object located exactly at the center of the ReflectionProbe.
de: **Ursprungsversatz:** Der Ursprung für die interne Kamera, die für das Reflection-Probe-Rendering verwendet wird. Dieser Ursprung muss immer innerhalb der **Ausmaße** liegen. Passen Sie diesen Wert bei Bedarf an, um zu verhindern, dass die Reflexion durch ein festes Objekt, das sich genau in der Mitte der ReflectionProbe befindet, behindert wird.
zh_cn: **Origin Offset（原点偏移）：** 用于反射探针渲染的内部摄像机的原点。 这必须始终限制在 **Extents** 内。 如果需要，请调整此项以防止反射被正好位于 ReflectionProbe 中心的固体物体阻挡。
zh_tw: **原點偏移：** 用於反射探查算繪的內部攝影機的原點。這必須始終限制在**範圍**內。如果需要，請調整此項以防止反射被剛好位於 ReflectionProbe 中心的固體物體阻擋。

source: **Box Projection:** Controls whether parallax correction should be used when rendering the reflection probe. This adjusts the reflection's appearance depending on the camera's position (relative to the reflection probe). This has a small performance cost, but the quality increase is often worth it in box-shaped rooms. Note that this effect doesn't work quite as well in rooms with less regular shapes (such as ellipse-shaped rooms).
de: **Box-Projektion:** Legt fest, ob beim Rendern der Reflection-Probe eine Parallaxenkorrektur verwendet werden soll. Dadurch wird das Erscheinungsbild der Reflexion in Abhängigkeit von der Kameraposition (relativ zur Reflection-Probe) angepasst. Dies hat einen kleinen Performance-Aufwand zur Folge, aber die Qualitätssteigerung ist es in Box-förmigen Räumen oft wert. Beachten Sie, dass dieser Effekt in Räumen mit weniger regelmäßigen Formen (z. B. ellipsenförmigen Räumen) nicht ganz so gut funktioniert.
zh_cn: **Box Projection（箱体投影）：** 控制渲染反射探针时是否应使用视差校正。 这将根据相机的位置（相对于反射探针）调整反射的外观。 这会产生很小的性能成本，但在箱型房间中，质量的提高通常是物有所值的。 请注意，这种效果在形状不太规则的房间（例如椭圆形的房间）中效果不佳。
zh_tw: **盒子投影：** 控制算繪反射探查時是否應使用視差校正。這將根據相機的位置（相對於反射探頭）調整反射的外觀。這會產生很小的性能成本，但在盒形房間中，品質的提高通常是值得的。請注意，這種效果在形狀不太規則的房間（例如橢圓形房間）中效果不佳。

source: **Interior:** If enabled, ambient lighting will not be sourced from the environment sky, and the background sky won't be rendered onto the reflection probe.
de: **Innenbereich:** Wenn diese Option aktiviert ist, wird die Umgebungsbeleuchtung nicht aus dem Umgebungshimmel bezogen, und der Hintergrundhimmel wird nicht auf die Reflection-Probe gerendert.
zh_cn: **Interior（内部）：** 如果启用，环境照明将不会来自环境天空，并且背景天空不会渲染到反射探针上。
zh_tw: **內部：** 如果啟用，環境照明將不會來自環境天空，背景天空不會算繪到反射探查上。

source: **Enable Shadows:** Controls whether real-time light shadows should be rendered within the reflection probe. Enable this to improve reflection quality at the cost of performance. This should be left disabled for reflection probes with the **Always** mode, as it's very expensive to render reflections with shadows every frame. Fully :ref:`baked light <doc_using_lightmap_gi>` shadows are not affected by this setting and will be rendered in the reflection probe regardless.
de: **Schatten aktivieren:** Steuert, ob in der Reflection-Probe Lichtschatten in Echtzeit gerendert werden sollen. Aktivieren Sie dies, um die Qualität der Reflexion auf Kosten der Performance zu verbessern. Dies sollte für Reflection-Probes mit dem Modus **Immer** deaktiviert bleiben, da es sehr teuer ist, Reflektionen mit Schatten in jedem Frame zu rendern. Vollständig :ref:`gebackene Lichtschatten <doc_using_lightmap_gi>` sind von dieser Einstellung nicht betroffen und werden trotzdem in der Reflection-Probe gerendert.
zh_cn: **Enable Shadow（启用阴影）：** 控制是否应在反射探针内渲染实时光阴影。 启用此功能可以提高反射质量，但会牺牲性能。 对于具有 **Always** 模式的反射探针，应禁用此功能，因为每帧渲染带有阴影的反射的成本非常高。 完全 :ref:`烘焙光 <doc_using_lightmap_gi>` 阴影不受此设置的影响，并且无论如何都会在反射探针中渲染。
zh_tw: **啟用陰影：** 控制是否應在反射探查內算繪即時光陰影。啟用此功能可以提高反射質量，但會犧牲性能。對於具有 **Always** 模式的反射探查，應停用此功能，因為每個畫面算繪帶有陰影的反射的成本非常高。完全烘焙光 <doc_using_lightmap_gi>` 陰影不受此設定的影響，無論如何都會在反射探查中算繪。

source: **Cull Mask:** Controls which objects are visible in the reflection. This can be used to improve performance by excluding small objects from the reflection. This can also be used to prevent an object from having self-reflection artifacts in situations where **Origin Offset** can't be used.
de: **Cull-Maske:** Steuert, welche Objekte in der Reflexion sichtbar sind. Dies kann verwendet werden, um die Performance zu verbessern, indem kleine Objekte von der Reflexion ausgeschlossen werden. Dies kann auch verwendet werden, um zu verhindern, dass ein Objekt in Situationen, in denen **Ursprungsversatz** nicht verwendet werden kann, Artefakte der Selbstreflexion aufweist.
zh_cn: **Cull Mask（剔除遮罩）：** 控制哪些对象在反射中可见。 该属性可以通过从反射中排除小物体来提高性能。该属性也可用于防止对象在无法使用 **Origin Offset** 的情况下出现自反射伪影（self-reflection artifacts）。
zh_tw: **剔除蒙版：** 控制哪些物件在反射中可見。這可以透過從反射中排除小物體來提高性能。這也可用於防止物件在無法使用 **原點偏移** 的情況下出現自反射偽影。

source: **Mesh LOD Threshold:** The automatic level of detail threshold to use for rendering meshes within the reflection. This only affects meshes that have automatic LODs generated for them. Higher values can improve performance by using less detailed geometry, especially for objects that are far away from the reflection's origin. The visual difference of using less detailed objects is usually not very noticeable during gameplay, especially in rough reflections.
de: **Mesh-LOD-Schwelle:** Der Schwellenwert für den automatischen Detailgrad, der für das Rendern von Meshes innerhalb der Reflexion verwendet wird. Dies betrifft nur Meshes, für die automatische LODs generiert wurden. Höhere Werte können die Performance verbessern, indem weniger detaillierte Geometrie verwendet wird, insbesondere für Objekte, die weit vom Ursprung der Reflexion entfernt sind. Der visuelle Unterschied bei der Verwendung von weniger detaillierten Objekten ist während des Spiels normalerweise nicht sehr auffällig, insbesondere bei groben Reflexionen.
zh_cn: **Mesh LOD Threshold（网格 LOD 阈值）：** 用于调整在反射内渲染网格的自动细节层次的阈值。 这仅影响自动生成 LOD 的网格体。 较高的值可以通过使用不太详细的几何体来提高性能，特别是对于远离反射原点的对象。 在游戏过程中，使用不太详细的对象的视觉差异通常不是很明显，尤其是在粗糙的反射中。
zh_tw: **網格 LOD 閾值：** 用於在反射內算繪網格的自動細節等級閾值。這僅會影響自動產生 LOD 的網格體。較高的值可以透過使用不太詳細的幾何體來提高性能，特別是對於遠離反射原點的物件。在遊戲過程中，使用不太詳細的物件的視覺差異通常不是很明顯，尤其是在粗糙的反射中。

source: The Ambient category features several properties to adjust ambient lighting rendered by the ReflectionProbe:
de: Die Kategorie Umgebungslicht enthält mehrere Propertys zur Anpassung der von der ReflectionProbe gerenderten Umgebungsbeleuchtung:
zh_cn: 环境类别具有多个属性，用于调整 ReflectionProbe 渲染的环境光：
zh_tw: Ambient 類別具有多個屬性來調整 ReflectionProbe 算繪的環境光照：

source: **Mode:** If set to **Disabled**, no ambient light is added by the probe. If set to **Environment**, the ambient light color is automatically sampled from the environment sky (if **Interior** is disabled) and the reflection's average color. If set to **Constant Color**, the color specified in the **Color** property is used instead. The **Constant Color** mode can be used as an approximation of area lighting.
de: **Modus:** Bei der Einstellung **Deaktiviert** wird kein Umgebungslicht von der Sonde hinzugefügt. Bei der Einstellung **Environment** wird die Farbe des Umgebungslichts automatisch aus dem Himmel der Umgebung (wenn **Innenraum** deaktiviert ist) und der durchschnittlichen Farbe der Reflexion ermittelt. Bei der Einstellung **Konstante Farbe** wird stattdessen die in der Property **Farbe** angegebene Farbe verwendet. Der Modus **Konstante Farbe** kann als Annäherung an die Flächenbeleuchtung verwendet werden.
zh_cn: **Mode（模式）：** 设置为 **Disabled** ，探针将不添加环境光。如果设置为 **Environment** （环境），环境光颜色将自动从环境天空（当 **Interior** 被禁用）和反射的平均颜色中采样。如果设置为 **Constant Color** （固定颜色），则使用 **Color** 属性中指定的颜色。 **Constant Color** 模式可作为区域照明的近似值。
zh_tw: **模式：** 如果設定為 **停用**，探頭不會新增環境光。如果設定為 **Environment**，環境光顏色會自動從環境天空（如果 **Interior** 停用）和反射的平均顏色中取樣。如果設定為 **Constant Color**，則使用 **Color** 屬性中指定的顏色。 **恆定顏色**模式可用作區域照明的近似值。

source: **Color:** The color to use when the ambient light mode is set to **Constant Mode**.
de: **Farbe:** Die Farbe, die verwendet wird, wenn der Umgebungslichtmodus auf **Konstantmodus** eingestellt ist.
zh_cn: **Color（颜色）：** 当环境光模式设置为 **Constant Mode（固定模式）** 时使用的颜色。
zh_tw: **顏色：** 當環境光模式設定為 **恆定模式** 時所使用的顏色。

source: **Color Energy:** The multiplier to use for the ambient light custom **Color**. This only has an effect when the ambient light mode is **Custom Color**.
de: **Farbenergie:** Der Multiplikator, der für die benutzerdefinierte **Farbe** des Umgebungslichts verwendet wird. Dies hat nur eine Auswirkung, wenn der Umgebungslichtmodus **Benutzerdefinierte Farbe** ist.
zh_cn: **Color Energy（颜色能量）：**\ 用于环境光自定义 **Color** 的乘数。 这仅在环境光模式为 **Custom Color**\ （自定义颜色） 时有效。
zh_tw: **顏色能量：** 用於環境光自訂**顏色**的乘數。這僅在環境光模式為**自訂顏色**時有效。

source: ReflectionProbe blending
zh_cn: ReflectionProbe 混合
zh_tw: ReflectionProbe 混合

source: To make transitions between reflection sources smoother, Godot supports automatic probe blending:
de: Um die Übergänge zwischen den Reflexionsquellen fließender zu gestalten, unterstützt Godot das automatische Blending von Probes:
zh_cn: 为了使反射源之间的过渡更加平滑，Godot 支持自动探针混合：
zh_tw: 為了使反射源之間的過渡更加平滑，Godot 支援自動探查混合：

source: Up to 4 ReflectionProbes can be blended together at a given location. A ReflectionProbe will also fade out smoothly back to environment lighting when it isn't touching any other ReflectionProbe node.
de: Es können bis zu 4 ReflectionProbes an einer bestimmten Stelle überblendet werden. Eine ReflectionProbe wird auch sanft zur Umgebungsbeleuchtung zurückgefadet, wenn sie keinen anderen ReflectionProbe-Node berührt.
zh_cn: 最多可以在给定位置，将 4 个 ReflectionProbe 混合在一起。 当 ReflectionProbe 不接触任何其他 ReflectionProbe 节点时，它也会平滑地淡出回到环境照明中。
zh_tw: 最多可以在給定位置將 4 個 ReflectionProbe 混合在一起。當 ReflectionProbe 不接觸任何其他 ReflectionProbe 節點時，它也會平滑地淡出回到環境照明。

source: SDFGI and VoxelGI will blend in smoothly with ReflectionProbes if used. This allows placing ReflectionProbes strategically to get more accurate (or fully real-time) reflections where needed, while still having rough reflections available in the VoxelGI or SDFGI's area of influence.
de: SDFGI und VoxelGI fügen sich nahtlos in die ReflectionProbes ein, wenn sie verwendet werden. Auf diese Weise können ReflectionProbes strategisch platziert werden, um bei Bedarf genauere (oder vollständige Echtzeit-) Reflexionen zu erhalten, während im Einflussbereich des VoxelGI oder SDFGI weiterhin grobe Reflexionen verfügbar sind.
zh_cn: 如果使用该功能的话，SDFGI 和 VoxelGI 将与 ReflectionProbes 顺利融合。 这允许策略性地放置 ReflectionProbes，以便在需要时获得更准确（或完全实时）的反射，同时在 VoxelGI 或 SDFGI 的影响区域中仍然具有可用的粗略反射。
zh_tw: 如果使用的話，SDFGI 和 VoxelGI 將與 ReflectionProbes 順利融合。這允許策略性地放置 ReflectionProbes，以便在需要時獲得更準確（或完全實時）的反射，同時在 VoxelGI 或 SDFGI 的影響區域中仍然具有可用的粗略反射。

source: To make several ReflectionProbes blend with each other, you need to have part of each ReflectionProbe overlap each other's area. The extents should only overlap as little possible with other reflection probes to improve rendering performance (typically a few units in 3D space).
de: Damit mehrere ReflectionProbes miteinander verschmelzen, müssen Sie dafür sorgen, dass ein Teil jeder ReflectionProbe den Bereich der anderen überlappt. Die Bereiche sollten sich nur so wenig wie möglich mit anderen Reflection-Probes überlappen, um die Performance des Renderings zu verbessern (typischerweise ein paar Einheiten im 3D-Raum).
zh_cn: 要使多个 ReflectionProbe 相互混合，你需要使每个 ReflectionProbe 的部分区域相互重叠。区域范围应仅与其他反射探针（的范围）尽可能少地重叠，以提高渲染性能（通常是 3D 空间中的几个单位）。
zh_tw: 要讓多個 ReflectionProbe 相互混合，您需要讓每個 ReflectionProbe 的部分區域相互重疊。範圍應僅與其他反射探查盡可能少地重疊，以提高算繪性能（通常是 3D空間中的幾個單位）。

source: Limitations
de: Einschränkungen
zh_cn: 限制
zh_tw: 限制
