Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/reflection_probes.po
Languages: de, zh_cn, zh_tw

source: When using the Forward+ renderer, Godot uses a *clustering* approach for reflection probe rendering. As many reflection probes as desired can be added (as long as performance allows). However, there's still a default limit of 512 *clustered elements* that can be present in the current camera view. A clustered element is an omni light, a spot light, a :ref:`decal <doc_using_decals>` or a :ref:`reflection probe <doc_reflection_probes>`. This limit can be increased by adjusting the **Rendering > Limits > Cluster Builder > Max Clustered Elements** advanced project setting.
de: Bei Verwendung des Forward+-Renderers verwendet Godot einen *Cluster*-Ansatz für das Rendering von Reflection-Probes. Es können so viele Reflection-Probes wie gewünscht hinzugefügt werden (solange die Performance es zulässt). Es gibt jedoch immer noch eine Default-Grenze von 512 *Cluster-Elementen*, die in der aktuellen Kameraansicht vorhanden sein können. Ein Clusterelement ist ein Omni-Licht, ein Spotlicht, ein :ref:`Decal <doc_using_decals>` oder eine :ref:`Reflection-Probe <doc_reflection_probes>`. Diese Grenze kann durch Anpassen der erweiterten Projekteinstellung **Rendering > Limits > Cluster Builder > Max Clustered Elements** erhöht werden.
zh_cn: 在使用 Forward+ 渲染器时，Godot 采用 *集群* 方法进行实时照明。只要性能允许，可以添加任意数量的反射探针。不过，默认情况下，当前摄像机视图中的 *集群元素* 上限仍为 512 个。集群元素是指全向灯、聚光灯、 :ref:`贴花 <doc_using_decals>` 或 :ref:`反射探针 <doc_reflection_probes>`。可以通过调整 "**渲染 > 限制 > 群集生成器 > 最大群集元素**"高级项目设置来增加此限制。

source: When using the Forward Mobile backend, only 8 reflection probes can be applied on each individual Mesh *resource*. If there are more reflection probes affecting a single mesh, not all of them will be rendered on the mesh.
de: Bei Verwendung des Forward Mobile-Backends können nur 8 Reflection-Probes auf jede einzelne Mesh-*Ressource* angewendet werden. Wenn mehr Reflection-Probes auf ein einzelnes Mesh wirken, werden nicht alle von ihnen auf dem Mesh gerendert.
zh_cn: 在使用 Forward 移动后端时，每个单独的 Mesh *资源* 上只能应用 8 个反射探针。如果单个网格上有超出数量限制的反射探针，它们并不会全部渲染在网格上。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
