Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_voxel_gi.po
Languages: de, zh_cn, zh_tw

source: Additionally, VoxelGI can be disabled entirely by hiding the VoxelGI node. This can be used for comparison purposes or to improve performance on low-end systems.
de: Außerdem kann VoxelGI vollständig deaktiviert werden, indem der VoxelGI-Node ausgeblendet wird. Dies kann zu Vergleichszwecken oder zur Verbesserung der Performance auf Low-End-Systemen genutzt werden.
zh_cn: 此外，可以通过隐藏 VoxelGI 节点来完全禁用 VoxelGI 。这可以用于比较目的或提高在低端系统的表现。
zh_tw: 此外，可以透過隱藏 VoxelGI 節點來完全停用 VoxelGI。這可用於比較目的或提高低端系統的性能。

source: Reducing VoxelGI light leaks and artifacts
de: Reduzierung von VoxelGI-Lichtlecks und Artefakten
zh_cn: 减少 VoxelGI 光照泄漏和伪影
zh_tw: 減少 VoxelGI 漏光和偽影

source: After baking VoxelGI, you may notice indirect light is leaking at some spots in your level geometry. This can be remedied in several ways:
de: Nach dem Backen von VoxelGI werden Sie vielleicht feststellen, dass an einigen Stellen Ihrer Levelgeometrie indirektes Licht herausleckt. Dies kann auf mehrere Arten behoben werden:
zh_cn: 烘焙VoxelGI后，你可能会注意到水平几何体中的某些点处存在间接光泄漏。这可以通过以下几种方式进行补救：
zh_tw: 烘焙 VoxelGI 後，您可能會注意到關卡幾何體中的某些點會洩漏間接光線。這可以透過多種方式來解決：

source: For both light leaking and artifacts, try moving or rotating the VoxelGI node then bake it again.
de: Versuchen Sie, den VoxelGI-Node zu verschieben oder zu drehen, um Lichtlecks und Artefakte zu vermeiden, und backen Sie ihn dann erneut.
zh_cn: 对于漏光和伪影，请尝试移动或旋转VoxelGI节点，然后再次烘焙它。
zh_tw: 對於漏光和偽影，請嘗試移動或旋轉 VoxelGI 節點，然後再次烘焙。

source: To combat light leaking in general, ensure your level geometry is fully sealed. This is best done in the 3D modeling software used to design the level, but primitive MeshInstance3D nodes with their global illumination mode set to **Static** can also be used.
de: Um Lichtlecks im Allgemeinen zu bekämpfen, stellen Sie sicher, dass Ihre Levelgeometrie vollständig abgedichtet ist. Dies geschieht am besten in der 3D-Modellierungssoftware, die für die Gestaltung des Levels verwendet wird, aber auch primitive MeshInstance3D-Nodes, deren globaler Beleuchtungsmodus auf **Statisch** eingestellt ist, können verwendet werden.
zh_cn: 一般来说，为了防止漏光，请确保你的关卡几何体完全密封。这最好在用于设计标高的三维建模软件中完成，但也可以使用全局照明模式设置为 **Static** 的图源 MeshInstance3D 节点。
zh_tw: 為了防止漏光，請確保關卡幾何體完全密封。這最好在用於設計關卡的 3D 建模軟體中完成，但也可以使用全域照明模式設定為 **靜態** 的原始 MeshInstance3D 節點。

source: To combat light leaking with thin geometry, it's recommended to make the geometry in question thicker. If this is not possible, then add a primitive MeshInstance3D node with its global illumination mode set to **Static**. Bake VoxelGI again, then hide the primitive MeshInstance3D node (it will still be taken into account by VoxelGI). For optimal results, the MeshInstance3D should have a material whose color matches the original thin geometry.
de: Um Lichtlecks bei feiner Geometrie zu bekämpfen, empfiehlt es sich, die betreffende Geometrie dicker zu machen. Wenn dies nicht möglich ist, dann fügen Sie einen primitiven MeshInstance3D-Node hinzu, dessen Global Illumination-Modus auf **Statisch** gesetzt ist. Backen Sie VoxelGI erneut und blenden Sie dann den primitiven MeshInstance3D-Node aus (er wird weiterhin von VoxelGI berücksichtigt). Um optimale Ergebnisse zu erzielen, sollte das MeshInstance3D ein Material haben, dessen Farbe der ursprünglichen feinen Geometrie entspricht.
zh_cn: 为了解决薄几何体的漏光问题，建议将有问题的几何体加厚。如果不可行，请添加一个图元 MeshInstance3D 节点，其全局照明模式设置为 **Static**\ 。再次烘焙体素 GI，然后隐藏图元 MeshInstance3D 节点（VoxelGI 仍将启用该节点）。为了获得最佳结果，MeshInstance3D 应具有颜色与原始薄几何体匹配的材质。
zh_tw: 為了防止薄幾何體的漏光，建議使相關幾何體更厚。如果這不可能，則新增一個原始 MeshInstance3D 節點，並將其全域照明模式設為 **靜態**。再次烘焙 VoxelGI，然後隱藏原始 MeshInstance3D 節點（VoxelGI 仍會考慮它）。為了獲得最佳結果，MeshInstance3D 應具有顏色與原始薄幾何體相符的材質。

source: To combat artifacts that can appear on reflective surfaces, try increasing **Bias** and/or **Normal Bias** in the VoxelGIData resource as described above. Do not increase these values too high, or light leaking will become more pronounced.
de: Um Artefakte zu beseitigen, die auf reflektierenden Oberflächen auftreten können, versuchen Sie, **Bias** und/oder **Normalen-Bias** in der VoxelGIData-Ressource wie oben beschrieben zu erhöhen. Erhöhen Sie diese Werte nicht zu stark, da sonst die Lichtlecks noch ausgeprägter werden.
zh_cn: 为了解决在反射表面上可能出现的伪影问题，可以尝试增加上述 VoxelGIData 资源中的 **Bias** 和/或 **Normal Bias**\ 。但不要将这些值增加得太高，否则会导致光线泄漏更加明显。
zh_tw: 為了消除可能出現在反射表面上的偽影，請嘗試增加 VoxelGIData 資源中的 **Bias** 和/或 **Normal Bias**，如上所述。不要將這些值增加得太高，否則漏光會變得更加明顯。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
