Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_lightmap_gi.po
Languages: de, zh_cn, zh_tw

source: In the **Mesh** menu mentioned before, the UV2 texture coordinates can be visualized. If something is failing, double-check that the meshes have these UV2 coordinates:
de: In dem bereits erwähnten **Mesh**-Menü können die UV2-Texturkoordinaten angezeigt werden. Wenn etwas nicht funktioniert, überprüfen Sie, ob die Meshes diese UV2-Koordinaten haben:
zh_cn: 在前面提到的\ **网格**\ 菜单中， 可以显示 UV2 纹理坐标。如果出现问题，请仔细检查网格是否具有以下 UV2 坐标：
zh_tw: 在前面提到的網格功能表中, 可以顯示UV2紋理座標. 如果出現問題, 請確保檢查網格是否具有以下UV2座標:

source: Setting up the scene
de: Die Szene einrichten
zh_cn: 设置场景
zh_tw: 設定場景

source: Before anything is done, a **LightmapGI** node needs to be added to a scene. This will enable light baking on all nodes (and sub-nodes) in that scene, even on instanced scenes.
de: Bevor etwas getan wird, muss ein **LightmapGI**-Node zu einer Szene hinzugefügt werden. Dadurch wird das Backen von Licht auf allen Nodes (und Unter-Nodes) in dieser Szene aktiviert, auch in instanzierten Szenen.
zh_cn: 首先需要在场景中添加一个 **LightmapGI** 节点。这将在该场景中的所有节点（和子节点）上启用光照烘焙，甚至在实例化场景中也是如此。
zh_tw: 首先需要在場景中新增一個 **BakedLightmap** 節點。新增後，場景中的所有節點（和子節點）就都可以進行光照烘焙了，甚至產生實體的場景也可以。

source: A sub-scene can be instanced several times, as this is supported by the baker. Each instance will be assigned a lightmap of its own. To avoid issues with inconsistent lightmap texel scaling, make sure to respect the rule about mesh scaling mentioned before.
de: Eine Unter-Szene kann mehrfach instanziiert werden, da dies vom Back-Algorithmus unterstützt wird. Jeder Instanz wird eine eigene Lightmap zugewiesen. Um Probleme mit inkonsistenter Texel-Skalierung der Lightmap zu vermeiden, sollten Sie die zuvor erwähnte Regel zur Mesh-Skalierung beachten.
zh_cn: 烘焙器支持同一子场景存在多个实例，它们会有各自独立的光照贴图（前提是你得遵守之前提过的关于缩放的规则）。
zh_tw: 烘焙器支援同一子場景存在多個實例，它們會有各自獨立的光照貼圖（前提是你得遵守之前提過的關於縮放的規則）。

source: Setting up meshes
de: Meshes einrichten
zh_cn: 设置网格
zh_tw: 設定網格

source: For a **MeshInstance3D** node to take part in the baking process, it needs to have its bake mode set to **Static**. Meshes that have their bake mode set to **Disabled** or **Dynamic** will be ignored by the lightmapper.
de: Damit ein **MeshInstance3D** Node am Back-Prozess teilnehmen kann, muss sein Back-Modus auf **Static** eingestellt sein. Meshes, deren Back-Modus auf **Deaktiviert** oder **Dynamisch** eingestellt ist, werden vom Lightmapper ignoriert.
zh_cn: 对于要参与烘焙过程的 **MeshInstance3D** 节点，需要将其光照烘焙模式设置为 **Static** 。光照烘焙模式设置为 **Disabled** 或 **Dynamic** 的网格体将被光照贴图器忽略。
zh_tw: 如果需要讓 **MeshInstance** 節點參與烘焙，需要啟用 **Use in Baked Light** 屬性。

source: When auto-generating lightmaps on scene import, this is enabled automatically.
de: Wenn beim Szenenimport automatisch Lightmaps generiert werden, wird dies automatisch aktiviert.
zh_cn: 在场景导入时自动生成光照贴图时, 会自动启用此功能.
zh_tw: 在場景匯入時自動生成光照貼圖時, 會自動啟用此功能.

source: Setting up lights
de: Lichtquellen einrichten
zh_cn: 设置灯光
zh_tw: 設定燈光

source: Lights are baked with indirect light only by default. This means that shadowmapping and lighting are still dynamic and affect moving objects, but light bounces from that light will be baked.
de: Lichtquellen werden standardmäßig mit indirektem Licht gebacken. Dies bedeutet, dass Shadow Maps und Beleuchtung immer noch dynamisch sind und sich auf sich bewegende Objekte auswirken, Licht-Abprälle dieses Lichts werden aber gebacken.
zh_cn: 默认情况下，灯光采用间接灯光烘焙。这意味着阴影贴图和光照仍然是动态的并影响移动的物体，但从该光反射的光将被烘焙。
zh_tw: 預設情況下, 燈光採用間接燈光烘焙. 這意味著陰影貼圖和光照仍然是動態的並影響移動的物體, 但是光線反射的光將被烘焙.

source: Lights can be disabled (no bake) or be fully baked (direct and indirect). This can be controlled from the **Bake Mode** menu in lights:
de: Lichtquellen können deaktiviert (kein Backen) oder vollständig gebacken werden (direkt und indirekt). Dies kann über das Menü **Back-Modus** in den Lichtquellen gesteuert werden:
zh_cn: 灯可以禁用(不烘焙)或完全烘焙(直接和间接). 这可以通过灯光中的 **烘焙模式** 菜单进行控制:
zh_tw: 燈可以禁用(不烘焙)或完全烘焙(直接和間接). 這可以通過燈光中的 **烘焙模式** 功能表進行控制:

source: The modes are:
de: Die Modi sind:
zh_cn: 模式有：
zh_tw: 模式有：

source: Disabled
de: Deaktiviert
zh_cn: Disabled（禁用）
zh_tw: 已停用的專案

source: The light is ignored when baking lightmaps. This is the mode to use for dynamic lighting effects such as explosions and weapon effects.
de: Die Lichtquelle wird beim Backen von Lightmaps ignoriert. Dies ist der richtige Modus für dynamische Lichteffekte wie Explosionen und Waffeneffekte.
zh_cn: 烘焙光照贴图时，光线会被忽略。这个模式可以用于动态光照效果，例如爆炸和武器特效。

source: Hiding a light has no effect on the resulting lightmap bake. This means you must use the Disabled bake mode instead of hiding the Light node by disabling its **Visible** property.
de: Das Ausblenden einer Lichtquelle hat keinen Einfluss auf das Backen der Lightmap. Das bedeutet, dass Sie den Back-Modus "Deaktiviert" verwenden müssen, anstatt den Licht-Node durch Deaktivieren seiner **Sichtbar**-Property zu verstecken.
zh_cn: 隐藏灯光对生成的光照贴图烘焙没有影响。这意味着你必须使用禁用烘焙模式，而不是通过禁用其 **Visible** 属性来隐藏 Light 节点。

source: Dynamic
de: Dynamisch
zh_tw: 動態語言：

source: This is the default mode, and is a compromise between performance and real-time friendliness. Only indirect lighting will be baked. Direct light and shadows are still real-time, as they would be without LightmapGI.
de: Dies ist der Default-Modus, der einen Kompromiss zwischen Performance und Echtzeitfreundlichkeit darstellt. Es wird nur die indirekte Beleuchtung gebacken. Direktes Licht und Schatten sind immer noch in Echtzeit, wie sie es auch ohne LightmapGI wären.
zh_cn: 这是默认的模式，是性能与实时友好性的折衷。只会烘焙间接光照。直接灯光和阴影仍旧是实时的，就像没有 LightmapGI 时一样。
zh_tw: 這是預設的模式，是性能與即時友好性的折衷。只會烘焙間接光照。直接燈光和陰影仍舊是即時的，與不使用 BakedLightmap 時一致。

source: This mode allows performing *subtle* changes to a light's color, energy and position while still looking fairly correct. For example, you can use this to create flickering static torches that have their indirect light baked.
de: Mit diesem Modus lassen sich *subtile* Änderungen an Farbe, Energie und Position einer Lichtquelle vornehmen, ohne dass die Darstellung leidet. Sie können damit zum Beispiel flackernde statische Fackeln erstellen, deren indirektes Licht gebacken wird.
zh_cn: 这个模式可以在保持显示效果相对正确的同时，允许进行灯光颜色、能量、以及位置的 *微调* 。例如，你可以借此实现静态火把的闪烁，它的间接光照仍然是烘焙的。
zh_tw: 這個模式可以在保持顯示效果相對正確的同時，允許進行燈光顏色、能量、以及位置的 *微調* 。例如，你可以借此實作靜態火把的閃爍，它的間接光照仍然是烘焙的。

source: Static
de: Statisch
zh_tw: 靜態語言：

source: Both indirect and direct lighting will be baked. Since static surfaces can skip lighting and shadow computations entirely, this mode provides the best performance along with smooth shadows that never fade based on distance. The real-time light will not affect baked surfaces anymore, but it will still affect dynamic objects. When using the **All** bake mode on a light, dynamic objects will not cast real-time shadows onto baked surfaces, so you need to use a different approach such as blob shadows instead. Blob shadows can be implemented with a Decal node.
de: Sowohl indirekte als auch direkte Beleuchtung wird gebacken. Da statische Oberflächen Beleuchtungs- und Schattenberechnungen vollständig überspringen können, bietet dieser Modus die beste Performance und gleichmäßige Schatten, die nicht in der Entfernung verblassen. Die Echtzeit-Beleuchtung wirkt sich nicht mehr auf gebackene Oberflächen aus, aber sie wirkt immer noch auf dynamische Objekte. Wenn Sie den Back-Modus **Alle** für eine Lichtquelle verwenden, können dynamische Objekte keine Echtzeitschatten auf gebackene Flächen werfen, so dass Sie stattdessen einen anderen Ansatz wie Blob-Schatten verwenden müssen. Blob-Schatten können mit einem Decal-Node implementiert werden.
zh_cn: 间接和直接光照都将被烘焙。 由于静态表面可以完全跳过照明和阴影计算，因此此模式提供了最佳性能，并且实现永远不会根据距离而衰退的平滑阴影。 实时光将不再影响烘焙表面，但仍会影响动态对象。 在灯光上使用 **All** （全部） 烘焙模式时，动态对象不会将实时阴影投射到烘焙表面上，因此你需要使用别的方法，例如斑点阴影。 斑点阴影可以使用 Decal 节点来实现。
zh_tw: 間接和直接光照都會被烘焙。因為靜態表面可以完全跳過光照和陰影的計算，所以這個模式可以提供最佳的性能，並且實作不隨距離衰減的平滑的陰影。即時燈光不會再影響烘焙的表面，但仍然可以影響動態的物件。在光源上使用 **All** （全部）烘焙模式時，動態物件不會在烘焙表面上投射陰影，所以你需要使用別的方法，比如軟陰影。軟陰影既可以通過 Sprite3D + RayCast 實作，也可以通過把朝下的反 SpotLight 的烘焙模式設定成 **禁用** 實作。

source: The light will not be adjustable at all during gameplay. Moving the light or changing its color (or energy) will not have any effect on static surfaces.
de: Die Lichtquelle ist während des Spiels nicht anpassbar. Das Bewegen der Lichtquelle oder das Ändern ihrer Farbe (oder Energie) hat keine Auswirkungen auf statische Oberflächen.
zh_cn: 游戏过程中无法调整灯光。灯光的移动、改变颜色（或者调整能量）都不会对静态表面产生影响。
zh_tw: 遊戲過程中無法調整燈光。燈光的移動、變色、能量調整不會對靜態表面產生影響。

source: Since bake modes can be adjusted on a per-light basis, it is possible to create hybrid baked light setups. One popular option is to use a real-time DirectionalLight with its bake mode set to **Dynamic**, and use the **Static** bake mode for OmniLights and SpotLights. This provides good performance while still allowing dynamic objects to cast real-time shadows in outdoor areas.
de: Da die Back-Modi für jede einzelne Lichtquelle eingestellt werden können, ist es möglich, hybrid gebackene Licht-Setups zu erstellen. Eine beliebte Option ist die Verwendung eines Echtzeit-DirectionalLights, dessen Back-Modus auf **Dynamisch** eingestellt ist, und die Verwendung des Back-Modus **Statisch** für OmniLights und SpotLights. Dies bietet eine gute Performance und ermöglicht gleichzeitig, dass dynamische Objekte in Außenbereichen Echtzeitschatten werfen.
zh_cn: 由于烘焙模式可以根据每个光源进行调整，所以可以创建混合烘焙光源设置。 一种比较流行的选择是使用实时 DirectionalLight，并将其烘焙模式设置为 **Dynamic** ，并使用 OmniLights 和 SpotLights 的 **Static** 烘焙模式。 这样做能有良好的性能，同时仍然允许动态对象在室外区域投射实时阴影。
zh_tw: 因為烘焙模式可以分光源調整，所以可以設定出混合的烘焙光照。一個比較流行的做法是使用即時 DirectionalLight 並把它的烘焙模式設定成 **Indirect**，然後把 OmniLight 和 SpotLight 的烘焙模式都設定成 **All**。這樣做的性能不錯，同時也允許動態物件在室外投射即時陰影。

source: Fully baked lights can also make use of light nodes' **Size** (omni/spot) or **Angular Distance** (directional) properties. This allows for shadows with realistic penumbra that increases in size as the distance between the caster and the shadow increases. This also has a lower performance cost compared to real-time PCSS shadows, as only dynamic objects have real-time shadows rendered on them.
de: Vollständig gebackene Lichter können auch die Propertys **Größe** (Omni/Spot) oder **Winkelabstand** (gerichtet) der Nodes nutzen. Dies ermöglicht Schatten mit realistischem Halbschatten, der mit zunehmender Entfernung zwischen dem Schattenwerfer und dem Schatten an Größe zunimmt. Dies hat auch geringere Performance-Kosten im Vergleich zu PCSS-Echtzeitschatten, da nur für dynamische Objekte Echtzeitschatten gerendert werden.
zh_cn: 完全烘焙的灯光还可以利用灯光节点的 **大小** （全向/聚光）或 **角度距离** （方向）属性。 这允许阴影具有真实的半影，随着阴影投射者和阴影之间距离的增加，半影的尺寸也会增加。 与实时 PCSS 阴影相比，这也具有较低的性能成本，因为只有动态对象才会在其上渲染实时阴影。
zh_tw: 完全烘焙的燈光還可以利用燈光節點的**大小**（全向/聚光）或**角度距離**（方向）屬性。這允許陰影具有真實的半影，隨著施法者和陰影之間距離的增加，半影的尺寸也會增加。與即時 PCSS 陰影相比，這也具有較低的效能成本，因為只有動態物件才會在其上算繪即時陰影。

source: Baking
de: Backen
zh_cn: 烘焙
zh_tw: 烘焙

source: To begin the bake process, click the **Bake Lightmaps** button at the top of the 3D editor viewport when selecting the LightmapGI node:
de: Um den Backvorgang zu starten, klicken Sie auf den **Lightmaps backen**-Buton oben im 3D-Editor, wenn Sie den LightmapGI-Node auswählen:
zh_cn: 要开始烘焙过程，请在选择 LightmapGI 节点时，单击 3D 编辑器视口顶部的 **烘焙光照贴图** 按钮：
zh_tw: 開始烘焙只需在選中 BakedLightmap 節點後點擊上方的 **烘焙光照貼圖** 按鈕：

source: This can take from seconds to minutes (or hours) depending on scene size, bake method and quality selected.
de: Dies kann je nach Szenengröße, Back-Methode und gewählter Qualität zwischen Sekunden und Minuten (oder Stunden) dauern.
zh_cn: 根据场景大小、所选烘焙方法以及质量的不同，其过程可能花费几秒钟到几分钟不等（也可能是几小时）。
zh_tw: 根據場景大小、所選烘焙方法以及品質的不同，其過程可能花費幾秒鐘到幾分鐘不等（也可能是幾小時）。

source: Baking lightmaps is a process that can require a lot of video memory, especially if the resulting texture is large. Due to internal limitations, the engine may also crash if the generated texture size is too large (even on systems with a lot of video memory).
de: Das Backen von Lightmaps ist ein Prozess, der eine Menge Videospeicher benötigen kann, insbesondere wenn die resultierende Textur groß ist. Aufgrund interner Beschränkungen kann die Engine auch abstürzen, wenn die generierte Texturgröße zu groß ist (selbst auf Systemen mit viel Videospeicher).
zh_cn: 烘焙光照贴图是一个可能需要大量视频内存（即显存）的过程，尤其是当生成的纹理很大时。 由于内部限制，如果生成的纹理尺寸太大（即使在具有大量视频内存的系统上），引擎也可能崩溃。
zh_tw: 烘焙光照貼圖是一個可能需要大量視訊記憶體的過程，尤其是當產生的紋理很大時。由於內部限制，如果生成的紋理尺寸太大（即使在具有大量視訊記憶體的系統上），引擎也可能當機。

source: To avoid crashes, make sure the lightmap texel size in the Import dock is set to a high enough value.
de: Um Abstürze zu vermeiden, vergewissern Sie sich, dass die Texelgröße der Lichtkarte im Import-Dock auf einen ausreichend hohen Wert eingestellt ist.
zh_cn: 为了避免崩溃，请在导入面板上确保光照贴图的纹素大小设置到了足够高的值。
zh_tw: 為了避免當機，請確保匯入停靠列中的光照貼圖紋理像素大小設定為足夠高的值。

source: Tweaks
de: Optimierungen
zh_cn: 调整
zh_tw: 調整

source: **Quality:** Four bake quality modes are provided: Low, Medium, High, and Ultra. Higher quality takes more time, but result in a better-looking lightmap with less noise. The difference is especially noticeable with emissive materials or areas that get little to no direct lighting. Each bake quality mode can be further adjusted in the Project Settings.
de: **Qualität:** Es stehen vier Backqualitätsmodi zur Verfügung: Niedrig, Mittel, Hoch und Ultra. Eine höhere Qualität erfordert mehr Zeit, führt aber zu einer besser aussehenden Lightmap mit weniger Rauschen. Der Unterschied macht sich besonders bei emittierenden Materialien oder Bereichen bemerkbar, die wenig oder gar nicht direkt beleuchtet werden. Jeder Modus für die Backqualität kann in den Projekteinstellungen weiter angepasst werden.
zh_cn: **Quality**\ ：提供了四种烘焙质量模式：Low（低级）、Medium（中级）、High（高级）、Ultra（超级）。质量越高所需的时间越长，但最终光照贴图的显示效果越好、噪点也越少。针对自发光材质或者几乎没有直接光照的地方，不同质量模式之间的区别尤为显著。每个烘焙质量模式都可以在项目设置中进一步调整。
zh_tw: **Quality（品質）**：提供了四種烘焙品質：Low（低級）、Medium（中級）、High（高級）、Ultra（超級）。品質越高所需的時間越長，但最終光照貼圖的顯示效果越好、噪點也越少。針對發光材質或者幾乎沒有直接光照的地方，不同品質之間的區別尤為顯著。

source: **Bounces:** The number of bounces to use for indirect lighting. The default value (``3``) is a good compromise between bake times and quality. Higher values will make light bounce around more times before it stops, which makes indirect lighting look smoother (but also possibly brighter depending on materials and geometry).
de: **Abprälle:** Die Anzahl der Abprälle, die für die indirekte Beleuchtung verwendet werden. Der Standardwert (``3``) ist ein guter Kompromiss zwischen Backzeit und Qualität. Höhere Werte sorgen dafür, dass das Licht öfter abprallt, bevor es aufhört. Dadurch wirkt die indirekte Beleuchtung weicher (aber je nach Material und Geometrie möglicherweise auch heller).
zh_cn: **Bounces** ：（反弹）间接光照的反弹次数。默认值（ ``3`` ）是烘焙时间和质量之间的一个平衡点。取值越高，光线在停止之前反弹的次数越多，间接光照的效果也就越好（同时也越亮）。在做最初的光照迭代工作时，建议把反弹次数减小到 ``1`` 以加快烘焙速度。请注意，降低反弹次数会让场景变暗。

source: **Bounce Indirect Energy:** The global multiplier to use when baking lights' indirect energy. This multiplies each light's own **Indirect Energy** value. Values different from ``1.0`` are not physically accurate, but can be used for artistic effect.
de: **Indirekte Energie abprallen:** Der globale Multiplikator, der beim Backen der indirekten Energie der Lichter verwendet wird. Dieser Wert multipliziert den eigenen **Indirekten Energie**-Wert jedes Lichts. Werte, die von ``1.0`` abweichen, sind physikalisch nicht genau, können aber für künstlerische Effekte verwendet werden.
zh_cn: **Bounce Indirect Energy：** （反弹间接能量）烘焙灯光间接能量时使用的全局乘数。这会乘以每个灯自己的 **Indirect Energy** 值。不是 ``1.0`` 的值在物理上并不准确，但可以用于艺术效果。

source: **Directional:** If enabled, stores directional information for lightmaps. This improves normal mapped materials' appearance for baked surfaces, especially with fully baked lights (since they also have direct light baked). The downside is that directional lightmaps are slightly more expensive to render. They also require more time to bake and result in larger file sizes.
de: **Direktional:** Wenn diese Option aktiviert ist, werden Richtungsinformationen für Lightmaps gespeichert. Dies verbessert das Erscheinungsbild von Normal-Mapping-Materialien für gebackene Oberflächen, insbesondere bei vollständig gebackenen Lichtquellen (da sie auch direktes Licht gebacken haben). Der Nachteil ist, dass direktionale Lightmaps etwas teurer zu rendern sind. Sie benötigen auch mehr Zeit zum Backen und führen zu einer größeren Dateigröße.
zh_cn: **Directional：** （定向）如果启用，则存储光照贴图的方向信息。 这改善了烘焙表面的法线贴图材质的外观，尤其是在完全烘焙的灯光下（因为它们也有直接光线烘焙）。 缺点是定向光照贴图的渲染成本稍高。 它们还需要更多的时间来烘焙，从而导致文件大小更大。
zh_tw: **定向：** 如果啟用，則儲存光照貼圖的方向資訊。這改善了烘焙表面的法線貼圖材質的外觀，尤其是在完全烘焙的燈光下（因為它們也有直接光線烘焙）。缺點是定向光照貼圖的算繪成本稍高。它們還需要更多的時間來烘烤並導致檔案大小更大。

source: **Interior:** If enabled, environment lighting will not be sourced. Use this for purely indoor scenes to avoid light leaks.
de: **Innenbereich:** Wenn diese Option aktiviert ist, wird die Umgebungsbeleuchtung nicht verwendet. Verwenden Sie dies für reine Innenraumszenen, um Lichtlecks zu vermeiden.
zh_cn: **Interior：** （内部）如果启用，将不会获取环境照明。 将其用于纯室内场景以避免漏光。
zh_tw: **內部：** 若啟用，將不會取得環境照明。將其用於純室內場景以避免漏光。

source: **Use Texture for Bounces:** If enabled, a texture with the lighting information will be generated to speed up the generation of indirect lighting at the cost of some accuracy. The geometry might exhibit extra light leak artifacts when using low resolution lightmaps or UVs that stretch the lightmap significantly across surfaces. Leave this enabled if unsure.
de: **Textur für Abprälle verwenden:** Wenn diese Option aktiviert ist, wird eine Textur mit den Beleuchtungsinformationen generiert, um die Generierung der indirekten Beleuchtung zu Lasten der Genauigkeit zu beschleunigen. Die Geometrie kann zusätzliche Lichtleck-Artefakte aufweisen, wenn Lightmaps mit niedriger Auflösung oder UVs verwendet werden, die Lightmaps deutlich über Oberflächen strecken. Lassen Sie diese Option aktiviert, wenn Sie unsicher sind.
zh_cn: **Use Texture for Bounces：** （使用纹理进行反弹）如果启用，将生成带有照明信息的纹理，以加快间接照明的生成速度，但会牺牲一定的精度。当使用低分辨率光照贴图或在表面上明显地拉伸光照贴图的 UV 时，几何体可能会出现额外的漏光伪影。如果不确定，请默认启用此功能。

source: **Use Denoiser:** If enabled, uses a denoising algorithm to make the lightmap significantly less noisy. This increases bake times and can occasionally introduce artifacts, but the result is often worth it. See :ref:`doc_using_lightmap_gi_denoising` for more information.
de: **Rauschunterdrückung verwenden:** Wenn diese Option aktiviert ist, wird ein Rauschunterdrückungsalgorithmus verwendet, um das Rauschen der Lightmap deutlich zu reduzieren. Dies erhöht die Backzeiten und kann gelegentlich Artefakte verursachen, aber das Ergebnis ist es oft wert. Siehe :ref:`doc_using_lightmap_gi_denoising` für weitere Informationen.
zh_cn: **Use Denoiser：** （使用降噪器）如果启用，则使用去噪算法使光照贴图的噪点明显减少。这个设置开启会增加烘烤时间，并且偶尔会引入伪影，但结果通常是值得的。请参阅 :ref:`doc_using_lightmap_gi_denoising` 了解更多信息。

source: **Denoiser Strength:** The strength of denoising step applied to the generated lightmaps. Higher values are more effective at removing noise, but can reduce shadow detail for static shadows. Only effective if denoising is enabled and the denoising method is :abbr:`JNLM (Non-Local Means with Joint Filtering)` (:abbr:`OIDN (Open Image Denoise)` does not have a denoiser strength setting).
de: **Stärke der Rauschunterdrückung:** Die Stärke der Rauschunterdrückung, die auf die erzeugten Lightmaps angewendet wird. Höhere Werte sind effektiver bei der Entfernung von Rauschen, können aber die Schattendetails für statische Schatten reduzieren. Nur wirksam, wenn die Rauschunterdrückung aktiviert ist und die Rauschunterdrückungsmethode :abbr:`JNLM (Non-Local Means with Joint Filtering)` ist (:abbr:`OIDN (Open Image Denoise)` hat keine Einstellung für die Stärke der Rauschunterdrückung).
zh_cn: **Denoiser Strength：** （降噪器强度）应用于生成的光照贴图的去噪步骤的强度。值越高，消除噪点越有效，但会减少静态阴影的阴影细节。仅当启用降噪且降噪方法为 :abbr:`JNLM (Non-Local Means with Joint Filtering)`时才有效（ :abbr:`OIDN (Open Image Denoise)` 没有降噪强度设置）。

source: **Bias:** The offset value to use for shadows in 3D units. You generally don't need to change this value, except if you run into issues with light bleeding or dark spots in your lightmap after baking. This setting does not affect real-time shadows casted on baked surfaces (for lights with **Dynamic** bake mode).
de: **Bias:** Der Offset-Wert, der für Schatten in 3D-Einheiten verwendet wird. Im Allgemeinen müssen Sie diesen Wert nicht ändern, es sei denn, Sie haben nach dem Backen Probleme mit Light Bleeding oder dunklen Flecken in Ihrer Lightmap. Diese Einstellung wirkt sich nicht auf Echtzeitschatten aus, die auf gebackene Oberflächen geworfen werden (für Lichtquellen mit dem Back-Modus **Dynamisch**).
zh_cn: **Bias** ：（偏置）用于 3D 单位阴影的偏移值。 通常不需要更改此值，除非烘焙后光照贴图中遇到光渗色（light bleeding）或黑点问题（dark spots）。 此设置不会影响烘焙表面上投射的实时阴影（对于具有 **Dynamic** 光照烘焙模式的灯光）。
zh_tw: **Bias（偏置）** ：陰影的偏移量，使用 3D 單位。除非你遇到了光線滲透問題或者光照貼圖在烘焙後存在暗區，否則通常情況下不需要修改這個值。該選項不會影響投射在烘焙表面上的即時陰影。

source: **Max Texture Size:** The maximum texture size for the generated texture atlas. Higher values will result in fewer slices being generated, but may not work on all hardware as a result of hardware limitations on texture sizes. Leave this at its default value of ``16384`` if unsure.
de: **Max Texturgröße:** Die maximale Texturgröße für den generierten Textur-Atlas. Höhere Werte führen dazu, dass weniger Slices generiert werden, aber es kann sein, dass sie aufgrund von Hardwarebeschränkungen für Texturgrößen nicht auf jeder Hardware funktionieren. Belassen Sie dies auf dem Default-Wert von ``16384``, wenn Sie unsicher sind.
zh_cn: **Max Texture Size：** （最大纹理尺寸）生成的纹理图集的最大纹理尺寸。 较高的值将导致生成的切片较少，但由于硬件对纹理大小的限制，可能无法在所有硬件上工作。 如果不确定，请将其保留为默认值 ``16384`` 。
zh_tw: **最大紋理尺寸：** 產生的紋理合集的最大紋理尺寸。較高的值將導致產生的切片較少，但由於硬體對紋理大小的限制，可能無法在所有硬體上工作。如果不確定，請將其保留為預設值“16384”。

source: **Environment > Mode:** Controls how environment lighting is sourced when baking lightmaps. The default value of **Scene** is suited for levels with visible exterior parts. For purely indoor scenes, set this to **Disabled** to avoid light leaks and speed up baking. This can also be set to **Custom Sky** or **Custom Color** to use environment lighting that differs from the actual scene's environment sky.
de: **Environment > Modus:** Legt fest, wie die Umgebungsbeleuchtung beim Backen von Lightmaps erzeugt wird. Der Default-Wert **Szene** eignet sich für Level mit sichtbaren Außenarealen. Für reine Innenraumszenen setzen Sie diesen Wert auf **Disabled**, um Lichtlecks zu vermeiden und das Backen zu beschleunigen. Dieser Wert kann auch auf **Benutzerdefinierter Himmel** oder **Benutzerdefinierte Farbe** gesetzt werden, um eine Umgebungsbeleuchtung zu verwenden, die sich vom tatsächlichen Umgebungshimmel der Szene unterscheidet.
zh_cn: **Environment > Mode：** （环境 > 模式）控制烘焙光照贴图时环境光照的来源方式。 **Scene** 的默认值适用于具有可见外部部件的关卡。 对于纯室内场景，将其设置为 **Disabled** 以避免漏光并加快烘焙速度。 也可以将其设置为 **自定义天空** 或 **自定义颜色** 以使用与实际场景的环境天空不同的环境照明。
zh_tw: **環境 > 模式：** 控制烘焙光照貼圖時環境光照的來源方式。 **場景** 的預設值適用於具有可見外部元件的關卡。對於純室內場景，將其設定為**停用**以避免漏光並加快烘烤速度。也可以設定為 **自訂天空** 或 **自訂顏色** 以使用與實際場景的環境天空不同的環境照明。

source: **Gen Probes > Subdiv:** See :ref:`doc_using_lightmap_gi_dynamic_objects`.
de: **Gen.-Probes > Unterteilung:** Siehe :ref:`doc_using_lightmap_gi_dynamic_objects`.
zh_cn: **Gen Probes > Subdiv：** （生成探针 > 细分）详见 :ref:`doc_using_lightmap_gi_dynamic_objects`。
zh_tw: **產生探查 > 細分：** 請參閱 :ref:`doc_using_lightmap_gi_dynamic_objects`。

source: **Data > Light Data:** See :ref:`doc_using_lightmap_gi_data`.
de: **Daten > Lichtdaten:** Siehe :ref:`doc_using_lightmap_gi_data`.
zh_cn: **Data > Light Data：** （数据 > 光照数据）详见 :ref:`doc_using_lightmap_gi_data`。
zh_tw: **資料 > 光資料：** 請參閱 :ref:`doc_using_lightmap_gi_data`。

source: Balancing bake times with quality
de: Backzeiten und Qualität in Einklang bringen
zh_cn: 平衡烘焙时间和质量
zh_tw: 平衡烘焙時間和品質
