Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_voxel_gi.po
Languages: de, zh_cn, zh_tw

source: Using Voxel global illumination
de: Verwendung der Voxel-Global Illumination
zh_cn: 使用体素全局光照
zh_tw: 使用體素全域光照

source: VoxelGI is a form of fully real-time global illumination, intended to be used for small/medium-scale 3D scenes. VoxelGI is fairly demanding on the GPU, so it's best used when targeting dedicated graphics cards.
de: VoxelGI ist eine Form der globalen Beleuchtung in Echtzeit, die für kleine/mittlere 3D-Szenen gedacht ist. VoxelGI ist ziemlich anspruchsvoll für die GPU, so dass es am besten verwendet wird, wenn es auf dedizierte Grafikkarten ausgerichtet ist.
zh_cn: VoxelGI 是一种完全实时的全局光照形式，旨在用于中小型 3D 场景。VoxelGI 对 GPU 的要求相当高，因此最好在针对专用显卡时使用。
zh_tw: VoxelGI 是一種完全即時全域照明的形式，旨在用於中小型 3D 場景。 VoxelGI 對 GPU 的要求相當高，因此在專用顯示卡時最好使用它。

source: VoxelGI is only supported when using the Forward Plus rendering backend, not the Forward Mobile or Compatibility backends.
de: VoxelGI wird nur unterstützt, wenn das Forward Plus Rendering-Backend verwendet wird, nicht das Forward Mobile oder Kompatibilität-Backend.
zh_cn: VoxelGI 仅在使用 Forward+ 渲染后端时才受支持，而不是移动端 Forward 或兼容性后端。
zh_tw: 僅當使用 Forward Plus 算繪後端時才支援 VoxelGI，而不是 Forward Mobile 或相容性後端。

source: Not sure if VoxelGI is suited to your needs? See :ref:`doc_introduction_to_global_illumination_comparison` for a comparison of GI techniques available in Godot 4.
de: Sie sind nicht sicher, ob VoxelGI für Ihre Bedürfnisse geeignet ist? Siehe :ref:`doc_introduction_to_global_illumination_comparison` für einen Vergleich der in Godot 4 verfügbaren GI-Techniken.
zh_cn: 不确定 VoxelGI 是否适合你的需求？请参阅 :ref:`doc_introduction_to_global_illumination_comparison` 以了解 Godot 4 中可用的 GI 技术的比较。
zh_tw: 不確定 VoxelGI 是否適合您的需求？請參閱 doc_introduction_to_global_Illumination_comparison` 以了解 Godot 4 中可用的 GI 技術的比較。

source: Visual comparison
de: Visueller Vergleich
zh_cn: 视觉比较
zh_tw: 視覺比較

source: VoxelGI disabled.
de: VoxelGI deaktiviert.
zh_cn: VoxelGI 已禁用。
zh_tw: VoxelGI 已停用。

source: VoxelGI enabled.
de: VoxelGI aktiviert.
zh_cn: VoxelGI 已启用。
zh_tw: 啟用 VoxelGI。

source: Setting up VoxelGI
de: VoxelGI einrichten
zh_cn: 设置 VoxelGI
zh_tw: 設定

source: Make sure your static level geometry is imported with the Light Baking option set to **Static** or **Static Lightmaps** in the Import dock. For manually added MeshInstance3D nodes, make sure the **Global Illumination > Mode** property is set to **Static** in the inspector.
de: Vergewissern Sie sich, dass Ihre statische Level-Geometrie mit der Option **Statisch** oder **Statische Lightmaps** im Importdock importiert wurde. Stellen Sie bei manuell hinzugefügten MeshInstance3D-Nodes sicher, dass die Property **Global Illumination > Modus** im Inspektor auf **Statisch** eingestellt ist.
zh_cn: 确保在导入停靠面板中将灯光烘焙选项设置为 **静态** 或 **静态光照贴图** 的情况下导入静态级别的几何体。对于手动添加的 MeshInstance3D 节点，请确保在检查器中将 **全局光照 > 模式** 属性设置为 **静态** 。
zh_tw: 確保匯入靜態關卡幾何體時，在匯入塢中將「光烘焙」選項設定為「**靜態**」或「**靜態光照貼圖**」。對於手動新增的 MeshInstance3D 節點，請確保屬性面板中的 **Global Illumination > Mode** 屬性設定為 **Static**。

source: Create a VoxelGI node in the Scene tree dock.
de: Erstellen Sie einen VoxelGI-Node im Szenenbaum-Dock.
zh_cn: 在场景树面板里创建 VoxelGI 节点。
zh_tw: 該簡介是「建立新節點」對話框中唯一的描述。

source: Move the VoxelGI node to the center of the area you want it to cover by dragging the manipulation gizmo in the 3D viewport. Then adjust the VoxelGI's extents by dragging the red points in the 3D viewport (or enter values in the inspector). Make sure the VoxelGI's extents aren't unnecessarily large, or quality will suffer.
de: Bewegen Sie den VoxelGI-Node in die Mitte des Bereichs, den er abdecken soll, indem Sie das Manipulationsgizmo im 3D-Viewport ziehen. Passen Sie dann die Ausdehnung des VoxelGI an, indem Sie die roten Punkte im 3D-Ansichtsfenster ziehen (oder geben Sie Werte im Inspektor ein). Stellen Sie sicher, dass die Ausdehnung des VoxelGI nicht unnötig groß ist, da sonst die Qualität leidet.
zh_cn: 通过在 3D 视口中拖动操纵小工具，将 VoxelGI 节点移动到要覆盖的区域的中心。然后，通过在 3D 视口中拖动红色点（或在检查器中输入值）来调整 VoxelGI 的范围。确保 VoxelGI 的范围不会过大，否则质量会受到影响。
zh_tw: 透過在 3D 視窗中拖曳操作小控件，將 VoxelGI 節點移至您希望其覆蓋的區域的中心。然後透過拖曳 3D 視窗中的紅點（或在屬性面板中輸入值）來調整 VoxelGI 的範圍。確保 VoxelGI 的範圍不會過大，否則品質會受到影響。

source: Select the VoxelGI node and click **Bake** at the top of the 3D editor viewport. This will take at least a few seconds to complete (depending on the number of VoxelGI subdivisions and scene complexity).
de: Wählen Sie den VoxelGI-Node aus und klicken Sie auf **Backen** oben im 3D-Editor Ansichtsfenster. Dieser Vorgang dauert mindestens ein paar Sekunden (abhängig von der Anzahl der VoxelGI-Unterteilungen und der Komplexität der Szene).
zh_cn: 选择 VoxelGI 节点，然后单击 3D 编辑器视口顶部的 **烘焙** 。这将至少需要几秒钟才能完成（取决于 VoxelGI 细分的数量和场景复杂性）。
zh_tw: 選擇 VoxelGI 節點並點選 3D 編輯器視窗頂部的 **Bake**。這至少需要幾秒鐘才能完成（取決於 VoxelGI 細分的數量和場景複雜性）。

source: If at least one mesh contained within the VoxelGI's extents has its global illumination mode set to **Static**, you should see indirect lighting appear within the scene.
de: Wenn für mindestens ein Mesh innerhalb der Ausmaße des VoxelGI der globale Beleuchtungsmodus auf **Statisch** eingestellt ist, sollte in der Szene eine indirekte Beleuchtung erscheinen.
zh_cn: 如果 VoxelGI 范围内至少包含一个网格的全局光照模式设置为 **静态** ，则应看到场景中出现间接光照。
zh_tw: 如果 VoxelGI 範圍內包含的至少一個網格體的全域照明模式設定為 **靜態**，您應該會看到場景中出現間接照明。

source: To avoid bloating text-based scene files with large amounts of binary data, make sure the VoxelGIData resource is *always* saved to an external binary file. This file must be saved with a ``.res`` (binary resource) extension instead of ``.tres`` (text-based resource). Using an external binary resource for VoxelGIData will keep your text-based scene small while ensuring it loads and saves quickly.
de: Um zu vermeiden, dass textbasierte Szenendateien mit großen Mengen an Binärdaten aufgebläht werden, stellen Sie sicher, dass die VoxelGIData-Ressource *immer* in einer externen Binärdatei gespeichert wird. Diese Datei muss mit der Endung ``.res`` (binäre Ressource) anstelle von ``.tres`` (textbasierte Ressource) gespeichert werden. Durch die Verwendung einer externen binären Ressource für VoxelGIData wird Ihre textbasierte Szene klein gehalten und gleichzeitig sichergestellt, dass sie schnell geladen und gespeichert wird.
zh_cn: 为了避免在文本场景文件中包含大量的二进制数据，确保 VoxelGIData 资源*始终*保存到外部的二进制文件中。该文件必须使用 ``.res`` （二进制资源）扩展名保存，而不是 ``.tres`` （文本资源）。使用外部的二进制资源来保存 VoxelGIData 将保持你的文本场景文件小巧，同时确保加载和保存的速度快。
zh_tw: 為了避免包含大量二進位資料的基於文字的場景檔案膨脹，請確保 VoxelGIData 資源「始終」儲存到外部二進位檔案。該檔案必須使用“.res”（二進位資源）副檔名而不是“.tres”（基於文字的資源）來保存。使用 VoxelGIData 的外部二進位資源將使基於文字的場景保持較小，同時確保其快速載入和儲存。

source: VoxelGI node properties
de: VoxelGI-Node-Propertys
zh_cn: VoxelGI 节点属性
zh_tw: 節點屬性

source: The following properties can be adjusted in the VoxelGI node inspector before baking:
de: Die folgenden Propertys können vor dem Baking im VoxelGI Node Inspector angepasst werden:
zh_cn: 烘焙前，可以在 VoxelGI 节点的检查器中调整以下属性：
zh_tw: 烘焙前，可以在 VoxelGI 節點的屬性面板中調整以下屬性：

source: **Subdiv:** Higher values result in more precise indirect lighting, at the cost of lower performance, longer bake times and increased storage requirements.
de: **Unterteilung:** Höhere Werte führen zu einer präziseren indirekten Beleuchtung, allerdings um den Preis einer geringeren Performance, längerer Backzeiten und eines höheren Speicherbedarfs.
zh_cn: **Subdiv：** （细分曲面）值越高，间接光照越精确，但代价是性能更低，烘焙时间更长，存储要求更高。
zh_tw: **細分：** 較高的值會導致更精確的間接照明，但代價是性能較低、烘烤時間更長以及儲存需求增加。

source: **Extents:** Represents the size of the box in which indirect lighting should be baked. Extents are centered around the VoxelGI node's origin.
de: **Ausmaße:** Stellt die Größe der Box dar, in der die indirekte Beleuchtung gebacken werden soll. Extents sind um den Ursprung des VoxelGI-Nodes zentriert.
zh_cn: **Extents：** （范围）表示应在其中烘焙间接光照的区域的大小。范围以 VoxelGI 节点的原点为中心。
zh_tw: **範圍：** 表示應在其中烘焙間接照明的盒子的大小。範圍以 VoxelGI 節點的原點為中心。

source: The following properties can be adjusted in the VoxelGIData *resource* that is contained within a VoxelGI node after it has been baked:
de: Die folgenden Propertys können in der VoxelGIData-*Ressource* angepasst werden, die in einem VoxelGI-Node enthalten ist, nachdem dieser gebacken wurde:
zh_cn: 可以在 VoxelGI 节点烘焙后包含的 VoxelGIData *资源* 中调整以下属性：
zh_tw: 烘焙後，可以在 VoxelGI 節點中包含的 VoxelGIData *資源* 中調整下列屬性：

source: **Dynamic Range:** The maximum brightness that can be represented in indirect lighting. Higher values make it possible to represent brighter indirect light, at the cost of lower precision (which can result in visible banding). If in doubt, leave this unchanged.
de: **Dynamischer Bereich:** Die maximale Helligkeit, die bei indirekter Beleuchtung dargestellt werden kann. Höhere Werte ermöglichen es, helleres indirektes Licht darzustellen, allerdings auf Kosten einer geringeren Präzision (was zu sichtbarem Banding führen kann). Im Zweifelsfall sollten Sie diesen Wert unverändert lassen.
zh_cn: **Dynamic Range：** （动态范围）可以在间接光照中表示的最大亮度。较高的值可以表示更亮的间接光，但代价是精度较低（这可能导致可见条纹）。如果有疑问，请保持不变。
zh_tw: **動態範圍：** 在間接照明中可以表示的最大亮度。較高的值可以表示更亮的間接光，但代價是精度較低（可能導致可見條帶）。如有疑問，請保持不變。

source: **Energy:** The indirect lighting's overall energy. This also effects the energy of direct lighting emitted by meshes with emissive materials.
de: **Energie:** Die Gesamtenergie der indirekten Beleuchtung. Dies wirkt sich auch auf die Energie der direkten Beleuchtung aus, die von Meshes mit emittierenden Materialien ausgestrahlt wird.
zh_cn: **Energy：** （能量）间接光照的总能量。这也会影响由具有自发光材质的网格发射的直接光照的能量。
zh_tw: **能量：** 間接照明的整體能量。這也會影響具有發射材料的網格發射的直接照明的能量。

source: **Bias:** Optional bias added to lookups into the voxel buffer at run time. This helps avoid self-occlusion artifacts.
de: **Bias:** Optionaler Bias bei der Suche im Voxelpuffer zur Laufzeit. Dies hilft, Artefakte der Selbst-Occlusion zu vermeiden.
zh_cn: **Bias：** （偏置）在运行时添加到体素缓冲区中查找的可选偏置。这有助于避免自遮挡伪影。
zh_tw: **偏差：** 在運作時新增到體素緩衝區搜尋的可選偏差。這有助於避免自遮擋偽影。

source: **Normal Bias:** Similar to **Bias**, but offsets the lookup into the voxel buffer by the surface normal. This also helps avoid self-occlusion artifacts. Higher values reduce self-reflections visible in non-rough materials, at the cost of more visible light leaking and flatter-looking indirect lighting. To prioritize hiding self-reflections over lighting quality, set **Bias** to ``0.0`` and **Normal Bias** to a value between ``1.0`` and ``2.0``.
de: **Normalen-Bias:** Ähnlich wie **Bias**, jedoch wird die Suche im Voxelpuffer um die Oberflächennormale verschoben. Dies hilft auch, Selbstreflexionsartefakte zu vermeiden. Höhere Werte reduzieren Selbstreflexionen, die in nicht rauen Materialien sichtbar sind, auf Kosten von mehr sichtbarem Lichtleck-Effekten und flacher aussehender indirekter Beleuchtung. Um das Ausblenden von Selbstreflexionen der Beleuchtungsqualität vorzuziehen, setzen Sie **Bias** auf ``0.0`` und **Normalen-Bias** auf einen Wert zwischen ``1.0`` und ``2.0``.
zh_cn: **Normal Bias：** （法线偏置）类似于 **Bias** ，但通过表面法线偏移到体素缓冲区来查找。这也有助于避免自遮挡伪影。更高的值会减少非粗糙材料中可见的自反射，代价是更明显的漏光和更平坦的间接光照。要将隐藏自反射优先于光照质量，请将 **Bias** 设置为 ``0.0`` ，并将 **Normal Bias** 的值设定在 ``1.0`` 和 ``2.0`` 之间。
zh_tw: **法線偏差：** 與 **偏差** 類似，但透過表面法線偏移對體素緩衝區的搜尋。這也有助於避免自遮擋偽影。較高的值會減少非粗糙材料中可見的自反射，但代價是更多的可見光洩漏和看起來更平坦的間接照明。若要將隱藏自反射優先於照明質量，請將 **Bias** 設定為“0.0”，將 **Normal Bias** 設定為“1.0”和“2.0”之間的值。

source: **Propagation:** The energy factor to use for bounced indirect lighting. Higher values will result in brighter, more diffuse lighting (which may end up looking too flat). When **Use Two Bounces** is enabled, you may want to decrease **Propagation** to compensate for the overall brighter indirect lighting.
de: **Verbreitung:** Der Energiefaktor, der für abgeprallte indirekte Beleuchtung verwendet wird. Höhere Werte führen zu einer helleren, diffuseren Beleuchtung (die am Ende zu flach aussehen kann). Wenn **Zwei Abprälle verwenden** aktiviert ist, sollten Sie **Verbreitung** verringern, um die insgesamt hellere indirekte Beleuchtung auszugleichen.
zh_cn: **Propagation：** （传播）用于反弹间接光照的能量系数。更高的值将导致更明亮、更分散的光照（最终可能看起来过于平坦）。启用 **Use Two Bounces** 后，可能需要减少 **Propagation** 以补偿整体更亮的间接光照。
zh_tw: **傳播：** 用於反射間接照明的能量因子。較高的值將導致更亮、更漫射的照明（最終可能看起來太平坦）。啟用「使用兩次反射」時，您可能需要減少「傳播」以補償整體更亮的間接照明。

source: **Use Two Bounces:** If enabled, lighting will bounce twice instead of just once. This results in more realistic-looking indirect lighting, and makes indirect lighting visible in reflections as well. Enabling this generally has no noticeable performance cost.
de: **Zwei Abprälle verwenden:** Wenn diese Option aktiviert ist, wird die Beleuchtung zweimal statt nur einmal abgeprallt. Dies führt zu einer realistischeren indirekten Beleuchtung und macht indirekte Beleuchtung auch in Reflexionen sichtbar. Die Aktivierung dieser Funktion hat im Allgemeinen keine nennenswerten Auswirkungen auf die Performance.
zh_cn: **Use Two Bounces：**\ （使用二次反弹）如果启用，光照将反射两次，而不是一次。这会产生更逼真的间接照明效果，并使间接照明在反射目标物体上也可见。启用此功能通常不会带来很大的运行压力。
zh_tw: **使用兩次反彈：** 如果啟用，燈光將反彈兩次而不是一次。這會產生更真實的間接照明，並使間接照明在反射中也可見。啟用此功能通常不會產生明顯的效能成本。

source: **Interior:** If enabled, environment sky lighting will not be taken into account by VoxelGI. This should be enabled in indoor scenes to avoid light leaking from the environment.
de: **Innenbereich:** Wenn diese Option aktiviert ist, wird die Himmelsbeleuchtung der Umgebung von VoxelGI nicht berücksichtigt. Dies sollte in Innenraumszenen aktiviert werden, um zu vermeiden, dass Licht aus der Umgebung herausleckt.
zh_cn: **Interior：**\ （内部）如果启用，VoxelGI 将忽略环境天空照明。此功能最好在室内场景中启用，以避免光线从外部环境中泄漏进来影响最终效果。
zh_tw: **室內：** 如果啟用，VoxelGI 將不會考慮環境天空照明。應在室內場景中啟用此功能，以避免環境中漏光。

source: VoxelGI interaction with lights and objects
de: VoxelGI-Interaktion mit Lichtern und Objekten
zh_cn: VoxelGI 与灯光和对象的交互
zh_tw: 產生金鑰儲存區

source: To ensure correct visuals when using VoxelGI, you must configure your meshes and lights' global illumination properties according to their *purpose* in the scene (static or dynamic).
de: Um eine korrekte Darstellung bei der Verwendung von VoxelGI zu gewährleisten, müssen Sie die Global-Illumination-Propertys Ihrer Meshes und Lichter je nach ihrem *Zweck* in der Szene (statisch oder dynamisch) konfigurieren.
zh_cn: 为了确保在使用VoxelGI时获得正确的视觉效果，必须根据网格和灯光在场景中的*用途*（静态或动态）来配置它们的全局照明属性。
zh_tw: 為了確保使用 VoxelGI 時正確的視覺效果，您必須根據場景中的「用途」（靜態或動態）配置網格和燈光的全域照明屬性。

source: There are 3 global illumination modes available for meshes:
de: Es sind 3 Global Illumination-Modi für Meshes verfügbar:
zh_cn: 网格有 3 种全局光照模式可选：
zh_tw: 有四種可用於取得設定的巨集：

source: **Disabled:** The mesh won't be taken into account for VoxelGI baking. The mesh will *receive* indirect lighting from the scene, but it will not *contribute* indirect lighting to the scene.
de: **Deaktiviert:** Das Mesh wird beim VoxelGI-Backen nicht berücksichtigt. Das Mesh wird indirekte Beleuchtung von der Szene *empfangen*, aber es wird keine indirekte Beleuchtung zur Szene *beitragen*.
zh_cn: **Disabled：**\ （禁用）VoxelGI 烘焙时不考虑该网格。网格仍会\ *接收*\ 场景中的间接光照，但是不会\ *贡献*\ 场景中的间接光照。
zh_tw: **Enabled（啟用）** ：啟用探查捕獲，使得動態物件能夠 *接受* 間接光照。無論此選項是否啟用，動態物件都無法對場景 *造成* 間接光照，這是光照貼圖的局限性。

source: **Static (default):** The mesh will be taken into account for VoxelGI baking. The mesh will both receive *and* contribute indirect lighting to the scene. If the mesh is changed in any way after baking, the VoxelGI node must be baked again. Otherwise, indirect lighting will look incorrect.
de: **Statisch (Default):** Das Mesh wird beim VoxelGI-Backen berücksichtigt. Das Mesh erhält *und* trägt indirekte Beleuchtung zur Szene bei. Wenn das Mesh nach dem Backen in irgendeiner Weise verändert wird, muss der VoxelGI Node erneut gebacken werden. Andernfalls wird die indirekte Beleuchtung falsch aussehen.
zh_cn: **Static（默认）：**\ （静态）VoxelGI 将依据网格烘焙模型。网格将即时接受\ *并*\ 为场景提供间接照明。如果网格在烘焙后需要任何方式的更改，则必须再次烘焙 VoxelGI 节点。否则，间接照明效果将会显示的不正常。
zh_tw: **靜態（預設）：** VoxelGI 烘焙時將考慮網格。網格將接收*並*為場景提供間接照明。如果烘焙後網格發生任何變化，則必須再次烘焙 VoxelGI 節點。否則，間接照明看起來會不正確。

source: **Dynamic:** The mesh won't be taken into account for VoxelGI baking, but it will still receive *and* contribute indirect lighting to the scene in real-time. This option is much slower compared to **Static**. Only use the **Dynamic** global illumination mode on large meshes that will change significantly during gameplay.
de: **Dynamisch:** Das Mesh wird beim VoxelGI-Backen nicht berücksichtigt, aber es erhält *und* trägt in Echtzeit zur indirekten Beleuchtung der Szene bei. Diese Option ist im Vergleich zu **Statisch** viel langsamer. Verwenden Sie den Global Illumination-Modus **Dynamisch** nur bei großen Meshes, die sich während des Spiels stark verändern.
zh_cn: **Dynamic：**\ （动态）VoxelGI 烘焙将忽略网格，但它仍然会即时接收\ *并*\ 为场景提供间接照明。此选项对于 **Static** 相比要慢得多。建议仅在游戏过程中会发生明显变化的大型网格上使用 **Dynamic** 全局照明模式。
zh_tw: **動態：** VoxelGI 烘焙時不會考慮網格，但它仍會即時接收*並*為場景貢獻間接光照。與 **靜態** 相比，此選項要慢得多。僅在大型網格上使用**動態**全域照明模式，這些網格在遊戲過程中會發生顯著變化。

source: Additionally, there are 3 bake modes available for lights (DirectionalLight3D, OmniLight3D and SpotLight3D):
de: Zusätzlich gibt es 3 Back-Modi für Lichter (DirectionalLight3D, OmniLight3D und SpotLight3D):
zh_cn: 此外，对于灯光（DirectionalLight3D、OmniLight3D 和 SpotLight3D），还有三种可用的烘焙模式：
zh_tw: 此外，還有 3 種可用於燈光的烘焙模式（DirectionalLight3D、OmniLight3D 和 SpotLight3D）：

source: **Disabled:** The light won't be taken into account for VoxelGI baking. The light won't contribute indirect lighting to the scene.
de: **Deaktiviert:** Das Licht wird beim VoxelGI-Backen nicht berücksichtigt. Das Licht trägt nicht zur indirekten Beleuchtung der Szene bei.
zh_cn: **Disabled：**\ （禁用）烘焙 VoxelGI 时不会考虑该灯光。该灯光也不会参与场景的间接光照。
zh_tw: **禁用：** VoxelGI 烘焙不會考慮光線。此燈光不會為場景提供間接照明。

source: **Static:** The light will be taken into account for VoxelGI baking. The light will contribute indirect lighting to the scene. If the light is changed in any way after baking, the VoxelGI node must be baked again or indirect lighting will look incorrect. If in doubt, use this mode for level lighting.
de: **Statisch:** Das Licht wird beim VoxelGI-Backen berücksichtigt. Das Licht trägt zur indirekten Beleuchtung der Szene bei. Wenn das Licht nach dem Backen in irgendeiner Weise verändert wird, muss der VoxelGI-Node erneut gebacken werden, sonst sieht die indirekte Beleuchtung nicht korrekt aus. Im Zweifelsfall sollten Sie diesen Modus für die Level-Beleuchtung verwenden.
zh_cn: **Static：**\ （静态）VoxelGI 烘焙将启用光线。灯光会为场景提供间接照明。如果在烘焙后以任何方式更改了灯光，则必须再次烘焙 VoxelGI 节点，否则间接照明将看起来不正常。如果再出现问题，请使用此模式进行水平照明。
zh_tw: **靜態：** VoxelGI 烘焙時將考慮光線。燈光將為場景提供間接照明。如果烘焙後光照發生任何變化，則必須再次烘焙 VoxelGI 節點，否則間接光照將看起來不正確。如果有疑問，請使用此模式進行水平照明。

source: **Dynamic (default):** The light won't be taken into account for VoxelGI baking, but it will still contribute indirect lighting to the scene in real-time. This option is slower compared to **Static**. Only use the **Dynamic** global illumination mode on lights that will change significantly during gameplay.
de: **Dynamisch (Default):** Das Licht wird beim VoxelGI-Backen nicht berücksichtigt, aber es trägt trotzdem in Echtzeit zur indirekten Beleuchtung der Szene bei. Diese Option ist im Vergleich zu **Statisch** langsamer. Verwenden Sie den Global Illumination-Modus **Dynamisch** nur für Lichter, die sich während des Spiels stark verändern.
zh_cn: **Dynamic（默认）：**\ （动态）VoxelGI 烘焙会忽略灯光，但它仍会实时为场景提供间接照明。此选项与 **Static** 相比速度较慢。建议仅在游戏过程中会发生显著变化的灯光上使用 **Dynamic** 全局照明模式。
zh_tw: **動態（預設）：** VoxelGI 烘焙不會考慮燈光，但它仍會即時為場景提供間接照明。與 **靜態** 相比，此選項速度較慢。僅對遊戲過程中會發生顯著變化的燈光使用**動態**全域照明模式。

source: The amount of indirect energy emitted by a light depends on its color, energy *and* indirect energy properties. To make a specific light emit more or less indirect energy without affecting the amount of direct light emitted by the light, adjust the **Indirect Energy** property in the Light3D inspector.
de: Die Menge an indirekter Energie, die von einem Licht ausgestrahlt wird, hängt von den Propertys Farbe, Energie *und* indirekte Energie ab. Um ein bestimmtes Licht dazu zu bringen, mehr oder weniger indirekte Energie zu emittieren, ohne die Menge an direktem Licht, das von dem Licht emittiert wird, zu beeinflussen, passen Sie die Property **Indirekte Energie** im Light3D Inspektor an.
zh_cn: 光发射的间接能量取决于它的颜色、能量\ *以及*\ 间接能量特性。若要使特定灯光或多或少地发射间接能量而不影响灯光发射的直接光量，请调整 Light3D 检查器中的 **Indirect Energy** 属性。
zh_tw: 光發出的間接能量的量取決於其顏色、能量*和*間接能量屬性。要使特定燈光發出或多或少的間接能量而不影響燈光發出的直接光量，請在 Light3D 屬性面板中調整 **間接能量** 屬性。

source: See :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` for general usage recommendations.
de: Siehe :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` für allgemeine Anwendungsempfehlungen.
zh_cn: 常规使用建议见 :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations`\ 。
zh_tw: 常規使用建議見 :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations`。

source: Adjusting VoxelGI performance and quality
de: Einstellen der Performance und Qualität von VoxelGI
zh_cn: 调整 VoxelGI 的性能与质量
zh_tw: 調整 VoxelGI 的性能與品質

source: Since VoxelGI is relatively demanding, it will perform best on systems with recent dedicated GPUs. On older dedicated GPUs and integrated graphics, tweaking the settings is necessary to achieve reasonable performance.
de: Da VoxelGI relativ anspruchsvoll ist, erzielt es die beste Performance auf Systemen mit aktuellen dedizierten Grafikprozessoren. Bei älteren dedizierten Grafikprozessoren und integrierten Grafikprozessoren ist eine Anpassung der Einstellungen erforderlich, um eine angemessene Performance zu erzielen.
zh_cn: 由于VoxelGI的要求相对较高，因此它会在较新发布的专业GPU的系统上有好的表现力。在较旧GPU和集成图形上，需要调整设置以获得相对好些的性能。
zh_tw: 由於 VoxelGI 的要求相對較高，因此它在配備最新專用 GPU 的系統上表現最佳。在較舊的專用 GPU 和整合式顯示卡上，需要調整設定才能獲得合理的效能。

source: In the Project Settings' **Rendering > Global Illumination** section, VoxelGI quality can also be adjusted in two ways:
de: Im Abschnitt **Rendern > Global Illumination** der Projekteinstellungen kann die VoxelGI-Qualität ebenfalls auf zwei Arten angepasst werden:
zh_cn: 在“项目设置”的 **渲染 > 全局光照** 中，还可以通过两种方式调整 VoxelGI 质量：
zh_tw: 在專案設定的**算繪 > 全域照明**部分中，VoxelGI 品質也可以透過兩種方式調整：

source: **Voxel Gi > Quality:** If set to **Low** instead of **High**, voxel cone tracing will only use 4 taps instead of 6. This speeds up rendering at the cost of less pronounced ambient occlusion.
de: **Voxel GI > Qualität:** Wenn die Einstellung **Niedrig** statt **Hoch** gewählt wird, verwendet das Voxel-Kegel-Tracing nur 4 statt 6 Taps. Dies beschleunigt das Rendern auf Kosten einer weniger ausgeprägten Ambient Occlusion.
zh_cn: **体素 GI > 质量：**\ 如果将其设置为 **Low** 而不是 **High**\ ，体素锥追踪将只使用 4 个采样点而不是 6 个。这样可以加快渲染速度，但会导致环境遮蔽效果不太明显。
zh_tw: **體素Gi > 品質：** 如果設定為**低** 而不是**高**，體素錐追蹤將只使用4 個抽頭而不是6 個。這會加快算繪速度，但代價是環境遮擋不太明顯。

source: **Gi > Use Half Resolution:** If enabled, both VoxelGI and SDFGI will have their GI buffer rendering at halved resolution. For instance, when rendering in 3840×2160, the GI buffer will be computed at a 1920×1080 resolution. Enabling this option saves a lot of GPU time, but it can introduce visible aliasing around thin details.
de: **GI > Halbe Auflösung verwenden:** Wenn diese Option aktiviert ist, werden die GI-Puffer von VoxelGI und SDFGI mit halbierter Auflösung gerendert. Beim Rendern in 3840×2160 wird der GI-Puffer zum Beispiel mit einer Auflösung von 1920×1080 berechnet. Die Aktivierung dieser Option spart eine Menge GPU-Zeit, kann aber zu sichtbarem Aliasing um feine Details führen.
zh_cn: **GI > 半分辨率：**\ 如果启用，VoxelGI 和 SDFGI 将减半分辨率渲染 GI 缓冲区。 例如，在 3840×2160 分辨率时，GI 缓冲区将用 1920×1080 分辨率计算。 启用该选项可节省大量 GPU 运算时间，但它可能会在边缘周围引入可见的锯齿。
zh_tw: **Gi > 使用一半解析度：** 如果啟用，VoxelGI 和 SDFGI 都將以減半解析度算繪 GI 緩衝區。例如，當以 3840×2160 算繪時，GI 緩衝區將以 1920×1080 解析度計算。啟用此選項可以節省大量 GPU 時間，但它可能會在薄細節周圍引入可見的鋸齒。

source: Note that the **Advanced** toggle must be enabled in the project settings dialog for the above settings to be visible.
de: Beachten Sie, dass der Schalter **Erweitert** im Projekteinstellungsdialog aktiviert sein muss, damit die obigen Einstellungen sichtbar sind.
zh_cn: 注意，必须先启用项目设置对话框的\ **高级**\ 开关，才会显示上述设置项。
zh_tw: 請注意，必須在專案設定對話方塊中啟用 **進階** 切換才能使上述設定可見。
