Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_sdfgi.po
Languages: de, zh_cn, zh_tw

source: The amount of indirect energy emitted by a light depends on its color, energy *and* indirect energy properties. To make a specific light emit more or less indirect energy without affecting the amount of direct light emitted by the light, adjust the **Indirect Energy** property in the Light3D inspector.
de: Die Menge an indirekter Energie, die von einem Licht ausgestrahlt wird, hängt von den Propertys Farbe, Energie *und* indirekte Energie ab. Um ein bestimmtes Licht dazu zu bringen, mehr oder weniger indirekte Energie zu emittieren, ohne die Menge an direktem Licht, das von dem Licht emittiert wird, zu beeinflussen, passen Sie die Property **Indirekte Energie** im Light3D Inspektor an.
zh_cn: 光发射的间接能量取决于它的颜色、能量\ *以及*\ 间接能量特性。若要使特定灯光或多或少地发射间接能量而不影响灯光发射的直接光量，请调整 Light3D 检查器中的 **Indirect Energy** 属性。
zh_tw: 光發出的間接能量的量取決於其顏色、能量*和*間接能量屬性。要使特定燈光發出或多或少的間接能量而不影響燈光發出的直接光量，請在 Light3D 屬性面板中調整 **間接能量** 屬性。

source: See :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` for general usage recommendations.
de: Siehe :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` für allgemeine Anwendungsempfehlungen.
zh_cn: 常规使用建议见 :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations`\ 。
zh_tw: 常規使用建議見 :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations`。

source: Adjusting SDFGI performance and quality
de: Anpassung der Performance und Qualität von SDFGI
zh_cn: 调整 SDFGI 性能和质量
zh_tw: 調整 SDFGI 性能和品質

source: Since SDFGI is relatively demanding, it will perform best on systems with recent dedicated GPUs. On older dedicated GPUs and integrated graphics, tweaking the settings is necessary to achieve reasonable performance.
de: Da SDFGI relativ anspruchsvoll ist, erzielt es die beste Performance auf Systemen mit modernen dedizierten GPUs. Bei älteren dedizierten Grafikprozessoren und integrierten Grafikchips ist eine Anpassung der Einstellungen erforderlich, um eine angemessene Performance zu erzielen.
zh_cn: 由于 SDFGI 要求相对较高，因此它在配备最新专用 GPU 的系统上表现最佳。 在较旧的专用 GPU 和集成显卡上，需要调整设置才能获得合理的性能。
zh_tw: 由於 SDFGI 要求相對較高，因此它在配備最新專用 GPU 的系統上表現最佳。在較舊的專用 GPU 和整合式顯示卡上，需要調整設定才能獲得合理的效能。

source: In the Project Settings' **Rendering > Global Illumination** section, SDFGI quality can also be adjusted in several ways:
de: Im Abschnitt **Rendern > Global Illumination** der Projekteinstellungen kann die SDFGI-Qualität ebenfalls auf mehrere Arten angepasst werden:
zh_cn: 在项目设置的 **渲染 > 全局光照** 部分，还可以通过几种方式调整SDFGI的质量：
zh_tw: 在「專案設定」的 **算繪 > 全域照明** 部分中，也可以透過多種方式調整 SDFGI 品質：

source: **Sdfgi > Probe Ray Count:** Higher values result in better quality, at the cost of higher GPU usage. If this value is set too low, this can cause surfaces to have visible "splotches" of indirect lighting on them due to the number of rays thrown being very low.
de: **Sdfgi > Probe-Strahlenanzahl:** Höhere Werte führen zu einer besseren Qualität, allerdings auf Kosten einer höheren GPU-Auslastung. Wenn dieser Wert zu niedrig eingestellt ist, kann dies dazu führen, dass Oberflächen sichtbare "Flecken" mit indirekter Beleuchtung aufweisen, da die Anzahl der geworfenen Strahlen sehr niedrig ist.
zh_cn: **SDFGI > 探测射线数：** 值越高，质量越好，但代价是 GPU 使用率较高。 如果该值设置得太低，则由于投射的光线数量非常少，可能会导致表面上出现可见的间接照明“斑点”。
zh_tw: **Sdfgi > 偵測光線計數：** 值越高，品質越好，但代價是 GPU 使用率較高。如果該值設定得太低，則由於投射的光線數量非常少，可能會導致表面上出現可見的間接照明「斑點」。

source: **Sdfgi > Frames To Converge:** Higher values result in better quality, but GI will take more time to fully converge. The effect of this setting is especially noticeable when first loading a scene, or when lights with a bake mode other than **Disabled** are moving fast. If this value is set too low, this can cause surfaces to have visible "splotches" of indirect lighting on them due to the number of rays thrown being very low. If your scene's lighting doesn't have fast-moving lights that contribute to GI, consider setting this to ``30`` to improve quality without impacting performance.
de: **Sdfgi > Frames zum Konvergieren:** Höhere Werte führen zu einer besseren Qualität, aber GI braucht mehr Zeit, um vollständig zu konvergieren. Der Effekt dieser Einstellung macht sich besonders beim ersten Laden einer Szene bemerkbar, oder wenn sich Lichter mit einem anderen Back-Modus als **Deaktiviert** schnell bewegen. Wenn dieser Wert zu niedrig eingestellt ist, kann dies dazu führen, dass Oberflächen sichtbare "Flecken" mit indirekter Beleuchtung aufweisen, da die Anzahl der geworfenen Strahlen sehr gering ist. Wenn die Beleuchtung Ihrer Szene keine sich schnell bewegenden Lichter enthält, die zum GI beitragen, sollten Sie diesen Wert auf ``30`` setzen, um die Qualität zu verbessern, ohne die Performance zu beeinträchtigen.
zh_cn: **SDFGI > 收敛帧数：** 值越高，质量越好，但 GI 需要更多时间才能完全收敛。 当首次加载场景时，或者当具有除 **禁用** 之外的烘焙模式的灯光快速移动时，此设置的效果尤其明显。 如果该值设置得太低，则由于投射的光线数量非常少，可能会导致表面上出现可见的间接照明“斑点”。 如果你的场景照明没有有助于 GI 的快速移动灯光，请考虑将其设置为 ``30`` 以提高质量而不影响性能。
zh_tw: **Sdfgi > 收斂影格數：** 值越高，品質越好，但 GI 需要更多時間才能完全收斂。當首次加載場景時，或者當具有除**禁用**之外的烘焙模式的燈光快速移動時，此設定的效果尤其明顯。如果該值設定得太低，則由於投射的光線數量非常少，可能會導致表面上出現可見的間接照明「斑點」。如果您的場景照明沒有有助於 GI 的快速移動燈光，請考慮將其設定為「30」以提高品質而不影響效能。

source: **Sdfgi > Frames To Update Light:** Lower values result in moving lights being reflected faster, at the cost of higher GPU usage. If your scene's lighting doesn't have fast-moving lights that contribute to GI, consider setting this to ``16`` to improve performance.
de: **Sdfgi > Frames zum Aktualisieren der Lichter:** Niedrigere Werte führen dazu, dass sich bewegende Lichter schneller reflektiert werden, allerdings auf Kosten einer höheren GPU-Auslastung. Wenn die Beleuchtung Ihrer Szene keine sich schnell bewegenden Lichter enthält, die zum GI beitragen, sollten Sie diesen Wert auf ``16`` setzen, um die Performance zu verbessern.
zh_cn: **SDFGI > 更新灯光帧数：** 较低的值会导致移动灯光反射得更快，但代价是 GPU 使用率更高。 如果你的场景照明没有有助于 GI 的快速移动灯光，请考虑将其设置为 ``16`` 以提高性能。
zh_tw: **Sdfgi > 更新燈光的畫面：** 較低的值會導致移動光反射得更快，但代價是 GPU 使用率較高。如果您的場景照明沒有有助於 GI 的快速移動燈光，請考慮將其設定為「16」以提高效能。

source: **Gi > Use Half Resolution:** If enabled, both SDFGI and VoxelGI will have their GI buffer rendering at halved resolution. For instance, when rendering in 3840×2160, the GI buffer will be computed at a 1920×1080 resolution. Enabling this option saves a lot of GPU time, but it can introduce visible aliasing around thin details.
de: **Gi > Halbe Auflösung verwenden:** Wenn diese Option aktiviert ist, werden die GI-Puffer von SDFGI und VoxelGI mit halbierter Auflösung gerendert. Beim Rendern in 3840×2160 wird der GI-Puffer zum Beispiel mit einer Auflösung von 1920×1080 berechnet. Die Aktivierung dieser Option spart eine Menge GPU-Zeit, kann aber zu sichtbarem Aliasing um feine Details führen.
zh_cn: **全局光 > 半分辨率：** 如果启用，SDFGI 和 VoxelGI 都将以减半的分辨率渲染 GI 缓冲区。 例如，当以 3840×2160 渲染时，GI 缓冲区将以 1920×1080 分辨率计算。 启用此选项可以节省大量 GPU 时间，但它可能会在薄细节周围引入可见的锯齿。
zh_tw: **Gi > 使用一半解析度：** 如果啟用，SDFGI 和 VoxelGI 都將以減半解析度算繪 GI 緩衝區。例如，當以 3840×2160 算繪時，GI 緩衝區將以 1920×1080 解析度計算。啟用此選項可以節省大量 GPU 時間，但它可能會在薄細節周圍引入可見的鋸齒。

source: SDFGI rendering performance also depends on the number of cascades and the cell size chosen in the Environment resource (see above).
de: Die Performance des SDFGI-Renderings hängt auch von der Anzahl der Kaskaden und der in der Environment-Ressource gewählten Zellengröße ab (siehe oben).
zh_cn: SDFGI 渲染性能还取决于级联数量和环境资源中选择的单元大小（见上文）。
zh_tw: SDFGI 算繪效能也取決於級聯數量和環境資源中所選的單元大小（請參閱上文）。

source: SDFGI caveats
de: Hinweise zu SDFGI
zh_cn: 一些 SDFGI 的注意事项
zh_tw: 效能

source: SDFGI has some downsides due to its cascaded nature. When the camera moves, cascade shifts may be visible in indirect lighting. This can be alleviated by adjusting the cascade size, but also by adding fog (which will make distant cascade shifts less noticeable).
de: SDFGI hat aufgrund seiner Kaskadennatur einige Nachteile. Wenn sich die Kamera bewegt, können Kaskadenverschiebungen bei indirekter Beleuchtung sichtbar werden. Dies kann durch Anpassung der Kaskadengröße, aber auch durch Hinzufügen von Nebel (der entfernte Kaskadenverschiebungen weniger auffällig macht) gemildert werden.
zh_cn: SDFGI 由于其级联性质而有一些缺点。当摄影机移动时，在间接照明中可能会看到级联移动。这可以通过调整级联的大小来缓解，也可以通过添加雾效来缓解（这将使远处的级联偏移不那么明显）。
zh_tw: 由於其級聯性質，SDFGI 有一些缺點。當相機移動時，在間接照明下可能會看到級聯移位。這可以透過調整級聯大小來緩解，也可以透過新增霧（這將使遠處的級聯變化不那麼明顯）來緩解。

source: Additionally, performance will suffer if the camera moves too fast. This can be fixed in two ways:
de: Außerdem leidet die Performance, wenn sich die Kamera zu schnell bewegt. Dies kann auf zwei Arten behoben werden:
zh_cn: 此外，如果相机移动过快，性能也会受到影响。这可以通过两种方式解决：
zh_tw: 此外，如果相機移動太快，效能也會受到影響。這可以透過兩種方式解決：

source: Ensuring the camera doesn't move too fast in any given situation.
de: Sicherstellen, dass sich die Kamera in einer bestimmten Situation nicht zu schnell bewegt.
zh_cn: 确保相机在任何特定情况下都不会移动过快。
zh_tw: 確保相機在任何給定情況下都不會移動得太快。

source: Temporarily disabling SDFGI in the Environment resource if the camera needs to be moved at a high speed, then enabling SDFGI once the camera speed slows down.
de: Vorübergehendes Deaktivieren von SDFGI in der Environment-Ressource, wenn die Kamera mit hoher Geschwindigkeit bewegt werden muss, und anschließendes Aktivieren von SDFGI, sobald sich die Geschwindigkeit der Kamera verlangsamt.
zh_cn: 如果需要高速移动摄影机，请在环境资源中暂时禁用 SDFGI，然后在摄影机速度减慢时启用 SDFGI。
zh_tw: 如果相機需要高速移動，請暫時停用環境資源中的 SDFGI，然後在相機速度減慢時啟用 SDFGI。

source: When SDFGI is enabled, it will also take some time for global illumination to be fully converged (25 frames by default). This can create a noticeable transition effect while GI is still converging. To hide this, you can use a ColorRect node that spans the whole viewport and fade it out when switching scenes using an AnimationPlayer node.
de: Wenn SDFGI aktiviert ist, dauert es auch einige Zeit, bis die Global Illumination vollständig konvergiert ist (standardmäßig 25 Frames). Dies kann zu einem spürbaren Übergangseffekt führen, während die GI noch konvergiert. Um dies auszublenden, können Sie einen ColorRect-Knoten verwenden, der sich über das gesamte Ansichtsfenster erstreckt, und ihn beim Wechseln von Szenen mit einem AnimationPlayer-Node ausblenden.
zh_cn: 启用 SDFGI 时，全局照明也需要一些时间才能完全收敛（默认情况下为25帧）。这可以在GI（全局光照）仍在收敛时产生明显的过渡效果。若要隐藏此内容，可以使用跨整个视口的 ColorRect 节点，并在使用 AnimationPlayer 节点切换场景时将其淡出。
zh_tw: 當SDFGI啟用時，全域照明完全收斂也需要一些時間（預設25影格）。這可以在 GI 仍在收斂的同時產生明顯的過渡效果。若要隱藏這一點，您可以使用跨越整個視窗的 ColorRect 節點，並在使用 AnimationPlayer 節點切換場景時將其淡出。

source: The signed distance field is only updated when the camera moves in and out of a cascade. This means that if geometry is modified in the distance, the global illumination appearance will be correct once the camera gets closer. However, if a nearby object with a bake mode set to **Static** or **Dynamic** is moved (such as a door), the global illumination will appear incorrect until the camera moves away from the object.
de: Das Signed Distance Field wird nur aktualisiert, wenn sich die Kamera in eine Kaskade hinein und aus ihr heraus bewegt. Das heißt, wenn die Geometrie in der Entfernung geändert wird, ist das Erscheinungsbild der Global Illumination korrekt, wenn die Kamera näher kommt. Wenn jedoch ein nahe gelegenes Objekt mit einem auf **Statisch** oder **Dynamisch** eingestellten Back-Modus bewegt wird (z. B. eine Tür), erscheint die Global Illumination falsch, bis sich die Kamera von dem Objekt entfernt.
zh_cn: 仅当摄像机移入和移出级联时，才会更新带符号距离场。这意味着，如果在远处修改几何图形，则一旦相机靠近，全局光照的外观将是正确的。但是，如果移动烘焙模式设置为**静态**或**动态**的附近对象（例如门），则全局照明将不正确，直到摄像机远离该对象。
zh_tw: 只有當相機移入和移出級聯時，帶符號的距離場才會更新。這意味著，如果在遠處修改幾何形狀，一旦相機靠近，全局照明外觀將是正確的。但是，如果移動烘焙模式設定為**靜態**或**動態**的附近物件（例如門），則全域照明將顯示不正確，直到相機遠離該物件。

source: SDFGI's sharp reflections are only visible on opaque materials. Transparent materials will only use rough reflections, even if the material's roughness is lower than 0.2.
de: Die scharfen Reflexionen von SDFGI sind nur bei undurchsichtigen Materialien sichtbar. Bei transparenten Materialien werden nur grobe Reflexionen verwendet, selbst wenn die Rauheit des Materials unter 0,2 liegt.
zh_cn: SDFGI 的锐利反射仅在不透明材料上可见。透明材质只会使用粗糙的反射，即使材质的粗糙度低于 0.2。
zh_tw: SDFGI 的銳利反射僅在不透明材料上可見。透明材質將僅使用粗糙反射，即使材質的粗糙度低於 0.2 也是如此。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
