Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_lightmap_gi.po
Languages: de, zh_cn, zh_tw

source: Since high-quality bakes can take very long (up to dozens of minutes for large complex scenes), it is recommended to use lower quality settings at first. Then, once you are confident with your scene's lighting setup, raise the quality settings and perform a "final" bake before exporting your project.
de: Da das Backen in hoher Qualität sehr lange dauern kann (bis zu Dutzenden von Minuten bei großen, komplexen Szenen), empfiehlt es sich, zunächst niedrigere Qualitätseinstellungen zu verwenden. Sobald Sie mit dem Beleuchtungs-Setup Ihrer Szene zufrieden sind, erhöhen Sie die Qualitätseinstellungen und führen einen "finalen" Backvorgang durch, bevor Sie Ihr Projekt exportieren.
zh_cn: 因为高质量的烘焙可能花费非常长的时间（大型复杂场景可能需要数十分钟），推荐首先设置成较低质量。 之后，场景的照明设置到了让你非常满意的程度，就可以提高质量设置，并在导出项目之前执行“最终”烘焙。
zh_tw: 因為高品質的烘焙可能花費非常長的時間（大型複雜場景可能需要若干小時），推薦首先設定成較低品質，將場景中的燈光佈置成滿意的效果後再改成較高的品質，在匯出專案前進行“終極”烘焙。

source: Reducing the lightmap resolution by increasing **Lightmap Texel Size** on the imported 3D scenes will also speed up baking significantly. However, this will require you to reimport all lightmapped 3D scenes before you can bake lightmaps again.
de: Das Verringern der Lightmap-Auflösung durch Erhöhen der **Lightmap-Texel-Größe** in den importierten 3D-Szenen wird das Backen ebenfalls erheblich beschleunigen. Dies erfordert jedoch, dass Sie alle mit Lichtkarten versehenen 3D-Szenen erneut importieren, bevor Sie erneut Lichtkarten backen können.
zh_cn: 通过增加导入的 3D 场景上的 **光照贴图纹素尺寸** 来降低光照贴图分辨率，也会显着地加快烘焙速度。 但是，这将要求你重新导入所有有光照贴图的 3D 场景，然后才能再次烘焙光照贴图。
zh_tw: 透過增加匯入的 3D 場景上的 **光照貼圖紋理尺寸** 來降低光照貼圖解析度也會顯著加快烘焙速度。但是，這將要求您重新匯入所有光照貼圖 3D 場景，然後才能再次烘焙光照貼圖。

source: Denoising
de: Rauschunterdrückung
zh_cn: 降噪

source: Since baking lightmaps relies on raytracing, there will always be visible noise in the "raw" baked lightmap. Noise is especially visible in areas that are difficult to reach by bounced light, such as indoor areas with small openings where the sunlight can enter. Noise can be reduced by increasing bake quality, but doing so will increase bake times significantly.
de: Da das Backen von Lightmaps auf Raytracing beruht, wird in der "rohen" gebackenen Lightmap immer sichtbares Rauschen vorhanden sein. Das Rauschen ist vor allem in Bereichen sichtbar, die nur schwer von gebündeltem Licht erreicht werden können, z.B. in Innenräumen mit kleinen Öffnungen, durch die das Sonnenlicht eindringen kann. Das Rauschen kann durch Erhöhen der Backqualität reduziert werden, allerdings verlängert sich dadurch die Backzeit erheblich.
zh_cn: 由于烘焙光照贴图依赖于光线追踪，因此“原始的”烘焙光照贴图中始终会存在可见的噪点。在反射光难以到达的区域（例如阳光可以进入的开口较小的室内区域），噪点尤其明显。提高烘焙质量可以减少噪点，但这样做会显着增加烘焙时间。

source: Comparison between denoising disabled and enabled
de: Vergleich zwischen deaktivierter und aktivierter Rauschunterdrückung
zh_cn: 禁用降噪和启用降噪之间的比较

source: Comparison between denoising disabled and enabled (with the default JNLM denoiser).
de: Vergleich zwischen deaktivierter und aktivierter Rauschunterdrückung (mit dem Default-JNLM-Denoiser).
zh_cn: 禁用降噪和启用降噪之间的比较（使用默认的 JNLM 降噪器）。

source: To combat noise without increasing bake times too much, a denoiser can be used. A denoiser is an algorithm that runs on the final baked lightmap, detects patterns of noise and softens them while attempting to best preseve detail. Godot offers two denoising algorithms:
de: Um das Rauschen zu verringern, ohne die Backzeiten zu sehr zu verlängern, kann ein Denoiser verwendet werden. Ein Denoiser ist ein Algorithmus, der auf der endgültigen gebackenen Lightmap läuft, Rauschmuster erkennt und sie abschwächt, während er versucht, die Details bestmöglich zu erhalten. Godot bietet zwei Rauschunterdrückungsalgorithmen:
zh_cn: 为了消除噪点而不过多增加烘焙时间，可以使用降噪器。降噪器是一种在最终烘焙光照贴图上运行的算法，检测噪声模式并软化它们，同时尝试最好地保留细节。 Godot 提供了两种降噪算法：

source: JNLM (Non-Local Means with Joint Filtering)
de: JNLM (Non-Local Means mit Joint Filtering)
zh_cn: JNLM（Non-Local Means with Joint Filtering，联合过滤的非局部均值）

source: JNLM is the default denoising method and is included in Godot. It uses a simple but efficient denoising algorithm known as *non-local means*. JNLM runs on the GPU using a compute shader, and is compatible with any GPU that can run Godot 4's Vulkan-based rendering methods. No additional setup is required.
de: JNLM ist die Default-Rauschunterdrückungsmethode und ist in Godot enthalten. Sie verwendet einen einfachen, aber effizienten Rauschunterdrückungsalgorithmus, der als *non-local means* bekannt ist. JNLM wird auf der GPU unter Verwendung eines Compute-Shaders ausgeführt und ist mit jeder GPU kompatibel, die mit den Vulkan-basierten Rendering-Methoden von Godot 4 umgehen kann. Es ist keine zusätzliche Einrichtung erforderlich.
zh_cn: JNLM 是 Godot 自带的默认的降噪方法。它使用一种简单但有效的降噪算法，称为 *非局部均值* （non-local means）。 JNLM 使用计算着色器在 GPU 上运行，并且与任何可以运行 Godot 4 的基于 Vulkan 的渲染方法的 GPU 相兼容。该方法无需额外设置。

source: JNLM's denoising can be adjusted using the **Denoiser Strength** property that is visible when **Use Denoiser** enabled. Higher values can be more effective at removing noise, at the cost of suppressing shadow detail for static shadows.
de: Die Rauschunterdrückung von JNLM kann mit der Property **Rauschunterdrückungs-Stärke** angepasst werden, die sichtbar ist, wenn **Rauschunterdrückung verwenden** aktiviert ist. Höhere Werte können bei der Entfernung von Rauschen effektiver sein, allerdings auf Kosten der Unterdrückung von Schattendetails bei statischen Schatten.
zh_cn: JNLM 的降噪可以使用 **Denoiser Strength** 属性进行调整，该属性在启用 **Use Denoiser** 后可见。较高的 **Denoiser Strength** 值可以更有效地消除噪声，但代价是会抑制静态阴影的阴影细节。

source: Comparison between JNLM denoiser strength values
de: Vergleich verschiedener Werte der Rauschunterdrückungs-Stärke bei JNLM
zh_cn: 不同 JNLM 降噪强度值之间的对比

source: Comparison between JNLM denoiser strength values. Higher values can reduce detail.
de: Vergleich verschiedener Werte der Rauschunterdrückungs-Stärke für JNLM. Höhere Werte können Details reduzieren.
zh_cn: 不同 JNLM 降噪强度值之间的对比。较高的值将会减少阴影细节。

source: Unlike JNLM, OIDN uses a machine learning approach to denoising lightmaps. It features a model specifically trained to remove noise from lightmaps while preserving more shadow detail in most scenes compared to JNLM.
de: Im Gegensatz zu JNLM verwendet OIDN einen Ansatz des maschinellen Lernens zur Rauschunterdrückung von Lightmaps. Es verfügt über ein speziell trainiertes Modell zur Entfernung von Rauschen aus Lightmaps, wobei im Vergleich zu JNLM in den meisten Szenen mehr Schattendetails erhalten bleiben.
zh_cn: 与 JNLM 不同，OIDN 使用机器学习方法对光照贴图进行降噪。与 JNLM 相比，ODIN 具有经过专门训练的模型，可消除光照贴图的噪点，同时在大多数场景中保留更多阴影细节。

source: OIDN can run on the GPU if hardware acceleration is configured. With a modern high-end GPU, this can provide a speedup of over 50× over CPU-based denoising:
de: OIDN kann auf der GPU ausgeführt werden, wenn die Hardware-Beschleunigung konfiguriert ist. Mit einem modernen High-End-Grafikprozessor kann dies einen Geschwindigkeitszuwachs von mehr als dem 50-fachen der CPU-basierten Rauschunterdrückung ermöglichen:
zh_cn: 如果配置了硬件加速，OIDN 可以在 GPU 上运行。借助现代高端 GPU，与基于 CPU 的降噪相比，这个配置可以提供超过 50 倍的加速：

source: On AMD GPUs, HIP must be installed and configured.
de: Auf AMD-GPUs muss HIP installiert und konfiguriert werden.
zh_cn: 在 AMD GPU 上，必须安装和配置 HIP。

source: On NVIDIA GPUs, CUDA must be installed and configured. This may automatically be done by the NVIDIA installer, but on Linux, CUDA libraries may not be installed by default. Double-check that the CUDA packages from your Linux distribution are installed.
de: Auf NVIDIA-GPUs muss CUDA installiert und konfiguriert werden. Dies kann automatisch durch das NVIDIA-Installationsprogramm erfolgen, aber unter Linux werden die CUDA-Bibliotheken möglicherweise nicht standardmäßig installiert. Vergewissern Sie sich, dass die CUDA-Pakete aus Ihrer Linux-Distribution installiert sind.
zh_cn: 在 NVIDIA GPU 上，必须安装并配置 CUDA。CUDA的安装配置可能由 NVIDIA 安装程序自动完成，但在 Linux 上，默认情况下可能不会安装 CUDA 库。仔细检查你的 Linux 发行版中的 CUDA 软件包是否已安装。

source: On Intel GPUs, SYCL must be installed and configured.
de: Auf Intel-GPUs muss SYCL installiert und konfiguriert werden.
zh_cn: 在 Intel GPU 上，必须安装和配置 SYCL。

source: If hardware acceleration is not available, OIDN will fall back to multithreaded CPU-based denoising. To confirm whether GPU-based denoising is working, use a GPU utilization monitor while baking lightmaps and look at the GPU utilization percentage and VRAM utilization while the denoising step is shown in the Godot editor. The ``nvidia-smi`` command line tool can be useful for this.
de: Wenn keine Hardware-Beschleunigung verfügbar ist, greift OIDN auf die CPU-basierte Rauschunterdrückung mit Multithreading zurück. Um zu überprüfen, ob die GPU-basierte Rauschunterdrückung funktioniert, verwenden Sie einen GPU-Auslastungsmonitor, während Sie Lightmaps backen, und beobachten Sie die prozentuale GPU-Auslastung und die VRAM-Auslastung, während der Rauschunterdrückungsschritt im Godot-Editor angezeigt wird. Das Kommandozeilen-Tool ``nvidia-smi`` kann hierfür nützlich sein.
zh_cn: 如果硬件加速不可用，OIDN 将回退到基于多线程 CPU 的降噪。要确认基于 GPU 的降噪是否有效，请在烘焙光照贴图时使用 GPU 利用率监视器，并在 Godot 编辑器中显示去噪步骤时查看 GPU 利用率和 VRAM 利用率。 对此， ``nvidia-smi`` 命令行工具很有用。

source: OIDN is not included with Godot due to its relatively large download size. You can download precompiled OIDN binary packages from its `website <https://www.openimagedenoise.org/downloads.html>`__. Extract the package to a location on your PC, then specify the path to the ``oidnDenoise`` executable in the Editor Settings (**FileSystem > Tools > OIDN > OIDN Denoise Path**). This executable is located within the ``bin`` folder of the binary package you extracted.
de: OIDN ist aufgrund seiner relativ großen Downloadgröße nicht im Lieferumfang von Godot enthalten. Sie können vorkompilierte OIDN-Binärpakete von der `Website <https://www.openimagedenoise.org/downloads.html>`__ herunterladen. Entpacken Sie das Paket an einen Ort auf Ihrem PC und geben Sie dann den Pfad zur ausführbaren Datei ``oidnDenoise`` in den Editoreinstellungen an (**Dateisystem > Tools > Oidn> Pfad Oidn Rauschunterdrückung**). Diese ausführbare Datei befindet sich im Ordner ``bin`` des entpackten Binärpakets.
zh_cn: 由于 OIDN 的下载包相对较大，所以它不包含在 Godot 中。你可以从其`网站<https://www.openimagedenoise.org/downloads.html>`__ 下载预编译的 OIDN 二进制包。将包解压到 PC 上的某个位置，然后在编辑器设置中指定 ``oidnDenoise`` 可执行文件的路径（ **文件系统 > 工具 > OIDN > OIDN 降噪器路径** ）。该可执行文件位于你提取的二进制包的 ``bin`` 文件夹中。

source: After specifying the path to the OIDN denoising executable, change the denoising method in the project settings by setting **Rendering > Lightmapping > Denoiser** to **OIDN**. This will affect all lightmap bakes on this project after the setting is changed.
de: Nachdem Sie den Pfad zur ausführbaren OIDN-Rauschunterdrückung angegeben haben, ändern Sie die Rauschunterdrückungsmethode in den Projekteinstellungen, indem Sie **Rendern > Lightmapping > Rauschunterdrückung** auf **OIDN** setzen. Dies wirkt sich auf alle Lightmap-Backvorgänge in diesem Projekt aus, nachdem die Einstellung geändert wurde.
zh_cn: 指定 OIDN 降噪可执行文件的路径后，通过将 **渲染 > 光照贴图 > 降噪器** 设置为 **OIDN** 来更改项目设置中的降噪方法。设置更改后，这将影响该项目上的所有光照贴图烘焙。

source: The denoising method is configured in the project settings instead of the editor settings. This is done so that different team members working on the same project are assured to be using the same denoising method for consistent results.
de: Die Methode der Rauschunterdrückung wird in den Projekteinstellungen und nicht in den Editoreinstellungen konfiguriert. Auf diese Weise wird sichergestellt, dass verschiedene Teammitglieder, die an demselben Projekt arbeiten, dieselbe Rauschunterdrückungsmethode verwenden, um konsistente Ergebnisse zu erzielen.
zh_cn: 降噪方法需要在项目设置中配置，而不是在编辑器设置中。这样做是为了确保同一项目的不同团队成员使用相同的降噪方法，以最终获得一致的表现。

source: Comparison between JNLM and OIDN denoisers
de: Vergleich zwischen JNLM- und OIDN-Rauschunterdrückung
zh_cn: JNLM 和 OIDN 降噪器的比较

source: Comparison between JNLM and OIDN denoisers. Notice how OIDN better preserves detail and reduces seams across different objects.
de: Vergleich zwischen den JNLM und OIDN-Denoisern. Beachten Sie, dass OIDN Details besser bewahrt und Nahtstellen zwischen verschiedenen Objekten reduziert.
zh_cn: JNLM 和 OIDN 降噪器之间的比较。请注意 OIDN 如何更好地保留细节并减少不同对象之间的接缝。

source: Dynamic objects
de: Dynamische Objekte
zh_cn: 动态对象
zh_tw: 動態物件

source: Unlike VoxelGI and SDFGI, dynamic objects receive indirect lighting differently compared to static objects. This is because lightmapping is only performed on static objects.
de: Im Gegensatz zu VoxelGI und SDFGI erhalten dynamische Objekte eine andere indirekte Beleuchtung als statische Objekte. Dies liegt daran, dass Lightmapping nur bei statischen Objekten durchgeführt wird.
zh_cn: 与 VoxelGI 和 SDFGI 不同，动态对象接收间接光照的方式与静态对象不同。 这是因为光照贴图仅在静态对象上执行。
zh_tw: 與 VoxelGI 和 SDFGI 不同，動態物件接收間接光照的方式與靜態物件不同。這是因為光照貼圖僅在靜態物件上執行。

source: To display indirect lighting on dynamic objects, a 3D probe system is used, with light probes being spread throughout the scene. When baking lightmaps, the lightmapper will calculate the amount of *indirect* light received by the probe. Direct light is not stored within light probes, even for lights that have their bake mode set to **Static** (as dynamic objects continue to be lit in real-time).
de: Um indirekte Beleuchtung auf dynamischen Objekten darzustellen, wird ein 3D-Probe-System verwendet, bei dem die Light-Probes über die gesamte Szene verteilt sind. Beim Backen von Lightmaps berechnet der Lightmapper die Menge des *indirekten* Lichts, das von der Probe empfangen wird. Direktes Licht wird nicht in Light-Probes gespeichert, auch nicht für Lichter, deren Backmodus auf **Statisch** eingestellt ist (da dynamische Objekte weiterhin in Echtzeit beleuchtet werden).
zh_cn: 为了显示动态对象上的间接照明，使用了 3D 探针系统，其中光照探针遍布整个场景。 烘焙光照贴图时，光照贴图器将计算探针接收到的 *间接* 光量。 直射光不会存储在光照探针中，即使对于将烘焙模式设置为 **Static** 的光源也是如此（因为动态对象继续会实时点亮）。
zh_tw: 為了顯示動態物件上的間接照明，使用了 3D 探查系統，其中光探查遍布整個場景。烘焙光照貼圖時，光照貼圖器將計算探頭接收到的*間接*光量。直射光不會儲存在光探查中，即使對於將烘焙模式設定為**靜態**的光源（因為動態物件繼續即時點亮）。

source: There are 2 ways to add light probes to a scene:
de: Es gibt 2 Möglichkeiten, Light-Probes zu einer Szene hinzuzufügen:
zh_cn: 有两种方法可以向场景中添加光照探针：
zh_tw: 有兩種方法可以為伺服器匯出專案：

source: **Automatic:** Set **Gen Probes > Subdiv** to a value other than **Disabled**, then bake lightmaps. The default is ``8``, but you can choose a greater value to improve precision at the cost of longer bake times and larger output file size.
de: **Automatisch:** Setzen Sie **Gen.-Probes > Unterteilung** auf einen anderen Wert als **Deaktiviert**, und backen Sie dann die Lightmaps. Der Standardwert ist ``8``, aber Sie können einen höheren Wert wählen, um die Präzision auf Kosten längerer Backzeiten und größerer Ausgabedateien zu verbessern.
zh_cn: **Automatic（自动）：**\ 将 **Gen Probes > Subdiv** 设置为 **Disabled** 以外的值，然后烘焙光照贴图。 默认值为 ``8``\ ，不过你可以选择更大的值来提高精度，但代价是烘焙时间会更长且输出文件大小会更大。
zh_tw: **自動：** 將 **Gen Probes > Subdiv** 設定為 **Disabled** 以外的值，然後烘焙光照貼圖。預設值為“8”，但您可以選擇更大的值來提高精確度，但代價是烘焙時間更長且輸出檔案大小更大。

source: **Manual:** In addition or as an alternative to generating probes automatically, you can add light probes manually by adding :ref:`class_LightmapProbe` nodes to the scene. This can be used to improve lighting detail in areas frequently travelled by dynamic objects. After placing LightmapProbe nodes in the scene, you must bake lightmaps again for them to be effective.
de: **Manuell:** Zusätzlich oder alternativ zur automatischen Erzeugung von Probes können Sie Lightprobes manuell hinzufügen, indem Sie :ref:`class_LightmapProbe` Nodes in die Szene einfügen. Dies kann verwendet werden, um die Beleuchtungsdetails in Bereichen zu verbessern, die häufig von dynamischen Objekten durchlaufen werden. Nachdem Sie LightmapProbe-Nodes in der Szene platziert haben, müssen Sie die Lightmaps erneut backen, damit sie wirksam werden.
zh_cn: **Manual（手动）：** 作为除自动生成探针之外，或者作为自动生成探针的替代方案，你可以通过向场景添加 :ref:`class_LightmapProbe` 节点来手动添加光照探针。 这可用于改善动态物体经常经过的区域的照明细节。 在场景中放置 LightmapProbe 节点后，必须再次烘焙光照贴图才能使其生效。
zh_tw: **手動：** 除了自動產生探查之外或作為自動產生探查的替代方案，您可以透過向場景新增:ref:`class_LightmapProbe` 節點來手動新增光照探查。這可用於改善動態物體經常經過的區域的照明細節。在場景中放置 LightmapProbe 節點後，必須再次烘焙光照貼圖才能使其生效。

source: After baking lightmaps, you will notice white spheres in the 3D scene that represent how baked lighting will affect dynamic objects. These spheres do **not** appear in the running project.
de: Nach dem Backen von Lightmaps werden Sie in der 3D-Szene weiße Kugeln sehen, die darstellen, wie sich die gebackene Beleuchtung auf dynamische Objekte auswirkt. Diese Kugeln erscheinen **nicht** im laufenden Projekt.
zh_cn: 烘焙光照贴图后，你会注意到 3D 场景中的白色球体，它们表现了烘焙光照将如何影响动态对象。 这些球体 **不会** 出现在正在运行的项目中。
zh_tw: 烘焙光照貼圖後，您會注意到 3D 場景中的白色球體代表烘焙光照將如何影響動態物件。這些球體**不會**出現在正在運作的專案中。

source: If you want to hide these spheres in the editor, toggle **View > Gizmos > LightmapGI** at the top of the 3D editor (a "closed eye" icon indicates the gizmo is hidden).
de: Wenn Sie diese Kugeln im Editor ausblenden möchten, schalten Sie **Ansicht > Gizmos > LightmapGI** oben im 3D-Editor ein (das "geschlossenes Auge"-Symbol zeigt an, dass das Gizmo ausgeblendet ist).
zh_cn: 如果要在编辑器中隐藏这些球体，请在3D编辑器的顶部切换 **View > Gizmos > LightmapGI** （“闭眼”图标表示这个 Gizmo 已隐藏）。
zh_tw: 如果要在編輯器中隱藏這些球體，請在 3D 編輯器頂部切換 **View > Gizmos > LightmapGI**（「閉眼」圖示表示 Gizmo 已隱藏）。

source: Lightmap data
de: Lightmap-Daten
zh_cn: 光照贴图数据
zh_tw: 光照貼圖資料

source: The **Data > Light Data** property in the LightmapGI node contains the lightmap data after baking. Textures are saved to disk, but this also contains the capture data for dynamic objects, which can be heavy. If you are using a scene in ``.tscn`` format, you should save this resource to an external binary ``.lmbake`` file to avoid bloating the ``.tscn`` scene with binary data encoded in Base64.
de: Die **Daten > Lichtdaten**-Property im LightmapGI-Node enthält die Lightmap-Daten nach dem Backen. Texturen werden auf der Festplatte gespeichert, aber dies enthält auch die Erfassungsdaten für dynamische Objekte, die sehr speicherintensiv sein können. Wenn Sie eine Szene im ``.tscn``-Format verwenden, sollten Sie diese Ressource in einer externen binären ``.lmbake``-Datei speichern, um zu vermeiden, dass die ``.tscn``-Szene mit in Base64 kodierten Binärdaten aufgebläht wird.
zh_cn: LightmapGI 节点中的 **Data > Light Data** 属性包含烘焙后的光照贴图数据。纹理会被保存到磁盘上，但这里还会包含动态对象的捕获数据，数据量可能非常大。如果你使用的是 ``.tscn`` 格式的场景，应该将此资源保存成外部的二进制 ``.lmbake`` 文件，否则 ``.tscn`` 场景可能因为使用 Base64 编码二进制数据而变得巨大。
zh_tw: **Light Data（光照資料）** ：烘焙後包含光照烘焙資料。紋理會被保存到磁片上，但這裡還會包含動態物件的捕獲資料，資料量可能非常大。如果你使用的是 ``.tscn`` 格式的場景，應該將此資源保存成外部的二進位 ``.lmbake`` 檔，否則 ``.tscn`` 場景可能因為使用 Base64 編碼二進位資料而變得巨大。

source: The generated EXR file can be viewed and even edited using an image editor to perform post-processing if needed. However, keep in mind that changes to the EXR file will be lost when baking lightmaps again.
de: Die erzeugte EXR-Datei kann mit einem Bildbearbeitungsprogramm angezeigt und sogar bearbeitet werden, um bei Bedarf Nachbearbeitungen durchzuführen. Beachten Sie jedoch, dass Änderungen an der EXR-Datei beim erneuten Backen von Lightmaps verloren gehen.
zh_cn: 如果有后期处理的需要，可以使用图像编辑器查看并编辑所生成的 EXR 文件。不过请注意，重新烘焙贴图会覆盖你对 EXR 文件的修改。
zh_tw: 如果有後期處理的需要，可以使用圖像編輯器查看並編輯所生成的 EXR 檔。不過請注意，重新烘焙貼圖會覆蓋你對 EXR 檔的修改。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
