Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_sdfgi.po
Languages: de, zh_cn, zh_tw

source: Signed distance field global illumination (SDFGI)
zh_cn: 带符号距离场全局光照（SDFGI）
zh_tw: 有符號距離場全域照明 (SDFGI)

source: Signed distance field global illumination (SDFGI) is a novel technique available in Godot 4.0. It provides semi-real-time global illumination that scales to any world size and works with procedurally generated levels.
de: Signed Distance Field Global Illumination (SDFGI) ist eine neue Technik, die in Godot 4.0 verfügbar ist. Sie bietet eine Global Illumination in Semi-Echtzeit, die auf jede Weltgröße skalierbar ist und mit prozedural generierten Ebenen funktioniert.
zh_cn: 带符号距离场全局光照（SDFGI）是 Godot 4.0 中提供的一种新技术。它提供了半实时的全局光照，可以适用于任何世界大小，并且适用于程序化生成的关卡。
zh_tw: 有符號距離場全域照明 (SDFGI) 是 Godot 4.0 中提供的新技術。它提供半實時全域照明，可縮放至任何世界尺寸並適用於程式生成的等級。

source: SDFGI supports dynamic lights, but *not* dynamic occluders or dynamic emissive surfaces. Therefore, SDFGI provides better real-time ability than :ref:`baked lightmaps <doc_using_lightmap_gi>`, but worse real-time ability than :ref:`VoxelGI <doc_using_voxel_gi>`.
de: SDFGI unterstützt dynamische Lichter, aber *nicht* dynamische Occluder oder dynamische emittierende Oberflächen. Daher bietet SDFGI eine bessere Echtzeitfähigkeit als :ref:`gebackene Lightmaps <doc_using_lightmap_gi>`, aber eine schlechtere Echtzeitfähigkeit als :ref:`VoxelGI <doc_using_voxel_gi>`.
zh_cn: SDFGI 支持动态光源，但\ *不支持*\ 动态遮挡物或动态发光表面。因此，SDFGI 提供了比\ :ref:`烘焙光照贴图 <doc_using_lightmap_gi>`\ 更好的实时能力，但比 :ref:`VoxelGI <doc_using_voxel_gi>` 的实时能力要差。
zh_tw: SDFGI 支援動態燈光，但*不*動態遮擋器或動態發射表面。因此，SDFGI 提供了比烘焙光照貼圖更好的即時能力，但比 VoxelGI 差。

source: From a performance standpoint, SDFGI is one of the most demanding global illumination techniques in Godot. Like with VoxelGI, there are still many settings available to tweak its performance requirements at the cost of quality.
de: In Bezug auf die Performance ist SDFGI eine der anspruchsvollsten Global Illumination-Methoden in Godot. Wie bei VoxelGI gibt es noch viele Einstellungen, um die Performance-Anforderungen auf Kosten der Qualität zu optimieren.
zh_cn: 从能效角度来看，SDFGI 是 Godot 中要求最高全局光照技术之一。与 VoxelGI 相同，仍有许多设定可用于调整其性能要求，但会牺牲品质。
zh_tw: 從效能角度來看，SDFGI 是 Godot 中要求最高的全域照明技術之一。與 VoxelGI 一樣，仍有許多設定可用於調整其性能要求，但會犧牲品質。

source: SDFGI is only supported when using the Forward Plus rendering backend, not the Forward Mobile or Compatibility backends.
de: SDFGI wird nur unterstützt, wenn das Forward Plus Rendering-Backend verwendet wird, nicht das Forward Mobile oder Kompatibilität-Backend.
zh_cn: SDFGI 仅在使用 Forward+ 渲染后端时受支持，而不支持 Forward 移动或兼容后端。
zh_tw: 僅當使用 Forward Plus 算繪後端時才支援 SDFGI，而不是 Forward Mobile 或相容性後端。

source: Not sure if SDFGI is suited to your needs? See :ref:`doc_introduction_to_global_illumination_comparison` for a comparison of GI techniques available in Godot 4.
de: Sie sind nicht sicher, ob SDFGI für Ihre Bedürfnisse geeignet ist? Unter :ref:`doc_introduction_to_global_illumination_comparison` finden Sie einen Vergleich der in Godot 4 verfügbaren GI-Techniken.
zh_cn: 如果你不确定SDFGI是否符合你的需求，请查看 :ref:`doc_introduction_to_global_illumination_comparison` 以了解 Godot 4 中可用的 GI 技术的比较。
zh_tw: 不確定 SDFGI 是否適合您的需求？請參閱 doc_introduction_to_global_Illumination_comparison` 以了解Godot 4 中可用的 GI 技術的比較。

source: Visual comparison
de: Visueller Vergleich
zh_cn: 视觉比较
zh_tw: 視覺比較

source: SDFGI disabled.
de: SDFGI deaktiviert.
zh_cn: 禁用 SDFGI。
zh_tw: 禁用 3D

source: SDFGI enabled.
de: SDFGI aktiviert.
zh_cn: 启用 SDFGI。
zh_tw: SDFGI 已啟用。

source: Setting up SDFGI
de: SDFGI einrichten
zh_cn: 设置 SDFGI
zh_tw: 設定

source: In Godot, SDFGI is the global illumination technique with the fewest required steps to enable:
de: In Godot ist SDFGI die Global Illumination-Technik mit den wenigsten erforderlichen Schritten um es zu aktivieren:
zh_cn: 在Godot中，SDFGI是启用所需步骤最少的全局光照技术:
zh_tw: 在 Godot 中，SDFGI 是一種全域照明技術，只需最少的步驟即可實作：

source: Make sure your MeshInstance nodes have their **Global Illumination > Mode** property set to **Static** in the inspector.
de: Vergewissern Sie sich, dass die Property **Global Illumination > Mode** Ihrer MeshInstance-Nodes im Inspektor auf **Statisch** gesetzt ist.
zh_cn: 请确保你的 MeshInstance 节点在检查器中将其 **Global Illumination > Mode** 属性设置为 **Static** 。
zh_tw: 確保您的 MeshInstance 節點在屬性面板中將其 **Global Illumination > Mode** 屬性設為 **Static**。

source: For imported 3D scenes, the bake mode can be configured in the Import dock after selecting the 3D scene file in the FileSystem dock.
de: Für importierte 3D-Szenen kann der Back-Modus im Import-Dock konfiguriert werden, nachdem die 3D-Szenendatei im Dateisystem-Dock ausgewählt wurde.
zh_cn: 对于导入的3D场景，可以在选择文件系统窗口中的3D场景文件后，在导入窗口中配置烘焙模式。
zh_tw: 對於匯入的 3D 場景，在檔案系統擴充座中選擇 3D 場景檔案後，可以在匯入擴充座中配置烘焙模式。

source: Add a WorldEnvironment node and create an Environment resource for it.
de: Fügen Sie einen WorldEnvironment-Node hinzu und erstellen Sie eine Environment-Ressource für ihn.
zh_cn: 添加一个WorldEnvironment节点并为其创建一个Environment资源。
zh_tw: 新增一個 WorldEnvironment 節點並為其建立一個環境資源。

source: Edit the Environment resource, scroll down to the **SDFGI** section and unfold it.
de: Bearbeiten Sie die Ressource Environment, scrollen Sie zum Abschnitt **SDFGI** und klappen Sie ihn aus.
zh_cn: 编辑Environment资源，向下滚动到 **SDFGI** 部分并展开它。
zh_tw: 編輯環境資源，向下捲動到 **SDFGI** 部分並將其展開。

source: Enable **SDFGI > Enabled**. SDFGI will automatically follow the camera when it moves, so you do not need to configure extents (unlike VoxelGI).
de: Aktivieren Sie **SDFGI > Aktiviert**. SDFGI folgt der Kamera automatisch, wenn sie sich bewegt, so dass Sie keine Ausmaße konfigurieren müssen (im Gegensatz zu VoxelGI).
zh_cn: 启用 **SDFGI > Enabled** 。SDFGI 将在相机移动时自动跟随，因此无需配置范围（与 VoxelGI 不同）。
zh_tw: 啟用 **SDFGI > 已啟用**。 SDFGI 會在相機移動時自動跟隨相機，因此您無需配置範圍（與 VoxelGI 不同）。

source: Environment SDFGI properties
de: Environment-SDFGI-Propertys
zh_cn: 环境 SDFGI 属性
zh_tw: 環境變數

source: In the Environment resource, there are several properties available to adjust SDFGI appearance and quality:
de: In der Ressource Environment stehen mehrere Propertys zur Verfügung, um das Aussehen und die Qualität von SDFGI anzupassen:
zh_cn: 在 Environment 资源中，有几个属性可用于调整 SDFGI 的外观和质量：
zh_tw: 在環境資源中，有幾個屬性可用於調整 SDFGI 外觀和品質：

source: **Use Occlusion:** If enabled, SDFGI will throw additional rays to find and reduce light leaks. This has a performance cost, so only enable this property if you actually need it.
de: **Occlusion verwenden:** Wenn diese Property aktiviert ist, wirft SDFGI zusätzliche Strahlen, um Lichtlecks zu finden und zu reduzieren. Dies geht zu Lasten der Performance, daher sollten Sie diese Property nur aktivieren, wenn Sie sie tatsächlich benötigen.
zh_cn: **使用遮挡（Use Occlusion）：** 如果启用，SDFGI 将投射额外的射线以寻找并减少光线泄漏。这会带来性能开销，所以只有在你实际需要时再启用此属性。
zh_tw: **使用遮蔽：** 如果啟用，SDFGI 將投射額外的光線來發現並減少漏光。這會產生效能成本，因此僅在您確實需要時才啟用此屬性。

source: **Read Sky Light:** If enabled, the environment lighting is represented in the global illumination. This should be enabled in outdoor scenes and disabled in fully indoor scenes.
de: **Himmelslicht lesen:** Wenn aktiviert, wird die Umgebungsbeleuchtung in der Global Illumination dargestellt. Diese Funktion sollte in Außenszenen aktiviert und in Innenszenen deaktiviert sein.
zh_cn: **读取天空光（Read Sky Light）：** 如果启用，环境照明将在全局照明中表现。 应在室外场景中启用此功能，并在完全室内场景中禁用此功能。
zh_tw: **讀取天空光：** 如果啟用，環境照明將在全域照明中表示。應在室外場景中啟用此功能，並在完全室內場景中停用此功能。

source: **Bounce Feedback:** By default, indirect lighting only bounces once when using SDFGI. Setting this value above ``0.0`` will cause SDFGI to bounce more than once, which provides more realistic indirect lighting at a small performance cost. Sensible values are usually between ``0.3`` and ``1.0`` depending on the scene. Note that in some scenes, values above ``0.5`` can cause infinite feedback loops to happen, causing the scene to become extremely bright in a few seconds' time. If your indirect lighting looks "splotchy", consider increasing this value above ``0.0`` to get more uniform-looking lighting. If your lighting ends up looking too bright as a result, decrease **Energy** to compensate.
de: **Abprall-Feedback:** Standardmäßig wird die indirekte Beleuchtung bei Verwendung von SDFGI nur einmal abgeprallt. Wenn Sie diesen Wert auf mehr als ``0.0`` setzen, wird SDFGI mehr als einmal abprallen, was eine realistischere indirekte Beleuchtung zu einem geringen Performance-Aufwand ermöglicht. Sinnvolle Werte liegen normalerweise zwischen ``0.3`` und ``1.0``, abhängig von der Szene. Beachten Sie, dass in manchen Szenen Werte über ``0.5`` zu unendlichen Rückkopplungsschleifen führen können, wodurch die Szene innerhalb weniger Sekunden extrem hell wird. Wenn Ihre indirekte Beleuchtung "fleckig" aussieht, sollten Sie diesen Wert über ``0.0`` erhöhen, um eine gleichmäßigere Beleuchtung zu erhalten. Wenn Ihre Beleuchtung dadurch zu hell erscheint, verringern Sie **Energie**, um dies auszugleichen.
zh_cn: **反弹反馈（Bounce Feedback）：** 默认情况下，使用 SDFGI 时，间接光照只会反弹一次。将此值设置为大于 ``0.0`` 将使SDFGI反弹多次，以在性能上稍微付出代价的情况下提供更逼真的间接光照。根据场景，合理的值通常在 ``0.3`` 和 ``1.0`` 之间。请注意，在某些场景中，大于 ``0.5`` 的值可能会导致无限反馈循环发生，使场景在几秒钟内变得极其明亮。如果你的间接光照看起来是"斑点状"，考虑将此值增加到大于 ``0.0`` 以获得更均匀的光照效果。如果由此导致你的光照看起来太亮，可以降低 **能量（Energy）** 来进行补偿。
zh_tw: **反彈回饋：** 預設情況下，使用 SDFGI 時間接照明僅反彈一次。將此值設為高於“0.0”將導致 SDFGI 多次反彈，從而以較小的性能成本提供更真實的間接照明。根據場景，敏感值通常在「0.3」和「1.0」之間。請注意，在某些場景中，高於「0.5」的值可能會導致無限回饋循環發生，導致場景在幾秒鐘內變得極其明亮。如果您的間接照明看起來“有斑點”，請考慮將該值增加到“0.0”以上，以獲得更均勻的照明。如果您的照明最終看起來太亮，請減少**能量**進行補償。

source: **Cascades:** Higher values result in more detailed GI information (and/or greater maximum distance), but are significantly more expensive on the CPU and GPU. The performance cost of having more cascades especially increases when the camera moves fast, so consider decreasing this to ``4`` or lower if your camera moves fast.
de: **Kaskaden:** Höhere Werte führen zu detaillierteren GI-Informationen (und/oder größerer maximaler Entfernung), sind aber deutlich teurer für CPU und GPU. Die Performance-Kosten für mehr Kaskaden steigen vor allem, wenn sich die Kamera schnell bewegt, daher sollten Sie in Erwägung ziehen, diesen Wert auf ``4`` oder niedriger zu setzen, wenn sich Ihre Kamera schnell bewegt.
zh_cn: **级联（Cascades）：** 较高的值会产生更详细的 GI 信息（以及 / 或者更大的最大距离），但在 CPU 和 GPU 上的成本明显更高。 当相机快速移动时，拥有更多级联的性能成本尤其会增加，因此如果你的相机移动速度很快，请考虑将这个值减少到 ``4`` 或更低。
zh_tw: **級聯：**較高的值會產生更詳細的 GI 資訊（和/或更大的最大距離），但在 CPU 和 GPU 上的成本明顯更高。當相機快速移動時，擁有更多級聯的性能成本尤其會增加，因此如果您的相機移動快速，請考慮將其減少到“4”或更低。

source: **Min Cell Size:** The minimum SDFGI cell size to use for the nearest, most detailed cascade. Lower values result in more accurate indirect lighting and reflection at the cost of lower performance. Adjusting this setting also affects **Cascade 0 Distance** and **Max Distance** automatically.
de: **Min. Zellengröße:** Die minimale SDFGI-Zellengröße, die für die nächstgelegene, detaillierteste Kaskade verwendet wird. Niedrigere Werte führen zu einer genaueren indirekten Beleuchtung und Reflexion auf Kosten einer geringeren Performance. Die Anpassung dieser Einstellung wirkt sich auch automatisch auf **Kaskade 0 Abstand** und **Max Abstand** aus.
zh_cn: **最小单元格尺寸（Min Cell Size）：** 用于最近、最详细级联的最小 SDFGI 单元尺寸。 较低的值会导致更准确的间接照明和反射，但代价是性能较低。 调整此设置还会自动影响 **级联 0 距离（Cascade 0 Distance）** 和 **最大距离（Max Distance）** 。
zh_tw: **最小單元尺寸：** 用於最近、最詳細級聯的最小 SDFGI 單元尺寸。較低的值會導致更準確的間接照明和反射，但代價是性能較低。調整此設定也會自動影響 **Cascade 0 Distance** 和 **Max Distance**。

source: **Cascade 0 Distance:** The distance at which the nearest, most detailed cascade ends. Greater values make the nearest cascade transition less noticeable, at the cost of reducing the level of detail in the nearest cascade. Adjusting this setting also affects **Min Cell Size** and **Max Distance** automatically.
de: **Kaskade 0 Abstand:** Der Abstand, bei dem die nächstgelegene, detaillierteste Kaskade endet. Größere Werte machen den Übergang der nächstgelegenen Kaskade weniger auffällig, allerdings auf Kosten eines geringeren Detailgrads in der nächstgelegenen Kaskade. Die Anpassung dieser Einstellung wirkt sich auch automatisch auf **Min Zellengröße** und **Max Distanz** aus.
zh_cn: **级联 0 距离（Cascade 0 Distance）：** 最近、最详细的级联结束的距离。 值越大，最近的级联过渡越不明显，但代价是降低最近级联的细节层次（level of detail）。 调整此设置还会自动影响 **最小单元格尺寸（Min Cell Size）** 和 **最大距离（Max Distance）** 。
zh_tw: **級聯 0 距離：** 最近、最詳細的級聯結束的距離。數值越大，最近的級聯過渡越不明顯，但代價是降低最近級聯的細節等級。調整此設定也會自動影響 **最小像元大小** 和 **最大距離**。

source: **Max Distance:** Controls how far away the signed distance field will be computed (for the least detailed cascade). SDFGI will not have any effect past this distance. This value should always be set below the Camera's Far value, as there is no benefit in computing SDFGI past the viewing distance. Adjusting this setting also affects **Min Cell Size** and **Cascade 0 Distance** automatically.
de: **Max Distanz:** Legt fest, wie weit entfernt das Signed Distance Field berechnet wird (für die am wenigsten detaillierte Kaskade). Über diese Entfernung hinaus hat SDFGI keine Wirkung. Dieser Wert sollte immer unter dem Far-Wert der Kamera liegen, da die Berechnung von SDFGI über die Sichtentfernung hinaus keinen Nutzen hat. Die Anpassung dieser Einstellung wirkt sich auch automatisch auf **Min Zellengröße** und **Kaskade 0 Distanz** aus.
zh_cn: **最大距离（Max Distance）：** 控制计算有符号距离场的距离（对于最不详细的级联）。 SDFGI 对超过此距离不会产生任何影响。 该值应始终设置为低于相机的远值（far value），因为计算超过观看距离的 SDFGI 没有任何好处。 调整此设置还会自动影响 **最小单元格尺寸（Min Cell Size）** 和 **级联 0 距离（Cascade 0 Distance）** 。
zh_tw: **最大距離：** 控制計算有符號距離場的距離（對於最不詳細的級聯）。 SDFGI 超過此距離不會產生任何影響。該值應始終設定為低於相機的遠值，因為計算超過觀看距離的 SDFGI 沒有任何好處。調整此設定也會自動影響 **最小像元大小** 和 **級聯 0 距離**。

source: **Y Scale:** Controls how far apart SDFGI probes are spread *vertically*. By default, vertical spread is the same as horizontal. However, since most game scenes aren't highly vertical, setting the Y Scale to ``75%`` or even ``50%`` can provide better quality and reduce light leaks without impacting performance.
de: **Y-Skalierung:** Legt fest, wie weit die SDFGI-Probes *vertikal* verteilt werden. Standardmäßig ist die vertikale Verteilung die gleiche wie die horizontale. Da die meisten Spielszenen jedoch nicht sehr vertikal sind, kann die Einstellung der Y-Skalierung auf ``75%`` oder sogar ``50%`` eine bessere Qualität liefern und Lichtlecks reduzieren, ohne die Performance zu beeinträchtigen.
zh_cn: **Y 比例（Y Scale）：**\ 控制 SDFGI 探针\ *垂直*\ 分布的距离。 默认情况下，垂直传播与水平传播相同。 然而，由于大多数游戏场景不是高度垂直的，因此将 Y 比例设置为 ``75%`` 甚至 ``50%`` 可以提供更好的质量并减少漏光，而不会影响性能。
zh_tw: **Y 比例：** 控制 SDFGI 探查*垂直*分佈的距離。預設情況下，垂直傳播與水平傳播相同。然而，由於大多數遊戲場景不是高度垂直的，因此將 Y 比例設定為「75%」甚至「50%」可以提供更好的品質並減少漏光，而不會影響效能。

source: **Energy:** The brightness multiplier for SDFGI's indirect lighting.
de: **Energie:** Der Helligkeitsmultiplikator für die indirekte Beleuchtung von SDFGI.
zh_cn: **能量（Energy）：** SDFGI 间接照明的亮度乘数。
zh_tw: **能量：** SDFGI 間接照明的亮度乘數。

source: **Normal Bias:** The normal bias to use for SDFGI's probe ray bounces. Unlike **Probe Bias**, this only increases the value in relation to the mesh's normals. This makes the bias adjustment more nuanced and avoids increasing the bias too much for no reason. Increase this value if you notice striping artifacts in indirect lighting or reflections.
de: **Normalen-Bias:** Der Normalen-Bias, der für SDFGI's Probe-Strahlen-Abprälle verwendet wird. Im Gegensatz zu **Probe-Bias** wird hier der Wert nur im Verhältnis zu den Normalen des Meshes erhöht. Dies macht die Anpassung der Verzerrung differenzierter und verhindert, dass die Verzerrung ohne Grund zu stark erhöht wird. Erhöhen Sie diesen Wert, wenn Sie Striping-Artefakte bei indirekter Beleuchtung oder Reflektionen feststellen.
zh_cn: **法线偏置（Normal Bias）：** 用于 SDFGI 探测射线反弹的法线偏置。 与 **探针偏差（Probe Bias）** 不同，这只会增加相对于网格法线的值。 这使得偏置调整更加细致，避免无缘无故地增加太多偏置。 如果你发现间接照明或反射中出现条纹伪影（striping artifacts），请增加此值。
zh_tw: **法線偏差：** 用於 SDFGI 偵測射線反彈的法線偏差。與 **探查偏差** 不同，這只會增加相對於網格法線的值。這使得偏差調整更加細緻，避免無緣無故增加偏差太多。如果您發現間接照明或反射中出現條紋偽影，請增加此值。

source: **Probe Bias:** The bias to use for SDFGI's probe ray bounces. Increase this value if you notice striping artifacts in indirect lighting or reflections.
de: **Probe-Bias:** Der Bias, der für SDFGI's Probe Strahlen-Abprälle verwendet wird. Erhöhen Sie diesen Wert, wenn Sie Striping-Artefakte bei indirekter Beleuchtung oder Reflektionen feststellen.
zh_cn: **探针偏置（Probe Bias）：** 用于 SDFGI 探测射线反弹的偏置。 如果你发现间接照明或反射中出现条纹伪影，请增加此值。
zh_tw: **探測偏差：** 用於 SDFGI 探測射線反彈的偏差。如果您發現間接照明或反射中出現條紋偽影，請增加此值。

source: SDFGI interaction with lights and objects
de: SDFGI Interaktion mit Lichtern und Objekten
zh_cn: SDFGI 与灯光和对象的交互
zh_tw: 產生金鑰儲存區

source: The amount of indirect energy emitted by a light is governed by its color, energy *and* indirect energy properties. To make a specific light emit more or less indirect energy without affecting the amount of direct light emitted by the light, adjust the **Indirect Energy** property in the Light3D inspector.
de: Die Menge an indirekter Energie, die von einem Licht ausgestrahlt wird, wird durch die Propertys Farbe, Energie *und* indirekte Energie bestimmt. Um ein bestimmtes Licht dazu zu bringen, mehr oder weniger indirekte Energie zu emittieren, ohne die Menge an direktem Licht, das von dem Licht emittiert wird, zu beeinflussen, passen Sie die Property **Indirekte Energie** im Light3D Inspektor an.
zh_cn: 光发出的间接能量的量由其颜色、能量 *和* 间接能量属性决定。 要使特定灯光发出或多或少的间接能量，而不影响灯光发出的直接光的量，请在 Light3D 检查器中调整 **间接能量（Indirect Energy）** 属性。
zh_tw: 光發出的間接能量的量由其顏色、能量*和*間接能量屬性決定。要使特定燈光發出或多或少的間接能量而不影響燈光發出的直接光量，請在 Light3D 屬性面板中調整 **間接能量** 屬性。

source: To ensure correct visuals when using SDFGI, you must configure your meshes and lights' global illumination properties according to their *purpose* in the scene (static or dynamic).
de: Um bei der Verwendung von SDFGI eine korrekte Darstellung zu gewährleisten, müssen Sie die Property für die Global Illumination Ihrer Meshes und Lichter entsprechend ihrem *Zweck* in der Szene (statisch oder dynamisch) konfigurieren.
zh_cn: 为了确保使用 SDFGI 时获得正确的视觉效果，你必须根据场景中的 **用途** （静态方式或动态方式）配置网格和灯光的全局照明属性。
zh_tw: 為了確保使用 SDFGI 時獲得正確的視覺效果，您必須根據場景中的「用途」（靜態或動態）配置網格和燈光的全域照明屬性。

source: There are 3 global illumination modes available for meshes:
de: Es sind 3 Global Illumination-Modi für Meshes verfügbar:
zh_cn: 网格有 3 种全局光照模式可选：
zh_tw: 有四種可用於取得設定的巨集：

source: **Disabled:** The mesh won't be taken into account in SDFGI generation. The mesh will receive indirect lighting from the scene, but it will not contribute indirect lighting to the scene.
de: **Deaktiviert:** Das Mesh wird bei der SDFGI-Generierung nicht berücksichtigt. Das Mesh erhält zwar indirekte Beleuchtung von der Szene, trägt aber nicht zur indirekten Beleuchtung der Szene bei.
zh_cn: **Disabled：** （即禁用）SDFGI 生成中不会考虑网格。 网格物体将接收来自场景的间接光照，但不会向场景贡献间接光照。
zh_tw: **停用：** SDFGI 生成中不會考慮網格。網格物件將接收來自場景的間接光照，但不會向場景貢獻間接光照。

source: **Static (default):** The mesh will be taken into account in SDFGI generation. The mesh will both receive *and* contribute indirect lighting to the scene. If the mesh is changed in any way after SDFGI is generated, the camera must move away from the object then move back close to it for SDFGI to regenerate. Alternatively, SDFGI can be toggled off and back on. If neither is done, indirect lighting will look incorrect.
de: **Statisch (Default):** Das Mesh wird bei der SDFGI-Generierung berücksichtigt. Das Mesh empfängt *und* trägt zur indirekten Beleuchtung der Szene bei. Wenn das Mesh in irgendeiner Weise verändert wird, nachdem SDFGI generiert wurde, muss sich die Kamera vom Objekt entfernen und dann wieder in die Nähe des Objekts bewegen, damit SDFGI neu generiert werden kann. Alternativ kann SDFGI auch aus- und wieder eingeschaltet werden. Wenn beides nicht gemacht wird, sieht die indirekte Beleuchtung nicht korrekt aus.
zh_cn: **Static （默认）：** （静态方式）SDFGI 生成中将考虑网格。 网格将接收 *并* 为场景提供间接照明。 如果在生成 SDFGI 后网格以任何方式发生更改，则相机必须远离对象然后移回靠近对象，以便 SDFGI 重新生成。 或者，可以关闭然后重新打开 SDFGI。 如果两者都不做，间接照明就会看起来不对劲。
zh_tw: **靜態（預設）：** SDFGI 生成中將考慮網格。網格將接收*並*為場景提供間接照明。如果在生成 SDFGI 後網格以任何方式發生更改，則相機必須遠離物件然後移回靠近對象，以便 SDFGI 重新生成。或者，可以關閉然後重新開啟 SDFGI。如果兩者都不做，間接照明就會看起來不正確。

source: **Dynamic (not supported with SDFGI):** The mesh won't be taken into account in SDFGI generation. The mesh will receive indirect lighting from the scene, but it will not contribute indirect lighting to the scene. *This acts identical to the **Disabled** bake mode when using SDFGI.*
de: **Dynamisch (nicht unterstützt mit SDFGI):** Das Mesh wird bei der SDFGI-Generierung nicht berücksichtigt. Das Mesh wird von der Szene indirekt beleuchtet, aber es trägt nicht zur indirekten Beleuchtung der Szene bei. *Dies ist identisch mit dem Back-Modus **Disabled** bei Verwendung von SDFGI.*
zh_cn: **Dynamic （SDFGI 不支持）：** （动态方式）SDFGI 生成中不会考虑网格。 网格物体将接收来自场景的间接光照，但不会向场景贡献间接光照。*这与使用 SDFGI 时的 **禁用** 烘焙模式相同。*
zh_tw: **動態（SDFGI 不支援）：** SDFGI 生成中不會考慮網格。網格物件將接收來自場景的間接光照，但不會向場景貢獻間接光照。 *這與使用 SDFGI 時的 **禁用** 烘焙模式相同。*

source: Additionally, there are 3 bake modes available for lights (DirectionalLight3D, OmniLight3D and SpotLight3D):
de: Zusätzlich gibt es 3 Back-Modi für Lichter (DirectionalLight3D, OmniLight3D und SpotLight3D):
zh_cn: 此外，对于灯光（DirectionalLight3D、OmniLight3D 和 SpotLight3D），还有三种可用的烘焙模式：
zh_tw: 此外，還有 3 種可用於燈光的烘焙模式（DirectionalLight3D、OmniLight3D 和 SpotLight3D）：

source: **Disabled:** The light won't be taken into account for SDFGI baking. The light won't contribute indirect lighting to the scene.
de: **Deaktiviert:** Das Licht wird beim SDFGI-Backen nicht berücksichtigt. Das Licht trägt nicht zur indirekten Beleuchtung der Szene bei.
zh_cn: **Disabled：** （禁用） SDFGI 烘焙不会考虑光线。 该灯光不会为场景提供间接照明。
zh_tw: **停用：** SDFGI 烘焙不會考慮光線。此燈光不會為場景提供間接照明。

source: **Static:** The light will be taken into account for SDFGI baking. The light will contribute indirect lighting to the scene. If the light is changed in any way after baking, indirect lighting will look incorrect until the camera moves away from the light and back (which causes SDFGI to be baked again). will look incorrect. If in doubt, use this mode for level lighting.
de: **Statisch:** Das Licht wird beim SDFGI-Backen berücksichtigt. Das Licht trägt zur indirekten Beleuchtung der Szene bei. Wenn das Licht nach dem Backen in irgendeiner Weise verändert wird, sieht die indirekte Beleuchtung falsch aus, bis sich die Kamera vom Licht weg und wieder zurück bewegt (was dazu führt, dass SDFGI erneut gebacken wird). Im Zweifelsfall sollten Sie diesen Modus für Level-Beleuchtung verwenden.
zh_cn: **Static：** （静态方式）SDFGI 烘焙时将考虑光线。 灯光将为场景提供间接照明。 如果烘焙后灯光以任何方式发生变化，间接照明将看起来并不正确，直到相机远离灯光并返回（这会导致 SDFGI 再次烘焙）。 会看起来不正确。 如果有疑问，请使用此模式进行水平照明（level lighting）。
zh_tw: **靜態：** SDFGI 烘焙時將考慮光線。燈光將為場景提供間接照明。如果烘焙後燈光以任何方式發生變化，間接照明將看起來不正確，直到相機遠離燈光並返回（這會導致 SDFGI 再次烘焙）。會看起來不正確。如果有疑問，請使用此模式進行水平照明。

source: **Dynamic (default):** The light won't be taken into account for SDFGI baking, but it will still contribute indirect lighting to the scene in real-time. This option is slower compared to **Static**. Only use the **Dynamic** global illumination mode on lights that will change significantly during gameplay.
de: **Dynamisch (Standard):** Das Licht wird beim SDFGI-Backen nicht berücksichtigt, trägt aber dennoch in Echtzeit zur indirekten Beleuchtung der Szene bei. Diese Option ist im Vergleich zu **Statisch** langsamer. Verwenden Sie den Modus **Dynamisch** für Global Illumination nur bei Lichtern, die sich während des Spiels stark verändern.
zh_cn: **Dynamic （默认）：** （动态方式）SDFGI 烘焙不会考虑灯光，但它仍会实时为场景提供间接照明。 与 **静态方式** 相比，此选项速度较慢。 仅对游戏过程中会发生显着变化的灯光使用 **动态方式** 全局照明模式。
zh_tw: **動態（預設）：** SDFGI 烘焙不會考慮燈光，但它仍會即時為場景提供間接照明。與 **靜態** 相比，此選項速度較慢。僅對遊戲過程中會發生顯著變化的燈光使用**動態**全域照明模式。
