Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_lightmap_gi.po
Languages: de, zh_cn, zh_tw

source: Using Lightmap global illumination
de: Verwenden der Lightmap-Global Illumination
zh_cn: 使用光照贴图全局照明
zh_tw: 使用光照貼圖全域光照

source: Baked lightmaps are a workflow for adding indirect (or fully baked) lighting to a scene. Unlike the :ref:`VoxelGI <doc_using_voxel_gi>` and :ref:`SDFGI <doc_using_sdfgi>` approaches, baked lightmaps work fine on low-end PCs and mobile devices, as they consume almost no resources at run-time. Also unlike VoxelGI and SDFGI, baked lightmaps can optionally be used to store direct lighting, which provides even further performance gains.
de: Gebackene Lightmaps sind ein Workflow zum Hinzufügen indirekter (oder vollständig gebackener) Beleuchtung zu einer Szene. Im Gegensatz zu den Ansätzen :ref:`VoxelGI <doc_using_voxel_gi>` und :ref:`SDFGI <doc_using_sdfgi>` funktionieren gebackene Lightmaps gut auf Low-End-PCs und mobilen Geräten, da sie zur Laufzeit fast keine Ressourcen verbrauchen. Im Gegensatz zu VoxelGI und SDFGI können gebackene Lightmaps optional auch zur Speicherung von direkter Beleuchtung verwendet werden, was zu einer weiteren Steigerung der Performance führt.
zh_cn: 烘焙的光照贴图也是一种为场景添加间接光照（也叫全烘焙光照）的工作流程。与 :ref:`VoxelGI <doc_using_voxel_gi>`和 :ref:`SDFGI <doc_using_sdfgi>` 的方法不同，烘焙光照贴图在低端 PC 和移动设备上运行良好，因为它们在运行时几乎不消耗资源。与 VoxelGI 和 SDFGI 的另一个不同点是，烘焙光照贴图还能够用来保存直接光照，从而进一步提升性能。
zh_tw: 烘焙的光照貼圖也是一種為場景新增間接光照（也叫全烘焙光照）的工作流程。與 :ref:`doc_gi_probes` 的方法不同，烘焙光照貼圖在低端PC和移動裝置上運作良好，因為在運作時幾乎不消耗資源。與 GIProbe 的另一個不同點是，烘焙光照貼圖還能夠用來保存直接光照，可以進一步提升性能。

source: Unlike VoxelGI and SDFGI, baked lightmaps are completely static. Once baked, they can't be modified at all. They also don't provide the scene with reflections, so using :ref:`doc_reflection_probes` together with it on interiors (or using a Sky on exteriors) is a requirement to get good quality.
de: Im Gegensatz zu VoxelGI und SDFGI sind gebackene Lightmaps völlig statisch. Einmal gebacken, können sie nicht mehr verändert werden. Sie versehen die Szene auch nicht mit Reflexionen, so dass die Verwendung von :ref:`doc_reflection_probes` zusammen mit ihr für Innenräume (oder die Verwendung eines Sky für Außenbereiche) eine Voraussetzung für gute Qualität ist.
zh_cn: 烘焙光照贴图与 VoxelGI 和 SDFGI 不同，是完全静态的，一旦被烘焙就完全不能被修改。它也不能为场景提供反射，所以如果要达到较好的画质，在室内场景（或者是使用 Sky 的室外场景）中就需要和 :ref:`doc_reflection_probes` 搭配使用。
zh_tw: 烘焙光照貼圖與 GIProbe 不同，是完全靜態的，一旦被烘焙就完全不能被修改。它也不能為場景提供反射，所以如果要達到較好的畫質，在室內場景（或者是使用 Sky 的室外場景）中就需要和 :ref:`doc_reflection_probes` 搭配使用。

source: As they are baked, they have fewer problems than VoxelGI and SDFGI regarding light bleeding, and indirect light will often look better. The downside is that baking lightmaps takes longer compared to baking VoxelGI. While baking VoxelGI can be done in a matter of seconds, baking lightmaps can take several minutes if not more. This can slow down iteration speed significantly, so it is recommended to bake lightmaps only when you actually need to see changes in lighting. Since Godot 4.0, lightmaps are baked on the GPU, making light baking faster if you have a mid-range or high-end dedicated GPU.
de: Da sie gebacken werden, haben sie weniger Probleme mit Light Bleeding als VoxelGI und SDFGI, und indirektes Licht sieht oft besser aus. Der Nachteil ist, dass das Backen von Lightmaps im Vergleich zum Backen von VoxelGI länger dauert. Während das Backen von VoxelGI in wenigen Sekunden erledigt ist, kann das Backen von Lightmaps mehrere Minuten, wenn nicht sogar länger dauern. Dies kann die Iterationsgeschwindigkeit erheblich verlangsamen, weshalb empfohlen wird, Lightmaps nur dann zu backen, wenn Sie tatsächlich Änderungen in der Beleuchtung sehen müssen. Seit Godot 4.0 werden Lightmaps auf dem Grafikprozessor gebacken, was das Backen von Lightmaps beschleunigt, wenn Sie einen dedizierten Mittelklasse- oder High-End-Grafikprozessor haben.
zh_cn: 因为是烘焙出来的，所以在光线渗透方面的问题就比 VoxelGI 和 SDFGI 少很多，并且间接光照也会看上去更漂亮。烘焙光照贴图的缺点是烘焙所需的时间比 VoxelGI 长很多，VoxelGI 几秒钟就能搞定的烘焙，换成烘焙光照贴图就可能至少得花上几分钟。这会严重拖慢迭代速度，所以推荐只在确实有查看光照变化的需求时进行光照贴图的烘焙。从 Godot 4.0 开始，光照贴图烘焙在 GPU 上运行，如果你有中端或高端专用 GPU，则光照烘焙的速度会更快。
zh_tw: 因為是烘焙出來的，所以在光線滲透方面的問題就比 ``GIProbe`` 少很多，並且間接光照也會看上去更漂亮。烘焙光照貼圖的缺點是烘焙所需的時間比 GIProbe 長很多，GIProbe 幾秒鐘就能搞定的烘焙，換成烘焙光照貼圖就可能至少得花上幾分鐘。這會嚴重拖慢反覆運算速度，所以推薦只在確實有查看光照變化的需求時進行光照貼圖的烘焙。

source: Baking lightmaps will also reserve baked materials' UV2 slot, which means you can no longer use it for other purposes in materials (either in the built-in :ref:`doc_standard_material_3d` or in custom shaders).
de: Das Backen von Lightmaps reserviert auch den UV2-Slot von gebackenen Materialien, was bedeutet, dass Sie ihn nicht mehr für andere Zwecke in Materialien verwenden können (entweder im eingebauten :ref:`doc_standard_material_3d` oder in eigenen Shadern).
zh_cn: 烘焙光照贴图还会占用被烘焙材质的 UV2 栏位，也就是说你无法再把 UV2 用于该材质的其它用途（无论是内置的 :ref:`doc_standard_material_3d` 还是自定义着色器）。
zh_tw: 烘焙光照貼圖還會佔用被烘焙材質的 UV2 欄位，也就是說你無法再把 UV2 用於該材質的其它用途（無論是內建的 :ref:`doc_spatial_material` 還是自訂著色器）。

source: Despite their lack of flexibility, baked lightmaps typically offer both the best quality *and* performance at the same time in (mostly) static scenes. This makes lightmaps still popular in game development, despite lightmaps being the oldest technique for global illumination in video games.
de: Trotz ihrer mangelnden Flexibilität bieten gebackene Lightmaps in der Regel gleichzeitig die beste Qualität *und* Performance in (meist) statischen Szenen. Deshalb sind Lightmaps in der Spieleentwicklung immer noch beliebt, obwohl sie die älteste Technik für Global Illumination in Videospielen sind.
zh_cn: 尽管缺乏灵活性，但烘焙光照贴图通常在（大多数）静态场景中同时提供最佳质量和性能。这使得光照贴图在游戏开发中仍然很受欢迎，尽管光照贴图是视频游戏中最古老的全局光照技术。
zh_tw: 儘管缺乏靈活性，烘焙光照貼圖通常在（大部分）靜態場景中同時提供最佳品質*和*性能。這使得光照貼圖在遊戲開發中仍然很流行，儘管光照貼圖是電玩遊戲中最古老的全域照明技術。

source: Not sure if LightmapGI is suited to your needs? See :ref:`doc_introduction_to_global_illumination_comparison` for a comparison of GI techniques available in Godot 4.
de: Sie sind nicht sicher, ob LightmapGI für Ihre Bedürfnisse geeignet ist? Siehe :ref:`doc_introduction_to_global_illumination_comparison` für einen Vergleich der in Godot 4 verfügbaren GI-Techniken.
zh_cn: 不确定 LightmapGI 是否适合你的需求？Godot 4 中可用的 GI 技术的比较见 :ref:`doc_introduction_to_global_illumination_comparison`\ 。
zh_tw: 不確定 LightmapGI 是否適合您的需求？請參閱 doc_introduction_to_global_Illumination_comparison` 以了解 Godot 4 中可用的 GI 技術的比較。

source: Visual comparison
de: Visueller Vergleich
zh_cn: 视觉比较
zh_tw: 視覺比較

source: LightmapGI disabled.
de: LightmapGI deaktiviert.
zh_cn: LightmapGI 已禁用。
zh_tw: LightmapGI 已停用。

source: LightmapGI enabled (with indirect light baked only).
de: LightmapGI aktiviert (nur mit indirektem Licht gebacken).
zh_cn: LightmapGI 已启用（仅烘焙间接光照）。
zh_tw: LightmapGI 啟用（僅使用間接光烘焙）。

source: LightmapGI enabled (with indirect light baked only). Direct light is still real-time, allowing for subtle changes during gameplay.
de: LightmapGI aktiviert (nur mit indirektem Licht gebacken). Direktes Licht ist immer noch in Echtzeit, was subtile Änderungen während des Spielens ermöglicht.
zh_cn: LightmapGI 已启用（仅烘焙间接光照）。直射光仍然是实时的，允许在游戏过程中进行细微的修改。
zh_tw: LightmapGI 啟用（僅使用間接光烘焙）。直射光仍然是即時的，允許在遊戲過程中發生微妙的變化。

source: LightmapGI enabled (with direct and indirect light baked).
de: LightmapGI aktiviert (mit direktem und indirektem Licht gebacken).
zh_cn: LightmapGI 已启用（直接和间接烘焙光照）。
zh_tw: LightmapGI 已啟用（直接和間接光照烘焙）。

source: LightmapGI enabled (with direct and indirect light baked). Best performance, but lower quality visuals. Notice the blurrier sun shadow in the top-right corner.
de: LightmapGI aktiviert (mit direktem und indirektem Licht gebacken). Beste Performance, aber schlechtere Bildqualität. Beachten Sie den unschärferen Sonnenschatten in der oberen rechten Ecke.
zh_cn: LightmapGI 已启用（直接和间接烘焙光照）。最佳性能，但视觉效果质量较低。请注意右上角较模糊的太阳阴影。
zh_tw: LightmapGI 已啟用（直接和間接光照烘焙）。最佳性能，但視覺品質較低。請注意右上角較模糊的太陽陰影。

source: Here are some comparisons of how LightmapGI vs. VoxelGI look. Notice that lightmaps are more accurate, but also suffer from the fact that lighting is on an unwrapped texture, so transitions and resolution may not be that good. VoxelGI looks less accurate (as it's an approximation), but smoother overall.
de: Hier sind einige Vergleiche, wie LightmapGI vs. VoxelGI aussehen. Beachten Sie, dass Lightmaps genauer sind, aber auch unter der Tatsache leiden, dass die Beleuchtung auf einer nicht gewrappten Textur erfolgt, so dass die Übergänge und die Auflösung möglicherweise nicht so gut sind. VoxelGI sieht weniger genau aus (da es sich um eine Annäherung handelt), ist aber insgesamt glatter.
zh_cn: 以下是 LightmapGI 和 VoxelGI 的一些显示效果比较。可以看到光照贴图更精确，但也由于光照事实上是位于展开纹理上的影响，所以过渡以及分辨率可能就没有那么理想。VoxelGI 看上去没有那么精确（因为是近似估算），但总体上更平滑。
zh_tw: 以下是 BakedLightmap 和 GIProbe 的一些顯示效果比較。可以看到光照貼圖更精確，但由於使用的是展開後的紋理，所以過渡以及解析度可能就沒有那麼理想。GIProbe 看上去沒有那麼精確（因為是近似估算），但總體上更平滑。

source: SDFGI is also less accurate compared to LightmapGI. However, SDFGI can support large open worlds without any need for baking.
de: Außerdem ist SDFGI im Vergleich zu LightmapGI weniger genau. Allerdings kann SDFGI große offene Welten unterstützen, ohne dass Backen erforderlich ist.
zh_cn: 与 LightmapGI 相比，SDFGI 的准确性也较低。但是，SDFGI 可以支持大型开放世界，而无需烘焙。
zh_tw: 與 LightmapGI 相比，SDFGI 的準確度也較低。然而，SDFGI 可以支援大型開放世界，而不需要任何烘焙。

source: Setting up
de: Einrichtung
zh_cn: 设置
zh_tw: 設定

source: First of all, before the lightmapper can do anything, the objects to be baked need an UV2 layer and a texture size. An UV2 layer is a set of secondary texture coordinates that ensures any face in the object has its own place in the UV map. Faces must not share pixels in the texture.
de: Bevor der Lightmapper irgendetwas tun kann, benötigen die zu backenden Objekte zunächst eine UV2-Ebene und eine Texturgröße. Eine UV2-Ebene ist ein Satz sekundärer Texturkoordinaten, die sicherstellen, dass jede Fläche des Objekts ihren eigenen Platz in der UV-Map hat. Die Flächen dürfen sich keine Pixel in der Textur teilen.
zh_cn: 首先，在光照贴图器可以执行任何操作之前，要烘焙的对象需要 UV2 图层和纹理大小。UV2 图层是一组辅助纹理坐标，可确保对象中的任何面在 UV 贴图中都有自己的位置。面与面之间不得共享纹理中的像素。
zh_tw: 首先，在光照貼圖器可以執行任何操作之前，要烘焙的物件需要 UV2 圖層和紋理大小。UV2 圖層是一組輔助紋理座標，可確保物件中的任何面在 UV 貼圖中都有自己的位置。面與面之間不得共用紋理中的像素。

source: There are a few ways to ensure your object has a unique UV2 layer and texture size:
de: Es gibt mehrere Möglichkeiten, um sicherzustellen, dass Ihr Objekt eine eindeutige UV2-Ebene und Texturgröße hat:
zh_cn: 这里有几种方法可以确保你的对象具有唯一的 UV2 层和纹理大小：
zh_tw: 這裡有幾種方法可以確保您的物件具有唯一的 UV2 層和紋理大小：

source: Unwrap on scene import (recommended)
de: Entpacken beim Szenenimport (empfohlen)
zh_cn: 场景导入时展开（推荐）
zh_tw: 場景匯入時展開

source: In most scenarios, this is the best approach to use. The only downside is that, on large models, unwrapping can take a while on import. Nonetheless, Godot will cache the UV2 across reimports, so it will only be regenerated when needed.
de: In den meisten Fällen ist dies die beste Vorgehensweise. Der einzige Nachteil ist, dass bei großen Modellen das Entpacken beim Import eine Weile dauern kann. Nichtsdestotrotz speichert Godot die UV2 über Re-Importe hinweg, so dass sie nur bei Bedarf neu generiert werden.
zh_cn: 大多数情况下，这可能是最好的方法。唯一的缺点是，在大型模型上，导入时展开可能需要一段时间。不过 Godot 会在重新导入时缓存 UV2 ，所以只会在需要时重新生成。
zh_tw: 總體來說，這可能是最好的方法。唯一的缺點是，在大型模型上，匯入時展開可能需要一段時間。不過Godot會在重新匯入時快取UV2，所以只會在需要時重新生成。

source: Select the imported scene in the filesystem dock, then go to the **Import** dock. There, the following option can be modified:
de: Wählen Sie die importierte Szene im Dateisystem-Dock aus und gehen Sie dann zum **Importieren**-Dock. Dort kann die folgende Option geändert werden:
zh_cn: 在文件系统面板中选择被导入的场景，然后切换到\ **导入**\ 面板。这里可以修改以下选项：
zh_tw: 在檔案系統面板中選擇被匯入的場景，然後切換到**匯入**面板。這裡可以修改以下選項：

source: The **Meshes > Light Baking** option must be set to **Static Lightmaps (VoxelGI/SDFGI/LightmapGI)**:
de: Die Option **Meshes > Lichtbacken** muss auf **Statische Lightmaps (VoxelGI/SDFGI/LightmapGI)** eingestellt sein:
zh_cn: **网格 > 光照烘焙** 选项必须设置为 **Static Lightmaps (VoxelGI/SDFGI/LightmapGI)**\ （静态光照贴图）：
zh_tw: **網格 > 光照烘焙**選項必須設定為 **靜態光照貼圖 (VoxelGI/SDFGI/LightmapGI)**：

source: When unwrapping on import, you can adjust the texture size using the **Meshes > Lightmap Texel Size** option. *Lower* values will result in more detailed lightmaps, possibly resulting in higher visual quality at the cost of longer bake times and larger lightmap file sizes. The default value of ``0.2`` is suited for small/medium-sized scenes, but you may want to increase it to ``0.5`` or even more for larger scenes. This is especially the case if you're baking indirect lighting only, as indirect light is low-frequency data (which means it doesn't need high-resolution textures to be accurately represented).
de: Beim Entpacken während des Imports können Sie die Texturgröße mit der Option **Meshes > Lightmap Texelgröße** anpassen. *Niedrigere* Werte führen zu detaillierteren Lightmaps, was möglicherweise zu einer höheren visuellen Qualität auf zum Preis längerer Back-Zeiten und größerer Lightmap-Dateigrößen führt. Der voreingestellte Wert von ``0.2`` ist für kleine/mittelgroße Szenen geeignet, aber Sie sollten ihn für größere Szenen auf ``0.5`` oder sogar mehr erhöhen. Dies ist besonders dann der Fall, wenn Sie nur indirekte Beleuchtung backen, da indirektes Licht Daten mit niedriger Frequenz darstellt (was bedeutet, dass es keine hochauflösenden Texturen benötigt, um genau abgebildet zu werden).
zh_cn: 在导入并展开时，可以使用 **网格 > 光照贴图纹素大小** 选项调整纹理大小。\ *较低的*\ 值将产生更详细的光照贴图，可能会以更长的烘焙时间和更大的光照贴图文件大小为代价获得更高的视觉质量。默认值 ``0.2`` 适用于中小型场景，但对于较大的场景，你可能希望将其增加到 ``0.5`` 甚至更多。如果你仅烘焙间接照明，则尤其如此，因为间接光是低频数据（这意味着它不需要高分辨率纹理即可准确表示）。
zh_tw: 匯入時展開時，您可以使用 **網格 > 光照貼圖紋理大小** 選項調整紋理大小。 *較低的*值將產生更詳細的光照貼圖，可能會導致更高的視覺質量，但代價是更長的烘焙時間和更大的光照貼圖檔案大小。預設值“0.2”適用於小型/中型場景，但您可能需要將其增加到“0.5”，甚至更大的場景。如果您僅烘焙間接光照，則尤其如此，因為間接光是低頻資料（這意味著它不需要準確表示高解析度紋理）。

source: The effect of setting this option is that all meshes within the scene will have their UV2 maps properly generated.
de: Die Einstellung dieser Option bewirkt, dass die UV2-Maps aller Meshes in der Szene korrekt generiert werden.
zh_cn: 设置此选项的效果是场景中的所有网格都将正确生成其 UV2 贴图.
zh_tw: 設定此選項的效果是場景中的所有網格都將正確生成其UV2貼圖.

source: When reusing a mesh within a scene, keep in mind that UVs will be generated for the first instance found. If the mesh is re-used with different scales (and the scales are wildly different, more than half or twice), this will result in inefficient lightmaps. To avoid this, adjust the **Lightmap Scale** property in the GeometryInstance3D section of a MeshInstance3D node. This lets you *increase* the level of lightmap detail for specific MeshInstance3D nodes (but not decrease it).
de: Bei der Wiederverwendung eines Meshes innerhalb einer Szene ist zu beachten, dass die UVs für die erste gefundene Instanz erzeugt werden. Wenn das Mesh mit unterschiedlichen Skalen wiederverwendet wird (und die Skalen sehr unterschiedlich sind, mehr als die Hälfte oder zweimal), führt dies zu ineffizienten Lightmaps. Um dies zu vermeiden, passen Sie die Property **Lightmap Skalierung** im GeometryInstance3D-Abschnitt eines MeshInstance3D-Nodes an. Damit können Sie die Detailgenauigkeit der Lightmaps für bestimmte MeshInstance3D-Nodes *erhöhen* (aber nicht verringern).
zh_cn: 如果在场景中复用了网格，请注意生成 UV 时只会使用第一个找到的实例。如果复用时使用了不同的缩放比例（并且相差很大，超过了一半或者两倍），会导致生成低效的光照贴图。为了避免这种情况，可以调整网格实例 3D 节点的 GeometryInstance3D 部分中的 **Lightmap Scale** 属性。这样可以**增加特定 MeshInstance3D 节点的光贴图细节（但不能减少）。
zh_tw: 如果在場景中複用了網格，請注意生成 UV 時只會使用第一個找到的實例。如果複用時使用了不同的縮放比例（並且相差很大，超過了一半或者兩倍），會導致生成低效的光照貼圖。如果你想用光照貼圖，就不要在複用原始網格時使用明顯不同的縮放比例。

source: Also, the ``*.unwrap_cache`` files should *not* be ignored in version control as these files guarantee that UV2 reimports are consistent across platforms and engine versions.
de: Außerdem sollten die Dateien ``*.unwrap_cache`` in der Versionsverwaltung *nicht* ignoriert werden, da diese Dateien garantieren, dass UV2-Reimporte über Plattformen und Engine-Versionen hinweg konsistent sind.
zh_cn: 另外，请\ *不要*\ 在版本控制系统中忽略 ``*.unwrap_cache`` 文件，这些文件可以用来保证不同平台、不同版本的引擎在重新导入 UV2 时的一致性。
zh_tw: 另外，請*不要*在版本控制系統中忽略 ``*.unwrap_cache`` 檔，這些檔可以用來保證不同平臺、不同版本的引擎在重新匯入 UV2 時的一致性。

source: Unwrap from within Godot
de: Aus Godot heraus entpacken
zh_cn: 使用 Godot 进行展开
zh_tw: 使用 Godot 進行展開

source: If this Mesh menu operation is used on an imported 3D scene, the generated UV2 will be lost when the scene is reloaded.
de: Wenn dieser Vorgang des Mesh-Menüs auf eine importierte 3D-Szene angewendet wird, geht die erzeugte UV2 verloren, wenn die Szene neu geladen wird.
zh_cn: 如果在导入的 3D 场景上使用此 Mesh 菜单操作，则重新加载场景时生成的 UV2 将丢失。
zh_tw: 如果在匯入的 3D 場景上使用此 Mesh 選單操作，則重新載入場景時產生的 UV2 將會遺失。

source: Godot has an option to unwrap meshes and visualize the UV channels. After selecting a MeshInstance3D node, it can be found in the **Mesh** menu at the top of the 3D editor viewport:
de: Godot verfügt über eine Option zum Entpacken von Meshes und zur Visualisierung der UV-Kanäle. Nach der Auswahl eines MeshInstance3D-Nodes kann dieser im **Mesh**-Menü oben im 3D-Editor gefunden werden:
zh_cn: Godot 可以选择展开网格并可视化 UV 通道。 选择 MeshInstance3D 节点后，可以在 3D 编辑器视口顶部的 **Mesh** 菜单中找到它：
zh_tw: Godot可以選擇打開網格並視覺化UV通道. 它可以在Mesh功能表中找到:

source: This will generate a second set of UV2 coordinates which can be used for baking. It will also set the texture size automatically.
de: Dadurch wird ein zweiter Satz von UV2-Koordinaten erzeugt, die zum Backen verwendet werden können. Es wird auch die Texturgröße automatisch eingestellt.
zh_cn: 这将生成第二组 UV2 坐标, 可用于烘焙, 并且还将自动设置纹理大小.
zh_tw: 這將生成第二組UV2座標, 可用於烘焙, 並且還將自動設定紋理大小.

source: Unwrap from your 3D modeling software
de: Entpacken aus Ihrer 3D-Modellierungssoftware
zh_cn: 使用你自己的 3D 建模软件展开
zh_tw: 使用 3D DCC 展開

source: The last option is to do it from your favorite 3D app. This approach is generally **not recommended**, but it's explained so that you know it exists. The main advantage is that, on complex objects that you may want to re-import a lot, the texture generation process can be quite costly within Godot, so having it unwrapped before import can be faster.
de: Die letzte Möglichkeit besteht darin, dies von Ihrer bevorzugten 3D-Anwendung aus zu tun. Dieser Ansatz wird im Allgemeinen **nicht empfohlen**, aber er wird erklärt, damit Sie wissen, dass es ihn gibt. Der Hauptvorteil besteht darin, dass bei komplexen Objekten, die Sie möglicherweise häufig wieder importieren möchten, der Prozess der Texturerzeugung in Godot recht kostspielig sein kann, so dass es schneller sein kann, sie vor dem Import zu entpacken.
zh_cn: 最后一种方法是在你喜欢的 3D 应用程序中进行操作。通常不推荐这种做法，但为了让你知道它的存在，这里还是解释一下。这种做法的主要优势在于，针对可能要经常重新导入的复杂对象，在 Godot 中进行纹理生成的代价可能相当高，所以在导入前展开可以提高速度。
zh_tw: 最後一種方法是在你喜歡的 3D 應用程式中進行操作。通常不推薦這種做法，但為了讓你知道它的存在，這裡還是解釋一下。這種做法的主要優勢在於，針對可能要經常重新匯入的複雜物件，在 Godot 中進行紋理生成的代價可能相當高，所以在匯入前展開可以提高速度。

source: Simply do an unwrap on the second UV2 layer.
de: Führen Sie einfach einen Entpackvorgang für die zweite UV2-Ebene durch.
zh_cn: 只需在第二个UV2层上进行展开即可。
zh_tw: 只需在第二個UV2層上進行展開即可。

source: Then import the 3D scene normally. Remember you will need to set the texture size on the mesh after import.
de: Dann importieren Sie die 3D-Szene ganz normal. Denken Sie daran, dass Sie nach dem Import die Texturgröße auf dem Mesh einstellen müssen.
zh_cn: 然后正常导入 3D 场景。记得在导入后为网格设置纹理大小。
zh_tw: 然後正常匯入 3D 場景。記得在匯入後為網格設定紋理大小。

source: If you use external meshes on import, the size will be kept. Be wary that most unwrappers in 3D modeling software are not quality-oriented, as they are meant to work quickly. You will mostly need to use seams or other techniques to create better unwrapping.
de: Wenn Sie beim Import externe Meshes verwenden, wird die Größe beibehalten. Beachten Sie, dass die meisten Unwrapper in 3D-Modellierungssoftware nicht qualitätsorientiert sind, da sie schnell arbeiten sollen. Meistens müssen Sie Nähte oder andere Techniken verwenden, um ein besseres Unwrapping zu erreichen.
zh_cn: 如果在导入时使用外部网格，则将保留大小。请注意，3D 建模软件中的大多数解包器都不是以质量为导向的，因为它们的目的是快速工作。你通常需要使用接缝或其他技术来创建更好的展开效果。
zh_tw: 如果在匯入時使用外部網格, 則將保留大小. 請注意,3D DCC中的大多數解包器都不是面向品質的, 因為它們可以快速工作. 您通常需要使用接縫或其他技術來建立更好的展開.

source: Generating UV2 for primitive meshes
de: Erzeugen von UV2 für primitive Meshes
zh_cn: 为图元网格生成 UV2
zh_tw: 將 Sprite 轉換為 2D 網格

source: This option is only available for primitive meshes such as :ref:`class_BoxMesh`, :ref:`class_CylinderMesh`, :ref:`class_PlaneMesh`, etc.
de: Diese Option ist nur für primitive Netze wie :ref:`class_BoxMesh`, :ref:`class_CylinderMesh`, :ref:`class_PlaneMesh`, etc. verfügbar.
zh_cn: 此选项仅适用于图元网格，例如 :ref:`class_BoxMesh`\ 、\ :ref:`class_CylinderMesh`\ 、\ :ref:`class_PlaneMesh` 等。
zh_tw: 此選項僅適用於基本網格體，例如 class_BoxMesh、class_CylinderMesh、class_PlaneMesh 等。

source: Enabling UV2 on primitive meshes allows you to make them receive and contribute to baked lighting. This can be used in certain lighting setups. For instance, you could hide a torus that has an emissive material after baking lightmaps to create an area light that follows the shape of a torus.
de: Wenn Sie UV2 für primitive Meshes aktivieren, können Sie dafür sorgen, dass sie gebackene Beleuchtung erhalten und zu dieser beitragen. Dies kann in bestimmten Beleuchtungs-Setups verwendet werden. Sie können zum Beispiel einen Torus ausblenden, der nach dem Backen von Lichtkarten ein emittierendes Material hat, um ein Flächenlicht zu erzeugen, das der Form eines Torus folgt.
zh_cn: 在图元网格上启用 UV2 可以使它们接收烘焙照明并做出贡献。这可用于某些照明设置。例如，你可以在烘焙光照贴图后隐藏具有自发光材质的圆环，以创建遵循圆环形状的区域光。
zh_tw: 在原始網格體上啟用 UV2 可以使它們接收並貢獻烘焙光照。這可以用於某些照明設定。例如，您可以在烘焙光貼圖後隱藏具有發光材質的圓環，以建立遵循圓環形狀的區域光。

source: By default, primitive meshes do not have UV2 generated to save resources (as these meshes may be created during gameplay). You can edit a primitive mesh in the inspector and enable **Add UV2** to make the engine procedurally generate UV2 for a primitive mesh. The default **UV2 Padding** value is tuned to avoid most lightmap bleeding, without wasting too much space on the edges. If you notice lightmap bleeding on a specific primitive mesh only, you may have to increase **UV2 Padding**.
de: Standardmäßig wird bei primitiven Meshes kein UV2 erzeugt, um Ressourcen zu sparen (da diese Meshes während des Spiels erstellt werden können). Sie können ein primitives Mesh im Inspektor bearbeiten und **UV2 hinzufügen** aktivieren, damit die Engine prozedural UV2 für ein primitives Mesh generiert. Der Standardwert **UV2-Padding** ist so eingestellt, dass ein Bleeding der Lightmaps weitestgehend vermieden wird, ohne zu viel Platz an den Rändern zu verschwenden. Wenn Sie Lightmap-Bleeding nur bei einem bestimmten primitiven Mesh bemerken, müssen Sie möglicherweise **UV2-Padding** erhöhen.
zh_cn: 默认情况下，图元网格不会生成 UV2 以节省资源（因为这些网格可以在游戏过程中创建）。你可以在检查器中编辑基元网格并启用\ **添加 UV2**\ ，以使引擎按程序为图元网格生成 UV2。默认的 UV2 填充值经过调整，以避免大多数光照贴图渗色，而不会在边缘浪费太多空间。如果你注意到光照贴图仅在特定基元网格上渗色，则可能需要增加 **UV2 填充**\ 。
zh_tw: 預設情況下，原始網格體不會產生 UV2 以節省資源（因為這些網格體可能在遊戲過程中建立）。您可以在屬性面板中編輯基本網格並啟用**新增 UV2** 以使引擎按程式為基本網格產生 UV2。預設的 **UV2 填充** 值經過調整以避免大多數光照貼圖滲色，而不會在邊緣上浪費太多空間。如果您發現光照貼圖僅在特定基元網格上滲色，則可能需要增加 **UV2 填充**。

source: **Lightmap Size Hint** represents the size taken by a single mesh on the lightmap texture, which varies depending on the mesh's size properties and the **UV2 Padding** value. **Lightmap Size Hint** should not be manually changed, as any modifications will be lost when the scene is reloaded.
de: **Lightmap-Größenhinweis** stellt die Größe dar, die ein einzelnes Mesh auf der Lightmap-Textur einnimmt. Sie variiert je nach den Eigenschaften der Mesh-Größe und dem Wert **UV2-Padding**. **Lightmap-Größenhinweis** sollte nicht manuell geändert werden, da alle Änderungen verloren gehen, wenn die Szene neu geladen wird.
zh_cn: **Lightmap Size Hint**\ （光照贴图大小提示）表示光照贴图纹理上的单个网格所采用的大小，该大小因网格的大小属性和 **UV2 Padding** 值而异。\ **Lightmap Size Hint** 不应手动更改，因为重新加载场景时任何修改都将丢失。
zh_tw: **光照貼圖大小提示** 表示光照貼圖紋理上單一網格所佔據的大小，該大小會根據網格的大小屬性和 **UV2 填充** 值而變化。 **光照貼圖大小提示** 不應手動更改，因為重新載入場景時任何修改都會遺失。

source: Checking UV2
de: UV2 überprüfen
zh_cn: 检查 UV2
zh_tw: 檢查 UV2
