Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/troubleshooting.po
Languages: de, es, ja, pl, zh_cn, zh_tw

source: Troubleshooting
de: Fehlersuche
es: Solución De Problemas
ja: トラブルシューティング
pl: Rozwiązywanie problemów
zh_cn: 故障排除
zh_tw: 疑難排解

source: This page lists common issues encountered when using Godot and possible solutions.
de: Diese Seite listet häufig auftretende Probleme bei der Verwendung von Godot auf und bietet mögliche Lösungen an.
es: Esta página enumera los problemas comunes que se encuentran al usar Godot y las posibles soluciones.
ja: このページでは、Godotを使用する際によく遭遇する問題と、その解決策の候補を一覧にしています。
pl: Ta strona zawiera listę typowych problemów napotkanych podczas korzystania z Godota i możliwych rozwiązań.
zh_cn: 这个页面列出了使用 Godot 时的常见问题以及可能的解决办法。
zh_tw: 本頁列出了在使用 Godot 時會遇到的場景問題與可行的解決方案。

source: See :ref:`doc_using_the_web_editor` for caveats specific to the Web version of the Godot editor.
de: Siehe :ref:`doc_using_the_web_editor` für spezielle Hinweise zur Web-Version des Godot-Editors.
es: Ver :ref:`doc_using_the_web_editor` para advertencias específicas de la versión HTML5 del editor Godot.
ja: Web版のGodotエディタに特有の注意点については、 :ref:`doc_using_the_web_editor` をご覧ください。
pl: Zobacz :ref:`doc_using_the_web_editor` w celu zapoznania się z uwagami dotyczącymi internetowej wersji edytora Godot.
zh_cn: 关于 Godot 编辑器 Web 版本特定的注意事项，请参阅 :ref:`doc_using_the_web_editor`\ 。
zh_tw: 關於 Godot 編輯器 HTML5 版本的特定注意事項，請參考 :ref:`doc_using_the_web_editor`。

source: The editor runs slowly and uses all my CPU and GPU resources, making my computer noisy
de: Der Editor läuft langsam und verwendet alle meine CPU und GPU-Ressourcen, was meinen Computer laut werden lässt
es: El editor funciona lento y utiliza todos mis recursos de CPU y GPU, volviendo ruidosa mi computadora
ja: エディターの動作が遅く、CPUとGPUのリソースの多くを使用する場合、コンピュータからの騒音が大きくなります
pl: Edytor działa wolno i wykorzystuje wszystkie zasoby procesora i karty graficznej, co powoduje, że komputer hałasuje
zh_cn: 编辑器运行缓慢，占用了我所有的 CPU 和 GPU 资源，使我的电脑变得嘈杂
zh_tw: 編輯器運作緩慢，佔用了我所有的 CPU 和 GPU 資源，使我的電腦變得嘈雜

source: This is a known issue, especially on macOS since most Macs have Retina displays. Due to Retina displays' higher pixel density, everything has to be rendered at a higher resolution. This increases the load on the GPU and decreases perceived performance.
de: Dies ist ein bekanntes Problem, besonders auf MacOS, da die meisten Macs über Retina-Displays verfügen. Durch die höhere Pixeldichte von Retina-Displays muss alles mit einer höheren Auflösung gerendert werden. Dies erhöht die GPU-Auslastung und verringert die wahrgenommene Performance.
es: Esto es un problema conocido especialmente en macOS, dado el hecho que la mayoría de Macs tienen monitores de Retina. Debido a la alta densidad en pixeles de estos dispositivos, todo tiene que ser renderizado a altas resoluciones. Esto incrementa la carga en el GPU y disminuye el rendimiento percibido.
ja: これは既知の問題であり、ほとんどの Mac には Retina ディスプレイが搭載されているため、特に macOS で発生します。このディスプレイでは、より高い解像度でのエンジンのレンダリングが必要になります。これにより、GPU負荷が増加し、体感的なパフォーマンスが低下します。
pl: Jest to znany problem, zwłaszcza w systemie macOS, ponieważ większość komputerów Mac ma wyświetlacze Retina. Ze względu na większą gęstość pikseli w wyświetlaczach Retina wszystko musi być renderowane w wyższej rozdzielczości. Zwiększa to obciążenie procesora graficznego i zmniejsza postrzeganą wydajność.
zh_cn: 这是一个已知问题，尤其是在 macOS 上，因为大多数 Mac 都有 Retina 显示屏。由于 Retina 显示器的像素密度更高，因此所有内容都必须以更高的分辨率渲染。这会增加 GPU 上的负载并降低感知性能。
zh_tw: 這是一個已知問題，尤其是在 macOS 上，因為大多數 Mac 都有 Retina 顯示幕。由於 Retina 顯示器的像素密度更高，因此所有內容都必須以更高的解析度算繪。這會增加 GPU 上的負載並降低感知性能。

source: There are several ways to improve performance and battery life:
de: Es gibt mehrere Optionen die Performance zu steigern und die Batterielebensdauer zu verlängern:
es: Existen varios métodos para mejorar el desempeño y el rendimiento de la batería:
ja: パフォーマンスとバッテリー寿命を向上させるには、いくつか方法があります。
pl: Istnieje kilka sposobów poprawy wydajności i żywotności baterii:
zh_cn: 有几种衡量性能和电池续航的方法, 包括:
zh_tw: 有幾種衡量性能和電池續航的方法, 包括:

source: In 3D, click the **Perspective** button in the top left corner and enable **Half Resolution**. The 3D viewport will now be rendered at half resolution, which can be up to 4 times faster.
de: Klicken Sie in 3D auf den Button **Perspektive** in der oberen linken Ecke und aktivieren Sie **Halbe Auflösung**. Der 3D-Viewport wird nun mit halber Auflösung gerendert, was bis zu viermal schneller sein kann.
es: En 3D, pulsa sobre el botón de **Perspectiva**, en la esquina superior izquierda y habilita **Media Resolución**. La ventana ahora será renderizada a la mitad de la resolución, que puede llegar a ser hasta 4 veces más rápida.
ja: 3D では、左上隅にある **Perspective**ボタンをクリックし、**Half Resolution**を有効にします。 3D ビューポートは半分の解像度でレンダリングされるようになり、最大 4 倍高速化されます。
pl: W trybie 3D kliknij przycisk **Perspektywa** (Perspective) w lewym górnym rogu i włącz opcję **Połowa rozdzielczości** (Half Resolution). Widok perspektywy (viewport) 3D będzie teraz renderowany w połowie rozdzielczości, co może być nawet 4 razy szybsze.
zh_cn: 在 3D 模式下，单击左上角的\ **透视**\ 按钮并启用\ **半分辨率**\ 。现在 3D 视口就会以半分辨率渲染，速度最多可以提高到原来的 4 倍。
zh_tw: 在 3D 模式下，按一下左上角的 **透視** 按鈕並啟用 **半解析度** 。現在 3D 視口就會以半解析度算繪，速度最多可以提高到原來的 4 倍。

source: Open the Editor Settings and increase the value of **Low Processor Mode Sleep (µsec)** to ``33000`` (30 FPS). This value determines the amount of *microseconds* between frames to render. Higher values will make the editor feel less reactive but will help decrease CPU and GPU usage significantly.
de: Öffnen Sie die Editoreinstellungen und erhöhen Sie den Wert von **Leerlaufzeit im Prozessorenergiesparmodus (µs)** auf ``33000`` (30 FPS). Dieser Wert bestimmt die Anzahl der *Mikrosekunden* zwischen den zu rendernden Frames. Höhere Werte führen dazu, dass der Editor weniger reaktiv ist, helfen aber, die CPU- und GPU-Auslastung deutlich zu verringern.
es: Abre la Configuración del Editor e incrementa **Low Processor Mode Sleep (µsec)** a ``33000`` (30 FPS). Este valor determina la cantidad de *microsegundos* entre los frames a renderizar. Valores altos harán que el editor sea menos responsivo pero bajará significativamente el uso de CPU y GPU.
ja: エディタ設定を開き、**Low Processor Mode Sleep (マイクロ秒)** の値を「33000」(30 FPS) に増やします。 この値は、レンダリングするフレーム間の *マイクロ秒* の量を決定します。 値を高くすると、エディターの反応性が低くなりますが、CPU と GPU の使用量が大幅に減少します。
pl: Otwórz Ustawienia edytora i zwiększ wartość **Uśpienia trybu niskiego procesora (µsec)** (Low Processor Mode Sleep (µsec)) do „33000” (30 FPS). Ta wartość określa ilość *mikrosekund* pomiędzy klatkami do renderowania. Wyższe wartości spowodują, że edytor będzie wolniej reagował, ale pomogą też znacznie zmniejszyć użycie procesora i karty graficznej.
zh_cn: 打开编辑器设置并将 **低处理器模式睡眠（微秒）** 的值增加到 ``33000`` \（30 FPS）。 该值确定要渲染的帧之间的 *微秒* 量。 较高的值将降低编辑器反应性，但可显著降低 CPU 和 GPU 使用率。
zh_tw: 打開編輯器設定並將 **節能處理器模式睡眠（微秒）** 的值增加到 ``33000`` （30 FPS）。 該值確定要算繪的影格之間的 *微秒* 量。 較高的值將降低編輯器反應性，但可顯著降低 CPU 和 GPU 使用率。

source: If you have a node that causes the editor to redraw continuously (such as particles), hide it and show it using a script in the ``_ready()`` method. This way, it will be hidden in the editor but will still be visible in the running project.
de: Wenn Sie einen Node haben, der den Editor dazu bringt, ständig neu zu zeichnen (z. B. Partikel), blenden Sie ihn aus und zeigen Sie ihn mit einem Skript in der Methode ``_ready()`` an. Auf diese Weise wird es im Editor ausgeblendet, ist aber im laufenden Projekt weiterhin sichtbar.
es: Si tiene un Nodo que provoca que el Editor se re-dibuje continuamente (como las partículas), ocúltelo durante la edición y mediante un script en el ``_ready()`` , muéstrelo nuevamente. De esta forma estará oculto en el Editor y aún así, visible durante la ejecución del proyecto.
ja: エディターに継続的に再描画させるノード (パーティクルなど) がある場合は、それを非表示にし、GDScriptの ``_ready()`` を使用して表示させるようにすることで、Editorをより軽量化することができます。
pl: Jeśli masz węzeł, który powoduje ciągłe przerysowywanie okna edytora (np. cząstki), ukryj go i pokaż za pomocą skryptu w metodzie ``_ready()``. W ten sposób zostanie on ukryty podczas pracy, ale nadal będzie widoczny w działającej grze.
zh_cn: 如果有某个节点导致编辑器连续重新绘制（例如粒子），请将其隐藏并使用 ``_ready()`` 方法在脚本中显示它。这样，它将隐藏在编辑器中，但仍在正在运行的项目中可见。
zh_tw: 如果您有某個節點導致編輯器連續重新繪製（例如粒子），請將其隱藏並使用 ``_ready()`` 方法在腳本中顯示它。這樣，它將隱藏在編輯器中，但仍在正在運作的專案中可見。

source: The editor stutters and flickers on my variable refresh rate monitor (G-Sync/FreeSync)
de: Der Editor zeigt Stutter- und Flicker-Effekte auf meinem Monitor mit variabler Bildwiederholrate (G-Sync/FreeSync)
es: El editor se traba y parpadea en mi monitor de frecuencia de actualización variable (G-Sync/FreeSync)
ja: 可変リフレッシュレートモニター(G-Sync/FreeSync)でエディターが途切れたり、チラついたりします
pl: Edytor zacina się i migocze na moim monitorze ze zmienną częstotliwością odświeżania (G-Sync/FreeSync)
zh_cn: 编辑器在我的可变刷新率显示器（G-Sync/FreeSync）上出现卡顿和闪烁的情况
zh_tw: 編輯器在我的可變更新率顯示器（G-Sync/FreeSync）上出現卡頓和閃爍的情況

source: This is a `known issue <https://github.com/godotengine/godot/issues/38219>`__. Variable refresh rate monitors need to adjust their gamma curves continuously to emit a consistent amount of light over time. This can cause flicker to appear in dark areas of the image when the refresh rate varies a lot, which occurs as the Godot editor only redraws when necessary.
de: Dies ist ein `bekanntes Problem <https://github.com/godotengine/godot/issues/38219>`__. Monitore mit variabler Bildwiederholfrequenz müssen ihre Gammakurven kontinuierlich anpassen, um eine gleichmäßige Lichtmenge über die Zeit zu emittieren. Dies kann dazu führen, dass in dunklen Bereichen des Bildes ein Flicker-Effekt auftritt, wenn die Bildwiederholfrequenz stark schwankt, da der Godot-Editor nur bei Bedarf neu zeichnet.
es: Esto es un problema conocido <https://github.com/godotengine/godot/issues/38219>`__. Los monitores de frecuencia de actualización variable necesitan ajuste en sus curvas de gamma continuamente para mantener un valor de luz consistente. Esto puede provocar que aparezca parpadeo en zonas oscuras de la imágen cuando la actualización de pantalla varía mucho, lo que sucede debido a que el Editor de Godot sólo redibuja cuando es necesario.
ja: 既知の問題です。可変リフレッシュ レート モニターは、時間の経過とともに一貫した量の光を放射するために、ガンマ カーブを継続的に調整する必要があります。 これにより、リフレッシュ レートが大幅に変化するときに画像の暗い領域にちらつきが発生する可能性があります。これは、Godot エディタが必要な場合にのみ再描画するために発生します。 `こちら<https://github.com/godotengine/godot/issues/38219>`__ から問題の詳細を確認してください。
pl: To jest dobrze `znany problem <https://github.com/godotengine/godot/issues/38219>`__. Monitory o zmiennej częstotliwości odświeżania muszą stale dostosowywać swoje krzywe gamma, aby emitować stałą ilość światła w czasie. Może to powodować pojawianie się migotania w ciemnych obszarach obrazu, gdy częstotliwość odświeżania znacznie się zmienia, co ma miejsce, gdy edytor silnika Godot przerysowuje się tylko wtedy, gdy jest to konieczne.
zh_cn: 这是一个\ `已知问题 <https://github.com/godotengine/godot/issues/38219>`__\ 。 可变刷新率显示器需要不断调整其伽玛曲线，以便随着时间的推移发出一致的光量。 当刷新率变化很大时，这可能会导致图像的黑暗区域出现闪烁，这是因为 Godot 编辑器仅在必要时重绘。
zh_tw: 這是一個 `已知問題 <https://github.com/godotengine/godot/issues/38219>`__ 。 可變更新率顯示器需要不斷調整其伽瑪曲線，以便隨著時間的推移發出一致的光量。 當更新率變化很大時，這可能會導致圖像的黑暗區域出現閃爍，這是因為 Godot 編輯器僅在必要時重繪。

source: There are several workarounds for this:
de: Hier gibt es mehrere Workarounds:
es: Hay varias soluciones para esto:
ja: これにはいくつかの理由があります:
pl: Istnieje kilka obejść tego problemu:
zh_cn: 这有几种解决办法：
zh_tw: 這有幾種解決辦法：

source: Enable **Interface > Editor > Update Continuously** in the Editor Settings. Keep in mind this will increase power usage and heat/noise emissions since the editor will now be rendering constantly, even if nothing has changed on screen. To alleviate this, you can increase **Low Processor Mode Sleep (µsec)** to ``33000`` (30 FPS) in the Editor Settings. This value determines the amount of *microseconds* between frames to render. Higher values will make the editor feel less reactive but will help decrease CPU and GPU usage significantly.
de: Aktivieren Sie **Oberfläche > Editor > Fortlaufend aktualisieren** in den Editoreinstellungen. Beachten Sie, dass dies den Stromverbrauch und die Wärme- und Geräuschemissionen erhöht, da der Editor nun ständig rendert, auch wenn sich auf dem Bildschirm nichts geändert hat. Um dies zu vermeiden, können Sie in den Editor-Einstellungen **Leerlaufzeit im Prozessorenergiesparmodus (µs)** auf ``33000`` (30 FPS) erhöhen. Dieser Wert bestimmt die Anzahl der *Mikrosekunden* zwischen den zu rendernden Frames. Höhere Werte führen dazu, dass der Editor weniger reaktiv ist, helfen aber, die CPU- und GPU-Auslastung deutlich zu verringern.
es: Habilita **Interface > Editor > Update Continuously** en las Configuraciones del Editor. Ten en cuenta que esto puede incrementar el consumo de energía, y generará más calor y ruido puesto que ahora el editor se renderizará continuamente incluso si nada ha cambiado en pantalla. Para aliviar esto, puedes incrementar **Low Processor Mode Sleep (µsec)** a ``33000`` (30 FPS). Este valor determmina la cantidad de *microsegundos* entre frames a renderizar. Valores altos harán que el editor se sienta menos responsivo pero ayudará a reducir significantemente e uso de CPU y GPU.
ja: エディターの設定で**Interface > Editor > Update Continuously**を有効にしてください。画面に何も変化がない場合でも、エディターは常にレンダリングを行うため、電力使用量と熱やノイズの放出が増加することに注意してください。これを軽減するには、**Low Processor Mode Sleep (µsec)*を ``33000`` (30 FPS)に増やしてください。この値は、レンダリングするフレーム感覚を変更するためのものです。エディターの反応性は低くなりますが、CPUとGPUの使用料が低下します。
pl: Włącz opcję **Interfejs > Edytor > Stale aktualizuj ** w Ustawieniach Edytora (główne menu > Edytor > Ustawienia Edytora...). Należy pamiętać, że zwiększy to zużycie energii oraz emisję ciepła/szumu, ponieważ edytor będzie renderował w sposób ciągły, nawet jeśli nic nie uległo zmianie na ekranie. By załagodzić ten efekt, możesz zwiększyć **Uśpienie w trybie niskiego procesora (µs)** do ``33000`` (30 FPS) w Ustawieniach Edytora. Ta wartość określa ilość *mikrosekund* pomiędzy klatkami do renderowania. Wyższe wartości spowodują, że edytor będzie wolniej reagował, ale pomogą znacznie zmniejszyć użycie procesora i karty graficznej.
zh_cn: 在编辑器设置中启用 **界面 > 编辑器 > 持续更新**\ 。 现在即使屏幕没有变化，编辑器也将不断渲染，这会增加功耗、造成热量和噪音的更大排放。 为了缓解这种情况，你可以在编辑器设置中将 **低处理器模式睡眠（微秒）** 增加到 ``33000``\ （30 FPS）。 该值确定要渲染的帧之间的 *微秒* 量。 较高的值将降低编辑器反应性，但可显著降低 CPU 和 GPU 使用率。
zh_tw: 在編輯器設定中啟用 **介面 > 編輯器 > 持續更新** 。 現在即使螢幕沒有變化，編輯器也將不斷算繪，這會增加功耗、造成熱量和噪音的更大排放。 為了緩解這種情況，你可以在編輯器設定中將 **節能處理器模式睡眠（微秒）** 增加到 ``33000`` （30 FPS）。 該值確定要算繪的影格之間的 *微秒* 量。 較高的值將降低編輯器反應性，但可顯著降低 CPU 和 GPU 使用率。

source: Alternatively, disable variable refresh rate on your monitor or in the graphics driver.
de: Alternativ dazu können Sie die variable Bildwiederholrate auf Ihrem Monitor oder im Grafiktreiber deaktivieren.
es: Alternativamente, deshabilita la frecuencia de actualización variable en tu monitor o en el controlador gráfico.
ja: お使いのモニターまたはグラフィックス ドライバーで可変リフレッシュ レートを無効にすることもできます。
pl: Jako alternatywę, możesz wyłączyć zmienną częstotliwość odświeżania w swoim monitorze lub w sterowniku karty graficznej.
zh_cn: 或者，在显示器或图形驱动程序中禁用可变刷新率。
zh_tw: 或者，在顯示器或圖形驅動程式中禁用可變更新率。

source: VRR flicker can be reduced on some displays using the **VRR Control** or **Fine Tune Dark Areas** options in your monitor's OSD. These options may increase input lag or result in crushed blacks.
de: VRR-Flicker kann auf einigen Bildschirmen mit den Optionen **VRR-Steuerung** oder **Feinabstimmung dunkler Bereiche** im OSD Ihres Monitors reduziert werden. Diese Optionen können die Eingabeverzögerung erhöhen oder zu verwaschenen Schwarztönen führen.
es: El parpadeo por Frecuencia de Actualización Variable, puede ser reducido en algunos monitores usando el **Control VRR** o el **Control de áreas oscuras** en las opciones de configuración de su monitor (OSD). Estas opciones pueden incrementar retardos de entrada o resultar en "Aplastado de Negros" (cruched blacks).
ja: 一部のディスプレイでは、モニターの OSD の **VRR コントロール** または **暗部の微調整** オプションを使用して、VRR ちらつきを軽減できます。 これらのオプションを使用すると、入力ラグが増加したり、黒が潰れてしまう可能性があります。
pl: Migotanie spowodowane zmienną częstotliwością odświeżania (VRR, z ang. Variable Refresh Rate) można zmniejszyć na niektórych wyświetlaczach za pomocą opcji **Sterowanie VRR** (VRR Control) lub **Dostosuj ciemne obszary** (Fine Tune Dark Areas) w menu wyświetlanym na ekranie monitora (menu OSD, z ang. On Screen Display). Opcje te mogą zwiększyć opóźnienie wejściowe lub spowodować modyfikację czerni.
zh_cn: VRR闪烁这个问题在某些显示器上，可以通过你的显示器的OSD中的**VRR控制**或**微调暗区**选项来减少。这些选项可能会增加输入延迟或导致黑色失真。
zh_tw: VRR閃爍這個問題在某些顯示器上，可以通過你的顯示器的OSD中的**VRR控制**或**微調暗區**選項來減少。這些選項可能會增加輸入延遲或導致黑色失真。

source: If using an OLED display, use the **Black (OLED)** editor theme preset in the Editor Settings. This hides VRR flicker thanks to OLED's perfect black levels.
de: Wenn Sie ein OLED-Display verwenden, verwenden Sie die Editor-Theme-Vorgabe **Black (OLED)** in den Editor-Einstellungen. Dadurch wird das VRR-Flackern dank der perfekten Schwarzwerte von OLED ausgeblendet.
es: Si utiliza un monitor basado en **Diodo Orgánico Emisiorde Luz (OLED)**, utilice el tema preestablecido **Black (OLED)** en las opciones del Editor. Esto oculta las fallas del VRR gracias a los niveles oscuros ajustados.
ja: OLED ディスプレイを使用している場合は、エディター設定でプリセットされている **ブラック (OLED)** エディター テーマを使用します。 OLED の完璧な黒レベルのおかげで、VRR のちらつきを隠すことができます。
pl: Jeśli używasz wyświetlacza OLED, użyj predefiniowanego motywu **Czarny (OLED)** w Ustawieniach Edytora. Pozwala to ukryć migotanie VRR dzięki doskonałemu poziomowi czerni OLED (organicznych diod elektroluminescencyjnych, z ang. Organic Light Emitting Diode).
zh_cn: 如果在使用 OLED 显示器，可以在编辑器设置中使用 **Black (OLED)** 预设。因为 OLED 显示器的出色的黑阶表现，这个预设将会有助于减弱 VRR 闪烁。
zh_tw: 如果使用一台OLED顯示器，可以在編輯器設定中使用**黑色（OLED）**預設。因為OLED顯示器的出色的黑階表現，這個預設將會有助於減弱VRR閃爍。

source: The editor or project takes a very long time to start
de: Der Editor oder das Projekt benötigt sehr lange, um zu starten
es: El editor o el proyecto tarda mucho tiempo en iniciar
ja: エディタやプロジェクトの開始に非常に時間がかかります
pl: Uruchomienie edytora lub projektu zajmuje bardzo dużo czasu
zh_cn: 编辑器或项目花了很长时间才启动
zh_tw: 編輯器或專案花了很多時間才打開

source: When using one of the Vulkan-based renderers (Forward+ or Forward Mobile), the first startup is expected to be relatively long. This is because shaders need to be compiled before they can be cached. Shaders also need to be cached again after updating Godot, after updating graphics drivers or after switching graphics cards.
de: Wenn Sie einen der Vulkan-basierten Renderer (Forward+ oder Forward Mobile) verwenden, ist zu erwarten, dass der erste Startvorgang relativ lange dauert. Dies liegt daran, dass Shader kompiliert werden müssen, bevor sie zwischengespeichert werden können. Shader müssen auch nach der Aktualisierung von Godot, nach der Aktualisierung von Grafiktreibern oder nach dem Wechsel der Grafikkarte erneut zwischengespeichert werden.
es: Cuando utilice unos de los renderizadores basados en Vulkan (Forward+ o Forward Mobile), el primer arranque del proyecto puede ser algo largo. Esto es debido a que los Shaders necesitan ser compilados y almacenados en caché luego de actualizar Godot, actualizar los drivers de vídeo o cambiar de tarjeta gráfica.
ja: Vulkanベースのレンダラ (Forward+またはForward Mobile)を使用する場合、最初の起動には比較的時間がかかることが予想されます。これは、シェーダをキャッシュする前にコンパイルする必要があるためです。Godot の更新後、グラフィックス ドライバーの更新後、またはグラフィックス カードの切り替え後も、シェーダーを再度キャッシュする必要があります。
pl: W przypadku korzystania z jednego z rendererów opartych na Vulkan (Forward+ lub Forward Mobile) pierwsze uruchomienie będzie stosunkowo długie. Dzieje się tak dlatego, że moduły cieniujące (shaders), czyli małe fragmenty kody modyfikujące kolory pikseli na pewnym obszarze, np. tworzące realistyczne cienie na trójkątach, muszą zostać skompilowane, zanim będzie można je zapisać w pamięci podręcznej. Moduły cieniujące (powszechne jest też używanie makaronizmu shadery, czytaj "szejdery") muszą być również ponownie buforowane po aktualizacji silnika Godot, po aktualizacji sterowników graficznych lub po zmianie kart graficznych.
zh_cn: 当使用基于Vulkan的渲染器（Forward+ 或 Forward Mobile）时，第一次启动将会话费比较长的时间。这是因为着色器需要在缓存之前进行编译。更新Godot、更新显卡驱动或切换显卡后，着色器也需要重新缓存。
zh_tw: 當使用基於Vulkan的算繪器（Forward+ 或 Forward Mobile）時，第一次啟動將會話費比較長的時間。這是因為著色器需要在快取之前進行編譯。更新Godot、更新顯卡驅動或切換顯卡後，著色器也需要重新快取。

source: If the issue persists after the first startup, this is a `known bug <https://github.com/godotengine/godot/issues/20566>`__ on Windows when you have specific USB peripherals connected. In particular, Corsair's iCUE software seems to cause this bug. Try updating your USB peripherals' drivers to their latest version. If the bug persists, you need to disconnect the specific peripheral before opening the editor. You can then connect the peripheral again.
de: Dies ist ein `bekanntes Problem <https://github.com/godotengine/godot/issues/20566>`__ unter Windows, wenn Sie bestimmte USB-Peripheriegeräte angeschlossen haben. Insbesondere die iCUE-Software von Corsair scheint den Fehler zu verursachen. Aktualisieren Sie die Treiber Ihrer USB-Peripheriegeräte auf die neueste Version. Wenn der Fehler weiterhin besteht, müssen Sie die fehlerhaften Peripheriegeräte trennen, bevor Sie den Editor öffnen. Sie können das Peripheriegerät danach wieder anschließen.
es: Si el problema persiste después del primer arranque, esto es un problema conocido <https://github.com/godotengine/godot/issues/20566>`__ en Windows cuando se tienen conectados periféricos USB específicos. En particular, el software iCUE de Corsair parece ser el causante del fallo. Intenta actualizar los controladores de tus periféricos USB a su última versión. Si el error persiste, debes desconectar los periféricos defectuosos antes de abrir el editor. A continuación, puedes volver a conectar el periférico.
ja: これはWindows上において、特定のUSB周辺機器を接続している場合に発生する\ `既知のバグ <https://github.com/godotengine/godot/issues/20566>`__\ です。特に、Corsair の iCUE ソフトウェアがこのバグの原因となっているようです。USB周辺機器のドライバを最新バージョンにアップデートしてみてください。バグが続く場合は、エディタを開く前に問題のある周辺機器を切断する必要があります。その後、再度周辺機器を接続してください。
zh_cn: 如果这个问题在首次启动后依然存在，那么这是 Windows 上的一个\ `已知错误 <https://github.com/godotengine/godot/issues/20566>`_\，当你连接了特定的 USB 外设时就会出现 。特别是，海盗船的 iCUE 软件似乎引起了该错误。尝试将 USB 外设的驱动程序更新为最新版本。如果错误仍然存在，则需要在打开编辑器之前断开故障外围设备的连接。然后，你可以再次连接外围设备。
zh_tw: 這是在 Windows 上的一個 `已知 Bug <https://github.com/godotengine/godot/issues/20566>`__ ，會發生在有連接到特定 USB 週邊裝置時。特別是 Corsair 的 iCUE 軟體似乎會導致這個問題。請試著更新這些 USB 週邊裝置的驅動程式至最新版本。若仍然遇到此 Bug，則必須在開啟編輯器時先斷開有問題的週邊裝置。開啟後即可重新接上。
