Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/troubleshooting.po
Languages: de, es, ja, pl, zh_cn, zh_tw

source: Firewall software such as Portmaster may also cause the debug port to be blocked. This causes the project to take a long time to start, while being unable to use debugging features in the editor (such as viewing ``print()`` output). You can work this around by changing the debug port used by the project in the Editor Settings (**Network > Debug > Remote Port**). The default is ``6007``; try another value that is greater than ``1024``, such as ``7007``.
de: Firewall-Software wie Portmaster kann ebenfalls dazu führen, daß der Debug-Port blockiert wird. Dies führt dazu, dass das Projekt sehr lange braucht, um zu starten, und gleichzeitig nicht in der Lage ist, die Debugging-Funktionen des Editors zu nutzen (z.B. die ``print()``-Ausgabe anzuzeigen). Sie können dieses Problem umgehen, indem Sie den vom Projekt verwendeten Debug-Port in den Editor-Einstellungen ändern (**Netzwerk > Debuggen > Remote-Port**). Der Standardwert ist ``6007``; versuchen Sie einen anderen Wert, der größer als ``1024`` ist, wie etwa ``7007``.
es: Los cortafuegos como Portmaster también pueden bloquear el puerto de depuración. Esto provoca que el proyecto tarde mucho tiempo en iniciarse, mientras que no se pueden utilizar las funciones de depuración en el editor (como ver la salida ``print()``). Puedes solucionar esto cambiando el puerto de depuración utilizado por el proyecto en la Configuración del Editor (**Red > Depuración > Puerto Remoto**). El valor por defecto es ``6007``; prueba con otro valor que sea mayor que ``1024``, como ``7007``.
zh_cn: Portmaster 等防火墙软件可能会屏蔽调试端口，导致项目启动时间变长，并且无法在编辑器中使用调试功能（例如查看 ``print()`` 的输出）。变通方法是在“编辑器设置”中修改项目所使用的调试端口（\ **网络 > 调试 > 远程端口**\ ）。默认值是 ``6007``\ ；可以尝试设成大于 ``1024`` 的值，比如 ``7007``\ 。

source: The Godot editor appears frozen after clicking the system console
de: Der Godot-Editor scheint einzufrieren, nachdem die Systemkonsole angeklickt wurde
es: El editor de Godot parece congelado después de hacer clic en la consola del sistema
ja: システムコンソールをクリックすると、Godotエディタがフリーズしたように見える
zh_cn: 点击系统控制台后，Godot 编辑器没有响应
zh_tw: 點擊系統主控台後，Godot 編輯器沒有回應

source: When running Godot on Windows with the system console enabled, you can accidentally enable *selection mode* by clicking inside the command window. This Windows-specific behavior pauses the application to let you select text inside the system console. Godot cannot override this system-specific behavior.
de: Wenn Godot unter Windows mit aktivierter Konsole ausgeführt wird, können Sie versehentlich den *Auswahlmodus* aktivieren, indem Sie in das Kommandofenster klicken. Dieses Windows-spezifische Verhalten pausiert die Anwendung und lässt Sie Text innerhalb der Konsole auswählen. Godot kann dieses systemspezifische Verhalten nicht überschreiben.
es: Cuando se corre Godot en Windows con la consola del sistema activada, puedes accidentalmente activar el *Modo de Selección* clickeando a dentro de la ventana de comandos.
ja: システムコンソールが有効な状態でGodotをWindows上で実行しているとき、コマンドウィンドウの内側をクリックすると誤って *選択モード* を有効にしてしまうことがあります。このWindows固有の動作は、システムコンソール内でテキストを選択できるようにアプリケーションを一時停止させます。Godot はこのシステム固有の動作を上書きすることができません。
pl: W przypadku uruchamiania Godota w systemie Windows z włączoną konsolą systemową można przypadkowo włączyć *tryb wyboru*, po kliknięciu okna poleceń. To zachowanie jest specyficzne dla systemu Windows - wstrzymuje aplikację, aby umożliwić zaznaczenie tekstu w konsoli systemowej. Godot nie może nadpisać tego specyficznego dla systemu zachowania.
zh_cn: 在启用了系统控制台的 Windows 上运行 Godot 时，你可以通过在命令窗口中单击来意外启用\ *选择模式*\ 。Windows 的这种特定行为会暂停应用程序，以便你在系统控制台内选择文本。Godot 无法覆盖此系统特定的行为。
zh_tw: 在 Windows 上啟用系統主控台時執行 Godot，可能會不小心在命令視窗內因點擊而啟用了 **選擇模式** 。這個行為只會發生在 Windows 上，會暫停應用程式來讓使用者可選擇系統主控台內的文字。Godot 無法複寫此一系統特定的行為。

source: To solve this, select the system console window and press Enter to leave selection mode.
de: Um dies zu beheben, wählen Sie das Fenster der Systemkonsole aus und drücken Sie Enter, um den Auswahlmodus zu verlassen.
es: Para solucionarlo, seleccione la ventana de la consola del sistema y pulse Intro para salir del modo de selección.
ja: これを解決するには、システムコンソールウィンドウを選択し、Enterキーを押して選択モードを解除します。
pl: Aby rozwiązać ten problem, wybierz okno konsoli systemowej i naciśnij klawisz Enter, aby opuścić tryb wyboru.
zh_cn: 要解决此问题，请选择系统控制台窗口，然后按 Enter 退出选择模式。
zh_tw: 要解決此問題，請選擇系統主控台視窗，並按一下 Enter 鍵來離開選擇模式。

source: The Godot editor's macOS dock icon gets duplicated every time it is manually moved
de: Das Icon des Godot-Editors im macOS-Dock wird jedes Mal dupliziert, wenn es manuell verschoben wird
es: El ícono de la barra del Editor de Godot en macOS se duplica siempre cuando es movido manualmente
ja: Godot エディタの macOS ドック アイコンを移動するたびに複製される
pl: Ikona edytora Godot na dock'u w macOS zostaje zduplikowana za każdym razem, gdy jest przenoszona ręcznie
zh_cn: 手动移动Godot编辑器的macOS dock 图标之后，会出现多余的编辑器图标
zh_tw: 手動移動Godot編輯器的macOS dock 圖示之後，會出現多餘的編輯器圖示

source: If you open the Godot editor and manually change the position of the dock icon, then restart the editor, you will get a duplicate dock icon all the way to the right of the dock.
de: Wenn Sie den Godot-Editor öffnen und die Position des Dock-Icons manuell ändern und dann den Editor neu starten, erhalten Sie ein doppeltes Dock-Icon ganz rechts im Dock.
es: Si abre el Editor de Godot y manualmente cambia la posición del ícono de la ventana, entonces reinicie el Editor, obtendrá un ícono duplicado totalmente a la derecha de la ventana.
ja: Godot エディタを開いてドック アイコンの位置を手動で変更し、エディタを再起動すると、ドックの右側に複製のドック アイコンが表示されます。
pl: Jeśli otworzysz edytor Godot i ręcznie zmienisz pozycję ikony dock'u, a następnie zrestartujesz edytor, otrzymasz zduplikowaną ikonę edytora na samym końcu dock'u, po prawej stronie.
zh_cn: 如果你打开 Godot 编辑器并手动改变 dock 图标的位置，然后重启编辑器，你会在 dock 的最右边看到一个重复的 dock 图标。
zh_tw: 如果你打開 Godot 編輯器並手動改變 dock 圖示的位置，然後重啟編輯器，你會在 dock 的最右邊看到一個重複的 dock 圖示。

source: This is due to a design limitation of the macOS dock. The only known way to resolve this would be to merge the project manager and editor into a single process, which means the project manager would no longer spawn a separate process when starting the editor. While using a single process instance would bring several benefits, it isn't planned to be done in the near future due to the complexity of the task.
de: Dies ist auf eine Designbeschränkung des macOS-Docks zurückzuführen. Die einzige bekannte Möglichkeit, dies zu beheben, wäre, den Projektmanager und den Editor in einem einzigen Prozess zusammenzufassen, was bedeutet, dass der Projektmanager beim Starten des Editors keinen separaten Prozess mehr starten würde. Obwohl die Verwendung einer einzigen Prozessinstanz mehrere Vorteile mit sich bringen würde, ist dies aufgrund der Komplexität der Aufgabe nicht für die nahe Zukunft geplant.
es: Esto se debe a una limitación del diseño de ventanas en macOS. La única vía conocida para resolver esto, sería unir el Proyect Manager y el Editor en un sólo proceso, lo que significa que el Proyect Manager no podrá ser separado en un proceso independiente cuando el Editor se inicialice. Mineras usar un sólo proceso puede traer varios beneficios, no está planificado implementarlo próximamente, debido a la complejidad de la tarea.
ja: これは、macOS ドックの設計制限によるものです。 これを解決する唯一の方法は、プロジェクト マネージャーとエディターを 1 つのプロセスにマージすることです。これは、プロジェクト マネージャーがエディターの起動時に別のプロセスを生成しなくなることを意味します。 単一のプロセス インスタンスを使用するといくつかの利点が得られますが、タスクが複雑であるため、近い将来には使用される予定はありません。
pl: Jest to spowodowane ograniczeniem projektowym dock'u w macOS. Jedynym znanym sposobem rozwiązania tego problemu byłoby połączenie menedżera projektu i edytora w jeden proces, co oznaczałoby, że menedżer projektu nie tworzyłby już osobnego procesu podczas uruchamiania edytora. Chociaż korzystanie z jednego procesu przyniosłoby wiele korzyści, zadanie to nie jest planowane na najbliższą przyszłość ze względu na swoją złożoność.
zh_cn: 这是由于 macOS dock 的设计限制造成的。解决这个问题的唯一已知方法是将项目管理器和编辑器合并为一个进程，这意味着项目管理器在启动编辑器时不再产生一个单独的进程。虽然使用单一进程实例会带来一些好处，但由于任务的复杂性，完成这个功能没有列入我们近期的工作计划。
zh_tw: 這是由於 macOS dock 的設計限制造成的。解決這個問題的唯一已知方法是將專案管理器和編輯器合併為一個程序，這意味著專案管理器在啟動編輯器時不再產生一個單獨的程序。雖然使用單一程序實例會帶來一些好處，但由於工作的複雜性，完成這個功能沒有列入我們近期的工作計畫。

source: To avoid this issue, keep the Godot editor's dock icon at its default location as created by macOS.
de: Um dieses Problem zu vermeiden, belassen Sie das Dock-Icon des Godot-Editors an dem Ort, an dem es standardmäßig von macOS erstellt wurde.
es: Para evitar este problema, el icono de la ventana del Editor en su posición original tal como lo crea macOS.
ja: この問題を回避するには、Godot エディタのドック アイコンを macOS によって作成されたデフォルトの場所に維持します。
pl: By uniknąć tego problemu, zachowaj ikonę edytora Godot w jej domyślnym położeniu, takim jakie zostało utworzone przez system macOS.
zh_cn: 为了避免这个问题，保持 Godot 编辑器的 dock 图标在 macOS 创建的默认位置。
zh_tw: 為了避免這個問題，保持 Godot 編輯器的 dock 圖示在 macOS 建立的預設位置。

source: Some text such as "NO DC" appears in the top-left corner of the Project Manager and editor window
de: Einige Texte wie „NO DC“ werden in der oberen linken Ecke des Projektmanagers und des Editorfensters angezeigt
es: Un texto como "NO DC" aparece en la esquina superior izquierda de la ventana del Administrador de Proyectos y del editor
ja: 「NO DC」などの文字は稀にプロジェクトマネージャーやエディターの左上に現れることがあります。
zh_cn: 在项目管理器和编辑器窗口的左上角出现“NO DC”之类的文本
zh_tw: 在專案管理員與編輯器視窗左上角出現"NO DC"之類的文字

source: This is caused by the NVIDIA graphics driver injecting an overlay to display information.
de: Dies wird durch den NVIDIA-Grafiktreiber verursacht, der ein Overlay zur Anzeige von Informationen einfügt.
es: Esto es causado por el controlador de gráficos de NVIDIA que inserta una superposición para mostrar información.
ja: これは、NVIDIAグラフィックスドライバが情報を表示するためにオーバーレイを挿入することが原因です。
pl: Jest to spowodowane przez sterownik graficzny NVIDIA stosujący nakładkę w celu wyświetlenia informacji.
zh_cn: 这是由于 NVIDIA 显卡驱动程序注入了覆盖显示信息造成的。
zh_tw: 這是由於NVIDIA顯卡驅動程式注入了覆蓋顯示資訊造成的。

source: To disable this overlay on Windows, restore your graphics driver settings to the default values in the NVIDIA Control Panel.
de: Um dieses Overlay unter Windows zu deaktivieren, setzen Sie die Grafiktreibereinstellungen in der NVIDIA-Systemsteuerung auf die Default-Werte zurück.
es: Para desactivar esta superposición en Windows, restablece tu configuración del controlador de gráficos a los valores predeterminados en el panel de control de NVIDIA.
ja: Windowsでこのオーバーレイを無効にするには、NVIDIA Control Panelでグラフィックドライバーの設定をデフォルト値に戻してください。
pl: Aby wyłączyć tę nakładkę w systemie Windows, przywróć ustawienia sterownika graficznego do wartości domyślnych w Panelu sterowania NVIDIA.
zh_cn: 要在 Windows 上禁用此覆盖，请在 NVIDIA 控制面板中将图形驱动程序设置恢复为默认值。
zh_tw: 要在Windows上禁用此覆蓋，請在NVIDIA控制台中將圖形驅動程式設定恢復為預設值。

source: To disable this overlay on Linux, open ``nvidia-settings``, go to **X Screen 0 > OpenGL Settings** then uncheck **Enable Graphics API Visual Indicator**.
de: Um dieses Overlay unter Linux zu deaktivieren, öffnen Sie ``nvidia-settings``, gehen Sie zu **X Screen 0 > OpenGL Settings** und entfernen Sie das Häkchen bei **Enable Graphics API Visual Indicator**.
es: Para desactivar esta superposición en Linux, abre ``nvidia-settings``, ve a **X Screen 0 > OpenGL Settings** y desmarca **Enable Graphics API Visual Indicator**.
ja: Linuxでこのオーバーレイを無効にするには、 ``nvidia-settings`` を開き、 **X Screen 0 > OpenGL Settings** を選択し、 **Enable Graphics API Visual Indicator** のチェックを外します。
pl: Aby wyłączyć tą nakładkę na systemie Linux otwórz ``nvidia-settings`` , przejdź do **X Screen 0 > OpenGL Settings** potem odznacz **Enable Graphics API Visual Indicator**.
zh_cn: 要在 Linux 上禁用此覆盖，请打开 ``nvidia-settings``\ ，转到 **X Screen 0 > OpenGL Settings**\ ，然后取消选中 **Enable Graphics API Visual Indicator**\ 。
zh_tw: 要在Linux上禁用此覆蓋，請打開``nvidia-settings``，轉到**X Screen 0 > OpenGL Settings**，然後取消選中**Enable Graphics API Visual Indicator**。

source: The editor or project appears overly sharp or blurry
de: Der Editor oder das Projekt erscheint übermäßig scharf oder unscharf
es: El editor o el proyecto se ve muy pixelado o desenfocado
ja: エディターやプロジェクトが過度にぼやけたり鋭く見える
pl: Wygląd edytora lub projektu jest za ostry lub rozmyty
zh_cn: 编辑器或项目显示得过于锐利或模糊
zh_tw: 編輯器或專案顯示看起來過於銳利或模糊

source: Correct appearance (left), oversharpened appearance due to graphics driver sharpening (right)
de: Korrektes Aussehen (links), überscharfes Aussehen aufgrund der Schärfung durch den Grafiktreiber (rechts)
es: Apariencia correcta (izquierda), apariencia sobre afilada debido a afilado por controladores graficos (derecha)"
ja: 正しい外観 (左)、グラフィックス ドライバーのシャープ化によるオーバーシャープな外観 (右)
pl: Właściwy wygląd (lewy), przeostrzony wygląd przez wyostrzenie sterownika graficznego (prawy)
zh_cn: 正确的外观（左），由于显卡驱动的锐化而导致的过度锐化的外观（右）
zh_tw: 正確的外觀（左），由於顯卡驅動的銳化而導致的過度銳化的外觀（右）

source: If the editor or project appears overly sharp, this is likely due to image sharpening being forced on all Vulkan or OpenGL applications by your graphics driver. You can disable this behavior in the graphics driver's control panel:
de: Wenn der Editor oder das Projekt übermäßig scharf erscheint, liegt das wahrscheinlich daran, dass Ihr Grafiktreiber die Bildschärfung für alle Vulkan- oder OpenGL-Anwendungen erzwingt. Sie können dieses Verhalten in der Systemsteuerung des Grafiktreibers deaktivieren:
es: Si el editor o proyecto aparece demasiado nítido, es probable que se deba a que el controlador de gráficos forzó la nitidez de la imagen en todas las aplicaciones Vulkan u OpenGL. Puede desactivar este comportamiento en el panel de control del controlador gráfico:
ja: エディターまたはプロジェクトが過度に鮮明に見える場合は、グラフィックス ドライバーによってすべての Vulkan または OpenGL アプリケーションで画像の鮮明化が強制されていることが原因である可能性があります。 この動作は、グラフィックス ドライバーのコントロール パネルで無効にすることができます。
pl: Jeśli edytor lub projekt wygląna na przeostrzony, prawdopodobnie jest to spowodowane wymuszeniem wyostrzenia na wszystkich aplikacjach Vulkan lub OpenGL przez sterownik graficzny. Możesz to wyłączyć w panelu controlnym sterownika graficznego:
zh_cn: 如果编辑器或项目看起来过于锐利，这可能是由于你的图形驱动程序强制对所有 Vulkan 或 OpenGL 应用程序进行图像锐化。你可以在图形驱动程序的控制面板中禁用此行为：
zh_tw: 如果編輯器或專案看起來過於銳利，這可能是由於你的圖形驅動程式強制對所有 Vulkan 或 OpenGL 應用程式進行圖像銳化。你可以在圖形驅動程式的控制台中禁用此行為：

source: **NVIDIA (Windows):** Open the start menu and choose **NVIDIA Control Panel**. Open the **Manage 3D settings** tab on the left. In the list in the middle, scroll to **Image Sharpening** and set it to **Sharpening Off**.
de: **NVIDIA (Windows):** Öffnen Sie das Startmenü und wählen Sie **NVIDIA Systemsteuerung**. Öffnen Sie den Tab **3D-Einstellungen verwalten** auf der linken Seite. Blättern Sie in der Liste in der Mitte zu **Bildschärfung** und setzen Sie sie auf **Schärfung aus**.
es: **NVIDIA (Windows):** Abra el menu de inicio y escoja **NVIDIA Control Panel**. Abra la pestaña de **Manage 3D settings** a la izquierda. En la lista, localice **Image Sharpening** y ajústelo a **Sharpening Off**.
ja: **NVIDIA (Windows):** スタート メニューを開き、**NVIDIA コントロール パネル** を選択します。 左側の **3D 設定の管理** タブを開きます。 中央のリストで、**画像の鮮明化**までスクロールし、**鮮明化オフ**に設定します。
pl: **NVIDIA (Windows):** Otwórz menu start i wybierz **NVIDIA Control Panel**. Otwórz **Manage 3D settings** zakładka po lewej. Na środkowej liście przejedź do **Image Sharpening** i ustaw to na **Sharpening Off**.
zh_cn: **NVIDIA（Windows）：** 打开"开始"菜单，选择“NVIDIA 控制面板”。打开左侧的**管理 3D 设置**选项卡。在中间的列表中，滚动到**图像锐化**，并将其设置为**关闭锐化**。
zh_tw: **NVIDIA（Windows）：** 打開"開始"功能表，選擇“NVIDIA 控制台”。打開左側的**管理 3D 設定**分頁。在中間的列表中，滾動到**圖像銳化**，並將其設定為**關閉銳化**。

source: **AMD (Windows):** Open the start menu and choose **AMD Software**. Click the settings "cog" icon in the top-right corner. Go to the **Graphics** tab then disable **Radeon Image Sharpening**.
de: **AMD (Windows):** Öffnen Sie das Startmenü und wählen Sie **AMD Software**. Klicken Sie auf das „Zahnrad“-Icon für die Einstellungen in der oberen rechten Ecke. Gehen Sie auf den Tab **Grafik** und deaktivieren Sie **Radeon Image Sharpening**.
es: **AMD (Windows):** Abre el menú de inicio y selecciona **AMD Software**. Haz clic en el ícono de "engranaje" de configuración en la esquina superior derecha. Ve a la pestaña de **Gráficos** y desactiva **Radeon Image Sharpening**.
ja: **AMD (Windows):** スタート メニューを開き、**AMD ソフトウェア** を選択します。 右上隅にある設定の「歯車」アイコンをクリックします。 [**グラフィックス**] タブに移動し、**Radeon Image Sharpening** を無効にします。
pl: **AMD (Windows):** Otwórz menu start i wybierz **AMD Software**. Kliknij na trybik ustawień w prawym górnym rogu. Przejdź do zakładki **Graphics** i wyłącz **Radeon Image Sharpening**.
zh_cn: **AMD（Windows）：**打开开始菜单，选择**AMD 软件**。点击右上角的设置 "齿轮 "图标。转到“**图形**”选项卡，然后禁用“**Radeon 图像锐化**”。
zh_tw: **AMD（Windows）：**打開開始功能表，選擇**AMD 軟體**。點擊右上角的設定 "齒輪 "圖示。轉到“**圖形**”分頁，然後禁用“**Radeon 圖像銳化**”。

source: If the editor or project appears overly blurry, this is likely due to :abbr:`FXAA (Fast Approximate AntiAliasing)` being forced on all Vulkan or OpenGL applications by your graphics driver.
de: Wenn der Editor oder das Projekt übermäßig unscharf erscheint, liegt das wahrscheinlich daran, dass Ihr Grafiktreiber `FXAA (Fast Approximate AntiAliasing)` für alle Vulkan- oder OpenGL-Anwendungen erzwingt.
es: Si el editor o el proyecto se ve demasiado borroso, puede ser a causa del :abbr:`FXAA (Fast Approximate AntiAliasing)` siendo forzado a todas las aplicaciones OpenGL o Vulkan por tu controlador de gráficos.
ja: エディターまたはプロジェクトが過度にぼやけて見える場合は、グラフィックス ドライバーによってすべての Vulkan または OpenGL アプリケーションに :abbr:`FXAA (Fast Average AntiAliasing)` が強制されていることが原因である可能性があります。
pl: Jeśli edytor lub projekt jest rozmazany, może być to spowodowane :abbr:`FXAA (Fast Approximate AntiAliasing)` bedącym wymuszanym na wszystkich aplikacjach Vulkan lub OpenGL przez twój sterownik Graficzny.
zh_cn: 如果编辑器或者项目看起来过于模糊，这可能是由于 :abbr:`FXAA (Fast Approximate AntiAliasing)` 被你的显卡驱动强制应用到所有的 Vulkan 或者 OpenGL 应用程序上。
zh_tw: 如果編輯器或者專案看起來過於模糊，這可能是由於 :abbr:`FXAA (Fast Approximate AntiAliasing)` 被你的顯卡驅動強制應用到所有的 Vulkan 或者 OpenGL 應用程式上。

source: **NVIDIA (Windows):** Open the start menu and choose **NVIDIA Control Panel**. Open the **Manage 3D settings** tab on the left. In the list in the middle, scroll to **Fast Approximate Antialiasing** and set it to **Application Controlled**.
de: **NVIDIA (Windows):** Öffnen Sie das Startmenü und wählen Sie **NVIDIA Systemsteuerung**. Öffnen Sie den Tab **3D-Einstellungen verwalten** auf der linken Seite. Blättern Sie in der Liste in der Mitte zu **Schnelles approximatives Antialiasing** und setzen Sie es auf **Anwendungsgesteuert**.
es: **NVIDIA (Windows):** Abre el menú de inicio y selecciona **Panel de Control de NVIDIA**. Abre la pestaña **Administrar configuración 3D** a la izquierda. En la lista del medio, desplázate hasta **Antialiasing Aproximado Rápido** y ajústalo a **Controlado por la Aplicación**.
ja: **NVIDIA (Windows):** スタート メニューを開き、**NVIDIA コントロール パネル** を選択します。 左側の **3D 設定の管理** タブを開きます。 中央のリストで、**アンチエイリアシング - FXAA**までスクロールし、**アプリケーションによるコントロール**に設定します。
pl: **NVIDIA (Windows):** Otwórz menu start i wybierz **NVIDIA Control Panel**. Otwórz zakładkę **Manage 3D settings** po lewej. Na środkowej liście, przejedź do **Fast Approximate Antialiasing** i ustaw to na **Application Controlled**.
zh_cn: **NVIDIA（Windows）：**\ 打开开始菜单并选择\ **NVIDIA 控制面板**\ 。打开左侧的\ **管理 3D 设置**\ 选项卡。在中间的列表中， 滚动到\ **平滑设置 - FXAA**\ 并将其设置为\ **应用程序控制的**\ 。
zh_tw: **NVIDIA（Windows）：** 打開開始功能表並選擇 **NVIDIA 控制台** 。打開左側的 **管理 3D 設定** 分頁。在中間的列表中， 滾動到 **平滑設定 - FXAA** 並將其設定為 **應用程式控制的** 。

source: **NVIDIA (Linux):** Open the applications menu and choose **NVIDIA X Server Settings**. Select to **Antialiasing Settings** on the left, then uncheck **Enable FXAA**.
de: **NVIDIA (Linux):** Öffnen Sie das Anwendungsmenü und wählen Sie **NVIDIA X Server Settings**. Wählen Sie auf der linken Seite **Antialiasing-Einstellungen** und deaktivieren Sie dann **FXAA aktivieren**.
es: **NVIDIA (Linux):** Abre el menú de aplicaciones y selecciona **Configuración de NVIDIA X**. Elige **Configuración de Antialiasing** a la izquierda y desmarca **Habilitar FXAA**.
ja: **NVIDIA (Linux):**アプリケーションを開き **NVIDIA X Server Settings**の項目を開きます。その後左側の **Antialiasing Settings**を選び、**Enable FXAA**という項目をオフにしてください。
pl: **NVIDIA (Linux):** Otwórz menu aplikacji i wybierz **NVIDIA X Server Settings**. Wybierz **Antialiasing Settings** po lewej, i odznacz **Enable FXAA**.
zh_cn: **NVIDIA（Linux）：**\ 打开应用程序菜单，选择 **NVIDIA X 服务器设置**\ 。在左侧选择 **Antialiasing Settings**\ ，取消对 **Enable FXAA** 的勾选。
zh_tw: **NVIDIA（Linux）：** 打開應用程式功能表，選擇 **NVIDIA X 伺服器設定** 。在左側選擇 **Antialiasing Settings** ，取消對 **Enable FXAA** 的勾選。

source: **AMD (Windows):** Open the start menu and choose **AMD Software**. Click the settings "cog" icon in the top-right corner. Go to the **Graphics** tab, scroll to the bottom and click **Advanced** to unfold its settings. Disable **Morphological Anti-Aliasing**.
de: **AMD (Windows):** Öffnen Sie das Startmenü und wählen Sie **AMD Software**. Klicken Sie auf das „Zahnrad“-Icon für die Einstellungen in der oberen rechten Ecke. Gehen Sie zum Tab **Grafik**, scrollen Sie nach unten und klicken Sie auf **Erweitert**, um die Einstellungen auszuklappen. Deaktivieren Sie **Morphologisches Anti-Aliasing**.
es: **AMD (Windows):** Abre el menú Inicio y selecciona **Software AMD**. Haz clic en el ícono de configuración "engranaje" en la esquina superior derecha. Ve a la pestaña **Gráficos**, desplázate hacia abajo y haz clic en **Avanzado** para expandir la configuración. Desactiva **Suavizado morfológico**.
pl: **AMD (Windows):** Otwórz menu start i wybierz **AMD Software**. Kliknij na trybik ustawień w prawym górnym rogu. Przejdź do zakładki **Graphics**, przejedź na dół i kliknij **Advanced** aby rozwinąć te ustawienia. Wyłącz **Morphological Anti-Aliasing**.
zh_cn: **AMD (Windows):** 打开开始菜单并选择**AMD 软件**。单击 设置右上角的“齿轮”图标。转到**图形**选项卡， 滚动到底部并单击**高级**以展开其设置。禁用**形态抗锯齿**。
zh_tw: **AMD (Windows):** 打開開始功能表並選擇**AMD 軟體**。按一下 設定右上角的“齒輪”圖示。轉到**圖形**分頁， 滾動到底部並按一下**高級**以展開其設定。禁用**形態抗鋸齒**。

source: Third-party vendor-independent utilities such as vkBasalt may also force sharpening or FXAA on all Vulkan applications. You may want to check their configuration as well.
de: Herstellerunabhängige Dienstprogramme von Drittanbietern wie vkBasalt erzwingen möglicherweise auch Schärfung oder FXAA für alle Vulkan-Anwendungen. Sie sollten auch deren Konfiguration überprüfen.
es: Utilidades de terceros independientes de proveedores, como vkBasalt, también pueden forzar la nitidez o el FXAA en todas las aplicaciones Vulkan. Es posible que tambien desees verificar su configuración.
ja: vkBasaltのようなサードパーティ製のユーティリティもまた、すべてのVulkanアプリケーションにおいて鮮明化を強制したりFXAAを有効にする可能性があります。それらツールの設定も確認しておくと良いでしょう。
pl: Narzęcia ze źródeł zewnętrrznych takie jak vkBasalt także mogą wymuszać wyostrzanie lub FXAA na wszystkich aplikacjach Vulkan. Możesz także sprawdzić ich konfiguracje.
zh_cn: 像是 vkBasalt 这种第三方开发的供应的工具可能会强迫所有的 Vulkan 应用程序开启锐化或者 FXAA。你可能也需要检查他们的设置。
zh_tw: 像是 vkBasalt 這種協力廠商開發的供應的工具可能會強迫所有的 Vulkan 應用程式開啟銳化或者 FXAA。你可能也需要檢查他們的設定。

source: After changing options in the graphics driver or third-party utilities, restart Godot to make the changes effective.
de: Nach dem Ändern von Optionen im Grafiktreiber oder in Dienstprogrammen von Drittanbietern müssen Sie Godot neu starten, damit die Änderungen wirksam werden.
es: Luego de cambiar las opciones en el controlador gráfico o las herramientas de terceros para ello, reinicie Godot para hacer los cambios efectivos.
ja: グラフィックスドライバーやサードパーティ製ユーティリティーのオプションを変更した後、Godotを再起動して変更を有効にします。
pl: Po zmianach opcji sterownika graficznego lub narzędzi zewnętrzych, uruchom Godot ponownie aby zobaczyć ich efekt.
zh_cn: 当你变更过了显卡驱动和第三方工具中的设置后，重启 Godot 去应用这些设置。
zh_tw: 當你變更過了顯卡驅動和協力廠商工具中的設定後，重啟 Godot 去應用這些設定。
