Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/troubleshooting.po
Languages: de, es, ja, pl, zh_cn, zh_tw

source: If you still wish to force sharpening or FXAA on other applications, it's recommended to do so on a per-application basis using the application profiles system provided by graphics drivers' control panels.
de: Wenn Sie dennoch die Schärfung oder FXAA für andere Anwendungen erzwingen möchten, empfiehlt es sich, dies für jede Anwendung einzeln zu tun, indem Sie das System der Anwendungsprofile verwenden, das von den Bedienfeldern der Grafiktreiber bereitgestellt wird.
es: Si aún deseas aplicar la nitidez o el FXAA de forma forzada en otras aplicaciones, se recomienda hacerlo de manera individualizada utilizando el sistema de perfiles de aplicaciones proporcionado por los paneles de control de los controladores de gráficos.
ja: それでも他のアプリケーションで鮮明化の強制やFXAAを使用したい場合は、グラフィックスドライバーのコントロールパネルでアプリケーション毎に設定することを推奨します。
pl: Jeśli porządasz wymagania wyostrzenia lub FXAA dla innych aplikacji, zaleca się aby zrobić to w danuch aplikacjach używając ich profili w panelu sterowania sterownika graficznego.
zh_cn: 如果你仍然希望在其他应用程序上强制锐化或 FXAA，建议你使用显卡驱动控制面板提供的应用程序配置系统，针对每个应用程序的进行设置。
zh_tw: 如果您仍然希望在其他應用程式上強制銳化或 FXAA，建議你使用顯卡驅動控制台提供的應用程式配置系統，針對每個應用程式的進行設定。

source: The editor or project appears to have washed out colors
de: Der Editor oder das Projekt scheint ausgewaschene Farben zu haben
es: El editor o el proyecto parece tener los colores apagados
zh_cn: 此编辑器或项目看起来颜色很淡
zh_tw: 此編輯器或專案看起來顏色很淡

source: On Windows, this is usually caused by incorrect OS or monitor settings, as Godot currently does not support :abbr:`HDR (High Dynamic Range)` *output* (even though it may internally render in HDR).
de: Unter Windows wird dies in der Regel durch falsche Betriebssystem- oder Monitoreinstellungen verursacht, da Godot derzeit keine :abbr:`HDR (High Dynamic Range)`-*Ausgabe* unterstützt (auch wenn es intern in HDR rendern kann).
es: En Windows esto suele deberse a una configuración incorrecta del SO o del monitor, ya que Godot no soporta actualmente *salida* :abbr:`HDR (High Dynamic Range)` (aunque internamente puede renderizar en HDR).
ja: Windowsでは、これは多くの場合OSやモニターの設定が不正なために発生します。Godotは現在 :abbr:`HDR (ハイダイナミックレンジ)` *出力*をサポートしていません(内部処理にHDRを使用する場合もありますが)。
pl: Na Windowsie, jest to zazwyczaj spowodowane przez złe ustawienia systemu bądź monitora, jako że Godot aktualnie nie wspiera :abbr:`HDR (High Dynamic Range)` (nawet jeśli może wewnętrznie renderować w HDR).
zh_cn: 在 Windows 上，这通常是由不正确的操作系统或显示器设置引起的，因为 Godot 目前不支持 :abbr:`HDR (High Dynamic Range)` *输出*\ （即使它可能在内部以 HDR 渲染）。
zh_tw: 在 Windows 上，這通常是由不正確的作業系統或顯示器設定引起的，因為 Godot 目前不支援 :abbr:`HDR (High Dynamic Range)` *輸出* （即使它可能在內部以 HDR 算繪）。

source: As `most displays are not designed to display SDR content in HDR mode <https://tftcentral.co.uk/articles/heres-why-you-should-only-enable-hdr-mode-on-your-pc-when-you-are-viewing-hdr-content>`__, it is recommended to disable HDR in the Windows settings when not running applications that use HDR output. On Windows 11, this can be done by pressing :kbd:`Windows + Alt + B` (this shortcut is part of the Xbox Game Bar app). To toggle HDR automatically based on applications currently running, you can use `AutoActions <https://github.com/Codectory/AutoActions>`__.
de: Da `die meisten Bildschirme nicht für die Anzeige von SDR-Inhalten im HDR-Modus <https://tftcentral.co.uk/articles/heres-why-you-should-only-enable-hdr-mode-on-your-pc-when-you-are-viewing-hdr-content>`__ ausgelegt sind, wird empfohlen, HDR in den Windows-Einstellungen zu deaktivieren, wenn keine Anwendungen ausgeführt werden, die HDR-Ausgabe verwenden. Unter Windows 11 kann dies mit der Tastenkombination :kbd:`Windows + Alt + B` erfolgen (diese Tastenkombination ist Teil der Xbox Game Bar App). Um HDR automatisch basierend auf den laufenden Anwendungen ein- und auszuschalten, können Sie `AutoActions <https://github.com/Codectory/AutoActions>`__ verwenden.
es: Como `la mayoría de las pantallas no están diseñadas para mostrar contenido SDR en modo HDR <https://tftcentral.co.uk/articles/heres-why-you-should-only-enable-hdr-mode-on-your-pc-when-you-are-viewing-hdr-content>`__, se recomienda desactivar HDR en la configuración de Windows cuando no se ejecuten aplicaciones que utilicen salida HDR. En Windows 11, esto se puede hacer pulsando :kbd:`Windows + Alt + B` (este atajo forma parte de la aplicación Xbox Game Bar). Para activar HDR automáticamente según las aplicaciones que se estén utilizando, puedes usar `AutoActions <https://github.com/Codectory/AutoActions>`__.
pl: Ponieważ `większość wyświetlaczy nie jest zaprojektowana do wyświetlania treści SDR w trybie HDR <https://tftcentral.co.uk/articles/heres-why-you-should-only-enable-hdr-mode-on-your-pc-when-you-are-viewing-hdr-content>`__, zaleca się wyłączenie HDR w ustawieniach systemu Windows, gdy nie są uruchomione aplikacje korzystające z wyjścia HDR. W systemie Windows 11 można to zrobić, naciskając :kbd:`Windows + Alt + B` (ten skrót jest częścią aplikacji Xbox Game Bar). Aby automatycznie przełączać HDR w oparciu o aktualnie uruchomione aplikacje, można użyć `AutoActions <https://github.com/Codectory/AutoActions>`__.
zh_cn: 由于`大多数显示器并非被设计为在 HDR 模式下显示 SDR 内容<https://tftcentral.co.uk/articles/heres-why-you-should-only-enable-hdr-mode-on-your-pc-when-you-are-viewing-hdr-content>`，建议在未运行应用程序时在Windows设置中禁用HDR 使用 HDR 输出。在 Windows11 上，可以通过按下 :kbd:`Windows + Alt + B` （此快捷方式是 Xbox Game Bar 应用程序的一部分）。如果要自动开关HDR模式的话，你可以使用 `AutoActions <https://github.com/Codectory/AutoActions>` 。
zh_tw: 由於`大多數顯示器並非被設計為在 HDR 模式下顯示 SDR 內容<https://tftcentral.co.uk/articles/heres-why-you-should-only-enable-hdr-mode-on-your-pc-when-you-are-viewing-hdr-content>`，建議在未運作應用程式時在Windows設定中禁用HDR 使用 HDR 輸出。在 Windows11 上，可以通過按下 :kbd:`Windows + Alt + B` （此快捷方式是 Xbox Game Bar 應用程式的一部分）。如果要自動開關HDR模式的話，你可以使用 `AutoActions <https://github.com/Codectory/AutoActions>` 。

source: If you insist on leaving HDR enabled, it is possible to somewhat improve the result by ensuring the display is configured to use :abbr:`HGIG (HDR Gaming Interest Group)` tonemapping (as opposed to :abbr:`DTM (Dynamic Tone Mapping)`), then `using the Windows HDR calibration app <https://support.microsoft.com/en-us/windows/calibrate-your-hdr-display-using-the-windows-hdr-calibration-app-f30f4809-3369-43e4-9b02-9eabebd23f19>`__. It is also strongly recommended to use Windows 11 instead of Windows 10 when using HDR. The end result will still likely be inferior to disabling HDR on the display, though.
de: Wenn Sie darauf bestehen, HDR aktiviert zu lassen, ist es möglich, das Ergebnis etwas zu verbessern, indem Sie sicherstellen, dass der Bildschirm so konfiguriert ist, dass er :abbr:`HGIG (HDR Gaming Interest Group)`-Tonemapping verwendet (im Gegensatz zu :abbr:`DTM (Dynamic Tone Mapping)`), und dann `die Windows HDR-Kalibrierungs-App <https://support.microsoft.com/en-us/windows/calibrate-your-hdr-display-using-the-windows-hdr-calibration-app-f30f4809-3369-43e4-9b02-9eabebd23f19>`__ verwenden. Es wird auch dringend empfohlen, Windows 11 anstelle von Windows 10 zu verwenden, wenn Sie HDR verwenden. Das Endergebnis wird aber wahrscheinlich immer noch schlechter sein als die Deaktivierung von HDR auf dem Bildschirm.
es: Si insistes en dejar el HDR activado, es posible mejorar algo el resultado asegurándote de que la pantalla está configurada para usar el mapeado tonal :abbr:`HGIG (HDR Gaming Interest Group)` (en lugar de :abbr:`DTM (Dynamic Tone Mapping)`), y luego `usando la app de calibración HDR de Windows <https://support.microsoft.com/en-us/windows/calibrate-your-hdr-display-using-the-windows-hdr-calibration-app-f30f4809-3369-43e4-9b02-9eabebd23f19>`__. También se recomienda encarecidamente utilizar Windows 11 en lugar de Windows 10 cuando se utiliza HDR. Sin embargo, el resultado final seguirá siendo inferior a desactivar HDR en la pantalla.
pl: Jeśli nalegasz na pozostawienie włączonego HDR, możliwe jest pewne poprawienie wyniku poprzez upewnienie się, że wyświetlacz jest skonfigurowany do korzystania z :abbr:`HGIG (HDR Gaming Interest Group)` tonemapping (w przeciwieństwie do :abbr:`DTM (Dynamic Tone Mapping)`), a następnie `użycie aplikacji kalibracyjnej Windows HDR <https://support.microsoft.com/en-us/windows/calibrate-your-hdr-display-using-the-windows-hdr-calibration-app-f30f4809-3369-43e4-9b02-9eabebd23f19>`__. Zdecydowanie zaleca się również korzystanie z systemu Windows 11 zamiast Windows 10 podczas korzystania z HDR. Rezultat końcowy będzie jednak prawdopodobnie gorszy niż wyłączenie HDR na wyświetlaczu.
zh_cn: 如果你坚持要启用 HDR 模式， 也有一些方法可以改善显示效果，确保显示器被设置为启用 :abbr:`HGIG (HDR Gaming Interest Group)` 色调映射(而不是 :abbr:`DTM (Dynamic Tone Mapping)` 色调映射)， 之后 `使用 Windows HDR 校准应用<https://support.microsoft.com/en-us/windows/calibrate-your-hdr-display-using-the-windows-hdr-calibration-app-f30f4809-3369-43e4-9b02-9eabebd23f19>` 。在使用HDR时，强烈建议使用Windows 11而不是Windows 10。 不过，最终结果仍然可能不如在显示器上禁用HDR。
zh_tw: 如果你堅持要啟用 HDR 模式， 也有一些方法可以改善顯示效果，確保顯示器被設定為啟用 :abbr:`HGIG (HDR Gaming Interest Group)` 色調對應(而不是 :abbr:`DTM (Dynamic Tone Mapping)` 色調對應)， 之後 `使用 Windows HDR 校準應用<https://support.microsoft.com/en-us/windows/calibrate-your-hdr-display-using-the-windows-hdr-calibration-app-f30f4809-3369-43e4-9b02-9eabebd23f19>` 。在使用HDR時，強烈建議使用Windows 11而不是Windows 10。 不過，最終結果仍然可能不如在顯示器上禁用HDR。

source: Support for HDR *output* is planned in a future release.
de: Unterstützung für *HDR-Ausgabe* ist für ein zukünftiges Release geplant.
es: La compatibilidad con HDR *salida* está prevista en una futura versión.
ja: HDR *出力*のサポートは将来のリリースで追加される予定です。
pl: Obsługa *wyjścia* HDR jest planowana w przyszłej wersji.
zh_cn: 计划在未来版本中支持 HDR *导出*\。
zh_tw: 計畫在未來版本中支援 HDR *匯出*。

source: The editor/project freezes or displays glitched visuals after resuming the PC from suspend
de: Der Editor/das Projekt friert ein oder zeigt ein gestörtes Bild an, nachdem der PC aus dem Standby-Modus wieder gestartet wurde
es: El editor/proyecto se congela o muestra fallos visuales después de reanudar el PC desde la suspensión
ja: スリープしてから復帰するとエディター/プロジェクトが固まったり異常な見た目になる
pl: Edytor/projekt zawiesza się lub wyświetla zakłóconą grafikę po wznowieniu komputera ze stanu wstrzymania.
zh_cn: 从挂起状态恢复 PC 后，编辑器/项目冻结或显示出现故障
zh_tw: 從掛起狀態恢復 PC 後，編輯器/專案凍結或顯示出現故障

source: This is a known issue on Linux with NVIDIA graphics when using the proprietary driver. There is no definitive fix yet, as suspend on Linux + NVIDIA is often buggy when OpenGL or Vulkan is involved. The Compatibility rendering method (which uses OpenGL) is generally less prone to suspend-related issues compared to the Forward+ and Forward Mobile rendering methods (which use Vulkan).
de: Dies ist ein bekanntes Problem unter Linux mit NVIDIA-Grafik, wenn der proprietäre Treiber verwendet wird. Es gibt noch keine endgültige Lösung, da Suspend unter Linux + NVIDIA oft fehlerhaft ist, wenn OpenGL oder Vulkan beteiligt sind. Die Compatibility-Rendering-Methode (die OpenGL verwendet) ist im Allgemeinen weniger anfällig für Suspend-Probleme als die Forward+- und Forward Mobile-Renderingmethoden (die Vulkan verwenden).
ja: これはNVIDIA GPUをLinuxで使うときにプロプライエタリのドライバーを使うと発生する問題です。Linux + NVIDIAの環境でスリープにOpenGLやVulkanが関わると不具合が出やすいからです。一般に、OpenGLを使用する「互換性」レンダラーはVulkanを使用する「Forward+」や「モバイル」と比べてスリープに関連した問題が起こりにくいです。
pl: Jest to znany problem w systemie Linux z grafiką NVIDIA, gdy używany jest zastrzeżony sterownik. Nie ma jeszcze ostatecznej poprawki, ponieważ zawieszenie w systemie Linux + NVIDIA jest często błędne, gdy zaangażowany jest OpenGL lub Vulkan. Metoda renderowania Compatibility (która wykorzystuje OpenGL) jest generalnie mniej podatna na problemy związane z zawieszeniem w porównaniu do metod renderowania Forward+ i Forward Mobile (które wykorzystują Vulkan).
zh_cn: 当在 Linux 上使用 NVIDIA 的专用图形驱动程序时便会出现这个已知的问题。目前还没有明确的解决方案，因为当涉及 OpenGL 或 Vulkan 时，Linux+NVIDIA 上的挂起通常会出现问题。与 Forward+ 和 ForwardMobile 渲染方法（使用 Vulkan ）相比，兼容性渲染方法（采用 OpenGL ）通常不太容易出现挂起相关问题。
zh_tw: 當您在 Linux 上使用 NVIDIA 的專用圖形驅動程式時便會出現這個已知的問題。目前還沒有明確的解決方案，因為當涉及 OpenGL 或 Vulkan 時，Linux+NVIDIA 上的掛起通常會出現問題。與 Forward+ 和 ForwardMobile 算繪方法（使用 Vulkan ）相比，相容性算繪方法（採用 OpenGL ）通常不太容易出現掛起相關問題。

source: The NVIDIA driver offers an *experimental* `option to preserve video memory after suspend <https://wiki.archlinux.org/title/NVIDIA/Tips_and_tricks#Preserve_video_memory_after_suspend>`__ which may resolve this issue. This option has been reported to work better with more recent NVIDIA driver versions.
de: Der NVIDIA-Treiber bietet eine *experimentelle* `Option zur Erhaltung des Videospeichers nach dem Suspend <https://wiki.archlinux.org/title/NVIDIA/Tips_and_tricks#Preserve_video_memory_after_suspend>`__, die dieses Problem beheben kann. Es wurde berichtet, dass diese Option mit neueren NVIDIA-Treiberversionen besser funktioniert.
pl: Sterownik NVIDIA oferuje *eksperymentalną* opcję zachowania pamięci wideo po zawieszeniu <https://wiki.archlinux.org/title/NVIDIA/Tips_and_tricks#Preserve_video_memory_after_suspend>`__, która może rozwiązać ten problem. Zgłoszono, że opcja ta działa lepiej z nowszymi wersjami sterowników NVIDIA.
zh_cn: NVIDIA驱动程序提供了一个 *实验性* `选项可在挂起后保护视频内存 <https://wiki.archlinux.org/title/NVIDIA/Tips_and_tricks#Preserve_video_memory_after_suspend>`__ 用以解决这个问题。据报道，此选项与较新的 NVIDIA 驱动程序版本配合使用效果更好。
zh_tw: NVIDIA驅動程式提供了一個 *實驗性* `選項可在掛起後保護影片記憶體 <https://wiki.archlinux.org/title/NVIDIA/Tips_and_tricks#Preserve_video_memory_after_suspend>`__ 用以解決這個問題。據報導，此選項與較新的 NVIDIA 驅動程式版本配合使用效果更好。

source: To avoid losing work, save scenes in the editor before putting the PC to sleep.
de: Speichern Sie vor dem Ausschalten des PCs die Szenen, um einen Verlust ihrer Arbeit zu verhindern.
es: Para evitar la pérdida de trabajo, asegúrate de guardar todo tu progreso y escenas antes de suspender tu PC.
ja: 作業を失わないよう、PCをスリープさせる前にシーンを保存しましょう。
pl: Aby uniknąć utraty pracy, zapisuj sceny w edytorze przed uśpieniem komputera.
zh_cn: 为了避免丢失工作内容，请在使电脑进入睡眠状态之前将场景保存在编辑器中。
zh_tw: 為了避免丟失工作內容，請在使電腦進入睡眠狀態之前將場景保存在編輯器中。

source: The project works when run from the editor, but fails to load some files when running from an exported copy
de: Das Projekt funktioniert, wenn es vom Editor ausgeführt wird, aber scheitert beim Laden einiger Dateien, falls es von einer exportierten Kopie läuft
es: El proyecto funciona cuando se ejecuta desde el editor, pero falla al cargar algunos archivos cuando se ejecuta desde una copia exportada
zh_cn: 项目在编辑器中正常运行，但在导出后无法加载部分文件
zh_tw: 專案可以從編輯器裡執行，但是從匯出的版本執行時無法載入某些檔案

source: This is usually caused by forgetting to specify a filter for non-resource files in the Export dialog. By default, Godot will only include actual *resources* into the PCK file. Some files commonly used, such as JSON files, are not considered resources. For example, if you load ``test.json`` in the exported project, you need to specify ``*.json`` in the non-resource export filter. See :ref:`doc_exporting_projects_export_mode` for more information.
de: Dies wird normalerweise dadurch verursacht, dass vergessen wird, im Dialogfeld „Exportieren“ einen Filter für Nicht-Ressourcendateien anzugeben. Standardmäßig nimmt Godot nur tatsächliche *Ressourcen* in die PCK-Datei auf. Einige häufig verwendete Dateien, z.B. JSON-Dateien, werden nicht als Ressourcen betrachtet. Wenn Sie beispielsweise ``test.json`` in das exportierte Projekt laden, müssen Sie ``*.json`` im Nicht-Ressourcen-Exportfilter angeben. Weitere Informationen finden Sie unter :ref:`doc_exporting_projects_export_mode`.
es: Esto suele deberse a que se olvida de especificar un filtro para los archivos que no son de recursos en el cuadro de diálogo de exportación. Por defecto, Godot sólo incluirá los *recursos* reales en el archivo PCK. Algunos archivos de uso común, como los archivos JSON, no se consideran recursos. Por ejemplo, si cargas ``test.json`` en el proyecto exportado, necesitas especificar ``*.json`` en el filtro de exportación de no recursos. Vea :ref:`doc_exporting_projects_export_mode` para más información.
ja: これは通常、エクスポートダイアログでリソース以外のファイルのフィルタを指定するのを忘れたことが原因です。デフォルトでは、Godotは実際の *リソース* のみをPCKファイルに含めます。JSONファイルのような一般的に使われているファイルはリソースとはみなされません。例えば、\ ``test.json`` をエクスポートしたプロジェクトで読み込む場合、\ ``*.json`` をリソース以外のエクスポートフィルタに指定する必要があります。詳しくは\ :ref:`doc_exporting_projects_export_mode`\ を参照してください。
pl: To jest zazwyczaj spowodowane nie uwzględnieniem formatu w filtrze dla plików nie będących zasobami w okienku eksportu. Domyślnie Godot dodaje do pliku PCK jedynie właściwe *zasoby*. Niektóre często używane pliki, takie jak JSON nie są uznawane za zasoby. Na przykład, jeśli załadujesz ``test.json`` w wyeksportowanym projekcie, musisz wyszczególnić ``*.json`` w filtrze plików nie będącymi zasobami. Po więcej informacji zobacz :ref:`doc_exporting_projects_export_mode`.
zh_cn: 这通常是在导出对话框中忘记筛选非资源文件所导致的。默认情况下，Godot只会将实际的\ *资源*\ 包含在 PCK 文件中。一些常用的文件，例如 JSON 文件，不会被视为资源。例如，当你在导出的项目中加载 ``test.json`` 时，你需要在非资源导出过滤器中指定 ``*.json``\ 。详见：\ :ref:`doc_exporting_projects_export_mode`\ 。
zh_tw: 這個問題通常時因為忘記在 [匯出] 對話框中為非資源檔案指定篩選器導致的。預設情況下，Godot 只會將真正的 **資源 (Resource)** 打包進 PCK 檔案內。有些常用的檔案，如 JSON 檔，並不屬於資源。舉例來說，若在匯出的專案中載入 ``test.json`` ，則需要在非資源匯出篩選器內指定 ``*.json`` 。更多資訊請參考 :ref:`doc_exporting_projects_export_mode` 。

source: Also, note that files and folders whose names begin with a period will never be included in the exported project. This is done to prevent version control folders like ``.git`` from being included in the exported PCK file.
de: Beachten Sie auch, dass Dateien und Ordner, deren Namen mit einem Punkt beginnen, niemals in das exportierte Projekt aufgenommen werden. Dies geschieht, um zu verhindern, dass Versionskontrollordner wie ``.git`` in die exportierte PCK-Datei aufgenommen werden.
es: También ten en cuenta que los archivos y carpetas cuyos nombres comienzan con un punto nunca se incluirán en el proyecto exportado. Esto se hace para evitar que las carpetas de control de versiones como ``.git`` se incluyan en el archivo PCK exportado.
ja: また、名前がピリオドから始まるファイルやフォルダはエクスポートされるプロジェクトには含まれません。これは ``.git``のようなバージョン管理のフォルダがエクスポートされるPCKファイルに含まれないようにするためです。
pl: Należy również pamiętać, że pliki i foldery, których nazwy zaczynają się od kropki, nigdy nie zostaną uwzględnione w wyeksportowanym projekcie. Ma to na celu zapobieganie włączaniu folderów kontroli wersji, takich jak ``.git``, do eksportowanego pliku PCK.
zh_cn: 另外，请注意，导出的项目永远不会包含名字以点开头的文件和文件夹。这是为了防止将 ``.git`` 等版本控制文件夹包含在导出的 PCK 文件中。
zh_tw: 另外，請注意，匯出的專案永遠不會包含名字以點開頭的檔和資料夾。這是為了防止將 ``.git`` 等版本控制資料夾包含在匯出的 PCK 檔中。

source: On Windows, this can also be due to :ref:`case sensitivity <doc_project_organization_case_sensitivity>` issues. If you reference a resource in your script with a different case than on the filesystem, loading will fail once you export the project. This is because the virtual PCK filesystem is case-sensitive, while Windows's filesystem is case-insensitive by default.
de: Unter Windows kann dies auch auf :ref:`Groß- und Kleinschreibungs-<doc_project_organization_case_sensitivity>`-Probleme zurückzuführen sein. Wenn Sie in Ihrem Skript auf eine Ressource mit einer anderen Groß-/Kleinschreibung als im Dateisystem verweisen, schlägt das Laden fehl, sobald Sie das Projekt exportieren. Dies liegt daran, da das virtuelle PCK-Dateisystem zwischen Groß- und Kleinschreibung unterscheidet, während das Windows-Dateisystem dies standardmäßig nicht unterscheidet.
es: En Windows, esto también puede deberse a problemas de :ref:`sensibilidad del caso <doc_project_organization_case_sensitivity>`. Si haces referencia a un recurso en tu script con un caso diferente al del sistema de archivos, la carga fallará una vez que exportes el proyecto. Esto se debe a que el sistema de archivos virtual PCK es sensible a mayúsculas y minúsculas, mientras que el sistema de archivos de Windows no es sensible a mayúsculas y minúsculas por defecto.
ja: Windowsでは、\ :ref:`大文字小文字の区別 <doc_project_organization_case_sensitivity>`\ における問題が原因である可能性もあります。スクリプト内のリソースを、ファイルシステム上とは異なる大文字小文字で参照した場合、プロジェクトをエクスポートすると読み込みに失敗します。これは、Windows のファイルシステムがデフォルトで大文字小文字を区別しないのに対し、仮想 PCK ファイルシステムは大文字小文字を区別しているためです。
pl: Na Windowsie, to może być spowodowane przez problemy z :ref:`case sensitivity <doc_project_organization_case_sensitivity>`. Jeśli w skrypcie odniesiesz się do zasobu z inną wielkością liter niż w systemie plików, podczas eksportu projektu nie zostanie on załadowany. Dzieje się tak ponieważ wirtualny system plików PCK jest wrażliwy na wielkość liter, podczas gdy system plików Windowsa domyślnie nie zwraca na nią uwagi.
zh_cn: 在 Windows 上，也可能是\ :ref:`大小写敏感性 <doc_project_organization_case_sensitivity>`\ 的问题。如果你在脚本里引用资源时所使用的大小写与文件系统中的不符，在导出项目后就会载入失败。这是因为虚拟 PCK 文件系统是大小写敏感的，而 Windows 的文件系统是大小写不敏感的。
zh_tw: 而在 Windows 上，這個問題還可能是因為 :ref:`大小寫區分 <doc_project_organization_case_sensitivity>` 問題導致的。若在腳本中以與檔案系統不同的大小寫來參照資源，則匯出專案之後就會載入失敗。這是因為虛擬 PCK 檔案系統是有區分大小寫的，而 Windows 的檔案系統則預設不區分大小寫。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
ja: 翻訳ステータス
pl: Status tłumaczenia
zh_cn: 翻译状态
zh_tw: 翻譯狀態
