Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/01.project_setup.po
Languages: de, zh_tw

source: Setting up the project
de: Einrichten des Projekts
zh_tw: 設定專案

source: In this short first part, we'll set up and organize the project.
de: In diesem ersten, kurzen Teil werden wir das Projekt aufsetzen und organisieren.
zh_tw: 在這個簡短的第一部分中，我們將設定和組織專案。

source: Launch Godot and create a new project.
de: Starten Sie Godot und erstellen Sie ein neues Projekt.
zh_tw: 啟動 Godot 並創建一個新專案。

source: When creating the new project, you only need to choose a valid *Project Path*. You can leave the other default settings alone.
de: Bei der Erstellung eines neuen Projekts müssen Sie nur einen gültigen *Projektpfad* auswählen. Die anderen Default-Einstellungen können Sie unverändert lassen.
zh_tw: 建立新專案時，你只需要選擇一個有效的 *專案路徑* 。你可以保留其他預設設定。

source: Download `dodge_the_creeps_2d_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/dodge_the_creeps_2d_assets.zip>`_. The archive contains the images and sounds you'll be using to make the game. Extract the archive and move the ``art/`` and ``fonts/`` directories to your project's directory.
de: Laden Sie `dodge_the_creeps_2d_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/dodge_the_creeps_2d_assets.zip>`_ herunter. Das Archiv enthält die Bilder und Sounds, die Sie für das Spiel verwenden werden. Entpacken Sie das Archiv und verschieben Sie die Verzeichnisse ``art/`` und ``fonts/`` in das Verzeichnis deines Projekts.
zh_tw: 開啟 Godot 並建立一個新專案。接著，下載 :download:`dodge_assets.zip <files/dodge_assets.zip>` 。這個檔案包含了接下來製作遊戲時會使用到的圖片與聲音檔。把這些檔案解壓縮至專案資料夾中。

source: Ensure that you have the required dependencies to use C# in Godot. You need the latest stable .NET SDK, and an editor such as VS Code. See :ref:`doc_c_sharp_setup`.
de: Stellen Sie sicher, dass Sie über die erforderlichen Abhängigkeiten verfügen, um C# in Godot zu verwenden. Sie benötigen das neueste stabile .NET SDK und einen Editor wie VS Code. Siehe :ref:`doc_c_sharp_setup`.
zh_tw: 確保你擁有在Godot中使用C#所需的依賴。你需要最新的穩定版的 .NET SDK 和一個編輯器，如VS Code。參見 :ref:`doc_c_sharp_setup` 。

source: The C++ part of this tutorial wasn't rewritten for the new GDExtension system yet.
de: Der C++ Teil dieses Tutorials wurde noch nicht für das neue GDExtension System umgeschrieben.
zh_tw: 本教學的 C++ 部分還沒有為新的 GDExtension 系統重寫。

source: Your project folder should look like this.
de: Ihr Projektordner sollte wie folgt aussehen.
zh_tw: 你的專案資料夾看起來會這樣。

source: This game is designed for portrait mode, so we need to adjust the size of the game window. Click on *Project -> Project Settings* to open the project settings window, in the left column open the *Display -> Window* tab. There, set "Viewport Width" to ``480`` and "Viewport Height" to ``720``.
de: Dieses Spiel ist für den Hochformatmodus konzipiert, daher müssen wir die Größe des Spielfensters anpassen. Klicken Sie auf *Projekt -> Projekteinstellungen*, um das Projekteinstellungsfenster zu öffnen und öffnen Sie in der linken Spalte den Tab *Anzeige -> Fenster*. Dort setzen Sie "Viewport-Breite" auf ``480`` und "Viewport-Höhe" auf ``720``.

source: Also, under the **Stretch** options, set **Mode** to ``canvas_items`` and **Aspect** to ``keep``. This ensures that the game scales consistently on different sized screens.
de: Setzen Sie außerdem unter den **Streckung**-Optionen **Modus** auf ``canvas_items`` und **Seitenverhältnis** auf ``keep``. Dadurch wird sichergestellt, dass das Spiel auf unterschiedlich großen Bildschirmen gleichmäßig skaliert.
zh_tw: 另外，在同一個地方，將 [Stretch] (拉伸) 選項中的 ``Mode`` (模式) 設為「2d」，將 [Aspect] (比例) 設為「keep」(保持)。這樣就能確保遊戲在不同大小的螢幕上會保持相同的比例。

source: Organizing the project
de: Organisieren des Projekts
zh_tw: 組織專案

source: In this project, we will make 3 independent scenes: ``Player``, ``Mob``, and ``HUD``, which we will combine into the game's ``Main`` scene.
de: In diesem Projekt werden 3 unabhängige Szenen erstellt:``Player``, ``Mob``, and ``HUD``, die wir in der ``Main``-Szene des Spiels kombinieren werden.
zh_tw: 在這個專案中，我們將製作 3 個獨立的場景： ``Player`` 、 ``Mob`` 以及 ``HUD`` ，我們將把這些場景合併成遊戲的 ``Main`` 場景。

source: In a larger project, it might be useful to create folders to hold the various scenes and their scripts, but for this relatively small game, you can save your scenes and scripts in the project's root folder, identified by ``res://``. You can see your project folders in the FileSystem dock in the lower left corner:
de: In einem größeren Projekt kann es nützlich sein, Ordner für die verschiedenen Szenen und deren Skripte zu erstellen. Bei diesem relativ kleinen Spiel können Sie Ihre Szenen und Skripte jedoch im Root-Verzeichnis des Projekts speichern, das als ``res://`` bezeichnet wird. Sie können Ihren Projektordner im Dateisystem-Dock in der unteren linken Ecke sehen:
zh_tw: 在這個專案中，我們會使用三個獨立的場景： ``Player`` (玩家)、 ``Mob`` (怪物) 與 ``HUD`` ，我們會把這三個場景組合進遊戲的 ``Main`` (主要) 場景。在大型專案中，或許開一些資料夾來儲存不同的場景與其對應的腳本會比較好，但對於相對小型的遊戲，可以把場景跟腳本都保存在專案的根目錄下，也就是 ``res://`` 。可以在左下角的檔案系統 Dock 中看到專案資料夾：

source: With the project in place, we're ready to design the player scene in the next lesson.
de: Mit dem so vorbereiteten Projekt kann im nächsten Schritt die Spieler-Szene erstellt werden.
zh_tw: 專案準備就緒後，我們已準備好在下一課中設計玩家場景。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
