Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/03.coding_the_player.po
Languages: de, ru, tr

source: Now that the player can move, we need to change which animation the AnimatedSprite2D is playing based on its direction. We have the "walk" animation, which shows the player walking to the right. This animation should be flipped horizontally using the ``flip_h`` property for left movement. We also have the "up" animation, which should be flipped vertically with ``flip_v`` for downward movement. Let's place this code at the end of the ``_process()`` function:
de: Da sich der Spieler nun bewegen kann, müssen wir die Animation, die AnimatedSprite2D abspielt, bezüglich seiner Richtung ändern. Wir haben die "walk"-Animation, die den Spieler zeigt, wie er nach rechts geht. Diese Animation sollte horizontal gespiegelt werden, indem man die Eigenschaft ``flip_h`` für die Bewegung nach links verwendet. Wir haben auch die "up"-Animation, die vertikal mit ``flip_v`` für die Abwärtsbewegung gespiegelt werden sollte. Lassen Sie uns diesen Code am Ende der Funktion ``_process()`` einfügen:
ru: Теперь, когда игрок может двигаться, нам нужно изменять анимацию AnimatedSprite2D в зависимости от направления движения. У нас есть анимация "walk", которая показывает игрока, идущего направо. Эту анимацию следует перевернуть горизонтально, используя свойство ``flip_h`` для движения влево. У нас также есть анимация "up", которую нужно перевернуть вертикально с помощью ``flip_v`` для движения вниз. Поместим этот код в конец функции ``_process ()``:

source: The boolean assignments in the code above are a common shorthand for programmers. Since we're doing a comparison test (boolean) and also *assigning* a boolean value, we can do both at the same time. Consider this code versus the one-line boolean assignment above:
de: Die booleschen Zuweisungen im obigen Code sind eine gebräuchliche Abkürzung für Programmierer. Da wir einen (booleschen) Vergleichstest durchführen und auch einen booleschen Wert *zuweisen*, können wir beide gleichzeitig durchführen. Betrachten Sie diesen Code im Vergleich zur obigen einzeiligen booleschen Zuweisung:
ru: Логические присваивания в коде выше являются общим сокращением для программистов. Поскольку мы проводим проверку сравнения (логическую, булеву), а также *присваиваем* булево значение, мы можем делать и то, и другое одновременно. Рассмотрим этот код в сравнении с однострочным логическим присваиванием выше:
tr: Yukarıdaki kodun içindeki mantıksal atamalar, programcılar için yaygın bir kısaltmadır. Burada bir (mantıksal) karşılaştırma ve ayrıca bir mantıksal değer *atama* 'sı yaptığımız için, iki işi tek seferde yapabiliriz. Yukarıdaki tek-satırlık atamaya karşılık aşağıdaki kodu ele alalım:

source: Play the scene again and check that the animations are correct in each of the directions.
de: Spielen Sie die Szene erneut ab und überprüfen Sie, ob die Animationen in jeder Richtung korrekt sind.
ru: Воспроизведите сцену еще раз и проверьте правильность анимации в каждом из направлений.
tr: Sahneyi tekrar oynatın ve animasyonların her yönde doğru olduğunu kontrol edin.

source: A common mistake here is to type the names of the animations wrong. The animation names in the SpriteFrames panel must match what you type in the code. If you named the animation ``"Walk"``, you must also use a capital "W" in the code.
de: Ein allgemeiner Fehler ist hier, die Namen der Animationen falsch zu benennen. Die Animationsnamen in dem SpriteFrames-Bereich müssen mit dem, was im Code geschrieben steht, übereinstimmen. Wenn die Animation ``"Walk"`` heißt, dann muss auch ein großgeschriebenes "W" im Code stehen.
ru: Общей ошибкой является неправильное именование анимаций. Имена анимаций в панели SpriteFrames должны совпадать с именами анимаций в вашем коде. Если вы назвали анимацию "Walk", вы должны также использовать заглавную букву "W" в коде.
tr: Buradaki genel yapılan bir hata, animasyonların ismini yanlış yazmaktır. SpriteFrames (grafik öğe kareleri) panelindeki animasyon isimleri, kodun içinde yazdığınızla aynı olmalıdır. Eğer animasyona ``"Walk"`` ismini verdiyseniz, kodun içinde de aynı şekilde büyük harf ile "W" kullanmalısınız.

source: When you're sure the movement is working correctly, add this line to ``_ready()``, so the player will be hidden when the game starts:
de: Wenn Sie sich sicher sind, dass die Bewegung korrekt funktioniert, fügen Sie diese Zeile zu ``_ready()`` hinzu, damit der Spieler zu Beginn des Spiels ausgeblendet wird:
ru: Если вы уверены, что движение работает правильно, добавьте эту строку в ``_ready()``, чтобы игрок был скрыт при запуске игры:
tr: Hareketin doğru çalıştığından emin olduktan sonra, ``_ready()`` fonksiyonuna bu satırı ekleyin, böylece oyun başladığında oyuncu görünmez olacaktır:

source: Preparing for collisions
de: Vorbereitung auf Kollisionen
ru: Подготовка к столкновениям
tr: Çarpışmalar için hazırlık

source: We want ``Player`` to detect when it's hit by an enemy, but we haven't made any enemies yet! That's OK, because we're going to use Godot's *signal* functionality to make it work.
de: Wir wollen, dass der ``Player`` erkennt, wann er von einem Gegner getroffen wird, aber wir haben noch keine Gegner erstellt! Das ist in Ordnung, denn wir werden Godots *Signal*-Funktionalität nutzen, damit es funktioniert.
ru: Мы хотим, чтобы ``Player`` обнаруживал столкновение с врагом, но мы еще не сделали никаких врагов! Это нормально, потому что мы будем использовать такой функционал Godot, как *сигнал*.
tr: ``Player`` bir düşmana çarparsa bunu farketsin istiyoruz, ama henüz hiçbir düşman oluşturmadık! Sorun değil, çünkü Godot'nun *sinyal* sistemini kullanarak bunun çalışmasını sağlayabiliriz.

source: Add the following at the top of the script. If you're using GDScript, add it after ``extends Area2D``. If you're using C#, add it after ``public partial class Player : Area2D``:
de: Fügen Sie das Folgende am Anfang des Skripts ein. Wenn Sie GDScript verwenden, fügen Sie es nach ``extends Area2D`` ein. Wenn Sie C# verwenden, fügen Sie es nach ``public partial class Player : Area2D`` ein:
ru: Добавьте следующее в верхней части скрипта. Если вы используете GDScript, добавьте его после ``extends Area2D``. Если вы используете C#, добавьте его после ``public partial class Player : Area2D``:

source: This defines a custom signal called "hit" that we will have our player emit (send out) when it collides with an enemy. We will use ``Area2D`` to detect the collision. Select the ``Player`` node and click the "Node" tab next to the Inspector tab to see the list of signals the player can emit:
de: Dies definiert ein benutzerdefiniertes Signal namens "hit", das wir von unserem Spieler aussenden lassen, wenn es mit einem Gegner kollidiert. Wir werden ``Area2D`` verwenden, um die Kollision zu erkennen. Wählen Sie den Node ``Player`` und klicken auf den "Node"-Tab neben dem Inspektor-Tab, um die Liste der Signale zu sehen, die der Spieler aussenden kann:
ru: Это определяет пользовательский сигнал под названием "hit" ("удар"), который наш игрок будет излучать (отправлять), когда он сталкивается с противником. Мы будем использовать ``Area2D`` для обнаружения столкновения. Выберите узел ``Player`` ("Игрок") и щелкните по вкладке "Узел" (Node) рядом с вкладкой "Инспектор" (Inspector), чтобы просмотреть список сигналов, которые игрок может посылать:
tr: Bu, oyuncumuzun bir düşmanla temas etmesi halinde yayacağı "hit" isminde özel bir sinyal tanımlar. Çarpışmayı algılamak için ``Area2D`` kullanacağız. ``Player`` düğümünü seçin ve Denetleyici sekmesinin yanındaki "Düğüm" sekmesine tıklayarak, oyuncunun yayabileceği sinyallerin listesini görebilirsiniz:

source: Notice our custom "hit" signal is there as well! Since our enemies are going to be ``RigidBody2D`` nodes, we want the ``body_entered(body: Node2D)`` signal. This signal will be emitted when a body contacts the player. Click "Connect.." and the "Connect a Signal" window appears.
de: Beachten Sie, dass unser benutzerdefiniertes "Hit"-Signal ebenfalls vorhanden ist! Da unsere Gegner ``RigidBody2D``-Nodes sein werden, brauchen wir das Signal ``body_entered(body: Node2D)``. Dieses Signal wird ausgesendet, wenn ein Body den Spieler berührt. Klicken Sie auf "Verbinden..." und das Fenster "ein Signal verbinden" erscheint.
ru: Обратите внимание, что наш пользовательский сигнал "hit" там также есть! Поскольку наши противники будут узлами ``RigidBody2D``, нам нужен сигнал ``body_entered(body: Node2D)``. Он будет отправляться при контакте тела (body) с игроком. Нажмите "Присоединить..." - появится окно "Подключить сигнал к методу".

source: Godot will create a function with that exact name directly in script for you. You don't need to change the default settings right now.
de: Godot wird eine Funktion mit genau diesem Namen direkt im Skript für Sie erstellen. Sie brauchen die Default-Einstellungen aktuell nicht ändern.
ru: Godot создаст для вас функцию с таким же точным именем прямо в скрипте. Пока что вам не нужно менять настройки по умолчанию.

source: If you're using an external text editor (for example, Visual Studio Code), a bug currently prevents Godot from doing so. You'll be sent to your external editor, but the new function won't be there.
de: Wenn Sie einen externen Texteditor verwenden (z.B. Visual Studio Code), verhindert ein Fehler derzeit, dass Godot dies tut. Sie werden dann zu Ihrem externen Editor weitergeleitet, aber die neue Funktion ist dort nicht vorhanden.
ru: Если вы пользуетесь внешним текстовым редактором (например, Visual Studio Code), внутренняя ошибка Godot сейчас не позволяет это сделать. Вы будете перенаправлены во внешний редактор, но новая функция там не будет создана.

source: In this case, you'll need to write the function yourself into the Player's script file.
de: In diesem Fall müssen Sie die Funktion selbst in die Skriptdatei von Player schreiben.
ru: В этом случае вам надо будет написать функцию в файле скрипта для игрока (Player) самостоятельно.

source: Note the green icon indicating that a signal is connected to this function; this does not mean the function exists, only that the signal will attempt to connect to a function with that name, so double-check that the spelling of the function matches exactly!
de: Beachten Sie das grüne Icon, das anzeigt, dass ein Signal mit dieser Funktion verbunden ist; dies bedeutet nicht, dass die Funktion existiert, sondern nur, dass das Signal versucht, eine Verbindung zu einer Funktion mit diesem Namen herzustellen. Prüfen Sie also, ob die Schreibweise der Funktion genau übereinstimmt!
ru: Обратите внимание на зеленый значок, указывающий на то, что сигнал подключен к этой функции; это не означает, что функция существует, а только то, что сигнал попытается подключиться к функции с таким именем, поэтому дважды проверьте, чтобы написание функции точно совпадало!

source: Next, add this code to the function:
de: Fügen Sie dann diesen Code in die Funktion ein:
ru: Затем добавьте этот код в функцию:

source: Each time an enemy hits the player, the signal is going to be emitted. We need to disable the player's collision so that we don't trigger the ``hit`` signal more than once.
de: Jedes Mal, wenn ein Gegner den Spieler trifft, wird das Signal ausgesendet. Wir müssen die Kollision des Spielers deaktivieren, damit das ``hit``-Signal nicht mehr als einmal ausgelöst wird.
ru: Каждый раз, когда противник ударяет игрока, будет посылаться сигнал. Нам нужно отключить столкновение игрока, чтобы не вызывать сигнал ``hit`` более одного раза.
tr: Bir düşman oyuncuya her çarptığında, bu sinyali yayacaktır. Oyuncunun çarpışmasını devre dışı bırakmalıyız, böylece ``hit`` sinyalini birden fazla tetiklememiş olacağız.

source: Disabling the area's collision shape can cause an error if it happens in the middle of the engine's collision processing. Using ``set_deferred()`` tells Godot to wait to disable the shape until it's safe to do so.
de: Das Deaktivieren der Kollisions-Shape während der Kollisionsberechnung der Engine kann einen Fehler auslösen. Die Verwendung von ``set_deferred()`` weist Godot an, mit dem Deaktivieren der Shape bis zu einem sicheren Zeitpunkt zu warten.
ru: Отключение формы области столкновения может привести к ошибке, если это происходит во время обработки движком столкновений. Использование ``set_deferred()`` говорит Godot ждать отключения этой формы, пока это не будет безопасно.
tr: Alan çarpışma şeklini devre dışı bırakmak, eğer motor çarpışma işleminin ortasındayken meydana gelirse, bir hataya neden olabilir. ``set_deferred()`` kullanmak Godot'ya, şekli devre dışı bırakması güvenli olana kadar beklemesini söyler.

source: The last piece is to add a function we can call to reset the player when starting a new game.
de: Das letzte was wir tun müssen ist eine Funktion hinzuzufügen, die wir aufrufen können, um den Spieler beim erneuten Start des Spiels zurückzusetzen.
ru: Последняя деталь - добавить функцию, которую мы можем вызвать для перезагрузки игрока при запуске новой игры.
tr: Son parça, yeni bir oyuna başlarken oyuncuyu sıfırlamak için çağırabileceğimiz bir fonksiyon eklemek olacak.

source: With the player working, we'll work on the enemy in the next lesson.
de: Da der Spieler nun funktioniert, werden wir in der nächsten Lektion an dem Gegner arbeiten.
ru: Теперь, когда игрок работает, мы займёмся врагом в следующем уроке.
tr: Oyuncumuz çalıştığına göre, şimdi sıradaki derste düşman üzerinde çalışacağız.

source: Translation status
de: Übersetzungsstatus
ru: Статус перевода
tr: Çeviri durumu
