Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/03.coding_the_player.po
Languages: de, ru, tr

source: Coding the player
de: Den Spieler programmieren
ru: Движение Игрока
tr: Oyuncuyu Kodlamak

source: In this lesson, we'll add player movement, animation, and set it up to detect collisions.
de: In dieser Lektion fügen wir Spielerbewegungen und Animationen hinzu und richten ihn so ein, dass er Kollisionen erkennt.
ru: В этом уроке мы добавим передвижение игрока, анимацию и настроим всё для определения столкновений.
tr: Bu derste, oyuncuya hareket ve canlandırma ekleyecek, ve çarpışma algılamasını kuracağız.

source: To do so, we need to add some functionality that we can't get from a built-in node, so we'll add a script. Click the ``Player`` node and click the "Attach Script" button:
de: Jetzt müssen wir einige Funktionen hinzufügen, die wir von einen Built-in-Node nicht enthalten sind, also fügen wir ein Skript hinzu. Klicken Sie auf den Node ``Player`` und dann auf den "Skript hinzufügen"-Button:
ru: Для этого нужно добавить немного функционала, который мы не можем получить с помощью встроенных узлов, поэтому мы добавим скрипт. Нажмите на узел ``Player`` и нажмите кнопку "Attach Script" ("Прикрепить скрипт"):
tr: Bunu yapmak için, yerleşik düğümden alamayacağımız bir kaç işlevsellik gerekiyor, bu nedenle bir betik ekleyeceğiz. ``Player`` düğümünü seçin ve "Betik Ekle" düğmesini tıklayın:

source: In the script settings window, you can leave the default settings alone. Just click "Create":
de: Im Fenster mit den Skripteinstellungen können Sie die Default-Einstellungen beibehalten. Klicken Sie einfach auf "Erstellen":
ru: В окне настроек скрипта вы можете оставить все настройки по умолчанию. Просто нажмите "Создать":
tr: Betik ayarları penceresinde, varsayılan ayarları olduğu gibi bırakabilirsiniz. Sadece "Oluştur"a tıklayın:

source: If you're creating a C# script or other languages, select the language from the `language` drop down menu before hitting create.
de: Wenn Sie ein C#-Skript oder andere Sprachen verwenden wollen, wählen Sie die Sprache aus dem Dropdown-Menü `Sprache`, bevor Sie auf Erstellen klicken.
ru: Если вы создаете скрипт на C# или другом языке, то перед созданием выберете этот язык в выпадающем меню `Язык`.
tr: Eğer C# ya da başka bir dilde betik oluşturuyorsanız, oluştur düğmesine tıklamadan önce `dil` açılır menüsünden dili seçin.

source: If this is your first time encountering GDScript, please read :ref:`doc_scripting` before continuing.
de: Wenn Sie noch nie etwas mit GDScript zu tun hatten, lesen Sie bitte :ref:`doc_scripting`, bevor Sie weitermachen.
ru: Если вы впервые столкнулись с GDScript, пожалуйста, прочтите :ref:`doc_scripting` перед продолжением.
tr: Eğer bu, GDScript ile ilk karşılaşmanız ise, lütfen devam etmeden önce :ref:`doc_scripting` sayfasını okuyun.

source: Start by declaring the member variables this object will need:
de: Beginnen Sie, indem Sie die Member-Variablen deklarieren, die dieses Objekt benötigt:
ru: Начните с объявления переменных - членов, которые понадобятся этому объекту:
tr: Bu nesnenin ihtiyaç duyacağı üye değişkenleri tanımlayarak başlayın:

source: Using the ``export`` keyword on the first variable ``speed`` allows us to set its value in the Inspector. This can be handy for values that you want to be able to adjust just like a node's built-in properties. Click on the ``Player`` node and you'll see the property now appears in the "Script Variables" section of the Inspector. Remember, if you change the value here, it will override the value written in the script.
de: Wenn Sie das Schlüsselwort ``export`` für die erste Variable ``speed`` verwenden, ermöglicht Ihnen dies, dessen Wert im Inspektor einzustellen. Dies kann für Werte nützlich sein, die Sie genau wie die Built-in-Eigenschaften eines Nodes anpassen möchten. Klicken Sie auf den Node ``Player``, und die Eigenschaft wird jetzt im Bereich mit den Skriptvariablen des Inspektors angezeigt. Denken Sie daran, wenn Sie den Wert hier ändern, wird der im Skript verwendete Wert überladen.
ru: Использование ключевого слова ``export`` у первой переменной ``speed`` позволяет устанавливать ее значение в Инспекторе. Это может быть полезно, если вы хотите изменять значения точно так же как и встроенные свойства узла. Щелкните на узел ``Player`` и вы увидите, что свойство появилось в разделе "Script Variables" в Инспекторе. Помните, что если изменить значение здесь, то оно перезапишет значение, установленное в скрипте.
tr: ``export`` anahtar kelimesini, ilk değişkenimiz ``speed`` ile kullanmak, bu değeri Denetleyici içinden ayarlama imkanı sağlar. Bu oldukça kullanışlı olabilir, çünkü değerleri, tıpkı düğümlerin yerleşik özellikleri gibi, kolayca ayarlayabilmenizi sağlar. ``Player`` düğümüne tıklayın, Denetleyicinin "Betik Değişkenleri" kısmında bu özelliğin eklendiğini göreceksiniz. Aklınızda tutun, değeri buradan değiştirirseniz, oyun çalışınca betiğin içinde yazdıklarınızın üzerine yazacaktır.

source: If you're using C#, you need to (re)build the project assemblies whenever you want to see new export variables or signals. This build can be manually triggered by clicking the **Build** button at the top right of the editor.
de: Wenn Sie C# verwenden, müssen Sie die Projekt-Assemblies (neu) erstellen, wenn Sie neue Exportvariablen oder Signale sehen möchten. Dieser Build kann manuell ausgelöst werden, indem man auf den **Build**-Button oben rechts im Editor klickt.

source: Your ``player.gd`` script should already contain a ``_ready()`` and a ``_process()`` function. If you didn't select the default template shown above, create these functions while following the lesson.
de: Ihr Skript ``player.gd`` sollte bereits eine ``_ready()`` und eine ``_process()``-Funktion enthalten. Wenn Sie nicht die oben gezeigte Default-Vorlage gewählt haben, erstellen Sie diese Funktionen, während Sie der Lektion folgen.
ru: Ваш скрипт ``player.gd`` уже должен содержать функции ``_ready()`` и ``_process()``. Если вы не выбрали шаблон по умолчанию, показанный выше, создайте эти функции, следуя уроку.

source: The ``_ready()`` function is called when a node enters the scene tree, which is a good time to find the size of the game window:
de: Die Funktion ``_ready()`` wird aufgerufen, wenn ein Node in den Szenenbaum eintritt, was ein guter Zeitpunkt ist, um die Größe des Spielfensters zu ermitteln:
ru: Функция ``_ready ()`` вызывается, когда узел появляется в дереве сцены, что является хорошим моментом для определения размера игрового окна:
tr: ``_ready()`` fonksiyonu, bir düğüm sahne ağacına girdiği zaman çağrılır, bu da pencerenin boyutunu tespit etmek için uygun zamandır:

source: Now we can use the ``_process()`` function to define what the player will do. ``_process()`` is called every frame, so we'll use it to update elements of our game, which we expect will change often. For the player, we need to do the following:
de: Jetzt können wir die Funktion ``_process()`` verwenden, um festzulegen, was der Spieler tun soll. ``_process()`` wird mit jedem Frame aufgerufen, deshalb werden wir es verwenden, um Elemente unseres Spiels zu aktualisieren, von denen wir erwarten, dass sie sich häufig ändern werden. Für den Spieler müssen wir Folgendes tun:
ru: Теперь мы можем использовать функцию ``_process()`` для определения того, что игрок будет делать. ``_process()`` вызывается каждый кадр, поэтому мы будем использовать ее для обновления состояния тех элементов нашей игры, которые будут часто изменяться. Для игрока, сделаем следующее:
tr: Şimdi, ``_process()`` fonksiyonunu kullanarak oyuncunun ne yapacağını tanımlayabiliriz. ``_process()``, her kare yenilemesinde çağrılır, dolayısıyla oyunumuzun çok sık değişmesini beklediğimiz ögelerini güncellemek için kullanacağız. Oyuncu için, şunları yapmamız gerekiyor:

source: Check for input.
de: Auf Eingaben prüfen.
ru: Проверка ввода.
tr: Girdiyi denetle.

source: Move in the given direction.
de: Sich in die angegebene Richtung bewegen.
ru: Перемещение в заданном направлении.
tr: Verilen yönde hareket et.

source: Play the appropriate animation.
de: Die entsprechende Animation abspielen.
ru: Воспроизвести соответствующую анимацию.
tr: Uygun animasyonu oynat.

source: First, we need to check for input - is the player pressing a key? For this game, we have 4 direction inputs to check. Input actions are defined in the Project Settings under "Input Map". Here, you can define custom events and assign different keys, mouse events, or other inputs to them. For this game, we will map the arrow keys to the four directions.
de: Zuerst müssen wir auf Eingaben prüfen - drückt der Spieler eine Taste? Für dieses Spiel haben wir 4 Richtungseingaben zu überprüfen. Eingabeaktionen werden in den Projekteinstellungen unter "Eingabe-Zuordnung" definiert. Sie können benutzerdefinierte Ereignisse definieren und ihnen verschiedene Tasten, Mausereignisse oder andere Eingaben zuweisen. Für diese Demo werden wir die Standardereignisse verwenden, die den Pfeiltasten auf der Tastatur zugeordnet sind.
ru: Во-первых, мы должны проверить ввод — нажимает ли игрок на клавишу? Для нашей игры нужно проверять 4 направления ввода. Функции ввода определяются в Настройках проекта во вкладке "Список действий". В ней можно определять отдельные события и назначать им различные клавиши, события мыши или другой ввод. В нашей игре мы присвоим клавиши стрелок для четырёх направлений.
tr: İlk olarak girdiyi denetlemeliyiz - oyuncu bir tuşa basıyor mu? Bu oyun için, 4 tane yönü kontrol etmemiz gerekiyor. Girdi eylemleri, Proje Ayarları içerisinde "Girdi Haritası" altındadır. Burada, özel olaylar tanımlayıp, bunlara farklı tuşlar, fare eylemleri, ya da diğer girdileri atayabiliriz. Bu oyun için, ok tuşlarını dört yöne haritalayacğız.

source: Click on *Project -> Project Settings* to open the project settings window and click on the *Input Map* tab at the top. Type "move_right" in the top bar and click the "Add" button to add the ``move_right`` action.
de: Klicken Sie auf *Projekt -> Projekteinstellungen*, um die Projekteinstellungen zu öffnen und wechseln dann zum Tab *Eingabe-Zuordnung*. Schreiben Sie "move_right" in die obere Leiste und betätigen dann den Button "Hinzufügen", um die Aktion ``move_right`` hinzuzufügen.
ru: Нажмите на *Проект -> Настройки проекта*, чтобы открыть окно настроек проекта, и нажмите вверху на вкладку *Input Map*. Введите "move_right" в верхней панели и нажмите на кнопку "Добавить", чтобы добавить действие ``move_right``.
tr: *Proje -> Proje Ayarları* 'na tıklayarak proje ayarları penceresini açın, ve en üst kısımdan *Girdi Haritası* sekmesine tıklayın. ``move_right`` (sağa git) eylemi eklemek için, üstteki çubukta "move_right" yazın ve "Ekle" düğmesine basın.

source: We need to assign a key to this action. Click the "+" icon on the right, to open the event manager window.
de: Wir müssen dieser Aktion eine Taste zuweisen. Klicken Sie auf das "+"-Icon auf der rechten Seite, um das Fenster der Ereigniskonfiguration zu öffnen.
ru: Нам нужно назначить клавишу для этого действия. Нажмите на значок "+" справа, чтобы открыть окно менеджера событий.

source: The "Listening for Input..." field should automatically be selected. Press the "right" key on your keyboard, and the menu should look like this now.
de: Das Feld "Warte auf Eingabe..." sollte automatisch ausgewählt sein. Drücken Sie die "Rechts"-Taste auf Ihrer Tastatur, und das Menü sollte nun wie folgt aussehen.
ru: Поле "Прослушивание ввода..." должно быть выбрано автоматически. Нажмите клавишу "вправо" на клавиатуре, и меню теперь должно выглядеть следующим образом.

source: Select the "ok" button. The "right" key is now associated with the ``move_right`` action.
de: Wählen Sie die "OK"-Button. Die Taste "rechts" ist nun mit der Aktion ``move_right`` verbunden.
ru: Нажмите кнопку "ок". Клавиша "вправо" теперь связана с действием ``move_right``.

source: Repeat these steps to add three more mappings:
de: Wiederholen Sie diese Schritte, um drei weitere Aktionen hinzuzufügen:
ru: Повторите эти шаги, чтобы добавить ещё три маппинга:
tr: Aynı adımları 3 tane daha haritalama için tekrar edin:

source: ``move_left`` mapped to the left arrow key.
de: ``move_left`` für die "links"-Taste.
ru: ``move_left`` соответствует стрелке влево.
tr: ``move_left`` (sola git) eylemi için sol ok tuşu.

source: ``move_up`` mapped to the up arrow key.
de: ``move_up`` für den "oben"-Taste.
ru: ``move_up`` соответствует стрелке вверх.
tr: ``move_up`` (yukarı git) eylemi için üst ok tuşu.

source: And ``move_down`` mapped to the down arrow key.
de: Und ``move_down`` für die "unten"-Taste.
ru: А ``move_down`` соответствует стрелке вниз.
tr: Ve ``move_down`` (aşağı git) eylemi için aşağı ok tuşu.

source: Your input map tab should look like this:
de: Der Tab "Eingabe-Zuordnung" sollte wie folgt aussehen:
ru: Вкладка Список действий должна выглядеть так:
tr: Giriş haritası sekmeniz bunun gibi görünmelidir:

source: Click the "Close" button to close the project settings.
de: Klicken Sie auf den "Schließen"-Button, um die Projekteinstellungen zu schließen.
ru: Нажмите кнопку "Закрыть" чтобы закрыть настройки проекта.
tr: "Kapat" düğmesine tıklayarak proje ayarlarını kapatın.

source: We only mapped one key to each input action, but you can map multiple keys, joystick buttons, or mouse buttons to the same input action.
de: Wir haben jeder Eingabeaktion nur eine Taste zugewiesen, aber Sie können mehrere Tasten, Joystick-Buttons oder Maustasten derselben Eingabeaktion zuweisen.
ru: Мы присвоили только одну клавишу каждому действию, но Вы можете присвоить тем же самым действиям несколько клавиш, кнопки джойстика или мыши.
tr: Her bir eylem için tek bir tuş haritalaması yaptık, ancak aynı girdi eylemine birden fazla tuş, oyun kolu düğmeleri, veya fare düğmeleri ataması da yapabilirsiniz.

source: You can detect whether a key is pressed using ``Input.is_action_pressed()``, which returns ``true`` if it's pressed or ``false`` if it isn't.
de: Sie können herausfinden, ob eine Taste gedrückt wird, indem Sie ``Input.is_action_pressed()`` benutzen, welches ``true`` zurückgibt, wenn eine Taste gedrückt wird und ``false`` wenn nicht.
ru: Вы можете определить, нажата ли клавиша с помощью функции ``Input.is_action_pressed()``, которая возвращает ``true``, если клавиша нажата, или ``false``, если нет.
tr: ``Input.is_action_pressed()`` kullanarak bir tuşun basılı olup olmadığını tespit edebilirsiniz; basıldığında ``true`` basılmadığında ``false`` döndürür .

source: We start by setting the ``velocity`` to ``(0, 0)`` - by default, the player should not be moving. Then we check each input and add/subtract from the ``velocity`` to obtain a total direction. For example, if you hold ``right`` and ``down`` at the same time, the resulting ``velocity`` vector will be ``(1, 1)``. In this case, since we're adding a horizontal and a vertical movement, the player would move *faster* diagonally than if it just moved horizontally.
de: Wir fangen damit an, die ``velocity`` (Geschwindigkeit) auf ``(0,0)`` zu setzen - standardmäßig sollte sich der Spieler nicht bewegen. Dann überprüfen wir jede Eingabe und addieren/subtrahieren von der ``velocity``, um eine Gesamtrichtung zu erhalten. Wenn Sie beispielsweise ``rechts`` und ``runter`` gleichzeitig halten, ist der resultierende ``velocity``-Vektor ``(1, 1)``. In diesem Fall, da wir eine horizontale und vertikale Bewegung addieren, würde sich der Spieler *schneller* bewegen, als wenn er sich nur horizontal bewegen würde.
ru: Начнём с того, что установим значение ``velocity`` в ``(0, 0)`` - по умолчанию игрок двигаться не должен. Затем, мы проверяем каждый ввод и добавляем/вычитаем значение из ``velocity``, чтобы получить общее направление. Например, если вы одновременно удерживаете ``right`` и ``down``, полученный вектор ``velocity`` будет ``(1, 1)``. В этом случае, поскольку мы добавляем горизонтальное и вертикальное движение, игрок будет двигаться *быстрее*, чем если бы он перемещался только по горизонтали.
tr: Hız değerini, ``velocity``, ``(0, 0)`` yaparak başlıyoruz - varsayılan olarak, oyuncu hareketli olmamalı. Sonra her girdiyi denetleyip, toplam yönü elde etmek için ``velocity`` 'ye ekleme/çıkarma yapacağız. Örneğin, eğer sağ, ``right``, ve aşağı, ``down``, tuşlarına aynı anda basılırsa, ``velocity`` vektörü ``(1, 1)`` olacaktır. Bu durumda, dikey ve yatay hareketleri topladığımız için, yatay yönde harekete göre, oyuncu çapraz yönde *daha hızlı* hareket etmiş olurdu.

source: We can prevent that if we *normalize* the velocity, which means we set its *length* to ``1``, then multiply by the desired speed. This means no more fast diagonal movement.
de: Wir können das verhindern, indem wir die Geschwindigkeit *normieren*, was bedeutet, dass wir ihre *Länge* auf ``1`` festlegen, und sie anschließend mit der gewünschten Geschwindigkeit multiplizieren. Das sorgt dafür, dass keine schnelle diagonale Bewegung mehr stattfindet.
ru: Можно избежать этого, если мы *нормализуем* скорость, что означает, что мы устанавливаем ее *длину* на ``1`` и умножаем на желаемую скорость. Это означает отсутствие более быстрого диагонального движения.
tr: Eğer hızı *normalize* edersek bunun önüne geçebiliriz - bunun anlamı vektörün *uzunluğunu* ``1`` yapmaktır - sonra da istenilen hızla çarparız. Böylece çapraz yönde daha hızlı gitmenin önüne geçilir.

source: If you've never used vector math before, or need a refresher, you can see an explanation of vector usage in Godot at :ref:`doc_vector_math`. It's good to know but won't be necessary for the rest of this tutorial.
de: Wenn Sie noch nie zuvor Vektor-Mathematik verwendet haben oder eine Auffrischung benötigen, finden Sie eine Erklärung zur Vektorverwendung in Godot unter :ref:`doc_vector_math`. Es ist gut zu wissen, wird aber für den Rest dieses Tutorials nicht notwendig sein.
ru: Если вы никогда раньше не использовали векторную математику или нуждаетесь в повторении, вы можете увидеть объяснение использования вектора в Godot по ссылке :ref:`doc_vector_math`. Ее полезно знать, но она не понадобится для остальной части этого урока.
tr: Eğer daha önce hiç vektör matematiği kullanmadıysanız, ya da sadece hatırlatıcı olarak, Godot'da vektör kullanımı açıklamasına :ref:`doc_vector_math` bölümünde bakabilirsiniz. Bu öğreticinin kalanı için mecburi değildir, ama bunu bilmek sizin için iyi olacaktır.

source: We also check whether the player is moving so we can call ``play()`` or ``stop()`` on the AnimatedSprite2D.
de: Wir überprüfen auch, ob der Spieler sich bewegt, damit wir ``play()`` oder ``stop()`` auf dem AnimatedSprite2D aufrufen können.
ru: Мы также проверяем, движется ли игрок, чтобы мы могли вызвать ``play()`` или ``stop()`` в AnimatedSprite.

source: ``$`` is shorthand for ``get_node()``. So in the code above, ``$AnimatedSprite2D.play()`` is the same as ``get_node("AnimatedSprite2D").play()``.
de: ``$`` ist eine Abkürzung für ``get_node()``. Im obigen Code ist also ``$AnimatedSprite2D.play()`` das gleiche wie ``get_node("AnimatedSprite2D").play()``.
ru: ``$`` является сокращением для ``get_node()``. В приведенном выше коде ``$AnimatedSprite.play()`` то же самое, что и ``get_node("AnimatedSprite").play()``.

source: In GDScript, ``$`` returns the node at the relative path from the current node, or returns ``null`` if the node is not found. Since AnimatedSprite2D is a child of the current node, we can use ``$AnimatedSprite2D``.
de: In GDScript gibt ``$`` den Node im relativen Pfad zum aktuellen Node zurück, oder liefert ``null``, wenn der Node nicht gefunden wird. Da AnimatedSprite2D ein Child des aktuellen Nodes ist, können wir ``$AnimatedSprite2D`` verwenden.

source: Now that we have a movement direction, we can update the player's position. We can also use ``clamp()`` to prevent it from leaving the screen. *Clamping* a value means restricting it to a given range. Add the following to the bottom of the ``_process`` function (make sure it's not indented under the `else`):
de: Jetzt, da wir eine Bewegungsrichtung haben, können wir die Position des Spielers aktualisieren und mit ``clamp()`` verhindern, dass er den Bildschirm verlässt. Clamping beschränkt einen Wert auf einen angegebenen Bereich. Am Ende der ``_process`` Funktion fügen wir also folgendes hinzu (stellen Sie sicher, dass es unter dem `else` nicht eingerückt ist):
ru: Теперь, когда у нас есть направление движения, мы можем обновить позицию игрока. Мы также можем использовать ``clamp()``, чтобы он не покинул экран. *Clamping* означает ограничение движения диапазоном. Добавьте следующее в конец функции ``_process`` (убедитесь, что он не имеет отступа под `else`):
tr: Artık bir hareket yönümüz olduğuna göre, oyuncunun konumunu güncelleyebiliriz. Ayrıca, ekrandan ayrılmasını önlemek için kırpma, ``clamp()``, da kullanabiliriz. Bir değeri *kırpma*, onu belirli bir aralıkla sınırlamak anlamına gelir. Aşağıdakileri, ``_process`` fonksiyonunun altına ekleyin (girinti seviyesinin `else` 'in altına gitmediğinden emin olun):

source: The `delta` parameter in the `_process()` function refers to the *frame length* - the amount of time that the previous frame took to complete. Using this value ensures that your movement will remain consistent even if the frame rate changes.
de: Der Parameter `delta` in der Funktion `_process ()` bezieht sich auf die *Frame-Länge* - die Zeit, die der vorherige Frame für die Fertigstellung benötigt hat. Durch die Verwendung dieses Werts wird sichergestellt, dass Ihre Bewegung auch dann konstant bleibt, wenn sich die Bildrate ändert.
ru: Параметр "delta" в функции "_process()" означает *длительность кадра*, то есть время, потраченное на завершение обработки предыдущего кадра. Благодаря использованию этого значения скорость движения будет постоянной даже при изменении частоты кадров.
tr: ``_Process()`` fonksiyonundaki `delta` parametresi *kare uzunluğu* 'nu ifade eder - önceki karenin tamamlanması için geçen süre. Bu değeri kullanmak, kare oynatma oranı değişse bile hareketinizin tutarlı kalmasını sağlar.

source: Click "Play Scene" (:kbd:`F6`, :kbd:`Cmd + R` on macOS) and confirm you can move the player around the screen in all directions.
de: Klicken Sie auf "Szene abspielen" (:kbd:`F6`, :kbd:`Cmd + R` unter macOS) und stellen Sie sicher, dass der Spieler sich auf dem Bildschirm in alle Richtungen bewegen kann.
ru: Нажмите "Запустить сцену" (:kbd:`F6`, :kbd:`Cmd + R` on macOS) и удостоверьтесь, что вы можете перемещать игрока по экрану во всех направлениях.
tr: "Sahneyi Oynat"a tıklayın (klavyeden :kbd:`F6`, macOS için :kbd:`Cmd + R`), oyuncuyu ekranda her yöne hareket ettirebildiğinizi doğrulayın.

source: If you get an error in the "Debugger" panel that says
de: Wenn ein Fehler im "Debugger" Bereich auftaucht, der sagt
ru: Если вы получаете ошибку в панели "Отладчик", с надписью
tr: Eğer "Hata Ayıklayıcı" panelinde şu hata mesajı alırsanız

source: this likely means you spelled the name of the AnimatedSprite2D node wrong. Node names are case-sensitive and ``$NodeName`` must match the name you see in the scene tree.
de: dann bedeutet dies wahrscheinlich, dass Sie den Namen des AnimatedSprite2D-Nodes falsch geschrieben haben. Bei Node-Namen wird zwischen Groß- und Kleinschreibung unterschieden und ``$NodeName`` muss mit dem Namen übereinstimmen, den Sie im Szenenbaum sehen.
ru: это, скорее всего, означает, что вы ввели название узла AnimatedSprite неверно. Имена узлов чувствительны к регистру, а ``$NodeName`` должен совпадать с именем, которое вы видите в дереве сцены.

source: Choosing animations
de: Animationen
ru: Выбор анимации
tr: Animasyonları seçme
