Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/04.creating_the_enemy.po
Languages: de, zh_cn

source: Creating the enemy
de: Die Gegner erschaffen
zh_cn: 创建敌人

source: Now it's time to make the enemies our player will have to dodge. Their behavior will not be very complex: mobs will spawn randomly at the edges of the screen, choose a random direction, and move in a straight line.
de: Jetzt ist es an der Zeit die Gegner zu erstellen, denen der Spieler ausweichen muss. Ihr Verhalten wird nicht allzu komplex sein: Mobs werden zufällig an den Rändern des Bildschirms spawnen, eine zufällige Richtung auswählen und sich in einer geraden Linie fortbewegen.
zh_cn: 是时候去做一些玩家必须躲避的敌人了. 它们的行为很简单: 怪物将随机生成在屏幕的边缘, 沿着随机的方向直线移动.

source: We'll create a ``Mob`` scene, which we can then *instance* to create any number of independent mobs in the game.
de: Wir werden dies in eine ``Mob``-Szene einbauen, die wir dann *instanziieren*, um beliebig viele unabhängige Mobs im Spiel erstellen zu können.
zh_cn: 我们将创建一个 ``Mob`` 的怪物场景，以便在游戏中独立\ *实例化*\ 出任意数量的怪物。

source: Node setup
de: Node einrichten
zh_cn: 节点设置

source: Click Scene -> New Scene from the top menu and add the following nodes:
de: Klicken Sie im oberen Menü auf Szene -> Neue Szene und fügen Sie die folgenden Nodes hinzu:
zh_cn: 点击顶部菜单的“场景 -> 新建场景”，然后添加以下节点：

source: :ref:`RigidBody2D <class_RigidBody2D>` (named ``Mob``)
de: :ref:`RigidBody2D <class_RigidBody2D>` (genannt ``Mob``)
zh_cn: :ref:`RigidBody2D <class_RigidBody2D>`\ （名为 ``Mob``\ ）

source: Don't forget to set the children so they can't be selected, like you did with the Player scene.
de: Vergessen Sie nicht, die Child-Objekte so einzustellen, dass sie nicht ausgewählt werden können, wie Sie es bei der Player-Szene getan haben.
zh_cn: 别忘了设置子项，使其无法被选中，就像你对 Player 场景所做的那样。

source: In addition, under the :ref:`CollisionObject2D <class_CollisionObject2D>` section just beneath the **RigidBody2D** section, expand the **Collision** group and uncheck the ``1`` inside the ``Mask`` property. This will ensure the mobs do not collide with each other.
de: Erweitern Sie außerdem im Abschnitt :ref:`CollisionObject2D <class_CollisionObject2D>` unmittelbar unter dem Abschnitt **RigidBody2D** die Gruppe **Collision** und deaktivieren Sie Feld ``1`` in der Property ``Maske``. Dies wird sicherstellen, dass die Mobs nicht miteinander kollidieren.
zh_cn: 此外，在 **RigidBody2D** 部分下方的 :ref:`CollisionObject2D <class_CollisionObject2D>` 部分下，展开 **Collision** 分组并取消选中 ``Mask`` 属性内的 ``1``。这将确保怪物不会相互碰撞。

source: Set up the :ref:`AnimatedSprite2D <class_AnimatedSprite2D>` like you did for the player. This time, we have 3 animations: ``fly``, ``swim``, and ``walk``. There are two images for each animation in the art folder.
de: Richten Sie den :ref:`AnimatedSprite2D <class_AnimatedSprite2D>` ein, wie Sie es für den Player getan haben. Dieses Mal haben wir 3 Animationen: ``fly``, ``swim``, und ``walk``. Es gibt zwei Bilder für jede Animation im "art"-Ordner.
zh_cn: 像设置玩家一样设置 :ref:`AnimatedSprite2D <class_AnimatedSprite2D>`\ 。这一次，我们有 3 个动画：\ ``fly``\ 、\ ``swim``\ 、\ ``walk``\ ，每个动画在 art 文件夹中都有两张图片。

source: The ``Animation Speed`` property has to be set for each individual animation. Adjust it to ``3`` for all 3 animations.
de: Die Eigenschaft ``Animationsgeschwindigkeit`` muß für jede einzelne Animation eingestellt werden. Stellen Sie sie auf ``3`` für alle 3 Animationen ein.
zh_cn: 必须为每个单独动画设置 ``动画速度`` 属性，将三个动画的对应动画速度值都调整为 ``3``\ 。

source: You can use the "Play Animation" buttons on the right of the ``Animation Speed`` input field to preview your animations.
de: Sie können den "Animation abspielen"-Button rechts neben dem Eingabefeld ``Animationsgeschwindigkeit`` verwenden, um eine Vorschau Ihrer Animationen zu erhalten.
zh_cn: 你可以使用 ``动画速度`` 输入区域右侧的“播放动画”按钮预览动画。

source: We'll select one of these animations randomly so that the mobs will have some variety.
de: Wir werden eine der Animationen zufällig auswählen, sodass die Mobs eine gewisse Vielfalt haben.
zh_cn: 我们将随机选择其中一个动画，以便小怪有一些变化。

source: Like the player images, these mob images need to be scaled down. Set the ``AnimatedSprite2D``'s ``Scale`` property to ``(0.75, 0.75)``.
de: Wie die Spielerbilder müssen auch die Mob-Bilder herunterskaliert werden. Setzen Sie die Eigenschaft ``Skalierung`` des ``AnimatedSprite2D`` auf ``(0.75, 0.75)``.
zh_cn: 像玩家的图像一样，这些小怪的图像也要缩小。请将 ``AnimatedSprite2D`` 的 ``Scale`` 属性设为 ``(0.75, 0.75)``\ 。

source: As in the ``Player`` scene, add a ``CapsuleShape2D`` for the collision. To align the shape with the image, you'll need to set the ``Rotation`` property to ``90`` (under "Transform" in the Inspector).
de: Wie in der ``Player``-Szene, fügen Sie eine ``CapsuleShape2D`` für die Kollision hinzu. Um die Form mit dem Bild auszurichten, müssen Sie die Eigenschaft ``Rotation`` auf ``90`` setzen (unter "Transform" im Inspektor).
zh_cn: 像在 ``Player`` 场景中一样，为碰撞添加一个 ``CapsuleShape2D``\ 。为了使形状与图像对齐，你需要将 ``Rotation`` 属性设为 ``90``\ （在“检查器”的“Transform”下）。

source: Save the scene.
de: Speichern Sie die Szene.
zh_cn: 保存该场景。

source: Enemy script
de: Gegner-Skript
zh_cn: 敌人的脚本

source: Add a script to the ``Mob`` like this:
de: Fügen Sie ein Skript zur ``Mob`` wie folgt hinzu:
zh_cn: 像这样将脚本添加到 ``Mob`` 上：

source: Now let's look at the rest of the script. In ``_ready()`` we play the animation and randomly choose one of the three animation types:
de: Lassen Sie uns nun den Rest des Skripts betrachten. In ``_ready()`` wählen wir zufällig einen der drei Animationstypen:
zh_cn: 现在让我们看一下脚本的其余部分。在 ``_ready()`` 中，我们从三个动画类型中随机选择一个播放：

source: First, we get the list of animation names from the AnimatedSprite2D's ``sprite_frames`` property. This returns an Array containing all three animation names: ``["walk", "swim", "fly"]``.
de: Zuerst holen wir uns die Liste der Animationsnamen aus der Property ``sprite_frames`` von AnimatedSprite2D. Das Ergebnis ist ein Array mit allen drei Animationsnamen: ``["walk", "swim", "fly"]``.
zh_cn: 首先，我们从 AnimatedSprite2D 的 ``sprite_frames`` 属性中获取动画名称的列表。返回的是一个数组，该数组包含三个动画名称：\ ``["walk", "swim", "fly"]``\ 。

source: We then need to pick a random number between ``0`` and ``2`` to select one of these names from the list (array indices start at ``0``). ``randi() % n`` selects a random integer between ``0`` and ``n-1``.
de: Wir werden eine zufällige Zahl zwischen ``0`` und ``2`` auswählen müssen, um einen von diesen Namen aus der Liste auswählen zu können (Arrays starten bei ``0``). ``randi() % n`` wählt eine zufällige Integer-Zahl zwischen ``0`` und ``n-1`` aus.
zh_cn: 然后我们需要在 ``0`` 和 ``2`` 之间选取一个随机的数字, 以在列表中选择一个名称(数组索引以 ``0`` 起始). ``randi() % n`` 会在 ``0`` and ``n-1`` 之中选择一个随机整数.

source: The last piece is to make the mobs delete themselves when they leave the screen. Connect the ``screen_exited()`` signal of the ``VisibleOnScreenNotifier2D`` node to the ``Mob`` and add this code:
de: Der letzte Teil besteht darin, dass sich die Mobs selbst löschen, wenn sie den Bildschirm verlassen. Verbinden Sie das ``screen_exited()``-Signal des ``VisibleOnScreenNotifier2D``-Nodes mit dem ``Mob`` und fügen Sie diesen Code hinzu:
zh_cn: 最后一步是让怪物在超出屏幕时删除自己。将 ``VisibleOnScreenNotifier2D`` 节点的 ``screen_exited()`` 信号连接到 ``Mob`` 上，然后添加如下代码：

source: This completes the `Mob` scene.
de: Damit ist die `Mob`-Szene fertig.
zh_cn: 这样就完成了 `Mob` 场景。

source: With the player and enemies ready, in the next part, we'll bring them together in a new scene. We'll make enemies spawn randomly around the game board and move forward, turning our project into a playable game.
de: Da nun die Spieler und die Gegner fertig sind, werden wir sie im nächsten Teil in einer neuen Szene zusammenführen. Wir werden die Gegner zufällig rund um das Spielfeld spawnen lassen und sie vorwärts bewegen, was unser Projekt zu einem spielbaren Spiel macht.
zh_cn: 玩家和敌人已经准备就绪，接下来，我们将在一个新的场景中把他们放到一起。我们将使敌人在游戏板上随机生成并前进，我们的项目将变成一个能玩的游戏。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
