Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/05.the_main_game_scene.po
Languages: de

source: The main game scene
de: Die Hauptszene des Spiels

source: Now it's time to bring everything we did together into a playable game scene.
de: Jetzt ist es Zeit, alles, was wir zusammen gemacht haben, in eine spielbare Szene zusammenzuführen.

source: Create a new scene and add a :ref:`Node <class_Node>` named ``Main``. (The reason we are using Node instead of Node2D is because this node will be a container for handling game logic. It does not require 2D functionality itself.)
de: Erstellen Sie eine neue Szene und fügen einen :ref:`Node <class_Node>` namens ``Main`` hinzu. (Der Grund, warum wir Node anstelle von Node2D verwenden, ist, dass dieser Node ein Container für die Handhabung der Spiellogik sein wird. Er benötigt selbst keine 2D-Funktionalität.)

source: Click the **Instance** button (represented by a chain link icon) and select your saved ``player.tscn``.
de: Klicken Sie auf den **Instanz**-Button (dargestellt durch ein Kettenglied-Icon) und wählen Sie Ihre gespeicherte ``player.tscn`` aus.

source: Now, add the following nodes as children of ``Main``, and name them as shown (values are in seconds):
de: Fügen Sie nun die folgenden Nodes als Child-Elemente von ``Main`` hinzu und benenne sie wie abgebildet (Werte sind in Sekunden):

source: :ref:`Timer <class_Timer>` (named ``MobTimer``) - to control how often mobs spawn
de: :ref:`Timer <class_Timer>` (genannt ``MobTimer``) - um zu steuern, wie oft Mobs spawnen

source: :ref:`Timer <class_Timer>` (named ``ScoreTimer``) - to increment the score every second
de: :ref:`Timer <class_Timer>` (genannt ``ScoreTimer``) - um die Punktzahl jede Sekunde zu erhöhen

source: :ref:`Timer <class_Timer>` (named ``StartTimer``) - to give a delay before starting
de: :ref:`Timer <class_Timer>` (genannt ``StartTimer``) - um eine Verzögerung vor dem Start zu geben

source: :ref:`Marker2D <class_Marker2D>` (named ``StartPosition``) - to indicate the player's start position
de: :ref:`Marker2D <class_Marker2D>` (namens ``StartPosition``) - um die Startposition des Spielers anzugeben

source: Set the ``Wait Time`` property of each of the ``Timer`` nodes as follows:
de: Stellen Sie die Eigenschaft ``Wartezeit`` von jedem der ``Timer`` Nodes wie folgt ein:

source: In addition, set the ``One Shot`` property of ``StartTimer`` to "On" and set ``Position`` of the ``StartPosition`` node to ``(240, 450)``.
de: Stellen Sie zusätzlich die Eigenschaft ``Einmalig`` von ``StartTimer`` auf "An" und die ``Position`` des ``StartPosition``-Nodes auf ``(240, 450)``.

source: Spawning mobs
de: Mobs spawnen

source: The Main node will be spawning new mobs, and we want them to appear at a random location on the edge of the screen. Add a :ref:`Path2D <class_Path2D>` node named ``MobPath`` as a child of ``Main``. When you select ``Path2D``, you will see some new buttons at the top of the editor:
de: Der Main-Node wird neue Mobs spawnen, und wir möchten, dass sie an einer beliebigen Stelle am Rande des Bildschirms erscheinen. Fügen Sie einen :ref:`Path2D <class_Path2D>`-Node namens ``MobPath`` als Child von ``Main`` hinzu. Wenn Sie ``Path2D`` auswählen, sehen Sie oben im Editor einige neue Buttons:

source: Select the middle one ("Add Point") and draw the path by clicking to add the points at the corners shown. To have the points snap to the grid, make sure "Use Grid Snap" and "Use Smart Snap" are both selected. These options can be found to the left of the "Lock" button, appearing as a magnet next to some dots and intersecting lines, respectively.
de: Wählen Sie den Mittleren ("Punkt hinzufügen") und zeichnen Sie den Pfad durch Klicken, um die Punkte an den angezeigten Ecken hinzuzufügen. Damit die Punkte am Raster einrasten, vergewissern Sie sich, dass die Optionen "am Raster einrasten" und "Intelligentes Einrasten" aktiviert sind. Diese Optionen befinden sich links neben dem "Sperren"-Button, der als Magnet neben einigen Punkten bzw. sich schneidenden Linien angezeigt wird.

source: Draw the path in *clockwise* order, or your mobs will spawn pointing *outwards* instead of *inwards*!
de: Zeichnen Sie den Pfad im *Uhrzeigersinn*, sonst spawnen Ihre Mobs *nach außen* statt *nach innen*!

source: After placing point ``4`` in the image, click the "Close Curve" button and your curve will be complete.
de: Nachdem Sie den Punkt ``4`` im Bild platziert haben, klicken Sie auf den "Kurve schließen"-Button und Ihre Kurve ist vollständig.

source: Now that the path is defined, add a :ref:`PathFollow2D <class_PathFollow2D>` node as a child of ``MobPath`` and name it ``MobSpawnLocation``. This node will automatically rotate and follow the path as it moves, so we can use it to select a random position and direction along the path.
de: Jetzt, nachdem der Pfad definiert ist, fügen Sie einen :ref:`PathFollow2D <class_PathFollow2D>` Node als Child von ``MobPath`` hinzu und nennen ihn ``MobSpawnLocation``. Dieser Node wird sich automatisch drehen udn dem Pfad folgen, während er sich bewegt, so dass wir damit eine zufällige Position und Richtung entlang des Pfades auswählen können.

source: Your scene should look like this:
de: Die Szene sollte so aussehen:

source: Main script
de: Main-Skript

source: Add a script to ``Main``. At the top of the script, we use ``@export var mob_scene: PackedScene`` to allow us to choose the Mob scene we want to instance.
de: Fügen Sie ein Skript zu ``Main`` hinzu. Am Anfang des Skripts benutzen wir ``@export var mob_scene: PackedScene``, was uns erlaubt, die Mob-Szene auszuwählen, die wir instanziieren wollen.

source: Click the ``Main`` node and you will see the ``Mob Scene`` property in the Inspector under "Script Variables".
de: Klicken Sie auf den ``Main``-Node und Sie werden die Eigenschaft ``Mob Scene`` im Inspektor unter dem Abschnitt mit den Skriptvariablen sehen.

source: You can assign this property's value in two ways:
de: Sie können einen Wert für diese Eigenschaft auf zwei Wege hinzufügen:

source: Drag ``mob.tscn`` from the "FileSystem" dock and drop it in the **Mob Scene** property.
de: Ziehen Sie ``mob.tscn`` aus dem "Dateisystem"-Dock und legen Sie es in der **Mob Scene**-Eigenschaft ab.

source: Click the down arrow next to "[empty]" and choose "Load". Select ``mob.tscn``.
de: Klicken Sie auf den Pfeil nach unten neben "[leer]" und wählen Sie "Laden". Wählen Sie ``mob.tscn``.

source: Next, select the instance of the ``Player`` scene under ``Main`` node in the Scene dock, and access the Node dock on the sidebar. Make sure to have the Signals tab selected in the Node dock.
de: Als nächstes wählen Sie die Instanz der ``Player``-Szene unter dem ``Main``-Node im Szene-Dock und öffnen das Node-Dock in der Seitenleiste. Stellen Sie sicher, dass das "Signale"-Tab im Node-Dock ausgewählt ist.

source: You should see a list of the signals for the ``Player`` node. Find and double-click the ``hit`` signal in the list (or right-click it and select "Connect..."). This will open the signal connection dialog. We want to make a new function named ``game_over``, which will handle what needs to happen when a game ends. Type "game_over" in the "Receiver Method" box at the bottom of the signal connection dialog and click "Connect". You are aiming to have the ``hit`` signal emitted from ``Player`` and handled in the ``Main`` script. Add the following code to the new function, as well as a ``new_game`` function that will set everything up for a new game:
de: Sie sollten eine Liste der Signale für den ``Player``-Node sehen. Suchen Sie das Signal ``hit`` in der Liste und doppelklicken Sie darauf (oder klicken Sie es mit der rechten Maustaste an und wählen Sie "Verbinden..."). Dies öffnet den Dialog für die Signalverbindung. Wir wollen eine neue Funktion namens ``game_over`` erstellen, die sich darum kümmert, was passiert, wenn ein Spiel endet. Geben Sie "game_over" in das Feld "Empfänger-Methode" am unteren Ende des Signalverbindungsdialogs ein und klicken Sie auf "Verbinden". Das ``hit``-Signal soll vom ``Player`` ausgesendet und im ``Main``-Skript verarbeitet werden. Fügen Sie den folgenden Code zu der neuen Funktion hinzu, sowie eine ``new_game``-Funktion, die alles für ein neues Spiel einrichten wird:

source: Now connect the ``timeout()`` signal of each of the Timer nodes (``StartTimer``, ``ScoreTimer``, and ``MobTimer``) to the main script. ``StartTimer`` will start the other two timers. ``ScoreTimer`` will increment the score by 1.
de: Verbinden Sie nun das ``timeout()``-Signal jedes der Timer-Nodes (``StartTimer``, ``ScoreTimer`` und ``MobTimer``) mit dem Hauptskript. ``StartTimer`` wird die beiden anderen Timer starten. Der ``ScoreTimer`` erhöht den Punktestand um 1.

source: In ``_on_mob_timer_timeout()``, we will create a mob instance, pick a random starting location along the ``Path2D``, and set the mob in motion. The ``PathFollow2D`` node will automatically rotate as it follows the path, so we will use that to select the mob's direction as well as its position. When we spawn a mob, we'll pick a random value between ``150.0`` and ``250.0`` for how fast each mob will move (it would be boring if they were all moving at the same speed).
de: In ``_on_mob_timer_timeout()`` erzeugen wir eine Mob-Instanz, wählen eine zufällige Startposition entlang des ``Path2D`` und setzen den Mob in Bewegung. Der ``PathFollow2D``-Node wird sich automatisch drehen, während er dem Pfad folgt, also werden wir ihn benutzen, um die Richtung und die Position des Mobs zu bestimmen. Wenn wir einen Mob spawnen, wählen wir einen Zufallswert zwischen ``150.0`` und ``250.0`` für die Geschwindigkeit, mit der sich jeder Mob bewegt (es wäre langweilig, wenn sie sich alle mit der gleichen Geschwindigkeit bewegen würden).

source: Note that a new instance must be added to the scene using ``add_child()``.
de: Beachten Sie, dass der Szene mit ``add_child()`` eine neue Instanz hinzugefügt werden muss.

source: Why ``PI``? In functions requiring angles, Godot uses *radians*, not degrees. Pi represents a half turn in radians, about ``3.1415`` (there is also ``TAU`` which is equal to ``2 * PI``). If you're more comfortable working with degrees, you'll need to use the ``deg_to_rad()`` and ``rad_to_deg()`` functions to convert between the two.
de: Warum ``PI``? Bei Funktionen, die Winkel erfordern, verwendet Godot *Bogenmaß*, nicht Grad. Pi steht für eine halbe Umdrehung im Bogenmaß, etwa ``3.1415`` (es gibt auch ``TAU``, das gleich ``2 * PI`` ist). Wenn Sie lieber mit Grad arbeiten, müssen Sie die Funktionen ``deg_to_rad()`` und ``rad_to_deg()`` verwenden, um zwischen den beiden zu konvertieren.

source: Testing the scene
de: Die Szene testen

source: Let's test the scene to make sure everything is working. Add this ``new_game`` call to ``_ready()``:
de: Testen wir die Szene, um sicherzustellen, dass alles funktioniert. Fügen Sie diesen ``new_game``-Aufruf zu ``_ready()`` hinzu:

source: Let's also assign ``Main`` as our "Main Scene" - the one that runs automatically when the game launches. Press the "Play" button and select ``main.tscn`` when prompted.
de: Lassen Sie uns auch ``Main`` als unsere "Hauptszene" zuweisen - diejenige, die automatisch läuft, wenn das Spiel gestartet wird. Drücken Sie den "Play"-Button und wählen Sie ``main.tscn``, wenn Sie dazu aufgefordert werden.

source: If you had already set another scene as the "Main Scene", you can right click ``main.tscn`` in the FileSystem dock and select "Set As Main Scene".
de: Wenn Sie bereits eine andere Szene als "Hauptszene " festgelegt haben, können Sie mit der rechten Maustaste auf ``main.tscn`` im Dateisystem-Dock klicken und "als Hauptszene verweden" wählen.

source: You should be able to move the player around, see mobs spawning, and see the player disappear when hit by a mob.
de: Sie sollten jetzt den Spieler bewegen können, spawnende Mobs sehen und den Spieler verschwinden sehen, wenn er von einem Mob getroffen wird.

source: What's our game lacking? Some user interface. In the next lesson, we'll add a title screen and display the player's score.
de: Was fehlt noch in unserem Spiel? Eine Benutzeroberfläche. In der nächsten Lektion werden wir ein Titelbild hinzufügen und die Punktzahl anzeigen lassen.

source: Translation status
de: Übersetzungsstatus
