Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/06.heads_up_display.po
Languages: de, ru, zh_cn

source: Heads up display
de: Head-up-Display
ru: Графический интерфейс
zh_cn: 游戏信息显示

source: The final piece our game needs is a User Interface (UI) to display things like score, a "game over" message, and a restart button.
de: Das Letzte, was unser Spiel noch benötigt, ist eine Benutzeroberfläche (User Interface, UI) um Dinge anzuzeigen wie die Punktzahl, ein "Game Over"-Text und einen Neustart-Button.
ru: Заключительный этап нашей игры нуждается в Пользовательском интерфейсе (UI), чтобы отображать такие вещи, как рейтинг, сообщение "игра окончена" и кнопку перезапуска.
zh_cn: 我们的游戏最后还需要用户界面（User Interface，UI），显示分数、“游戏结束”信息、重启按钮。

source: Create a new scene, click the "Other Node" button and add a :ref:`CanvasLayer <class_CanvasLayer>` node named ``HUD``. "HUD" stands for "heads-up display", an informational display that appears as an overlay on top of the game view.
de: Erstellen Sie eine neue Szene, klicken Sie den "Anderer Node"-Button und fügen Sie einen :ref:`CanvasLayer <class_CanvasLayer>`-Node mit dem Namen ``HUD`` hinzu. "HUD" steht für "Head-up-Display", eine Informationsanzeige, die als Overlay über der Spielansicht erscheint.
ru: Создайте новую сцену и добавьте узел :ref:`CanvasLayer <class_CanvasLayer>` с именем ``HUD``. "HUD" означает "heads-up display" ("графический интерфейс пользователя"), дисплей, отображающийся поверх игры.
zh_cn: 创建新场景，点击“其他节点”按钮，然后添加一个 :ref:`CanvasLayer <class_CanvasLayer>` 节点并命名为 ``HUD``\ 。“HUD”是“heads-up display”（游戏信息显示）的缩写，是覆盖在游戏视图上显示的信息。

source: The :ref:`CanvasLayer <class_CanvasLayer>` node lets us draw our UI elements on a layer above the rest of the game, so that the information it displays isn't covered up by any game elements like the player or mobs.
de: Mit dem :ref:`CanvasLayer <class_CanvasLayer>`-Node können wir unsere UI-Elemente auf einer Ebene über dem Rest des Spiels zeichnen, so dass die angezeigten Informationen nicht durch irgendwelche Spielelemente wie den Spieler oder Mobs verdeckt werden.
ru: Узел :ref:`CanvasLayer <class_CanvasLayer>` позволяет нам прорисовывать элементы нашего UI на слое поверх всей остальной игры, поэтому отображаемая информация не перекрывается никакими игровыми элементами, такими как игрок или мобы.
zh_cn: :ref:`CanvasLayer <class_CanvasLayer>` 节点可以让我们在游戏的其他部分的上一层绘制 UI 元素，这样它所显示的信息就不会被任何游戏元素（如玩家或敌人）所覆盖。

source: The HUD needs to display the following information:
de: Das HUD sollte die folgenden Informationen anzeigen:
ru: HUD должен отображать следующую информацию:
zh_cn: HUD 中需要显示以下信息：

source: Score, changed by ``ScoreTimer``.
de: Die Punktzahl, geändert durch ``ScoreTimer``.
ru: Счет, измененный ``ScoreTimer``.
zh_cn: 得分，由 ``ScoreTimer`` 更改。

source: A message, such as "Game Over" or "Get Ready!"
de: Eine Nachricht, wie z.B. "Game Over" oder "Get Ready!"
ru: Сообщение, например "Game Over" или "Get Ready!"
zh_cn: 消息，例如“Game Over”或“Get Ready!”

source: A "Start" button to begin the game.
de: Einen "Start"-Button, um das Spiel zu starten.
ru: Кнопка "Start", чтобы начать игру.
zh_cn: “Start”按钮来开始游戏。

source: The basic node for UI elements is :ref:`Control <class_Control>`. To create our UI, we'll use two types of :ref:`Control <class_Control>` nodes: :ref:`Label <class_Label>` and :ref:`Button <class_Button>`.
de: Der Basis-Node für UI-Elemente ist :ref:`Control <class_Control>`. Um unsere Benutzeroberfläche zu erstellen, verwenden wir zwei Arten vom :ref:`Control <class_Control>`-Nodes: :ref:`Label <class_Label>` und :ref:`Button <class_Button>`.
ru: Основной узел для элементов UI — это :ref:`Control <class_Control>`. Чтобы создать наш UI, мы будем использовать два типа узлов :ref:`Control <class_Control>`: :ref:`Label <class_Label>` и :ref:`Button <class_Button>`.
zh_cn: UI 元素的基本节点是 :ref:`Control <class_Control>` 。要创建 UI，我们需使用 :ref:`Control <class_Control>` 下的两种节点：\ :ref:`Label <class_Label>` 和 :ref:`Button <class_Button>`。

source: Create the following as children of the ``HUD`` node:
de: Erstellen Sie das folgenden Nodes als Child-Objekte des ``HUD``-Nodes:
ru: Создайте следующие узлы, как дочерние узла ``HUD``:
zh_cn: 创建以下节点作为 ``HUD`` 的子节点：

source: :ref:`Label <class_Label>` named ``ScoreLabel``.
de: :ref:`Label <class_Label>` genannt ``ScoreLabel``.
ru: :ref:`Label <class_Label>` с именем ``ScoreLabel``.
zh_cn: 名为分数标签 ``ScoreLabel`` 的 :ref:`Label <class_Label>`\ 。

source: :ref:`Label <class_Label>` named ``Message``.
de: :ref:`Label <class_Label>` genannt ``Message``.
ru: :ref:`Label <class_Label>` с именем ``Message``.
zh_cn: 名为消息 ``Message`` 的 :ref:`Label <class_Label>`\ 。

source: :ref:`Button <class_Button>` named ``StartButton``.
de: :ref:`Button <class_Button>` genannt ``StartButton``.
ru: :ref:`Button <class_Button>` с именем ``StartButton``.
zh_cn: 名为开始按钮 ``StartButton`` 的 :ref:`Button <class_Button>`\ 。

source: :ref:`Timer <class_Timer>` named ``MessageTimer``.
de: :ref:`Timer <class_Timer>` genannt ``MessageTimer``.
ru: :ref:`Timer <class_Timer>` с именем ``MessageTimer``.
zh_cn: 名为信息计数器 ``MessageTimer`` 的 :ref:`Timer <class_Timer>`\ 。

source: Click on the ``ScoreLabel`` and type a number into the ``Text`` field in the Inspector. The default font for ``Control`` nodes is small and doesn't scale well. There is a font file included in the game assets called "Xolonium-Regular.ttf". To use this font, do the following:
de: Klicken Sie auf das ``ScoreLabel`` und geben eine Zahl in das ``Text``-Feld im Inspektor ein. Die Default-Schriftart für ``Control``-Nodes ist klein und lässt sich nicht gut skalieren. In den Spiel-Assets ist eine Schriftdatei namens "Xolonium-Regular.ttf" enthalten. Um diese Schriftart zu verwenden, gehen Sie wie folgt vor:
ru: Нажмите на ``ScoreLabel`` и введите число в поле ``Text`` в Инспекторе. Стандартный шрифт для узлов ``Control`` мал и плохо масштабируется. В ресурсы игры включен файл шрифта под названием "Xolonium-Regular.ttf". Чтобы использовать этот шрифт, сделайте следующее:
zh_cn: 点击 ``ScoreLabel`` 并在“检查器”的 ``Text`` 字段中键入一个数字。 ``Control`` 节点的默认字体很小，不能很好地缩放。游戏资产包中有一个叫作“Xolonium-Regular.ttf”的字体文件。 使用此字体需要执行以下操作：

source: Under "Theme Overrides > Fonts", choose "Load" and select the "Xolonium-Regular.ttf" file.
de: Wählen Sie unter "Theme-Überschreibungen > Schriftarten" "Laden" und wählen Sie die Datei "Xolonium-Regular.ttf".
ru: В "Theme Overrides > Fonts" выберите "Загрузить" и выберите файл "Xolonium-Regular.ttf".
zh_cn: 在“Theme Overrides > Fonts”（主题覆盖 > 字体）中选择“加载”，然后选中“Xolonium-Regular.ttf”文件。

source: The font size is still too small, increase it to ``64`` under "Theme Overrides > Font Sizes". Once you've done this with the ``ScoreLabel``, repeat the changes for the ``Message`` and ``StartButton`` nodes.
de: Wenn die Schriftgröße immer noch zu klein ist, erhöhen Sie sie unter "Theme-Überschreibungen> Schriftgrößen" auf ``64``. Wenn Sie dies mit dem ``ScoreLabel`` gemacht haben, wiederholen Sie die Änderungen für die Nodes ``Message`` und ``StartButton``.
ru: Размер шрифта все еще слишком мал, увеличьте его до ``64`` в разделе «Theme Overrides > Font Sizes». Сделав это для ``ScoreLabel``, повторите изменения для узлов ``Message`` и ``StartButton``.
zh_cn: 字体尺寸仍然太小，请在“Theme Overrides > Font Sizes”（主题覆盖 > 字体大小）下将其增加到 ``64``\ 。当 ``ScoreLabel`` 完成此操作后，请重复对 ``Message`` 和 ``StartButton`` 节点做同样的修改。

source: **Anchors:** ``Control`` nodes have a position and size, but they also have anchors. Anchors define the origin - the reference point for the edges of the node.
de: **Anker:** ``Control``-Nodes haben eine Position und eine Größe, aber sie haben auch Anker. Anker definieren den Ursprung - den Referenzpunkt für die Ränder des Nodes.
zh_cn: **锚点：**\ ``Control`` 节点具有位置和大小，但它也有锚点（Anchor）。锚点定义的是原点——节点边缘的参考点。

source: Arrange the nodes as shown below. You can drag the nodes to place them manually, or for more precise placement, use "Anchor Presets".
de: Ordnen Sie die Nodes wie unten gezeigt an. Sie können die Nodes ziehen, um sie manuell zu platzieren, oder für eine genauere Platzierung die "Anker-Vorgaben" verwenden.
ru: Расположите узлы, как показано ниже. Вы можете перетаскивать узлы, чтобы разместить их вручную, или для более точного размещения используйте "Пресеты для значения якорей".
zh_cn: 请将节点如下图排列。拖动节点可以手动放置，也可以使用“锚点预设（Anchor Preset）”进行更精确的定位。

source: Add the text ``0``.
de: Fügen Sie den Text ``0`` hinzu.
ru: Установите текст на ``0``.
zh_cn: 添加文本 ``0``\ 。

source: Set the "Horizontal Alignment" and "Vertical Alignment" to ``Center``.
de: Setzen Sie die "Horizontale Ausrichtung" und "Vertikale Ausrichtung" auf ``Mitte``.
ru: В Инспекторе, установите "Horizontal Alignment" и "Vertical Alignment" на ``Center``.
zh_cn: 将“Horizontal Alignment”和“Vertical Alignment”设置为 ``Center``\ 。

source: Choose the "Anchor Preset" ``Center Top``.
de: Wählen Sie die "Anker-Vorgabe" ``Mitte oben``.
ru: Установите "пресет якорей" на ``Вверху посередине``.
zh_cn: 为“Anchor Preset”选择 ``Center Top``\ 。

source: Message
de: Nachricht

source: Add the text ``Dodge the Creeps!``.
de: Fügen Sie den Text ``Dodge the Creeps!`` hinzu.
ru: Установите текст на ``Увернись от Крипов!``.
zh_cn: 添加文本 ``Dodge the Creeps!``\ 。

source: Set the "Autowrap Mode" to ``Word``, otherwise the label will stay on one line.
de: Setzen Sie den "Autowrap-Modus" auf ``Wort``, sonst bleibt das Label in einer Zeile.
ru: Установите "Autowrap Mode" на ``Word``, в противном случае надпись останется на одной строке.
zh_cn: 将“Autowrap Mode”设置为 ``Word``\ ，否则标签只会有一行。

source: Under "Control - Layout/Transform" set "Size X" to ``480`` to use the entire width of the screen.
de: Unter "Control - Layout/Transformation" setzen Sie "Größe X" auf ``480``, um die gesamte Breite des Bildschirms zu nutzen.
ru: В разделе "Control - Layout/Transform" установите для параметра «Size X» значение ``480``, чтобы использовать всю ширину экрана.
zh_cn: 在“Control - Layout/Transform”中将“Size X”设置为 ``480``\ ，使用屏幕的完整宽度。

source: Choose the "Anchor Preset" ``Center``.
de: Wählen Sie die "Anker-Vorgabe" ``Mitte``.
ru: Установите "Пресет якорей" на ``Центр``.
zh_cn: 为“Anchor Preset”选择 ``Center``\ 。

source: Add the text ``Start``.
de: Fügen Sie den Text ``Start`` hinzu.
ru: Установите текст на ``Старт``.
zh_cn: 添加文本 ``Start``\ 。

source: Under "Control - Layout/Transform", set "Size X" to ``200`` and "Size Y" to ``100`` to add a little bit more padding between the border and text.
de: Unter "Control - Layout/Transformation" setzen Sie "Größe X" auf ``200`` und "Größe Y" auf ``100``, um ein wenig mehr Abstand zwischen dem Rahmen und dem Text zu schaffen.
ru: В разделе "Control - Layout/Transform" установите для параметра «Size X» значение ``480``, а для параметра "Size Y" значение ``100``, чтобы добавить немного больше отступа между границей экрана и текстом.
zh_cn: 在“Control - Layout/Transform”中将“Size X”设置为 ``200``\ 、“Size Y”设置为 ``100``，在边框和文本之间添加间距。

source: Choose the "Anchor Preset" ``Center Bottom``.
de: Wählen Sie die "Anker-Vorgabe" ``Mitte unten``.
ru: Установите "Пресет якорей " на ``Внизу посередине``.
zh_cn: 为“Anchor Preset”选择 ``Center Bottom``\ 。

source: Under "Control - Layout/Transform", set "Position Y" to ``580``.
de: Unter "Control - Layout/Transformation" setzen Sie "Position Y" auf ``580``.
ru: В разделе "Control - Layout/Transform" установите для параметра "Position Y" значение ``580``.
zh_cn: 在“Control - Layout/Transform”中将“Position Y”设置为 ``580``\ 。

source: On the ``MessageTimer``, set the ``Wait Time`` to ``2`` and set the ``One Shot`` property to "On".
de: Stellen Sie im ``MessageTimer`` die ``Wartezeit`` auf ``2`` und stellen Sie die ``Einmalig`` Eigenschaft auf "An".
ru: В ``MessageTimer`` установите параметр ``Wait Time`` на ``2``, а параметр ``One Shot`` на значение "Вкл".
zh_cn: 在 ``MessageTimer`` 中，将 ``Wait Time`` 设置为 ``2`` 并将 ``One Shot`` 属性设置为“启用”。

source: Now add this script to ``HUD``:
de: Fügen Sie nun dieses Skript zu ``HUD`` hinzu:
ru: Теперь добавьте этот скрипт в ``HUD``:
zh_cn: 现将这个脚本添加到 ``HUD``\ ：

source: We now want to display a message temporarily, such as "Get Ready", so we add the following code
de: Wir möchten nun vorübergehend eine Meldung anzeigen, z.B. "Get Ready", also fügen wir folgenden Code ein
ru: Теперь мы хотим временно отобразить сообщение, например "Get Ready" (Приготовьтесь), поэтому мы добавляем следующий код
zh_cn: 当想显示一条临时消息时，比如“Get Ready”，就会调用这个函数

source: We also need to process what happens when the player loses. The code below will show "Game Over" for 2 seconds, then return to the title screen and, after a brief pause, show the "Start" button.
de: Wir müssen auch verarbeiten, was passiert, wenn der Spieler verliert. Der folgende Code zeigt 2 Sekunden lang "Game Over" an, kehrt dann zum Titelbildschirm zurück und zeigt nach einer kurzen Pause den "Start"-Button an.
ru: Также нам нужна функция, которая будет вызываться, когда игрок проигрывает. Она покажет надпись "Game Over" на 2 секунды, затем произойдет возврат к основному экрану, и после короткой паузы появится кнопка "Старт".
zh_cn: 我们还需要处理玩家死亡的情况。以下代码会显示 2 秒“Game Over”，然后返回标题屏幕，暂停一会儿之后再显示“Start”按钮。

source: This function is called when the player loses. It will show "Game Over" for 2 seconds, then return to the title screen and, after a brief pause, show the "Start" button.
de: Diese Funktion wird aufgerufen, wenn der Spieler verliert. "Game Over" wird für 2 Sekunden angezeigt und wechselt dann zum Titelbildschirm. Nach einer kurzen Pause wird die "Start"-Button angezeigt.
ru: Эта функция вызывается, когда игрок проигрывает. Она покажет надпись "Game Over" на 2 секунды, затем произойдет возврат к основному экрану, и после короткой паузы появится кнопка "Start".
zh_cn: 当玩家死亡时调用这个函数。将显示“Game Over”2 秒，然后返回标题屏幕并显示“Start”按钮。

source: When you need to pause for a brief time, an alternative to using a Timer node is to use the SceneTree's ``create_timer()`` function. This can be very useful to add delays such as in the above code, where we want to wait some time before showing the "Start" button.
de: Falls eine kurze Pause benötigt wird, kann als Alternative zum Timer-Node die Funktion ``create_timer()`` von SceneTree verwendet werden. Das kann sehr nützlich sein, um eine Verzögerung hinzuzufügen. Wie im obigen Code, wo wir ein wenig warten wollen, bevor der "Start"-Button angezeigt wird.
ru: Если вам нужно сделать паузу на короткое время, то альтернативой использованию узла Timer является использование функции SceneTree ``create_timer()``. Может быть очень полезно добавлять задержки наподобие таких, как в вышеприведенном коде, где нам хотелось бы подождать немного времени, прежде чем показывать кнопку "Start".
zh_cn: 当你需要暂停片刻时，可以使用场景树的 ``get_tree().create_timer(2)`` 函数替代使用 ``Timer`` 节点。这对于延迟非常有用，例如在上述代码中，在这里我们需要在显示“开始”按钮前等待片刻。

source: Add the code below to ``HUD`` to update the score
de: Fügen Sie den folgenden Code in ``HUD`` ein, um den Spielstand zu aktualisieren
ru: Добавьте приведенный ниже код в ``HUD``, чтобы обновлять счет
zh_cn: 将以下更新分数代码添加到 ``HUD`` 中

source: Connecting HUD to Main
de: Das HUD mit Main verbinden
ru: Подключение HUD к Main
zh_cn: 将 HUD 场景连接到 Main 场景

source: Now that we're done creating the ``HUD`` scene, go back to ``Main``. Instance the ``HUD`` scene in ``Main`` like you did the ``Player`` scene. The scene tree should look like this, so make sure you didn't miss anything:
de: Jetzt, da wir die ``HUD``-Szene erstellt haben, gehen Sie zurück zu ``Main`` und platzieren Sie die ``HUD``-Szene in ``Main`` genauso wie die ``Player``-Szene. Der gesamte Szenenbaum sollte so aussehen, also stellen Sie sicher, dass nichts fehlt:
ru: Теперь, когда мы закончили создание сцены ``HUD``, вернитесь к ``Main``. Инстанцируйте сцену ``HUD`` в ``Main`` подобно тому, как вы это делали со сценой ``Player``. Дерево сцены должно выглядеть так, поэтому убедитесь, что вы ничего не упустили:
zh_cn: 现在我们完成了 ``HUD`` 场景，保存并返回 ``Main`` 场景。和 ``Player`` 场景的做法一样，在 ``Main`` 场景中实例化 ``HUD`` 场景。如果你没有错过任何东西，完整的场景树应该像这样：

source: Now we need to connect the ``HUD`` functionality to our ``Main`` script. This requires a few additions to the ``Main`` scene:
de: Nun müssen wir die ``HUD``-Funktionalität mit unserem ``Main``-Skript verbinden. Dies erfordert einige Ergänzungen in der ``Main``-Szene:
ru: Теперь нам нужно подключить функционал ``HUD`` в наш ``Main``-скрипт. Для этого потребуются некоторые дополнения к сцене ``Main``:
zh_cn: 现在我们需要将 ``HUD`` 功能与我们的 ``Main`` 脚本连接起来。这需要在 ``Main`` 场景中添加一些内容：

source: In the Node tab, connect the HUD's ``start_game`` signal to the ``new_game()`` function of the Main node by clicking the "Pick" button in the "Connect a Signal" window and selecting the ``new_game()`` method or type "new_game" below "Receiver Method" in the window. Verify that the green connection icon now appears next to ``func new_game()`` in the script.
de: Verbinden Sie auf dem "Node"-Tab das Signal ``start_game`` des HUD mit der Funktion ``new_game()`` des Main-Nodes, indem Sie im Fenster "ein Signal verbinden" auf den "Auswählen"-Button klicken und die Methode ``new_game()`` auswählen oder im Fenster unter "Empfänger-Methode" "new_game" eingeben. Vergewissern Sie sich, dass das grüne Verbindungs-Icon nun neben ``func new_game()`` im Skript erscheint.
ru: Во вкладке "Узел" присоедините сигнал HUD ``start_game`` к функции узла Main ``new_game()``, введя "new_game" в поле "Принимающий метод" в окне "Присоединить сигнал к методу" . Убедитесь, что в скрипте рядом с функцией ``func new_game()`` теперь появилась зелёная иконка подключения.
zh_cn: 在“节点”选项卡中，点击“连接信号”窗口中的“选取”按钮，选择 ``new_game()`` 方法或在窗口的“接收方法”下面输入“new_game”，将 HUD 的 ``start_game`` 信号连接到 Main 节点的 ``new_game()`` 函数。请确认脚本中 ``func new_game()`` 的旁边出现了一个绿色的连接图标。

source: In ``new_game()``, update the score display and show the "Get Ready" message:
de: Aktualisieren Sie in ``new_game()`` die Punkteanzeige und zeigen Sie die Meldung "Get Ready" an:
ru: В ``new_game()`` обновим отображение счёта и выведем сообщение "Get Ready":
zh_cn: 在 ``new_game()`` 函数中，更新分数显示并显示“Get Ready”消息：

source: In ``game_over()`` we need to call the corresponding ``HUD`` function:
de: In ``game_over()`` müssen wir die entsprechende ``HUD`` Funktion aufrufen:
ru: В ``game_over()`` нам нужно вызвать соответствующую функцию ``HUD``:
zh_cn: 在 ``game_over()`` 中我们需要调用相应的 ``HUD`` 函数：

source: Finally, add this to ``_on_score_timer_timeout()`` to keep the display in sync with the changing score:
de: Schließlich fügen Sie dies zu ``_on_score_timer_timeout()`` hinzu, um die Anzeige mit dem sich ändernden Spielstand zu synchronisieren:
ru: Наконец добавьте этот код в ``_on_score_Ttmer_timeout()``, чтобы синхронизировать отображение с изменением количества очков:
zh_cn: 最后，将下面的代码添加到 ``_on_score_timer_timeout()`` 中，保持不断变化的分数的同步显示：

source: Remember to remove the call to ``new_game()`` from ``_ready()`` if you haven't already, otherwise your game will start automatically.
de: Vergessen Sie nicht, den Aufruf von ``new_game()`` aus ``_ready()`` zu entfernen, falls Sie das nicht schon getan haben, sonst wird Ihr Spiel automatisch gestartet.
ru: Когда вы убедитесь, что всё работает, удалите вызов ``new_game()`` из ``_ready()``, иначе ваша игра запустится автоматически.
zh_cn: 如果还没做的话，请不要忘记在 ``_ready()`` 中移除对 ``new_game()`` 的调用。否则你的游戏将自动开始。

source: Now you're ready to play! Click the "Play the Project" button. You will be asked to select a main scene, so choose ``main.tscn``.
de: Jetzt können Sie spielen! Klicken Sie auf den "Projekt abspielen"-Button. Sie werden aufgefordert, eine Hauptszene auszuwählen, also wählen Sie ``main.tscn``.
ru: Теперь можно поиграть! Нажмите на кнопку "Запустить проект". Вам будет предложено выбрать основную сцену, выбирайте ``main.tscn``.
zh_cn: 现在你就可以开始游戏了！点击“运行项目”按钮。此时会要求你选择一个主场景，选择 ``main.tscn`` 即可。

source: Removing old creeps
de: Alte Creeps entfernen
ru: Удаляем старых крипов
zh_cn: 删除旧的小怪

source: If you play until "Game Over" and then start a new game right away, the creeps from the previous game may still be on the screen. It would be better if they all disappeared at the start of a new game. We just need a way to tell *all* the mobs to remove themselves. We can do this with the "group" feature.
de: Wenn Sie bis zum "Game Over" spielen und dann ein neues Spiel starten, befinden sich die Creeps des vorherigen Spiel noch auf dem Bildschirm. Es wäre besser, wenn diese beim Start eines neuen Spiels verschwinden würden. Wir benötigen einen Weg um *alle* Mobs zu entfernen und dies geschieht mit dem "Gruppen"-Feature.
ru: Если вы играете до "Game Over", а затем сразу начинаете новую игру, то крипы из предыдущей игры могут все еще оставаться на экране. Было бы лучше, если бы все они исчезали в начале новой игры. Нам просто нужен способ сказать *всем* мобам, чтобы они удалились. Мы можем сделать это с помощью функции "group" ("группа").
zh_cn: 如果你一直玩到“游戏结束”，然后重新开始新游戏，上局游戏的小怪仍然显示在屏幕上。更好的做法是在新游戏开始时清除它们。我们需要一个同时让\ *所有*\ 小怪删除它自己的方法，为此可以使用“分组”功能。

source: In the ``Mob`` scene, select the root node and click the "Node" tab next to the Inspector (the same place where you find the node's signals). Next to "Signals", click "Groups" and you can type a new group name and click "Add".
de: Wählen Sie in der Szene ``Mob`` den Root-Node und klicken Sie auf den "Node"-Tab neben dem Inspektor (die gleiche Stelle, an der Sie die Signale des Nodes finden). Klicken Sie neben "Signale" auf "Gruppen", und Sie können einen neuen Gruppennamen eingeben und auf "Hinzufügen" klicken.
ru: В сцене ``Mob`` выберите корневой узел и нажмите вкладку "Узел" рядом с Инспектором (там же, где вы находите сигналы узла). Рядом с "Сигналы" нажмите "Группы", введите новое имя группы и нажмите "Добавить".
zh_cn: 在 ``Mob`` 场景中，选择根节点，然后单击检查器旁边的“节点”选项卡（在该位置可以找到节点的信号）。 点击“信号”旁边的“分组”，然后可以输入新的组名称，点击“添加”。

source: Now all mobs will be in the "mobs" group. We can then add the following line to the ``new_game()`` function in ``Main``:
de: Nun sind alle Mobs in der Gruppe"mobs". Jetzt können wir folgende Zeile zur Funktion ``new_game()`` in ``Main`` hinzufügen:
ru: Теперь все мобы будут в группе "mobs". Затем мы можем добавить следующие строки к функции ``new_game()`` в ``Main``:
zh_cn: 现在，所有小怪都将属于“mobs”（小怪）分组。我们可以将以下行添加到 ``Main`` 中的 ``new_game()`` 函数中：

source: The ``call_group()`` function calls the named function on every node in a group - in this case we are telling every mob to delete itself.
de: Die Funktion ``call_group()`` ruft die benannte Funktion für jeden Node in einer Gruppe auf - in diesem Fall sagen wir jedem Mob, dass er sich selbst löschen soll.
ru: Функция ``call_group()`` вызывает каждую именованную функцию на каждом узле в группе - в этом случае мы говорим каждому мобу удалять себя.
zh_cn: ``call_group()`` 函数调用组中每个节点上的删除函数——让每个怪物删除其自身。

source: The game's mostly done at this point. In the next and last part, we'll polish it a bit by adding a background, looping music, and some keyboard shortcuts.
de: Das Spiel ist nun zum größten Teil fertig. Im nächsten und letzten Teil werden wir es etwas aufpolieren, indem wir einen Hintergrund, eine Musikschleife und einige Tastenkombinationen hinzufügen.
ru: Игра на данный момент по большей части готова. В следующей и последней части мы немного отполируем её с помощью добавления фона, проигрывания музыки и нескольких сочетаний клавиш.
zh_cn: 游戏在这一点上大部分已经完成。在下一部分和最后一部分中，我们将通过添加背景，循环音乐和一些键盘快捷键来对其进行一些润色。

source: Translation status
de: Übersetzungsstatus
ru: Статус перевода
zh_cn: 翻译状态

source: ScoreLabel
ru: ScoreLabеl

source: StartButton
ru: StartButtоn
