Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/07.finishing-up.po
Languages: de, es, pt_br, zh_cn, zh_tw

source: Finishing up
de: Fertigstellung
es: Finalizando el juego
pt_br: Terminando
zh_cn: 完成了
zh_tw: 最終調整

source: We have now completed all the functionality for our game. Below are some remaining steps to add a bit more "juice" to improve the game experience.
de: Wir haben jetzt alle Funktionen für unser Spiel fertiggestellt. Im Folgenden finden Sie einige verbleibende Schritte, um das Spielerlebnis noch etwas zu verbessern.
es: Hemos completado toda la funcionalidad de nuestro juego. Abajo están algunos pasos restantes para agregar más "sabor" y mejorar la experiencia de juego.
pt_br: Agora completamos toda a funcionalidade do nosso jogo. Abaixo estão alguns passos restantes para dar uma apimentada para melhorar a experiência do jogo. Sinta-se livre para expandir a jogabilidade com suas próprias ideias.
zh_cn: 现在，我们已经完成了游戏的所有功能。以下是一些剩余的步骤，为游戏加点“料”，改善游戏体验。
zh_tw: 現在，這個遊戲的所有功能都已經完成了。接下來的這些步驟可以讓遊戲畫龍點睛、增進遊戲體驗。如果你有更多 Idea 的話，也可以自由地擴充遊戲。

source: Feel free to expand the gameplay with your own ideas.
de: Fühlen Sie sich frei, Ihr Spiel um eigenen Ideen zu erweitern.
es: Siéntete libre de expandir el juego con tus propias ideas.
pt_br: Sinta-se livre para expandir a jogabilidade com suas próprias ideias.
zh_cn: 随意用你自己的想法扩展游戏玩法。
zh_tw: 隨意用你自己的想法擴充遊戲玩法。

source: Background
de: Hintergrund
es: Imagen de fondo
pt_br: Plano de Fundo
zh_cn: 背景
zh_tw: 背景

source: The default gray background is not very appealing, so let's change its color. One way to do this is to use a :ref:`ColorRect <class_ColorRect>` node. Make it the first node under ``Main`` so that it will be drawn behind the other nodes. ``ColorRect`` only has one property: ``Color``. Choose a color you like and select "Layout" -> "Anchors Preset" -> "Full Rect" either in the toolbar at the top of the viewport or in the inspector so that it covers the screen.
de: Der graue Default-Hintergrund ist nicht sehr ansprechend, also sollten wir seine Farbe ändern. Eine Möglichkeit, dies zu tun, besteht darin, einen :ref:`ColorRect <class_ColorRect>`-Node zu verwenden. Machen Sie ihn zum ersten Node unter ``Main``, so dass er hinter den anderen Nodes gezeichnet wird. ``ColorRect`` hat nur eine Eigenschaft: ``Farbe``. Wählen Sie eine Farbe, die Ihnen gefällt, und wählen Sie "Layout" -> "Anker-Vorgaben" -> "Vollständiges Rechteck" entweder in der Toolbar am oberen Rand des Viewports oder im Inspektor, so dass es den Bildschirm bedeckt.
es: El gris por defecto no es muy atractivo, así que cambiemos el color. Un modo de hacer esto es usar un nodo :ref:`ColorRect <class_ColorRect>`. Lo haremos el primer nodo dentro de ``Main`` así aparecerá detrás de los otros nodos. ``ColorRect`` tiene una sola propiedad: ``Color``. Escoge el color que quieras y arrastra .y selecciona "Layout" -> "Anchors Preset" -> "Completo" en la barra de herramientas arriba del viewport o en el inspector así cubrirá toda la pantalla.
zh_cn: 默认的灰色背景不是很吸引人，那么我们就来改一下颜色。一种方法是使用 :ref:`ColorRect <class_ColorRect>` 节点。将其设为 ``Main`` 下的第一个节点，这样这个节点就会绘制在其他节点之后。\ ``ColorRect`` 只有一个属性：\ ``Color``\ （颜色）。选择一个你喜欢的颜色，然后在视口顶部的工具栏或者检查器中选择“布局”->“锚点预设”->“整个矩形”（Layout -> Anchors Preset -> Full Rect），使其覆盖屏幕。
zh_tw: 預設的灰色背景並不是很吸睛，所以來改個顏色。其中一種改背景的方式是新增一個 :ref:`ColorRect <class_ColorRect>` 節點。將 ColorRect 新增為 ``Main`` 底下的第一個節點，這樣 ColorRect 才會被繪製在其他節點的下方。``ColorRect`` 只有一個屬性： ``Color`` （色彩）。選擇一個你喜歡的顏色，並選擇「畫面配置」->「全矩形」，這樣就會覆蓋整個畫面。

source: You could also add a background image, if you have one, by using a ``TextureRect`` node instead.
de: Wenn Sie ein Hintergrundbild haben, können Sie es stattdessen über einen ``TextureRect``-Node hinzufügen.
es: También puedes agregar una imagen de fondo, si tienes una, utilizando un nodo ``TextureRect`` en su lugar.
pt_br: Você também pode adicionar uma imagem de plano de fundo, se tiver uma, ao usar um nó ``TextureRect``.
zh_cn: 如果你有背景图片, 你也可以通过使用 ``TextureRect`` 节点来添加背景图片.
zh_tw: 如果你有適合的圖片的話，也可以用圖片作為背景。改用 ``TextureRect`` 節點即可。

source: Sound effects
de: Soundeffekte
es: Efectos de sonido
pt_br: Efeitos sonoros
zh_cn: 音效
zh_tw: 音效

source: Sound and music can be the single most effective way to add appeal to the game experience. In your game's **art** folder, you have two sound files: "House In a Forest Loop.ogg" for background music, and "gameover.wav" for when the player loses.
de: Sound und Musik können effektive Mittel sein, das Spielerlebnis attraktiver zu gestalten. Im Ordner **art** Ihres Spiels befinden sich zwei Sounddateien: „House in a Forest Loop.ogg“ für Hintergrundmusik und „gameover.wav“ für den Fall, dass der Spieler verliert.
es: La música y el sonido pueden ser el modo más efectivo de agregar atractivo a la experiencia de juego. En la carpeta **art** del juego encontrarás dos archivos de sonido: "House In a Forest Loop.ogg" para música de fondo y "gameover.wav" para cuando el jugador pierde.
zh_cn: 声音和音乐可能是增强游戏吸引力的最有效方法。在游戏 **art** 文件夹中，有两个声音文件：“House in a Forest Loop.ogg”用于背景音乐，而“gameover.wav”用于当玩家失败时。
zh_tw: 音效是一種最有效提升遊戲體驗與吸引力的方法。遊戲素材資料夾中有兩個聲音檔案：背景音樂用的「House In A Forest Loop.ogg」與玩家失敗時用的「gameover.wav」。

source: Add two :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` nodes as children of ``Main``. Name one of them ``Music`` and the other ``DeathSound``. On each one, click on the ``Stream`` property, select "Load", and choose the corresponding audio file.
de: Fügen Sie zwei :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` Nodes als Child-Elemente von ``Main`` hinzu. Benennen Sie einen davon ``Music`` und den anderen ``DeathSound``. Klicken Sie bei jedem Node auf die Eigenschaft ``Stream``, klicken Sie auf „Laden“ und wählen Sie die entsprechende Audiodatei aus.
es: Agrega dos nodos :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` hijos de ``Main``. Nombre uno de ellos ``Music`` y el otro ``DeathSound``. En cada uno, haz clic en la propiedad ``Stream``, selecciona "Load" y escoge el archivo de audio correspondiente.
pt_br: Adicione dois nós :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` como filhos de ``Principal``. Nomeie um deles como ``Musica`` e o outro como ``SomDeMorte``. Em cada um, clique na propriedade ``Stream`` ("fluxo"), selecione "Carregar", e escolha o arquivo sonoro correspondente.
zh_cn: 添加两个 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 节点作为 ``Main`` 的子节点。将其中一个命名为 ``Music``\ ，将另一个命名为 ``DeathSound``\ 。 在每个节点选项上，点击 ``Stream`` 属性，选择 ``加载``\ ，然后选择相应的音频文件。
zh_tw: 在 ``Main`` 中新增兩個 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 節點作為子節點。將其中一個命名為 ``Music`` ，另一個則為 ``DeathSound`` 。在各個節點上點擊 ``Stream`` （串流）屬性，選擇「載入」，並選擇對應的音訊檔。

source: All audio is automatically imported with the ``Loop`` setting disabled. If you want the music to loop seamlessly, click on the Stream file arrow, select ``Make Unique``, then click on the Stream file and check the ``Loop`` box.
de: Alle Audiodateien stellen beim Import die Einstellung ``Schleife`` automatisch auf "Aus". Wenn Sie möchten, dass die Musik in einer Endlosschleife läuft, klicken Sie auf den Pfeil neben der Stream-Datei, wählen Sie ``Einzigartig machen``, klicken Sie dann auf die Stream-Datei und aktivieren Sie die Option ``Schleife``.
es: Todos los audios se importan automáticamente con la configuración ``Loop`` desactivada. Si quieres que la música se reinicie, haz clic derecho en Stream, selecciona ``Hacer Único``, luego haz clic en el archivo Stream y marca la caja ``Loop``.
pt_br: Todo o áudio é automaticamente importado com a configuração ``Loop`` desativada. Se você quiser que a música loop continuamente, clique na seta do arquivo Stream, selecione ``Make Unique``, em seguida, clique no arquivo Stream e verifique a caixa ``Loop``.
zh_cn: 所有音频都会在禁用 ``循环`` 设置的情况下自动导入。如果希望音乐无缝循环，请单击流文件下拉箭头，选择 ``唯一化``\ ，然后再单击流文件并选中 ``循环`` 框。
zh_tw: 所有音訊都會在禁用 ``迴圈`` 設定的情況下自動匯入。如果希望音樂無縫迴圈，請按一下流檔下拉箭頭，選擇 ``唯一化``，然後再按一下流檔並選中 ``迴圈`` 框。

source: To play the music, add ``$Music.play()`` in the ``new_game()`` function and ``$Music.stop()`` in the ``game_over()`` function.
de: Um die Musik abzuspielen, fügen Sie ``$Music.play()`` in der ``new_game()`` Funktion und ``$Music.stop()`` in der ``game_over()`` Funktion hinzu.
es: Para reproducir la música, agregua ``$Music.play()`` en la función ``new_game()`` y ``$Music.stop()`` en ``game_over()``.
pt_br: Para reproduzir a música, adicione ``$Musica.play()``na função ``new_game()`` e ``$Musica.stop()`` na função ``game_over()``.
zh_cn: 要播放音乐, 在 ``new_game()`` 函数中添加 ``$Music.play()``, 在 ``game_over()`` 函数中添加 ``$Music.stop()`` .
zh_tw: 要播放音樂，在 ``new_game()`` 函式中新增 ``$Music.play()`` ，並在 ``game_over()`` 函式中新增 ``$Music.stop()`` 。

source: Finally, add ``$DeathSound.play()`` in the ``game_over()`` function.
de: Fügen Sie abschließend ``$DeathSound.play()`` in der ``game_over()`` Funktion hinzu.
es: Finalmente, agregua ``$DeathSound.play()`` en la función ``game_over()``.
pt_br: Por fim, adicione ``$SomDeMorte.play()`` na função ``game_over()``.
zh_cn: 最后, 在 ``game_over()`` 函数中添加 ``$DeathSound.play()`` .
zh_tw: 最後，在 ``game_over()`` 函式中新增 ``$DeathSound.play()`` 。

source: Keyboard shortcut
de: Tastenkürzel
es: Atajo del teclado
pt_br: Atalho de teclado
zh_cn: 键盘快捷键
zh_tw: 鍵盤快捷鍵

source: Since the game is played with keyboard controls, it would be convenient if we could also start the game by pressing a key on the keyboard. We can do this with the "Shortcut" property of the ``Button`` node.
de: Da das Spiel mit Tastatur gesteuert wird, wäre es praktisch, wenn wir das Spiel auch durch Drücken einer Taste auf der Tastatur starten könnten. Eine Möglichkeit hierzu ist die Verwendung der „Shortcut“ -Eigenschaft des ``Button``-Nodes.
es: Dado que el juego se juega con los controles del teclado, sería conveniente si también pudiéramos iniciar el juego presionando una tecla. Una forma de hacerlo es usando la propiedad "Shortcut" del nodo ``Button``.
pt_br: Como o jogo é jogado com controles de teclado, seria conveniente se pudéssemos iniciar o jogo pressionando uma tecla do teclado. Uma maneira de fazer isso é usando a propriedade "Atalho" do nó ``Button``.
zh_cn: 当游戏使用键盘控制，可以方便地按键盘上的键来启动游戏。一种方法是使用 ``Button`` 节点的 “Shortcut”（快捷键）属性。
zh_tw: 由於這個遊戲是用鍵盤控制來玩的，如果能用鍵盤上的按鍵也能開始新遊戲的話會很方便。我們可以使用 ``Button`` 節點的「Shortcut」（快捷鍵）屬性來做到。

source: In a previous lesson, we created four input actions to move the character. We will create a similar input action to map to the start button.
de: In einer früheren Lektion haben wir vier Eingabeaktionen erstellt, um den Charakter zu bewegen. Wir werden eine ähnliche Eingabeaktion erstellen, um sie der Start-Button zuzuweisen.
es: En una lección anterior, creamos cuatro acciones de entrada para mover el personaje. Crearemos una acción de entrada similar para asignar al botón de inicio.
pt_br: Numa lição anterior, nós criamos quatro ações de entrada para mover o personagem. Criaremos uma ação de entrada similar para o botão de início.
zh_cn: 在上一课中，我们创建了四个输入动作来移动角色。我们将创建一个类似的输入动作来映射到开始按钮。
zh_tw: 在上一課中，我們建立了四個輸入動作來移動角色。我們將建立一個類似的輸入動作來對應到開始按鈕。

source: Select "Project" -> "Project Settings" and then click on the "Input Map" tab. In the same way you created the movement input actions, create a new input action called ``start_game`` and add a key mapping for the :kbd:`Enter` key.
de: Wählen Sie "Projekt" -> "Projekteinstellungen" und klicken Sie dann auf den Tab "Eingabe-Zuordnung". Erstellen Sie dann auf die gleiche Weise, wie Sie die Bewegungseingabeaktionen erstellt haben, eine neue Eingabeaktion namens ``start_game`` und fügen Sie eine Tastenzuordnung für die Taste :kbd:`Enter` hinzu.
es: Seleccione "Proyecto" -> "Configuración del proyecto" y luego haga clic en la pestaña "Mapa de entrada". De la misma manera que creó las acciones de entrada de movimiento, cree una nueva acción de entrada llamada ``start_game`` y agregue una asignación de teclas para la tecla :kbd:`Enter`.
pt_br: Selecione "Project" -> "Project Settings" e clique na aba "Input Map". Da mesma forma que criou as ações de entrada ara movimentação, crie uma nova entrada chamada ``start_game`` e adicione uma tecla mapeada para :kbd:`Enter`.
zh_cn: 选择“项目 -> 项目设置”，然后单击“输入映射”选项卡。与创建移动输入动作的方式相同，创建一个名为 ``start_game`` 的新输入操作，并为 :kbd:`Enter` 添加按键映射。
zh_tw: 選擇“專案 -> 專案設定”，然後按一下“輸入對應”分頁。與建立移動輸入動作的方式相同，建立一個名為 ``start_game`` 的新輸入操作，並為 :kbd:`Enter` 新增按鍵對應。

source: Now would be a good time to add controller support if you have one available. Attach or pair your controller and then under each input action that you wish to add controller support for, click on the "+" button and press the corresponding button, d-pad, or stick direction that you want to map to the respective input action.
de: Jetzt wäre ein guter Zeitpunkt, um Controller-Unterstützung hinzuzufügen, wenn Sie einen Controller zur Verfügung haben. Schließen Sie Ihren Controller an oder verbinden Sie ihn und klicken Sie dann unter jeder Eingabeaktion, für die Sie Controller-Unterstützung hinzufügen möchten, auf den "+"-Button und drücken Sie den entsprechende Button, das Steuerkreuz oder die Stick-Richtung, die Sie der jeweiligen Eingabeaktion zuordnen möchten.
es: Ahora es un bien momento para agregar soporte de controles si tienes uno disponible. Conecta o empareja tu control y luego en cada acción de entrada que quieras que soporte tu control haz click en el botón "+" y presiona el correspondiente botón, d-pad o palanca de dirección que quieras mapear a la respectiva acción de entrada.
pt_br: Agora seria um bom momento para adicionar suporte ao joystick se você tiver um disponível. Anexar ou emparelhe seu joystick e, em seguida, sob cada ação de entrada que você deseja adicionar suporte o joystick, clique no botão "+" e pressione o botão correspondente, d-pad, ou direcional do pino analógicos que você deseja mapear para a respectiva ação de entrada.
zh_cn: 如果你有一个手柄，现在可以添加一个手柄支持。连接上你的手柄，然后在每一个你想添加手柄支持的输入动作下，点击 "+" 按钮然后按下该输入动作对应的按钮，方向键或者摇杆。
zh_tw: 如果你有一個手柄，現在可以新增一個手柄支援。連接上你的手柄，然後在每一個你想新增手柄支援的輸入動作下，點擊 "+" 按鈕然後按下該輸入動作對應的按鈕，方向鍵或者搖桿。

source: In the ``HUD`` scene, select the ``StartButton`` and find its **Shortcut** property in the Inspector. Create a new :ref:`Shortcut <class_Shortcut>` resource by clicking within the box, open the **Events** array and add a new array element to it by clicking on **Array[InputEvent] (size 0)**.
de: Wählen Sie in der ``HUD``-Szene den ``StartButton`` aus und suchen Sie dessen **Tastenkürzel**-Eigenschaft im Inspektor. Erstellen Sie eine neue Ressource :ref:`Shortcut <class_Shortcut>`, indem Sie in das Feld klicken; öffnen Sie dann das Array **Ereignisse** und fügen Sie ein neues Array-Element hinzu, indem Sie auf **Array[InputEvent] (Größe 0)** klicken.
es: En la escena ``HUD``, selecciona el ``StartButton`` y encuentra su propiedad **Shortcut** en el inspector. Crea un nuevo recurso :ref:`Shortcut <class_Shortcut>` haciendo click en el campo, abre el arreglo **Events** y agrega un nuevo elemento al arreglo haciendo clic en **Array[InputEvent] (size 0)**.
zh_cn: 在 ``HUD`` 场景中，选择 ``StartButton`` 并在检查器中找到它的 **Shortcut（快捷方式）**\ 属性。通过在框中单击来创建一个新的 :ref:`快捷键 <class_Shortcut>` 资源，打开 **Events（事件）** 数组并通过单击 **Array[InputEvent] (size 0)** 向其添加一个新的数组元素。
zh_tw: 在 ``HUD`` 場景中，選擇 ``StartButton`` 並在屬性面板中找到它的 **Shortcut（快捷方式）**屬性。通過在框中按一下來建立一個新的 :ref:`快捷鍵 <class_Shortcut>` 資源，打開 **Events（事件）** 陣列並通過按一下 **Array[InputEvent] (size 0)** 向其新增一個新的陣列元素。

source: Create a new :ref:`InputEventAction <class_InputEventAction>` and name it ``start_game``.
de: Erstellen Sie eine neue :ref:`InputEventAction <class_InputEventAction>` und nennen Sie sie ``start_game``.
es: Crea un nuevo :ref:`InputEventAction <class_InputEventAction>` y llámalo ``start_game``.
pt_br: Crie um novo :ref:`InputEventAction <class_InputEventAction>` e nomei-o ```start_game``.
zh_cn: 创建一个新的 :ref:`InputEventAction <class_InputEventAction>`\ 并将其命名为 ``start_game``\ 。
zh_tw: 建立一個新的 :ref:`InputEventAction <class_InputEventAction>`並將其命名為 ``start_game``。

source: Now when the start button appears, you can either click it or press :kbd:`Enter` to start the game.
de: Wenn nun der Start-Button angezeigt wird, können Sie entweder darauf klicken oder die :kbd:`Enter`-Taste drücken, um das Spiel zu starten.
es: Ahora cuando aparezca el botón de inicio, puedes hacer clic en él o presionar la tecla :kbd:`Enter` para iniciar el juego.
pt_br: Agora, quando o botão iniciar aparecer, você pode clicar nele ou pressionar :kbd:`Enter` para iniciar o jogo.
zh_cn: 这样，开始按钮出现后，你就可以点击它或按 :kbd:`Enter` 来启动游戏。
zh_tw: 現在當開始按鈕出現的時候，可以點擊按鈕或是使用按鍵 :kbd:`空白鍵` 來開始新遊戲。

source: And with that, you completed your first 2D game in Godot.
de: Und damit haben Sie ihr erstes 2D Spiel in Godot fertiggestellt.
es: Y con eso, completaste tu primer juego 2D en Godot.
pt_br: E com isso, você completou seu primeiro jogo 2D em Godot.
zh_cn: 就这样，你在 Godot 中完成了你的第一个 2D 游戏。
zh_tw: 就這樣，你在 Godot 中完成了你的第一個 2D 遊戲。

source: You got to make a player-controlled character, enemies that spawn randomly around the game board, count the score, implement a game over and replay, user interface, sounds, and more. Congratulations!
de: Sie haben einen vom Spieler gesteuerten Charakter und zufällig auf dem Spielfeld spawnende Gegner erstellt, den Punktestand gezählt, ein Spielende und einen Neustart implementiert und eine Benutzeroberfläche, Sounds und mehr hinzugefügt. Herzlichen Glückwunsch!
es: Tienes que crear un personaje controlado por el jugador, enemigos que aparecen aleatoriamente alrededor del tablero de juego, contar el puntaje, implementar un juego y una repetición, interfaz de usuario, sonidos y más. ¡Felicidades!
pt_br: Você acabou de fazer um personagem controlado pelo jogador, inimigos que são gerados aleatoriamente pela tela de jogo, contador de pontos, implementar um fim de jogo e repetição, interface de usuário, sons, e mais. Congratulações!!!
zh_cn: 你已经能够制作由玩家控制的角色、在游戏区域内随机产生的敌人、计算分数、实现游戏结束和重玩、用户界面、声音，以及更多内容。祝贺！
zh_tw: 你已經能夠製作由玩家控制的角色、在遊戲區域內隨機產生的敵人、計算分數、實作遊戲結束和重玩、使用者介面、聲音，以及更多內容。祝賀！

source: There's still much to learn, but you can take a moment to appreciate what you achieved.
de: Es gibt noch viel zu lernen, aber Sie können sich einen Moment Zeit nehmen, um sich darüber zu freuen, was Sie erreicht haben.
es: Todavía hay mucho que aprender, pero puedes tomarte un momento para apreciar lo que lograste.
pt_br: Ainda há muito a aprender, mas você pode dar um tempo e apreciar sua conquista.
zh_cn: 还有很多东西需要学习，但你可以花点时间来欣赏你所取得的成就。
zh_tw: 還有很多東西需要學習，但你可以花點時間來欣賞你所取得的成就。

source: And when you're ready, you can move on to :ref:`doc_your_first_3d_game` to learn to create a complete 3D game from scratch, in Godot.
de: Und wenn Sie bereit sind, können Sie mit :ref:`doc_your_first_3d_game` weitermachen, um zu lernen, wie man ein komplettes 3D-Spiel von Grund auf in Godot erstellt.
es: Y cuando estés listo, puedes pasar a :ref:`doc_your_first_3d_game` para aprender a crear un juego 3D completo desde cero, en Godot.
pt_br: E quando você estiver pronto, pode ir a :ref:`doc_your_first_3d_game`para aprender a criar um Jogo 3D completo do zero na Godot.
zh_cn: 当你准备好了，你可以继续学习 :ref:`doc_your_first_3d_game`\ ，学习在 Godot 中从头开始创建一个完整的 3D 游戏。
zh_tw: 當你準備好了，你可以繼續學習 :ref:`doc_your_first_3d_game`，學習在 Godot 中從頭開始建立一個完整的 3D 遊戲。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
pt_br: Progresso da Tradução
zh_cn: 翻译状态
zh_tw: 翻譯狀態
