Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/index.po
Languages: de, pl, tr

source: Your first 2D game
de: Ihr erstes 2D-Spiel
pl: Twoja pierwsza gra 2D
tr: İlk 2B Oyununuz

source: In this step-by-step tutorial series, you will create your first complete 2D game with Godot. By the end of the series, you will have a simple yet complete game of your own, like the image below.
de: In dieser Artikelreihe von Schritt-für-Schritt-Tutorials werden Sie Ihr erstes komplettes 2D-Spiel mit Godot entwickeln. Am Ende der Reihe haben Sie dann ein einfaches, aber vollständiges Spiel, ähnlich dem unten angezeigten Bild.
pl: W tej serii samouczków krok po kroku stworzysz swoją pierwszą, pełnoprawną grę 2D w Godocie. Po ukończeniu tych samouczków będziesz mieć swoją prostą, ale skończoną grę, taką jak na obrazku poniżej.
tr: Bu adım-adım serisinde, Godot kullanarak ilk tamamlanmış 2B oyununuzu oluşturacaksınız. Bu seriyi bitirdiğinizde elinizde, aşağıdaki resimdekine benzer, basit ama size ait tamamlanmış bir oyununuz olacak.

source: You will learn how the Godot editor works, how to structure a project, and build a 2D game.
de: Diese Anleitung wird Ihnen dabei helfen, Ihr erstes Godot-Projekt umzusetzen. Sie werden lernen, wie der Godot-Editor funktioniert, wie ein Projekt zu strukturieren ist und man ein 2D-Spiel erstellt.
pl: Ten samouczek pomoże ci stworzyć pierwszy projekt w Godot. Dowiesz się, jak działa edytor Godot, jak ustawić strukturę projektu i jak zbudować grę 2D.
tr: Godot düzenleyicinin nasıl çalıştığını, bir projeyi nasıl yapılandıracağınızı, ve bir 2B oyun yapmayı öğreneceksiniz.

source: This project is an introduction to the Godot engine. It assumes that you have some programming experience already. If you're new to programming entirely, you should start here: :ref:`doc_scripting`.
de: Dieses Projekt ist eine Einführung in die Godot Engine. Es setzt voraus, dass Sie bereits etwas Programmiererfahrung besitzen. Falls Sie vorher noch nie programmiert haben, sollten Sie hier beginnen: :ref:`doc_scripting`.
tr: Bu proje, Godot oyun motoru ile bir tanışmadır. Az da olsa programlama tecrübesiniz olduğunuzu varsayar. Eğer programlamaya tamamen yeni iseniz, :ref:`doc_scripting` sayfasından başlamalısınız.

source: The game is called "Dodge the Creeps!". Your character must move and avoid the enemies for as long as possible.
de: Das Spiel heißt "Dodge the Creeps!". Ihr Charakter muss sich bewegen, um den Gegnern so lange wie möglich auszuweichen.
pl: Gra nazywa się "Dodge the Creeps!" Twoja postać musi się przemieszczać i unikać wrogów tak długo, jak to możliwe.
tr: Bu oyunun ismi "Dodge The Creeps!" 'dir (Canavarlardan Kaçının!). Karakteriniz hareket etmeli ve olabildiğince uzun bir süre düşmanlardan kaçınmalıdır.

source: You will learn to:
de: Sie werden lernen:
pl: Nauczysz się jak:
tr: Şunları yapmayı öğreneceksiniz:

source: Create a complete 2D game with the Godot editor.
de: ein komplettes 2D-Spiel mit dem Godot-Editor zu erstellen.
pl: stworzyć kompletną grę 2D z pomogą edytora Godota.
tr: Godot düzenleyici kullanarak tamamlanmış bir 2B oyun oluşturmak.

source: Structure a simple game project.
de: ein einfaches Spiele-Projekt zu strukturieren.
pl: uporządkować projekt małej gry.
tr: Basit bir oyun yapısı oluşturmak.

source: Move the player character and change its sprite.
de: den Spielercharakter zu bewegen und dessen Sprite zu verändern.
pl: poruszać postacią gracza oraz zmienić jej grafikę.
tr: Oyuncu karakterini hareket ettirmek, ve onun grafik öğesini değiştirmek.

source: Spawn random enemies.
de: zufällige Gegner zu spawnen.
pl: dodać losowo pojawiających się przeciwników.
tr: Rastgele düşmanlar oluşturmak.

source: Count the score.
de: den Punktestand zu zählen.
pl: zliczać wynik.
tr: Puanı saydırmak.

source: And more.
de: Und mehr.
tr: Ve daha fazlası.

source: You'll find another series where you'll create a similar game but in 3D. We recommend you to start with this one, though.
de: Es gibt eine weitere Artikelreihe, in der man ein ähnliches Spiel in 3D erstellen kann. Wir empfehlen jedoch, mit dieser hier zu starten.
pl: Znajdziesz również inną serię samouczków, gdzie stworzysz podobną grę, ale w 3D. Zalecamy jednak, abyś zaczął od tej.
tr: Buna benzeyen ama bir 3B oyun oluşturacağınız bir başka seri daha var. Ancak, size önerimiz ilk olarak buradan başlamanız.

source: **Why start with 2D?**
de: **Warum sollte man mit 2D beginnen?**
pl: **Czemu zacząć od 2D?**
tr: **Neden 2B ile başlamak**

source: If you are new to game development or unfamiliar with Godot, we recommend starting with 2D games. This will allow you to become comfortable with both before tackling 3D games, which tend to be more complicated.
de: Wenn Sie neu in der Spieleentwicklung sind oder sich mit Godot nicht auskennen, empfehlen wir Ihnen, mit 2D-Spielen zu beginnen. So können Sie sich mit beidem vertraut machen, bevor Sie sich an 3D-Spiele wagen, die in der Regel komplizierter sind.
pl: Jeżeli dopiero zaczynasz tworzyć gry lub nie znasz dobrze Godota, to zalecamy rozpocząć od gier 2D. Pozwoli ci to na nabranie wprawy w obu tych aspektach, zanim weźmiesz się za gry 3D, które zazwyczaj są bardziej skomplikowane.

source: You can find a completed version of this project at this location:
de: Eine vollständige Version dieses Projekts finden Sie unter:
tr: Bu projenin tamamlanmış bir sürümünü şu adreste bulabilirsiniz:

source: Prerequisites
de: Voraussetzungen
pl: Wymagania wstępne
tr: Gereksinimler

source: This step-by-step tutorial is intended for beginners who followed the complete :ref:`Getting Started <toc-learn-step_by_step>`.
de: Dieses Schritt-für-Schritt-Tutorial ist für Anfänger geeignet, die bereits :ref:`Getting Started <toc-learn-step_by_step>` abgehakt haben.
pl: Ten samouczek jest przeznaczony dla początkujących, którzy zapoznali się z: :ref:`Getting Started <toc-learn-step_by_step>`.
tr: Bu adım-adım öğretici, önceki :ref:`Başlangıç <toc-learn-step_by_step>` bölümünü sonuna kadar tamamlamış yeni başlayanlar düşünülerek tasarlandı.

source: We prepared some game assets you'll need to download so we can jump straight to the code.
de: Wir haben einige Spiele-Assets vorbereitet, die Sie herunterladen müssen, damit wir direkt mit dem Code beginnen können.
pl: Przygotowaliśmy kilka zasobów (assetów) do pobrania, dzięki czemu będziemy mogli od razu przejść do kodowania gry.
tr: İndirmeniz için bir takım oyun varlıkları hazırladık, bunları kullanıp doğrudan kodlamaya geçebiliriz.

source: You can download them by clicking the link below.
de: Soe können sie herunterladen, indem Sie auf den Link unten klicken.
pl: Możesz pobrać je klikając w link poniżej.
tr: Bunları aşağıdaki bağlantıya tıklayarak indirebilirsiniz.

source: Contents
de: Inhalt
pl: Zawartość
tr: İçerikler

source: Translation status
de: Übersetzungsstatus
pl: Status tłumaczenia
tr: Çeviri durumu
