Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/complying_with_licenses.po
Languages: de, tr, zh_tw

source: Complying with licenses
de: Einhaltung von Lizenzbedingungen
tr: Lisanslara Uyma
zh_tw: 通過 Mono 進行編譯

source: What are licenses?
de: Was sind Lizenzen?
tr: Lisanslar nedir?
zh_tw: 什麼是許可證？

source: Godot is created and distributed under the `MIT License <https://opensource.org/licenses/MIT>`_. It doesn't have a sole owner either, as every contributor that submits code to the project does it under this same license and keeps ownership of the contribution.
de: Godot wird unter der `MIT Lizenz <https://opensource.org/licenses/MIT>`_ erstellt und vertrieben. Es hat auch keinen alleinigen Eigentümer, da jeder, der Code zum Projekt beisteuert, dies unter derselben Lizenz tut und das Eigentum an seinem Beitrag behält.
tr: Godot, `MIT Lisansı <https://opensource.org/licenses/MIT>`_ altında oluşturulur ve dağıtılır. Bunun mutlak tek bir sahibi de yoktur, çünkü projeye kod gönderen her katılımcı bunu aynı lisans altında yapar ve katkının sahipliğini elinde tutar.
zh_tw: Godot 是根據 `MIT License <https://opensource.org/licenses/MIT>`_ 建立並分發的。它也沒有唯一的所有者，因為向該專案提交程式碼的每個貢獻者都在相同的許可證下執行該程式碼，並保留貢獻的所有權。

source: The license is the legal requirement for you (or your company) to use and distribute the software (and derivative projects, including games made with it). Your game or project can have a different license, but it still needs to comply with the original one.
de: Die Lizenz ist die rechtliche Voraussetzung dafür, dass Sie (oder Ihr Unternehmen) die Software (und davon abgeleitete Projekte, einschließlich der damit erstellten Spiele) verwenden und veröffentlichen dürfen. Ihr Spiel oder Projekt kann eine andere Lizenz haben, aber es muss immer noch mit der ursprünglichen Lizenz übereinstimmen.
tr: Bu lisans, sizin (veya şirketiniz) için, bu yazılımı (ve, bununla yapılan oyunlar dahil, bundan türetilmiş projeleri) kullanmanız ve dağıtmanız için yasal bir zorunluluktur. Kendi oyununuz veya projeniz farklı bir lisansa sahip olabilir, ancak yine de bu orjinal olana uyması gerekir.
zh_tw: 許可證是您（或您的公司）使用和分發軟體（以及衍生專案，包括用它製作的遊戲）的法律要求。您的遊戲或專案可以具有不同的許可證，但仍需要遵守原始許可證。

source: This section covers compliance with licenses from a user perspective. If you are interested in licence compliance as a contributor, you can find guidelines :ref:`here <doc_best_practices_for_engine_contributors_license_compliance>`.
de: Dieser Abschnitt behandelt die Einhaltung von Lizenzen aus der Sicht der Nutzer. Falls Sie als Mitwirkende an der Einhaltung von Lizenzen interessiert sind, finden Sie Richtlinien :ref:`hier <doc_best_practices_for_engine_contributors_license_compliance>`.
zh_tw: 本節從使用者的角度介紹了許可證合規性。 如果你作為貢獻者對許可證合規性感興趣，可以在 :ref:`這裡 <doc_best_practices_for_engine_contributors_license_compliance>` 找到指南說明。

source: In your project's credits screen, remember to also list third-party notices for assets you're using, such as textures, models, sounds, music and fonts.
de: Denken Sie daran im Credits-Bildschirm Ihres Projekts auch die Hinweise von Dritten für die von Ihnen verwendeten Assets wie Texturen, Modelle, Sounds, Musik und Schriftarten aufzuführen.
tr: Projenizin katkı verenler ekranında, kullandığınız dokular, modeller, sesler, müzik ve yazı tipleri gibi varlıklar için de üçüncü-taraf bildirimlerini listelemeyi unutmayın.
zh_tw: 在你的專案的致謝介面，請記得列出你所使用的紋理、模型、音效、音樂、字形等素材的協力廠商通告。

source: Free assets in particular often come with licenses that require attribution. Double-check their license before using those assets in a project.
de: Vor allem kostenlose Assets sind oft mit Lizenzen versehen, die eine Namensnennung erfordern. Überprüfen Sie die Lizenz, bevor Sie diese Assets in einem Projekt verwenden.
tr: Özellikle ücretsiz varlıklar, genellikle atıf gerektiren lisanslarla birlikte gelir. Bu varlıkları bir projede kullanmadan önce, lisanslarını iki kez kontrol edin.
zh_tw: 值得注意的是，免費素材的許可證經常要求署名。在專案中使用這些素材前，請仔細確認其許可證。

source: Requirements
de: Anforderungen
tr: Gereklilikler
zh_tw: 系統需求

source: In the case of the MIT license, the only requirement is to include the license text somewhere in your game or derivative project.
de: Im Falle der MIT-Lizenz besteht die einzige Anforderung darin, den Lizenztext irgendwo in Ihrem Spiel oder abgeleiteten Projekt einzubinden.
tr: MIT lisansı söz konusu olduğunda tek gereklilik, lisans metnini oyununuzda veya türev projenizde bir yere eklemektir.
zh_tw: 對於MIT許可證，唯一的要求是將許可證文字包含在您的遊戲或衍生專案中。

source: This text reads as follows:
de: Dieser Text lautet wie folgt (eine sinngemäße Übersetzung finden Sie `hier <https://de.wikipedia.org/wiki/MIT-Lizenz>`_):
tr: Bu metnin tamamı şöyledir:
zh_tw: 文字內容如下：

source: This game uses Godot Engine, available under the following license:
tr: Bu oyun, aşağıdaki lisanslara tabi olarak, Godot Engine'i kullanır:
zh_tw: 該遊戲使用 Godot Engine，可通過以下許可獲得：

source: Copyright (c) 2014-present Godot Engine contributors. Copyright (c) 2007-2014 Juan Linietsky, Ariel Manzur.
tr: Telif hakkı (c) 2014-günümüz Godot Engine katkıda bulunanlara aittir. Telif hakkı (c) 2007-2014 Juan Linietsky, Ariel Manzur 'a aittir.
zh_tw: 版權所有 (c) 2014 至今 Godot 引擎貢獻者。版權所有 (c) 2007-2014 Juan Linietsky、Ariel Manzur。

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
tr: Bu yazılımın ve ilgili belgeleme dosyalarının ("Yazılım") bir kopyasını elde eden herhangi bir kişiye, Yazılımın kopyalarını kullanma, kopyalama, değiştirme, birleştirme, yayınlama, dağıtma, alt lisans verme ve/veya satma hakları dahil ancak bunlarla sınırlı olmamak üzere, kısıtlama olmaksızın Yazılım üzerinde işlem yapma ve Yazılımın verildiği kişilere aşağıdaki koşullara tabi olarak bunu yapma izni ücretsiz olarak verilmektedir:
zh_tw: 特此免費授予任何獲得本軟體副本和相關文件檔（下稱“軟體”）的人不受限制地處置該軟體的權利，包括不受限制地使用、複製、修改、合併、發行、分發、轉授許可和/或出售該軟體副本，以及再授權被配發了本軟體的人如上的權利，須在下列條件下：

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
tr: Yukarıdaki telif hakkı bildirimi ve bu izin bildirimi Yazılımın tüm kopyalarına veya önemli kısımlarına dahil edilecektir.
zh_tw: 以上版權宣告和本許可宣告應包含在本軟體的所有副本或大部分內容中。

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
tr: YAZILIM, TİCARİ ELVERİŞLİLİK, BELİRLİ BİR AMACA UYGUNLUK VE İHLAL ETMEME GARANTİLERİ DAHİL ANCAK BUNLARLA SINIRLI OLMAMAK ÜZERE AÇIKÇA BELİRTİLEN VEYA İMA EDİLEN HİÇBİR GARANTİ OLMAKSIZIN "OLDUĞU GİBİ" SUNULMAKTADIR. YAZARLAR VEYA TELİF HAKKI SAHİPLERİ HİÇBİR DURUMDA YAZILIMDAN VEYA YAZILIMIN KULLANIMINDAN YA DA YAZILIMLA İLGİLİ DİĞER İŞLEMLERDEN KAYNAKLANAN VEYA BUNLARLA BAĞLANTILI OLARAK ORTAYA ÇIKAN SÖZLEŞME, HAKSIZ FİİL VEYA BAŞKA BİR ŞEKİLDE HERHANGİ BİR İDDİA, ZARAR VEYA BAŞKA BİR YÜKÜMLÜLÜKTEN SORUMLU TUTULAMAZ.
zh_tw: 本軟體是“按原樣”提供的，沒有任何形式的明示或暗示的保證，包括但不限於適銷性，特定用途的適用性和不侵權的保證。在任何情況下，作者或版權持有者均不對因本軟體或本軟體的使用或其他交易而引起的，因本軟體的使用或與本軟體有關的合同，侵權或其他行為的任何索賠，損害或其他責任負責。

source: Your games do not need to be under the same license. You are free to release your Godot projects under any license and to create commercial games with the engine.
de: Ihre Spiele müssen nicht unter der gleichen Lizenz stehen. Es steht Ihnen frei, Ihre Godot-Projekte unter jeder beliebigen Lizenz zu veröffentlichen und kommerzielle Spiele mit der Engine zu entwickeln.
tr: Oyunlarınızın aynı lisans altında olması gerekmez. Godot projelerinizi herhangi bir lisans altında yayınlamakta ve motorla ticari oyunlar yaratmakta özgürsünüz.
zh_tw: 您的遊戲無需遵循相同的許可證。您可以選擇任意許可證自由地發行自己的 Godot 專案，並使用該引擎建立商業遊戲。

source: Inclusion
de: Einbinden des Lizenztextes
tr: Dahil Etme
zh_tw: 包含

source: The license does not specify how it has to be included, so anything is valid as long as it can be displayed under some condition. These are the most common approaches (only need to implement one of them, not all).
de: In der Lizenz ist nicht festgelegt, wie sie eingebunden werden muss, es ist also alles erlaubt, solange die Lizenz auf irgendeine Weise angezeigt werden kann. Dies sind die gebräuchlichsten Ansätze (es muss nur einer von ihnen umgesetzt werden, nicht alle).
tr: Lisans, nasıl dahil edilmesi gerektiğini belirtmez, bu nedenle bazı koşullar altında görüntülenebildiği sürece her şey geçerlidir. Bunlar en yaygın yaklaşımlardır (sadece birini uygulamak gerekir, hepsini değil).
zh_tw: 許可證沒有指定必須包含的方式, 因此任何內容只要在某些情況下可以顯示就有效. 這些是最常見的方法(只需要實作其中一種, 而不是全部).

source: Godot provides several methods to get license information in the Engine singleton. This allows you to source the license information directly from the engine binary, which prevents the information from becoming outdated if you update engine versions.
de: Godot bietet mehrere Methoden zum Abrufen von Lizenzinformationen im Engine-Singleton. Dies ermöglicht es Ihnen, die Lizenzinformationen direkt aus der Engine-Binärdatei zu beziehen, wodurch verhindert wird, dass die Informationen veraltet sind, wenn Sie Engine-Versionen aktualisieren.
zh_tw: Godot 提供了多種方法來獲取引擎單例中的許可證資訊。 這將允許你直接從引擎二進位檔案中獲取許可證資訊，從而防止更新引擎版本時資訊過時。

source: For the engine itself:
de: Für die Engine selbst:
zh_tw: 對於引擎自己：

source: For third-party components used by the engine:
de: Für Komponenten von Drittanbietern, die von der Engine verwendet werden:
zh_tw: 對於引擎使用的協力廠商元件：

source: :ref:`Engine.get_license_info<class_Engine_method_get_license_info>`
zh_tw: :ref:`CanvasItem.get_canvas_transform() <class_CanvasItem_method_get_canvas_transform>`

source: :ref:`Engine.get_copyright_info<class_Engine_method_get_copyright_info>`
zh_tw: :ref:`CanvasItem.get_viewport_transform() <class_CanvasItem_method_get_viewport_transform>`

source: For miscellaneous engine contributor information. You don't have to include these ones in your project, but they're listed here for reference:
de: Für verschiedene Informationen zu Mitwirkenden der Engine. Sie müssen diese Informationen nicht in Ihr Projekt aufnehmen, aber sie sind hier als Referenz aufgeführt:
zh_tw: 對於各位引擎貢獻者的資訊。你不需要將他們包括在你的專案中，但這些資訊將會列在這裡提供參考：

source: :ref:`Engine.get_author_info<class_Engine_method_get_author_info>`
zh_tw: :ref:`CanvasItem.get_global_transform() <class_CanvasItem_method_get_global_transform>`

source: :ref:`Engine.get_donor_info<class_Engine_method_get_donor_info>`
zh_tw: :ref:`CanvasItem.get_viewport_transform() <class_CanvasItem_method_get_viewport_transform>`

source: Credits screen
de: Credits-Bildschirm
tr: Katkıda bulunanlar ekranı
zh_tw: 演職員表

source: Include the above license text somewhere in the credits screen. It can be at the bottom after showing the rest of the credits. Most large studios use this approach with open source licenses.
de: Fügen Sie den obigen Lizenztext irgendwo in den Credits-Bildschirm ein. Er kann ganz unten stehen, nachdem der Rest der Credits angezeigt wurden. Die meisten großen Studios verwenden diesen Ansatz bei Open-Source-Lizenzen.
tr: Yukarıdaki lisans metnini katkıda bulunanlar ekranında bir yere ekleyin. Diğer katkıların hepsini gösterdikten sonra en altta olabilir. Çoğu büyük stüdyo, açık kaynak lisansları için bu yaklaşımı kullanır.
zh_tw: 在片頭畫面的某處加入上述許可文字. 它可以在顯示其餘的片頭後的底部. 大多數大型工作室都使用這種方法來處理開放源碼許可證.

source: Licenses screen
de: Lizenzbildschirm
tr: Lisanslar ekranı
zh_tw: 授權

source: Some games have a special menu (often in the settings) to display licenses. This menu is typically accessed with a button called **Third-party Licenses** or **Open Source Licenses**.
de: Einige Spiele haben ein spezielles Menü (oft in den Einstellungen), um Lizenzen anzuzeigen. Dieses Menü wird in der Regel über einen Button namens **Drittanbieterlizenzen** oder **Open-Source-Lizenzen** aufgerufen.
zh_tw: 有的遊戲有一個特設的功能表（通常在設定裡面）來顯示許可證。這個功能表通常通過 **協力廠商協定** 或者 **開源協定** 按鈕存取。

source: Output log
de: Ausgabe-Log
tr: Çıktı günlüğü
zh_tw: 輸出紀錄

source: Accompanying file
de: Begleitdatei
tr: Eşlik eden dosya
zh_tw: 附帶檔案

source: If the game is distributed on desktop platforms, a file containing the license can be added to the software that is installed to the user PC.
de: Wenn das Spiel für Desktop-Plattformen veröffentlicht wird, kann der Software, die auf dem Benutzer-PC installiert wird, eine Datei mit der Lizenz hinzugefügt werden.
tr: Eğer oyun masaüstü platformlarda dağıtılıyorsa, lisansı içeren bir dosya kullanıcının bilgisayarına yüklenen yazılıma eklenebilir.
zh_tw: 如果遊戲是在桌面平臺上發行的，可以在安裝到使用者 PC 的軟體中加入一個包含許可證的檔。

source: Printed manual
de: Gedrucktes Handbuch
tr: Basılı kılavuz
zh_tw: 印刷手冊

source: If the game includes printed manuals, license text can be included there.
de: Wenn das Spiel gedruckte Handbücher enthält, kann der Lizenztext darin enthalten sein.
tr: Eğer oyun basılı kılavuzlar içeriyorsa, lisans metni buraya dahil edilebilir.
zh_tw: 如果遊戲中包含印刷手冊，可以在其中加入授權文字。

source: Link to the license
de: Ein Link zur Lizenz
tr: Lisanlara bağlantı
zh_tw: 同意授權條款

source: The Godot Engine developers consider that a link to ``godotengine.org/license`` in your game documentation or credits would be an acceptable way to satisfy the license terms.
de: Die Godot-Engine-Entwickler sind der Ansicht, dass ein Link zu ``godotengine.org/license`` in Ihrer Spieldokumentation oder in den Credits ein akzeptabler Weg ist, um die Lizenzbedingungen zu erfüllen.
tr: Godot Engine geliştiricileri, oyun belgelerinizde veya katkıda bulunanlar kısmında ``godotengine.org/license`` adresine bir bağlantı vermenin, lisans koşullarını yerine getirmenin kabul edilebilir bir yolu olabileceğini düşünmektedir.
zh_tw: Godot 引擎開發者認為，在你遊戲的文件或者製作組資訊中加入指向 ``godotengine.org/license`` 的連結就可以滿足許可證的條款。

source: Third-party licenses
de: Lizenzen von Drittanbietern
tr: Üçüncü-taraf lisanslar
zh_tw: 第三方工具

source: Godot itself contains software written by `third parties <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Most of it does not require license inclusion, but some do. Make sure to do it if these are compiled in your Godot export template. If you're using the official export templates, all libraries are enabled. This means you need to provide attribution for all the libraries listed below.
de: Godot selbst enthält Software, die von `Drittanbietern <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ geschrieben wurde. Die meisten erfordern keine Lizenzeinbindung, aber einige schon. Achten Sie darauf, dies zu tun, wenn diese in Ihrer Godot-Exportvorlage kompiliert sind. Wenn Sie die offiziellen Exportvorlagen verwenden, sind alle Bibliotheken aktiviert. Das bedeutet, dass Sie für alle unten aufgeführten Bibliotheken eine Lizenz angeben müssen.
tr: Godot'nun kendisi de `üçüncü-taraflar <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ tarafından yazılmış yazılımlar içerir. Bunların bir çoğu lisans dahil etmeyi gerektirmez, ancak bazıları gerektirir. Eğer bunlar Godot dışa aktarma şablonunuzda derlenmişse, öyle yaptığınızdan emin olun. Resmi dışa aktarma şablonlarını kullanıyorsanız, tüm kütüphaneler etkinleştirilmiştir. Bu da, aşağıda listelenen tüm kütüphaneler için atıf sağlamanız gerektiği anlamına gelir.
zh_tw: Godot本身包含 `協力廠商 <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ 編寫的軟體. 大多數軟體不需要包含許可證, 但有些需要. 如果這些軟體在你的Godot匯出範本中被編譯, 請確保這樣做. 如果你使用的是官方的匯出範本, 所有的庫都會被啟用. 這意味著你需要為下面列出的所有庫提供歸屬.

source: Here's a list of libraries requiring attribution:
de: Hier finden Sie eine Liste der Bibliotheken, die eine Namensnennung verlangen:
tr: İşte atıf gerektiren kütüphanelerin bir listesi:
zh_tw: 以下是需要歸類的庫的列表:

source: Godot uses `FreeType <https://www.freetype.org/>`_ to render fonts. Its license requires attribution, so the following text must be included together with the Godot license:
de: Godot nutzt `FreeType <https://www.freetype.org/>`_ um Schriftarten zu rendern. Die FreeType-Lizenz erfordert eine namentliche Nennung, weshalb der folgende Text gemeinsam mit der Godot-Lizenz enthalten sein muss:
tr: Godot yazı tiplerini işlemek için `FreeType <https://www.freetype.org/>`_ kullanır. Lisansı atıf gerektirir, bu nedenle aşağıdaki metin Godot lisansı ile birlikte eklenmelidir:
zh_tw: Godot 使用 `FreeType <https://www.freetype.org/>`_ 來算繪字形。它的許可證要求注明出處，因此以下文字必須和 Godot 許可證一起加入：

source: Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved.
tr: Bu yazılımın bazı bölümlerinin telif hakkı © <yıl> The FreeType Project (www.freetype.org) 'e aittir. Tüm hakları saklıdır.
zh_tw: 本軟體的部分內容的版權為 © <年份> The FreeType Project（www.freetype.org）。保留所有權利。

source: <year> should correspond to the value from the FreeType version used in your build. This information can be found in the editor by opening the **Help > About** dialog and going to the **Third-party Licenses** tab.
de: Beachte, dass <year> dem Wert der im Build genutzten FreeType-Version entsprechen sollte. Diese Information kann im Editor über das Öffnen des **Hilfe > Über Godot**-Dialogs im **Lizenzen von Dritten**-Tab gefunden werden.
tr: <yıl>, derlemenizde kullanılan FreeType sürümündeki değere karşılık gelmelidir. Bu bilgiyi, düzenleyicide **Yardım > Hakkında** iletişim kutusunu açıp, **Üçüncü Taraf Lisansları** sekmesine giderek bulabilirsiniz.
zh_tw: 注意 <年份> 的取值應當與你所使用的建構中 FreeType 的版本對應。該資訊可以在編輯器中查看：打開 **幫助 > 關於** 對話方塊，切換到 **協力廠商許可證** 分頁。

source: Godot includes the `ENet <http://enet.bespin.org/>`_ library to handle high-level multiplayer. ENet has similar licensing terms as Godot:
de: Godot enthält die `ENet <http://enet.bespin.org/>`_-Bibliothek, um hochwertige Multiplayer-Features zu ermöglichen. Für ENet gelten ähnliche Lizenzbedingungen wie für Godot:
tr: Godot, yüksek-seviye çoklu oyuncuyu idare etmek için `ENet <http://enet.bespin.org/>`_ kütüphanesini içerir. ENet, Godot ile benzer lisans koşullarına sahiptir:
zh_tw: Godot包括 `ENet <http://enet.bespin.org/>`_ 庫來處理高級多人遊戲.ENet的許可條款與Godot類似:

source: Copyright (c) 2002-2020 Lee Salzman
tr: Telif Hakkı (c) 2002-2020 Lee Salzman 'a aittir
zh_tw: 版權所有 (c) 2002-2016 Lee Salzman

source: If the project is exported with Godot 3.1 or later, it includes `mbed TLS <https://tls.mbed.org>`_. The Apache license needs to be complied to by including the following text:
de: Wenn das Projekt mit Godot 3.1 oder neuer exportiert wird, enthält es `mbed TLS <https://tls.mbed.org>`_. Die Apache-Lizenz muss durch Einfügen des folgenden Textes berücksichtigt werden:
tr: Eğer proje, Godot 3.1 veya üstü ile dışa aktarılmışsa, `mbed TLS <https://tls.mbed.org>`_ içerir. Aşağıdaki metin eklenerek Apache lisansına uyulması gereklidir:
zh_tw: 使用 Godot 3.1 或以上版本的專案包含了 `mbed TLS <https://tls.mbed.org>`_ 。需要通過包含以下文字來遵守 `MBedTLS <https://tls.mbed.org>`_ Apache 許可證：

source: Copyright The Mbed TLS Contributors
tr: Telif Hakkı Mbed TLS Katkıda Bulunanlar 'a aittir
zh_tw: 版權所有 Mbed TLS 貢獻者

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at
tr: Apache Lisansı, Sürüm 2.0 ("Lisans") kapsamında lisanslanmıştır; bu dosyayı, Lisans'a uygunluk dışında kullanamazsınız. Lisansın bir kopyasını şu adresten edinebilirsiniz
zh_tw: 根據 Apache 許可證 2.0 版本（以下簡稱“許可證”）授權；您不得使用本檔，除非符合許可證的規定。你可以在以下位址獲得許可證的副本

source: Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
tr: Yürürlükteki yasalar gerektirmedikçe veya yazılı olarak kabul edilmedikçe, Lisans kapsamında dağıtılan yazılım, açıkça belirtilen veya ima edilen HERHANGİ BİR GARANTİ VEYA KOŞUL OLMAKSIZIN, "OLDUĞU GİBİ" TEMELİNDE dağıtılır. Lisans kapsamındaki izinleri ve sınırlamaları düzenleyen özel dil için Lisansa bakın.
zh_tw: 除非適用法律要求或書面同意, 否則根據許可證分發的軟體是以 "原樣" 為基礎分發的, 沒有任何形式的明示或暗示的保證或條件. 請參閱許可證中關於許可證下許可權和限制的具體語言.

source: If you exported your project using a :ref:`custom build with specific modules disabled <doc_optimizing_for_size>`, you don't need to list the disabled modules' licenses in your exported project.
de: Wenn Sie Ihr Projekt mit einem :ref:`benutzerdefinierten Build mit deaktivierten Modulen <doc_optimizing_for_size>` exportiert haben, müssen Sie die Lizenzen der deaktivierten Module in Ihrem exportierten Projekt nicht auflisten.
tr: Eğer projenizi, :ref:`belirli birimleri devre dışı bırakıp özel derleme <doc_optimizing_for_size>` kullanarak dışa aktardıysanız, dışa aktarılan projenizde devre dışı bırakılan modüllerin lisanslarını listelemeniz gerekmez.
zh_tw: 如果你匯出的專案使用的是 :ref:`禁用了特定模組的自訂建構 <doc_optimizing_for_size>` ，在匯出後的專案中無需列出禁用模組的協定。

source: Translation status
de: Übersetzungsstatus
tr: Çeviri durumu
zh_tw: 翻譯狀態

source: Printing the licensing text using the :ref:`print() <class_@GlobalScope_method_print>` function may be enough on platforms where a global output log is readable. This is the case on desktop platforms, Android and HTML5 (but not iOS).
de: Die Ausgabe des Lizenzierungstextes mit der Funktion :ref:`print() <class_@GlobalScope_method_print>` kann auf Plattformen ausreichen, auf denen ein globales Ausgabeprotokoll lesbar ist. Dies ist der Fall auf Desktop-Plattformen, Android und HTML5 (aber nicht iOS).
