Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: Which programming languages are supported in Godot?
cs: Které programovací jazyky jsou podporovány v Godot?
de: Welche Programmiersprachen werden in Godot unterstützt?
es: ¿Qué lenguajes de programación están soportados en Godot?
fr: Quels langages de programmation sont supportés par Godot ?
ko: Godot는 어떤 프로그래밍 언어를 지원하나요?
pl: Jakie języki programowania wspiera Godot?
ru: Какие языки программирования поддерживаются в Godot?
uk: Підтримку яких мов програмування передбачено у Godot?

source: The officially supported languages for Godot are GDScript, C#, and C++. See the subcategories for each language in the :ref:`scripting <toc-learn-scripting>` section.
cs: Oficiálně podporované jazyky pro Godot jsou GDScript, C# a C++. Více v podkategoriích pro každý jazyk v sekci :ref:`skriptování <toc-learn-scripting>`.
de: Die offiziell unterstützten Sprachen für Godot sind GDScript, C# und C++. Siehe die Unterkategorien für jede Sprache im Abschnitt :ref:`Skripting <toc-learn-scripting>`.
es: Los lenguajes soportados oficialmente por Godot son GDScript, C# y C++. Consulta las subcategorías para cada lenguaje en la sección de :ref:`scripting <toc-learn-scripting>`.
fr: Les langages officiellement supportés par Godot sont le GDScript, C# et C++. Voir les sous-catégories pour chaque langage dans la section :ref:`script <toc-learn-scripting>`.
ko: Godot가 공식으로 지원하는 언어는 GDScript와 C#, C++입니다. :ref:`스크립팅 <toc-learn-scripting>` 섹션에서 각 언어별 하위 카테고리를 참고하세요.
pl: Oficjalnie wspierane języki w Godocie to GDScript, C# oraz C++. Więcej na temat danego języka znajdziesz w sekcji :ref:`skryptów <toc-learn-scripting>`.
ru: Официально поддерживаемые языки для Godot это GDScript, C# и C++. Смотрите подкатегории для каждого языка в секции :ref:`Скриптинг <toc-learn-scripting>`.
uk: Офіційно підтримуваними мовами для Godot є GDScript, C# та C++. Дивіться підкатегорії для кожної мови у розділі :ref:`scripting <toc-learn-scripting>`.

source: If you are just starting out with either Godot or game development in general, GDScript is the recommended language to learn and use since it is native to Godot. While scripting languages tend to be less performant than lower-level languages in the long run, for prototyping, developing Minimum Viable Products (MVPs), and focusing on Time-To-Market (TTM), GDScript will provide a fast, friendly, and capable way of developing your games.
cs: Pokud teprve začínáte s Godot nebo s vývojem her obecně, doporučujeme se naučit a používat GDScript, protože je v Godotu přirozeně podporován. Zatímco skriptovací jazyky mají v dlouhodobém horizontu tendenci být méně výkonné než jazyky nižší úrovně, pro prototypování, vývoj minimálních životaschopných produktů (MVP) a zaměřování se na TTM (Time-To-Market), GDScript poskytne rychlý, uživatelsky přívětivý a výkonný prostředek pro rozvoj vašich her.
de: Wenn Sie gerade beginnen, sich mit Godot oder generell Spieleentwicklung zu befassen, empfehlen wir GDScript zu lernen und zu nutzen, da es nativ von Godot unterstützt wird. Skriptsprachen sind insgesamt weniger performant als Lower-Level Sprachen wie C oder Rust, aber zum Schreiben von Prototypen, Minimal-Viable-Products (MVPs) und bezogen auf die Time-To-Market (TTM), bietet GDScript einen schnellen, nutzerfreundlichen und mächtigen Weg, Spiele zu entwickeln.
es: Si estás empezando con Godot o con el desarrollo de juegos en general, GDScript es el lenguaje recomendado para aprender y usar ya que es nativo de Godot. Mientras que los lenguajes de scripting tienden a ser menos eficientes que los lenguajes de bajo nivel a largo plazo, para la creación de prototipos, el desarrollo de Productos Mínimos Viables (MVPs) y el enfoque en el Plazo de Comercialización (TTM), GDScript proveerá de una manera rápida, amigable y capaz para el desarrollo de tus videojuegos.
fr: Si vous débutez avec Godot ou avec la programmation de jeux vidéo, GDScript est le langage recommandé puisqu'il est natif dans Godot. Bien que les langages de script soient moins performants que ceux bas-niveau à terme, GDScript est un moyen rapide, facile d'utilisation et puissant pour le développement de jeux vidéo, notamment pour obtenir un prototype viable, et réduire les temps de développement.
ko: Godot 또는 게임 개발을 막 시작한 경우 일반적으로 Godot에서 네이티브로 동작하는 GDScript를 배우고 사용하는 것을 권장합니다. 스크립트 언어는 장기적으로 다른 로우 레벨 언어보다 퍼포먼스가 떨어지는 경향이 있습니다. 하지만 프로토타이핑, 최소 기능 제품(MVP) 개발, 판매할 때까지 걸리는 시간(TTM)에 중점을 둔다면 GDScript는 게임을 개발하는데 빠르고, 친절하고, 유능한 방법을 제공합니다.
pl: Jeśli zaczynasz swoją przygode z Godot albo nawet tworzeniem gier, GDScript jest zalecanym językiem do nauki i użycia gdyż jest on podstawowy dla Godot. Podczas gdy języki skryptowe mają skłonność do bycia mniej wydajnymi niż języki niskiego poziomu na dłuższą metę, w prototypowaniu i rozwijaniu gry minimalnie gotowej do wydania i skupianiu się na jak najszybszym jej wydaniu, GDScript zapewni szybki, przyjazny i użyteczny sposób do tworzenia twojej gry.
ru: Если вы только начинаете разбираться с Godot или с разработкой игр в целом, то рекомендуем изучить язык GDScript, поскольку он является родным языком для Godot. Как правило, в долгосрочной перспективе скриптовые языки программирования менее эффективны, чем языки низкого уровня, но для прототипирования, создания минимально жизнеспособных продуктов (minimum viable product, MVP) и уменьшения времени выхода на рынок (Time-To-Market, TTM) GDScript предоставляет достаточно быстрый, дружественный и действенный путь разработки.
uk: Якщо ви лише робите перші кроки з Godot або у розробці ігор загалом, - рекомендуємо мову GDScript для вивчення та використання, так як це рідна мова для Godot. Хоча скриптові мови програмування як правило менш продуктивні ніж низькорівневі в довгостроковій перспективі, для прототипування, розробки Мінімально Життєзданих Продуктів (MVPs) та фокусі на Time-To-Market (TTM), GDScript забезпечить швидкий, дружній та надійний спосіб для розробки ваших ігор.

source: Note that C# support is still relatively new, and as such, you may encounter some issues along the way. C# support is also currently missing on the web platform. Our friendly and hard-working development community is always ready to tackle new problems as they arise, but since this is an open source project, we recommend that you first do some due diligence yourself. Searching through discussions on `open issues <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__ is a great way to start your troubleshooting.
cs: Všimněte si, že podpora C # je stále relativně nová, a proto se můžete setkat s některými problémy. Podpora C#také cyhbí na webové platformě. Naše přátelská a pracovitá komunita vývojářů je vždy připravena řešit nové problémy jakmile se objeví, ale protože se jedná o projekt s otevřeným zdrojovým kódem, doporučujeme vám nejprve udělat si vlastní hloubkový průzkum. Prohledávání diskusí o `otevřených problémech <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`_ je skvělý způsob, jak začít s řešením vlastních problémů.
de: Beachten Sie, dass die C#-Unterstützung noch relativ neu ist und Sie daher auf dem Weg dorthin auf einige Probleme stoßen können. Die C#-Unterstützung fehlt derzeit auch für die Web-Plattform. Unsere freundliche und fleißige Entwickler-Community ist immer bereit, neue Probleme zu lösen, sobald sie auftauchen. Da es sich jedoch um ein Open-Source-Projekt handelt, empfehlen wir Ihnen, zunächst selbst einige Nachforschungen anzustellen. Das Durchsuchen von Diskussionen zu `offenen Issues <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__ ist ein guter Weg, um mit der Fehlersuche zu beginnen.
es: Hay que tener en cuenta que el soporte para C# todavía es relativamente nuevo y, como tal, es posible que encuentres algunos inconvenientes en el camino. El soporte de C# también no tiene soporte para plataforma wev. Nuestra amigable y trabajadora comunidad de desarrollo siempre está dispuesta a abordar nuevos problemas a medida que surjan, pero como se trata de un proyecto de código abierto, recomendamos que primero hagas tú mismo las comprobaciones necesarias. Buscar en las discusiones sobre `problemas abiertos <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__ es una buena manera de empezar a resolver problemas.
fr: Notez que la prise en charge du langage C# est encore relativement récente et qu'il est donc possible que vous rencontriez des problèmes en cours de route. La prise en charge du langage C# est également absente de la plate-forme web. Notre communauté de développeurs, amicale et travailleuse, est toujours prête à s'attaquer aux nouveaux problèmes dès qu'ils se présentent, mais comme il s'agit d'un projet open source, nous vous recommandons d'abord de faire preuve de diligence raisonnable par vous-même. Une recherche dans les discussions sur les `open issues <https ://github.com/godotengine/godot/issues ?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__ est un excellent moyen de commencer votre dépannage.
ru: Обратите внимание, что поддержка C# это довольно новая функция и по пути вы можете столкнуться с некоторыми проблемами. Поддержка C# также в настоящее время отсутствует на веб-платформе. Наше дружелюбное и трудолюбивое сообщество всегда готово решать новые проблемы по мере их возникновения, но поскольку это проект с открытым исходным кодом, то мы рекомендуем сначала выполнить некоторую должную осмотрительность. Поиск в обсуждениях на `open issues (Открытые вопросы) <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`_ это отличный способ приступить к решению возникших проблем.
uk: Зверніть увагу, що підтримка C# все ще відносно нова, тому ви можете зіткнутися з деякими проблемами на цьому шляху. Підтримка C# також наразі відсутня на веб-платформі. Наша дружня і працьовита спільнота розробників завжди готова вирішувати нові проблеми по мірі їх виникнення, але оскільки це проект з відкритим вихідним кодом, ми рекомендуємо вам спочатку провести певну перевірку самостійно. Пошук в обговореннях `відкритих питань <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__ - це чудовий спосіб розпочати пошук та усунення несправностей.

source: As for new languages, support is possible via third parties with GDExtensions. (See the question about plugins below). Work is currently underway, for example, on unofficial bindings for Godot to `Python <https://github.com/touilleMan/godot-python>`_ and `Nim <https://github.com/pragmagic/godot-nim>`_.
cs: Pokud jde o nové jazyky, podpora je možná prostřednictvím třetích stran pomocí GDExtensions. (Více v otázce o pluginech níže.) V současné době například probíhají práce na neoficiálním propojení Godot s`Pythonem <https://github.com/touilleMan/godot-python>`_ a `Nimem <https://github.com/pragmagic/godot-nim>`_.
de: Was neue Sprachen betrifft, so ist die Unterstützung durch Dritte mit GDExtensions möglich. (Siehe die Frage zu Plugins weiter unten). Derzeit wird zum Beispiel an inoffiziellen Bindings für Godot an `Python <https://github.com/touilleMan/godot-python>`_ und `Nim <https://github.com/pragmagic/godot-nim>`_ gearbeitet.
es: En cuanto a los nuevos lenguajes, el soporte es posible a través de terceros utilizando las funciones GDExtension. (Véase la pregunta sobre los plugins más abajo.) Se está trabajando, por ejemplo, en los conectores no oficiales de Godot a `Python <https://github.com/touilleMan/godot-python>`_ y `Nim <https://github.com/pragmagic/godot-nim>`_.
fr: Pour d'autres langages, le support est possible via des tiers utilisant les fonctionnalités GDNative / NativeScript / PluginScript. (Voir la question sur les plugins ci-dessous.) Des travaux sont actuellement en cours, par exemple, sur les liaisons non officielles pour Godot à `Python <https://github.com/touilleMan/godot-python>`_ et `Nim <https://github.com/pragmagic/godot-nim>`_.
ko: 새로운 언어의 경우 GDExtension 등을 통해 지원이 가능합니다. (아래 플러그인 관련 문의 사항 참고). 예를 들어 Godot와 `Python <https://github.com/touilleMan/godot-python>`_\ 및 `Nim <https://github.com/pragmagic/godot-nim>`_\ 간의 바인딩 개발이 비공식적으로 진행 중입니다.
pl: Jeśli chodzi o obsługę nowych języków, wsparcie dla nich jest możliwe za pomocą GDExtensions. (Zobacz: poniższe pytanie dotyczące wtyczek). Aktualnie użytkownicy pracują nad połączeniami z językami `Python <https://github.com/touilleMan/godot-python>`_ oraz `Nim <https://github.com/pragmagic/godot-nim>`_.
ru: Что касается новых языков, поддержка возможна с использованием возможностей сторонних решений через GDExtensions. (См. вопрос о плагинах ниже.) В настоящее время работа ведётся полным ходом, например, есть неофициальные привязки Godot к `Python <https://github.com/touilleMan/godot-python>`_ и `Nim <https://github.com/pragmagic/godot-nim>`_.
uk: Що стосується нових мов, підтримка можлива через третіх осіб за допомогою GDExtensions. (Див. питання про плагіни нижче). Наразі ведеться робота, наприклад, над неофіційними прив'язками Годо до `Python <https://github.com/touilleMan/godot-python>`_ та `Nim <https://github.com/pragmagic/godot-nim>`_.

source: What is GDScript and why should I use it?
cs: Co je GDScript a proč bych jej měl používat?
de: Was ist GDScript und warum sollte ich es verwenden?
es: ¿Qué es GDScript y por qué debería usarlo?
fr: Qu'est-ce que le GDScript et pourquoi devrais-je l'utiliser ?
ko: GDScript는 무엇이고 왜 이것을 써야 하나요?
pl: Czym jest GDScript i dlaczego powinienem z niego korzystać?
ru: Что такое GDScript и зачем мне его использовать?
uk: Що таке GDScript і чому я повинен, це використовувати?

source: GDScript is Godot's integrated scripting language. It was built from the ground up to maximize Godot's potential in the least amount of code, affording both novice and expert developers alike to capitalize on Godot's strengths as fast as possible. If you've ever written anything in a language like Python before, then you'll feel right at home. For examples and a complete overview of the power GDScript offers you, check out the :ref:`GDScript scripting guide <doc_gdscript>`.
cs: GDScript je integrovaný skriptovací jazyk pro Godot. Byl postaven od základů tak, aby maximalizoval potenciál enginu při využití minimálního množství kódu. To umožňuje jak začínajícím, tak i pokročilým vývojářům co nejrychleji ovládnout silné stránky Godota. Pokud jste někdy napsali něco v jazyce jako je Python, budete se zde cítit jako doma. Pro příklady a úplný přehled možností které GDScipt nabízí zjistíte v :ref:`GDScript skriptovací příručka GDScript <doc_gdscript>`.
de: GDScript ist die integrierte Skriptsprache von Godot. Sie wurde von Grund auf entwickelt, um das Potenzial von Godot mit möglichst wenig Code zu maximieren und es sowohl Anfängern als auch erfahrenen Entwicklern zu ermöglichen, die Stärken von Godot so schnell wie möglich zu nutzen. Wenn Sie schon einmal etwas in einer Sprache wie Python geschrieben haben, werden Sie sich sofort zu Hause fühlen. Beispiele und einen vollständigen Überblick über die Möglichkeiten, die Ihnen GDScript bietet, finden Sie in der :ref:`GDScript Skripting-Anleitung <doc_gdscript>`.
es: GDScript es el lenguaje de scripts integrado en Godot. Fue creado desde cero para maximizar el potencial de Godot hasta la última porción de código, permitiendo a desarrolladores tanto expertos como novatos aprovechar las fortalezas de Godot tan rápido como sea posible. Si alguna vez has escrito algo en un lenguaje como Python, entonces te sentirás como en casa. Para ejemplos, la historia y un resumen completo del poder que GDScript te ofrece, revisa la `guía de scripting en GDScript <gdscript_basics>`_.
fr: GDScript est le langage de scripting intégré à Godot. Il a été conçu à partir de zéro afin de maximiser le potentiel de Godot avec un minimum de code, permettant aux développeurs de tous niveaux d'expertise de s'appuyer sur les atouts de Godot aussi vite que possible. Si vous avez déjà utilisé Python ou un langage similaire auparavant, vous devriez vous y retrouver rapidement. Pour voir des exemples et une présentation détaillée de la puissance offerte par GDScript, reportez-vous au `manuel GDScript <doc_gdscript>`_.
ko: GDScript는 Godot에 내장된 스크립트 언어입니다. GDScript는 처음부터 짧은 코드로도 Godot의 잠재력을 극대화할 수 있도록 만들어져 있어 초심자와 전문 개발자가 Godot의 강점을 가능한 한 빨리 활용할 수 있습니다. 이전에 Python 같은 언어를 사용해 보신 적이 있다면 익숙할 겁니다. GDScript 예제, 기능에 대한 전체 개요, 역사는 :ref:`GDScript 스크립팅 가이드 <doc_gdscript>`\ 를 참고하세요.
pl: GDScript to zintegrowany język skryptowy Godota. Został stworzony od podstaw, by zmaksymalizować potencjał silnika, używając jak najmniejszej ilości kodu. Ma to pozwolić możliwie jak najszybciej wykorzystać mocne strony Godota zarówno przez doświadczonych jak i nowych programistów. Jeżeli kiedyś programowałeś w Pythonie, poczujesz się jak w domu. Przykłady, historię oraz kompletną dokumentację na temat możliwości GDScript znajdziesz w `Przewodniku po GDScript<gdscript_basics>`_.
ru: GDScript — это встроенный скриптовый язык программирования Godot. Он был создан с нуля для того, чтобы максимизировать потенциал Godot, сократив количество кода, тем самым предоставляя как начинающим, так и опытным разработчикам возможность максимально быстро извлечь выгоду из всех преимуществ Godot. Если вы когда-нибудь писали что-то на языке, подобном Python, то в GDScript вы почувствуете себя как дома. Для того чтобы посмотреть примеры и ознакомиться с полным набором возможностей, которые предлагает GDScript, советуем ознакомиться с :ref:`Руководством по созданию скриптов GDScript <doc_gdscript>`.
uk: GDScript - це інтегрована мова сценаріїв Godot. Вона була створена з нуля, щоб максимізувати потенціал Godot з найменшою кількістю коду, що дозволяє як початківцям, так і досвідченим розробникам використовувати сильні сторони Godot якнайшвидше. Якщо ви коли-небудь писали щось на мові Python, то ви відчуєте себе як вдома. Приклади та повний огляд можливостей GDScript можна знайти у :ref:`GDScript scripting guide <doc_gdscript>`.

source: There are several reasons to use GDScript, especially when you are prototyping, in alpha/beta stages of your project, or are not creating the next AAA title. The most salient reason is the overall **reduction of complexity**.
cs: Existuje několik důvodů proč používat GDScript, zejména když prototypujete, v alfa/beta fázích vašeho projektu nebo pokud nevytváříte další AAA titul. Nejvýznamějším důvodem je celkové **snížení složitosti.**.
de: Es gibt mehrere Gründe, GDScript zu verwenden, insbesondere wenn Sie Prototypen erstellen, sich in der Alpha-/Beta-Phase Ihres Projekts befinden oder nicht gerade den nächsten AAA-Titel entwickeln. Der hervorstechendste Grund ist die allgemeine **Reduzierung der Komplexität**.
es: Hay varias razones para usar GDScript--especialmente cuando estás haciendo prototipos, versiones alfa/beta de tu proyecto, o no estás creando el próximo título AAA. Pero la razón más sobresaliente es la **reducción de complejidad** en general.
fr: L'utilisation de GDScript présente de nombreux avantages lors du prototypage dans les phases alpha/bêta de votre projet ou dans le cas où vous ne créez pas le prochain blockbuster, mais l'avantage le plus évident est la **réduction de la complexité** générale.
ko: GDScript를 사용하는 데는 여러 이유가 있습니다. 특히 프로토타입을 만들거나 프로젝트가 알파/베타 수준의 단계이거나 혹은 차세대 AAA급 게임을 만드는 것이 아니라면 말이죠. 하지만 GDScript를 사용하는 가장 두드러진 이유는 전체적인 **복잡도 감소** 입니다.
pl: Istnieje kilka powodów, dla których warto korzystać z GDScript - szczególnie gdy prototypujesz, na wczesnym etapie projektu lub gdy nie tworzysz kolejnego tytułu AAA. Najbardziej istotnym powodem jest ogólna ** redukcja złożoności**.
ru: Есть несколько причин использовать GDScript - особенно когда вы создаете прототип, находитесь на альфа-/бета-стадиях проекта и не создаете AAA-игру . - но самая главная причина - это общее **снижение сложности**.
uk: Є кілька причин використовувати GDScript, особливо коли ви створюєте прототип, перебуваєте на стадії альфа/бета-версії проекту або не створюєте наступну AAA-версію. Найважливішою причиною є загальне **зменшення складності**.
