Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: If you only have a general idea without specific details, you can open a `proposal discussion <https://github.com/godotengine/godot-proposals/discussions>`_. These can be anything you want, and allow for a free-form discussion in search of a solution. Once you find one, a proposal issue can be opened.
cs: Pokud máte všeobecný nápad bez specifických detailu, můžete otevřít `diskuzi o návrhu <https://github.com/godotengine/godot-proposals/discussion>`_. Ty mohou být o čemkoliv a dovoluji volnou diskuzi při hledání řešení. Jakmile se řešení nalezne, může být otevřeno řešení návrhu(issue).
de: Wenn Sie nur eine allgemeine Idee ohne spezifische Details haben, können Sie eine `Vorschlagsdiskussion <https://github.com/godotengine/godot-proposals/discussions>`_ eröffnen. Diese Vorschläge könnten alles sein, was immer Sie wollen, und erlauben eine freie Diskussion auf der Suche nach einer Lösung. Sobald Sie eine Lösung gefunden haben, kann ein Vorschlagsthema eröffnet werden.
es: Si tienes una idea general sin detalles específicos, puedes abrir una `propuesta de discusión <https://github.com/godotengine/godot-proposals/discussions>`_. Estas pueden ser de lo que quieras, y permiten una forma libre de discusión en busca de una solución, una ves abierta, una propuesta de problema se abrirá.
pl: Jeśli masz tylko ogólny pomysł bez konkretnych szczegółów, możesz otworzyć `propozycję dyskusji <https://github.com/godotengine/godot-proposals/discussions>`_. Mogą to być cokolwiek co Cię interesuje i co umożliwia swobodną dyskusję w poszukiwaniu rozwiązania. Po znalezieniu takowego może zostać utworzone proponowane usprawnienie.
ru: Если у вас есть только общая идея без конкретных деталей, вы можете открыть `обсуждение предложения <https://github.com/godotengine/godot-proposals/discussions>`_. В них можно обсудить что угодно и провести свободное обсуждение в поисках решения. Как только вы найдете решение, можете создать запрос на предложение.
uk: Якщо у вас є лише загальна ідею без конкретних деталей, то ви можете відкрити `обговорення пропозиції <https://github.com/godotengine/godot-proposals/discussions>`_. Так, в формі вільного спілкування, можна, що-завгодно обговорювати шукаючи рішення. Коли ж рішення буде знайдене, можна буде створити пропозицію покращення рушія.

source: Please, read the `readme <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ document before creating a proposal to learn more about the process.
cs: Prosím přečtěte si `readme <hhtps://github.com/godotengine/godot-proposals/blob/master/README.md>`_ dříve než vložíte nový návrh aby jste zjistili vše o tomto procesu.
de: Bitte lesen Sie das `Readme <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_-Dokument, bevor Sie einen Vorschlag erstellen, um mehr über den Prozess zu erfahren.
es: Por favor, lea el documento `léame <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ antes de crear una propuesta para obtener más información sobre el proceso.
pl: Proszę, zapoznaj się z dokumentem `czytaj-mnie <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ przed utworzeniem propozycji, aby dowiedzieć się więcej o procesie.
ru: Пожалуйста, прочтите `readme <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ документ перед созданием предложения, чтобы узнать больше о процессе.
uk: Будь-ласка, прочитайте документ `readme <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ перед створенням пропозиції, щоб дізнатися більше про цей процес.

source: Is it possible to use Godot to create non-game applications?
cs: Je možné použít Godot k vytváření jiných než herních aplikací?
de: Ist es möglich mit Godot Anwendungen zu entwickeln die keine Spiel sind?
es: Es posible usar Godot para ¿hacer aplicaciones que no son juegos?
fr: Est-il possible d'utiliser Godot pour créer des applications sans rapport avec le jeu vidéo ?
ko: Godot를 게임이 아닌 응용프로그램 제작에 이용할 수 있을까요?
pl: Czy jest możliwe używać Godota do tworzenia aplikacji innych niż gry?
ru: Можно ли использовать Godot для создания не игровых приложений?
uk: Чи можливо використовувати Godot для створення не ігрових застосунків?

source: Yes! Godot features an extensive built-in UI system, and its small distribution size can make it a suitable alternative to frameworks like Electron or Qt.
cs: Ano! Godot má rozsáhlý vestavěný systém uživatelského rozhraní a díky své malé distribuční velikosti může být vhodnou alternativou k frameworkům jako Electron nebo Qt.
de: Ja! Godot beinhaltet ein umfangreiches integriertes UI-System. Die geringe Distributions-Größe von Godot kann es zu einer geeigneten Alternative zu Frameworks wie Electron oder Qt machen.
es: ¡Si! Las características de Godot, el extenso sistema de UI embebido en el motor y el pequeño tamaño de la distribución de Godot puede hacer que sea una alternativa adecuada a los frameworks como Electrón o el Qt.
fr: Oui ! Godot dispose d'un système d'interface utilisateur intégré étendu, et la petite taille de distribution de Godot peut en faire une alternative appropriée à des frameworks comme Electron ou Qt.
ko: 네! Godot는 광범위한 내장 UI 시스템을 갖추고 있고 Godot의 작은 배포 크기는 Electron, Qt와 같은 프레임 워크의 적절한 대안이 될 수 있습니다.
pl: Tak! Godot oferuje rozbudowany system UI, a jego niewielki rozmiar dystrybucji może uczynić go odpowiednią alternatywą dla frameworków takich jak Electron czy Qt.
ru: Да! Godot обладает обширной встроенной системой пользовательского интерфейса, а небольшой размер дистрибутива может сделать его подходящей альтернативой таким фреймворкам, как Electron или Qt.
uk: Так! Godot має об'ємну вбудовану систему інтерфейсу користувача, і невеликий розмір, що робить його непоганою альтернативою для таких фреймворків, як Electron, чи Qt.

source: When creating a non-game application, make sure to enable :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` in the Project Settings to decrease CPU and GPU usage.
cs: Při vytváření neherní aplikace nezapomeňte povolit :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>`v nastavení projektu, abyste snížili využití CPU a GPU.
de: Wenn Sie eine „nicht-Spiele“-Applikation entwickeln, stellen Sie sicher, dass Sie :ref:`Prozessorenergiesparmodus <class_ProjectSettings_property_application/run/low_processor_mode>` in den Projekt-Einstellungen einschalten um die CPU- und GPU-Belastung zu verringern.
es: Cuando crees una aplicación que no sea de juego, asegúrate de habilitarla :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` en la configuración del proyecto para reducir el uso de la CPU y la GPU.
fr: Lors de la création d'une application sans rapport avec le jeu vidéo, assurez-vous d'activer :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` dans les paramètres du projet pour réduire l'utilisation du CPU et du GPU.
ko: 게임이 아닌 응용 프로그램을 제작할 때는 CPU와 GPU 사용률을 줄이기 위해 반드시 프로젝트 설정에서 :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>`\ 를 활성화해주세요.
pl: Przy tworzeniu aplikacji nie będącej grą, upewnij się by włączyć :ref: `tryb niskiego wykorzystania procesora <class_ProjectSettings_property_application/run/low_precessro_mode>` w Ustawieniach Projektu by zmniejszyć zużycie procesora oraz karty graficznej.
ru: При создании неигрового приложения не забудьте включить :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` в настройках проекта, чтобы уменьшить использование центрального и графического процессоров.
uk: При створенні не ігрового застосунку не забудьте увімкнути :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` в Параметрах Проєкту щоб зменшити використання CPU і GPU.

source: Check out `Material Maker <https://github.com/RodZill4/material-maker>`__ and `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ for examples of open source applications made with Godot.
cs: Podívejte se na `Material Maker <https://github.com/RodZill4/material-maker>`__ a `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__, kde najdete příklady open source aplikací vytvořených pomocí Godot.
de: Besuchen Sie `Material Maker <https://github.com/RodZill4/material-maker>`__ und `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ für Beispiele von Open Source-Anwendungen, die mit Godot erstellt wurden.
es: Mira `Material Maker <https://github.com/RodZill4/material-maker>`__ y `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ para ejemplos de aplicaciones de código abierto hechas con Godot.
fr: Consultez `Material Maker <https://github.com/RodZill4/material-maker>`__ et `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ pour des exemples d'applications open source créées avec Godot.
ko: Godot로 만든 오픈소스 예제 애플리케이션 `Material Maker <https://github.com/RodZill4/material-maker>`__\ 와 `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__\ 를 확인해보세요.
pl: Sprawdź `Material Maker <https://github.com/RodZill4/material-maker>`__ oraz`Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ dla przykładów open-source aplikacji stworzonych z Godotem.
ru: Загляните в `Material Maker <https://github.com/RodZill4/material-maker>`__ и `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ для примеров приложений с открытым исходным кодом, созданных с помощью Godot.
uk: Загляньте в `Material Maker <https://github.com/RodZill4/material-maker>`__ і `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ для прикладів застосунків із відкритим кодом, зроблених за допомогою Godot.

source: Is it possible to use Godot as a library?
cs: Je možné použít Godot jako knihovnu?
de: Ist es möglich Godot als Bibliothek zu nutzen?
es: Es posible usar Godot como biblioteca/librería?
fr: Est-il possible d'utiliser Godot comme bibliothèque ?
ko: Godot를 라이브러리로 이용할 수 있을까요?
pl: Czy jest możliwe używać Godota jako biblioteki?
ru: Можно ли использовать Godot как библиотеку?
uk: Чи можливо використовувати Godot як бібліотеку ?

source: Godot is meant to be used with its editor. We recommend you give it a try, as it will most likely save you time in the long term. There are no plans to make Godot usable as a library, as it would make the rest of the engine more convoluted and difficult to use for casual users.
cs: Godot je určen k použití s jeho editorem. Doporučujeme vám to vyzkoušet, protože vám s největší pravděpodobností v dlouhodobém horizontu ušetří čas. Neexistují žádné plány na to, aby byl Godot použitelný jako knihovna, protože by se tím zvyšovala spletitost a obtížnost zbytku enginu pro příležitostné uživatele.
de: Godot ist für die Verwendung in seinem eigenen Bearbeitungsprogramm gedacht. Wir empfehlen diesen auszuprobieren, da er Ihnen wahrscheinlich langfristig viel Zeit sparen wird. Es gibt keine Pläne, Godot als Bibliothek nutzbar zu machen, da es den Rest der Engine komplizierter und somit für normale Benutzer schwieriger verwendbar machen würde.
es: Godot está destinado a ser usado con su editor. Le recomendamos que lo pruebe, ya que probablemente le ahorrará tiempo a largo plazo. No hay planes para hacer que Godot sea utilizable como una biblioteca, ya que haría el resto del motor más enrevesado y difícil de usar para usuarios ocasionales.
fr: Godot est destiné à être utilisé avec son éditeur. Nous vous recommandons de l'essayer, car il vous fera très probablement gagner du temps à long terme. Il n'est pas prévu de rendre Godot utilisable comme bibliothèque, car cela rendrait le reste du moteur plus alambiqué et difficile à utiliser pour les utilisateurs occasionnels.
ko: Godot는 에디터와 함께 사용하게 되어 있습니다. 길게 보면 시간을 절약할 수 있으므로 에디터를 사용하는 게 좋습니다. Godot를 라이브러리로 이용할 수 있도록 만들면 엔진의 다른 부분이 더 복잡해지고 숙달되지 않은 사용자들이 쓰기 어려워지기 때문에 그럴 계획은 없습니다.
pl: Godot jest zaprojektowany tak żeby używać go z jego edytorem. Zalecamy sprawdzić go w użyciu ponieważ w dłuższej perspektywie zaoszczędzi wam czas. Nie ma w planach uczynienia Godota użytecznego jako biblioteki ponieważ uczyniłoby to resztę silnika bardziej zawiłą i trudną w użyciu dla przeciętnych użytkowników.
ru: Godot предназначен для использования с его редактором. Мы рекомендуем вам попробовать, так как это, скорее всего, сэкономит вам время в долгосрочной перспективе. Нет никаких планов использовать Godot в качестве библиотеки, поскольку это сделало бы остальную часть движка более запутанной и трудной для использования обычными пользователями.
uk: У Godot інтегрований редактор. Ми рекомендуємо вам спробувати його, так як в далекій перспективі він збереже вам велику кількість вашого часу. Ми не плануємо випускати Godot в якості бібліотеки, оскільки це може зробити інші частини рушія заплутаними і зробити сам рушій незручним для використання.

source: If you want to use a rendering library, look into using an established rendering engine instead. Keep in mind rendering engines usually have smaller communities compared to Godot. This will make it more difficult to find answers to your questions.
cs: Pokud chcete použít vykreslovací knihovnu, prozkoumejte místo toho použití zavedeného vykreslovacího enginu. Mějte na paměti, že vykreslovací enginy mají obvykle menší komunitní základny ve srovnání s Godotem. To poté ztěžuje nalezení odpovědí na vaše otázky.
de: Wenn Sie eine Render-Bibliothek nutzen möchten, sollten Sie hierfür eine etablierte Render-Engine verwenden. Beachten Sie dabei, dass diese meist kleinere Benutzergruppen als Godot haben, was es schwieriger macht, Antworten auf Ihre Fragen zu finden.
es: Si quieres usar una biblioteca de renderizado, busca en su lugar un motor de renderizado orientado a ello. Ten en cuenta que los motores de renderizado suelen tener comunidades más pequeñas en comparación con Godot. Esto hará más difícil encontrar respuestas a tus preguntas.
fr: Si vous souhaitez utiliser une bibliothèque de rendu, envisagez plutôt d'utiliser un moteur de rendu établi. Gardez à l'esprit que les moteurs de rendu ont généralement des communautés plus petites que Godot. Il sera donc plus difficile de trouver des réponses à vos questions.
ko: 만약 렌더링 라이브러리를 원하신다면, 대신 기존 렌더링 엔진 사용을 고려해보세요. 대부분의 렌더링 엔진 커뮤니티는 Godot보다 작다는 점을 명심하세요. 이 때문에 질문에 대한 답을 찾기는 더 어려울 것입니다.
pl: Jeżeli chesz użyć bibliotek renderowania, lepiej po prostu poszukaj silnika. Pamiętaj jednak że mają one zazwyczaj mniejszą społeczność w porównaniu do Godota. To może utrudnić znalezienie odpowiedzi na twoje pytania.
ru: Если вы хотите использовать библиотеку рендеринга, рассмотрите возможность использования установленного движка рендеринга. Имейте в виду, что движки рендеринга обычно имеют меньшие сообщества по сравнению с Godot. Это затруднит поиск ответов на ваши вопросы.
uk: Вам подобаються графічні бібліотеки ? Зверніть увагу на популярний графічний рушій. Пам'ятайте, що звичайні рушії зазвичай мають меншу спільноту у порівнянні з Godot. У зв'зку з цим у вас можуть виникнути проблеми з пошуком відповідей на ваші запитання.

source: What user interface toolkit does Godot use?
cs: Jaký toolkit uživatelského rozhraní Godot používá?
de: Welches UI-Toolkit nutzt Godot?
es: ¿Qué kit de herramientas para la interfaz de usuario usa Godot?
fr: Quelle boîte à outils d'interface utilisateur Godot utilise-t-il ?
ko: Godot는 어떤 유저 인터페이스 툴킷을 사용하나요?
pl: Jakiego zestawu narzędzi do obsługi interfejsu używa Godot?
ru: Какой инструментарий пользовательского интерфейса использует Godot?
uk: Який набір інструментів користувальницького інтерфейсу використовує Godot?

source: Godot does not use a standard :abbr:`GUI (Graphical User Interface)` toolkit like GTK, Qt or wxWidgets. Instead, Godot uses its own user interface toolkit, rendered using OpenGL ES or Vulkan. This toolkit is exposed in the form of Control nodes, which are used to render the editor (which is written in C++). These Control nodes can also be used in projects from any scripting language supported by Godot.
cs: Godot nepoužívá standardní :abbr:`GUI (Graphical User Interface)` sadu nástrojů jako GTK, Qt nebo wxWidgets. Místo toho Godot používá vlastní sadu nástrojů uživatelského rozhraní vykreslovanou pomocí OpenGL ES nebo Vulkan. Tato sada nástrojů je vystavena ve formě uzlů Control, které se používají k vykreslování editoru (který je napsán v jazyce C++). Tyto uzly Control lze také použít v projektech v libovolném skriptovacím azyce podporovaného systémem Godot.
de: Godot nutzt kein Standard :abbr:`GUI (Graphical User Interface, deutsch „Benutzeroberfäche“)` Toolkit wie GTK, Qt oder wxWidgets. Stattdessen nutzt Godot sein eigenes UI-Toolkit welches mit Open GL oder Vulcan gerendert wird. Dieses Toolkit wird in Form von Control-Nodes dargestellt, welche verwendet werden, um den Editor zu rendern (welcher in C++ geschrieben wurde). Diese Control-Nodes können ebenfalls in Projekten von jeder durch Godot unterstützten Skriptsprache aus verwendet werden.
es: Godot no utiliza un kit de herramientas :abbr:`GUI (Interfaz Gráfica de Usuario)` estándar como GTK, Qt o wxWidgets. En su lugar, Godot utiliza su propio kit de herramientas de interfaz de usuario, que se renderiza utilizando OpenGL ES o Vulkan. Este conjunto de herramientas se expone en forma de nodos de control, que se utilizan para renderizar el editor (que está escrito en C++). Estos nodos de control también pueden ser utilizados en proyectos de cualquier lenguaje de scripting soportado por Godot.
fr: Godot n'utilise pas de boîte à outils standard :abbr:`GUI (Graphical User Interface)` comme GTK, Qt ou wxWidgets. Au lieu de cela, Godot utilise sa propre boîte à outils d'interface utilisateur, rendue à l'aide d'OpenGL ES ou de Vulkan. Cette boîte à outils est exposée sous la forme de nœuds Control, qui sont utilisés pour rendre l'éditeur (qui est écrit en C++). Ces nœuds Control peuvent également être utilisés dans des projets à partir de n'importe quel langage de script pris en charge par Godot.
ko: Godot는 GTK나 Qt, wxWidgets와 같은 표준 :abbr:`GUI (Graphical User Interface)` 툴킷을 사용하지 않는 대신 OpenGL ES나 Vulcan으로 렌더링하는 자체 유저 인터페이스 툴킷을 사용합니다. 이 툴킷은 (C++로 작성된) 에디터를 렌더링할 때 사용되는 컨트롤 노드의 형태로 노출되어 있습니다. 물론 이 컨트롤 노드들은 Godot가 지원하는 어느 스크립트 언어로든지 사용할 수 있습니다.
pl: Godot nie używa standardowego :abbr:`GUI (Graphical User Interface)` zestawy narzędzi jak GTK, Qt czy wxWidgets. Zamiast tego Godot używa własnego zestawu narzędzi do interfejsu, renderowane używając OpenGL ES lub Vulcan. Te zestawy narzędzi są dostępne w postaci Węzłów kontrolnych, które są używane do renderowania edytora (napisanego w C++). Te Węzły Kontrolne mogą także być używane w projektach za pomocą każdego języka skryptowego wspieranego przez Godot.
ru: Godot не использует стандартный набор инструментов :abbr:`ГИП (графический интерфейс пользователя)`, наподобие GTK, Qt или wxWidgets. Вместо этого Godot использует собственный набор инструментов пользовательского интерфейса, созданный с помощью OpenGL ES или Vulkan. Этот инструментарий представлен в виде узлов управления, которые используются для визуализации редактора (написанного на C++). Эти узлы управления также можно использовать в проектах на любом языке сценариев, поддерживаемом Godot.
uk: Godot не використовує стандартний набір інструментів :abbr:`GUI (Графічного Інтерфейсу Користувача)`, як GTK, Qt або wxWidgets. Натомість Godot використовує власний набір інструментів користувальницького інтерфейсу, відтворений за допомогою OpenGL ES або Vulkan. Цей набір інструментів представлений у вигляді вузлів керування, які використовуються для візуалізації редактора (який написаний на C++). Ці вузли управління також можуть бути використані в проєктах на будь-якій скриптовій мові, що підтримується Godot.

source: This custom toolkit makes it possible to benefit from hardware acceleration and have a consistent appearance across all platforms. On top of that, it doesn't have to deal with the LGPL licensing caveats that come with GTK or Qt. Lastly, this means Godot is "eating its own dog food" since the editor itself is one of the most complex users of Godot's UI system.
cs: Tato vlastní sada nástrojů umožňuje těžit z hardwarové akceleraci a mít konzistentní vzhled na všech platformách. Kromě toho se nemusí potýkat s licenčními výhradami LGPL, které jsou spojeny s GTK nebo Qt. V neposlední řadě to znamená, že Godot "žere vlastní psí žrádlo", protože samotný editor je jedním z nejsložitějších uživatelkých systémů uživatelského rozhraní Godot.
de: Dieses benutzerdefinierte Toolkit ermöglicht es, die Vorteile der Hardwarebeschleunigung zu nutzen und ein einheitliches Erscheinungsbild auf allen Plattformen zu erzielen. Außerdem muss es sich nicht mit den Vorbehalten der LGPL-Lizenzierung auseinandersetzen, die mit GTK oder Qt einhergehen. Schließlich bedeutet dies, dass Godot "sein eigenes Hundefutter isst" (Dogfooding), da der Editor selbst einer der komplexesten Benutzer von Godots UI-System ist.
es: Este kit de herramientas personalizado permite beneficiarse de la aceleración por hardware y tener una apariencia consistente en todas las plataformas. Además, no tiene que lidiar con las advertencias de la licencia LGPL que vienen con GTK o Qt. Por último, esto significa que Godot se está "comiendo su propia comida de perro", ya que el propio editor es uno de los usuarios más complejos del sistema de interfaz de usuario de Godot.
fr: Cette boîte à outils personnalisée permet de bénéficier de l'accélération matérielle et d'avoir une apparence cohérente sur toutes les plateformes. En plus de cela, il n'y a pas à gérer les réserves de la licence LGPL fournies avec GTK ou Qt. Enfin, cela signifie que Godot "mange sa propre nourriture pour chiens" puisque l'éditeur lui-même est l'un des utilisateurs les plus complexes du système d'interface utilisateur de Godot.
ko: 이 자체 툴킷 덕분에 하드웨어 가속의 이점을 누릴 수 있고 모든 플랫폼을 아울러 일정한 외관을 유지할 수 있습니다. 그에 더해 GTK나 Qt에 붙어 있는 LGPL 라이센스 조건을 신경 쓸 필요도 없습니다. 마지막으로 에디터 자체가 Godot UI 시스템의 가장 복잡한 사용자 중 하나이기 때문에 Godot는 `개밥 먹기(eating its own dog food) <https://en.wikipedia.org/wiki/Eating_your_own_dog_food>`__\ 를 하는 것이기도 합니다.
pl: Ten niestandardowy zestaw narzędzi umożliwia korzystanie z akceleracji sprzętowej i zapewnia spójny wygląd na wszystkich platformach. Co więcej, nie musi radzić sobie z zastrzeżeniami licencyjnymi LGPL, które są dostarczane z GTK lub Qt. Wreszcie, oznacza to, że Godot nie korzysta z zewnętrznych edytorów/narzędzi , ponieważ sam edytor jest jednym z najbardziej złożonych użytkowników systemu interfejsu Godota.
ru: Этот собственный набор инструментов позволяет использовать преимущества аппаратного ускорения и иметь единообразный внешний вид на всех платформах. Вдобавок ко всему, ему не нужно иметь дело с оговорками лицензирования LGPL, которые идут с GTK или Qt. Наконец, это означает, что Godot «ест свою собачью еду», поскольку сам редактор является одним из самых сложных пользователей системы пользовательского интерфейса Godot.
uk: Цей спеціальний набір інструментів дає змогу отримати вигоду від апаратного прискорення та мати стабільний вигляд на всіх платформах. На додачу до цього, йому не доведеться мати справу із застереженнями щодо ліцензування LGPL, які поставляються з GTK або Qt. Нарешті, це означає, що Godot «їсть власну собачу їжу», оскільки сам редактор є одним із найскладніших користувачів системи інтерфейсу Godot.
