Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: GDScript was designed to curtail the issues above, and more.
cs: GDScript byl navržen tak, aby omezil výše uvedené problémy a jiné další.
de: GDScript wurde entworfen, um diese und weitere Probleme zu umgehen.
es: GDScript fue diseñado para acabar con los problemas anteriores y más.
fr: GDScript a été conçu pour réduire les problèmes ci-dessus et plus encore.
ko: GDScript는 위의 문제 등을 줄이기 위해 설계되었습니다.
pl: GDScript został zaprojektowany tak, żeby zredukować te problemy i nie tylko.
ru: GDScript был разработан, чтобы решить проблемы, описанные выше, и не только.
uk: GDScript був розроблений, щоб скоротити вищезазначені проблеми та багато іншого.

source: What 3D model formats does Godot support?
cs: Jaké typy formátů 3D modelů Godot podporuje?
de: Welche Arten von 3D-Modellformaten unterstützt Godot?
es: ¿Qué tipo de formatos para modelos 3D soporta Godot?
fr: Quels sont les formats de modèles 3D pris en charge par Godot ?
ko: Godot는 어떤 타입의 3D 모델 형식을 지원하나요?
pl: Jakie typy plików 3D obsługuje Godot?
ru: Какие форматы 3D модели поддерживает Godot?
uk: Які формати 3D-моделей підтримує Godot?

source: You can find detailed information on supported formats, how to export them from your 3D modeling software, and how to import them for Godot in the :ref:`doc_importing_3d_scenes` documentation.
cs: Podrobné informace o podporovaných formátech, jak je exportovat z vašeho softwaru pro 3D modelování a jak je importovat do Godotu, naleznete v dokumentaci :ref:`doc_importing_3d_scenes`.
de: Ausführliche Informationen zu den unterstützten Formaten, zum Export aus Ihrer 3D-Modellierungssoftware und zum Import für Godot finden Sie in der Dokumentation :ref:`doc_importing_3d_scenes`.
es: Puedes encontrar informacion detallada en formatos soportados, como exportarlos de tu software de modelado 3D, y como importarlos a Godot en la :ref:`doc_importing_3d_scenes`documentacion.
fr: Vous pouvez trouver des informations détaillées sur les formats suporté, comment les exporter de votre logiciel de 3D et comment les importer dans Godot dans la :ref:`doc_importing_3d_scenes` documentation.
ko: 지원되는 형식, 3D 모델링 소프트웨어에서 내보내는 방법, Godot용으로 가져오는 방법에 대한 자세한 정보는 :ref:`doc_importing_3d_scenes` 설명서에서 확인할 수 있습니다.
pl: Szczegółowe informacje na temat obsługiwanych formatów, sposobu ich eksportu z oprogramowania do modelowania 3D oraz importu do Godot, można znaleźć w dokumentacji :ref:`doc_importing_3d_scenes`.
ru: Более детальную информацию о поддерживаемых форматах, как их экспортировать из вашего 3D-редактора, а также импортировать в Godot можете найти здесь: :ref:`doc_importing_3d_scenes`.
uk: Ви можете знайти детальну інформацію про підтримувані формати, як експортувати їх з вашого програмного забезпечення для 3D моделювання та як імпортувати їх для Godot у документації :ref:`doc_importing_3d_scenes`.

source: Will [insert closed SDK such as FMOD, GameWorks, etc.] be supported in Godot?
cs: Budou [insert closed SDK, jako je FMOD, GameWorks atd.] v Godot podporovány?
de: Wird ein proprietäres SDK à la FMOD, GameWorks, etc. in Godot unterstützt werden?
es: ¿Será [Inserte aquí un SDK cerrado como PhysX, GameWorks, etc.] soportado por Godot?
fr: Est-ce que [Insérer un SDK fermé tel que FMOD, GameWorks, etc.] sera un jour, supporté dans Godot ?
ko: Godot에서 [FMOD, GameWorks 등 클로즈 SDK]가 지원될까요?
pl: Czy w przyszłości zostanie dodane wsparcie dla [tu wstaw zamknięte SDK, takie jak PhysX, GameWorks, itp.]?
ru: Будет ли [Закрытый SDK такой как FMOD, GameWorks, и т.д.] поддерживаться в Godot?
uk: Чи будуть [Пропрієтарні закриті SDK, такі як FMOD, GameWorks тощо] підтримуватися в Godot?

source: The aim of Godot is to create a free and open source MIT-licensed engine that is modular and extendable. There are no plans for the core engine development community to support any third-party, closed-source/proprietary SDKs, as integrating with these would go against Godot's ethos.
cs: Cílem Godot je vytvořit bezplatný a open-source MIT-licencovaný engine, který je modulární a rozšiřitelný. Neexistují žádné plány na to, aby komunita vyvyjející jádro enginu podporovala jakékoli SDK třetích stran s uzavřeným kódem/proprietární, protože jejich integrace by byla v rozporu s etikou Godot.
de: Das Ziel von Godot ist es, eine freie und quelloffene, MIT-lizensierte Engine zu entwickeln, die modular und erweiterbar ist. Es gibt keine Pläne der Kernengine-Entwickler-Community, irgendwelche proprietären SDKs einzubinden, da dies dem Ethos Godots widersprechen würde.
es: El objetivo de Godot es crear un motor con licencia MIT, libre y de código abierto que sea modular y ampliable. No hay planes para que la comunidad central de desarrollo de motores admita ningún SDK de código cerrado/propietario de terceros, ya que la integración con ellos iría en contra del espíritu de Godot.
fr: Le but de Godot est de créer un moteur de jeu modulaire, extensible, libre et open-source couvert par la licence MIT. La communauté autour du moteur de jeu ne prévoit aucun support de projets tiers/SDK propriétaire, du fait que leur intégration irait à l'encontre de l'éthique de Godot.
ko: Godot의 목표는 모듈 방식에 확장 가능한, 무료 오픈 소스 MIT 라이선스 엔진을 만드는 것입니다. 핵심 엔진 개발 커뮤니티는 클로즈 소스/독점 SDK와 통합하는 것은 Godot의 정신에 반하기에 이를 지원할 계획이 없습니다.
pl: Celem Godot jest stworzenie darmowego i otwarto-źródłowego silnika opartego na licencji MIT, który jest modularny i rozszerzalny. Nie ma planów, aby społeczność rozwijająca rdzeń silnika wspierała jakiekolwiek SDK firm trzecich które posiada zamknięte źródła czy jest własnościowe. Taka integracja byłaby sprzeczna z etyką Godot'a.
uk: Метою Godot є створення вільного та відкритого рушія з ліцензією MIT, який є модульним та розширюваним. Спільнота розробників рушія не планує підтримувати будь-які сторонні, закриті/пропрієтарні SDK, оскільки інтеграція з ними суперечить принципам Godot.

source: That said, because Godot is open source and modular, nothing prevents you or anyone else interested in adding those libraries as a module and shipping your game with them, as either open- or closed-source.
cs: Vzhledem k tomu, že Godot je open-source a modulární, nic nebrání vám ani komukoli jinému přidat tyto knihovny jako moduly a distribuovat s nimi hru ať už formou open či closed source.
de: Da Godot allerdings quelloffen und modular ist, hindert Sie nichts daran, diese Bibliotheken als Module hinzuzufügen und Ihr Spiel mit ihnen zu vertreiben - sei es als Open Source oder als proprietäre Software.
es: Dicho esto, como Godot es de código abierto y modular, nada te impide a ti ni a nadie interesado en añadir esas bibliotecas como módulo y distribuir tu juego con ellas, ya sea como código abierto o como código cerrado.
fr: Cela dit, Godot étant un logiciel libre et modulaire, rien ne vous empêche vous ou toute autre personne intéressée d'ajouter ces bibliothèques en tant que module et d'expédier votre jeu avec elles, en tant que logiciel libre ou fermé.
pl: Ponieważ Godot jest "open-source" i modularny, nic nie stoi na przeszkodzie abyś ty lub ktokolwiek inny zainteresowany dodał te biblioteki jako moduł i stworzył grę z ich pomocą – jako oprogramowanie z otwartym lub zamkniętym źródłem.
ru: Тем не менее, поскольку Godot является открытым и модульным, ничто не мешает вам или кому-либо еще заинтересоваться добавлением этих библиотек в качестве модуля и распространять вашу игру с ним в качестве открытого или закрытого источника.
uk: Тим не менш, оскільки Godot є відкритим і модульним, ніщо не заважає вам або будь-кому іншому, хто зацікавлений, додати ці бібліотеки як модуль і постачати свою гру з ними, як з відкритим, так і з закритим вихідним кодом.

source: To see how support for your SDK of choice could still be provided, look at the Plugins question below.
cs: Chcete-li zjistit, jak by mohla být podpora pro vaše vybrané SDK poskytována, se podívejte níže na otázku týkající se pluginů.
de: Wie die Implementierung für Ihr gewünschtes SDK doch umgesetzt werden könnte, erfahren Sie bei der Frage zu Plugins weiter unten im Text.
es: Para ver cómo se puede seguir ofreciendo soporte para el SDK de tu elección, consulta la sección de Plugins a continuación.
fr: Pour voir comment votre SDK préféré pourrait être supporté, jetez un œil à la question sur les plugins ci-dessous.
ko: 여러분이 선택한 SDK에 대한 지원은 아래 플러그인 질문을 읽어보세요.
pl: Aby sprawdzić, czy nadal dostarczane jest wsparcie dla wybranego przez Ciebie SDK, sprawdź pytanie o Wtyczki znajdujące się poniżej.
ru: Чтобы узнать, как еще можно обеспечить поддержку вашего SDK, прочтите в вопросах о плагинах выше.
uk: Щоб дізнатись, як може бути надана підтримка вашого SDK, перегляньте запитання про плагіни вище.

source: If you know of a third-party SDK that is not supported by Godot but that offers free and open source integration, consider starting the integration work yourself. Godot is not owned by one person; it belongs to the community, and it grows along with ambitious community contributors like you.
cs: Pokud víte o sadě SDK třetích stran, kterou Godot nepodporuje, ale která nabízí bezplatnou a open-source integraci, zvažte zahájení integrační práce vlastní silou. Godot není jen ve vlastnictví jedné osoby; patří komunitě a roste spolu s ambicemi komunitních přispěvatelů, jako jste vy.
de: Wenn Ihnen ein nützliches SDK bekannt ist, das noch nicht von Godot unterstützt wird, aber eine freie und quelloffene Integration erlaubt, können Sie gern selbst an einer Integration arbeiten. Godot gehört nicht einer Person; es gehört der Community und wächst mit ambitionierten Mitwirkenden aus der Community wie Ihnen.
es: Si conoces algún SDK de terceros que no es soportado por Godot, pero que ofrece integración gratuita y de código abierto, considera iniciar el trabajo de integración por ti mismo. Godot no es propiedad de una persona; pertenece a la comunidad y crece junto con los contribuyentes ambiciosos de la comunidad, como tu.
fr: Si vous connaissez un SDK externe qui n'est pas supporté par Godot mais qui permet une intégration libre et open source, n'hésitez pas à commencer cette intégration vous-même. Godot n'est pas la propriété d'une personne ; il appartient à la communauté, et il grandit avec des contributeurs ambitieux comme vous.
ko: 혹시 Godot가 지원하진 않지만 무료이고 오픈 소스로 제공하는 다른 SDK를 아신다면 직접 통합 작업을 시작해보세요. Godot는 한 사람의 것이 아닙니다; Godot는 한 사람의 소유가 아닌 커뮤니티에 속해 있으며, 당신과 같은 야심 찬 커뮤니티 기여자들과 함께 성장합니다.
pl: Jeśli znasz zewnętrzne SDK, które nie jest jeszcze wspierane przez Godota, a oferuje możliwość integracji zgodnie z licencją open-source, rozważ rozpoczęcie pracy nad integracją na własną rękę. Godot nie należy do jednej osoby. Należy do społeczności, a ona rozwija się dzięki ambitnym członkom, takim jak Ty.
uk: Якщо ви знаєте сторонній SDK, який не підтримується Godot, але пропонує безкоштовну інтеграцію з відкритим кодом, подумайте про те, щоб розпочати роботу над інтеграцією самостійно. Godot не належить одній людині; він належить спільноті, і він розвивається разом з амбітними учасниками спільноти, такими як ви.

source: How can I extend Godot?
cs: Jak mohu rozšířit Godot?
de: Wie kann ich Godot erweitern?
es: ¿Cómo puedo extender Godot?
fr: Comment puis-je améliorer Godot ?
ko: 어떻게 Godot를 확장할 수 있나요?
pl: Jak mogę rozbudować Godota?
ru: Как я могу расширить Godot?
uk: Як я можу розширити Godot?

source: For extending Godot, like creating Godot Editor plugins or adding support for additional languages, take a look at :ref:`EditorPlugins <doc_making_plugins>` and tool scripts.
cs: Chcete-li rozšířit Godot, například vytvořit pluginy editoru Godot nebo přidat podporu pro další jazyky, podívejte se na :ref:`Editor pluginů <doc_making_plugins>` a skripty nástrojů.
de: Um Godot zu erweitern, zum Beispiel durch das Erstellen von Godot-Editor-Plugins oder die Unterstützung weiterer Sprachen, siehe :ref:`Plugins <doc_making_plugins>` und die Tool-Skripte.
es: Para extender Godot, como crear plugins de Godot Editor o añadir soporte para lenguajes adicionales, echa un vistazo a :ref:`EditorPlugins <doc_making_plugins>` y tool scripts.
fr: Pour améliorer Godot, par exemple en créant des plugins pour l'éditeur ou supporter un langage supplémentaire, consultez les :ref:`EditorPlugins <doc_making_plugins>` et les outils de scripting.
ko: Godot 에디터 플러그인을 제작하거나 추가적인 언어를 지원하고 싶다면 :ref:`에디터 플러그인 <doc_making_plugins>`\ 과 툴(tool) 스크립트를 참고하세요.
pl: Jeżeli chcesz rozszerzyć funkcjonalność silnika, np. poprzez stworzenie wtyczki do edytora lub dodając wsparcie dla kolejnego języka, poczytaj o :ref:`tworzeniu wtyczek <doc_making_plugins>` i skryptach narzędziowych.
ru: Для расширения Godot, например, для создания плагинов редактора Godot или добавления поддержки дополнительных языков, взгляните на :ref:`Редактор плагинов <doc_making_plugins>` и инструментальные скрипты (tool скрипты).
uk: Як створювати плаґіни (додатки) до редактора Godot, перегляньте на :ref:`Плаґіни редактора <doc_making_plugins>` та інструментарій скриптів.

source: Also, see the official blog post on GDExtension, a way to develop native extensions for Godot:
cs: Podívejte se také na oficiální blogové příspěvky na GDExtension, možnost jak vyvíjet nativní doplňky pro Godot:
de: Siehe auch die offiziellen Blogeinträge zum Thema GDExtension, eine Möglichkeit, native Erweiterungen für Godot zu entwickeln (auf Englisch):
es: Mira también las publicaciones del blog oficial sobre GDExtension, una manera de desarrollar extensiones nativas para Godot:
fr: Consultez également l'article du blog officiel sur GDExtension, un moyen de développer des extensions natives pour Godot :
ru: Кроме того, см. официальный пост в блоге про GDExtension, способ разработки нативных расширений для Godot:
uk: Також, дивіться офіційний блог про GDExtension, спосіб розробки власних розширень для Godot:

source: `Introducing GDNative's successor, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_
cs: `Představujeme nástupce GDNative, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_
es: `Introduciendo el sucesor de GDNative, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_
fr: `Voici le successeur de GDNative, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_
ru: `Представляем преемника GDNative, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_
uk: `Представляємо наступника GDNative, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_

source: You can also take a look at the GDScript implementation, the Godot modules, as well as the `Jolt physics engine integration <https://github.com/godot-jolt/godot-jolt>`__ for Godot. This would be a good starting point to see how another third-party library integrates with Godot.
cs: Můžete se také podívat na implementaci GDScriptu, moduly Godotu a také na `integraci Jolt physics enginu <https://github.com/godot-jolt/godot-jolt>`__ pro Godot. To je dobrým začátečním bodem pro pochopení, jak se knihovny třetích stran do Godot integrují.
de: Sie können auch einen Blick auf die GDScript-Implementierung, die Godot-Module und die Integration der `Jolt-Physik-Engine <https://github.com/godot-jolt/godot-jolt>`__ für Godot werfen. Dies wäre ein guter Ausgangspunkt, um zu sehen, wie sich eine andere Drittanbieter-Bibliothek in Godot integriert.
es: También puedes revisar la implementación de GDScript, los módulos de Godot, así como la `integración del motor de física Jolt <https://github.com/godot-jolt/godot-jolt>`__ para Godot. Este sería un buen punto de partida para ver cómo otra librería de terceros se integra con Godot.
fr: Vous pouvez également jeter un coup d’œil à l'implémentation de GDScript, aux modules de Godot, ainsi qu'au `support non-officiel de Python <https://github.com/touilleMan/godot-python>`_ pour Godot. Ce serait un bon point de départ pour observer comment les bibliothèques tierces s'intègrent dans Godot.
ru: Вы также можете взглянуть на реализацию GDScript, модулей Godot, а также на `интеграцию физического движка Jolt <https://github.com/godot-jolt/godot-jolt>`__ для Godot. Это было бы хорошей отправной точкой, чтобы увидеть, как другая сторонняя библиотека интегрируется с Godot.
uk: Ви також можете ознайомитися з реалізацією GDScript, модулями Godot, а також з інтеграцією фізичного рушія Jolt <https://github.com/godot-jolt/godot-jolt>`__ для Godot. Це буде гарною відправною точкою для ознайомлення з тим, як інтегрується з Godot інша бібліотека сторонніх розробників.

source: How do I install the Godot editor on my system (for desktop integration)?
cs: Jak nainstaluji editor Godot na svém systému (pro integraci na desktopové počítače)?
de: Wie installiere ich den Godot Editor (für Desktop-Integration) auf meinem System?
es: ¿Cómo instalo el editor de Godot en mi sistema (para la integración de escritorio)?
fr: Comment installer l'éditeur Godot sur mon système (pour l'intégration du bureau) ?
ko: 어떻게 고도 에디터를 내 컴퓨터에 설치할 수 있나요?
pl: Jak mogę zainstalować edytor Godot'a na moim systemie (dla integracji z pulpitem)?
ru: Как мне установить редактор Godot на свою систему (для установки на рабочий стол)?
uk: Як встановити редактор Godot на мою систему (щоб була інтеграція з робочим столом)?

source: Since you don't need to actually install Godot on your system to run it, this means desktop integration is not performed automatically. There are two ways to overcome this. You can install Godot from `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (all platforms), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) or `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). This will automatically perform the required steps for desktop integration.
cs: Vzhledem k tomu, že nepotřebujete Godot instalovat na svůj systém abyste jej spustili, znamená, že se integrace desktopového rozhraní neprovádí automaticky. Existují dva způsoby, jak toto překonat. Godot si můžete nainstalovat ze `Steamu <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (všechny platformy), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) nebo `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). Tím se automaticky provedou požadované kroky pro integraci desktopového rozhraní.
de: Da Godot für die Ausführung nicht unbedingt auf dem eigenen System installiert werden muss, bedeutet es, dass die Desktop-Integration nicht automatisch passiert. Es gibt zwei Wege, das zu trotzdem erreichen. Sie können Godot von `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (alle Plattformen), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) oder `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux) installieren. Dies wird automatisch die benötigten Schritte für eine Desktop-Integration ausführen.
es: Dado que no necesita instalar Godot en su sistema para ejecutarlo, esto significa que la integración del escritorio no se realiza automáticamente. Hay dos formas de superar esto. Puedes instalar Godot desde `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (todas las plataformas), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) o `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). Esto realizará automáticamente los pasos necesarios para la integración de escritorio.
fr: Étant donné que vous n’avez pas besoin d’installer Godot sur votre système pour l’exécuter, cela signifie que l’intégration du bureau (voir Godot dans la liste des programmes) n’est pas effectuée automatiquement. Il y a deux façons de surmonter cela. Vous pouvez installer Godot à partir de 'Steam <https://store.steampowered.com/app/404790/Godot_Engine/>'__ (toutes les plates-formes), 'Scoop <https://scoop.sh/>'__ (Windows), 'Homebrew <https://brew.sh/>'__ (macOS) ou 'Flathub <https://flathub.org/apps/details/org.godotengine.Godot>'__ (Linux). Cela effectuera automatiquement les étapes requises pour l’intégration de bureau.
ko: Godot를 실행하기 위해 시스템에 설치할 필요가 없기 때문에 데스크톱에서 통합이 자동으로 수행되지 않습니다. 이를 극복하기 위해 두 가지 방법이 있습니다. 당신은 Godot을 `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (all platforms), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) 또는 `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux) 을 통해 설치할 수 있습니다. 이 방법들은 데스크톱 통합을 위한 과정들을 자동으로 수행할 것 입니다.
pl: Ponieważ nie musisz instalować Godota na swoim urządzeniu, aby móc go uruchamiać, integracja desktopowa nie jest wykonywana automatycznie. Są dwa sposoby na obejście tego. Możesz zainstalować Godota przy pomocy instalatora ze `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (dla wszystkich platform), `Scoop <https://scoop.sh/>`__ (dla Windows), `Homebrew <https://brew.sh/>`__ (dla macOS) or `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (dla Linux). Instalator sam wykona wszystkie kroki potrzebne dla integracji desktopowej.
ru: Так как Вам не нужно устанавливать Godot на Вашу систему, чтобы запустить его, это значит, что установка на рабочий стол не выполняется автоматически. Есть два способа для решения этой проблемы. Вы можете установить Godot через `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>` __ (на всех платформах), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) или `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). С помощью этого необходимые шаги для установки на рабочий стол будут выполнены автоматически.
uk: Оскільки насправді вам не потрібно встановлювати Godot у вашій системі, щоб запустити його, це означає, що інтеграція з робочим столом не виконується автоматично. Є два способи подолати це. Ви можете встановити Godot з `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (всі платформи), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS), або `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). Тоді кроки необхідні для інтеграції з робочим столом будуть виконані автоматично.

source: Alternatively, you can manually perform the steps that an installer would do for you:
cs: Případně můžete ručně provést kroky, které by za vás udělal instalační program:
de: Alternativ können Sie die Schritte, die ein Installationsprogramm für Sie erledigen würde, auch manuell durchführen:
es: Como alternativa, puede realizar manualmente los pasos que un instalador haría por usted:
fr: Sinon, vous pouvez faire ces étapes manuellement qu'un installeur ferait à votre place :
ko: 또는 설치 프로그램이 수행하는 단계를 수동으로 수행할 수 있습니다 :
pl: Ewentualnie, możesz samemu wykonać wszystkie czynności, które miał wykonać za ciebie instalator:
ru: Либо же Вы можете вручную выполнить шаги, которые программа установки сделала бы за Вас:
uk: Крім того, ви можете вручну зробити необхідні кроки:
