Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: Frequently asked questions
cs: Často kladené otázky
de: Häufig gestellte Fragen
es: Preguntas Frecuentes
fr: Questions fréquentes
ko: 자주 묻는 질문들(FAQ)
pl: Często zadawane pytania
ru: Часто задаваемые вопросы
uk: Поширені запитання

source: What can I do with Godot? How much does it cost? What are the license terms?
cs: Co mohu dělat s Godot? Kolik to stojí? Jaké jsou licenční podmínky?
de: Was kann ich mit Godot machen? Wie viel kostet es? Wie lauten die Lizenzbedingungen?
es: ¿Qué puedo hacer con Godot? ¿Cuánto cuesta? ¿Dónde están los términos de licencia?
fr: Que puis-je faire avec Godot ? Combien coûte-t-il ? Quels sont les termes de la licence ?
ko: Godot로 무엇을 할 수 있나요? 가격은 얼마인가요? 라이선스 조항은 어떻게 되나요?
pl: Co mogę zrobić z Godotem? Ile będzie mnie to kosztować? Jakie są warunki licencji?
ru: На что способен Godot? Сколько он стоит? Каковы условия лицензирования?
uk: Що я можу зробити з Godot? Скільки це коштує? Які ліцензійні умови?

source: Godot is `Free and open source Software <https://en.wikipedia.org/wiki/Free_and_open source_software>`_ available under the `OSI-approved <https://opensource.org/licenses/MIT>`_ MIT license. This means it is free as in "free speech" as well as in "free beer."
cs: Godot je `Svobodný software s otevřeným zdrojovým kódem <https://en.wikipedia.org/wiki/Free_and_opensource_software>`_ dostupný pod `OSI-approved MIT licencí <https://opensource.org/licenses/MIT>`_. To znamená, že je zdarma jako "svoboda projevu" nebo jako "pivo zdarma."
de: Godot ist `freie und quelloffene Software <https://en.wikipedia.org/wiki/Free_and_open source_software>`_, die unter der von der `OSI genehmigten <https://opensource.org/licenses/MIT>`_ MIT-Lizenz verfügbar ist. Das bedeutet, dass sie frei ist, sowohl im Sinne von „freier Rede“ als auch von „Freibier.“
es: Godot es un `Software libre y de código abierto <https://es.wikipedia.org/wiki/Software_libre_y_de_c%C3%B3digo_abierto>`_ disponible bajo la licencia MIT `aprobada por la OSI <https://opensource.org/licenses/MIT>`_ Licencia MIT. Esto significa que es gratuito en el sentido de "libertad de expresión" así como en "libre acceso."
fr: Godot est un `logiciel libre et à code source ouvert (open source) <https://fr.wikipedia.org/wiki/Free/Libre_Open_Source_Software>`_ disponible sous `licence MIT, approuvée par l'OSI <https://opensource.org/licenses/MIT>`_. Cela veut dire qu'il est à la fois libre comme dans "liberté d'expression" et gratuit comme dans "bière gratuite."
pl: Godot jest darmowym, `Wolnym i otwartym oprogramowaniem <https://pl.wikipedia.org/wiki/Wolne_i_otwarte_oprogramowanie>`_ dostępnym na licencji `MIT <https://opensource.org/licenses/MIT>`_, zatwierdzonej przez OSI.
ru: Godot — это `Свободное программное обеспечение с открытым исходным кодом <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_, доступное по `одобренной OSI <https://opensource.org/licenses/MIT>`_ лицензии MIT.
uk: Godot - це "Вільне програмне забезпечення з відкритим вихідним кодом <https://en.wikipedia.org/wiki/Free_and_open source_software>", доступне за ліцензією MIT, схваленою OSI <https://opensource.org/licenses/MIT>. Це означає, що воно вільне так само, як "свобода слова" і "безкоштовне пиво."

source: In short:
cs: Ve zkratce:
de: Zusammengefasst:
es: En pocas palabras:
fr: En bref :
ko: 간단히 말해서:
pl: W skrócie:
ru: Вкратце:
uk: Коротко:

source: You are free to download and use Godot for any purpose: personal, non-profit, commercial, or otherwise.
cs: Můžete si zdarma stáhnout a používat Godot pro jakékoliv účely: osobní, neziskový, komerční nebo jakkoli jinak.
de: Sie können Godot frei herunterladen und für jeden Zweck verwenden: persönlich, gemeinnützig, kommerziell oder sonstiges.
es: Eres libre de descargar y usar Godot para cualquier propósito: personal, sin ánimo de lucro, comercial o de otro tipo.
fr: Vous êtes libre de télécharger et d'utiliser Godot pour tout usage : personnel, sans but lucratif, commercial ou autre.
ko: 개인적, 비영리, 사업 목적으로, 그 외 어떤 이유로든지 자유롭게 Godot를 다운로드하고 사용할 수 있습니다.
pl: Możesz pobrać Godota i używać go w dowolnych celach: prywatnych, nie dających zysków, komercyjnych, czy jakichkolwiek innych.
ru: Вы можете бесплатно загрузить и использовать Godot для любых целей: личных, некоммерческих, коммерческих или иных.
uk: Ви можете вільно отримати Godot і користуватися ним для будь-яких потреб, особистих, некомерційних, комерційних або інших.

source: You are free to modify, distribute, redistribute, and remix Godot to your heart's content, for any reason, both non-commercially and commercially.
cs: Můžete volne modifikovat, distribuovat, předávat a upravovat Godot tak jak uznáte za vhodné a to z jakéhokoli důvodu, ať už nekomerčně nebo komerčně.
de: Es steht Ihnen frei, Godot nach Herzenslust zu verändern, neu zu veröffentlichen, weiterzugeben und zu remixen, und zwar aus jedem beliebigen Grund, sowohl nichtkommerziell als auch kommerziell.
es: Eres libre de modificar, distribuir, redistribuir y mezclar Godot como quieras, por cualquier razón, ya sea no comercial o comercialmente.
fr: Vous êtes libre de modifier, distribuer, redistribuer et remixer Godot comme bon vous semble, pour quelque raison que ce soit, à la fois de manière non commerciale et commerciale.
ko: 비상업적이든 상업적이든 어떤 이유로든 Godot를 마음대로 자유롭게 수정하고, 배포하고, 재배포하고 리믹스할 수 있습니다.
pl: Możesz dowolnie modyfikować i rozprowadzać Godota według własnego uznania, w jakichkolwiek celach, zarówno niekomercyjnie jak i komercyjnie.
ru: Вы можете свободно изменять, распространять и пересобирать Godot по любой причине, как не коммерчески, так и коммерчески.
uk: Ви можете модифікувати, поширювати і поєднувати Godot із іншими компонентами так, як цього забажаєте, для будь-якої мети, некомерційної або комерційної.

source: All the contents of this accompanying documentation are published under the permissive Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "Juan Linietsky, Ariel Manzur and the Godot Engine community."
cs: Veškerý obsah této doprovodné dokumentace je zveřejněn pod volnou licencí Creative Commons Attribution 3.0 ( `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_ ), s přiřazením licence k „Juan Linietsky, Ariel Manzur a komunitě Godot Engine. "
de: Der gesamte Inhalt dieser Begleitdokumentation wird unter der Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) Lizenz veröffentlicht, mit der Namensnennung „Juan Linietsky, Ariel Manzur and the Godot Engine community.“
es: Todo el contenido que acompaña esta documentación está publicado bajo la licencia permisiva Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), con atribución a "Juan Linietsky, Ariel Manzur y la comunidad Godot Engine."
fr: Tout le contenu de cette documentation est publié sous la licence permissive Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), avec attribution à "Juan Linietsky, Ariel Manzur et la communauté du moteur Godot."
pl: Cała zawartość tej towarzyszącej dokumentacji jest udostępniona licencji Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), z przypisaniem autorstwa dla "Juan Linietsky, Ariel Manzur and the Godot Engine community."
ru: Все содержимое этой сопроводительной документации опубликовано под лицензией Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) с указанием авторства "Хуан Линецкий, Ариэль Манзур и сообщество Godot Engine."
uk: Весь вміст цієї супровідної документації публікується під ліцензією Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) із зазначенням авторства "Juan Linietsky, Ariel Manzur та спільнота Godot Engine."

source: Logos and icons are generally under the same Creative Commons license. Note that some third-party libraries included with Godot's source code may have different licenses.
cs: Loga a ikony jsou obecně pod stejnou licencí Creative Commons. Upozorňujeme, že některé knihovny třetích stran zahrnuté ve zdrojovém kódu Godota mohou mít různé licence.
de: Für Logos und Icons gilt generell die gleiche „Creative Commons“-Lizenz. Beachten Sie jedoch, dass manche Bibliotheken von Drittanbietern, die im Quellcode Godots enthalten sind, abweichende Lizenzen enthalten können.
es: Los logos e iconos están generalmente bajo la misma licencia Creative Commons. Ten en cuenta que algunas librerías de terceros, incluídas en el código fuente de Godot, pueden tener licencias diferentes.
fr: Les logos et icônes sont généralement sous la même licence Creative Commons. Notez que certaines bibliothèques de tiers incluses avec le code source de Godot peuvent avoir des licences différentes.
ko: 로고와 아이콘은 일반적으로 동일한 크리에이티브 커먼스 라이선스 하에 속합니다. Godot의 소스 코드에 포함된 일부 서드 파티 라이브러리에는 다른 라이선스가 적용될 수 있으므로 유의하세요.
pl: Loga i ikony są zazwyczaj objęte tą samą licencją Creative Commons. Zauważ, że niektóre biblioteki innych firm dołączone do kodu źródłowego Godota mogą mieć inne licencje.
ru: Логотипы и иконки также находятся под лицензией Creative Commons. Заметьте, что сторонние библиотеки, включённые в исходный код Godot, могут иметь другие лицензии.
uk: Логотипи та значки, як правило, знаходяться під однією ліцензією Creative Commons. Зауважте, що деякі сторонні бібліотеки, включені до вихідного коду Godot, можуть мати різні ліцензії.

source: For full details, look at the `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ as well as the `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ and `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ files in the Godot repository.
cs: Veškeré podrobnosti naleznete v souborech `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_, `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ a `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ v úložišti Godot.
de: Für alle Details siehe die Dateien `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ und `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_, sowie `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ im Godot-Repository.
es: Para más detalles, revisa los archivos `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ al igual que `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ y `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ en el repositorio de Godot.
fr: Pour tous les détails, voir les fichiers `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ ainsi que `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ et `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ dans le dépôt Godot.
ru: Для полной информации, смотрите `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ ,а также `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ и `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ в репозитории Godot.
uk: Докладнішу інформацію можна знайти у файлах `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_, а також `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ та `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ у репозиторії Godot.

source: Also, see `the license page on the Godot website <https://godotengine.org/license>`_.
cs: Viz také `licenční stránka na webu Godot <https://godotengine.org/license>`_.
de: Siehe auch `Hinweise zur Lizenz auf der Godot-Webseite <https://godotengine.org/license>`_.
es: Mira también `la página de la licencia en el sitio web de Godot <https://godotengine.org/license>`_.
fr: Voir aussi `la page de la licence sur le site de Godot <https://godotengine.org/license>`_.
ko: `Godot 웹 사이트의 라이선스 페이지 <https://godotengine.org/license>`_\ 도 참고하세요.
pl: Zobacz również `stronę z licencją Godota <https://godotengine.org/license>`_.
ru: Также смотрите `страницу лицензии официального сайта Godot <https://godotengine.org/license>`_.
uk: Також див. `сторінку ліцензії на вебсайті Godot <https://godotengine.org/license>`_.

source: Which platforms are supported by Godot?
cs: Které platformy podporuje Godot?
de: Welche Plattformen werden von Godot unterstützt?
es: ¿Que plataformas soporta Godot?
fr: Quelles plateformes sont supportées par Godot ?
ko: Godot는 어떤 플랫폼을 지원하나요?
pl: Jakie platformy są obsługiwane przez Godota?
ru: Какие платформы поддерживаются Godot?
uk: Які платформи підтримуються Godot?

source: **For the editor:**
cs: **Pro editor:**
de: **Vom Editor unterstützt:**
es: **Para el editor:**
fr: **Pour l'éditeur:**
ko: **에디터:**
pl: **Do tworzenia:**
ru: **Для редактора:**
uk: **Для редактора:**

source: Linux, \*BSD
uk: Лінукс, \*BSD

source: Android (experimental)
cs: Android (experimentální)
de: Android (experimentell)
fr: Android (expérimental)
ko: Android (시험용)
pl: Android (eksperymentalne)
ru: Android (экспериментальный)
uk: Android (експериментальний)

source: `Web <https://editor.godotengine.org/>`__ (experimental)
cs: `Webové stránky <https://editor.godotengine.org/>`__ (experimentální)
de: `Web <https://editor.godotengine.org/>`__ (experimentell)
es: `GitHub <https://github.com/godotengine/>`_
fr: `Web <https://editor.godotengine.org/>`__ (expérimental)
pl: `Przeglądarka <https://editor.godotengine.org/>`__ (eksperymentalne)
ru: `Web <https://editor.godotengine.org/>`__ (экспериментальный)
uk: `Web <https://editor.godotengine.org/>`__ (експериментальний)

source: **For exporting your games:**
cs: **Pro export vašich her:**
de: **Für das Exportieren von Spielen:**
es: **Para exportar tus juegos:**
fr: **Pour exporter vos jeux:**
ko: **내보내는 게임:**
pl: **Eksport gier dla:**
ru: **Для экспорта ваших игр:**
uk: **Для експорту ваших ігор:**

source: Web
ko: 웹
pl: Przeglądarka (HTML5)
uk: Інтернет

source: Both 32- and 64-bit binaries are supported where it makes sense, with 64 being the default. Official macOS builds support Apple Silicon natively as well as x86_64.
cs: Obě 32-bit a 64-bit bitové verze jsou podporovány všude, kde to dává smysl, s tím že 64 je defaultní. Oficiální macOS sestavení přirozeně podporuje Apple Silicon stejně jako x86_64.
de: Wo es sinnvoll ist, werden sowohl 32- als auch 64-Bit-Binärdateien unterstützt, wobei 64 der Default ist. Offizielle macOS-Builds unterstützen sowohl Apple Silicon nativ als auch x86_64 .
es: Binarios de 32 y 64 bits son soportados donde corresponda, siendo la de 64 bits la predeterminada. Binarios oficiales para macOS soportan Apple Silicon de manera nativa así como x86_64.
fr: Les formats binaires 32 et 64 bits sont supportés quand appropriés. Le format 64 bits est utilisé par défaut. Les builds officiels de macOS supportent nativement les Apple Silicon aussi bien que les x86_64.
ko: 32비트와 64비트 바이너리 모두 지원되며, 64비트가 기본값입니다. 공식 macOS 빌드는 x86_64 뿐만 아니라 Apple Silicon 또한 기본적으로 지원합니다.
pl: Zarówno 32- i 64-bitowe pliki wykonywalne są wspierane tam, gdzie ma to sens, jednak 64-bitowe są domyślne. Oficjalne kompilacje na macOS obsługują natywnie zarówno Apple Silicon jak i x86_64.
ru: Поддерживается создание 32-х и 64-х битных исполняемых файлов (для платформ, где это возможно); по умолчанию создаются 64-х битные файлы. Официальные сборки macOS поддерживают Apple Silicon так же, как и x86_64.
uk: Підтримуються як 32-, так і 64-розрядні двійкові файли, де це має сенс, причому за замовчуванням використовується 64-розрядність. Офіційні збірки macOS підтримують Apple Silicon нативно, а також x86_64.

source: Some users also report building and using Godot successfully on ARM-based systems with Linux, like the Raspberry Pi.
cs: Někteří uživatelé také hlásí úspěšné sestavení a použití Godot na systémech založených na ARM s Linuxem, jako je Raspberry Pi.
de: Einige Nutzer berichten, dass sie Godot auch auf ARM-basierten Linux-Systemen, wie dem Raspberry Pi, erfolgreich kompilieren und benutzen konnten.
es: Algunos usuarios también reportan haber compilado y usado Godot en sistemas basados en ARM con Linux, como la Raspberry Pi.
fr: Certains utilisateurs ont aussi reporté avoir compilé et utilisé Godot avec succès sur des systèmes basés sur l'architecture ARM avec Linux, tels que le Raspberry Pi.
ko: 일부 사용자들은 Linux로 Raspberry Pi와 같은 ARM 기반 시스템에 Godot를 성공적으로 빌드하고 사용했다고 말합니다.
pl: Niektórzy użytkownicy również Informują że można używać Godot na systemach z Linuxem opartych na architekturze ARM, jak np. Raspberry Pi.
ru: Некоторые пользователи также сообщают о сборке и использовании Godot для систем на базе ARM с Linux, таких как Raspberry Pi.
uk: Деякими користувачами повідомлялося про успішне збирання та використання Godot на заснованих на ARM системах із ядром Linux, зокрема на Raspberry Pi.

source: The Godot team can't provide an open source console export due to the licensing terms imposed by console manufacturers. Regardless of the engine you use, though, releasing games on consoles is always a lot of work. You can read more about :ref:`doc_consoles`.
cs: Tým enginu Godot nemůže poskytovat export open-source projektů na konzole kvůli licenčním podmínkám stanovených jejich výrobci. Bez ohledu na engine, který použijete, znamená vydání her pro konzole vždy hodně práce. Více se můžete dočíst na :ref:`doc_consoles`.
de: Das Godot-Team kann aufgrund der von den Konsolenherstellern auferlegten Lizenzbedingungen keinen Open-Source-Export für Konsolen anbieten. Unabhängig davon, welche Engine Sie verwenden, ist die Veröffentlichung von Spielen auf Konsolen jedoch immer mit viel Arbeit verbunden. Sie können mehr über :ref:`doc_consoles` lesen.
es: El equipo de Godot no puede proporcionar una exportación de código abierto a consolas debido a los términos de licencia impuestos por los fabricantes de las mismas. Independientemente del motor que uses, lanzar juegos en consolas siempre implica mucho trabajo. Puedes leer más sobre eso aquí :ref:`doc_consoles`.
fr: L'équipe Godot ne peut pas fournir un exporteur je jeux pour console open-source à cause des termes de licence imposées par les fabricants de la console. Indépendamment du moteur que vous utilisez, sortir des jeux sur consoles représente toujours beaucoup de travail. Vous pouvez en lire plus ici : :ref:`doc_consoles`.
ko: Godot 팀은 콘솔 제조업체의 라이선스 조건으로 인해 오픈 소스 콘솔 내보내기를 제공할 수 없습니다. 그러나 사용하는 엔진과 관계없이 콘솔에서 게임을 출시하는 것은 항상 많은 작업을 필요로 합니다. 이에 대해 더 자세한 내용은 여기에서 확인하실 수 있습니다: :ref:`doc_consoles`.
pl: Zespół Godota nie może zapewnić eksportu na konsole ze względu na warunki licencyjne nałożone przez producentów konsol. Niezależnie od tego, jakiego silnika używasz, wydawanie gier na konsole zawsze wymaga dużo pracy. Więcej na ten temat możesz przeczytać tutaj: :ref:`doc_consoles`.
ru: Команда Godot не может обеспечить реализацию экспорта с открытым исходным кодом на консоли из-за условий лицензирования, установленных производителями консолей. Независимо от используемого движка, выпуск игр на консоли — это всегда большой объём работы. Вы можете узнать больше здесь: :ref:`doc_consoles`.
uk: Команда Godot не може забезпечити експорт відкритого вихідного коду на консолі через ліцензійні умови, накладені виробниками консолей. Однак, незалежно від того, який рушій ви використовуєте, випуск ігор для консолей - це завжди багато роботи. Ви можете прочитати більше про :ref:`doc_consoles`.

source: For more on this, see the sections on :ref:`exporting <toc-learn-workflow-export>` and :ref:`compiling Godot yourself <toc-devel-compiling>`.
cs: Pro více informací se podívejte na sekce :ref:`exportování <toc-learn-workflow-export>` a :ref:`kompilování Godot <toc-devel-compiling>`.
de: Mehr dazu in den Abschnitten :ref:`Exportieren <toc-learn-workflow-export>` und :ref:`Godot kompilieren <toc-devel-compiling>`.
es: Para más información sobre este tema, consulta las secciones sobre :ref:`exportación <toc-learn-workflow-export>` y :ref:`compilación de Godot <toc-devel-compiling>`.
fr: Pour plus d'informations à ce sujet, voir les sections sur :ref:`exporting <toc-learn-workflow-export>` et la :ref:`compiling Godot yourself <toc-devel-compiling>`.
ko: 자세한 정보는 :ref:`내보내기 <toc-learn-workflow-export>`\ 와 :ref:`Godot를 직접 컴파일하기 <toc-devel-compiling>`\ 섹션을 참고하세요.
pl: Po więcej informacji, sprawdź rozdział o :ref:`eksportowaniu <toc-learn-workflow-export>` i :ref:`kompilowaniu Godota <toc-devel-compiling>`.
ru: Более подробная информация есть в разделах :ref:`экспорт <toc-learn-workflow-export>` и :ref:`как собрать Godot <toc-devel-compiling>`.
uk: Щоб дізнатись більше про це, перегляньте розділи про :ref:`експортування <toc-learn-workflow-export>` та :ref:`компілювання Godot самостійно <toc-devel-compiling>`.

source: Godot 3 also had support for Universal Windows Platform (UWP). This platform port was removed in Godot 4 due to lack of maintenance, and it being deprecated by Microsoft. It is still available in the current stable release of Godot 3 for interested users.
cs: Godot 3 měl také podporu pro Universal Windows Platform (UWP). Tento port platformy byl v Godot 4 odstraněn kvůli nedostatečné údržbě a Microsoft ho zavrhl. Pro zainteresované uživatele je stále k dispozici v aktuální stabilní verzi Godot 3.
de: Godot 3 bot auch Unterstützung für die Universal Windows Platform (UWP). Diese Plattform-Portierung wurde in Godot 4 aufgrund mangelnder Wartung entfernt, und sie wird auch von Microsoft nicht weiter unterstützt. Sie ist im aktuellen stable Release von Godot 3 für interessierte Benutzer weiterhin verfügbar.
es: Godot 3 también tenía soporte para la Plataforma universal de Windows (UWP). Este puerto de la plataforma se eliminó en Godot 4 debido a la falta de mantenimiento y Microsoft lo dejó obsoleto. Todavía está disponible en la versión estable actual de Godot 3 para los usuarios que estén interesados.
fr: Godot 3 supportait la Plateforme Windows Universelle (UWP). Cette plateforme a été retiré dans Godot 4 à cause du peu de maintenance et de son abandon progressif par Microsoft. La plateforme est toujours disponible dans la version stable de Godot 3 pour les utilisateurs intéressés.
ko: Godot 3는 유니버설 윈도우 플랫폼(UWP)도 지원했습니다. 이 플랫폼 포트는 유지 관리 부족으로 인해 Godot 4에서 제거되었으며 Microsoft에서 더 이상 지원하지 않습니다. 관심 있는 사용자를 위해 현재 안정된 Godot 3 릴리스에서 계속 사용할 수 있습니다.
pl: Godot 3 miał także wsparcie dla Universal Windows Platform (UWP). Ten port platformy został usunięty w Godot 4 z powodu braku utrzymywania, i jest porzucone wsparcie przez Microsoft. Platforma jest ciągle dostępna w stabilnej wersji Godot 3 dla zainteresowanych użytkowników.
ru: Godot 3 также имел поддержку Uniwersal Windows Platform (UWP). Эта платформа была удалена в Godot 4 из за слабой поддержки, а также того факта, что Microsoft перевёл UWP в категорию устаревшего ПО. Тем не менее, в Godot 3 версии current stable, она всё ещё доступна для интересующихся пользователей.
uk: Godot 3 також підтримував Universal Windows Platform (UWP). Порт цієї платформи було вилучено у версії Godot 4 через відсутність підтримки, а також через те, що вона була застарілою для Microsoft. Він все ще доступний у поточному стабільному випуску Godot 3 для зацікавлених користувачів.
