Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: For all the reasons above, we have to be selective of what we can accept as core functionality in Godot. This is why we are aiming to move some core functionality to officially supported add-ons in future versions of Godot. In terms of binary size, this also has the advantage of making you pay only for what you actually use in your project. (In the meantime, you can :ref:`compile custom export templates with unused features disabled <doc_optimizing_for_size>` to optimize the distribution size of your project.)
cs: Kvůli všecm výše uvedeným důvodům si musíme vybírat, co můžeme v Godotu přijmout za základní funkce. Proto se snažíme přesunout některé základní funkce pro oficiálně podporované doplňky do příštích verzí Godot. Z hlediska velikosti binárních souborů to má také tu výhodu, že budete platit pouze za to, co ve svém projektu skutečně používáte. (Tím je myšleno :ref:`kompilovat vlastní exportní šablony s vypnutými nepoužívanými funkcemi <doc_optimizing_for_size>` a optimalizovat tak distribuční velikost svého projektu.)
de: Aus all den oben genannten Gründen müssen wir selektiv auswählen, was wir als Kernfunktionalität in Godot akzeptieren können. Aus diesem Grund möchten wir einige Kernfunktionen in zukünftigen Versionen von Godot auf offiziell unterstützte Add-Ons übertragen. In Bezug auf die Dateigröße hat das auch den Vorteil, dass man nur die wirklich benötigten Features mit im finalen Export hat. So kann die Größe des Export minimiert werden. (In der Zwischenzeit ist es auch möglich :ref:`benutzerdefinierte Exportvorlagen mit deaktivierten nicht verwendeten Features zu kompilieren <doc_optimizing_for_size>` , um die Verteilungsgröße Ihres Projekts zu optimieren.)
es: Por todas las razones anteriores, tenemos que ser selectivos con lo que podemos aceptar como funcionalidad central en Godot. Es por eso que nuestro objetivo es mover algunas funciones básicas a extensiones oficialmente soportados en futuras versiones de Godot. En términos de tamaño binario, también tiene la ventaja de hacer que pagues solamente por lo que en realidad usas en tu proyecto. (Por el momento, puedes :ref:`Compilar plantillas de exportación personalizadas con características sin usar desactivadas <doc_optimizing_for_size>` para optimizar el tamaño de distribución de tu proyecto.)
fr: Pour les raisons ci-dessus, nous nous devons d'être sélectifs quant aux fonctionnalités à considérer comme essentielles dans Godot. C'est pourquoi nous avons l'intention de déplacer certaines fonctionnalités essentielles vers des modules complémentaires officiellement pris en charge dans les futures versions de Godot. En termes de taille de binaire, cela a également l'avantage de vous faire payer uniquement pour ce que vous utilisez réellement dans votre projet. (En attendant, vous pouvez :ref:`compiler des modèles personnalisés sans les fonctionnalités inutilisées <doc_optimizing_for_size>` pour optimiser la taille de distribution de votre projet.)
ko: 위와 같은 이유로 어떤 것을 Godot의 핵심 기능으로 넣을지 선택해야만 합니다. 이것이 저희가 일부 핵심 기능을 미래의 Godot 버전에서 공식 지원 add-on으로 만들려는 이유입니다. 바이너리 크기 측면에서 프로젝트에 실제 사용하는 것만을 포함하는 장점이 있습니다. (그동안 프로젝트의 배포 크기를 최적화하기 위해 :ref:`사용하지 않는 기능을 비활성화해서 커스텀 내보내기 템플릿을 컴파일 <doc_optimizing_for_size>`\ 할 수 있습니다.)
ru: Согласно всему вышеперечисленному, мы должны подходить избирательно к тому, что принимать в качестве основных функций в Godot. Вот почему мы стремимся перенести некоторые основные функции в официально поддерживаемые надстройки в будущих версиях Godot. В контексте объема занимаемой памяти это также имеет преимущество, ведь вы платите только за то, что вы действительно используете в своем проекте. (А пока вы можете :ref:`компилировать пользовательские шаблоны экспорта с отключенными неиспользуемыми функциями <doc_optimizing_for_size>`, чтобы оптимизировать размер исходника вашего проекта.)
uk: З наведених вище причин, ми стараємося вибирати те, що можемо прийняти як основну функціональність Godot. Ось чому ми прагнемо перенести деякі основні функції до офіційно підтримуваних доповнень у майбутніх версіях Godot. Що стосується бінарного розміру, то він залежить від того, що ви фактично використовуєте у своєму проєкті. (Ви можете :ref:`скласти власні шаблони експорту з вимкненими невикористаними функціями <doc_optimizing_for_size>`, щоб оптимізувати розмір розповсюдження вашого проєкту.)

source: How should assets be created to handle multiple resolutions and aspect ratios?
cs: Jak by měly být vytvořeny zdroje, aby zvládaly vícenásobná rozlišení a poměry stran?
de: Wie sollten Assets für einen optimalen Umgang mit unterschiedlichen Bildschirmauflösungen und Seitenverhältnissen angelegt werden?
es: ¿Cómo deberían crearse los recursos para manejar múltiples resoluciones y relaciones de aspecto?
fr: Comment créer des ressources pour gérer plusieurs résolutions et rapports d'aspect ?
ko: 다양한 해상도와 화면 비율에 맞는 애셋을 어떻게 만드나요?
pl: Jak tworzyć assety by wspierały różne rozdzielczości i proporcje?
ru: Как создавать ресурсы под множество разрешений и соотношений сторон дисплея?
uk: Як слід створювати активи для обробки різних роздільних здатностей та співвідношення сторін?

source: This question pops up often and it's probably thanks to the misunderstanding created by Apple when they originally doubled the resolution of their devices. It made people think that having the same assets in different resolutions was a good idea, so many continued towards that path. That originally worked to a point and only for Apple devices, but then several Android and Apple devices with different resolutions and aspect ratios were created, with a very wide range of sizes and DPIs.
cs: Tato otázka se objevuje často a je to pravděpodobně díky nedorozumění, když Apple původně zdvojnásobil rozlišení jeho zařízení. To přimělo lidi myslet si, že mít stejné doplňky v různých rozlišeních, je dobrý nápad a tak mnozí touto cestou pokračovali. To původně fungovalo jenom do určité míry a pouze pro zařízení Apple, ale poté bylo vytvořeno několik dalších zařízení Android a Apple s různými rozlišeními a poměry stran s velmi širokou škálou velikostí a DPI.
de: Diese Frage kommt häufig auf und rührt wahrscheinlich von einem durch Apple entstandenen Missverständnisses, als sie damit begannen, eine Verdoppelung der Größe ihrer Bildschirmauflösungen vorzunehmen. Es ließ die Leute in dem Glauben, Assets in verschiedenen Größen bereitzustellen sei eine gute Idee, und so fand diese Praxis immer häufiger Einzug bei Entwicklern. Dies klappte jedoch nur bis zu einem gewissen Grad und ausschließlich für Apple-Geräte, jedoch nicht für Android- und spätere Apple-Produkte, die mit einer deutlich größeren Bandbreite neuer Bildschirmgrößen und DPIs ausgestattet waren.
es: Esta pregunta surge a menudo y es probablemente gracias al malentendido creado por Apple cuando ellos originalmente doblaron la resolución de sus dispositivos. Esto hizo creer a la gente que tener los mismos recursos en diferentes resoluciones era una buena idea, por lo tanto muchos siguieron ese camino. Eso originalmente funcionó hasta un punto y solo para dispositivos Apple, pero después, se crearon muchos dispositivos Android y Apple con diferentes resoluciones y relaciones de aspecto, con una gran variedad de tamaños y DPIs.
fr: Cette question revient souvent et c'est probablement à cause du malentendu créé par Apple lorsqu'ils ont doublé la résolution de leurs appareils. Cela a fait croire aux gens que le fait d'avoir les mêmes ressources dans des résolutions différentes était une bonne idée, et beaucoup ont continué dans cette voie. À l'origine, cela fonctionnait et seulement pour les appareils Apple, mais ensuite plusieurs appareils Android et Apple avec des résolutions et des rapports d'aspect différents ont été créés, avec une très large gamme de tailles et de DPIs.
ko: 이런 고민은 아마도 Apple 사가 언젠가 자사 제품의 해상도를 두 배로 늘렸을 때 생긴 오해 때문일 겁니다. 이 때문에 사람들은 다양한 해상도에서 동일한 애셋을 보여주는 것이 좋은 아이디어라 생각했습니다. 그런데 이런 통념은 짧은 기간 Apple 제품에 한에서는 적용됐지만, 얼마 지나지 않아 다양한 해상도와 화면 비율, DPI의 Android 기기들과 Apple 기기들이 시장에 출시되면서 이제는 불필요해졌습니다.
pl: Pytanie to pojawia się często i prawdopodobnie wynika z niezrozumienia, jakie stworzyło Apple, który pierwotnie podwoiło rozdzielczość swoich urządzeń. Skłoniło to ludzi do myślenia, że posiadanie tych samych zasobów w różnych rozdzielczościach to dobry pomysł i wiele osób podążyło tą drogą. Początkowo w pewnym stopniu to działało na urządzeniach firmy Apple. Jednak później powstały podobne urządzenia z systemem Android oraz Apple o różnych rozdzielczościach i współczynnikach proporcji, z bardzo szeroką gamą rozmiarów i interfejsów DPI.
ru: Этот вопрос возникает часто, и это, вероятно, благодаря недопониманию, созданному Apple, когда они изначально удвоили разрешение своих устройств. Это заставляло людей думать, что иметь одинаковые ассеты в разных разрешениях было хорошей идеей, поэтому многие продолжали идти по этому пути. Это работало до определенного момента и только для устройств Apple, но затем было создано несколько устройств Android и Apple с различными разрешениями и соотношениями сторон с очень широким диапазоном размеров и DPI.
uk: Це питання часто з'являється, ймовірно, це пов'язано з непорозумінням, створеною Apple, коли вони спочатку подвоїли роздільну здатність своїх пристроїв. Це змусило людей вважати, що однакові активи в різних роздільностях були гарною ідеєю, тому багато людей продовжували рухатись до цього шляху. Це спочатку спрацювало лише для пристроїв Apple, але потім було створено кілька пристроїв Android і Apple із різними роздільною здатністю та співвідношенням сторін, з дуже широким діапазоном розмірів та DPI.

source: The most common and proper way to achieve this is to, instead, use a single base resolution for the game and only handle different screen aspect ratios. This is mostly needed for 2D, as in 3D, it's just a matter of camera vertical or horizontal FOV.
cs: Nejběžnějším a nejvhodnějším způsobem jak toho dosáhnout, je použít pro hru jediné základní rozlišení a ošetřit pouze různé poměry stran obrazovky. To je většinou potřeba pro 2D, protože ve 3D je to jen záležitost horizontálního a vertikálního FOV kamery.
de: Der eleganteste Weg, dies zu erreichen, ist eine Basisauflösung für das Spiel zu verwenden und anschließend lediglich mit verschiedenen Bildschirm-Größenverhältnissen umzugehen. Dies wird am meisten für 2D benötigt, denn in 3D ist es im Wesentlichen nur eine Frage der vertikalen und horizontalen FOV-Werte der Kamera .
es: La forma más común y correcta de conseguirlo es, en su lugar, utilizar una única resolución base para el juego y manejar únicamente diferentes relaciones de aspecto de pantalla. Esto es necesario sobre todo para 2D, ya que en 3D es sólo cuestión de ajuste del FOV horizontal o vertical de la cámara.
fr: La façon la plus courante et la plus appropriée d'y parvenir est d'utiliser une unique résolution de base pour le jeu et de ne gérer que les différents aspects d'écran. C'est principalement nécessaire pour la 2D, puisque c'est juste une question de champ de XFov ou YFov en 3D.
ru: Самый распространенный и правильный способ достичь этого - использовать одно базовое разрешение для игры и управлять только различными пропорциями экрана. В основном, это нужно для 2D, так как в 3D это просто вопрос горизонтального или вертикального угла обзора камеры.
uk: Найпоширеніший і найправильніший спосіб досягти цього - використовувати єдину базову роздільну здатність для гри і лише обробляти різні співвідношення сторін екрана. Це здебільшого потрібно для 2D, оскільки в 3D це просто питання вертикального або горизонтального FOV камери.

source: Choose a single base resolution for your game. Even if there are devices that go up to 1440p and devices that go down to 400p, regular hardware scaling in your device will take care of this at little or no performance cost. The most common choices are either near 1080p (1920x1080) or 720p (1280x720). Keep in mind the higher the resolution, the larger your assets, the more memory they will take and the longer the time it will take for loading.
cs: Vyberte si jedno základní rozlišení pro vaši hru. I když existují zařízení, která mají až 1440p a zařízení, která jenom na 400p, o toto se postará pravidelné hardwarové škálování ve vašem zařízení s minimálními nebo žádnými požadavky na výkon. Nejběžnější volby jsou buď 1080p (1920x1080) nebo 720p (1280x720). Mějte na paměti, že čím vyšší rozlišení, tím větší jsou potřebné doplňky a tím více paměti zaberou a déle bude trvat jejich načítání.
de: Wählen Sie eine einfache Basisauflösung für Ihr Spiel. Selbst zwischen Geräten, die über eine Auflösung von 1440p hinausgehen und denen, die nur eine Auflösung von unter 400p unterstützen, erledigt das standardisierte, hardwarebasierte Skalieren in Ihrem Gerät die Arbeit mit minimalen oder ohne Performanceeinbußen. Die gängigsten Auflösungen sind 1080p (1920x1080) oder 720p (1280x720). Beachten Sie jedoch, dass je höher die Auflösung und die Assets sind, desto mehr Arbeitsspeicher wird das Gerät benötigen und desto länger wird es dauern, bis das Spiel fertig geladen ist.
es: Elige una única resolución base para tu juego. Incluso si hay dispositivos que llegan hasta los 1440p y dispositivos que están por los 400p, el escalado regular del hardware del dispositivo se hará cargo de esto con un costo en el rendimiento bajo o nulo . Las elecciones más comunes son cercanas a 1080p (1920x1080) o 720p (1280x720). Ten en cuenta que cuánto mayor es la resolución, mayor será el tamaño de tus recursos, y esto a su vez aumenta el consumo de memoria y el tiempo de carga.
ru: Выберите одно базовое разрешение для своей игры. Даже если есть устройства, которые поднимаются до 1440p и устройства, которые опускаются до 400p, обычное аппаратное масштабирование на вашем устройстве позаботится об этом практически без затрат. Наиболее распространенные варианты - либо около 1080p (1920x1080), либо 720p (1280x720). Имейте в виду, что чем выше разрешение, тем больше ваши ассеты, больше памяти они будут занимать и больше времени им потребуется для загрузки.
uk: Виберіть єдину базову роздільну здатність для вашої гри. Навіть якщо є пристрої з роздільною здатністю до 1440p і пристрої з роздільною здатністю до 400p, звичайне апаратне масштабування у вашому пристрої подбає про це з мінімальними витратами на продуктивність або взагалі без них. Найпоширеніші варіанти - близько 1080p (1920x1080) або 720p (1280x720). Майте на увазі, що чим вища роздільна здатність, тим більші ваші ресурси, тим більше пам'яті вони займають і тим довше завантажуються.

source: Use the stretch options in Godot; canvas items stretching while keeping aspect ratios works best. Check the :ref:`doc_multiple_resolutions` tutorial on how to achieve this.
cs: Použijte různé možnosti roztažení v Godot; 2D roztažení při zachování poměru stran funguje nejlépe. Podívejte se na návod :ref:`doc_multiple_resolutions` , jak toho dosáhnout.
de: Benutzen Sie die Stretch-Optionen in Godot. Am besten funktioniert Canvas-Element-Stretching, wenn das Seitenverhältnis gleich bleibt. Siehe das Tutorial zu :ref:`doc_multiple_resolutions`, um dies zu erreichen.
es: Usa las opciones de estiramiento en Godot; el estiramiento en canvas funciona mejor si mantienes la relación de aspecto. Consulta el tutorial :ref:`doc_multiple_resolutions` para ver sobre cómo conseguir esto.
ru: Используйте параметры растяжения в Godot; растяжение холста при сохранении пропорций работает лучше всего. Посмотрите учебник: :ref:`doc_multiple_resolutions` о том, как этого добиться.
uk: Використовуйте параметри розтягування у Godot; найкраще працює розтягування елементів полотна зі збереженням співвідношення сторін. Про те, як цього досягти, див. підручник :ref:`doc_multiple_resolutions`.

source: Determine a minimum resolution and then decide if you want your game to stretch vertically or horizontally for different aspect ratios, or if there is one aspect ratio and you want black bars to appear instead. This is also explained in :ref:`doc_multiple_resolutions`.
cs: Určete minimální rozlišení a poté se rozhodněte, zda chcete, aby byla vaše hra roztažená svisle nebo vodorovně pro různé poměry stran nebo zda existuje jediný poměr stran a chcete, aby se místo toho zobrazovaly černé pruhy. To je také vysvětleno v :ref:`doc_multiple_resolutions`.
de: Setzen Sie eine minimale Auflösung und entscheiden dann, ob das Spiel bei unterschiedlichen Seitenverhältnissen horizontal oder vertikal gestreckt werden soll, oder ob um eine feste Auflösung herum schwarze Balken gezeichnet werden sollen. Das wird auch in :ref:`doc_multiple_resolutions` erklärt.
es: Determina una resolución mínima y luego decide si quieres que tu juego se extienda vertical u horizontalmente para diferentes relaciones de aspecto, o si hay una relación de aspecto y quieres que aparezcan barras negras en su lugar. Esto también se explica en :ref:`doc_multiple_resolutions`.
fr: Déterminez une résolution minimale et décidez ensuite si vous souhaitez que votre jeu s'étire verticalement ou horizontalement pour différents rapports d'aspect, ou s'il y a une résolution minimale et que vous souhaitez que des barres noires apparaissent à la place. Ceci est également expliqué dans :ref:`doc_multiple_resolutions`.
ko: 최소 해상도를 정한 다음, 게임의 화면을 다른 화면 비율에 맞게 수직이나 수평으로 늘일지 또는 한 화면 비율만 사용하고 남은 공간을 검은 여백으로 처리할지 결정하세요. 이는 :ref:`doc_multiple_resolutions`\ 에서 설명합니다.
pl: Określ minimalną rozdzielczość, a następnie zdecyduj, czy chcesz, żeby gra rozciągała się pionowo czy poziomo dla różnych proporcji, czy używała jednej proporcji i czarnych pasków. Jest to wyjaśnione w :ref:`doc_multiple_resolutions`.
ru: Определите минимальное разрешение, а затем примите решение, хотите ли вы, чтобы ваша игра растягивалась вертикально или горизонтально для разных соотношений сторон или была в одном минимальном разрешении, с отображением черных шкал прогресса по краям. Это также объясняется на предыдущем шаге.
uk: Визначте мінімальну роздільну здатність, а потім вирішіть, чи потрібно вам, щоб ваша гра розтягувалася по вертикалі або по горизонталі для співвідношення сторін, або була в одному мінімальному співвідношенні, з відображенням чорних смуг по краях. Це також пояснюється у попередньому кроці.

source: For user interfaces, use the :ref:`anchoring <doc_size_and_anchors>` to determine where controls should stay and move. If UIs are more complex, consider learning about Containers.
cs: U uživatelských rozhraní použijte :ref:`ukotvení <doc_size_and_anchors>`, k určení, kde by měly ovládací prvky zůstat a kam by se měly případně pohybovat. Pokud jsou uživatelská rozhraní komplexnější, zjistěte si více o kontejnerech.
de: Für Benutzeroberflächen verwenden Sie die :ref:`Verankerung <doc_size_and_anchors>`, um zu bestimmen, wo Steuerelemente bleiben und sich bewegen sollen. Wenn die Benutzeroberflächen komplexer sind, sollten Sie sich mit Containern vertraut machen.
es: Para las interfaces de usuario, utiliza el :ref:`anchoring <doc_size_and_anchors>` para determinar hacia donde se deben quedar y mover los controles. Si las interfaces de usuario son más complejas, considera aprender sobre los Containers.
fr: Pour les interfaces utilisateur, utilisez l':ref:`anchoring <doc_size_and_anchors>` pour déterminer où les contrôles doivent rester et se déplacer. Si l'UI est plus complexe, songez à vous renseigner sur les conteneurs.
ko: 유저 인터페이스에 대해서는 :ref:`앵커 <doc_size_and_anchors>`\ 를 사용해서 Control이 이동하거나 정지해야 할 위치를 결정하세요. UI가 더 복잡하다면 Container 사용을 고려해보세요.
pl: Dla interfejsu użytkownika, użyj :ref:`anchoring <doc_size_and_anchors>` aby określić gdzie powinny się znajdować i jak poruszać elementy sterujące. Jeśli interfejsy użytkownika są bardziej złożone, należy rozważyć zapoznanie się z kontenerami.
ru: Для пользовательских интерфейсов используйте :ref:`закрепление <doc_size_and_anchors>`, чтобы определить, где элементы управления должны оставаться и перемещаться. Если пользовательские интерфейсы являются очень сложными, подумайте о том, как использовать контейнеры.
uk: Для користувацьких інтерфейсів використовуйте :ref:`закріплення <doc_size_and_anchors>`, щоб визначити, де елементи керування повинні залишатися, а де рухатися. Якщо користувацькі інтерфейси (UI) складніші, ознайомтеся з інформацією про контейнери (Containers).

source: And that's it! Your game should work in multiple resolutions.
cs: A to je vše! Vaše hra by měla fungovat ve více rozlišeních.
de: Und das war's! Das Spiel dürfte nun in mehreren Auflösungen funktionieren.
es: Y eso es todo! Tu juego debería funcionar en múltiples resoluciones.
fr: Et c'est tout ! Votre jeu devrait fonctionner en plusieurs résolutions.
ko: 다 됐습니다! 여러분의 게임은 이제 다양한 해상도에서 작동합니다.
pl: I to koniec! Twoja gra powinna działać w wielu rozdzielczościach.
ru: И всё! Ваша игра будет работать в нескольких разрешениях.
uk: І це все! Ваша гра повинна працювати в декількох роздільностях.

source: When is the next release of Godot out?
cs: Kdy vyjde další verze Godot?
de: Wann erscheint die nächste Godot-Version?
es: ¿Cuándo sale la proxima versión de Godot?
fr: Quand sortira la prochaine version de Godot ?
ko: Godot의 다음 릴리스는 언제인가요?
pl: Kiedy zostanie wydana następna wersja Godota?
ru: Когда выйдет следующий релиз Godot?
uk: Коли наступний реліз?

source: When it's ready! See :ref:`doc_release_policy_when_is_next_release_out` for more information.
cs: Až bude připravena! Čtěte :ref:`doc_release_policy_when_is_next_release_out` pro více informací.
de: Wenn sie fertig ist! Siehe :ref:`doc_release_policy_when_is_next_release_out` für weitere Informationen.
es: ¡Cuando esté lista! Vea :ref:`doc_release_policy_when_is_next_release_out` para más información.
fr: Quand elle sera prête ! Voir :ref:`doc_release_policy_when_is_next_release_out` pour plus d'informations.
ko: 준비가 된다면요! 자세한 설명은 :ref:`doc_release_policy_when_is_next_release_out`\ 를 참고하세요.
pl: :ref:`Uruchamianie kodu w edytorze <doc_running_code_in_the_editor>`.
ru: Когда он будет готов! Смотрите :ref:`doc_release_policy_when_is_next_release_out` для дополнительного ознакомления.
uk: Коли він буде готовий! Додаткову інформацію дивіться в :ref:`doc_release_policy_when_is_next_release_out`.

source: Which Godot version should I use for a new project?
cs: Kterou verzi Godot mám použít pro nový projekt?
de: Welche Godot-Version sollte ich für ein neues Projekt verwenden?
es: ¿Qué versión de Godot debería usar para un nuevo proyecto?
fr: Quelle version de Godot devrais-je utiliser pour un nouveau projet ?
pl: Którą wersję Godota powinienem użyć w nowym projekcie?
ru: Какую версию Godot я должен использовать для нового проекта?
uk: Яку версію Godot використовувати для нового проекту?
