Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: Godot aims for cross-platform compatibility and open standards first and foremost. OpenGL and Vulkan are the technologies that are both open and available on (nearly) all platforms. Thanks to this design decision, a project developed with Godot on Windows will run out of the box on Linux, macOS, and more.
cs: Godot staví prvně a především na mezi platformní kompatibilitě a otevřených standardech. OpenGL a Vulkan jsou technologie, které jsou otevřené a dostupné (téměř) na všech platformách. Díky tomuto návrhovému rozhodnutí bude projekt vyvinutý s Godot pro Windows fungovat ihned po rozbalení na Linuxu, macOS a dalších.
de: Godot strebt in erster Linie plattformübergreifende Kompatibilität und offene Standards an. OpenGL und Vulkan sind die Technologien, die sowohl offen als auch (fast) auf allen Plattformen verfügbar sind. Dank dieser Designentscheidung wird ein mit Godot unter Windows entwickeltes Projekt auch unter Linux, MacOS und anderen Systemen sofort einsatzbereit sein.
es: Godot busca compatibilidad entre plataformas y estándares abiertos como primero y principal. OpenGL y Vulkan son las tecnologías, que, en simultáneo, son abiertas y se encuentran disponibles en (casi) todas las plataformas. Gracias a esta decisión de diseño, un proyecto desarrollado con Godot en Windows funcionará inmediatamente en Linux, macOS, y más.
fr: Godot vise avant tout la compatibilité multi-plateformes et les normes ouvertes. OpenGL et Vulkan sont des technologies qui sont à la fois ouvertes et disponibles sur toutes les plates-formes (ou presque). Grâce à cette décision de conception, un projet développé avec Godot sur Windows fonctionnera sans problème sur Linux, macOS, et plus encore.
ko: Godot는 무엇보다도 플랫폼 간 호환성과 개방형 표준을 목표로 합니다. OpenGL과 Vulkan은 개방적이고 (거의) 모든 플랫폼에서 사용할 수 있는 기술입니다. 이 디자인 결정 덕분에 Windows에서 Godot로 개발된 프로젝트는 Linux, macOS 등에서 즉시 실행됩니다.
pl: Godot dąży przede wszystkim do niezależności od platformy oraz do wspierania otwartych standardów. OpenGL i Vulkan są technologiami zarówno otwartymi jak i dostępnymi (niemalże) na wszystkich platformach. Dzięki tej decyzji, projekt rozwijany w Godot na Windowsie będzie działał od ręki na Linuksie, macOS i innych systemach.
ru: Прежде всего, Godot стремится к совместности перекрёстных платформ и открытым стандартам. OpenGl и Vulkan - технологии, открытые и доступные на (почти) всех платформах. Благодаря этому дизайнерскому решению, проект, созданный с Godot на Windows, будет готов к работе на Linux, macOS и др.
uk: Godot прагне до крос-платформної сумісності та відкритих стандартів в першу чергу. OpenGL та Vulkan - це технології, які є відкритими та доступними на (майже) всіх платформах. Завдяки такому дизайнерському рішенню, проект, розроблений за допомогою Godot на Windows, буде працювати з коробки на Linux, macOS тощо.

source: Since Godot only has a few people working on its renderer, we would prefer having fewer rendering backends to maintain. On top of that, using a single API on all platforms allows for greater consistency with fewer platform-specific issues.
cs: Vzhledem k tomu, že Godot má jen málo lidí pracujích na svém rendereru(vykreslovač), upřednostňujeme mít méně vykreslovacích back-endů k údržbě. Kromě toho umožňuje použití jediného API rozhraní na všech platformách k větší soudržnosti s menším počtem problémů specifických pro jednotlivé platformy.
de: Da am Godot-Renderer nur wenige Leute arbeiten, würden wir es bevorzugen, weniger Renderer zu unterstützen. Darüber hinaus bietet eine einzelne, verwendete API auf allen Platformen eine höhere Konsistenz und weniger plattformspezifische Probleme.
es: Dado que Godot solo cuenta con un pequeño grupo de personas trabajando en el renderer, preferiríamos tener la menor cantidad posible de backends de renderizado posible que mantener. Además, usando una única API para todas las plataformas permite una mayor consistencia con menos problemas específicos de plataforma.
fr: Comme Godot n'a que quelques personnes qui travaillent sur son moteur de rendu, nous préférerions avoir moins de backends de rendu à maintenir. De plus, l'utilisation d'une API unique sur toutes les plates-formes permet une plus grande cohérence avec moins de problèmes spécifiques à la plate-forme.
ko: Godot 렌더러를 작업하는 사람이 적기 때문에 저희는 유지 보수할 렌더링 백엔드가 더 적은 것을 선호합니다. 그 외에도 모든 플랫폼에서 단일 API를 사용하면 각 플랫폼별 문제를 줄이고 일관성을 높일 수 있습니다.
pl: Ponieważ nad silnikiem renderującym Godota pracuje tylko kilka osób, zależy nam na jak najmniejszej ilości renderujących backend-ów do utrzymania. Ponadto, używanie pojedynczego API na wszystkich platformach pozwala na większą spójność z mniejszą ilością problemów specyficznych dla jednej platformy.
ru: Поскольку над модулем рендеринга Godot работает всего несколько человек, мы бы предпочли, чтобы у вас было меньше серверных модулей рендеринга. Кроме того, использование единого API на всех платформах позволяет добиться большей согласованности с меньшим количеством проблем, связанных с платформой.
uk: Оскільки над засобом обробки даних Godot працює лише декілька розробників, ми намагаємося мінімізувати кількість супроводжуваних модулів обробки. У надбудовах над модулями обробки використання єдиного програмного інтерфейсу для усіх платформ забезпечує вищу однорідність та зменшує кількість специфічних для платформ проблем.

source: In the long term, we may develop a Direct3D 12 renderer for Godot (mainly for Xbox), but Vulkan and OpenGL will remain the default rendering backends on all platforms, including Windows.
cs: Z dlouhodobého hlediska můžeme vyvinout vykreslovací modul Direct3D 12 pro Godot (hlavně pro účely Xboxu), ale Vulkan a OpenGL zůstanou výchozím vykreslovacím back-endem na všech platformách, včetně Windows.
de: Auf lange Sicht könnten wir einen Direct3D 12-Renderer für Godot entwickeln (vor allem für die Xbox), doch Vulkan und OpenGL werden die Default-Renderer auf allen Plattformen bleiben, auch auf Windows.
es: A largo plazo, podríamos desarrollar un renderizador Direct3D 12 para Godot (principalmente para Xbox), pero Vulkan y OpenGL se mantendrán como los backends de renderizado por defecto en todas las plataformas, incluyendo Windows.
fr: À long terme, nous pourrions développer un moteur de rendu Direct3D 12 pour Godot (principalement pour les besoins de la Xbox), mais Vulkan et OpenGL resteront les systèmes de rendu par défaut sur toutes les plateformes, y compris Windows.
ko: 장기적으로, 우리가 (주로 Xbox용) Direct3D 12 렌더러를 개발할 가능성은 있지만 Vulkan 및 OpenGL은 Windows를 포함한 모든 플랫폼에서 기본 렌더링 백엔드가 될 것입니다.
pl: Na dłuższą metę, prawdopodobnie będziemy pracować nad silnikiem renderującym Direct3D 12 dla Godota (głównie na potrzeby Xbox'a) lecz Vulkan i OpenGL pozostaną domyślnymi renderującymi backend-ami na wszystkich platformach, wliczając Windowsa.
ru: В будущем, возможно, мы разработаем для Godot рендерер Direct3D 12 (в основном для Xbox), однако Vulkan и OpenGL останутся основными графическими отрисовщиками для всех платформ по умолчанию, включая Windows.
uk: У довгостроковій перспективі ми можемо розробити Direct3D 12 рендеринг для Godot (переважно для Xbox), але Vulkan і OpenGL залишаться бекендами рендерингу за замовчуванням на всіх платформах, включно з Windows.

source: Why does Godot aim to keep its core feature set small?
cs: Proč se Godot snaží udržet svou základní sadu funkcí malou?
de: Warum ist die Godot Engine darauf aus, ihren Feature-Umfang klein zu halten?
es: ¿Por qué Godot tiene como objetivo mantener a baja escala sus caracteristicas principales?
fr: Pourquoi Godot s'efforce-t-il de garder peu de fonctionnalités de base ?
ko: 왜 Godot는 주요 기능을 작게 유지하려고 하나요?
pl: Dlaczego Godot dąży do tego ,aby jego podstawowe funkcje były niewielkie?
ru: Почему Godot стремится сохранить свой набор основных функций маленьким?
uk: Чому Godot зберігає невеликий набір основних функцій?

source: Godot intentionally does not include features that can be implemented by add-ons unless they are used very often. One example of something not used often is advanced artificial intelligence functionality.
cs: Godot záměrně neobsahuje funkce, které lze implementovat pomocí doplňků, pokud nejsou používány velmi často. Příkladem něčeho co není užíváno moc často pokročilé funkce umělé inteligence.
de: Godot beinhaltet bewusst keine Features, die als Add-On implementiert werden können, es sei denn, sie werden häufig genutzt. Ein Beispiel für etwas, das nicht oft verwendet wird, sind moderne KI-Funktionen.
es: Godot no incluye intencionadamente características que puedan ser implementadas por complementos, a menos que se utilicen muy a menudo. Un ejemplo de esto sería la funcionalidad de inteligencia artificial avanzada.
fr: Godot n'inclut pas intentionnellement des fonctionnalités qui peuvent être implémentées par des add-ons à moins qu'elles ne soient utilisées très souvent. Un exemple de ceci serait une fonctionnalité d'intelligence artificielle avancée.
ko: Godot는 매우 자주 쓰이지 않는 이상 add-on으로 구현할 수 있는 기능들은 의도적으로 포함하지 않습니다. 고급 인공 지능 같은 것이 그 예입니다.
pl: Godot celowo nie zawiera funkcji, które mogą być zaimplementowane przez addony, chyba że są one bardzo często używane. Jednym z przykładów może być zaawansowana funkcjonalność sztucznej inteligencji.
ru: Godot намеренно не включает функции, которые могут быть реализованы дополнениями, если только они не используются очень часто. Одним из примеров этого может быть расширенная функциональность искусственного интеллекта.
uk: Godot навмисно не включає функції, які можна реалізувати за допомогою доповнень, якщо вони не використовуються дуже часто. Одним із прикладів того, що не використовується часто, є розширені функції штучного інтелекту.

source: There are several reasons for this:
cs: Existuje pro to několik důvodů:
de: Dafür gibt es mehrere Gründe:
es: Hay varias razones para esto:
fr: Il y a plusieurs raisons à cela :
ko: 이렇게 하려는 이유가 몇 가지 있습니다:
pl: Istnieje ku temu kilka powodów:
ru: На это есть несколько причин:
uk: Є кілька причин для цього:

source: **Code maintenance and surface for bugs.** Every time we accept new code in the Godot repository, existing contributors often take the responsibility of maintaining it. Some contributors don't always stick around after getting their code merged, which can make it difficult for us to maintain the code in question. This can lead to poorly maintained features with bugs that are never fixed. On top of that, the "API surface" that needs to be tested and checked for regressions keeps increasing over time.
cs: **Údržba kódu a vyhledávání chyb.** Pokaždé, když do úložiště Godot přijmeme nový kód, stávající přispěvatelé často přebírají odpovědnost za jeho údržbu. Někteří přispěvatelé po začlenění svého kódu nejsou často po ruce po začlenění jejich kódu, což nám může ztížit údržbu daného kódu. To může vést ke špatně udržovaným funkcím s chybami, které nejsou nikdy opraveny. Kromě toho "API rozhraní", které je třeba testovat a kontrolovat, zda nedošlo k regresi, se v průběhu času neustále zvětšuje.
de: **Wartung und Fehlersuche.** Jedes Mal, wenn neuer Code ins Godot Repository aufgenommen wird, übernehmen die bestehenden Entwickler oft die Aufgabe ihn zu warten. Einige Autoren beteiligen sich nicht mehr nach dem Merge der eingebrachten Codestellen, wodurch die Wartung dieser Stelle erschwert wird. Dies kann zu schlecht gepflegten Features mit Fehlern führen, die nie behoben werden. Zusätzlich wächst dadurch die API, welche weiterhin getested und auf Regressionen geprüft werden muss.
es: **Mantenimiento de código y superficie para errores.** Cada vez que aceptamos nuevo código en el repositorio de Godot, los colaboradores existentes a menudo toman la reponsibilidad de mantenerlo. Algunos colaboradores no siempre se quedan después de combinar su código, lo que puede dificultar que mantengamos el código en cuestión. Esto puede conducir a características mal mantenidas con errores que nunca se corrigen. Además de eso, la "superficie de la API" que debe probarse y comprobarse en busca de regresiones sigue aumentando con el tiempo.
fr: **Maintien du code et recherche de bogues.** Chaque fois que nous acceptons du nouveau code dans le dépôt Godot, les contributeurs existants prennent souvent la responsabilité de le maintenir. Certains contributeurs ne restent pas toujours dans les parages après avoir fait fusionner leur code, ce qui peut rendre difficile la maintenance du code en question. Cela peut conduire à des fonctionnalités mal maintenues avec des bogues qui ne sont jamais corrigés. En outre, la "surface de l'API" qui doit être testée et contrôlée pour éviter les régressions ne cesse d'augmenter au fil du temps.
pl: **Utrzymanie kodu oraz wykrywanie błędów.** Przy każdorazowej akceptacji kodu do repozytorium silnika Godot, istniejący kontrybutor bierze na siebie obowiązek jego utrzymania. Niektórzy kontrybutorzy nie zawsze biorą na siebie ten obowiązek, co może prowadzić do problemów z utrzymaniem dodanego kodu. To z kolei może prowadzić do słabo utrzymanych obszarów z błędami które nigdy nie zostają naprawione. Dodatkowo, "powierzchnia API" która musi być testowana i sprawdzana regresji która się zwiększa z czasem.
uk: **Супровід коду та виявлення помилок.** Щоразу, коли ми приймаємо новий код до сховища Godot, існуючі дописувачі часто беруть на себе відповідальність за його супровід. Деякі дописувачі не завжди залишаються у сховищі після злиття коду, що може ускладнити нам підтримку відповідного коду. Це може призвести до поганої підтримки функцій з помилками, які ніколи не будуть виправлені. Крім того, "поверхня API", яку потрібно тестувати і перевіряти на регресії, з часом збільшується.

source: **Ease of contribution.** By keeping the codebase small and tidy, it can remain fast and easy to compile from source. This makes it easier for new contributors to get started with Godot, without requiring them to purchase high-end hardware.
cs: **Snadné přispívání.** Díky tomu, že je kódová základna malá a přehledná, tak zůstává nadále rychle a snadno sestavitelná ze zdrojových kódů. Noví přispěvatelé tak mohou s Godotem snáze začít pracovat, aniž by museli kupovat špičkový hardware.
de: **Einfacheres Mitwirken.** Wenn der Code klein und übersichtlich bleibt, geht es schneller und leichter, den Code zu kompilieren. Das macht es einfacher für neue Entwickler, mit Godot zu starten, ohne High-end Hardware kaufen zu müssen.
es: **Facilidad de contribución.** Al mantener la base de código pequeña y ordenada, puede permanecer rápido y fácil de compilar desde el origen. Esto hace que sea más fácil para los nuevos contribuidores comenzar con Godot, sin necesidad de que compren hardware de gama alta.
fr: **Facilité de contribution.** En gardant la *codebase* petite et ordonnée, elle peut rester rapide et facile à compiler à partir des sources. Il est ainsi plus facile pour les nouveaux contributeurs de se lancer dans Godot, sans qu'ils aient à acheter du matériel haut de gamme.
ko: **기여의 편의성.** 코드 베이스를 작고 깨끗하게 유지해서 전체 소스를 빠르고 쉽게 컴파일할 수 있습니다. 새로운 기여자들이 비싼 하드웨어 없이도 Godot를 쉽게 시작할 수 있습니다.
pl: **Łatwość kontrybucji.** Trzymając bazę kodu małą i czystą, może ona być łatwiejsza i szybsza w kompilacji. To z kolei przedkłada się na łatwość rozpoczęcia pracy w Godot dla nowych kontrybutorów, bez wymogu kupna szybkiego i drogiego sprzętu.
ru: **Легкость вклада.** Сохраняя небольшую и аккуратную кодовую базу, ее можно быстро и легко компилировать из исходного кода. Это облегчает новым участникам начало работы с Godot, не требуя от них покупки высокопроизводительного оборудования.
uk: **Простота внеску.** Зберігання основного коду малим та охайним робить його швидким та простим для розуміння. Це полегшує новим учасникам початок роботу з Godot, не вимагаючи від них надскладних зусиль.

source: **Keeping the binary size small for the editor.** Not everyone has a fast Internet connection. Ensuring that everyone can download the Godot editor, extract it and run it in less than 5 minutes makes Godot more accessible to developers in all countries.
cs: **Udržování malé velikosti binárního souboru pro editor.** Ne každý má rychlé připojení k internetu. Zajištění, aby si každý mohl stáhnout editor Godot, rozbalit jej a spustit za méně než 5 minut, činí Godot přístupnějším pro vývojáře ve všech zemích.
de: **Es hält die Dateigröße des Editors klein.** Nicht jeder besitzt eine schnelle Internetverbindung. Dadurch, dass jeder den Godot-Editor herunterladen, entpacken und in weniger als 5 Minuten ausführen kann, wird Godot für Entwickler in allen Ländern leichter zugänglich.
es: **Mantener pequeño el peso del ejecutable del editor.** No todos tienen una conexión a internet rapida. Asegurando que todos puedan descargar el editor de Godot, extraerlo y ejecutarlo en menos de 5 minutos hace a Godot mas accesible a desarrolladores en todos los países.
fr: **Garder la taille du binaire de l'éditeur à un faible niveau ** Tout le monde ne dispose pas d'une connexion Internet rapide. S'assurer que tout le monde peut télécharger l'éditeur Godot, l'extraire et l'exécuter en moins de 5 minutes rend Godot plus accessible aux développeurs de tous les pays.
ko: **에디터의 바이너리 크기를 작게 유지하기.** 모두의 인터넷 회선이 빠르지는 않습니다. 아무라도 Godot 에디터를 5분 안에 내려받고, 압축을 풀고, 실행할 수 있게 한다면, 전 세계의 개발자들이 더 쉽게 Godot에 접근할 것입니다.
pl: **Utrzymanie małego rozmiaru obiektowego dla edytora.** Nie każdy ma szybkie łącze internetowe. Upewnienie się, aby każdy mógł pobrać edytor Godot, wypakować go i uruchomić w mniej niż 5 minut czyni Godota bardziej dostępnym dla deweloperów we wszystkich krajach.
ru: **Сохранение небольшого размера двоичного файла для редактора.** Не у всех есть быстрое подключение к Интернету. Обеспечение того, чтобы каждый мог загрузить редактор Godot, извлечь его и запустить менее чем за 5 минут, делает Godot более доступным для разработчиков во всех странах.
uk: **Збереження малого розміру редактора.** Не кожен має швидке підключення до Інтернету. Можливість завантажити редактор Godot, розпакувати його та запустити менш ніж за 5 хвилин, робить Godot доступнішим для розробників у всіх країнах.

source: **Keeping the binary size small for export templates.** This directly impacts the size of projects exported with Godot. On mobile and web platforms, keeping file sizes low is important to ensure fast installation and loading on underpowered devices. Again, there are many countries where high-speed Internet is not readily available. To add to this, strict data usage caps are often in effect in those countries.
cs: **Zachování malé velikosti binárních souborů pro exportní šablony.** Toto přímo ovlivňuje velikost projektů exportovaných pomocí Godot. U mobilních a webových platforem je udržení nízké velikosti souborů prvořadé pro zajištění rychlé instalace a načítání na málo výkonných zařízeních. Opět, existuje mnoho zemí, kde není snadno dostupný vysokorychlostní internet. Navíc v těchto zemích často platí přísné limity pro využívání dat.
de: **Es hält die Größe der Dateien für Exportvorlagen klein.** Dies hat direkten Einfluss auf die Größe von Projekten, die mit Godot exportiert werden. Auf mobilen und Web-Plattformen ist eine geringe Dateigröße von großer Bedeutung, um eine schnelle Installation und ein schnelles Laden auf leistungsschwachen Geräten zu ermöglichen. Auch hier gilt, dass es viele Länder gibt, in denen Hochgeschwindigkeits-Internet nicht ohne weiteres verfügbar ist. Hinzu kommt, dass in diesen Ländern oft strenge Datennutzungsobergrenzen gelten.
es: **Mantener el tamaño pequeño de las plantillas de exportación.** Esto impacta directamente al tamaño de los proyectos exportados con Godot. En los dispositivos moviles y plataformas web, mantener el tamaño pequeño de los archivos es primordial para garantizar una rapida instalación y tiempos de carga cortos en dispositivos poco potentes. De nuevo, hay muchos paises en los que no se dispone de internet de alta velocidad. Para añadir a esto, estrictos limites de bajada afectan a estos países.
fr: **Maintenir une petite taille du fichier binaire pour les modèles d'exportation.** Cela a un impact direct sur la taille des projets exportés avec Godot. Sur les plates-formes mobiles et web, il est primordial de maintenir des fichiers de petite taille pour garantir une installation et un chargement rapides sur les appareils peu puissants. Encore une fois, il existe de nombreux pays où l'Internet à haut débit n'est pas facilement disponible. En outre, des plafonds stricts d'utilisation des données sont souvent en vigueur dans ces pays.
uk: **Зменшення розміру двійкових файлів для шаблонів експорту.** Це безпосередньо впливає на розмір проектів, що експортуються за допомогою Godot. На мобільних і веб-платформах, щоб забезпечити швидке встановлення і завантаження на малопотужних пристроях, важливо зберігати малий розмір файлів. Знову ж таки, є багато країн, де високошвидкісний інтернет не завжди доступний. До того ж, у цих країнах часто діють суворі обмеження на використання даних.
