Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: We recommend using Godot 4.x for new projects, but depending on the feature set you need, it may be better to use 3.x instead. See :ref:`doc_release_policy_which_version_should_i_use` for more information.
cs: Doporučujeme pro nové projekty použít Godot 4.x, ale záleží na doplňcích které použijete. Nekdy proto může být lepší využít verzi 3.x. Čtěte :ref:`doc_release_policy_which_version_should_i_use` pro více informací.
de: Wir empfehlen die Nutzung von Godot 4.x für neue Projekte, aber je nach den benötigten Features kann es besser sein, stattdessen Godot 3.x zu verwenden. Siehe :ref:`doc_release_policy_which_version_should_i_use` für weitere Informationen .
es: Recomendamos utilizar Godot 4.x para proyectos nuevos, pero según la característica que necesites, puede ser mejor utilizar 3.x . Revisa :ref:`doc_póliza_de emisión_qué_versión_tiene que_i_uso` para más información.
fr: Nous recommandons l'utilisation de Godot 4.x pour les nouveaux projets, mais en fonction des fonctionnalités dont vous avez besoin, il serait peux-être mieux d'utiliser Godot 3.x . Voir :ref:`doc_release_policy_which_version_should_i_use` pour plus d'informations.
ko: 새 프로젝트에는 Godot 4.x를 사용하는 것이 좋지만, 필요한 기능 세트에 따라 3.x를 사용하는 것이 더 나을 수도 있습니다. 자세한 내용은 :ref:`doc_release_policy_should_i_upgrade_my_project`를 참조하세요.
pl: Rekomendujemy używanie Godot 4.x w przypadku nowych projektów, ale w zależności od zestawu funkcji, których potrzebujesz, czasem lepszym rozwiązaniem może okazać się użycie wersji 3.x. Zobacz :ref:`doc_release_policy_ Which_version_should_i_use`, aby uzyskać więcej informacji.
ru: Мы рекомендуем использовать Godot 4.x для новых проектов, но в зависимости от требуемого набора функций может быть лучше использовать версию 3.x вместо этой. См. раздел :ref:doc_release_policy_which_version_should_i_use для получения дополнительной информации.
uk: Ми рекомендуємо використовувати Godot 4.x для нових проектів, але залежно від набору функцій, який вам потрібен, може бути краще використовувати 3.x. Дивіться :ref:`doc_release_policy_which_version_should_i_use` для отримання додаткової інформації.

source: Should I upgrade my project to use new Godot versions?
cs: Můžu aktualizovat projekt aby využíval novou novější verzi Godot?
de: Sollte ich mein Projekt aktualisieren, um neue Godot-Versionen zu verwenden?
es: ¿Debería actualizar mi proyecto para usar nuevas versiones de Godot?
ko: 새 Godot 버전을 사용하려면 프로젝트를 업그레이드해야 하나요?
pl: Czy powinienem zaktualizować swój projekt, aby korzystać z nowych wersji silnika Godot?
ru: Следует ли мне обновить свой проект до новых версий Godot?
uk: Чи варто мені оновити свій проект, щоб використовувати нові версії Godot?

source: Some new versions are safer to upgrade to than others. In general, whether you should upgrade depends on your project's circumstances. See :ref:`doc_release_policy_should_i_upgrade_my_project` for more information.
cs: Některé nové verze jsou bezpečnější pro provedení upgradu než jiné. Záleží na okolnostech vašeho projektu, zda by jste měli provést upgrade. Čtěte :ref:` doc_release_policy_should_i_upgrade_my_project` pro více informací.
de: Bei einigen neuen Versionen ist ein Upgrade sicherer als bei anderen. Im Allgemeinen hängt es von den Umständen Ihres Projekts ab, ob Sie ein Upgrade durchführen sollten. Siehe :ref:`doc_release_policy_should_i_upgrade_my_project` für weitere Informationen.
es: Algunas versiones nuevas son más seguras para actualizar a que otras. En general, la decision de actualizar depende de las circunstancias de su proyecto. Revisa :ref:`doc_release_policy_should_i_upgrade_my_project` for more information.
ko: 일부 새 버전은 다른 버전보다 업그레이드하는 것이 더 안전합니다. 일반적으로 업그레이드 여부는 프로젝트의 상황에 따라 달라집니다. 자세한 내용은 :ref:`doc_release_policy_should_i_upgrade_my_project`를 참조하세요.
pl: Nie zawsze uaktualnienie wersji jest bezpieczne. Ogólnie, to czy podnosić wersję zależy od specyficznych uwarunkowań Twojego projektu. Sięgnij do :ref:`doc_release_policy_should_i_upgrade_my_project` po więcej informacji.
ru: Некоторые новые версии более безопасны для обновления, чем другие. В целом, решение о том, стоит ли вам обновляться, зависит от обстоятельств вашего проекта. См. раздел :ref:doc_release_policy_should_i_upgrade_my_project для получения дополнительной информации.
uk: Деякі нові версії безпечніші для оновлення, ніж інші. Загалом, рішення про необхідність оновлення залежить від обставин вашого проекту. Докладнішу інформацію можна знайти на сторінці :ref:`doc_release_policy_should_i_upgrade_my_project`.

source: I would like to contribute! How can I get started?
cs: Chtěl bych přispět! Jak mohu začít?
de: Ich würde gerne etwas beitragen! Wie kann ich anfangen?
es: ¡Me gustaría contribuir! ¿Por dónde empiezo?
fr: J'aimerai contribuer ! Où puis-je commencer ?
ko: 저도 기여하고 싶어요! 어떻게 시작해야 하나요?
pl: Chcę się przyczynić do rozwoju Godota! Jak mogę zacząć?
ru: Я хочу внести свой вклад! С чего мне начать?
uk: Я хотів би зробити свій внесок! З чого почати?

source: Awesome! As an open source project, Godot thrives off of the innovation and the ambition of developers like you.
cs: Skvělé! Jako open-source projekt, Godot vzkvétá díky inovacím a ambicím vývojářů, jako jste vy.
de: Super! Als Open Source-Projekt lebt Godot von den Ambitionen und Ideen von Entwicklern wie Ihnen.
es: ¡Fantástico! Como proyecto de código abierto, Godot prospera con la innovación y ambición de desarrolladores como tú.
ru: Потрясающе! Как проект с открытым исходным кодом, Godot процветает благодаря инновациям и амбициям таких разработчиков, как вы.
uk: Чудово! Як проект з відкритим вихідним кодом, Godot процвітає завдяки інноваціям та амбіціям таких розробників, як ви.

source: The best way to start contributing to Godot is by using it and reporting any `issues <https://github.com/godotengine/godot/issues>`_ that you might experience. A good bug report with clear reproduction steps helps your fellow contributors fix bugs quickly and efficiently. You can also report issues you find in the `online documentation <https://github.com/godotengine/godot-docs/issues>`_.
cs: Nejlepším způsobem jak přispět je Godot používat a nahlásit jakékoliv `problémy <https://github.com/godotengine/godot/issues>`_ které zaregistrujete. Kvalitní report o problému se srozumitelným postupem jak chybu zopakovat pomáhá vaším spolupřispěvatelům opravit problém rychle a efektivně. Můžete také nahlásit chybí, kterou naleznete v `online dokumentaci <https://github.com/godotengine/godot-docs/issues>`_.
de: Der beste Weg, einen Beitrag zu Godot zu leisten, besteht darin, Godot zu benutzen und alle Probleme unter `<https://github.com/godotengine/godot/issues>`_ zu melden, die bei Ihnen unter Umständen auftreten. Ein guter Fehlerbericht mit klaren Reproduktionsschritten hilft Ihren Mitstreitern, Fehler schnell und effizient zu beheben. Sie können auch Probleme melden, die Sie in der `Online-Dokumentation <https://github.com/godotengine/godot-docs/issues>`_ finden.
es: La mejor manera de empezar a contribuir a Godot es mediante su uso y reportando cualquier `problema > https://github.com/godotengine/godot/issues ``_ que experimente. Un buen informe de fallos, con pasos claros de reproducción ayuda a los colaboradores a corregir errores de forma rápida y eficiente. También puede informar sobre problemas que encuentre en la `documentación electrónica <https://github.com/godotengine/godot-docs/issues >`_.
ko: Godot에 기여를 시작하는 가장 좋은 방법은 Godot을 사용하면서 발생하는 `문제 <https://github.com/godotengine/godot/issues>`_를 보고하는 것입니다. 명확한 재현 단계가 포함된 좋은 버그 리포트는 기여자들이 버그를 빠르고 효율적으로 수정하는 데 도움이 됩니다. 또한 `온라인 문서 <https://github.com/godotengine/godot-docs/issues>`_에서 발견한 문제를 보고할 수도 있습니다.
pl: Najlepszym sposobem na rozpoczęcie współtworzenia silnika Godot jest korzystanie z niego i zgłaszanie wszelkich `problemów <https://github.com/godotengine/godot/issues>`_, które możesz napotkać. Dobry raport o błędach z jasnymi krokami jak odtworzyć problem, pomaga innym współautorom szybko i skutecznie naprawiać silnik. Możesz także zgłosić problemy znalezione w `dokumentacji online <https://github.com/godotengine/godot-docs/issues>`_.
ru: Лучший способ начать внести вклад в Godot - это использовать его и сообщать об ошибках `<https://github.com/godotengine/godot/issues>`, которые вы можете обнаружить. Хороший отчет об ошибке с четкими шагами воспроизведения помогает вашим коллегам-разработчикам быстро и эффективно устранять ошибки. Вы также можете сообщать о проблемах, которые вы находите в онлайн-документации `<https://github.com/godotengine/godot-docs/issues>`.
uk: Найкращий спосіб почати долучатися до роботи з Godot - це користуватися ним і повідомляти про будь-які `issues <https://github.com/godotengine/godot/issues>`_, з якими ви можете зіткнутися. Гарне повідомлення про ваду з чіткими кроками для її відтворення допоможе вашим колегам швидко та ефективно виправити ваду. Ви також можете повідомити про проблеми, які ви знайшли у `онлайн документації <https://github.com/godotengine/godot-docs/issues>`_.

source: If you feel ready to submit your first PR, pick any issue that resonates with you from one of the links above and try your hand at fixing it. You will need to learn how to compile the engine from sources, or how to build the documentation. You also need to get familiar with Git, a version control system that Godot developers use.
cs: Pokud jste připraveni předložit první příspěvek, vyberte si problém který vás trápí v jednom z výše uvedených odkazů a zkuste ho vyřešit. Budete se muset naučit jak sestavit engine ze zdrojů nebo jak vytvořit dokumentaci. Také by jste měli být obeznámeni s Git, verzovacim nástrojem který vývojáři Godot používají.
de: Wenn Sie sich bereit fühlen, Ihren ersten PR einzureichen, suchen Sie sich eine Issue, die Sie anspricht, unter einem der oben genannten Links aus und versuchen Sie, sie zu beheben. Sie werden lernen müssen, wie man die Engine aus dem Quellcode kompiliert oder wie man die Dokumentation erstellt. Sie müssen sich auch mit Git vertraut machen, einem Versionskontrollsystem, das Godot-Entwickler verwenden.
es: Si se siente listo para enviar su primer PR, elija cualquier problema que resuene con usted de uno de los enlaces arriba y intente arreglarlo. Tendrá que aprender cómo compilar el motor desde su codigo fuente, o cómo construir la documentación. También necesita familiarizarse con Git, un sistema de control de versiones que usan los desarrolladores Godot.
fr: Si vous vous sentez prêt à soumettre votre première pull request (PR), choisissez n'importe quel problème qui vous intéresse parmi les liens ci-dessus et essayez de le résoudre. Vous devrez apprendre comment compiler le moteur à partir des sources ou comment construire la documentation. Vous devrez également vous familiariser avec Git, un système de gestion de version utilisé par les développeurs de Godot.
pl: Jeśli czujesz się gotowy, aby zacząć wysyłać żądanie zatwierdzenia zmian do projektu (z ang. PR, skrót od Pull Request), wybierz dowolny problem, który Cię dotyczy, z jednego z powyższych linków i spróbuj go naprawić. Będziesz musiał nauczyć się, jak skompilować silnik ze źródeł lub jak zbudować dokumentację. Musisz także zapoznać się z Git, czyli systemem kontroli wersji, z którego korzystają programiści Godot.
ru: Если вы готовы представить свой первый запрос на включение (PR), выберите любую проблему, которая вас заинтересовала, из одной из приведенных выше ссылок и попробуйте решить ее. Вам потребуется научиться компилировать движок из исходных кодов или создавать документацию. Также вам нужно ознакомиться с Git, системой управления версиями, которую используют разработчики Godot.
uk: Якщо ви відчуваєте, що готові подати свій перший PR, виберіть будь-яку проблему, яка резонує з вами, з одного з посилань вище і спробуйте виправити її. Вам потрібно буде навчитися компілювати рушій з вихідних кодів або створювати документацію. Вам також потрібно ознайомитися з Git'ом, системою контролю версій, яку використовують розробники Godot.

source: We explain how to work with the engine source, how to edit the documentation, and what other ways to contribute are there in our :ref:`documentation for contributors <doc_ways_to_contribute>`.
cs: Jak pracovat s enginem, jak upravovat dokumentaci a také jaké další možnosti přispívat máte vysvětlujeme v :ref:`dokumentaci pro přispěvatele <doc_ways_to_contributr>`.
de: Wir erklären in unserer :ref:`Dokumentation für Mitwirkende <doc_ways_to_contribute>`, wie man mit dem Quellcode der Engine arbeitet, wie man die Dokumentation bearbeitet und welche anderen Möglichkeiten es gibt, einen Beitrag zu leisten.
es: Explicamos cómo trabajar con el Core del motor, cómo editar la documentación, y otras alternativas para contribuir puede encontrarlas en :ref:`documentation for contributors <doc_ways_to_contribute>`.
fr: Nous expliquons comment travailler avec la source du moteur, comment éditer la documentation, et quelles autres façons de contribuer sont disponibles dans notre :ref:`documentation pour les contributeurs <doc_ways_to_contribute>`.
ko: 엔진 소스 작업 방법, 문서 편집 방법 및 기여 방법에 대한 설명은 :ref:`기여자를 위한 문서 <doc_ways_to_contribute>`에 수록되어 있습니다.
pl: Wyjaśniamy, jak pracować ze źródłem silnika, jak edytować dokumentację i jakie są inne sposoby wnoszenia swojego wkładu, wszystko to znajdziesz w naszej :ref:`dokumentacji dla autorów <doc_ways_to_contribute>`.
ru: Мы объясняем, как работать с исходным кодом движка, как редактировать документацию и какие еще способы внести вклад есть в нашем :ref: `руководстве для участников <doc_ways_to_contribute>`.
uk: Ми пояснюємо, як працювати з вихідним кодом рушія, як редагувати документацію та які інші способи внести свій вклад існують у нашій :ref:`документації для дописувачів <doc_ways_to_contribute>`.

source: I have a great idea for Godot. How can I share it?
cs: Mám skvělý nápad pro Godot. Jak se o něj mohu podělit?
de: Ich habe eine tolle Idee für Godot. Wie kann ich sie teilen?
es: Tengo una idea genial para Godot. ¿Cómo puedo compartirla?
fr: J'ai une super idée pour Godot. Comment puis-je la partager ?
ko: Godot에 대한 좋은 아이디어가 있습니다. 어떻게 이것을 공유할 수 있나요?
pl: Mam świetny pomysł dla Godot'a. Jak mogę się nim podzielić?
ru: У меня есть отличная идея для Godot. Как я могу поделиться ей?
uk: У мене є чудова ідея для Godot. Як я можу поділитися нею?

source: We are always looking for suggestions about how to improve the engine. User feedback is the main driving force behind our decision-making process, and limitations that you might face while working on your project are a great data point for us when considering engine enhancements.
cs: Stále hledáme nové nápady jak engine vylepšit. Zpětná vazba je hlavní hybnou silou našich rozhodnutí a omezení kterým můžete čelit při práci na vašem projektu jsou skvělé ukazatelem nás, když se rozhodujeme o vylepšeních enginu.
de: Wir sind immer auf der Suche nach Vorschlägen, wie wir die Engine verbessern können. Das Feedback der Nutzer ist die treibende Kraft hinter unserem Entscheidungsprozess, und Einschränkungen, auf die Sie bei der Arbeit an Ihrem Projekt stoßen könnten, sind ein großartiger Datenpunkt für uns, wenn wir über Verbesserungen der Engine nachdenken.
es: Siempre estamos buscando sugerencias sobre cómo mejorar el motor. Los comentarios de los usuarios son la principal fuerza impulsora detrás de nuestro proceso de toma de decisiones, y las limitaciones que puede enfrentar mientras trabaja en su proyecto son un gran punto de datos para nosotros al considerar las mejoras del motor.
fr: Nous sommes toujours à la recherche de suggestions pour améliorer le moteur. Les retours des utilisateurs sont la principale force motrice derrière notre processus décisionnel, et les limitations que vous pourriez rencontrer en travaillant sur votre projet sont des données précieuses pour nous lorsque nous envisageons des améliorations du moteur.
pl: Zawsze czekamy na sugestie, jak ulepszyć silnik. Opinie użytkowników są główną siłą napędową naszego procesu decyzyjnego, a ograniczenia, które możesz napotkać podczas pracy nad projektem, są dla nas doskonałym punktem odniesienia przy rozważaniu ulepszeń silnika.
ru: Мы всегда открыты к предложениям о том, как улучшить движок. Обратная связь пользователей является основной движущей силой нашего процесса принятия решений, и ограничения, с которыми вы можете столкнуться при работе над своим проектом, являются важным источником данных для нас при рассмотрении улучшений движка.
uk: Ми завжди відкриті для пропозицій щодо покращення рушія. Відгуки користувачів є основною рушійною силою нашого процесу прийняття рішень, а обмеження, з якими ви можете зіткнутися під час роботи над своїм проектом, є для нас чудовим джерелом даних, коли ми розглядаємо можливість удосконалення рушія.

source: If you experience a usability problem or are missing a feature in the current version of Godot, start by discussing it with our `community <https://godotengine.org/community/>`_. There may be other, perhaps better, ways to achieve the desired result that community members could suggest. And you can learn if other users experience the same issue, and figure out a good solution together.
cs: Pokud zaznamenáte potíže s užíváním enginu nebo vám schází funkce v současné verzi Godot, zkuste to prodiskutovat s naší `komunitou <https://godotengine.org/community/>`_. Můžete zde nalézt jiný, možná i lepší postup navrhnutý členy komunity, který povede k dosažení požadovaného výsledku. A můžete se dozvědět, zda jiní uživatele mají stejný problém a najít pak řešení společně.
de: Wenn Sie ein Problem mit der Benutzerfreundlichkeit haben oder ein Feature in der aktuellen Version von Godot vermissen, diskutieren Sie es zunächst mit unserer Community `<https://godotengine.org/community/>`_. Vielleicht gibt es andere, bessere Möglichkeiten, das gewünschte Ergebnis zu erreichen, die Mitglieder der Community vorschlagen könnten. Und Sie können erfahren, ob andere Benutzer das gleiche Problem haben, und gemeinsam eine gute Lösung finden.
es: Si detecta algún problema de usabilidad o algún componente de Godot faltante en la versión actual, empiece por discutirlo en nuestra comunidad `community <https://godotengine.org/community/>`_. Pueden haber otras, incluso mejores, maneras de obtener soluciones propuestas por los miembros de la comunidad. También puede encontrar si otros usuarios han experimentado el mismo problema, e intentar encontrar una solución juntos.
fr: Si vous rencontrez un problème d'utilisation ou si vous avez besoin d'une fonctionnalité manquante dans la version actuelle de Godot, commencez par en discuter avec notre communauté `community <https://godotengine.org/community/>`_. Il se peut qu'il existe d'autres moyens, peut-être meilleurs, pour obtenir le résultat souhaité, que les membres de la communauté pourraient suggérer. Vous pouvez également découvrir si d'autres utilisateurs rencontrent le même problème et trouver ensemble une bonne solution.
pl: Jeśli masz problemy z używaniem Godot lub brakuje Ci jakiejś funkcji w aktualnej wersji, zacznij od omówienia tego z naszą `społecznością <https://godotengine.org/community/>`_. Mogą istnieć alternatywne, być może lepsze, sposoby osiągnięcia pożądanego rezultatu, które mogą zasugerować członkowie społeczności. Możesz także dowiedzieć się, czy inni użytkownicy doświadczają tego samego problemu i wspólnie z nimi znaleźć dobre rozwiązanie.
ru: Если вы испытываете сложности с использованием или не можете найти какую-то функцию в текущей версии Godot, то начните обсуждение в нашем `Сообществе<https://godotengine.org/community/>`. Там вы можете найти другие, возможно лучшие, пути достижения желаемого результата, который наши участники сообщества могут предложить. В добавок вы можете узнать, испытывают ли другие пользователи похожие сложности и найти подходящее решение вместе.
uk: Якщо у вас виникли складнощі з використанням, або ви не можете знайти якусь функцію в поточній версії Godot, спробуйте обговорити це з нашою `спільнотою <https://godotengine.org/community/>`_. Там ви можете знайти й інші, можливо навіть кращі, варіанти вирішення свого питання. Окрім того ви зможете дізнатися, чи виникають подібні складнощі в іншим користувачів, і разом знайти оптимальне рішення.

source: If you come up with a well-defined idea for the engine, feel free to open a `proposal issue <https://github.com/godotengine/godot-proposals/issues>`_. Try to be specific and concrete while describing your problem and your proposed solution — only actionable proposals can be considered. It is not required, but if you want to implement it yourself, that's always appreciated!
cs: Pokud budete mit dobře nadefinovaný nápad pro engine, podělte se o něj s námi otevřením `návrhu řešení <https://github.com/godotengine/godot-proposals/issues>`_. Budte detailní a podrobně popište váš problém a vámi navrhované řešení - jen realizovatelné návrhy mohou být posuzovány. Není to podmínka, ale pokud bude chtít nápad implementovat sami, budeme velmi rádi!
de: Wenn Sie eine gut definierte Idee für die Engine haben, können Sie einen `Vorschlag <https://github.com/godotengine/godot-proposals/issues>`_ einreichen. Versuchen Sie, Ihr Problem und Ihren Lösungsvorschlag spezifisch und konkret zu beschreiben - nur umsetzbare Vorschläge können berücksichtigt werden. Sie müssen nicht, aber wenn Sie es selbst umsetzen wollen, ist dies immer willkommen!
es: Si tienes una idea bien definida para el motor, siéntete libre de abrir una `issue de propuesta <https://github.com/godotengine/godot-proposals/issues>`_. Intenta ser especifico y concreto al describir tu problema y tu solución propuesta — solo las propuestas factibles serán consideradas. No es requerido pero si quieres implementarlas tu mismo, ¡siempre se aprecia!
fr: Si vous avez un idée d'amélioration bien définie pour le moteur de jeu, vous pouvez ouvrir un `ticket pour la proposer <https://github.com/godotengine/godot-proposals/issues>`_. Essayez d'être précis et concret lorsque vous décrivez votre problème et votre solution — seules les modifications réalisables seront prises en considération. Ce n'est pas obligatoire, mais si vous voulez l'implémenter vous-même, cela sera toujours apprécié !
pl: Jeśli masz dobrze zdefiniowany, dokładnie określony pomysł na rozwój silnika, nie wahaj się otworzyć `proponowanego usprawnienia <https://github.com/godotengine/godot-proposals/issues>`_. Staraj się być dokładny i konkretny opisując swój problem oraz proponowane rozwiązanie — można brać pod uwagę tylko to, co da się zrobić. Jeśli chcesz to napisać i wdrożyć do silnika samodzielnie, zawsze jest to mile widziane (ale nie jest to wymagane)!
ru: Если у вас есть четкая идея для улучшения движка, не стесняйтесь создать `запрос на предложение <https://github.com/godotengine/godot-proposals/issues>`_. Постарайтесь быть конкретными и четкими, описывая свою проблему и предлагаемое решение — рассматриваются только конкретные предложения. Это не является обязательным, но если у вас есть желание реализовать это самостоятельно, это всегда приветствуется!
uk: Якщо ж у вас виникла чітка ідея для покращення рушія, то не соромтеся створити `пропозицію <https://github.com/godotengine/godot-proposals/issues>`_. Старайтеся чітко і зрозуміло викласти свою проблему і варіанти її рішення — розглядаються лише дієві пропозиції. Це не обов'язково, але ми цінуємо бажання користувачів самостійно реалізовувати свої ідеї!
