Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: The original intent of creating a tightly integrated, custom scripting language for Godot was two-fold: first, it reduces the amount of time necessary to get up and running with Godot, giving developers a rapid way of exposing themselves to the engine with a focus on productivity; second, it reduces the overall burden of maintenance, attenuates the dimensionality of issues, and allows the developers of the engine to focus on squashing bugs and improving features related to the engine core, rather than spending a lot of time trying to get a small set of incremental features working across a large set of languages.
cs: Původní záměr vytvořit těsně integrovaný, vlastní skriptovací jazyk pro Godot byl dvojí: zaprvé, snižit množství času potřebného k poznání a ovládnutí Godotu, což potenciálním vývojářům poskytuje rychlý způsob, jak se seznámit s enginem a používat ho produktivně; za druhé, redukovat celkové břemeno údržby, zmenšit složitost problémů a umožnit vývojářům enginu soustředit se na odstraňování chyb a vylepšování funkcí souvisejících s jádrem enginu, spíše než utápět spoustu času prací na malých přírůstkových funkcích pro velké množství jazyků.
de: Es gab ursprünglich zwei Gründe, eine eng integrierte, benutzerdefinierte Skriptsprache für Godot zu entwickeln: Erstens erlaubt sie, sich schneller mit Godot vertraut zu machen, und gibt damit Entwicklern die Gelegenheit, schnell produktiv zu werden; Zweitens verringert sie die allgemeine Wartungslast, reduziert die Dimensionalität von Problemen und ermöglicht es den Entwicklern der Engine, sich auf Fehlerbehebung und Verbesserung von Engine-Kernfeatures zu konzentrieren, anstatt viel Zeit damit zu verbringen, kleinere inkrementelle Features über eine Vielzahl von Sprachen hinweg zum Laufen zu bringen.
es: La intención original de crear un lenguaje de scripts estrechamente integrado para Godot tenía dos propósitos: primero, reduce la cantidad de tiempo necesaria para prepararse y arrancar con Godot, dando a los desarrolladores una manera rápida de exponerse al motor con un enfoque en la productividad; segundo, reduce la carga de mantenimiento en general, atenúa la dimensión de los problemas y permite a los desarrolladores enfocarse en deshacerse de bugs y mejorar características relacionadas al núcleo del motor, en vez se pasar un montón de tiempo tratando de hacer funcionar un pequeño conjunto de características incrementales a través de diferentes lenguajes.
fr: L'idée directrice ayant conduit à la mise en place d'un langage de script étroitement intégré et sur mesure dans Godot découle de deux éléments : d'une part, réduire le temps nécessaire pour la prise en main de Godot, avec une attention particulière accordée à la productivité, d'autre part faciliter la maintenance, diminuer la dimension des problèmes, et permettre aux développeurs du moteur de jeu de se concentrer sur la résolution de bugs et l'amélioration de fonctionnalités au lieu de devoir passer beaucoup de temps à créer un nombre restreint de fonctionnalités dans de nombreux langages de programmation.
pl: Pierwotny zamiar stworzenia ściśle zintegrowanego, niestandardowego języka skryptowego dla Godota był dwojaki: po pierwsze, skraca czas potrzebny na rozpoczęcie pracy z Godotem, dając programistom szybki sposób na poznanie silnika z naciskiem na produktywność; po drugie, zmniejsza ogólne obciążenie związane z konserwacją, zmniejsza wymiarowość problemów i pozwala programistom silnika skupić się na usuwaniu błędów i ulepszaniu funkcji związanych z rdzeniem silnika, zamiast spędzać dużo czasu na próbach uzyskania małego zestawu przyrostowych funkcji działających w dużym zestawie języków.
ru: Изначальное намерение создать тесно интегрированный, собственный скриптовый язык для Godot преследовало две цели: во-первых, он сокращает время, необходимое для начала работы с Godot, предоставляя разработчикам быстрый способ ознакомления с движком с упором на производительность; во-вторых - снижает общую сложность обслуживания, уменьшает объем проблем и позволяет разработчикам движка сосредоточиться на устранении ошибок и улучшении функций, связанных с ядром движка, вместо того, чтобы тратить много времени на попытки заставить небольшой набор дополнительных функций работать на большом количестве языков.
uk: Початковий намір створення тісно інтегрованої, користувацької мови сценаріїв для Godot був подвійним: по-перше, це скорочує час, необхідний для початку роботи з Godot, надаючи розробникам швидкий спосіб ознайомитися з рушієм, зосередившись на продуктивності; по-друге, це зменшує загальний тягар супроводу, зменшує розмірність проблем і дозволяє розробникам рушія зосередитися на виправленні помилок і покращенні функцій, пов'язаних з ядром рушія, замість того, щоб витрачати багато часу на спроби змусити невеликий набір додаткових функцій працювати на великому наборі мов.

source: Since Godot is an open source project, it was imperative from the start to prioritize a more integrated and seamless experience over attracting additional users by supporting more familiar programming languages, especially when supporting those more familiar languages would result in a worse experience. We understand if you would rather use another language in Godot (see the list of supported options above). That being said, if you haven't given GDScript a try, try it for **three days**. Just like Godot, once you see how powerful it is and rapid your development becomes, we think GDScript will grow on you.
cs: Jelikož Godot je projekt s otevřeným zdrojovým kódem, bylo od počátku nezbytné upřednostňovat integrovanější a bezproblémovou zkušenost před získáváním dalších uživatelů podporou známějších programovacích jazyků - zejména pokud by podpora těchto známých jazyků vedla k horším zkušenostem. Chápeme, že byste v Godotu raději používali jiný jazyk (viz výše uvedený seznam podporovaných možností). Jak již bylo řečeno, pokud jste nezkoušeli GDScript, zkuste to na **tři dny**. Stejně jako Godot, jakmile uvidíte, jak silný je a jak rychle se váš vývoj postupuje, myslíme si, že GDScript si vás získá.
de: Da es sich bei Godot um ein Open-Source-Projekt handelt, war es von Anfang an unumgänglich, einem stärker integrierten und nahtlosen Erlebnis den Vorrang vor der Gewinnung zusätzlicher Nutzer durch die Unterstützung vertrauterer Programmiersprachen zu geben, insbesondere wenn die Unterstützung dieser vertrauten Sprachen zu einem schlechteren Erlebnis führen würde. Wir verstehen, wenn Sie lieber eine andere Sprache in Godot verwenden möchten (siehe die Liste der unterstützten Optionen oben). Wenn Sie GDScript jedoch noch nicht ausprobiert haben, sollten Sie es **drei Tage** lang testen. Sobald Sie sehen, wie leistungsfähig es ist und wie sehr es Ihre Entwicklung beschleunigt, glauben wir, dass GDScript Ihnen genau wie Godot ans Herz wachsen wird.
es: Dado que Godot es un proyecto de código abierto, era imperativo desde el principio priorizar una experiencia más integrada y sin fisuras por encima de la atracción de usuarios adicionales mediante el soporte de lenguajes de programación más familiares, especialmente cuando el soporte de esos lenguajes más familiares resultaría en una experiencia peor. Entendemos si prefieres usar otro lenguaje en Godot (ver lista de opciones soportadas arriba). Dicho esto, si no has probado GDScript, inténtalo durante **tres días**. Al igual que Godot, una vez que veas lo poderoso que es y lo rápido que se vuelve tu desarrollo, creemos que GDScript te gustará.
fr: Godot étant un logiciel libre, il était impératif de prioriser dès le départ une expérience de développement plus intégrée et unie plutôt que d'attirer plus d'utilisateurs en ajoutant le support de langages de programmation plus familiers -- tout particulièrement quand le support de ces langages aurait résulté en une expérience plutôt mauvaise. Nous comprendrons si vous préférez utiliser un autre langage dans Godot (voir les options supportées ci-dessus), mais nous vous suggérons de l'essayer vous-même pour en constater les avantages. Ceci dit, si vous n'avez pas encore essayé GDScript, essayez-le pendant au moins trois jours. Tout comme Godot, une fois que vous aurez vu à quel point votre développement devient puissant et rapide, nous pensons que GDScript vous plaira de plus en plus.
pl: Ponieważ Godot jest projektem o otwartym kodzie źródłowym, od samego początku konieczne było nadanie priorytetu bardziej zintegrowanemu i bezproblemowemu doświadczeniu, aniżeli próbie przyciągnięcia dodatkowych użytkowników dzięki obsłudze bardziej znanych języków programowania – zwłaszcza, gdy obsługa tych języków może pogorszyć doświadczenia użytkownika. Rozumiemy, jeśli wolisz używać innego języka w Godot (zobacz listę obsługiwanych opcji powyżej). Biorąc to pod uwagę, jeśli nie dałeś jeszcze szansy GDScript, wypróbuj go przez **trzy dni**. Podobnie jak w przypadku silnika Godot, gdy tylko dostrzeżesz jak jest potężny, oraz jak GDScript przyspiesza Twoją pracę, z pewnością się przyzwyczaisz.
uk: Оскільки Godot є проектом з відкритим вихідним кодом, з самого початку було важливо надати пріоритет більш інтегрованому та безперебійному використанню, а не залученню додаткових користувачів за рахунок підтримки більш звичних мов програмування, особливо коли підтримка цих більш звичних мов призведе до погіршення якості роботи. Ми зрозуміємо, якщо ви віддасте перевагу використанню іншої мови в Godot (див. список підтримуваних мов вище). Тим не менш, якщо ви ще не спробували GDScript, спробуйте його протягом **трьох днів**. Як і у випадку з Godot, коли ви побачите, наскільки потужною є ця мова і наскільки швидким стає ваш розвиток, ми вважаємо, що GDScript буде рости разом з вами.

source: More information about getting comfortable with GDScript or dynamically typed languages can be found in the :ref:`doc_gdscript_more_efficiently` tutorial.
cs: Více informací jak pohodlně používat GDScript nebo dynamicky typované jazyky najdete v tutoriálu :ref:`doc_gdscript_more_efficiently`.
de: Weitere Informationen, um sich mit GDScript bzw. dynamisch typisierten Sprachen vertraut zu machen, finden Sie im Tutorial :ref:`doc_gdscript_more_efficiently`.
es: Puedes encontrar más información sobre GDScript, y los lenguajes de tipo dinámico en general, en el tutorial :ref:`doc_gdscript_more_efficiently`.
fr: Vous trouverez plus d'informations sur la façon de se familiariser avec GDScript ou les langages à typage dynamique dans le tutoriel :ref:`doc_gdscript_more_efficiently`.
ko: GDScript 또는 동적 타입 언어에 익숙해지려면 :ref:`doc_gdscript_more_efficiently` 튜토리얼을 참고하세요.
pl: Więcej informacji na temat komfortowego posługiwania się GDScriptem lub dynamicznie pisanymi językami można znaleźć w samouczku :ref:`doc_gdscript_more_efficiently`.
ru: Более подробная информация, о том, как комфортабельно использовать GDScript или динамически типизированные языки может быть найдена в руководстве :ref:`doc_gdscript_more_efficiently`.
uk: Більш детальну інформацію про те, як зручніше працювати з GDScript або динамічно типізованими мовами, можна знайти в посібнику :ref:`doc_gdscript_more_efficiently`.

source: What were the motivations behind creating GDScript?
cs: Jaká byla motivace pro vytvořeníí GDScript?
de: Was war die Motivation, GDScript zu entwickeln?
es: ¿Cuáles son las motivaciones detrás de la creación de GDScript?
fr: Qu'est-ce qui a motivé la création de GDScript ?
ko: GDScript를 만들게 된 동기가 무엇인가요?
pl: Jakie były motywy tworzenia GDScript?
ru: Каковы были мотивы создания GDScript?
uk: Що мотивувало за створення GDScript?

source: In the early days, the engine used the `Lua <https://www.lua.org>`__ scripting language. Lua can be fast thanks to LuaJIT, but creating bindings to an object-oriented system (by using fallbacks) was complex and slow and took an enormous amount of code. After some experiments with `Python <https://www.python.org>`__, that also proved difficult to embed.
cs: V začátcích používal engin skriptovací jazyk `Lua <https://www.lua.org>`_ . Lua umí být ychlý, díky LuaJIT, ale vytváření vazeb na objektově orientovaný systém (pomocí fallbacks) bylo složité a pomalé a vyžadovalo enormní množství kódu. Po několika experimentech s `Pythonem <https://www.python.org>`_ se i toto řešení ukázalo jako problematické.
de: Anfänglich nutzte die Engine noch `Lua <https://www.lua.org>`__ als Skriptsprache. Lua ist schnell dank LuaJIT, aber die Sprachanbindung an ein objektorientiertes System zu erstellen (durch Verwendung von Fallbacks) war komplex, langsam und verlangte nach enorm viel Code. Nach einigen Experimenten mit `Python <https://www.python.org>`__ stellte sich auch diese Sprache als schwierig einzubetten heraus.
es: En los primeros días, el motor utilizaba el lenguaje de scripting `Lua <https://www.lua.org>` __. Lua puede ser rápido debido a LuaJIT, pero crear enlaces a un sistema orientado a objetos (mediante el uso de retrocesos) fue complejo y lento y requirió una enorme cantidad de código. Después de algunos experimentos con `Python <https://www.python.org>` __, también resultó difícil de insertar.
fr: Au début, le moteur de jeu utilisait le langage de scripts `Lua <http://www.lua.org>`__ . Lua peut être rapide grâce à LuaJIT, mais créer des bindings (liaisons) vers un système orienté objet (en utilisant des fallbacks) était complexe, lent et demandait une énorme quantité de code. Après quelques expérimentations avec `Python <http://www.python.org>`__, il s’avéra lui aussi difficile a intégrer.
ko: 처음에는 `Lua <https://www.lua.org>`__ 스크립팅 언어를 사용했습니다. Lua는 빠르지만 (Fallback을 사용해서) 객체 지향 시스템에 바인딩을 생성하는 일은 복잡하고 느리면서도 엄청난 양의 코드가 필요했습니다. `Python <https://www.python.org>`__\ 으로도 몇 번 실험해봤지만 엔진에 내장하기 어려웠습니다.
pl: W początkowym okresie silnik używał języka skryptowego `Lua <http://www.lua.org>`__. Lua jest szybka, ale tworzenie wiązań do obiektowo zorientowanego systemu było skomplikowane i powolne oraz zajmowało olbrzymią ilość kodu. Po kilku eksperymentach z `Pythonem <https://www.python.org>`__, język ten również się okazał trudny do poprawnej implementacji.
uk: На початку свого існування рушій використовував скриптову мову `Lua <https://www.lua.org>`__. Lua може бути швидкою завдяки LuaJIT, але створення прив'язок до об'єктно-орієнтованої системи (за допомогою запасних варіантів) було складним і повільним і займало величезну кількість коду. Після деяких експериментів з `Python <https://www.python.org>`__, це також виявилося складним для вбудовування.

source: The main reasons for creating a custom scripting language for Godot were:
cs: Hlavní důvody pro vytvoření vlastního skriptovacího jazyka pro Godot byly:
de: Die Hauptgründe, eine eigene Skriptsprache für Godot zu entwickeln, waren:
es: Las razones principales para crear un lenguaje de scripts personalizado para Godot fueron:
fr: Les principales raisons de la création d'un langage de script personnalisé pour Godot étaient :
ko: Godot 전용 스크립트 언어를 개발하게 된 주요 이유는 이러합니다:
pl: Głównymi powodami tworzenia niestandardowego języka skryptowego dla Godota były:
ru: Основными причинами создания своего собственного скриптового языка для Godot были:
uk: Основними причинами створення власної скриптової мови для Godot були:

source: Poor threading support in most script VMs, and Godot uses threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
cs: Špatná podpora vláken ve většiny VM skriptů a Godot používá vlákna(Lua, Python, Squirrel, JavaScript, ActionScript atd.).
de: Schlechte Threading-Unterstützung in den meisten Skript-VMs, und Godot nutzt Threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
es: No hay buen soporte de hilos en la mayoría de las VMs, y Godot usa hilos (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
fr: Mauvais support des threads dans la plupart des scripts de machines virtuelles, et Godot utilise des threads (Lua, Python, Squirrel, JS, AS, etc.).
ko: 대부분의 스크립트 가상 머신(Lua, Python, Squirrel, JS, AS 등)에서는 스레드 지원이 좋지 않지만 Godot는 스레드를 사용합니다.
pl: Słaba obsługa wątków w większości skryptowych maszyn wirtualnych, a Godot używa wątków (Lua, Python, Squirrel, JavaScript, ActionScript, itp.).
ru: Слабая поддержка потоков, которые использует Godot, в виртуальных машинах скриптовых языков (Lua, Python, Squirrel, JS, AS, и пр.).
uk: У більшості віртуальних машин для скриптів немає хорошої підтримки потоків виконання, а Godot використовує потоки (Lua, Python, Squirrel, JS, AS та ін.).

source: Poor class-extending support in most script VMs, and adapting to the way Godot works is highly inefficient (Lua, Python, JavaScript).
cs: Špatná podpora rozšíření tříd ve většině VM skriptů a přizpůsobení se způsobu, jakým Godot pracuje, je vysoce neefektivní (Lua, Python, JavaScript).
de: Schlechte Unterstützung für Klassenerweiterung in den meisten Skript-VMs, und die Anpassung an die Funktionsweise von Godot ist sehr ineffizient (Lua, Python, JavaScript).
es: El bajo soporte para extensión de clases en la mayoria de las VMs de scripts, y adaptarlos a la forma en que Godot funciona es altamente ineficiente (Lua, Python, JavaScript).
fr: Mauvais support d'extension de classes dans la plupart des scripts de machines virtuelles, et les adapter à la façon dont Godot fonctionne est très inefficace (Lua, Python, JS).
ko: 대부분의 스크립트 가상 머신은 클래스 확장 지원이 부족하고 Godot의 작동 방식에 맞춰 변형하자면 너무 비효율적입니다 (Lua, Python, JS).
pl: Słabe wsparcie dla rozszerzania klas w większości skryptowych maszyn wirtualnych i dostosowywanie do sposobu działania Godota jest wysoce nieefektywne (Lua, Python, JavaScript).
ru: В большинстве виртуальных машин нет хорошей поддержки расширения классов, и процесс адаптации в Godot крайне неэффективен (Lua, Python, JS).
uk: У більшості скриптових віртуальних машин немає хорошої підтримки розширення класів, а адаптація до способу роботи Godot дуже неефективна (Lua, Python, JavaScript).

source: Many existing languages have horrible interfaces for binding to C++, resulting in a large amount of code, bugs, bottlenecks, and general inefficiency (Lua, Python, Squirrel, JavaScript, etc.). We wanted to focus on a great engine, not a great number of integrations.
cs: Mnoho existujících jazyků má otřesná rozhraní pro vazbu na C ++, což vede k velkému množství kódu, chybám, bottlenecks (efekt hrdla lahve) a obecně neefektivnosti (Lua, Python, Squirrel, JavaScript atd.) Chtěli jsme se zaměřit na skvělý engine, ne na velké množství integrovaných jazyků.
de: Viele bestehende Sprachen haben ineffiziente Schnittstellen zur Anbindung an C++, was zu einer großen Menge Code, Bugs, Bottlenecks und allgemeiner Ineffizienz führt (Lua, Python, Squirrel, JavaScript, etc.). Wir wollten uns auf eine großartige Engine konzentrieren, nicht auf eine große Anzahl von Skriptsprachen.
es: Muchos lenguajes existentes tienen interfaces horribles para enlazar a C++, lo que resulta en una gran cantidad de código, errores, cuellos de botella e ineficiencia general (Lua, Python, Squirrel, JS, etc.). Queríamos centrarnos en un gran motor, no en una gran cantidad de integraciones.
fr: Bon nombre de langages existants possèdent d'horribles interfaces de liaison avec C++, entraînant une grande quantité de code, des bogues, des goulots d'étranglement et une inefficacité générale (Lua, Python, Squirrel, JavaScript, etc.). Nous avons souhaité nous concentrer sur un moteur robuste, pas sur une grande quantité d'intégrations.
pl: Wiele istniejących języków ma okropne interfejsy do wiązania z C++, co skutkuje dużą ilością kodu, błędów, wąskich gardeł i ogólnej nieefektywności (Lua, Python, Squirrel, JavaScript, itp.). Chcieliśmy skupić się na świetnym silniku, a nie na dużej ilości integracji.
ru: Многие существующие языки имеют ужасные интерфейсы для привязки к C++, что приводит к большому количеству кода, ошибкам, "бутылочным горлышкам" и общей неэффективности (Lua, Python, Squirrel, JS и т.д.). Мы хотели сосредоточиться на качественном движке, а не на большом количестве интеграций.
uk: Багато існуючих мов мають жахливі інтерфейси для зв'язування з C++, що призводить до великої кількості коду, помилок, вузьких місць і загальної неефективності (Lua, Python, Squirrel, JavaScript тощо). Ми хотіли зосередитися на хорошому движку, а не на великій кількості інтеграцій.

source: No native vector types (Vector3, Transform3D, etc.), resulting in highly reduced performance when using custom types (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
cs: Žádné nativní typy vektorů (vector3, Transform3D atd.), kterou vedou k velmkému snížené výkonu při používání vlastních typů (Lua, Python, Squirrel, JavaScript, ActionScript atd.).
de: Keine nativen Vektor-Typen (vector3, Transform3D, usw.), was eine stark reduzierte Performance zur Folge hat, wenn eigene Objekttypen genutzt werden (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
es: No hay tipos nativos para vectores (Vector3, Transform3D, etc.), lo que resulta en un desempeño bastante reducido al usar tipos personalizados (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
fr: Pas de types vectoriels natifs (vector3, matrix4, etc.), résultant en une performance considérablement réduite lors de l'utilisation de types personnalisés (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
ru: Отсутствие родных векторных типов (Vector3, Transform3D и др.) приводило к серьёзному уменьшению производительности, когда использовались собственные типы (Lua, Python, Squirrel, JavaScript, ActionScript и т.д.).
uk: Відсутність власних векторних типів (Vector3, Transform3D тощо), що призводить до значного зниження продуктивності при використанні користувацьких типів (Lua, Python, Squirrel, JavaScript, ActionScript тощо).

source: Garbage collector results in stalls or unnecessarily large memory usage (Lua, Python, JavaScript, ActionScript, etc.).
cs: Automatická správa paměti (Garbage Collector) má za následek prodlevy nebo zbytečně velké využití paměti (Lua, Python, JavaScript, ActionScript atd.).
de: Der Garbage Collector führt zu Verzögerungen oder unnötig viel Speicherbelegung (Lua, Python, JavaScript, ActionScript, etc.).
es: El recolector de basura da como resultado paradas o un uso innecesariamente grande de memoria (Lua, Python, JS, AS, etc.).
fr: Le ramasse-miette entraîne des délais ou une utilisation inutilement importante de la mémoire (Lua, Python, JavaScript, ActionScript, etc.).
ko: (Lua, Python, JavaScript, ActionScript 등의) 가비지 컬렉터는 속도 저하를 일으키고 불필요하게 많은 메모리를 사용합니다.
pl: Odśmiecacz pamięci skutkuje przestojami i niepotrzebnie dużym zużyciem pamięci (Lua, Python, JavaScript, ActionScript, itd.).
ru: Сборщик мусора приводит к остановке или излишне большому использованию памяти (Lua, Python, JS, AS и т.д.).
uk: Збирач сміття призводить до зупинки або надмірного використання пам'яті (Lua, Python, JavaScript, ActionScript та ін.).

source: Difficulty integrating with the code editor for providing code completion, live editing, etc. (all of them).
cs: Potíže při integraci script editoru s automatickým navrhováním doplňování kódu (code completion), úpravou prováděného kódu atd. (Všechny).
de: Schwierigkeiten bei der Integration in den Code-Editor zur Code-Vervollständigung, Live-Bearbeitung, etc. (alle davon).
es: Dificultad para integrarse con el editor de código para proporcionar completado de código, edición en vivo, etc. (todos ellos).
fr: Difficulté d'intégration avec l'éditeur de code pour la complétion du code, l'édition en direct, etc.
ko: 코드 완성, 실시간 편집 등 (이 전부를) 지원하기 위한 코드 에디터 통합은 까다롭습니다.
pl: Trudności ze zintegrowaniem edytora kodu dla auto-uzupełniania, edycji w czasie rzeczywistym, itd. (każdy z nich).
ru: Сложная интеграция с редактором кода для обеспечения автодополнения, редактирования в реальном времени и т.д. (все языки).
uk: Складність інтеграції з редактором коду для забезпечення завершення коду, редагування в реальному часі тощо (всі).
