Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: Move the Godot executable to a stable location (i.e. outside of your Downloads folder), so you don't accidentally move it and break the shortcut in the future.
cs: Přesuňte spustitelný soubor Godot na pevné umístění (tj. mimo složku Stažené soubory), abyste jej omylem nepřesunuli a v budoucnu nerozbili zástupce.
de: Verschieben Sie die ausführbare Godot-Datei an einen dauerhaften Speicherort (z.B. außerhalb des Downloads-Ordners), damit Sie sie nicht aus Versehen verschieben und die Verknüpfung in Zukunft nicht mehr funktioniert.
es: Mueve el ejecutable de Godot a una ubicación estable (es decir, fuera de tu carpeta de descargas), para que no lo muevas accidentalmente y rompas el acceso directo en el futuro.
fr: Déplacez l’exécutable Godot vers un emplacement stable (c’est-à-dire en dehors de votre dossier Téléchargements), afin de ne pas le déplacer accidentellement et de casser le raccourci à l’avenir.
ko: Godot를 안정적으로 실행할 수 있는 폴더로 (예를 들어 다운로드 폴더 밖으로) 이동하여 나중에 의도와 상관없이 Godot이 이동하여 Shotcut을 사용할 수 없는 경우를 피하시길 바랍니다.
pl: Przenieś plik wykonywalny Godot'a do stabilnej lokalizacji (tj. poza folder Pobrane), aby przez przypadek nie przenieść go w przyszłości, co mogłoby uszkodzić wszystkie utworzone do niego skróty.
ru: Переместите исполняемый файл Godot в стабильное место (т.е. за пределы папки "Загрузки"), чтобы в будущем Вы случайно не переместили его или не повредили ярлык.
uk: Перемістіть виконуваний файл Godot у стабільне місце (тобто за межі теки Завантаження), щоб ви випадково не перемістили його та не зламали ярлик.

source: Right-click the Godot executable and choose **Create Shortcut**.
cs: Klikněte pravým tlačítkem myši na spustitelný soubor Godot a vyberte **Vytvořit zástupce**.
de: Klicken Sie mit der rechten Maustaste auf die ausführbare Godot-Datei und wählen Sie **Verknüpfung erstellen**.
es: Haz click derecho sobre el archivo ejecutable de Godot y selecciona **Crear acceso directo**.
fr: Cliquez-droit sur l'exécutable Godot et choisissez **Créer un raccourci**.
ko: Godot 실행파일을 오른쪽클릭하고 "바로 가기" 를 선택합니다.
pl: Kliknij prawym przyciskiem myszy na plik wykonywalny Godot i wybierz opcję **Utwórz skrót**.
ru: Щелкните правой кнопкой мыши на исполняемый файл Godot и выберите **Создать ярлык**.
uk: Клацніть правою кнопкою мишки виконуваний файл Godot і виберіть команду **Створити ярлик**.

source: Move the created shortcut to ``%APPDATA%\Microsoft\Windows\Start Menu\Programs``. This is the user-wide location for shortcuts that will appear in the Start menu. You can also pin Godot in the task bar by right-clicking the executable and choosing **Pin to Task Bar**.
cs: Přesuňte vytvořeného zástupce do ``%APPDATA%\Microsoft\Windows\Start Menu\Programs``. Toto je uživatelské místo pro zástupce, které se zobrazí v nabídce Start. Godot můžete také připnout na hlavní panel kliknutím pravého tlačítka myši na spustitelný soubor a výběrem **Připnout na hlavní panel**.
de: Verschieben Sie die erstellte Verknüpfung nach ``%APPDATA%\Microsoft\Windows\Start Menu\Programs``. Dies ist der benutzerweite Speicherort für Verknüpfungen, die im Startmenü angezeigt werden. Sie können Godot auch an die Taskleiste anheften, indem Sie mit der rechten Maustaste auf die ausführbare Datei klicken und **An Taskleiste anheften** wählen.
es: Mueva el acceso directo creado a ``%LOCALAPPDATA%\Microsoft\Windows\Start Menu\Programs``. Esta es la ubicación de todo el usuario para los accesos directos que aparecerán en el menú Inicio. También puedes anclar a Godot en la barra de tareas haciendo clic con el botón derecho en el ejecutable y seleccionando **Anclar a la barra de tareas**.
fr: Déplacez le raccourci créé vers ''%LOCALAPPDATA%\Microsoft\Windows\Start Menu\Programs''. Il s’agit de l’emplacement propre à chaque utilisateur pour les raccourcis qui apparaîtront dans le menu Démarrer. Vous pouvez également épingler Godot dans la barre des tâches en cliquant avec le bouton droit sur l’exécutable et en choisissant **Épingler à la barre des tâches**.
pl: Przenieś utworzony skrót do ``\ProgramData\Microsoft\Windows\Menu Start\Programy``. Jest to miejsce, z którego system Windows pobiera skróty, które pojawią się w menu Start. Możesz również przypiąć Godot'a do paska zadań poprzez kliknięcie prawym przyciskiem myszy na plik wykonywalny i wybranie opcji **Przypnij do paska zadań**.
ru: Переместите созданный ярлык в ``%APPDATA%\Microsoft\Windows\Start Menu\Programs``. Это общепользовательское расположение для ярлыков, которые будут отображаться в меню "Пуск". Вы также можете прикрепить Godot на панель задач, нажав на правую кнопку мыши по исполняемому файлу и выбрав **Прикрепить на Панель Задач**.
uk: Перемістіть створений ярлик до ``%APPDATA%\Microsoft\Windows\Меню Пуск\Програми``. Це загальне для всіх користувачів місце для ярликів, які з'являться у меню "Пуск". Ви також можете закріпити Godot на панелі завдань, клацнувши виконуваний файл правою кнопкою миші і вибравши **Закріпити на панелі завдань**.

source: Drag the extracted Godot application to ``/Applications/Godot.app``, then drag it to the Dock if desired. Spotlight will be able to find Godot as long as it's in ``/Applications`` or ``~/Applications``.
cs: Přetáhněte rozbalenou aplikaci Godot do ``/Applications/Godot.app`` a poté ji podle potřeby přetáhněte do Docku. Spotlight bude moci najít Godot, dokud bude v ``/Applications`` nebo ``~/Applications``.
de: Ziehen Sie die extrahierte Godot-Anwendung nach ``/Applications/Godot.app``, dann ziehen Sie sie in das Dock, falls gewünscht. Spotlight wird in der Lage sein, Godot zu finden, solange es sich in ``/Applications`` oder ``~/Applications`` befindet.
es: Arrastra la aplicación Godot extraída a ``/Applications/Godot.app``, luego arrástrala al Dock si lo deseas. Spotlight podrá encontrar a Godot siempre que esté en ``/Aplicaciones`` o ``~/Aplicaciones``.
fr: Faites glisser l’application Godot extraite vers ``/Applications/Godot.app``, puis faites-la glisser vers le Dock si vous le souhaitez. Spotlight sera en mesure de trouver Godot tant qu’il est dans ``/Applications`` ou ``~/Applications``.
ko: 추출한 Godot 애플리케이션을 ``/Applications/Godot.app``으로 드래그하세요, 추가로 원할 경우 Dock으로도 드래그하세요. 애플리케이션이 ``/Applications`` 또는 ``~/Applications``에 있다면 Spotlight에서 Godot를 찾을 수 있습니다.
ru: Переместите извлечённое приложение Godot в ``/Applications/Godot.app``, затем, если Вы хотите, можете переместить его на панель задач. Spotlight сможет найти Godot, пока он будет находиться в ``/Applications`` or ``~/Applications``.
uk: Перетягніть витягнутий застосунок Godot до ``/Applications/Godot.app``, а потім перетягніть її до Панелі, якщо хочете. Spotlight зможе знайти Godot, якщо він знаходиться в ``/Applications``, або ``~/Applications``.

source: Move the Godot binary to a stable location (i.e. outside of your Downloads folder), so you don't accidentally move it and break the shortcut in the future.
cs: Přesuňte soubor Godot na pevné umístění (tj. mimo vaši složku Stažené soubory), abyste jej omylem nepřesunuli a v budoucnu nerozbili zástupce.
de: Verschieben Sie die ausführbare Godot-Datei an einen dauerhaften Speicherort (z.B. außerhalb des Downloads-Ordners), damit Sie sie nicht aus Versehen verschieben, wodurch die Verknüpfung in Zukunft nicht mehr funktionieren würde.
es: Mueve el archivo ejecutable de Godot a una localización definitiva (por ejemplo fuera de tu directorio de descargas), de esta forma después nunca lo moverás accidentalmente y romperás los accesos directos en el futuro.
fr: Déplacez l’exécutable de Godot vers un emplacement stable (c’est-à-dire en dehors de votre dossier Téléchargements), afin de ne pas le déplacer accidentellement et de casser le raccourci à l’avenir.
ko: 실수로 Godot 실행파일을 다른 경로로 옮길경우 생성된 바로가기가 깨질 수 있으니 GODOT 바이너리 파일을 안정적인 위치로 (예를 들면 다운로드 폴더의 바깥으로) 옮기세요.
pl: Przenieś pliki binarne Godot'a w bezpieczną lokalizację (np. poza folder "Pobrane"), by niechcący ich nie usunąć albo przenieść w przyszłości.
ru: Переместите бинарный файл Godot в стабильное место (т.е. за пределы папки "Загрузки"), чтобы в будущем Вы случайно не переместили его и не повредили ярлык.
uk: Перемістіть бінарний файл Godot у стабільне місце (тобто за межі теки Завантаження), щоб ви випадково не перемістили його та не зламали ярлик у.

source: Rename and move the Godot binary to a location present in your ``PATH`` environment variable. This is typically ``/usr/local/bin/godot`` or ``/usr/bin/godot``. Doing this requires administrator privileges, but this also allows you to :ref:`run the Godot editor from a terminal <doc_command_line_tutorial>` by entering ``godot``.
cs: Přejmenujte a přesuňte soubor Godot do umístění ve vaší proměnné prostředí ``PATH``. Obvykle je to ``/usr/local/bin/godot`` nebo ``/usr/bin/godot``. To vyžaduje administrátorská práva, ale také vám umoží :ref:`spustit editor Godot z terminálu <doc_command_line_tutorial>` zadáním ``godot``.
de: Benennen Sie die Godot-Anwendung um und verschieben Sie sie an einen Ort, der in Ihrer ``PATH`` Umgebungsvariablen enthalten ist. Dies ist normalerweise ``/usr/local/bin/godot`` oder ``/usr/bin/godot``. Dazu sind zwar Administratorrechte erforderlich, aber damit können Sie auch :ref:`den Godot-Editor von einem Terminal aus starten <doc_command_line_tutorial>`, indem Sie ``godot`` eingeben.
es: Renombra y mueve el binario de Godot a una ubicación presente en tu variable de entorno ``PATH``. Esto suele ser ``/usr/local/bin/godot`` o ``/usr/bin/godot``. Hacer esto requiere privilegios de administrador, pero también te permite :ref:`ejecutar el editor de Godot desde una terminal <doc_command_line_tutorial>` ingresando ``godot``.
fr: Renommez et déplacez l’exécutable de Godot vers un emplacement présent dans votre variable d'environnement ``PATH``. Il s'agit généralement de ``/usr/local/bin/godot`` ou ``/usr/bin/godot``. Cette opération nécessite des privilèges d'administrateur, mais elle vous permet également :ref:`d'exécuter l'éditeur Godot à partir d'un terminal <doc_command_line_tutorial>` en saisissant ``godot``.
ko: Godot 실행파일을 원하는 이름으로 변경하고 `PATH` 환경변수에 있는 디렉토리로 옮기세요. 일반적으로 `/usr/local/bin/godot` 또는 `/usr/bin/godot` 등의 경로가 자주 사용됩니다. 이 경로들로 파일을 옮기려면 보통 시스템 관리자 권한을 요구하지만, 옮길시 터미널에 `godot` 명령을 입력하므로써 Godot 를 실행할 수 있습니다.
pl: Zmień nazwę i przenieś pliki binarne Godot'a do lokalizacji widocznej w twojej wartości ``PATH`` środowiska. Wartość ta to zazwyczaj ``/usr/local/bin/godot`` lub ``/usr/bin/godot``. Do zrobienia tego potrzebne są uprawnienia administratora, ale to również pozwoli Ci do uruchomienia edytora przy użyciu terminala.
ru: Переименуйте и переместите бинарный файл Godot в место вашей переменной среды ``PATH``. Обычно это ``/usr/local/bin/godot`` или ``/usr/bin/godot``. Для этого требуются права администратора , но это также позволяет Вам :ref:`запустить редактор Godot из терминала <doc_command_line_tutorial>`, введя``godot``.
uk: Перейменуйте та перемістіть бінарний файл Godot у місце, на яке вказує змінна середовища ``PATH``. Як правило, це ``/usr/local/bin/godot``, або ``/usr/bin/godot``. Для цього потрібні права адміністратора, але це також дозволяє вам :ref:`запустити Godot з термінала<doc_command_line_tutorial>` ввівши ``godot``.

source: If you cannot move the Godot editor binary to a protected location, you can keep the binary somewhere in your home directory, and modify the ``Path=`` line in the ``.desktop`` file linked below to contain the full *absolute* path to the Godot binary.
cs: Pokud nemůžete soubor editoru Godot přesunout na chráněné umístění, můžete si binární soubor ponechat někde ve svém domovském adresáři a upravit řádek ``Path=`` v níže odkazovaném souboru ``.desktop`` tak, aby obsahoval úplnou *absolutní* cestu ke Godot souboru.
de: Wenn Sie die Godot-Editor-Anwendung nicht an einen geschützten Ort verschieben können, ist es auch möglich, die Binärdatei irgendwo in Ihrem Home-Verzeichnis aufzubewahren und die Zeile ``Path=`` in der unten verlinkten Datei ``.desktop`` so zu ändern, dass sie den vollständigen *absoluten* Pfad zur Godot-Anwendung enthält.
es: Si no puede mover el binario del editor de Godot a una ubicación protegida, puede mantener el binario en algún lugar de su directorio de inicio y modificar la línea ``Path=`` en el archivo ``.desktop`` vinculado a continuación para que contenga la *ruta absoluta* completa al binario de Godot.
fr: Si vous ne pouvez pas déplacer le binaire de l'éditeur de Godot vers un emplacement sécurisé, vous pouvez le garder dans votre dossier personnel puis modifier la ligne``Path=`` dans le fichier ``.desktop`` en lien ci-dessous pour contenir le chemin *absolu* du binaire de Godot.
ko: Godot 편집기 바이너리를 보호된 위치로 옮길 수 없다면, 바이너리를 홈 디렉토리 어딘가에 보관하고, 아래 링크된 ``.desktop`` 파일의 ``Path=`` 줄을 수정하여 Godot 바이너리에 대한 전체 *절대* 경로를 포함할 수 있습니다.
pl: Jeśli nie możesz przenieść plików binarnych edytora do bezpiecznej lokalizacji, możesz je trzymać gdzieś w folderze domowym i później zmodyfikować wartość ``Path=`` w pliku poniżej ``.desktop``, który jest ma przechowywać całą (bezwzględną) ścieżką do plików binarnych Godot'a.
ru: Если Вы не можете переместить редактор Godot в защищённое место, Вы можете оставить бинарный файл где-нибудь в домашнем каталоге, и отредактировать файл ``Path=`` строка в ``.desktop``, приведённый ниже, чтобы включить его в полную *абсолютную* переменную path в бинарном файле Godot.
uk: Якщо ви не можете перемістити бінарний файл редактора Godot до захищеного місця, ви можете зберегти його десь у вашому домашньому каталозі та змінити рядок ``Path=`` у файлі ``.desktop``, наведеному нижче, щоб помістити повний *абсолютний* шлях до бінарного файлу Godot.

source: Save `this .desktop file <https://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__ to ``$HOME/.local/share/applications/``. If you have administrator privileges, you can also save the ``.desktop`` file to ``/usr/local/share/applications`` to make the shortcut available for all users.
cs: Uložte `soubor this.desktop <http://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__ do ``$HOME/.local/share/applications/``. Pokud máte administrátorská práva, můžete také uložit soubor ``.desktop`` do ``/usr/local/share/applications`` aby byl zástupce k dispozici pro všechny uživatele.
de: Speichern Sie `diese .desktop-Datei <https://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__ unter ``$HOME/.local/share/applications/``. Wenn Sie über Administratorrechte verfügen, können Sie die ``.desktop``-Datei auch unter ``/usr/local/share/applications`` speichern, damit die Verknüpfung für alle Benutzer verfügbar ist.
es: Guarde `este archivo .desktop <https://raw.githubusercontent.com/godotengine/godot/3.x/misc/dist/linux/org.godotengine.Godot.desktop>`__ en ``$HOME/.local/ compartir/aplicaciones/``. Si tiene privilegios de administrador, también puede guardar el archivo ``.desktop`` en ``/usr/local/share/applications`` para que el acceso directo esté disponible para todos los usuarios.
fr: Enregistrez `ce fichier .desktop <https://raw.githubusercontent.com/godotengine/godot/3.x/misc/dist/linux/org.godotengine.Godot.desktop>`__ dans ``$HOME/.local/share/applications/``. Si vous avez les privilèges administrateurs, vous pouvez plutôt enregistrer le fichier ``.desktop`` dans ``/usr/local/share/applications`` pour rendre ce raccourci disponible pour tous les utilisateurs de votre système.
ko: `이 데스크탑 파일을 <https://raw.githubusercontent.com/godotengine/godot/3.x/misc/dist/linux/org.godotengine.Godot.desktop>`__ ``$HOME/.local/share/applications/`` 에 저장하세요. 만약 관리자 권한이 있다면, 이 ``.desktop`` 파일을 ``/usr/local/share/applications`` 에 저장하여 모든 사용자들이 접근할 수 있는 바로 가기를 만들 수 있습니다.
ru: Сохраните `этот .desktop файл <https://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__ в ``$HOME/.local/share/applications/``. Если у Вас есть права администратора, Вы также можете сохранить ``.desktop`` файл в ``/usr/local/share/applications``, чтобы предоставить доступ к ярлыку всем пользователям.
uk: Збережіть ``цей файл .desktop <https://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__ у ``$HOME/.local/share/applications/``. Якщо у вас є права адміністратора, ви також можете зберегти файл ``.desktop`` у ``/usr/local/share/applications``, щоб зробити ярлик доступним для всіх користувачів.

source: Is the Godot editor a portable application?
cs: Je editor Godot přenosná aplikace?
de: Ist der Godot-Editor eine portable Anwendung?
es: ¿El editor de Godot es una aplicación portátil?
fr: Est-ce que Godot est une application portable ?
ko: 고도 에디터는 포터블 어플리케이션인가요?
pl: Czy edytor Godot jest aplikacją przenośną?
ru: Является ли Godot портативным?
uk: Чи є редактор Godot портативним застосунком?

source: In its default configuration, Godot is *semi-portable*. Its executable can run from any location (including non-writable locations) and never requires administrator privileges.
cs: V základní konfiguraci je Godot *polo-přenosný*. Jeho spouštěcí soubor může být spuštěn z kterékoliv lokace (všetně lokací do kterých nelze zapisovat) a nikdy nevyžaduje administrátorská práva.
de: In seiner Default-Konfiguration ist Godot *halbportabel*. Seine ausführbare Datei kann von jedem Ort aus ausgeführt werden (auch von nicht beschreibbaren Orten) und erfordert keine Administratorrechte.
es: En su configuración por defecto, Godot es *semi-portátil*. Su ejecutable puede ejecutarse desde cualquier ubicación (incluidas las ubicaciones en las que no se puede escribir) y nunca requiere privilegios de administrador.
fr: Dans sa configuration par défaut, Godot est *semi-portable*. Son exécutable peut fonctionner depuis n'importe quel emplacement (emplacements non inscriptibles inclus) et ne requiert aucun privilège administrateur.
ko: Godot는 기본 설정으로 *세미-포터블*입니다. Godot의 실행파일은(쓰기 불가능한 위치를 포함한) 모든 위치에서 실행 가능하며 관리자 권한이 필요하지 않습니다.
pl: W domyślnej konfiguracji Godot jest *częściowo przenośny*. Jego plik wykonywalny może działać z dowolnej lokalizacji (w tym z lokalizacji tylko do odczytu) i nigdy nie wymaga uprawnień administratora.
ru: При своих настройках по умолчанию Godot является *полу-портативным*. Его исполняемый файл может быть запущен из любого места (включая места, недоступные для записи) и никогда не требует права администратора.
uk: У своїй конфігурації за замовчуванням Godot є *наполовину-портативним*. Його виконуваний файл може працювати з будь-якого місця (включаючи місця, де не можна записувати) і ніколи не вимагає привілеїв адміністратора.

source: However, configuration files will be written to the user-wide configuration or data directory. This is usually a good approach, but this means configuration files will not carry across machines if you copy the folder containing the Godot executable. See :ref:`doc_data_paths` for more information.
cs: Nicméně, konfigurační soubory budou zapsány do konfigurace pro všechny uživatele nebo datového úložiště. Toto je většinou dobrý přístup, ale znamená to, že konfigurační soubory se nepřenáší mezi stroji pokud zkopírujete složku obsahující spustitelný soubor Godot. Čtěte :re:`doc_data_paths` pro více informací.
de: Die Konfigurationsdateien werden jedoch in das benutzerweite Konfigurations- oder Datenverzeichnis geschrieben. Dies ist in der Regel ein guter Ansatz, aber das bedeutet, dass Konfigurationsdateien nicht auf andere Rechner übertragen werden, wenn Sie den Ordner mit der ausführbaren Godot-Datei kopieren. Siehe :ref:`doc_data_paths` für weitere Informationen.
es: Sin embargo, los archivos de configuración se escribirán en el directorio de datos o configuración de todo el usuario. Este suele ser un buen enfoque, pero esto significa que los archivos de configuración no se transferirán a través de las máquinas si copia la carpeta que contiene el ejecutable de Godot. Consulte :ref:`doc_data_paths` para obtener más información.
fr: Cependant, les fichiers de configuration seront écrits dans le répertoire de données ou de configuration propre à l'utilisateur. C'est généralement une bonne approche, cependant cela implique que les fichiers de configuration ne seront pas transférés entre les appareils si vous copier le répertoire contenant l'exécutable de Godot. Consultez :ref:`doc_data_paths` pour plus d'information.
ko: 하지만, 설정 파일은 사용자의 설정 또는 데이터 디렉토리에 기록됩니다. 이는 일반적으로 좋은 방식이지만, Godot 실행 파일이 포함된 폴더를 복사하는 경우 설정 파일이 시스템 간에 전달되지 않습니다. 자세한 정보는 :ref:`doc_data_paths`를 참조하세요.
pl: Jednakże pliki konfiguracyjne będą zapisywane w katalogu konfiguracji użytkownika lub w katalogu danych. Zwykle jest to dobre podejście, ale oznacza to, że pliki konfiguracyjne nie będą przenoszone między komputerami, jeśli skopiujesz folder zawierający plik wykonywalny Godota. Zobacz :ref:`doc_data_paths`, aby uzyskać więcej informacji.
ru: Однако, конфигурационные файлы будут написаны для общепользовательских настроек или каталога данных. Обычно это хороший метод, но он означает, что конфигурационные файлы не перенесут оборудование, если Вы скопируете папку, содержащую исполняемый файл Godot. См. :ref:`doc_data_paths`для дополнительной информации.
uk: Однак файли конфігурації буде записано до користувацької конфігурації, або каталогу даних. Зазвичай це хороший підхід, але це означає, що файли конфігурації не будуть переноситися між комп'ютерами, якщо ви скопіюєте теку, що містить виконуваний файл Godot. Більше про це можна дізнатися з :ref:`doc_data_paths`.

source: If *true* portable operation is desired (e.g. for use on an USB stick), follow the steps in :ref:`doc_data_paths_self_contained_mode`.
cs: Pokud je vyžadován *skutečně* přenosný provoz (např. pro použití na USB klíčence), postupujte podle kroků v :ref:`doc_data_paths_self_contained_mode`.
de: Wenn ein *echter* portabler Betrieb gewünscht ist (z.B. für die Verwendung auf einem USB-Stick), folgen Sie den Schritten in :ref:`doc_data_paths_self_contained_mode`.
es: Si se desea una operación portátil *verdadera* (por ejemplo, para usar en una memoria USB), siga los pasos en :ref:`doc_data_paths_self_contained_mode`.
fr: Si un fonctionnement *véritablement* portable est désirée (ex : pour utilisation sur une clé USB), suivez les étapes décrites dans :ref:`doc_data_paths_self_contained_mode`.
ko: 만약 *진정한* 포터블 동작이 필요한 경우 (예: USB 스틱에서 사용), :ref:`doc_data_paths_self_contained_mode`의 단계를 따르세요.
pl: Jeśli wymagane jest *prawdziwe* działanie jako aplikacja przenośna (np. do użycia na pendrive'ie), postępuj zgodnie z instrukcjami w :ref:`doc_data_paths_self_contained_mode`.
ru: Если *true*, то потребуется портативная операция (например, для использования USB-накопителя), выполните следующие действия в :ref:`doc_data_paths_self_contained_mode`.
uk: Якщо потрібна *справжня* портативність (наприклад, для використання на USB-накопичувачі), виконайте наступні кроки :ref:`doc_data_paths_self_contained_mode`.

source: Why does Godot use Vulkan or OpenGL instead of Direct3D?
cs: Proč Godot používá Vulkan nebo OpenGL namísto Direct3D?
de: Warum verwendet Godot Vulkan oder OpenGL anstelle von Direct3D?
es: Por qué Godot usa Vulkan u OpenGL en vez de Direct3D?
fr: Pourquoi Godot utilise-t-il Vulkan ou OpenGL au lieu de Direct3D ?
ko: Godot가 Direct3D 대신 Vulkan 또는 OpenGL을 사용하는 이유는 무엇인가요?
pl: Dlaczego Godot używa Vulkan API lub OpenGL zamiast Direct3D?
ru: Почему Godot использует Vulkan или OpenGL вместо Direct 3D?
uk: Чому Godot використовує Vulkan, або OpenGL, замість Direct3D?
