Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: This custom UI toolkit :ref:`can't be used as a library <doc_faq_use_godot_as_library>`, but you can still :ref:`use Godot to create non-game applications by using the editor <doc_faq_non_game_applications>`.
cs: Tuto vlastní sadu nástrojů uživatelského rozhraní :ref:`nelze použít jako knihovnu <doc_faq_use_godot_as_library>`, ale stále můžete :ref:`použít Godot k vytváření neherních aplikací pomocí editoru <doc_faq_non_game_applications>`.
de: Dieses eigene UI-Toolkit :ref:`kann nicht als lib verwendet werden <doc_faq_use_godot_as_library>`, aber Sie können immer noch :ref:`Godot für „für nicht Spiele“-Apps verwenden, indem Sie den Editor nutzen <doc_faq_non_game_applications>`.
es: Este kit de herramientas de interfaz de usuario :ref:`no puede usarse como biblioteca <doc_faq_use_godot_as_library>`, pero sí puedes :ref:`utilizar Godot para crear aplicaciones que no son juegos mediante el uso del editor <doc_faq_non_game_applications>`.
fr: Cette boîte à outils d'interface utilisateur personnalisée :ref:`ne peut pas être utilisée comme bibliothèque <doc_faq_use_godot_as_library>`, mais vous pouvez toujours :ref:`utiliser Godot pour créer des applications sans rapport au jeu vidéo en utilisant l'éditeur <doc_faq_non_game_applications>`.
ko: 이 자체 UI 툴킷은 :ref:`라이브러리로 사용할 수 없지만 <doc_faq_use_godot_as_library>`, :ref:`에디터를 이용하여 Godot로 비게임 애플리케이션을 만들 수는 있습니다 <doc_faq_non_game_applications>`.
pl: Ten niestandardowy zestaw narzędzi interfejsu użytkownika :ref:`nie może być używany jako biblioteka <doc_faq_use_godot_as_library>`, ale nadal możesz :ref:`używać Godota do tworzenia aplikacji innych niż gry za pomocą edytora <doc_faq_non_game_applications>`.
ru: Этот собственный набор инструментов пользовательского интерфейса :ref:`нельзя использовать в качестве библиотеки <doc_faq_use_godot_as_library>`, но вы все равно можете :ref:`использовать Godot для создания неигровых приложений с помощью редактора <doc_faq_non_game_applications>`.
uk: Цей власний набір інструментів інтерфейсу користувача :ref:`не можна використати, як бібліотеку <doc_faq_use_godot_as_library>`, проте ви все ще можете :ref:`використати Godot для створення не ігрових застосунків <doc_faq_non_game_applications>`.

source: Why does Godot use the SCons build system?
cs: Proč Godot používá sestavovací systém Scons?
de: Warum verwendet Godot das SCons Buildsystem?
es: ¿Por qué Godot no usa el sistema de construcción SCons?
fr: Pourquoi Godot utilise-t-il le système de construction SCons ?
ko: 왜 Godot는 SCons 빌드 시스템을 사용하지 않나요?
ru: Почему Godot использует систему сборки SCons?
uk: Чому Godot використовує систему збірки SCons?

source: Godot uses the `SCons <https://www.scons.org/>`__ build system. There are no plans to switch to a different build system in the near future. There are many reasons why we have chosen SCons over other alternatives. For example:
cs: Godot používá sestavovací program `Scons <https://www.scons.org/>`__. V blízké budoucnosti se neplánuje přechod na jiný sestavovací systém. Je mnoho důvodů proč jsme si vybrali Scons mezi různými alternativní. Například:
de: Godot verwendet das `SCons <https://www.scons.org/>`__ Buildsystem. Es gibt keine Pläne, in naher Zukunft auf ein anderes Buildsystem zu wechseln. Es gibt viele Gründe, warum wir SCons gegenüber anderen Alternativen gewählt haben. Zum Beispiel:
es: Godot utiliza `SCons <https://www.scons.org/>`__sistema de construcción. No hay planes para cambiar a un distinto sistema de construcción en un futuro cercano. Hay muchas razones por las que elegimos SCons sobre otras opciones. Por ejemplo:
ko: Godot은 `SCons <https://www.scons.org/>`__ 빌드 시스템을 사용합니다. 가까운 시일 내에 다른 빌드 시스템으로 전환할 계획은 없습니다. 다른 대안 대신 SCons를 선택한 데에는 여러 가지 이유가 있습니다. 예를 들어:
pl: Godot używa systemu kompilacji `SCons <https://www.scons.org/>`__. Nie ma planów przejścia na inny system budowania projektu w najbliższej przyszłości. Istnieje wiele powodów, dla których wybraliśmy SCons zamiast innych alternatyw. Na przykład:
ru: Godot использует систему сборки`SCons <https://www.scons.org/>`__ . В ближайшем будущем не планируется переход на другую систему сборки. Есть много причин, по которым мы предпочли SCons другим альтернативам. К примеру:
uk: Godot використовує систему збірки `SCons <https://www.scons.org/>`__. Найближчим часом не планується перехід на іншу систему збірки. Є багато причин, чому ми вибрали SCons замість інших альтернатив. Наприклад:

source: Godot can be compiled for a dozen different platforms: all PC platforms, all mobile platforms, many consoles, and WebAssembly.
cs: Godot může být sestaven pro desítky různých platforem: všechny PC platformy, všechny mobilní platformy, mnoho konzolých a WebAssembly.
de: Godot kann für ein Dutzend verschiedener Plattformen kompiliert werden: alle PC-Plattformen, alle mobilen Plattformen, viele Konsolen und WebAssembly.
es: Godot se puede compilar para una docena de plataformas diferentes: todas las plataformas de PC, todas las plataformas móviles, muchas consolas y WebAssembly.
fr: Godot peut être compilé pour une douzaine de plates-formes différentes : toutes les plates-formes PC, toutes les plates-formes mobiles, de nombreuses consoles, et WebAssembly.
ko: Godot는 모든 PC 플랫폼, 모든 모바일 플랫폼, 여러 콘솔, WebAssembly 등 12개의 다양한 플랫폼에서 컴파일할 수 있습니다.
pl: Projekty w Godot można skompilować na kilkanaście różnych platform: wszystkie platformy PC, wszystkie platformy mobilne, wiele konsol i WebAssembly.
ru: Godot может быть скомпилирован для множества различных платформ: все ПК платформы, все мобильные платформы, множество консолей, и WebAssembly.
uk: Godot можна скомпілювати для дюжини різних платформ: усіх платформ ПК, усіх мобільних платформ, багатьох консолей і WebAssembly.

source: Developers often need to compile for several of the platforms **at the same time**, or even different targets of the same platform. They can't afford reconfiguring and rebuilding the project each time. SCons can do this with no sweat, without breaking the builds.
cs: Vývojáři casto potřebuji provest sestavení pro různé platformy **najednou** nebo dokonce různé zacílení té same platformy. Nemohou si dovolit pokaždé rekonfigurovat a přestavět projekt. Scons se u toho ani nezapotí a nezničí při tom sestavení.
de: Entwickler müssen oft für mehrere Plattformen **zur gleichen Zeit** kompilieren, oder sogar für verschiedene Targets derselben Plattform. Sie können es sich nicht leisten, das Projekt jedes Mal neu zu konfigurieren und neu zu erstellen. Mit SCons ist dies problemlos möglich, ohne die Builds zu zerstören.
es: Los desarrolladores a menudo necesitan compilar para varias de las plataformas **al mismo tiempo**, o incluso para diferentes objetivos de la misma plataforma. No pueden permitirse reconfigurar y reconstruir el proyecto cada vez. SCons puede hacer esto sin problemas, sin romper las compilaciones.
fr: Les développeurs ont souvent besoin de compiler pour plusieurs des plateformes **en même temps**, ou même différentes cibles de la même plateforme. Ils ne peuvent pas se permettre de reconfigurer et de reconstruire le projet à chaque fois. SCons peut le faire sans problème, sans casser les constructions(builds).
ko: 개발자는 여러 플랫폼을 동시에 컴파일해야 하거나, 심지어 같은 플랫폼의 다른 타깃을 컴파일해야 하는 경우가 많습니다. 매번 프로젝트를 재구성하고 다시 빌드할 여유가 없습니다. SCon을 사용하면 빌드를 중단하지 않고도 이 작업을 손쉽게 수행할 수 있습니다.
pl: Programiści często kompilują swoje produkty na kilka platform **w tym samym czasie** lub nawet różne konfiguracje dla celów tej samej platformy. Nie mogą sobie pozwolić za każdym razem na rekonfigurowanie wszystkiego i przebudowę projektu. SCons może to zrobić bez zająknięcia i bez niedziałających kompilacji.
ru: Разработчикам часто нужно компилировать для множества платформ **в одно и то же время**, или даже разных целей на одной платформе. Они не хотят перенастраивать и перестраивать проект каждый раз. SCons позволяет сделать это без лишней головной боли, без ломания сборок.
uk: Розробникам часто потрібно компілювати для кількох платформ **одночасно** або навіть для різних цілей однієї платформи. Вони не можуть дозволити собі щоразу перелаштовувати та перебудовувати проект. SCons може робити це без зайвих зусиль, не порушуючи збірки.

source: SCons will *never* break a build no matter how many changes, configurations, additions, removals etc.
cs: Scon **nikdy** nepřeruší sestavování bez ohledu na provedené změn, konfiguracie, přídavky, odstranění atd.
de: SCons wird *nie* einen Build zerstören, egal wie viele Änderungen, Konfigurationen, Hinzufügungen, Entfernungen usw. verwendet weden.
es: SCons *nunca* romperá una compilación sin importar cuántos cambios, configuraciones, adiciones o eliminaciones etc. haya.
ko: SCon은 아무리 많은 변경, 구성, 추가, 제거 등을 해도 빌드를 *절대* 깨뜨리지 않습니다.
pl: SCons *nigdy* nie zepsuje Twojej kompilacji, bez względu na liczbę zmian, konfiguracji, dodatków, usunięć etc.
ru: SCons совершенно *никогда* не сломает сборку независимо от количества изменений, конфигураций, дополнений, удалений итд.
uk: SCons *ніколи* не ламає збірку незалежно від кількості змін, конфігурацій, доповнень, видалень тощо.

source: Godot's build process is not simple. Several files are generated by code (binders), others are parsed (shaders), and others need to offer customization (:ref:`modules <doc_custom_modules_in_cpp>`). This requires complex logic which is easier to write in an actual programming language (like Python) rather than using a mostly macro-based language only meant for building.
cs: Sestavovací proces v Godot není snadný. Několik souborů je generováno kódem (binders), jiné jsou parsovsné (stíny) a ostatní potřebují upravitelné (:ref:` moduly<doc_custom_modules_in_cpp>`). To vše vyžaduje komplexní logiku, kterou je snazší napsat v aktuálním programovacím jazyce (jako Python), než-li použít nejznámější makro jazyky jen kvůli sestavení.
de: Der Build-Prozess von Godot ist nicht einfach. Einige Dateien werden durch Code erzeugt (Binder), andere werden geparst (Shader), und wieder andere müssen Anpassungen erlauben (:ref:`Module <doc_custom_modules_in_cpp>`). Dies erfordert eine komplexe Logik, die leichter in einer Programmiersprache (wie Python) geschrieben werden kann, als in einer hauptsächlich makrobasierten Sprache, die nur für den Build-Prozess gedacht ist.
es: El proceso de compilación de Godot no es sencillo. Se generan varios archivos a partir de código (vinculadores), otros se analizan (shaders), y otros necesitan ofrecer personalización (:ref:`modules <doc_custom_modules_in_cpp>). Esto requiere lógica compleja que es más fácil de escribir en un lenguaje de programación real (como Python) en lugar de usar un lenguaje basado principalmente en macros destinado únicamente a la compilación.
ko: Godot의 빌드 프로세스는 간단하지 않습니다. 여러 파일이 코드(바인더)로 생성되고, 다른 파일은 파싱(셰이더)되며, 다른 파일은 커스터마이징을 제공해야 합니다(:ref:`modules <doc_custom_modules_in_cpp>`). 이를 위해서는 복잡한 로직이 필요한데, 대부분 빌드 전용 매크로 기반 언어를 사용하는 것보다 실제 프로그래밍 언어(예: Python)로 작성하는 것이 더 쉽습니다.
pl: Proces budowania gry w Godot nie jest prosty. Kilka plików jest generowanych przez kod (binders), inne są parsowane (shaders), a jeszcze inne muszą umożliwiać dostosowywanie (:ref:`modułów <doc_custom_modules_in_cpp>`). Taką logikę łatwiej jest napisać w rzeczywistym języku programowania (takim jak Python), zamiast używać języka opartego głównie na makrach, przeznaczonego wyłącznie do budowania.
ru: Процесс сборки Godot не прост. Множество файлов созданы в коде(связующие(binders)), другие прошли через парсинг (шейдеры), а другие нуждаются в тонкой настройке (:ref:`плагины<doc_custom_modules_in_cpp>`). Всё это требует сложной логики которая может бы легко написана на подходящем языке программирования (например Python) чем использовать язык с макросами нужным только для сборки.
uk: Процес збирання Godot не простий. Частина файлів генеруються кодом (зв’язувачі), інші аналізуються (шейдери), ще інші потребують налаштування (:ref:`модулі <doc_custom_modules_in_cpp>`). Для цього потрібна складна логіка, яку легше написати реальною мовою програмування (наприклад, Python), а не використовувати мову на основі макросів, призначену лише для створення.

source: Please try to keep an open mind and get at least a little familiar with SCons if you are planning to build Godot yourself.
cs: Pokuste se mít otevřenou mysl a zkuste se alespoň trochu seznámit s Scons pokud plánujete sestavit si Godot sami.
de: Bitte versuchen Sie, aufgeschlossen zu sein und sich zumindest ein wenig mit SCons vertraut zu machen, wenn Sie Godot selbst bauen wollen.
es: Entonces, por favor, trata de mantener una mente abierta y familiarizarte al menos un poco con SCons si tienes la intención de compilar Godot por ti mismo.
ko: Godot을 직접 만들 계획이라면 열린 마음을 가지고 SCons에 대해 조금이라도 익숙해지도록 노력하세요.
pl: Jeśli planujesz samemu konfigurować budowanie w Godot, postaraj się zachować otwarty umysł i przynajmniej trochę zapoznać się z SCons.
ru: Пожалуйста, постарайтесь отнестись к этому непредвзято и хотя бы немного ознакомиться с SCons, если вы планируете собрать Godot самостоятельно.
uk: Будь ласка, постарайтеся хоча б трохи ознайомитися з SCons, якщо ви плануєте зібрати Godot самостійно.

source: Why does Godot not use STL (Standard Template Library)?
cs: Proč Godot nepoužívá STL (Standard Template Library)?
de: Warum verwendet Godot nicht die STL (Standard Template Library)?
es: ¿Por qué Godot no usa STL (Standard Template Library)?
fr: Pourquoi Godot n'utilise pas la STL (Standard Template Library) ?
ko: Godot는 왜 표준 템플릿 라이브러리(STL: Standard Template Library)를 사용하지 않나요?
pl: Dlaczego Godot nie używa STL (Standard Template Library)?
ru: Почему Godot не использует STL (стандартную библиотеку шаблонов)?
uk: Чому Godot не використовує STL (Standard Template Library)?

source: Like many other libraries (Qt as an example), Godot does not make use of STL (with a few exceptions such as threading primitives). We believe STL is a great general-purpose library, but we had special requirements for Godot.
cs: Stejně jako mnoho jiných knihoven (Qt jako příklad), Godot nevyužívá STL (až na pár vyjímek jako třeba threading primitives). Věříme, že STL je skvělá univerzální knihovna, ale pro Godot jsme měli specifické požadavky.
de: Wie viele andere Bibliotheken (zum Beispiel Qt) verzichtet auch Godot auf den Einsatz der STL (mit einigen Ausnahmen wie z.B. Threading-Primitiven). Wir glauben, dass die STL eine großartige Allzweck-Bibliothek ist, allerdings hatten wir besondere Anforderungen für Godot.
es: Así como muchas otras librerías (por ejemplo Qt), Godot no hace uso de STL (con algunas excepciones como con primitivas para hilos). Creemos que STL es una gran librería de propósito general, pero tuvimos requerimientos especiales para Godot.
ko: 스레딩 관리와 같은 몇 가지 예외를 제외하면 Qt와 같은 다른 많은 라이브러리처럼 Godot는 STL을 사용하지 않습니다. 우리는 STL이 훌륭한 범용 라이브러리라고 생각하지만, Godot에 특별한 요구 사항이 있었습니다.
ru: Как и многие другие библиотеки (например, Qt), Godot не использует STL (за некоторыми исключениями, такими как потоковые примитивы). Мы считаем, что STL - это отличная библиотека общего назначения, но у нас были особые требования к Godot.
uk: Як і багато інших бібліотек (наприклад, Qt), Godot не використовує STL (за деякими винятками, такими як примітиви потоків). Ми вважаємо, що STL є чудовою універсальною бібліотекою, але у нас були особливі вимоги до Godot.

source: STL templates create very large symbols, which results in huge debug binaries. We use few templates with very short names instead.
cs: Šablony STL vytvářejí velmi rozsáhlé symboly, které ve výsledku mají obrovské debugovací binární soubory. Místo toho používáme několik šablon s velmi krátkými jmény.
de: STL-Templates erzeugen sehr große Symbole und diese führen zu großen Debug-Binärdateien. Wir verwenden stattdessen nur wenige Templates mit sehr kurzen Namen.
es: Las plantillas STL crean símbolos muy grandes, lo que da como resultado, enormes binarios de depuración. En cambio, utilizamos pocas plantillas con nombres muy cortos en su lugar.
fr: Les templates de la STL créent de grands symboles, engendrant d'énormes binaires de debogage. Nous utilisons quelques templates avec des noms très courts à la place.
ko: STL 템플릿은 매우 큰 심볼들을 만들어서, 결과적으로 거대한 디버그 바이너리를 만듭니다. 대신 Godot는 매우 짧은 이름의 템플릿을 조금만 사용합니다.
pl: Szablony STL tworzą bardzo dużo symbolów, czego rezultatem są bardzo duże debug binaries. W zamian używamy szablonów w małą ilością nazw.
ru: Шаблоны STL создают очень большие символы, что приводит к огромным отладочным двоичным файлам. Вместо этого мы используем несколько шаблонов с очень короткими именами.
uk: Шаблони STL створюють дуже великі символи, що призводить до величезних бінарних файлів. Натомість ми використовуємо кілька шаблонів із дуже короткими назвами.

source: Most of our containers cater to special needs, like Vector, which uses copy on write and we use to pass data around, or the RID system, which requires O(1) access time for performance. Likewise, our hash map implementations are designed to integrate seamlessly with internal engine types.
cs: Většina našich kontejnerů vyhovuje zvláštním potřebám, jako je Vector, který používá kopii při zápisu a které pak používáme k předávání dat nebo systému RID, který vyžaduje pro výkon O(1) přístupový čas. Naše implementace hash map jsou také navrženy tak, aby hladce spolupracovaly s interními typy enginu.
de: Die meisten unserer Container sind für spezielle Anforderungen ausgelegt, wie z.B. Vector, welcher Copy on Write verwendet, und den wir verwenden, um Daten weiterzugeben, oder das RID-System, das O(1)-Zugriffszeit für gute Performance benötigt. Ebenso sind unsere Hash-Map-Implementierungen so konzipiert, dass sie sich nahtlos in die internen Enginetypen integrieren lassen.
es: La mayoría de nuestros contenedores satisfacen necesidades especiales, como Vector, que usa copia en escritura y nosotros lo usamos para pasar datos, o el sistema RID, que requiere tiempo de acceso O (1) para el rendimiento. Del mismo modo, nuestras implementaciones de mapas hash están diseñadas para integrarse perfectamente con los tipos usados internamente por el motor.
fr: La plupart des conteneurs répondent a des besoins spécifiques. Par exemple il y a le conteneur Vector, qui utilise le "copy on write" (copie l'objet lorsqu'il est modifié) et que nous utilisons pour manipuler des données. Ou encore, il y a le système de RID, avec un temps d'accès d'une complexité en O(1). De la même manière, l'implémentation des HashMap (table de hashage),est conçue pour s'intégrer parfaitement avec les types internes au moteur.
ko: Copy-On-Write를 사용하고 데이터를 전달하기 위해 사용하는, 벡터와 같은 대부분의 컨테이너는, 성능을 위해 O(1) 접근 시간이 필요한 RID 시스템과 같은 특수 목적에 맞춰졌습니다. 이와 비슷하게 Godot 해시 맵은 내부 엔진 유형과 부드럽게 통합하도록 설계 및 구현되었습니다.
pl: Większość naszych kontenerów jest dostosowanych do specjalnych potrzeb, tak jak Vector, który używa kopiowania podczas zapisu, zaś my używamy go do przekazywania danych, albo systemu RID, który wymaga wydajności czasu dostępu O(1). Również, nasze implementacje mapy hash są stworzone, by integrować się płynnie z wewnętrznymi elementami silnika.
ru: Большинство наших контейнеров удовлетворяют особые потребности, например Vector, который использует копирование при записи, которое мы используем для передачи данных, или система RID, которая требует O(1) времени доступа для производительности. Аналогично, наши реализации хеш-карт предназначены для бесшовной интеграции с внутренними типами движков.
uk: Більшість наших контейнерів задовольняють особливі потреби, наприклад Vector, який використовує копіювання при записі, яке ми використовуємо для передачі даних, або систему RID, яка вимагає O (1) часу доступу для продуктивності. Аналогічно, наші реалізації хеш-карт призначені для безшовних інтеграції з внутрішніми типами двигунів.

source: Our containers have memory tracking built-in, which helps better track memory usage.
cs: Naše kontejnery mají vestavěné sledování paměti, což pomáhá lépe sledovat celkové využití paměti.
de: Unsere Container verwenden integriertes „memory tracking“, was beim Analysieren des Speicherverbrauchs hilft.
es: Nuestros contenedores tienen seguimiento de memoria incorporado, lo que ayuda a rastrear mejor el uso de memoria.
fr: Les conteneurs intègrent un système de traçage de la mémoire, ce qui permet le suivi de l'utilisation de la mémoire au cours du temps.
ko: Godot 컨테이너에는 메모리 추적 기능이 내장돼 있어서, 메모리 사용량을 더 잘 추적합니다.
pl: Nasze kontenery posiadają wbudowane śledzenie pamięci, co pozwala na lepszą obserwację jej zużycia.
ru: В наши контейнеры встроена функция отслеживания использования памяти, которая помогает лучше отслеживать использование памяти.
uk: В наші контейнери вбудована функція відстеження використання пам'яті, яка допомагає краще здійснювати контроль за використанням пам'яті.

source: For large arrays, we use pooled memory, which can be mapped to either a preallocated buffer or virtual memory.
cs: Pro rozsáhlá pole používáme paměť alokovanou v pevných blocích, kterou lze namapovat buď na předběžně přidělenou vyrovnávací paměť nebo na virtuální paměť.
de: Für den Gebrauch von großen Arrays, benutzen wir Memory-Pooling, das entweder einem vorab zugewiesenen Buffer oder einem virtuellen Speicher zugeordnet werden kann.
es: Para grandes arrays, usamos pooled memory, la cual puede ser mapeada directamente a un buffer prealocado o a memoria virtual.
fr: Pour les grands tableaux, nous utilisons un pool de mémoire (réservoir en quelque sorte), qui peut être attaché soit à de la mémoire virtuelle, soit à une mémoire tampon.
ko: Godot에서 큰 배열은 사전에 할당된 버퍼 메모리 혹은 가상 메모리에 매핑되는 메모리 풀(Pool)을 사용합니다.
pl: Dla dużych tablic, używamy puli pamięci, która może być zmapowana do wstępnie przydzielonego bufora, jak i do pamięci wirtualnej.
ru: Для больших массивов мы используем память в виде пулов, отображаемых либо на предварительно выделенный буфер, либо на виртуальную память.
uk: Для великих масивів ми використовуємо пам'ять у вигляді пулів, які відображаються або на попередньо виділений буфер, або на віртуальну пам'ять.

source: We use our custom String type, as the one provided by STL is too basic and lacks proper internationalization support.
cs: Používáme náš vlastní typ String, protože typ poskytovaný STL je příliš prostý a postrádá náležitou podporu internacionalizace.
de: Wir verwenden unsere eigene angepasste String-Klasse, da die von STL bereitgestellte zu einfach ist und Internationalisierung nur unzureichend unterstützt.
es: Usamos nuestro propio tipo de String, puesto que el que provee STL es demasiado básico y carece de soporte para internacionalización.
fr: La gestion des String offerte par la STL étant basique et ne permettant pas de supporter l'internationalisation (i18n pour l'abbréviation), nous utilisons notre propre type de String (chaîne de caractère).
ko: STL에서 제공하는 문자열 타입은 너무 단순하고 현지화 지원 기능이 부족하기 때문에 Godot는 커스텀 문자열 타입을 사용합니다.
pl: Używamy naszego własnego typu String, ponieważ ten wprowadzony przez bibliotekę STL jest zbyt prosty i brakuje mu wsparcia internacjonalizacji.
ru: Мы используем наш собственный тип String, так как предоставляемый STL является слишком простым и не имеет надлежащей поддержки интернационализации.
uk: Ми використовуємо наш власний тип String, так як надається STL є занадто простим і не має належної підтримки інтернаціоналізації.

source: Why does Godot not use exceptions?
cs: Proč Godot nevyužívá výjimky?
de: Weshalb verwendet Godot keine Exceptions?
es: Por qué Godot no usa excepciones?
fr: Pourquoi n'y a-t-il pas de gestion d'exceptions dans Godot ?
ko: 왜 Godot는 예외(Exception)를 사용하지 않나요?
pl: Dlaczego Godot nie używa mechanizmu wyjątków?
ru: Почему Godot не использует исключения?
uk: Чому Godot не використовує винятки?
