Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, es, fr, ko, pl, ru, uk

source: We believe games should not crash, no matter what. If an unexpected situation happens, Godot will print an error (which can be traced even to script), but then it will try to recover as gracefully as possible and keep going.
cs: Věříme, že hry by se neměly padat, ať už je důvod jakýkoliv. Pokud dojde k neočekávané situaci, Godot oznámí chybu (kterou lze vysledovat i ke skriptu), ale pak se pokusí co možná nejelegantněji vzpamatovat a pokračovat v v běhu programu.
de: Wir glauben Spiele sollten nicht Abstürzen, egal was auch passiert. Wenn eine unerwartete Situation auftritt, dann schreibt Godot eine Fehlermeldung (die sogar auf Skipt-Code verweist), versucht den Fehler danach aber so gut es geht wieder auszugleichen und weiter zu laufen.
es: Creemos que los juegos no deben fallar no importa la situación. Si una situación inesperada sucede, Godot mostrara un error (el cual puede incluso llevarte al script), pero seguidamente intentara recuperarse lo mejor posible y continuar en la medida de lo posible.
fr: Nous pensons que les jeux ne doivent pas planter, peu importe la raison. Dans le cas où une erreur se produit, Godot va afficher un message d'erreur (qui va vous permettre de remonter jusqu'au script fautif), puis il va essayer de continuer de fonctionner en mode dégradé.
ko: 우리는 게임이 어떤 경우에도 고장나지 않아야 한다고 생각합니다. 예기치 못한 사태가 벌어지면, Godot는 (스크립트에서 추적할 수 있는) 오류를 작성한 다음, 가능한 한 정상적으로 게임을 복구한 후 계속 진행합니다.
pl: Wierzymy, że gry powinny działać stabilnie, niezależnie od wszystkiego. Jeśli wydarzy się coś niespodziewanego Godot wskaże błąd (który można prześledzić w skrypcie), ale potem spróbuje przywrócić program do prawidłowego działania, tak dobrze jak jest to możliwe.
ru: Мы считаем, что игры не должны крашиться, несмотря ни на что. Если случится неожиданная ситуация, Godot выдаст ошибку (которую можно отследить вплоть до скрипта), но затем попытается исправить ее как можно более изящно и продолжить работу.
uk: Ми вважаємо, що гри не повинні краш, незважаючи ні на що. Якщо трапиться несподівана ситуація, Godot видасть помилку (яку можна відстежити аж до скрипта), але потім спробує виправити її якомога витонченішою і продовжити роботу.

source: Additionally, exceptions significantly increase the binary size for the executable and result in increased compile times.
cs: Výjimky navíc výrazně zvyšují celkovou velikost spustitelného soubor a vedou ke zvýšenému času k sestavení produktu.
de: Außerdem erhöhen Exceptions die Binärgröße der ausführbaren Datei erheblich und führen zu einer längeren Kompilierzeit.
es: Adicionalmente, las excepciones aumentan significativamente el tamaño binario del ejecutable y también resulta en tiempos de compilación mayores.
ko: 또한 예외는 실행 파일의 크기를 늘리고 결과적으로 컴파일 시간이 늘어납니다.
ru: Кроме того, исключения значительно увеличивают размер двоичного исполняемого файла и приводят к увеличению времени компиляции.
uk: Крім того, винятки значно збільшують двійковий розмір виконуваного файлу і призводять до збільшення часу компіляції.

source: Does Godot use an ECS (Entity Component System)?
cs: Používá Godot ECS (Entity Component System)?
de: Verwendet Godot ein ECS (Entity-Component-System)?
es: ¿Godot utiliza un ECS (Sistema de Componentes de Entidad)?
fr: Est-ce-que Godot utilise un ECS (Système de composants d'entité) ?
ko: 왜 고도는 ECS (Entity Component System)를 사용하나요?
pl: Czy Godot używa ECS (Entity Component System)?
ru: Использует ли Godot ECS (Entity Component System)?
uk: Чи використовує Godot ECS (Entity Component System)?

source: Godot does **not** use an ECS and relies on inheritance instead. While there is no universally better approach, we found that using an inheritance-based approach resulted in better usability while still being fast enough for most use cases.
cs: Godot **nepoužívá** ECS a namísto toho se spoléhá na dědičnost. I když neexistuje žádný univerzální přístup, zjistili jsme, že využití přístupu založeného na dědičnosti vede ve většině případů k lepší použitelnosti při zachování rychlosti.
de: Godot verwendet **kein** ECS und verlässt sich stattdessen auf Vererbung. Es gibt zwar keinen allgemein besseren Ansatz, aber wir haben festgestellt, dass die Verwendung eines auf Vererbung basierenden Ansatzes zu einer besseren Benutzerfreundlichkeit führt und dennoch für die meisten Anwendungsfälle schnell genug ist.
es: Godot **no** usa un ECS y se basa en la herencia en su lugar. Si bien no existe un enfoque universalmente mejor, descubrimos que el uso de un enfoque basado en la herencia dio como resultado una mejor usabilidad y, al mismo tiempo, lo suficientemente rápido para la mayoría de los casos de uso.
ko: 고도는 ECS를 사용하지 않고 대신에 상속에 의존합니다. 일반적으로 더 좋은 접근 방식이 없는 한 우리는 상속 기반 접근 방식을 사용하면 대부분의 사용 사례에서 충분히 빠르면서도 사용성이 향상된다는 사실을 발견했습니다.
pl: Godot **nie** używa ECS i zamiast tego opiera się na dziedziczeniu. Chociaż nie ma podejścia, które można jednoznacznie określić lepszym, to odkryliśmy, że zastosowanie podejścia opartego na dziedziczeniu zapewnia lepszą użyteczność, a jednocześnie jest w większości przypadków wystarczająco szybkie.
ru: Godot **not** использует ECS и полагается на наследование вместо этого. Хотя нет универсально лучшего подхода, мы обнаружили, что использование подхода на основе наследования приводит к лучшей удобству использования, при этом все еще достаточно быстро для большинства случаев использования.
uk: Godot **не** використовує ECS, натомість він покладається на спадкування. Хоча універсального кращого підходу не існує, ми виявили, що використання підходу на основі успадкування покращує зручність використання, але при цьому залишається достатньо швидким для більшості випадків використання.

source: That said, nothing prevents you from making use of composition in your project by creating child Nodes with individual scripts. These nodes can then be added and removed at run-time to dynamically add and remove behaviors.
cs: Nic vám nebrání vytvořit si sestavu ve svém projektu vytvořením podřízených uzlů s individuálními skripty. Tyto uzly pak mohou být přidávány a mazány za běhu programu k přidání nebo odebrání dynamického chovani.
de: Nichtsdestotrotz können Sie die Zusammensetzung in Ihrem Projekt nutzen, indem Sie Child-Nodes mit individuellen Skripten erstellen. Diese Nodes können dann zur Laufzeit hinzugefügt und entfernt werden, um dynamisch Verhaltensweisen hinzuzufügen oder zu entfernen.
es: Dicho esto, nada le impide hacer uso de la composición en su proyecto mediante la creación de nodos secundarios con scripts individuales. Estos nodos se pueden agregar y quitar en tiempo de ejecución para agregar y eliminar comportamientos de forma dinámica.
pl: Niemniej nic nie stoi na przeszkodzie, abyś preferował kompozycję ponad dziedziczenie w swoim projekcie, tworząc węzły podrzędne z indywidualnymi skryptami. Węzły te można później dodawać i usuwać w czasie działania gry, aby zmieniać powiązane z nimi zachowania.
ru: Тем не менее, ничто не мешает вам использовать композицию в вашем проекте, создавая дочерние узлы с индивидуальными скриптами. Эти узлы могут быть добавлены и удалены во время выполнения, что позволяет динамически добавлять и удалять функциональность.
uk: Однак ніщо не заважає вам використовувати композицію у вашому проекті, створюючи дочірні вузли з окремими скриптами. Потім ці вузли можна додавати та видаляти під час виконання, щоб динамічно додавати та видаляти функціональність.

source: More information about Godot's design choices can be found in `this article <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.
cs: Více o designových volbách Godot lze nalézt v `tomto článku <https://godotengine.orf/article/why-isnt-godot-esc-base-game-engine>`__.
de: Weitere Informationen über die Gestaltung von Godot finden Sie in `diesem Artikel <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.
es: Se puede encontrar más información sobre las opciones de diseño de Godot en `este artículo <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.
pl: Więcej informacji na temat wyborów projektowych w Godot można znaleźć w `tym artykule <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.
ru: Более подробную информацию о выборах в дизайне Godot можно найти в `этой статье <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.
uk: Більше інформації про варіанти архітектури Godot можна знайти в `цій статті <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.

source: Why does Godot not force users to implement DOD (Data-Oriented Design)?
cs: Proč Godot nenutí uživatele implementovat DOD (Datově-Orientovaný Design)?
de: Warum zwingt Godot seine Benutzer nicht zur Implementierung von DOD (Data-Oriented Design)?
es: ¿Por qué Godot no fuerza a los usuarios a implementar DoD (Diseño orientado a Datos)?
ru: Почему Godot не принуждает пользователей к внедрению DOD (дизайн, ориентированный на данные(Data-Oriented Design))?
uk: Чому Godot не змушує користувачів впроваджувати DOD (Data-Oriented Design)?

source: While Godot internally attempts to use cache coherency as much as possible, we believe users don't need to be forced to use DOD practices.
cs: Zatímco sebGodot interně snaží co nejlépe využít koherenci mezipaměti, věříme, že uživatelé nepotřebují být nuceni využívat postupy DOD.
de: Obwohl Godot intern versucht, so weit wie möglich Cache-Kohärenz zu nutzen, sind wir der Meinung, dass die Benutzer nicht gezwungen werden müssen, DOD-Praktiken zu verwenden.
es: Internamente, para muchas de las tareas de alto rendimiento, Godot intenta usar la coherencia de caché lo mejor posible, por lo que creemos que la mayoría de usuarios no necesitan usar prácticas DoD.
ru: В то время как Godot пытается как можно лучше использовать согласованность кэша, мы считаем, что пользователей не нужно заставлять использовать практики DOD.
uk: Хоча всередині Godot намагається використовувати когерентність кешу якомога більше, ми вважаємо, що користувачів не потрібно змушувати використовувати методи DOD.

source: DOD is mostly a cache coherency optimization that can only provide significant performance improvements when dealing with dozens of thousands of objects which are processed every frame with little modification. That is, if you are moving a few hundred sprites or enemies per frame, DOD won't result in a meaningful improvement in performance. In such a case, you should consider a different approach to optimization.
cs: DOD spočívá převážně v optimalizaci soudržnost mezipaměti, která vám může přinést pouze částečné zvýšení výkonu při práci s desítkami tisíc objektů, které mají při zpracování v každém snímku malou úpravu. V případě, že pohybujete několika stovkami spritů nebo nepřátel za snímek, DoD vám tady stějně nepomůže zlepšit výkon. V takovém případě byste měli zvážit jiný přístup k optimalizaci.
de: Bei DOD handelt es sich hauptsächlich um eine Optimierung der Cache-Kohärenz, die nur dann zu signifikanten Leistungsverbesserungen führt, wenn es sich um zehntausende von Objekten handelt, die bei jedem Frame mit geringen Änderungen verarbeitet werden. Das heißt, wenn Sie ein paar hundert Sprites oder Gegner pro Frame bewegen, wird DOD nicht zu einer bedeutenden Leistungsverbesserung führen. In einem solchen Fall sollten Sie einen anderen Optimierungsansatz in Betracht ziehen.
es: DOD es principalmente una optimización de coherencia de caché que solo puede proveer mejoras significativas en el rendimiento cuando se trata de docenas de miles de objetos que se procesan en cada cuadro con poca modificación. Es decir, si estás moviendo unos pocos cientos de sprites o enemigos por cuadro, DOD no resultará en una mejora significativa en el rendimiento. En ese caso, deberás considerar un enfoque diferente para la optimización.
uk: DOD - це здебільшого оптимізація когерентності кешу, яка може забезпечити значний приріст продуктивності лише при роботі з десятками тисяч об'єктів, які обробляються кожного кадру з невеликими змінами. Тобто, якщо ви переміщуєте кілька сотень спрайтів або ворогів за кадр, DOD не призведе до значного покращення продуктивності. У такому випадку варто розглянути інший підхід до оптимізації.

source: The vast majority of games do not need this and Godot provides handy helpers to do the job for most cases when you do.
cs: Drtivá většina her toto nepotřebuje a Godot poskytuje šikovné pomocníky, kteří toto ve většině případů zařídí.
de: In den allermeisten Spielen ist dies nicht erforderlich, und Godot bietet praktische Helfer, die diese Aufgabe in den meisten Fällen übernehmen.
es: La gran mayoría de juegos no necesitan esto y Godot proporciona ayudas practicas para hacer el trabajo en la mayoría de los casos en que lo necesites.
fr: Dans la plupart des cas, vous n'aurez pas besoin du DoD. Et Godot va vous fournir des fonctions pratiques pour vous aider dans ce que vous voulez faire.
ko: 대다수의 게임은 DoD가 필요하지 않고 Godot는 DoD가 필요한 대부분의 경우에 작업을 수행할 수 있는 편리한 도우미를 제공합니다.
pl: Znaczna większość gier nie potrzebuje tego i Godot zapewnia przydatne narzędzia dla większości przypadków, w których by to było potrzebne.
ru: В подавляющем большинстве игр это не нужно, и Godot предоставляет удобных помощников для выполнения работы в большинстве случаев, когда вы делаете это в ручную.
uk: Переважна більшість ігор в цьому не мають потреби, і Godot надає зручних помічників, які підходять для більшості випадків.

source: If a game needs to process such a large amount of objects, our recommendation is to use C++ and GDExtensions for performance-heavy tasks and GDScript (or C#) for the rest of the game.
cs: Pokud hra skutečně potřebuje zpracovat tak velké množství objektů, doporučujeme použít C ++ a GDExtensions pro úkoly s vysokým požadavkem na výkon a GDScript (nebo C #) pro zbytek hry.
de: Wenn ein Spiel eine so große Anzahl von Objekten verarbeiten muss, empfehlen wir, C++ und GDExtensions für leistungsintensive Aufgaben und GDScript (oder C#) für den Rest des Spiels zu verwenden.
es: Si algún juego necesita procesar una cantidad realmente grande de objetos, nuestra recomendación es usar C++ y GDNative para las tareas en las que se necesite alto rendimiento y GDScript (o C#) durante el resto del juego.
ko: 게임이 정말로 많은 양의 객체를 처리해야 한다면 높은 성능이 필요한 부분은 C++과 GDExtension을 사용하고 그 외 나머지 부분은 GDScript (혹은 C#)을 사용하길 권합니다.
ru: Если игра должна обрабатывать большое количество объектов, то мы рекомендуем использовать C++ и GDNative для высокозатратных частей и GDScript (или C#) для остальной части игры.
uk: Якщо гра має обробляти таку велику кількість об'єктів, ми рекомендуємо використовувати C++ та GDExtensions для завдань, що вимагають високої продуктивності, та GDScript (або C#) для решти гри.

source: How can I support Godot development or contribute?
cs: Jak mohu podpořit rozvoj Godot nebo přispět?
de: Wie kann ich die Entwicklung von Godot unterstützen oder einen Beitrag leisten?
es: ¿Cómo puedo apoyar el desarrollo de Godot o contribuir?
fr: Comment puis-je soutenir le développement de Godot ou y contribuer ?
ko: 어떻게 Godot 개발을 돕거나 후원할 수 있나요?
pl: Jak mogę wesprzeć rozwój Godota?
ru: Как я могу поддержать разработку Godot или внести свой вклад?
uk: Як я можу підтримати розвиток Godot, або зробити свій внесок?

source: See :ref:`doc_ways_to_contribute`.
cs: Čtěte :ref:`doc_ways_to_contribute`.
de: Siehe :ref:`doc_ways_to_contribute`.
es: Mira :ref:`doc_ways_to_contribute`.
fr: Voir :ref:`doc_ways_to_contribute`.
ko: :ref:`doc_ways_to_contribute`\ 를 참고하세요.
pl: Zobacz :ref:`doc_ways_to_contribute`.
ru: Смотрите :ref:`doc_ways_to_contribute`.
uk: Див. :ref:`doc_ways_to_contribute`.

source: Who is working on Godot? How can I contact you?
cs: Kdo pracuje na Godot? Jak vás mohu kontaktovat?
de: Wer arbeitet an Godot? Wie kann ich euch kontaktieren?
es: ¿Quien esta trabajando en Godot? ¿Como puedo ponerme en contacto?
fr: Qui travaille sur Godot ? Comment puis-je vous contacter ?
ko: Godot는 누가 만드나요? 어떻게 연락할 수 있나요?
pl: Kto pracuje nad Godotem? Jak mogę się z Tobą skontaktować?
ru: Кто работает над Godot? Как я могу связаться с вами?
uk: Хто працює над Godot? Як я можу зв'язатися з вами?

source: See the corresponding page on the `Godot website <https://godotengine.org/contact>`_.
cs: Podívejte se na příslušnou stránku na `webu Godot <https://godotengine.org/contact>`_.
de: Siehe die dazugehörige Seite auf der `Godot-Webseite <https://godotengine.org/contact>`_.
es: Mira la pagina correspondiente en el `sitio web de Godot <https://godotengine.org/contact>`_.
fr: Voir la page correspondante sur le `site web de Godot <https://godotengine.org/contact>`_.
ko: `Godot 웹사이트 <https://godotengine.org/contact>`_\ 에서 해당 페이지를 참고하세요.
pl: Zobacz stronę do kontaktu `Kontakt - Godot <https://godotengine.org/contact>`_.
ru: Смотрите соответствующую страницу на `официальном сайте Godot <https://godotengine.org/contact>`_.
uk: Дивіться відповідну сторінку на `вебсайті Godot <https://godotengine.org/contact>`_.

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ko: 번역 상태
pl: Status tłumaczenia
ru: Статус перевода
uk: Стан перекладу

source: FAQ
de: Häufig gestellte Fragen (FAQ)
es: Preguntas frecuentes
ko: 자주 묻는 질문(FAQ)
ru: Вопросы и ответы

source: Linux
pl: Linuks
