Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
ja: はじめに
ko: 소개
pl: Wprowadzenie
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 前言
zh_tw: 前言

source: Welcome to the official documentation of **Godot Engine**, the free and open source community-driven 2D and 3D game engine! Behind this mouthful, you will find a powerful yet user-friendly tool that you can use to develop any kind of game, for any platform and with no usage restriction whatsoever.
cs: Vítejte v oficiální dokumentaci **Enginu Godot**, svobodném a open-source, komunitou řízeném, 2D a 3D herním enginu! Za tímto textem objevíte mocný, ale uživatelsky přívětivý nástroj, jež můžete použít k vývoji kterékoliv hry, pro jakoukoliv platformu bez zbytečných omezení.
de: Willkommen bei der offiziellen Dokumentation der **Godot Engine**, der freien, quelloffenen und von der Community entwickelten 2D- und 3D-Spiele-Engine! Hinter dieser sperrigen Bezeichnung verbirgt sich ein leistungsstarkes und dennoch benutzerfreundliches Tool, mit dem Sie jede Art von Spiel für jede Plattform und ohne jegliche Nutzungsbeschränkung entwickeln können.
es: Bienvenido a la documentación oficial de Godot Engine, ¡el motor de videojuegos 2D y 3D libre y de código abierto impulsado por la comunidad! Detrás de estas palabras, encontrarás una herramienta poderosa y amigable para el usuario que puedes utilizar para desarrollar cualquier tipo de juego, para cualquier plataforma y sin restricciones de uso de ningún tipo.
fr: Bienvenue sur la documentation officielle de **Godot Engine**, le moteur de développement de jeux vidéos 2D et 3D, Open Source et communautaire ! Derrière ces nombreux qualificatifs, vous allez trouver un outil à la fois puissant et facile à prendre en main, vous permettant de développer tout type de jeu, pour toutes les plateformes et sans aucune limitation d'utilisation.
ja: フリーかつオープンソースで、コミュニティが運営する2D/3Dゲームエンジン Godot Engine の公式ドキュメントにようこそ！この先には、どのようなゲームでも、どんなプラットフォームでも、使用制限がなく開発できる、パワフルでありながらもユーザーフレンドリーなゲームエンジンが待っています。
ko: 커뮤니티 주도 무료 오픈 소스 2D 및 3D 게임 엔진인 Godot 엔진의 공식 문서에 어서 오세요! 다시 말해 Godot 엔진은 아무런 제한 없이 모든 플랫폼으로 모든 종류의 게임을 개발할 수 있는 강력하면서도 사용자 친화적인 도구입니다.
pl: Witaj w oficjalnej dokumentacji **silnika Godot**, darmowego i rozwijanego przez społeczność silnika do tworzenia gier 2D oraz 3D. Za tymi słowami stoi potężne, lecz przyjazne użytkownikowi narzędzie, dzięki któremu możesz stworzyć dowolny rodzaj gry, na dowolną platformę i bez żadnych ograniczeń.
pt_br: Bem-vindo à documentação oficial do **Godot Engine**, o motor de jogo 2D e 3D de código aberto e gratuito voltado para a comunidade! Por trás disso tudo, você encontrará uma ferramenta poderosa e de fácil utilização que você pode usar para desenvolver qualquer tipo de jogo, para qualquer plataforma e sem nenhuma restrição de uso.
ru: Добро пожаловать в официальную документацию **Godot Engine**, свободного и открытого игрового движка для 2D и 3D игр! За этим словом скрывается мощный, но удобный инструмент, который можно использовать для разработки любых игр, для любых платформ и без каких-либо ограничений на использование.
uk: Ласкаво просимо до офіційної документації **Godot Engine**, безкоштовного та відкритого ігрового движка 2D та 3D, який розвивається спільнотою! За цим багатослів'ям ви знайдете потужний, але простий у використанні інструмент, який ви можете використовувати для розробки будь-якої гри, для будь-якої платформи і без будь-яких обмежень використання.
zh_cn: 欢迎使用 **Godot 引擎**\ 的官方文档，这是一款自由开源、由社区驱动的 2D 和 3D 游戏引擎！在学习了本文档之后，你将发现一款功能强大并且对于使用者十分友好的工具，它可以用来为任何平台开发任何类型的游戏，并且没有任何使用限制。
zh_tw: 歡迎來到官方 Godot Engine 說明手冊。Godot 是一個由社群開發、自由開源的 2D 與 3D 遊戲引擎！在接下來等著你的是強大而友好的工具，這個工具能用來為任何平台開發所有種類的遊戲，且沒有任何使用限制。

source: This page gives a broad overview of the engine and of this documentation, so that you know where to start if you are a beginner or where to look if you need information on a specific feature.
cs: Tato stránka se zaměřuje na širší prezentaci enginu a této dokumentace, abyste věděli kde začít pokud jste začátečník nebo kam se podívat, pokud potřebujete informace o konkrétní funkci.
de: Diese Seite gibt einen umfassenden Überblick über die Engine und diese Dokumentation, so dass Sie als Anfänger erfahren, wo Sie anfangen sollten oder wo Sie nachschauen können, wenn Sie Informationen zu einem bestimmten Feature benötigen.
es: Esta página pretende dar una presentación amplia del motor y de la documentación, para que saber por dónde empezar si eres un principiante o dónde mirar si necesitas información de una característica específica.
fr: Cette page vous donne une vue d'ensemble du moteur et de cette documentation, pour que vous puissiez savoir où débuter ou pour trouver des détails sur une fonctionnalité en particulier.
ja: このページでは、Godot EngineとGodot Engineドキュメントの大まかな概要を説明します。初心者の方はどこから始めればいいのか、特定の機能に関する情報が必要な場合はどこを見ればいいのかがわかるようになっています。
ko: 이 페이지는 엔진과 이 문서의 내용에 대해 광범위하게 소개하므로 초보자가 어디서부터 시작해야 하는지 또는 특정 기능에 대한 정보가 필요한 경우에 어디에서 찾아야 하는지 알 수 있습니다.
pl: Ta strona przedstawia obszerny opis możliwości silnika oraz zawartości dokumentacji. Dzięki temu dowiesz się od czego zacząć, jeśli jesteś początkujący, lub gdzie szukać informacji, jeśli potrzebujesz wiedzy na konkretny temat.
pt_br: O objetivo dessa página é fornecer uma ampla apresentação da engine e do conteúdo desta documentação, para que você saiba por onde começar se for um iniciante, ou onde procurar se precisar de informações sobre uma funcionalidade específica.
ru: На этой странице даётся общий обзор движка и данной документации, чтобы вы знали, с чего начать, если вы новичок, или где искать информацию по конкретной функции.
uk: Ця сторінка надає загальний огляд двигуна та цієї документації, щоб ви знали, з чого почати, якщо ви новачок, або де шукати інформацію про певну функцію, якщо вам потрібно.
zh_cn: 本页提供了引擎和文档的概述，如果你是初学者，它能让你知道从哪里开始，或者需要关于特定功能的信息，应该从哪里着手。
zh_tw: 本頁簡單介紹了 Godot 與本文件的內容，讓初學者瞭解從何開始，也讓只是想找找特定功能的人能快速找到方向。

source: Before you start
cs: Předtím než začnete
de: Bevor es losgeht
es: Antes de comenzar
fr: Avant de commencer
ja: 始める前に
ko: 시작하기에 앞서
pl: Zanim zaczniesz
pt_br: Antes de você começar
ru: Прежде чем начать
uk: Перед початком
zh_cn: 在开始之前
zh_tw: 開始之前

source: The :ref:`Tutorials and resources <doc_community_tutorials>` page lists video tutorials contributed by the community. If you prefer video to text, consider checking them out. Otherwise, :ref:`Getting Started <doc_getting_started_intro>` is a great starting point.
cs: Stránka :ref:`Návody a zdroje <doc_community_tutorials>` obsahuje video návody vytvořené členy komunity. Preferujete-li video tutoriály namísto psaných, zvažte jejich vyzkoušení. Jinak, :ref:`Začínáme <doc_getting_started_intro>` je dobrý startovní bod.
de: Die Seite :ref:`Tutorials und Ressourcen <doc_community_tutorials>` enthält von der Community erstellte Video-Tutorials. Wenn Sie Video- statt Textanleitungen bevorzugen, schauen Sie sich diese gern an. Ansonsten ist die Seite :ref:`Erste Schritte <doc_getting_started_intro>` ein guter Startpunkt.
es: La página :ref:`Tutoriales y recursos <doc_community_tutorials>` enlista videotutoriales hechos por la comunidad. Si prefieres videos antes que texto, considera echarles un vistazo. De otra manera, la sección :ref:`Comenzando<doc_getting_started_intro>` es un gran punto de partida.
fr: La page :ref:`tutoriels et ressources <doc_community_tutorials>` liste les tutoriels vidéos réalisés par la communauté. Si vous préférez la vidéo au texte, jetez-y un coup d’œil. Autrement, :ref:`Bien débuter <sec-learn>` est bon point de départ.
ja: \ :ref:`チュートリアルとリソース <doc_community_tutorials>`\ ページには、コミュニティから提供されたビデオチュートリアルがリストされています。テキストよりもビデオのほうが良いと思う方はこちらもご覧ください。もしくは、\ :ref:`Getting Started <doc_getting_started_intro>`\ が良いスタート地点になるでしょう。
pt_br: A página :ref:`Tutoriais e recursos <doc_community_tutorials>` lista tutoriais em vídeo fornecidos pela comunidade. Se você preferir vídeo em vez de texto, pode valer a pena dar uma olhada. Do contrário, :ref: `Primeiros passos <sec-learn>` é um ótimo ponto de partida.
ru: Страница :ref:`Уроки и ресурсы <doc_community_tutorials>` содержит список видеоуроков, предоставленных сообществом. Если вы предпочитаете видео тексту, возможно, вам стоит обратить на них внимание. Еще одна прекрасная точка для старта — :ref:`Getting Started <doc_getting_started_intro>`.
uk: На сторінці :ref:`Уроки та ресурси <doc_community_tutorials>` перелічено відеоуроки, створені спільнотою. Якщо ви надаєте перевагу відео, а не тексту, перегляньте їх. В іншому випадку, :ref:`Початок роботи <doc_getting_started_intro>` є чудовою відправною точкою.
zh_cn: :ref:`教程与资源 <doc_community_tutorials>`\ 页列出了由社区贡献的视频教程。如果你更喜欢视频而非文本，这些可能值得一看。否则，参考 :ref:`入门 <doc_getting_started_intro>`\ 会是一个很好的起点。
zh_tw: 如果你不習慣看文字而比較習慣看影片的話，不妨看一下 :ref:`《教學與資源》 <doc_community_tutorials>` 中由社群成員貢獻的影片教學。如果你習慣看文字， :ref:`開始 <doc_getting_started_intro>` 會是學習 Godot 不錯的起點。

source: About Godot Engine
cs: O Godot Engine
de: Über die Godot Engine
es: Acerca de Godot
fr: À propos de Godot Engine
ja: Godot Engine について
ko: Godot 엔진에 대하여
pl: O silniku Godot
pt_br: Sobre o Godot Engine
ru: О Godot Engine
uk: Про Godot Engine
zh_cn: 关于 Godot 引擎
zh_tw: 關於 Godot Engine

source: A game engine is a complex tool and difficult to present in a few words. Here's a quick synopsis, which you are free to reuse if you need a quick write-up about Godot Engine:
cs: Herní engine je komplexní nástroj, a proto je těžké představit jej pár slovy. Zde je krátký přehled, který můžete volně použít, chcete-li rychle popsat Godot Engine:
de: Eine Spiele-Engine ist ein komplexes Tool, das sich nur schwer in ein paar Worten beschreiben lässt. Hier ist eine kurze Zusammenfassung, die Sie gerne wiederverwenden können, wenn Sie einen kurzen Bericht über die Godot Engine benötigen:
es: Un motor de juego es una herramienta compleja, y por lo tanto es difícil presentar a Godot en pocas palabras. Aquí hay una rápida sinopsis, que eres libre de reutilizar si necesitas una breve reseña sobre Godot Engine:
fr: Un moteur de jeu est un outil complexe, et il est donc difficile de présenter Godot en quelques mots. Voici cependant notre présentation officielle, que vous êtes libre de réutiliser si vous avez besoin d'une présentation rapide de Godot Engine:
ja: ゲームエンジンは複雑なツールのため、少ない言葉でGodotを表現するのは難しいことです。こちらが短い説明です。Godotについて軽く紹介する必要があればご自由に利用してください。
ko: 게임 엔진은 복잡한 도구라 Godot를 몇 마디로 표현하기는 어렵습니다. 다음은 Godot 엔진에 대한 간단한 설명이 필요한 경우 자유롭게 쓸 수 있는 간단한 소개글이 있습니다:
pl: Silnik do gier to złożone narzędzie, które trudno opisać w kilku słowach. Poniżej podajemy krótkie podsumowanie, z którego możesz swobodnie korzystać, jeśli chcesz szybko przedstawić czym jest Silnik Godot:
pt_br: Um motor de jogos (game engine) é uma ferramenta complexa e difícil de apresentar em poucas palavras. Aqui está uma sinopse simples, que você pode utilizar sempre que precisar de uma definição rápida sobre Godot Engine:
ru: Игровой движок - это сложный инструмент, который трудно представить в нескольких словах. Вот краткий обзор, который вы можете использовать, если вам нужно быстро написать о Godot Engine:
uk: Ігровий рушій є складним інструментом, і тому важко описати Godot кількома словами. Тут невелике резюме, яке ви можете вільно використовувати, якщо вам потрібний короткий опис Godot Engine:
zh_cn: 游戏引擎是个复杂的工具，因此很难用三言两语介绍完。这是一篇简短的概要，如果你想快速写一篇关于 Godot Engine 的文章，你可以自由复用：
zh_tw: 遊戲引擎是一個複雜的工具，也很難用三言兩語來介紹 Godot。這裡提供了一個簡介，當需要介紹 Godot Engine 時可以任意使用:

source: Godot Engine is a feature-packed, cross-platform game engine to create 2D and 3D games from a unified interface. It provides a comprehensive set of common tools, so that users can focus on making games without having to reinvent the wheel. Games can be exported with one click to a number of platforms, including the major desktop platforms (Linux, macOS, Windows), mobile platforms (Android, iOS), as well as Web-based platforms and consoles.
cs: Godot Engine je mutiplatformní herní engine plný nástrojů pro tvorbu 2D a 3D her v jednotném prostředí. Obsahuje komplexní balíček běžných nástrojů, díky kterému se uživatel může soustředit na tvorbu her bez nutnosti vytvářet vše od začátku. Hry lze exportovat jedním kliknutím na spoustu různých platforem, obsahující hlavní desktopové platformy (Linux, macOS, Windows), mobilní (Android, iOS), stejně jako webové (HTML5) platformy a konzole.
de: Die Godot Engine ist eine funktionsreiche, plattformübergreifende Spiele-Engine zur Erstellung von 2D- und 3D-Spielen über eine einheitliche Oberfläche. Sie bietet einen umfassenden Satz gemeinsamer Tools, sodass sich die Benutzer auf die Erstellung von Spielen konzentrieren können, ohne das Rad neu erfinden zu müssen. Spiele können mit einem Klick auf eine Reihe von Plattformen exportiert werden, darunter die wichtigsten Desktop-Plattformen (Linux, macOS, Windows), mobile Plattformen (Android, iOS), sowie webbasierte Plattformen und Konsolen.
es: Godot Engine es un motor de videojuegos repleto de funciones, multiplataforma con múltiples características para crear juegos 2D y 3D desde una interfaz unificada. Provee un conjunto exhaustivo de herramientas comunes para que los usuarios puedan enfocarse en crear juegos sin tener que reinventar la rueda. Los juegos pueden exportarse en un sólo clic a numerosas plataformas, incluyendo las principales plataformas de escritorio (Linux, macOS, Windows), móviles (Android, iOS) y basadas en la web (HTML5).
fr: Godot Engine est un moteur de jeu multi-plateforme riche en fonctionnalités pour créer des jeux 2D et 3D à partir d'une interface unifiée. Il fournit une série d'outils usuels afin que les utilisateurs puissent se concentrer sur la création de jeux sans avoir à réinventer la roue. Les jeux peuvent être exportés en un seul clic vers un grand nombre de plateformes, incluant les principales plateformes pour ordinateurs de bureau (Linux, macOS, Windows) ainsi que mobiles (Android, iOS) et web (HTML5).
ja: Godotエンジンは機能豊富な、クロスプラットフォームのゲームエンジンであり、2D・3Dゲームを単一のインターフェイスで製作することができます。基本的なツールは一通り用意され、ユーザーはプログラムの再発明をすることなくゲーム製作に集中できます。製作したゲームは主要なデスクトップ環境(Linux, MacOS, Windows)や、モバイル(Android, iOS)、Webベース(HTML5)環境にワンクリックで書き出せます。
ko: Godot 엔진은 통합 인터페이스로 2D 및 3D 게임을 만들 수 있는, 다양한 기능이 있는 크로스 플랫폼 게임 엔진입니다. 이 엔진은 사용자가 바퀴부터 재발명할 필요 없이 게임 만들기에 집중할 수 있도록 일반적인 도구를 제공합니다. 만든 게임은 클릭 한 번으로 주요 데스크톱 플랫폼(Linux, macOS, Windows)은 물론 모바일(Android, iOS) 및 웹 기반(HTML5) 플랫폼으로 내보낼 수 있습니다.
pl: Silnik Godot to rozbudowany, wieloplatformowy silnik do tworzenia gier 2D i 3D z poziomu ujednoliconego interfejsu. Dzięki kompleksowemu zestawowi narzędzi, użytkownicy mogą skupić się na tworzeniu gier, bez konieczności odkrywania na nowo Ameryki. Ponadto, za pomocą jednego kliknięcia możesz wyeksportować projekt na wiele platform, w tym na najpopularniejsze systemy na komputery stacjonarne (Linux, macOS, Windows) i mobilne (Android i iOS), jak również platformę webową (HTML5).
pt_br: Godot Engine é um motor de jogos multiplataforma repleto de recursos para criar jogos 2D e 3D a partir de uma interface unificada. Ele fornece um conjunto abrangente de ferramentas comuns para que os usuários possam se concentrar em criar jogos sem precisar reinventar a roda. Os jogos podem ser exportados num clique para várias plataformas, incluindo as principais plataformas de desktop (Linux, macOS, Windows), plataformas móveis (Android, iOS), as baseadas na Web e também consoles.
ru: Godot Engine — это многофункциональный кроссплатформенный игровой движок для создания 2D- и 3D-игр с единым интерфейсом. Он предоставляет полный набор общих инструментов, поэтому пользователи могут сосредоточиться на создании игр без необходимости изобретать велосипед. Игры можно экспортировать одним щелчком мыши на ряд платформ, включая основные настольные платформы (Linux, macOS, Windows), мобильные платформы (Android, iOS), а также веб-платформы и консоли.
uk: Godot Engine - це багатофункціональний кросплатформний рушій для створення 2D та 3D ігор з єдиним інтерфейсом. Він надає повний набір загальних інструментів, щоб користувачі могли зосередитися на створенні ігор без необхідності винаходити велосипед. Ігри можна експортувати одним клацанням миші на низку платформ, включаючи основні настільні платформи (Linux, macOS, Windows), мобільні платформи (Android, iOS), а також веб-платформи та консолі.
zh_cn: Godot 引擎是一款功能丰富的跨平台游戏引擎，可以通过统一的界面创建 2D 和 3D 游戏。它提供了一套全面的通用工具，因此用户可以专注于制作游戏，而无需重新发明轮子。游戏可以一键导出到多个平台，包括主流的桌面平台（Linux、macOS、Windows）、移动平台（Android、iOS）、基于 Web 的平台以及主机平台。
zh_tw: Godot Engine 是一個功能豐富且跨平台的工具，可用一致的界面來創造 2D 與 3D 遊戲。Godot 提供了完整的一套通用工具，讓使用者能專注於製作遊戲，而不需重造輪子。只需按一個鍵就能將遊戲匯出至數種平台，包含主流桌面平台 (Linux, macOS, Windows)、行動平台 (Android, iOS)，以及網頁 (HTML5) 平台。

source: Godot is completely free and open source under the :ref:`permissive MIT license <doc_complying_with_licenses>`. No strings attached, no royalties, nothing. Users' games are theirs, down to the last line of engine code. Godot's development is fully independent and community-driven, empowering users to help shape their engine to match their expectations. It is supported by the `Godot Foundation <https://godot.foundation/>`_ not-for-profit.
cs: Godot je zcela zdarma a open source engine, který spadá pod :ref:` svobodnou MIT licenci <doc_complying_with_licenses>`. Bez závazků, žádné poplatky, nic. Hry patří těm co je vytvořili až po poslední řádku zdrojového kódu. Vývoj Godot Enginu je plně nezávislý a komunitně řízený, dávající uživatelům možnost upravit si engine tak, aby splnil jejich očekávání. Je podporován organizací `Godot Foundation <https://godot.goundation/.>`_ bezúplatně.
de: Godot ist völlig frei und quelloffen unter der :ref:`freizügigen MIT-Lizenz <doc_complying_with_licenses>`. Keine Bedingungen, keine Lizenzgebühren, nichts. Die Spiele der Benutzer gehören ihnen, bis hin zur letzten Zeile des Engine-Codes. Die Entwicklung von Godot ist völlig unabhängig und wird von der Community vorangetrieben, so dass die Benutzer die Möglichkeit haben, die Engine nach ihren Vorstellungen zu gestalten. Sie wird von der gemeinnützigen `Godot Foundation <https://godot.foundation/>`_ unterstützt.
es: Godot es completamente libre y de código abierto bajo la licencia permisiva MIT (Licencia del Instituto Tecnológico de Massachusetts). Sin condiciones, sin regalías, nada. Los juegos de los usuarios son suyos, hasta la última línea de código del motor. El desarrollo de Godot es totalmente independiente y dirigido por la comunidad, lo que permite a los usuarios ayudar a dar forma a su motor para que coincida con sus expectativas. Está respaldado por `Software Freedom Conservancy <https://sfconservancy.org>`_ sin fines de lucro.
fr: Godot est complètement libre et open source sous la très permissive licence MIT. Sans conditions liées, sans royalties, rien. Les jeux des utilisateurs sont les leurs, jusqu'à la dernière ligne de code du moteur. Le développement de Godot est totalement indépendant et piloté par sa communauté, ce qui donne la possibilité aux utilisateurs d'aider à façonner leur moteur pour le faire correspondre à leurs attentes. Il est soutenu par la fondation à but non lucratif `Godot Foundation <https://godot.foundation/>`_.
ja: Godot はMITライセンスの下、完全に自由でオープンソースです。利用に関して特に制限はありませんし、利用料を請求することもありません。エンジンのコードの最後の一行まで、ゲームは製作したユーザーのものです。Godot は自主的なコミュニティによって開発されており、エンジンを期待にかなうものにするため、ユーザーの方々も自由に参加できます。Godot は非営利団体 `Software Freedom Conservancy <https://sfconservancy.org>`_ によって支援されております。
ko: Godot는 완전 무료이며, 아주 관대한 MIT 라이선스로 배포되는 오픈 소스입니다. 다른 조건, 로열티 요구, 그 아무것도 없습니다. 사용자가 만든 게임은 엔진 코드의 마지막 줄까지 사용자의 것입니다. Godot 개발은 독립적이고 커뮤니티 주도로 이루어지기 때문에 사용자들의 바람대로 엔진이 개발될 수 있도록 힘을 실어 줍니다. Godot는 `소프트웨어 자유 단체 <https://sfconservancy.org>`_\ 로부터 비영리 운영 지원을 받습니다.
pl: Godot jest całkowicie wolnym i otwartym oprogramowaniem na :ref:`bardzo liberalnej licencji MIT <doc_complying_with_licenses>`. Bez zobowiązań, opłat i niczego podobnego. Gry stworzone przez użytkowników są ich własnością, aż do ostatniej linii kodu silnika. Rozwój Godota jest w pełni niezależny i napędzany przez społeczność, dając użytkownikom możliwość modyfikacji silnika tak, aby spełniał ich oczekiwania. Jest on wspierany przez `Fundację Godota <https://godot.foundation/>`_ działającą nie-dla-zysku.
pt_br: Godot é completamente gratuito e de código aberto sob a :ref:`permissiva licença MIT <doc_complying_with_licenses>`. Sem amarras, sem royalties, nada. Os jogos dos usuários são deles até a última linha do código da engine. O desenvolvimento do Godot é totalmente independente e voltado para a comunidade, capacitando os usuários a ajudar a moldar sua engine para atender às suas expectativas. Ele é mantido pela `Godot Foundation <https://godot.foundation/>`_ sem fins lucrativos.
ru: Godot полностью бесплатен и распространяется на условиях :ref:`пермиссивной лицензии MIT <doc_complying_with_licenses>`. Никаких скрытых условий, роялти, ничего подобного. Игры пользователей принадлежат им полностью, вплоть до последней строки кода движка. Развитие Godot полностью независимо и ориентировано на сообщество, давая пользователям возможность влиять на развитие движка согласно своим ожиданиям. Оно поддерживается `Фондом Godot <https://godot.foundation/>`_, который является некоммерческой организацией.
uk: Godot є повністю безкоштовним і має відкритий вихідний код під :ref:`дозвільнювальною ліцензією MIT <doc_compliant_with_licenses>`. Ніяких зобов'язань, ніяких роялті, нічого. Ігри користувачів належать їм, аж до останнього рядка коду рушія. Розробка Godot є повністю незалежною та керованою спільнотою, що дозволяє користувачам допомагати формувати рушій відповідно до їхніх очікувань. Він підтримується неприбутковою організацією `Godot Foundation <https://godot.foundation/>`_.
zh_cn: Godot 在 :ref:`宽松的 MIT 许可证 <doc_complying_with_licenses>` 下完全自由且开源，没有附加条件、没有抽成、什么都没有。用户的游戏乃至引擎的每一行代码，都归用户自己所有。Godot 的开发完全独立且由社区驱动，允许用户为满足需求重塑引擎。它受到不以盈利为目标的 \ `Godot 基金会 <https://godot.foundation/>`_\ 支持。
zh_tw: Godot 完全自由且開放原始碼，使用寬鬆的 MIT 授權條款。沒有附加條款、沒有授權費，亦沒有其他要求。包含引擎的任何程式碼，使用者的遊戲都是屬於使用者自己的。Godot 由社群領導，完全獨立開發，使用者可以為了自己的需求來改進引擎。Godot 引擎由非營利組織 `Software Freedom Conservancy <https://sfconservancy.org>`_ 支援。

source: Organization of the documentation
cs: Uspořádání této dokumentace
de: Aufbau der Dokumentation
es: Organización de la documentación
fr: Organisation de la documentation
ja: ドキュメントの構成
ko: 문서의 구성
pl: Organizacja dokumentacji
pt_br: Organização da documentação
ru: Структура документации
uk: Організація документації
zh_cn: 文档结构
zh_tw: 說明文件架構

source: This documentation is organized into several sections:
cs: Tato dokumentace je uspořádána do několika sekcí:
de: Diese Dokumentation ist in verschiedene Abschnitte unterteilt:
es: Esta documentación se organiza en varias secciones:
fr: Cette documentation est organisée en plusieurs rubriques:
ja: このドキュメントは様々なセクションに分かれています：
ko: 이 문서는 여러 단락으로 구성되어 있습니다:
pl: Ta dokumentacja jest podzielona na kilka sekcji:
pt_br: Esta documentação é organizada em várias seções:
ru: Эта документация поделена на несколько разделов:
uk: Ця документація складається з кількох розділів:
zh_cn: 本文档分为几个部分：
zh_tw: 這份文件分為幾個部分：
