Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: **About** contains this introduction as well as information about the engine, its history, its licensing, authors, etc. It also contains the :ref:`doc_faq`.
cs: **O Aplikaci** obsahuje tento úvod a také informace o enginu, jeho historii, jeho licencích, autorech atd. Dále obsahuje také :ref:`doc_faq`.
de: **Über** enthält diese Einführung sowie Informationen über die Engine, ihre Geschichte, ihre Lizenzierung, ihre Autoren usw. Es enthält auch die :ref:`doc_faq`.
es: **Acerca de** contiene esta introducción, así como información sobre el motor, su historia, licencia, autores, etc. También contiene la seción :ref:`Preguntas Frecuentes doc_faq`.
fr: La section :ref:`sec-general` contient cette introduction ainsi que des informations concernant le moteur, son histoire, son modèle de licence, ses auteurs, etc. Elle contient également les :ref:`doc_faq`.
ja: \ :ref:`sec-general`\ セクションは、歴史、ライセンス、作者などのゲームエンジンの概要と紹介をしています。また、\ :ref:`doc_faq`\ も含んでいます。
ko: **About** 은 소개글 및 엔진에 대한 정보, 그 역사, 라이센스, 제작자 등에 대한 것들을 담고 있습니다. 여기에는 또한 :ref:`doc_faq` 도 포함하고 있습니다.
pl: **O** zawiera to wprowadzenie, jak również informacje o silniku, jego historii, licencji, autorach, itd. Zawiera również :ref:`Często Zadawane Pytania <doc_faq>`.
pt_br: **Sobre** contém esta introdução, bem como informações sobre a engine, sua história, seu licenciamento, autores, etc. Também contém o :ref:`doc_faq`.
ru: **О разделе** содержит данное введение, а также информацию о движке, его истории, лицензировании, авторах и т. д. В нем также содержится :ref:`doc_faq`.
uk: **Про** містить цей вступ, а також інформацію про рушій, його історію, ліцензування, авторів тощо. Він також містить :ref:`doc_faq`.
zh_cn: **关于** 包含了此简介以及有关引擎，历史，许可，作者等的信息。它还包含 :ref:`doc_faq`\ 。
zh_tw: :ref:`sec-general` 章節包含了這段簡介與 Godot 的相關資訊與歷史、授權條款，以及作者的資訊等。其中也包含了 :ref:`doc_faq`。

source: **Getting Started** contains all necessary information on using the engine to make games. It starts with the :ref:`Step by step <toc-learn-step_by_step>` tutorial which should be the entry point for all new users. **This is the best place to start if you're new!**
cs: **Začínáme** obsahuje všechny pořebné informace o použití enginu kw tvorbě her. Začíná manuálem :ref:`Krok za krokem <toc-learn-step_by_step>` , který by měl být vstupním bodem pro všechny nové uživatele. **Toto je nejlepší místo ke startu pokud jste tu nově!**
de: **Erste Schritte** enthält alle notwendigen Informationen zur Verwendung der Engine, um Spiele zu entwickeln. Es beginnt mit dem :ref:`Schritt für Schritt <toc-learn-step_by_step>`-Tutorial, das der Einstiegspunkt für alle neuen Benutzer sein sollte. **Das ist der beste Ort, um anzufangen, wenn Sie neu dabei sind!**
es: **Primeros Pasos** contiene toda la información necesaria sobre cómo usar el motor para desarrollar juegos. Comienza con el tutorial :ref:`Paso a paso <toc-learn-step_by_step>` que debería ser el punto de partida para todos los usuarios nuevos. **Este es el mejor lugar para empezar si eres nuevo!**
fr: **Prise en main** possède toutes les informations nécessaires à l'utilisateur du moteur pour faire des jeux. Elle commence avec le tutoriel :ref:`Step by step <toc-learn-step_by_step>` qui devrait être le point d'entrée de tous les nouveaux utilisateurs. **C'est le meilleur endroit pour débuter si vous êtes nouveau!**
ja: :ref:`sec-learn`\ セクションは、このドキュメントの主な\ *存在意義*\ で、エンジンを使ってゲームを作るのに必要なすべての情報が入っています。それは、:ref:`ステップバイステップ <toc-learn-step_by_step>`\ から始まるこれらのチュートリアルは、すべての新規ユーザーのための入り口です。**ここから始めることをお勧めします！**
ko: :ref:`sec-learn` 섹션은 이 문서의 주된 *존재 이유*\ 로, 이 엔진을 사용해 게임을 만드는 데 필요한 모든 정보를 담고 있습니다. 새로운 사용자 모두의 출발점이 되는 :ref:`단계별 <toc-learn-step_by_step>` 튜토리얼로 시작합니다. **새로 입문하는 사람들에게 추천드립니다!**
pl: **Rozpoczynanie** zawiera wszystkie konieczne informacje o używaniu tego silnika do tworzenia gier. Zaczyna się od poradnika :ref:`Krok po kroku <toc-learn-step_by_step>`, który powinien być punktem wyjścia dla wszystkich nowych użytkowników. **To jest najlepsze miejsce na początek jeśli jesteś nowy!**
pt_br: **Primeiros Passos** contém todas as informações necessárias sobre como usar a engine para fazer jogos. Ele começa com o tutorial :ref:`Passo-a-passo <toc-learn-step_by_step>` que deve ser o ponto de entrada para todos os novos usuários. **Este é o melhor lugar para começar se você é novo!**
ru: **Начало работы** содержит всю необходимую информацию по использованию движка для создания игр. Он начинается с руководства под названием :ref:`Шаг за шагом <toc-learn-step_by_step>`, который должен стать отправной точкой для всех новых пользователей.**Если вы новичок - это лучшее место, чтобы начать!**
uk: **Початок роботи** містить усю необхідну інформацію про використання рушія для створення ігор. Він починається з :ref:`Крок за кроком <toc-learn-step_by_step>` підручника, який має стати відправною точкою для всіх нових користувачів. **Це найкраще місце для початку, якщо ви новачок!**
zh_cn: **入门** 包含了有关使用引擎制作游戏的所有必要信息。它从 :ref:`渐进式<toc-learn-step_by_step>` 教程开始，这应该是所有新用户的切入点。\ **如果你是新手，这是最好的起点！**
zh_tw: :ref:`sec-learn` 章節是這份文件的主要 **存在意義** ，包含了所有用 Godot 製作遊戲所需的資訊。開頭的 :ref:`按部就班 <toc-learn-step_by_step>` **教學可以讓所有新使用者作為學習的起點!**

source: The **Manual** can be read or referenced as needed, in any order. It contains feature-specific tutorials and documentation.
cs: **Manuály** lze číst podle potřeby v libovolném pořadí. Obsahuje návody, specifické pro jednotlivé funkce a dokumentaci.
de: Das **Handbuch** kann je nach Bedarf in beliebiger Reihenfolge gelesen oder referenziert werden. Es enthält featurespezifische Tutorials und Dokumentationen.
es: El **Manual** se puede consultar cuando sea necesario, en cualquier orden. Contiene varios tutoriales y la documentación específica para cada característica.
fr: Le **Manuel** peut être lu et cité au besoin et dans n'importe quel ordre. Il contient la documentation et les tutoriels centrés de manière spécifique sur les fonctionnalités du moteur.
ja: \ :ref:`sec-tutorials` セクションは、好きな順番で必要に応じて読むことができます。Godotの様々な機能個別の詳しい説明とチュートリアルを読むことができます。
ko: :ref:`sec-tutorials` 섹션은 순서 상관없이 필요에 따라 읽을 수 있습니다. 이 섹션에는 기능별 튜토리얼 및 문서들이 있습니다.
pl: **Poradnik** może być czytany lub sprawdzany w miarę potrzeby, w dowolnej kolejności. Zawiera poradniki i dokumentację do konkretnych funkcjonalności.
pt_br: O **Manual** pode ser lido ou referenciado conforme necessário, em qualquer ordem. Ele contém tutoriais e documentação específicas de recursos.
ru: Секцию :ref:`sec-tutorials` можно читать по мере необходимости, в любом порядке. Она содержит руководства и документацию по конкретным возможностям движка.
uk: Посібник** можна читати або посилатися на нього за потреби в будь-якому порядку. Він містить навчальні посібники та документацію для конкретних функцій.
zh_cn: **手册** 可根据需要以任何顺序阅读或参考。它包含特定功能的教程和文档。
zh_tw: :ref:`sec-tutorials` 章節可依照需求用任何順序來閱讀。本章包含各功能的教學與文件。

source: **Contributing** gives information related to contributing to Godot, whether to the core engine, documentation, demos or other parts. It describes how to report bugs, how contributor workflows are organized, etc. It also contains sections intended for advanced users and contributors, with information on compiling the engine, contributing to the editor, or developing C++ modules.
cs: **Přispějte** poskytuje informace související s přispíváním do Godotu, ať už do jádra enginu, dokumentace, ukázek nebo jiných částí. Popisuje, jak nahlašovat chyby, jak jsou organizovány pracovní postupy přispěvatelů, atd. Obsahuje také sekce určené pro pokročilé uživatele a přispěvatele s informacemi o kompilaci enginu, přispívání do editoru nebo vývoji modulů C++.
de: **Mitwirken** bietet Informationen zum Mitwirken an Godot, sei es zur Kern-Engine, Dokumentation, Demos oder anderen Teilen. Es beschreibt, wie man Fehler meldet, wie die Workflows für Mitwirkende organisiert sind, usw. Es enthält auch Abschnitte, die für fortgeschrittene Nutzer und Mitwirkende gedacht sind, mit Informationen zur Kompilierung der Engine, zum Mitwirken an der Entwicklungsumgebung oder zur Entwicklung von C++-Modulen.
es: **Contribuyendo** entrega información relacionada a como contribuir a Godot, ya sea el motor principal, documentación, demos, o otras partes. Describe cómo reportar errores, como está organizado los flujos de trabajo, etc. También contiene secciones enfocadas en usuarios avanzados y colaboradores, con información sobre cómo compilar el motor, contribuir al editor o desarrollo en C++.
fr: **Contribution** donne des informations au sujet de la contribution à godot, que ce soit pour le moteur de jeux, la documentation, les démos ou d'autre choses. Elle décrit comment signaler des bugs, comment le déroulement du travail est organisé, etc. Elle contient aussi des sections faites pour les utilisateurs et contributeurs avancés, avec des information sur la compilation du moteur de jeu, la contribution à l'éditeur, ou le développement de modules en C++.
ja: \ :ref:`sec-contributing` では、Godotの開発貢献に関する情報が含まれており、コアエンジン、ドキュメント、デモなどの情報が含まれています。バグの報告方法や貢献者のワークフローの構成等のことが書かれており、さらに、パワーユーザーや貢献者のためのゲームエンジンのコンパイル、エディタの開発、C++モジュール開発の情報が書かれたセクションがあります。
ko: **기여하기**에서는 핵심 엔진, 문서, 데모 또는 기타 부분 등 고도에 기여하는 것과 관련된 정보를 제공합니다. 버그 보고 방법, 기여자 워크플로우 구성 방법 등을 설명합니다. 또한 고급 사용자와 기여자를 위한 섹션도 포함되어 있으며, 엔진 컴파일, 에디터 기여 또는 C++ 모듈 개발에 대한 정보를 제공합니다.
pl: **Współtworzenie** podaje informacji odnośnie współtworzenia Godota, czy to samego silnika, czy dokumentacji, demonstracji i innych elementów. Opisuje jak zgłaszać błędy, jak współtworzenie jest organizowane, itd. Zawiera również rozdziały dla zaawansowanych użytkowników i współtwórców, z informacjami o kompilowaniu silnika, modyfikowaniu edytora, czy rozwijaniu modułów C++.
pt_br: **Contribuindo** fornece informações relacionadas à contribuição para Godot, seja no núcleo da engine, documentação, demonstrações ou outras partes. Ele descreve como relatar bugs, como os fluxos de trabalho dos contribuidores são organizados, etc. Ele também contém seções destinadas a usuários e contribuidores avançados, com informações sobre como compilar a engine, contribuir para o editor ou desenvolver módulos C++.
ru: **Содействие** предоставляет информацию, связанную с внесением вклада в Godot, будь то в ядро движка, документацию, демонстрационные примеры или другие компоненты. В нем описывается, как сообщать о багах, как организованы рабочие процессы для участников, и так далее. Также здесь содержатся разделы, предназначенные для опытных пользователей и участников, с информацией о компиляции движка, внесении вклада в редактор или разработке модулей на C++.
uk: **Сприяння** містить інформацію, пов'язану зі сприянням розвитку Godot, чи то ядра рушія, документації, демо-версій чи інших частин. Тут описано, як повідомляти про вади, як організовано робочий процес дописувачів тощо. Він також містить розділи, призначені для досвідчених користувачів та дописувачів, з інформацією про компіляцію рушія, роботу з редактором або розробку модулів на C++.
zh_cn: **贡献** 提供了向Godot贡献相关的信息 ，无论是核心引擎、文档、 demo 还是其他部分。 它描述了如何报告 bug ，如何组织贡献者工作流等。 它还包含面向高级用户和贡献者的部分， 提供有关编译引擎的信息，为编辑器做出贡献， 或开发C++模块。
zh_tw: **貢獻** 提供了向Godot貢獻相關的資訊 ，無論是核心引擎、文件、 demo 還是其他部分。它描述了如何報告 bug ，如何組織貢獻者工作流等。它還包含面對高級使用者和貢獻者的部分， 提供有關編譯引擎的資訊，為編輯器做出貢獻， 或開發C++模組。

source: **Community** is dedicated to the life of Godot's community. It points to various community channels like the `Godot Contributors Chat <https://chat.godotengine.org/>`_ and `Discord`_ and contains a list of recommended third-party tutorials and materials outside of this documentation.
cs: Sekce **Komunita** je věnována životu komunity enginu Godot. Odkazuje na různé komunitní kanály jako `Godot Contributors Chat <https://chat.godotengine.org/>` _, `Discord` _ a také obsahuje seznam doporučených návodů a materiálů třeítch stran, které jsou mimo tuto dokumentaci.
de: **Community** ist dem Leben der Godot-Community gewidmet. Sie verweist auf verschiedene Community-Kanäle wie den `Godot Mitwirkenden-Chat <https://chat.godotengine.org/>`_, und `Discord`_ und enthält eine Liste empfohlener Tutorials und Materialien von Drittanbietern außerhalb dieser Dokumentation.
es: La sección :ref:`Comunidad sec-community` provee información relacionada con la contribución al desarrollo del motor y la vida de su comunidad. Por ejemplo, cómo reportar bugs, ayudar con la documentación, etc. También conduce a varios canales de la comunidad como Godot Contributors '<https://chat.godotengine.org>' y Discord, y contiene una lista de tutoriales y material recomendados hechos por terceros que están fuera de esta documentación.
fr: **Community** est dédié à la vie de la communauté de Godot. Cela redirige vers de nombreux canaux de communauté comme le `Chat des Contributeurs de Godot <https://chat.godotengine.org/>`_ et`Discord`_ et contient une liste de tutoriels tiers recommandés et de contenu en dehors de cette documentation.
ja: \ :ref:`sec-community`\ セクションには、エンジン開発とそのコミュニティの生活に貢献するための情報が記載されています。たとえば、バグの報告方法やドキュメントのヘルプなどです。IRC `Godot Contributors Chat <https://chat.godotengine.org/>`_ や `Discord`_ などのさまざまなコミュニティチャンネルも参照できます。また、このドキュメント以外にも推奨されるサードパーティのチュートリアルのリストも含まれています。
pl: **Społeczność** jest poświęcona życiu Godotowej społeczności. Odsyła do różnych kanałów społecznościowych, takich jak `Czat Twórców Godota <https://chat.godotengine.org/>`_ i `Discord`_ i zawiera listę polecanych nieoficjalnych poradników i materiałów poza tą dokumentacją.
pt_br: **Comunidade** é dedicada à vida da comunidade de Godot. Ela lista os vários canais comunitários como o `Chat de Contribuintes do Godot <https://chat.godotengine.org/>`_ e `Discord`_ e contém uma lista de tutoriais e materiais de terceiros recomendados fora desta documentação.
ru: **Сообщество** предназначено для жизни сообщества Godot. Оно указывает на различные каналы сообщества, такие как `Чат Godot Contributors <https://chat.godotengine.org/>`_ и `Discord`_, и содержит список рекомендованных сторонних учебных пособий и материалов, находящихся за пределами этой документации.
uk: Розділ **Спільнота** присвячено життю спільноти розробників Godot. Вона вказує на різні канали спільноти, такі як `Godot Contributors Chat <https://chat.godotengine.org/>`_ і `Discord`_, а також містить список рекомендованих сторонніх навчальних посібників і матеріалів за межами цієї документації.
zh_cn: **社区** 致力于 Godot 社区的生态。它指向各种社区渠道，如 `Godot 贡献者聊天 <https://chat.godotengine.org/>`_ 和 `Discord`_\ ，并包含本文档之外推荐的第三方教程和资料。
zh_tw: :ref:`sec-community` 章節涵蓋了有關參與 Godot 開發的資訊，例如回報告有錯誤的方法、如何協助改善說明文件…等。另外也提供了多個如 IRC 與 Discord 的社群頻道，並列出了其他推薦的第三方教學。

source: Finally, the **Class reference** documents the full Godot API, also available directly within the engine's script editor. You can find information on all classes, functions, signals and so on here.
cs: Nakonec, **Dokumentace tříd** dokumentuje kompletní API rozhraní Godot, které je také přímo dostupné v editoru skriptů v enginu. Zde najdete informace o všech třídách, funkcích, signálech a podobně.
de: Die **Klassenreferenz** schließlich dokumentiert die vollständige Godot-API, die auch direkt im Skript-Editor der Engine verfügbar ist. Hier finden Sie Informationen zu allen Klassen, Funktionen, Signalen und so weiter.
es: Por último, la **Referecia de Clases** documenta por completo la API de Godot, también disponible dentro del editor de scripts del motor. Puedes encontrar información sobre todas las clases, funciones, señales y muchos más aquí.
fr: Finalement, les **références de classes** documentent toute l'API de Godot, elles sont aussi directement accessible dans l'éditeur du moteur de jeux. Vous pouvez y trouver toutes les information sur les classes, les fonctions, les signaux et tout le reste.
ja: ついに、クラスリファレンスのドキュメントがエンジンのスクリプトエディター内から直接閲覧できるようになりました。すべてのクラス、関数、シグナル等の情報をここで見つけることができます。
ko: 마지막으로 **클래스 레퍼런스**는 엔진의 스크립트 에디터에서 바로 사용할 수 있는 전체 Godot API를 문서화합니다. 여기에서 모든 클래스, 함수, 시그널 등에 대한 정보를 찾을 수 있습니다.
pl: W końcu, **Opis klas** dokumentuje całe API Godota, jest również dostępny bezpośrednio z edytora skryptów w silniku. Możesz tu znaleźć informacje o wszystkich klasach, funkcjach, sygnałach i tak dalej.
pt_br: Finalmente, **Referência de classe** documenta a Godot API completamente, também disponível diretamente dentro do editor de script da engine. Você pode encontrar informações sobre todas as classes, funções, sinais e outras coisas aqui.
ru: Наконец, **Справочник классов** полностью описывающий Godot API, также доступен напрямую внутри редактора скриптов. Там вы можете найти информацию обо всех классах, функциях, сигналах и так далее.
uk: Нарешті, **Довідник класів** документує повний API Godot, який також доступний безпосередньо в редакторі скриптів рушія. Тут ви можете знайти інформацію про всі класи, функції, сигнали тощо.
zh_cn: 最后，\ **类参考**\ 记录的是完整的 Godot API，另外也可以直接在引擎的脚本编辑器中查看。你可以在这里找到关于所有类、函数、信号等相关的信息。
zh_tw: 最後，**類別參照文件**記錄了完整的 Godot API，也可以直接在 Godot 的腳本編輯器中找到。您可以在這裡找到所有類別、函式、訊號以及相關資訊。

source: In addition to this documentation, you may also want to take a look at the various `Godot demo projects <https://github.com/godotengine/godot-demo-projects>`_.
cs: Kromě této dokumentace se také můžete podívat na různé `Godot demo projekty <https://github.com/godotengine/godot-demo-projects>`_.
de: Zusätzlich zu dieser Dokumentation können Sie auch einen Blick auf die verschiedenen `Godot-Demoprojekte <https://github.com/godotengine/godot-demo-projects>`_ werfen.
es: Además de esta documentación, tal vez quieras echar un vistazo a varios `proyectos de demostración <https://github.com/godotengine/godot-demo-projects>`_.
fr: En plus de cette documentation, vous pouvez également jeter un coup d’œil aux différents `projets de démonstration de Godot <https://github.com/godotengine/godot-demo-projects>`_.
ja: このドキュメントに加えて、さまざまな\ `Godotデモプロジェクト <https://github.com/godotengine/godot-demo-projects>`_\ も公開しています。
pl: Oprócz tej dokumentacji możesz również rzucić okiem na różne `projekty demonstracyjne Godota <https://github.com/godotengine/godot-demo-projects> `_.
pt_br: Além desta documentação, você também pode querer dar uma olhada nos vários `Projetos de demonstração do Godot <https://github.com/godotengine/godot-demo-projects>`_.
ru: В дополнение к этой документации Вы также можете посмотреть на различные `демонстрационные проекты Godot <https://github.com/godotengine/godot-demo-projects>`_.
uk: На додаток до цієї документації, ви також можете ознайомитися з різноманітними `Godot демонстраційними проектами <https://github.com/godotengine/godot-demo-projects>`_.
zh_cn: 除本文档外，你可能还会对各种 `Godot 示例项目 <https://github.com/godotengine/godot-demo-projects>`_\ 感兴趣。
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: About this documentation
cs: O této dokumentaci
de: Über diese Dokumentation
es: Acerca de esta documentación
fr: À propos de cette documentation
ja: このドキュメントについて
ko: 본 문서에 대하여
pl: O tej dokumentacji
pt_br: Sobre esta documentação
ru: О документации
uk: Про цю документацію
zh_cn: 关于本文档
zh_tw: 關於本文件
