Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Members of the Godot Engine community continuously write, correct, edit, and improve this documentation. We are always looking for more help. You can also contribute by opening Github issues or translating the documentation into your language. If you are interested in helping, see :ref:`Ways to contribute <doc_ways_to_contribute>` and :ref:`Writing documentation <doc_contributing_writing_documentation>`, or get in touch with the `Documentation team <https://godotengine.org/teams/#documentation>`_ on `Godot Contributors Chat <https://chat.godotengine.org/>`_.
cs: Členové komunity Godot Engine tuto dokumentaci neustále píší, opravují, upravují a vylepšují. Stále hledáme další pomoc. Můžete také přispět vytvořením Github příspěvků (Issue) nebo překladem dokumentace do vašeho jazyka. Pokud máte zájem pomoci, podívejte se na :ref:`Jak přispět <doc_ways_to_contribute>` a :ref:`Psaní dokuemntace <doc_contributing_writing_documentation>`, nebo se obraťte na `Tým dokumentaristů <https://godotengine.org/teams /#documentation>`_ na `Godot Contributors Chat <https://chat.godotengine.org/>`_.
de: Die Mitglieder der Godot-Engine-Community schreiben, korrigieren, bearbeiten und verbessern diese Dokumentation kontinuierlich. Wir sind immer auf der Suche nach weiterer Hilfe. Sie können auch dazu beitragen, indem Sie Github-Issues erstellen oder die Dokumentation in Ihre Sprache übersetzen. Wenn Sie daran interessiert sind zu helfen, lesen Sie :ref:`Wie man beitragen kann <doc_ways_to_contribute>` und :ref:`Dokumentation schreiben <doc_contributing_writing_documentation>`, oder kontaktieren Sie das `Dokumentationsteam <https://godotengine.org/teams/#documentation>`_ im `Godot Mitwirkenden-Chat <https://chat.godotengine.org/>`_.
es: Los miembros de la comunidad de Godot Engine escriben, corrigen, editan y mejoran esta documentación de manera continua. Estamos siempre buscando más ayuda. Puedes contribuir a través iniciando reportes en Github o traduciendo la documentación a tu idioma. Si tienes interés en colaborar, revisa :ref:Formas de contribuir <doc_ways_to_contribute>` y :ref:`Redactando documentación <doc_contributing_writing_documentation>`, o contacta con el `Equipo de Documentación <https://godotengine.org/teams/#documentation>`_ en `Godot Contributors Chat <https://chat.godotengine.org/>`_.
fr: Les membres de la communauté de Godot sont constamment entrain d'écrire, de corriger et d'améliorer cette documentation. Nous recherchons toujours de l'aide supplémentaire. Vous pouvez aussi contribuer en ouvrant des issues sur Github ou en traduisant cette documentation dans votre langue. Si vous êtes intéressé d'aider vous pouvez voir :ref:`Ways to contribute <doc_ways_to_contribute>` et :ref:`Writing documentation <doc_contributing_writing_documentation>` ou prendre contacte avec l'équipe qui s'occupe de la documentation <https://godotengine.org/teams/#documentation>` sur `Godot Contributors Chat <https://chat.godotengine.org/>`.
ja: Godotエンジンコミュニティのメンバーは、このドキュメントを継続的に執筆、修正、編集、改善しています。私たちはより多くの助けを求めています。また、Githubの課題を開いたり、ドキュメントをあなたの言語に翻訳することでも貢献できます。ご協力いただける方は、 :ref:`Ways to contribute <doc_ways_to_contribute>` や :ref:`Writing documentation <doc_contributing_writing_documentation>` をご覧いただくか、`Godot Contributors Chat <https://chat.godotengine.org/>`_ の `Documentation team <https://godotengine.org/teams/#documentation>`_ までご連絡ください。
ko: 고도 엔진 커뮤니티의 구성원들은 이 문서를 지속적으로 작성, 수정, 편집 및 개선하고 있습니다. 저희는 항상 더 많은 도움을 기다리고 있습니다. Github 이슈를 열거나 문서를 귀하의 언어로 번역하여 기여할 수도 있습니다. 도움이 필요하시면 :ref:`기여하는 방법 <doc_ways_to_contribute>` 및 :ref:`문서 작성하기 <doc_contributing_writing_documentation>`를 참조하거나, `고도 기여자 채팅 <https://chat.godotengine.org/>`에서 `문서 팀 <https://godotengine.org/teams/#documentation>`에 연락해 주세요.
pl: Członkowie społeczności Silnika Godot stale piszą, poprawiają, edytują i ulepszają tę dokumentację. Zawsze jest tu coś do zrobienia. Możesz również pomóc otwierając zgłoszenia na GitHubie lub tłumacząc tę dokumentację na własny język. Jeśli chcesz pomóc, sprawdź :ref:`Sposoby współtworzenia <doc_ways_to_contribute>` i :ref:`Pisanie dokumentacji <doc_contributing_writing_documentation>`, albo skontaktuj się z `zespołem tworzącym Dokumentację <https://godotengine.org/teams/#documentation>`_ on `Czacie Twórców Godota <https://chat.godotengine.org/>`_.
pt_br: Membros da comunidade Godot Engine continuamente escrevem, corrigem, editam e melhoram esta documentação. Nós estamos sempre buscando por mais ajuda. Você também pode contribuir abrindo uma issue no GitHub ou traduzindo a documentação para sua língua. Se você estiver interessando em ajudar, veja :ref:`Formas de contribuir <doc_ways_to_contribute>` e também :ref:`Escrevendo documentação <doc_contributing_writing_documentation>`, ou entre em contato com o `Time de documentação <https://godotengine.org/teams/#documentation>`_ no `Chat de contribuidores Godot <https://chat.godotengine.org/>`_.
ru: Члены сообщества Godot Engine постоянно пишут, исправляют, редактируют и улучшают эту документацию. Мы всегда ищем дополнительную помощь. Вы также можете внести свой вклад, открыв проблемы на Github или переведя документацию на свой язык. Если вас интересует помощь, смотрите разделы :ref:`Способы внести вклад <doc_ways_to_contribute>` и :ref:`Написание документации <doc_contributing_writing_documentation>`, или свяжитесь с `Командой документации <https://godotengine.org/teams/#documentation>`_ в чате `Godot Contributors Chat <https://chat.godotengine.org/>`_.
uk: Члени спільноти Godot Engine постійно пишуть, виправляють, редагують і покращують цю документацію. Нам завжди потрібна допомога. Ви також можете зробити свій внесок, відкривши питання на Github або переклавши документацію вашою мовою. Якщо ви зацікавлені у допомозі, дивіться :ref:`Способи внеску <doc_ways_to_contribute>` і :ref:`Написання документації <doc_contributing_writing_documentation>`, або зв'яжіться з командою `Documentation team <https://godotengine.org/teams/#documentation>`_ на `Godot Contributors Chat <https://chat.godotengine.org/>`_.
zh_cn: Godot 引擎社区的成员不断编写、更正、编辑和改进此文档。我们一直在寻求更多的帮助。你也可以通过打开 Github 问题或将文档翻译成你的语言来做出贡献。如果你有兴趣提供帮助，请参阅 :ref:`贡献<doc_ways_to_contribute>` 和 :ref:`编写文档<doc_contributing_writing_documentation>`，或与\ `文档团队 <https://godotengine.org/teams/#documentation>`_\ 在 `Godot 贡献者聊天 <https://chat.godotengine.org/>`_\ 中交流。
zh_tw: Godot 引擎社區的成員不斷編寫、更正、編輯和改進此文件。我們一直在尋求更多的説明。您也可以通過打開 Github 問題或將文件翻譯成您的語言來做出貢獻。如果你有興趣提供説明，請參閱 :ref:`Ways to contribute <doc_ways_to_contribute>` 和 :ref:`Writing documentation <doc_contributing_writing_documentation>`，或與 '文件團隊 <https://godotengine.org/teams/#documentation>'_ 在 'Godot 貢獻者聊天 <https://chat.godotengine.org/>'_ 。

source: All documentation content is licensed under the permissive Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "*Juan Linietsky, Ariel Manzur, and the Godot Engine community*" unless otherwise noted.
cs: Veškerý obsah je chráněn svobodnou licencí Creative Commons Attribution 3.0 ( `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_ ) s přiřazením k "Juan Linietsky, Ariel Manzur a komunitě Godot Engine", pokud není jinak dáno.
de: Der gesamte Inhalt der Dokumentation steht unter der Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_)-Lizenz, mit der Attributierung „*Juan Linietsky, Ariel Manzur, and the Godot Engine community*“, sofern nicht anders angegeben.
es: Todo el contenido de la documentación está licenciado bajo la licencia permisiva Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), con atribución a "*Juan Linietsky, Ariel Manzur y la comunidad de Godot Engine*" a menos que se indique otra.
fr: Tous les contenus sont sous licence Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), avec attribution à "*Juan Linietsky, Ariel Manzur et la communauté de Godot Engine*" sauf indication contraire.
ja: このドキュメントの全てのコンテンツは「Juan Linietsky」、「Ariel Manzur」そして「Godot Engine コミュニティ」によって、クリエイティブ・コモンズ-表示 3.0(\ `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/deed.ja>`_\ )ライセンスの下、管理されております。
pl: Cała dokumentacja jest udostępniona na wolnej licencji Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), z przypisaniem autorstwa dla "*Juan Linietsky, Ariel Manzur, and the Godot Engine community*" o ile nie zaznaczono inaczej.
pt_br: Todo o conteúdo está sob a licença permissiva Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), atribuido a "Juan Linietsky, Ariel Manzur e a comunidade Godot Engine" a menos que o contrario seja especificado.
ru: Вся документация распространяется по лицензии Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) с указанием авторства "*Хуана Линецки, Ариэля Манзура и сообщество Godot Engine*", если не указано иное.
uk: Весь вміст документації поширюється за ліцензією Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) з зазначенням авторства "*Juan Linietsky, Ariel Manzur та спільнота розробників движка Godot Engine*", якщо не вказано інше.
zh_cn: 所有内容均在宽松的知识共享署名 3.0（\ `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_\ ）许可下，并归属于“Juan Linietsky、Ariel Manzur 和 Godot 引擎社区”，除非另有说明。
zh_tw: 所有的內容都以鬆散的創用CC—姓名標示 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0>`_) 授權條款發行，並標註作者「Juan Linietsky, Ariel Manzur 與 Godot Engine 社群」。

source: *Have fun reading and making games with Godot Engine!*
cs: *Bavte se čtením a tvorbou her v Godot Enginu!*
de: *Viel Spaß beim Lesen und der Spieleentwicklung mit der Godot Engine!*
es: *¡Diviértete leyendo y haciendo juegos con Godot Engine!*
fr: *Amusez-vous en créant des jeux avec Godot !*
ja: *Godot Engineでの学習やゲーム開発を楽しんでください！*
ko: *재밌게 읽어보시고 Godot 엔진으로 즐겁게 게임을 개발해보세요!*
pl: *Miłej zabawy podczas czytania i tworzenia gier w silniku Godot!*
pt_br: *Divirta-se lendo e fazendo jogos com Godot Engine!*
ru: *Весёлого чтения и создания игр на движке Godot Engine!*
uk: *Веселого читання та створення ігор з Godot Engine!*
zh_cn: **祝你享受阅读和使用 Godot 引擎制作游戏！**
zh_tw: *祝你學習與使用 Godot Engine 開發遊戲愉快！*

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
ko: 번역 상태
pl: Status tłumaczenia
pt_br: Progresso da Tradução
ru: Статус перевода
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態
