Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: Containers to place GUI elements automatically following certain rules.
de: Container um GUI-Elemente automatisch nach gewissen Regeln zu platzieren.
es: Contenedores para colocar elementos GUI automáticamente siguiendo ciertas reglas.
uk: Контейнери для автоматичного розміщення елементів інтерфейсу за визначеними правилами.
zh_cn: 容器可根据特定规则自动放置UI元素.
zh_tw: 通過容器 (Container) 來依照特定規則自動擺放 GUI 元素。

source: :ref:`Stack <class_BoxContainer>` layouts.
es: Diseños :ref:`Stack <class_BoxContainer>`.
uk: Макети :ref:`Stack (Складання) <class_BoxContainer>`.
zh_cn: :ref:`堆叠 <class_BoxContainer>` 布局。
zh_tw: :ref:`Stack <class_BoxContainer>` 配置。

source: :ref:`Grid <class_GridContainer>` layouts.
es: Diseños :ref:`Grid <class_GridContainer>`.
uk: Макети :ref:`Grid (Сітки) <class_GridContainer>`.
zh_cn: :ref:`网格 <class_GridContainer>` 布局。
zh_tw: :ref:`Grid <class_GridContainer>` 配置。

source: :ref:`Flow <class_FlowContainer>` layouts (similar to autowrapping text).
de: :ref:`Flow <class_FlowContainer>`-Layouts (ähnlich wie Autowrapping-Text).
es: Disposiciones tipo :ref:`flujo <class_FlowContainer>` (similar a texto autoajustado).
uk: :ref:`Flow <class_FlowContainer>` макетів (подібно до автообгортання тексту).
zh_cn: :ref:`流式 <class_FlowContainer>` 布局（类似于文本自动折行）。
zh_tw: :ref:`Stack <class_BoxContainer>` 配置。

source: :ref:`Margin <class_MarginContainer>`, :ref:`centered <class_CenterContainer>` and :ref:`aspect ratio <class_AspectRatioContainer>` layouts.
de: :ref:`Margin <class_MarginContainer>`-, :ref:`zentrierte <class_CenterContainer>` und :ref:`Seitenverhältnis <class_AspectRatioContainer>`-Layouts.
es: Disposiciones de :ref:`margen <clase_MarginContainer>`, :ref:`centrado <clase_CenterContainer>` y and :ref:`relación de aspecto <class_AspectRatioContainer>`.
uk: :ref:`Margin <class_MarginContainer>`, :ref:`centered <class_CenterContainer>` та :ref:`aspect ratio <class_AspectRatioContainer>` макети.
zh_cn: :ref:`边距 <class_MarginContainer>`\ 、\ :ref:`居中 <class_CenterContainer>`\ 和\ :ref:`纵横比 <class_AspectRatioContainer>`\ 布局。
zh_tw: :ref:`外邊距 <class_MarginContainer>` 與 :ref:`置中 <class_CenterContainer>` 配置。

source: :ref:`Draggable splitter <class_SplitContainer>` layouts.
de: :ref:`ziehbare Splitter <class_SplitContainer>`-Layouts.
es: :ref:`Divisor arrastrable <clase_SplitContainer>` planos.
uk: Макети :ref:`Перетягуваного спліттера <class_SplitContainer>`.
zh_cn: :ref:`可拖拽分割器 <class_SplitContainer>` 布局。
zh_tw: :ref:`可拖曳的分割區域 <class_SplitContainer>` 配置。

source: Scale to :ref:`multiple resolutions <doc_multiple_resolutions>` using the ``canvas_items`` or ``viewport`` stretch modes.
de: Skalieren auf :ref:`mehrere Auflösungen <doc_multiple_resolutions>` unter Verwendung der Stretch-Modi ``canvas_items`` oder ``viewport``.
es: Escala a :ref:`múltiples resoluciones <doc_multiple_resolutions>` usando los modos de estiramiento ``2d`` o ``viewport``.
uk: Масштабуйте до :ref:`multiple resolutions <doc_multiple_resolutions>` за допомогою режимів розтягування ``canvas_items`` або ``viewport``.
zh_cn: 使用 ``canvas_items`` 或 ``viewport`` 拉伸模式缩放至 :ref:`多种分辨率 <doc_multiple_resolutions>`\ 。
zh_tw: 可通過 ``2D`` 或 ``Viewport`` 伸縮模式來縮放至不同的解析度。

source: Support any aspect ratio using anchors and the ``expand`` stretch aspect.
de: Unterstützt jedes Seitenverhältnis mit Ankern und dem Streckungaspekt ``expand``.
es: Soporta cualquier relación de aspecto usando anclajes y el aspecto de estiramiento "expandir".
uk: Підтримка будь-якого співвідношення сторін за допомогою якорів та аспекту розтягування ``expand``.
zh_cn: 使用锚点和 ``expand`` 等比例缩放，支持任意纵横比。
zh_tw: 通過錨定與 ``Expand`` 伸縮模式來支援任何長寬比。

source: **Theming:**
de: **Themes:**
es: **Temática:**
uk: **Теми:**
zh_cn: **主题：**
zh_tw: **佈景主題:**

source: Built-in theme editor.
de: Integrierter Theme-Editor.
es: Editor de temas integrado.
uk: Вбудований редактор тем.
zh_cn: 内置主题编辑器。
zh_tw: 內建主題編輯器。

source: Generate a theme based on the current editor theme settings.
de: Erzeugt ein Theme basierend auf den Editor Theme-Einstellungen.
es: Generar un tema basado en la configuración actual del tema del editor.
uk: Створення тем на основі налаштувань поточної теми редактора.
zh_cn: 根据当前的编辑器主题设置生成主题。
zh_tw: 通過目前的編輯器佈景主題設定來產生佈景主題。

source: Procedural vector-based theming using :ref:`class_StyleBoxFlat`.
de: Prozeduale, vektorbasierte Themes mit :ref:`class_StyleBoxFlat`.
es: Procedimiento basado en la temática vectorial usando :ref:`class_StyleBoxFlat`.
uk: Процедурні векторні теми за допомогою :ref:`class_StyleBoxFlat`.
zh_cn: 使用 :ref:`class_StyleBoxFlat` 进行基于向量的程序式主题设计。
zh_tw: 使用 :ref:`class_StyleBoxFlat` 來製作基於向量的佈景主題。

source: Supports rounded/beveled corners, drop shadows, per-border widths and antialiasing.
de: Unterstützt abgerundete/abgeschrägte Ecken, Schlagschatten, Randbreiten und Kantenglättung.
es: Soporta esquinas redondeadas/biseladas, sombras de caída, anchos por borde y antialiasing.
uk: Підтримка закруглених/скошених кутів, тіней та ширини меж та знебарвлення.
zh_cn: 支持圆角/斜角、阴影、每边框宽度、抗锯齿。
zh_tw: 支援圓角與斜角、陰影，與每個邊都可調整的寬度。

source: Texture-based theming using :ref:`class_StyleBoxTexture`.
de: Texturbasierte Themes mit :ref:`class_StyleBoxTexture`.
es: Temas basados en texturas usando :ref:`class_StyleBoxTexture`.
uk: Теми на основі текстур за допомогою :ref:`class_StyleBoxTexture`.
zh_cn: 使用 :ref:`class_StyleBoxTexture` 进行基于纹理的主题设计。
zh_tw: 通過 :ref:`class_StyleBoxTexture` 來以紋理製作佈景。

source: Godot's small distribution size can make it a suitable alternative to frameworks like Electron or Qt.
de: Die geringe Größe der Godot-Distribution kann es zu einer geeigneten Alternative zu Frameworks wie Electron oder Qt machen.
es: El pequeño tamaño de la distribución de Godot puede hacer que sea una alternativa adecuada a los marcos como Electrón o el Qt.
uk: Невеликий розмір дистрибутиву Godot робить його непоганою альтернативою для таких фреймворків, як Electron, чи Qt.
zh_cn: Godot的发行软件包较小, 使其适合替代Electron或Qt之类的框架.
zh_tw: Godot 的小型發行版大小適合用於作為 Electron 或 Qt 的替代方案。

source: Animation
es: Animación
uk: Анімація
zh_cn: 动画
zh_tw: 動畫

source: Direct kinematics and inverse kinematics.
de: Direct Kinematics und inverse Kinematics.
es: Cinemática directa y cinemática inversa.
uk: Пряма кінематика та зворотна кінематика.
zh_cn: 正向运动学与反向运动学.
zh_tw: 正向運動學與反向運動學。

source: Support for animating any property with customizable interpolation.
de: Unterstützung für die Animation jeder Eigenschaft mit änderbarer Interpolation.
es: Soporte para animar cualquier propiedad con interpolación personalizable.
uk: Підтримка будь-яких властивостей анімації із настроюваною інтерполяцією.
zh_cn: 支持为任何属性制作动画, 可自定义插值.
zh_tw: 支援以可客製化的插值算法來動畫化任何屬性。

source: Support for calling methods in animation tracks.
de: Unterstützung um Methoden aufzurufen innerhalb von Animations-Tracks.
es: Soporte a los métodos de llamada en las pistas de animación.
uk: Підтримка методів виклику в анімаційних доріжках.
zh_cn: 支持在动画轨道中调用方法.
zh_tw: 支援在動畫軌中呼叫方法。

source: Support for playing sounds in animation tracks.
de: Unterstützung um Sounds abzuspielen innerhalb von Animations-Tracks.
es: Soporte para reproducir sonidos en las pistas de animación.
uk: Підтримка відтворення звуків в анімаційних доріжках.
zh_cn: 支持在动画轨道中播放声音.
zh_tw: 支援在動畫軌中播放聲音。

source: Support for Bézier curves in animation.
de: Unterstützung für Bézierkurven in Animationen.
es: Soporte para las curvas de Bézier en la animación.
uk: Підтримка кривих Безьє в анімації.
zh_cn: 支持在动画中使用贝塞尔曲线.
zh_tw: 支援在動畫中使用貝茲曲線。

source: File formats
de: Dateiformate
es: Formato de archivo
uk: Формати файлів
zh_cn: 文件格式
zh_tw: 視訊格式

source: Scenes and resources can be saved in :ref:`text-based <doc_tscn_file_format>` or binary formats.
de: Szenen und Ressourcen können in :ref:`textbasierten <doc_tscn_file_format>` oder Binärformaten gespeichert werden.
es: Las escenas y los recursos pueden ser guardados en :ref:`basado en texto <doc_tscn_file_format>` o formatos binarios.
uk: Сцени і ресурси можуть бути збережені в :ref:`текстових <doc_tscn_file_format>`, або бінарних форматах.
zh_cn: 场景和资源可保存为 :ref:`文本 <doc_tscn_file_format>` 或二进制格式.
zh_tw: 場景與資源可保存為 :ref:`文字檔 <doc_tscn_file_format>` 或二進位格式。

source: Text-based formats are human-readable and more friendly to version control.
de: Textbasierte Formate sind lesbarer und damit besser für eine Versionskontrolle.
es: Los formatos basados en texto son legibles para los humanos y más amigables para el control de versiones.
uk: Текстові формати зручні для читання та ще зручніші для контролю версій.
zh_cn: 基于文本的格式易于阅读, 并且对版本控制更友好.
zh_tw: 文字檔為人類可讀取的格式，並較適合用於版本控制系統。

source: Binary formats are faster to save/load for large scenes/resources.
de: Binärformate sind für große Szenen oder Ressourcen schneller geladen bzw. gespeichert.
es: Los formatos binarios son más rápidos de guardar/cargar para grandes escenas/recursos.
uk: Бінарні формати швидше зберігаються/завантажуються для великих сцен/ресурсів.
zh_cn: 二进制格式保存/加载大型场景/资源的速度更快.
zh_tw: 二進位檔案在保存與讀取大型場景或資源時較快。

source: Read and write text or binary files using :ref:`class_FileAccess`.
de: Lesen und Schreiben von Text- oder Binärdateien mit :ref:`class_FileAccess`.
es: Leer y escribir archivos de texto o binarios usando :ref:`class_FileAccess`.
uk: Читання та запис текстових або бінарних файлів з використанням :ref:`class_FileAccess`.
zh_cn: 使用 :ref:`class_FileAccess` 读写文本或二进制文件.
zh_tw: 使用 :ref:`class_File` 來讀取與寫入二進位檔案。

source: Can optionally be compressed or encrypted.
de: Kann optional komprimiert oder verschlüsselt werden.
es: Opcionalmente puede ser comprimido o encriptado.
uk: За бажання можна стиснути, або зашифрувати.
zh_cn: 可选择使用压缩或加密.
zh_tw: 可使用可選的壓縮或加密。

source: Read and write :ref:`class_JSON` files.
de: Lesen und Schreiben von :ref:`class_JSON` Dateien.
es: Lee y escribe :ref:`clase_JSON` archivos.
uk: Читання і запис файлів :ref:`class_JSON`.
zh_cn: 读写 :ref:`class_JSON` 文件.
zh_tw: 可讀寫 :ref:`class_JSON` 檔案。

source: Read and write INI-style configuration files using :ref:`class_ConfigFile`.
de: Lesen und Schreiben von INI-Konfigurationsdateien mittels :ref:`class_ConfigFile`.
es: Lee y escribe archivos de configuración de estilo INI usando :ref:`class_ConfigFile`.
uk: Читання і запис конфігураційних файлів INI-стилю з допомогою :ref:`class_ConfigFile`.
zh_cn: 使用 :ref:`class_ConfigFile` 读写 INI 样式的配置文件.
zh_tw: 可通過 :ref:`class_ConfigFile` 來讀寫 INI 格式的組態設定檔。

source: Can (de)serialize any Godot datatype, including Vector2/3, Color, ...
de: Kann jeden Godot-Datentyp (de)serialisieren, unter anderem Vector2/3, Color, ...
es: Puede (des)serializar cualquier tipo de datos Godot, incluyendo Vector2/3, Color, ...
uk: Можливість (де)серіалізувати будь-який тип даних Godot, включаючи Vector2/3, Color, ...
zh_cn: 可以（反）序列化任何 Godot 数据类型，包括 Vector2/3、Color 等。
zh_tw: 可序列化或復原序列化任何 Godot 資料型別，包含 Vector, Color…等。

source: Read XML files using :ref:`class_XMLParser`.
de: Lesen von XML Dateien mittels :ref:`class_XMLParser`.
es: Lee los archivos XML usando :ref:`class_XMLParser`.
uk: Читання файлів XML з допомогою :ref:`class_XMLParser`.
zh_cn: 使用 :ref:`class_XMLParser` 读取 XML 文件。
zh_tw: 可通過 :ref:`class_XMLParser` 來讀取 XML 檔案。

source: :ref:`Load and save images, audio/video, fonts and ZIP archives <doc_runtime_loading_and_saving>` in an exported project without having to go through Godot's import system.
de: :ref:`Laden und Speichern von Bildern, Audio/Video, Schriftarten und ZIP-Archiven <doc_runtime_loading_and_saving>` in einem exportierten Projekt, ohne das Godot-Importsystem zu durchlaufen.
es: :ref:`Cargar y guardar imágenes, audio/video, fuentes y archivos ZIP <doc_runtime_loading_and_saving>` en un proyecto exportado sin tener que pasar por el sistema de importación de Godot.
zh_cn: 无需通过 Godot 的导入系统， 在导出的项目中 :ref:`加载和保存图像、音频/视频、字体和 ZIP 存档 <doc_runtime_loading_and_saving>`。

source: Pack game data into a PCK file (custom format optimized for fast seeking), into a ZIP archive, or directly into the executable for single-file distribution.
de: Packen Sie Spieldaten in eine PCK-Datei (benutzerdefiniertes Format, das für die schnelle Suche optimiert ist), in ein ZIP-Archiv oder direkt in die ausführbare Datei für die Veröffentlichung als einzelne Datei.
es: Empaqueta los datos del juego en un archivo PCK (formato personalizado optimizado para una búsqueda rápida), en un archivo ZIP o directamente en el ejecutable para su distribución en un solo archivo.
uk: Пакування ігрових даних у файл PCK (власний формат, оптимізований для швидкого пошуку), у ZIP-архів, або безпосередньо у виконуваний файл для розповсюдження одного файлу.
zh_cn: 将游戏数据打包到 PCK 文件（针对快速搜索优化的自定义格式），ZIP 存档或直接打包到可执行文件中以进行单文件分发。
zh_tw: 可將遊戲資料打包進 PCK 檔案 (可更快讀取的客製化格式)，或是打包進 ZIP 壓縮檔，亦或是直接打包進執行檔內來發行單一檔案。

source: :ref:`Export additional PCK files<doc_exporting_pcks>` that can be read by the engine to support mods and DLCs.
de: :ref:`Exportiere zusätzliche PCK Dateien<doc_exporting_pcks>` die von der Engine gelesen werden können, zur Unterstützung von Mods und DLCs.
es: :ref:`Exportar archivos PCK adicionales<doc_exporting_pcks>` que pueden ser leídos por el motor para soportar mods y DLCs.
uk: :ref:`Експорт додаткових файлів PCK<doc_exporting_pcks>`, що можуть читатися редактором для підтримки модів та доповнень (DLC).
zh_cn: :ref:`导出额外的 PCK 文件 <doc_exporting_pcks>`\ ，引擎可以读取这些文件以支持 mod 和 DLC。
zh_tw: :ref:`匯出額外的 PCK 檔案 <doc_exporting_pcks>` ，可讓引擎讀取，並用於支援 Mod 或 DLC。

source: Miscellaneous
de: Verschiedenes
es: Misceláneas
uk: Різне
zh_cn: 杂项
zh_tw: 雜項

source: :ref:`Video playback <doc_playing_videos>` with built-in support for Ogg Theora.
de: :ref:`Videowiedergabe <doc_playing_videos>` mit integrierter Unterstützung für Ogg Theora.
es: :ref:`Reproducción de video <doc_playing_videos>` con soporte integrado de Ogg Theora.
zh_cn: :ref:`视频回放 <doc_playing_videos>`\ 内置支持 Ogg Theora。
zh_tw: :ref:`Video playback <doc_playing_videos>` 提供對Ogg格式的支援。

source: :ref:`Movie Maker mode <doc_creating_movies>` to record videos from a running project with synchronized audio and perfect frame pacing.
de: :ref:`Movie Maker-Modus <doc_creating_movies>`, um Videos aus einem laufenden Projekt mit synchronisiertem Ton und perfektem Frame-Pacing aufzunehmen.
es: :ref:`Modo Creador de Película <doc_creating_movies>` para guardar videos desde un proyecto en ejecución con sincronización de audio y paso de frame perfecto.
zh_cn: :ref:`Movie Maker 模式 <doc_creating_movies>`\ 可从正在运行的项目中录制视频，并具有同步音频和完美的帧同步。
zh_tw: :ref:`電影製作模式 <doc_creating_movies>` 可從正在運作的專案中錄製影片，並具有同步音訊和完美的影格同步。

source: :ref:`Low-level access to servers <doc_using_servers>` which allows bypassing the scene tree's overhead when needed.
de: :ref:`Low-Level Zugriff auf Server <doc_using_servers>` die es erlauben den Szenenbaum-Overhead zu umgehen, falls nötig.
es: :ref:`Acceso de bajo nivel a los servidores <doc_using_servers>` que permite evitar la sobrecarga del árbol de la escena cuando sea necesario.
uk: :ref:`Низькорівневий доступ до серверів <doc_using_servers>`, що дозволяє обійти накладні витрати дерева сцени, коли це потрібно.
zh_cn: :ref:`对服务器的低级别访问 <doc_using_servers>`\ ，能够在必要时绕过场景树的开销。
zh_tw: :ref:`低階伺服器存取 <doc_using_servers>` 可在需要時繞過場景樹的一些瓶頸。

source: :ref:`Command line interface <doc_command_line_tutorial>` for automation.
de: :ref:`Kommandozeilen-Schnittstelle <doc_command_line_tutorial>` für Automatisierung.
es: :ref:`La interfaz de la línea de comandos <doc_command_line_tutorial>` para automatización.
uk: :ref:`Інтерфейс командного рядка <doc_command_line_tutorial>` для автоматизації.
zh_cn: 使用\ :ref:`命令行接口 <doc_command_line_tutorial>`\ 进行自动化。
zh_tw: 更多有關命令行參數的資訊，請參考 :ref:`命令行教學 <doc_command_line_tutorial>` 。

source: Export and deploy projects using continuous integration platforms.
de: Exportieren und Ausliefern von Projekten mithilfe von Continuous-Integration-Plattformen.
es: Exportar y desplegar proyectos utilizando plataformas de integración continua.
uk: Експорт та розгортання проєктів за допомогою платформ безперервної інтеграції.
zh_cn: 使用持续集成平台导出和部署项目.
zh_tw: 通過持續整合 (CI, Continuous Integration) 平台來匯出與部署專案。

source: `Shell completion scripts <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ are available for Bash, zsh and fish.
de: `Shell-Fertigstellung Skripte <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ sind verfügbar für Bash, zsh und fish.
es: `Scripts de completado <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ está disponible para Bash, zsh y fish.
uk: `Скрипти завершення <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ доступні для Bash, zsh і fish.
zh_cn: 适用于 Bash、zsh 和 fish 的 `Shell 补全脚本 <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`_\ 。
zh_tw: 可用於 Bash, ZSH 與 Fish 的 `自動補全腳本 <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ 。

source: Print colored text to standard output on all platforms using :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
de: Farbiger Text wird auf allen Plattformen mit :ref:`print_rich <class_@GlobalScope_method_print_rich>` auf die Standardausgabe ausgegeben.
es: Imprimir texto coloreado en la salida estandard en todas las plataformas usando :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
zh_cn: 使用 :ref:`print_rich <class_@GlobalScope_method_print_rich>`\ 将彩色文本打印至所有平台的标准输出。
zh_tw: 使用 :ref:`print_rich <class_@GlobalScope_method_print_rich>` 將彩色文字列印至所有平臺的標準輸出。

source: Support for :ref:`C++ modules <doc_custom_modules_in_cpp>` statically linked into the engine binary.
de: Unterstützung für :ref:`C++ Module <doc_custom_modules_in_cpp>`, die statisch in die Engine-Binärdatei gelinkt sind.
es: Soporte para :ref:`modulos C++ <doc_custom_modules_in_cpp>` enlazados estáticamente al binario del motor.
uk: Підтримка :ref:`C++ модулів <doc_custom_modules_in_cpp>`, статично прив'язаних до бінарного коду рушія.
zh_cn: 支持将 :ref:`C++ 模块 <doc_custom_modules_in_cpp>` 静态链接到引擎二进制文件中。
zh_tw: 支援將 :ref:`C++ 模組 <doc_custom_modules_in_c++>` 靜態連結到引擎二進位檔中。

source: Engine and editor written in C++17.
de: Engine und Editor geschrieben in C++17.
es: El motor y editor están escritos en C++17.
uk: Рушій та редактор написані на C++17.
zh_cn: 引擎和编辑器以 C++17 编写。
zh_tw: 引擎與編輯器以 C++03 撰寫。

source: Can be :ref:`compiled <doc_introduction_to_the_buildsystem>` using GCC, Clang and MSVC. MinGW is also supported.
de: Kann :ref:`kompiliert <doc_introduction_to_the_buildsystem>` werden mittels GCC, Clang und MSVC. MinGW wird auch unterstützt.
es: Puede ser :ref:`compilado <doc_introduction_to_the_buildsystem>` usando GCC, Clang y MSVC. MinGW también está soportado.
uk: Може бути :ref:`скомпільований<doc_introduction_to_the_buildsystem>` з допомогою GCC, Clang і MSVC. Також підтримується MinGW.
zh_cn: 可使用 GCC、Clang、MSVC 进行\ :ref:`编译 <doc_introduction_to_the_buildsystem>`\ 。同时支持 MinGW。
zh_tw: 可通過 GCC, Clang 與 MSVC 進行 :ref:`編譯 <doc_introduction_to_the_buildsystem>` 。亦支援 MinGW。

source: Friendly towards packagers. In most cases, system libraries can be used instead of the ones provided by Godot. The build system doesn't download anything. Builds can be fully reproducible.
de: Benutzerfreundlich gegenüber Packagern: In den meisten Fällen können Systembibliotheken anstelle der von Godot bereitgestellten Bibliotheken verwendet werden. Das Buildsystem lädt nichts herunter. Builds können somit vollständig reproduzierbar sein.
es: Amistoso con los empaquetadores. En la mayoría de los casos, las bibliotecas de sistema pueden ser utilizadas en lugar de las proporcionadas por Godot. El sistema de construcción no descarga nada. Las compilaciones pueden ser totalmente reproducibles.
uk: Дружелюбний до упаковщиків. У більшості випадків можна використовувати системні бібліотеки замість тих, які надає Godot. Система збірки нічого не завантажує. Збірки можуть бути повністю відтворюваними.
zh_cn: 对打包者友好。通常情况下，可以使用系统库代替 Godot 提供的库。构建系统不会下载任何东西。构建完全可重现。
zh_tw: 對打包者友好。在大多數情況下，都可使用系統函式庫來代替 Godot 中提供的函式庫。建置系統不需要額外下載任何東西。建置過程完全可重現。

source: Licensed under the permissive MIT license.
de: Lizenz mit Zustimmung vom MIT.
es: Licenciado bajo la licencia permisiva del MIT.
uk: Ліцензовано відповідно до дозволу MIT.
zh_cn: 使用宽松的 MIT 许可。
zh_tw: 以鬆散的 MIT 授權條款授權。

source: Open development process with :ref:`contributions welcome <doc_ways_to_contribute>`.
de: Offener Entwicklungsprozess, bei dem :ref:`Beiträge willkommen <doc_ways_to_contribute>` sind.
es: Abre el proceso de desarrollo con :ref:`contributions welcome <doc_ways_to_contribute>`.
uk: Відкритий процес розробки з :ref:`внески вітаються <doc_ways_to_contribute>`.
zh_cn: 开放的开发过程, :ref:`欢迎贡献 <doc_ways_to_contribute>`\ 。
zh_tw: 開放的開發過程，且 :ref:`歡迎參與貢獻 <doc_ways_to_contribute>` 。

source: The `Godot proposals repository <https://github.com/godotengine/godot-proposals>`__ lists features that have been requested by the community and may be implemented in future Godot releases.
de: Das `Godot Proposals-Repository <https://github.com/godotengine/godot-proposals>`__ listet von der Community gewünschte Features auf, die möglicherweise in zukünftigen Godot-Versionen implementiert werden.
es: El `repositorio de propuestas de Godot <https://github.com/godotengine/godot-proposals>` __ enumera las características que han sido solicitadas por la comunidad y que pueden implementarse en futuras versiones de Godot.
uk: У `сховищі пропозицій Godot <https://github.com/godotengine/godot-proposals>`__ перелічено функції, які просить спільнота і які можуть бути реалізовані в майбутніх випусках Godot.
zh_cn: `Godot 提案库 <https://github.com/godotengine/godot-proposals>`__\ 列出了社区要求的、可能在未来 Godot 版本中实现的功能。
zh_tw: `Roadmap <https://github.com/godotengine/godot-roadmap>`__ Repository 中的文件說明了經討論同意且可能在未來版本中實作的功能。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: *Windows:* WASAPI.
es: *Windows:* WASAPI (API de Windows para la Gestión de Audio).
uk: *Windows:* ВАСАПІ.

source: :ref:`C#: <toc-learn-scripting-C#>`
zh_tw: :ref:`C#: <toc-learn-scripting-gdscript>`

source: **GDExtension (C, C++, Rust, D, ...):**
uk: **GDEрозширення (C, C++, Rust, D, ...):**
zh_tw: **GDNative (C, C++, Rust, D, ...):**

source: *macOS:* CoreAudio.
uk: *macOS:* Аудіо ядро.

source: Collada (.dae).
uk: Коллада (.dae).
