Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: Navigation meshes with dynamic obstacle avoidance in :ref:`2D <doc_navigation_overview_2d>` and :ref:`3D <doc_navigation_overview_3d>`.
de: Navigations-Meshes mit dynamischer Hindernisvermeidung in :ref:`2D <doc_navigation_overview_2d>` und :ref:`3D <doc_navigation_overview_3d>`.
es: Mallas de navegación con evasión de obstáculos dinámica en :ref:`2D <doc_navigation_overview_2d>` y :ref:`3D <doc_navigation_overview_3d>`.
zh_cn: 具有动态避障功能的导航网格在 :ref:`2D <doc_navigation_overview_2d>` 和 :ref:`3D <doc_navigation_overview_3d>` 里。
zh_tw: 具有動態避障功能的導覽網格在 :ref:`2D <doc_navigation_overview_2d>` 和 :ref:`3D <doc_navigation_overview_3d>` 裡。

source: Generate navigation meshes from the editor or at run-time (including from an exported project).
de: Generieren Sie ein Navigations-Mesh aus dem Editor oder in der Laufzeit (einschließlich von einem exportierten Projekt).
es: Generar mallas de navegación desde el editor o en tiempo de ejecución (incluso desde un projecto ya exportado).
uk: Створення навігаційних мешів (сіток) в редакторі, чи під час виконання (включаючи з експортованого проекту).
zh_cn: 在编辑器内或运行时生成导航网格（包括导出的项目）。
zh_tw: 在編輯器中產生導覽網格。

source: Networking
de: Netzwerkfunktionen
es: Redes
uk: Робота у мережі
zh_cn: 网络
zh_tw: 網路

source: Low-level TCP networking using :ref:`class_StreamPeer` and :ref:`class_TCPServer`.
de: Low-level TCP-Netzwerke mittels :ref:`class_StreamPeer` und :ref:`class_TCPServer`.
es: Redes TCP de bajo nivel utilizando :ref:`class_StreamPeer` y :ref:`class_TCPServer`.
uk: Низькорівнева TCP-мережа з використанням :ref:`class_StreamPeer` та :ref:`class_TCPServer`.
zh_cn: 使用 :ref:`class_StreamPeer` 和 :ref:`class_TCPServer` 开发底层TCP网络通信.
zh_tw: 使用 StreamPeer 與 TCP_Server 來操作低階 TCP 網路。

source: Low-level UDP networking using :ref:`class_PacketPeer` and :ref:`class_UDPServer`.
de: Low-Level UDP Netzwerke mittels :ref:`class_PacketPeer` und :ref:`class_UDPServer`.
es: Redes UDP de bajo nivel usando :ref:`class_PacketPeer` and :ref:`class_UDPServer`.
uk: Низькорівнева UDP-мережа з використанням :ref:`class_PacketPeer` та :ref:`class_UDPServer`.
zh_cn: 使用 :ref:`class_PacketPeer` 和 :ref:`class_UDPServer` 开发底层UDP网络通信.
zh_tw: 使用 PacketPeer 與 UDPServer 來操作低階 UDP 網路。

source: Low-level HTTP requests using :ref:`class_HTTPClient`.
de: Low-Level HTTP Anfragen mittels :ref:`class_HTTPClient`.
es: Solicitudes HTTP de bajo nivel usando :ref:`class_HTTPClient`.
uk: Низькорівневі HTTP-запити з використанням :ref:`class_HTTPClient`.
zh_cn: 使用 :ref:`class_HTTPClient` 进行低阶 HTTP 请求。
zh_tw: 使用 HTTPClient 來傳送低階 HTTP 請求。

source: High-level HTTP requests using :ref:`class_HTTPRequest`.
de: High-Level HTTP Anfragen mittels :ref:`class_HTTPClient`.
es: Solicitudes HTTP de alto nivel mediante :ref:`class_HTTPRequest`.
uk: Високорівневі HTTP-запити з використанням :ref:`class_HTTPRequest`.
zh_cn: 使用 :ref:`class_HTTPRequest` 进行高阶 HTTP 请求。
zh_tw: 使用 HTTPRequest 來傳送高階 HTTP 請求。

source: Supports HTTPS out of the box using bundled certificates.
de: Unterstützt standardmäßig HTTPS mittels gebündelter Zertifikate.
es: Soporta HTTPS listo para ser usado utilizando los certificados empaquetados.
uk: Підтримка HTTPS прямо з коробки з використанням пов'язаних сертифікатів.
zh_cn: 使用打包的证书相关工具, 支持开箱即用的HTTPS功能.
zh_tw: 支援 HTTPS，使用內建附帶的憑證。

source: :ref:`High-level multiplayer <doc_high_level_multiplayer>` API using UDP and ENet.
de: :ref:`High-Level Mehrspieler <doc_high_level_multiplayer>` API mittels UDP und ENet.
es: API :ref:`multijugador de alto nivel<doc_high_level_multiplayer>` usando UDP y ENet.
uk: :ref:`Високорівневий багатокористувацький <doc_high_level_multiplayer>` API з використанням UDP та ENet.
zh_cn: 使用UDP和ENet的 :ref:`高级联机 <doc_high_level_multiplayer>`\ API.
zh_tw: 使用 UDP 與 ENet 來支援高階多玩家 API。

source: Automatic replication using remote procedure calls (RPCs).
de: Automatische Nachbildungen mittels Remote-Prozeduraufrufe (RPCs = remote procedure calls).
es: Replicación automática mediante llamadas a procedimiento remoto (RPC).
uk: Автоматична реплікація за допомогою віддалених процедурних викликів (RPC).
zh_cn: 使用远程过程调用(RPCS)实现的自动同步复制功能.
zh_tw: 通過遠端程式呼叫 (RPC) 來自動複製。

source: Supports unreliable, reliable and ordered transfers.
de: Unterstützt unzuverlässige, zuverlässige und beantragte Transfers.
es: Admite transferencias ordenadas, confiables y no confiables.
uk: Підтримує ненадійні, надійні та впорядковані трансфери.
zh_cn: 支持不可靠, 可靠和有序传输模型.
zh_tw: 支援不可靠、可靠、與有序的傳輸模式。

source: :ref:`WebSocket <doc_websocket>` client and server, available on all platforms.
de: :ref:`WebSocket <doc_websocket>` Client und Server, verfügbar auf allen Plattformen.
es: Cliente y servidor :ref:`WebSocket <doc_websocket>`, disponible en todas las plataformas.
uk: :ref:`WebSocket <doc_websocket>` клієнт і сервер, доступний на всіх платформах.
zh_cn: :ref:`WebSocket <doc_websocket>` 客户端和服务器，全平台可用。
zh_tw: 在所有平台上均配有 WebSocket 使用者端與伺服器。

source: :ref:`WebRTC <doc_webrtc>` client and server, available on all platforms.
de: :ref:`WebRTC <doc_webrtc>` Client und Server, verfügbar auf allen Plattformen.
es: Cliente y servidor :ref:`WebRTC <doc_webrtc>`, disponible en todas las plataformas.
uk: :ref:`WebRTC <doc_webrtc>` клієнт і сервер, доступний на всіх платформах.
zh_cn: :ref:`WebRTC <doc_webrtc>` 客户端和服务器，全平台可用。
zh_tw: 在所有平台上均配有 WebRTC 使用者端與伺服器。

source: Support for :ref:`UPnP <class_UPNP>` to sidestep the requirement to forward ports when hosting a server behind a NAT.
de: Unterstützung für :ref:`UPnP<class_UPNP>` um Port-Forwarding zu umgehen, wenn der Server hinter einem NAT gehostet wird.
es: Soporte de :ref:`UPnP <class_UPNP>` para eludir el requisito de reenviar puertos cuando se aloja un servidor detrás de una NAT.
uk: Підтримка :ref:`UPnP <class_UPNP>`, щоб обійти вимогу переадресації портів при розміщенні сервера за NAT.
zh_cn: 当在NAT后部署服务器时, 支持使用 :ref:`UPnP <class_UPNP>`\ 来避免对转发端口的需求.
zh_tw: 支援在 NAT 下架設伺服器時通過 UPnP 來繞過需要連接埠轉發的需求。

source: Internationalization
de: Internationalisierung
es: Internacionalización
uk: Інтернаціоналізація
zh_cn: 国际化
zh_tw: 國際化

source: Full support for Unicode including emoji.
de: Volle Unterstützung für Unicode inklusive Emoji.
es: Soporte completo para Unicode, incluido emojis.
uk: Повна підтримка Unicode, включаючи емодзі.
zh_cn: 对包含emoji的Unicode完整支持.
zh_tw: 完整支援包含 Emoji 在內的 Unicode。

source: Store localization strings using :ref:`CSV <doc_internationalizing_games>` or :ref:`gettext <doc_localization_using_gettext>`.
de: Speichern von übersetzten Strings mittels :ref:`CSV <doc_internationalizing_games>` oder :ref:`gettext <doc_localization_using_gettext>`.
es: Almacena las strings de localización usando :ref:`CSV <doc_internationalizing_games>` o :ref:`gettext <doc_localization_using_gettext>`.
uk: Збереження рядків локалізації за допомогою :ref:`CSV <doc_internationalizing_games>`, або :ref:`gettext <doc_localization_using_gettext>`.
zh_cn: 使用 :ref:`CSV <doc_internationalizing_games>` 或 :ref:`gettext <doc_localization_using_gettext>` 存储本地化字符串.
zh_tw: 將本地化字串儲存於 :ref:`CSV <doc_internationalizing_games>` 或 :ref:`gettext <doc_localization_using_gettext>` 格式。

source: Support for generating gettext POT and PO files from the editor.
de: Unterstützung für die Erzeugung von gettext POT- und PO-Dateien aus dem Editor.
es: Soporte para generación de archivos gettext POT y PO desde el editor.
uk: Підтримка генерації gettext POT та PO файлів з редактора.
zh_cn: 支持从编辑器中生成 gettext POT 和 PO 文件。
zh_tw: 支援從編輯器中生成 gettext POT 和 PO 檔。

source: Use localized strings in your project automatically in GUI elements or by using the ``tr()`` function.
de: Nutzen Sie übersetzte Strings automatisch in Ihrem Projekt in GUI Elementen oder mit Hilfe der ``tr()`` Funktion.
es: Utiliza cadenas localizadas en su proyecto automáticamente en elementos GUI o utilizando la función ``tr()``.
uk: Використовуйте рядки локалізації у своєму проєкті автоматично в елементах графічного інтерфейсу, або за допомогою функції ``tr ()``.
zh_cn: 在你的项目中自动在GUI元素中或通过使用 ``tr()`` 函数使用本地化的字符串.
zh_tw: 可在 GUI 元素中自動使用專案中的本地化字串，亦可使用 ``tr()`` 函式。

source: Support for pluralization and translation contexts when using gettext translations.
de: Unterstützung für Pluralisierung und Übersetzungskontexte bei der Verwendung von gettext-Übersetzungen.
es: Soporte de pluralización y contextos de traducción utilizando traducciones gettext.
zh_cn: 当使用 gettext 翻译时，支持多元化和翻译上下文。
zh_tw: 當使用 gettext 翻譯時，支援多元化和翻譯本文。

source: Support for :ref:`bidirectional typesetting <doc_internationalizing_games_bidi>`, text shaping and OpenType localized forms.
de: Unterstützung für :ref:`bidirektionalen Schriftsatz <doc_internationalizing_games_bidi>`, Text-Shaping und OpenType lokalisierte Formen.
es: Soporte de :ref:`typesetting bidireccional <doc_internationalizing_games_bidi>`, formateo de texto y formas localizadas OpenType.
zh_cn: 支持 :ref:`双向排版 <doc_internationalizing_games_bidi>` ，文本整形和 OpenType 本地化表单。
zh_tw: 支援 :ref:`雙向排版 <doc_internationalizing_games_bidi>` ，文字整形和 OpenType 當地語系化表單。

source: Automatic UI mirroring for right-to-left locales.
de: Automatische Spiegelung der Benutzeroberfläche für Rechts-nach-Links-Sprachumgebungen.
es: Espejado automático de UI para escritura derecha a izquierda.
zh_cn: 用于从右到左区域设置的自动UI镜像。
zh_tw: 用於從右到左區域設定的自動UI鏡像。

source: Support for pseudolocalization to test your project for i18n-friendliness.
de: Unterstützung für Pseudolokalisierung, um Ihr Projekt auf i18n-Freundlichkeit zu testen.
es: Soporte de pseudolocalización para probar proyectos amigables para i18n.
zh_cn: 支持伪本地化，以测试你的项目对 i18n 的友好性。
zh_tw: 支援偽當地語系化，以測試您的專案對 i18n 的友好性。

source: Windowing and OS integration
de: Fensterverwaltung und OS Integration
es: Integración de ventanas y sistemas operativos
uk: Робота з вікном та інтеграція ОС
zh_cn: 窗口功能与操作系统整合
zh_tw: 視窗環境與作業系統整合

source: Spawn multiple independent windows within a single process.
de: Mehrere unabhängige Fenster innerhalb eines einzigen Prozesses erzeugen.
es: Generar múltiple ventanas independientes dentro de un único proceso.
zh_cn: 在单个进程中生成多个独立窗口。
zh_tw: 在單個程序中生成多個獨立視窗。

source: Move, resize, minimize, and maximize windows spawned by the project.
de: Verschieben, Größe verändern, Minimieren und Maximieren der vom Projekt erzeugten Fenster.
es: Mover, redimensionar, minimizar y maximizar ventanas generadas por el proyecto.
uk: Переміщення, зміна розміру, згортання та розгортання вікон, створених проектом.
zh_cn: 移动, 调整大小, 最小化和最大化项目产生的窗口。
zh_tw: 移動、縮放、最小化與最大化由專案產生的視窗。

source: Change the window title and icon.
de: Ändern des Fenster-Titels und Icons.
es: Cambia el título y el icono de la ventana.
uk: Зміна заголовку та значка вікна.
zh_cn: 更改窗口标题和图标.
zh_tw: 更改視窗標題與圖示。

source: Request attention (will cause the title bar to blink on most platforms).
de: Aufmerksamkeit erbitten (lässt die Titelzeile auf den meisten Plattformen blinken).
es: Solicita atención (hará que la barra de título parpadee en la mayoría de las plataformas).
uk: Запит уваги (на більшості платформ призведе до мерехтіння шкали заголовку).
zh_cn: 吸引注意（在大多数平台上表现为标题栏闪烁）。
zh_tw: 喚起注意 (在大多數平台上，會使標題列閃爍)。

source: Fullscreen mode.
de: Vollbildmodus.
es: Modo de pantalla completa.
uk: Повноекранний режим.
zh_cn: 全屏模式。
zh_tw: 全螢幕模式。

source: Uses borderless fullscreen by default on Windows for fast alt-tabbing, but can optionally use exclusive fullscreen to reduce input lag.
de: Verwendet unter Windows standardmäßig den randlosen Vollbildmodus für schnelles Alt-Tabbing, kann aber optional den exklusiven Vollbildmodus verwenden, um Eingabeverzögerungen zu vermindern.
es: Utiliza pantalla completa sin bordes por defecto on Windows para rápido alt-tabbing, puede utilizarse pantalla completa exclusiva para reducir el retraso de entradas.
zh_cn: 在 Windows 上，默认情况下使用无边框全屏进行快速切换，但也可以选择使用独占全屏来减少输入滞后。
zh_tw: 在 Windows 上，預設情況下使用無邊框全屏進行快速切換，但也可以選擇使用獨佔全屏來減少輸入滯後。

source: Borderless windows (fullscreen or non-fullscreen).
de: Rahmenloses Fenster (Vollbild oder nicht-Vollbild).
es: Ventanas sin bordes (a pantalla completa o no).
uk: Вікна без меж (повноекранні або неповноекранні).
zh_cn: 无边框窗口（全屏或非全屏）。
zh_tw: 無邊框視窗 (可用於全螢幕或非全螢幕)。

source: Ability to keep a window always on top.
de: Möglichkeit, das Fenster immer im Vordergrund zu behalten.
es: Capacidad de mantener la ventana siempre en primer plano.
uk: Можливість тримати вікно завжди зверху.
zh_cn: 窗口置顶功能。
zh_tw: 可將視窗設為總是在最頂端。

source: Global menu integration on macOS.
de: Globale Menü Integration auf MacOS.
es: Integración del menú global en el macOS.
uk: Інтеграція глобального меню на macOS.
zh_cn: macOS上的全局菜单整合.
zh_tw: 在 macOS 中可整合全域選單。

source: Execute commands in a blocking or non-blocking manner (including running multiple instances of the same project).
de: Befehle blockierend oder nicht-blockierend ausführen (einschließlich der Ausführung mehrerer Instanzen desselben Projekts).
es: Ejecutar los comandos de forma bloqueante o no bloqueante (incluyendo múltiples instancias del mismo proyecto).
uk: Виконувати команди у блокуючий або неблокуючий спосіб (включаючи запуск декількох екземплярів одного проєкту).
zh_cn: 以阻塞或非阻塞方式执行命令（包括运行同一项目的多个实例）。
zh_tw: 阻斷式或非阻斷式地執行指令。

source: Open file paths and URLs using default or custom protocol handlers (if registered on the system).
de: Öffnen Sie Dateipfade und URLs mit Default- oder benutzerdefinierten Protokoll-Handlers (sofern im System registriert).
es: Abrir rutas de archivos y URLs usando manejadores de protocolo predeterminados o personalizados (si están registrados en el sistema).
uk: Відкривання шляхів до файлів та URL-адрес за допомогою обробників протоколів за замовчуванням, або спеціальних (якщо вони зареєстровані в системі).
zh_cn: 使用默认或自定义(已注册在系统中的)协议处理器打开文件路径或URL.
zh_tw: 使用預設或 (系統中有註冊時) 自定的通訊協定處理常式來開啟檔案路徑或網址。

source: Parse custom command line arguments.
de: Kommandozeilenparameter parsen.
es: Analizar los argumentos de la línea de comandos personalizada.
uk: Аналіз користувацьких аргументів командного рядка.
zh_cn: 解析自定义命令行参数.
zh_tw: 解析自定命令行參數。

source: Any Godot binary (editor or exported project) can be :ref:`used as a headless server <doc_exporting_for_dedicated_servers>` by starting it with the ``--headless`` command line argument. This allows running the engine without a GPU or display server.
de: Jede Godot-Binärdatei (Editor oder exportiertes Projekt) kann als :ref:`Headless Server <doc_exporting_for_dedicated_servers>` verwendet werden, indem man sie mit dem Kommandozeilenargument ``--headless`` startet. Dies erlaubt es, die Engine ohne einen GPU- oder Display-Server zu betreiben.
es: Cualquier binario de Godot (editor o proyecto exportado) puede ser :ref:`utilizado como servidor headless <doc_exporting_for_dedicated_servers>` al iniciarlo con el argumento de línea de comandos ``--headless``. Esto permite ejecutar el motor sin GPU o servidor de pantalla.
zh_cn: 任何 Godot 二进制文件（编辑器或导出的项目）都可以 :ref:`用作无头服务器 <doc_exporting_for_dedicated_servers>` ，方法是用 ``--headless`` 命令行参数启动它。这允许在没有GPU或显示服务器的情况下运行引擎。
zh_tw: 任何 Godot 二進位檔案（編輯器或匯出的專案）都可以 :ref:`用作無頭伺服器 <doc_exporting_for_dedicated_servers>` ，方法是用 ``--headless`` 命令列參數啟動它。這允許在沒有GPU或顯示伺服器的情況下運作引擎。

source: Mobile
es: Móvil
uk: Мобільний
zh_cn: 移动端
zh_tw: 移動裝置

source: In-app purchases on :ref:`Android <doc_android_in_app_purchases>` and :ref:`iOS <doc_plugins_for_ios>`.
de: In-App-Käufe auf :ref:`Android <doc_android_in_app_purchases>` und :ref:`iOS <doc_plugins_for_ios>`.
es: Compras en aplicación en :ref:`Android <doc_android_in_app_purchases>` y :ref:`iOS <doc_plugins_for_ios>`.
zh_cn: 在 :ref:`Android <doc_android_in_app_purchases>` 或 :ref:`iOS <doc_plugins_for_ios>` 上的应用内购。
zh_tw: 在 :ref:`Android <doc_android_in_app_purchases>` 或 :ref:`iOS <doc_plugins_for_ios>` 上的應用內購。

source: Support for advertisements using third-party modules.
de: Unterstützung für Werbung mittels Third-Party Modulen.
es: Soporte para anuncios utilizando módulos de terceros.
uk: Підтримка реклами з використанням сторонніх модулів.
zh_cn: 支持第三方广告组件.
zh_tw: 支援以第三方模組來顯示廣告。

source: XR support (AR and VR)
de: XR Unterstützung (AR und VR)
es: Soporte XR (AR y VR)
uk: Підтримка XR (AR та VR)
zh_cn: XR 支持（AR 和 VR）
zh_tw: 支援 XR (AR 與 VR)

source: Out of the box :ref:`support for OpenXR <doc_setting_up_xr>`.
de: Out of the Box-:ref:`Unterstützung für OpenXR <doc_setting_up_xr>`.
es: :ref:`Soporte para OpenXR <doc_setting_up_xr>` integrado.
zh_cn: 开箱即用的 :ref:`OpenXR 支持 <doc_setting_up_xr>` 。
zh_tw: 開箱即用的 :ref:`OpenXR 支援 <doc_setting_up_xr>` 。

source: Including support for popular desktop headsets like the Valve Index, WMR headsets, and Quest over Link.
de: Einschließlich Unterstützung für beliebte Desktop-Headsets wie Valve Index, WMR-Headsets und Quest over Link.
es: Incluye soporte para dispositivos populares como Valve Index, WMR y Quest con Link.
uk: Включаючи підтримку популярних настільних гарнітур, таких як Valve Index, гарнітури WMR та Quest over Link.
zh_cn: 包括对流行的桌面 VR 头戴式设备的支持，例如 Valve Index、WMR 头戴式显示器和 Quest over Link。

source: Support for :ref:`Android based headsets <doc_deploying_to_android>` using OpenXR through a plugin.
de: Unterstützung für :ref:`Android-basierte Headsets <doc_deploying_to_android>` mit OpenXR durch ein Plugin.
es: Soporte para :ref:`dispositivos basados en Android <doc_deploying_to_android>` utilizando OpenXR a través de un plugin.
zh_cn: 通过插件，使用 OpenXR 支持 :ref:`基于 Android 的头戴式设备 <doc_deploying_to_android>`。

source: Including support for popular stand alone headsets like the Meta Quest 1/2/3 and Pro, Pico 4, Magic Leap 2, and Lynx R1.
de: Dazu gehört auch die Unterstützung beliebter eigenständiger Headsets wie dem Meta Quest 1/2/3 und Pro, Pico 4, Magic Leap 2 und Lynx R1.
es: Incluye soporte para dispositivos independientes populares como Meta Quest 1/2/3 y Pro, Pico 4, Magic Leap 2 y Lynx R1.
uk: Включаючи підтримку популярних автономних гарнітур, таких як Meta Quest 1/2/3 і Pro, Pico 4, Magic Leap 2 і Lynx R1.
zh_cn: 包括对流行的一体式 VR 头戴设备的支持，例如 Meta Quest 1/2/3 和 Pro、Pico 4、Magic Leap 2 和 Lynx R1。

source: Other devices supported through an XR plugin structure.
de: Andere Geräte werden durch eine XR-Plugin-Struktur unterstützt.
es: Otros dispositivos soportados a través de una estructura de plugins XR.
zh_cn: 通过 XR 插件结构支持的其他设备。

source: Various advanced toolkits are available that implement common features required by XR applications.
de: Es sind verschiedene fortgeschrittene Toolkits verfügbar, die allgemeine Features implementieren, die für XR-Anwendungen erforderlich sind.
es: Están disponibles varias herramientas avanzadas que implementan características requeridas por aplicaciones XR.
zh_cn: 可以使用各种高级工具包来实现 XR 应用程序所需的常见功能。

source: GUI system
es: Sistema GUI
uk: Система GUI (графічного інтерфейсу)
zh_cn: GUI 系统
zh_tw: GUI 圖形界面系統

source: Godot's GUI is built using the same Control nodes used to make games in Godot. The editor UI can easily be extended in many ways using add-ons.
de: Die Benutzeroberfläche von Godot wurde mit denselben Kontroll-Nodes erstellt, mit denen auch Spiele in Godot erstellt werden. Die Benutzeroberfläche des Editors kann mithilfe von Add-Ons auf vielfältige Weise erweitert werden.
es: El GUI de Godot está construido usando los mismos nodos de control que se usan para hacer juegos en Godot. La interfaz de usuario del editor puede ser fácilmente ampliada de muchas maneras usando complementos.
uk: Графічний інтерфейс Godot побудований за допомогою тих самих вузлів управління (Control), що використовуються для створення ігор у Godot. Інтерфейс редактора можна легко розширити багатьма способами за допомогою доповнень.
zh_cn: Godot 的 GUI 也是使用 Control 节点搭建的，和制作游戏时所使用的节点一致。编辑器 UI 可以通过插件轻松地进行各种扩展。
zh_tw: Godot 的 GUI 時使用在 Godot 中製作遊戲相同的 Control 節點製成的。編輯器的 UI 可通過擴充套件來輕鬆擴充。

source: **Nodes:**
es: **Nodos:**
uk: **Вузли:**
zh_cn: **节点：**
zh_tw: **節點:**

source: Buttons.
es: Botones.
uk: Кнопки.
zh_cn: 按钮。
zh_tw: 按鈕。

source: Checkboxes, check buttons, radio buttons.
es: Casillas de cheque, botones de cheque, botones de selección.
uk: Галочки (прапорці), перемикачі, радіокнопки.
zh_cn: 复选框、复选按钮、单选按钮。
zh_tw: 勾選框、勾選按鈕、單選按鈕。

source: Text entry using :ref:`class_LineEdit` (single line) and :ref:`class_TextEdit` (multiple lines). TextEdit also supports code editing features such as displaying line numbers and syntax highlighting.
de: Texteingabe mit :ref:`class_LineEdit` (einzelne Zeile) und :ref:`class_TextEdit` (mehrere Zeilen). TextEdit unterstützt auch Codebearbeitungs-Features wie die Anzeige von Zeilennummern und Syntax Highlighting.
es: Entrada de texto usando :ref:`class_LineEdit` (línea simple) y :ref:`class_TextEdit` (líneas múltiples). TextEdit también soporta características de edición de código como mostrar números de línea y resaltado de sintaxis.
zh_cn: 使用 :ref:`class_LineEdit`\ （单行）和 :ref:`class_TextEdit`\ （多行）进行文本输入。TextEdit 还支持代码编辑功能，例如显示行号和语法高亮。
zh_tw: 使用 :ref:`class_LineEdit` （單行）和 :ref:`class_TextEdit` （多行）進行文字輸入。TextEdit 還支援程式碼編輯功能，例如顯示行號和語法高亮。

source: Dropdown menus using :ref:`class_PopupMenu` and :ref:`class_OptionButton`.
de: Dropdown-Menüs nutzen mittels :ref:`class_PopupMenu` und :ref:`class_OptionButton`.
es: Menús desplegables usando :ref:`class_PopupMenu` y :ref:`class_OptionButton`.
uk: Випадаючі меню з використанням :ref:`class_PopupMenu` та :ref:`class_OptionButton`.
zh_cn: 使用 :ref:`class_PopupMenu` 和 :ref:`class_OptionButton` 实现下拉菜单。
zh_tw: 使用 PopupMenu 與 OptionButton 來製作下拉選單。

source: Scrollbars.
de: Scroll-Leisten.
es: Barras de desplazamiento.
uk: Полоси прокрутки.
zh_cn: 滚动条。
zh_tw: 滾動條。

source: Labels.
es: Etiquetas.
uk: Мітки.
zh_cn: 标签。
zh_tw: 標籤。

source: RichTextLabel for :ref:`text formatted using BBCode <doc_bbcode_in_richtextlabel>`, with support for animated custom effects.
de: RichTextLabel für :ref:`mit BBCode formatierten Text <doc_bbcode_in_richtextlabel>`, mit Unterstützung für animierte benutzerdefinierte Effekte.
es: RichTextLabel para :ref:`texto formateado usando BBCode <doc_bbcode_in_richtextlabel>` con soporte para efectos animados personalizados.
uk: RichTextLabel для :ref:`тексту, відформатованого за допомогою BBCode <doc_bbcode_in_richtextlabel>`, з підтримкою анімованих користувацьких ефектів.
zh_cn: 使用 RichTextLabel 显示 :ref:`使用 BBCode 的格式化文本 <doc_bbcode_in_richtextlabel>`\ ，支持自定义动画效果。
zh_tw: 使用 RichTextLabel 來顯示 :ref:`使用 BBCode 格式化的文字 <doc_bbcode_in_richtextlabel>` 。

source: Trees (can also be used to represent tables).
de: Bäume (können auch zur Darstellung von Tabellen verwendet werden).
es: Árboles (también pueden utilizarse para representar tablas).
uk: Дерева (також можуть використовуватися для створення таблиць).
zh_cn: 树状图（也可用于显示表格）。
zh_tw: 樹狀圖 (也可以用於顯示表格)。

source: Color picker with RGB and HSV modes.
de: Farbwähler mit RGB und HSV Modi.
es: Selector de color con modos RGB y HSV.
uk: Палітра кольорів з режимами RGB та HSV.
zh_cn: 支持 RGB 及 HSV 模式的取色器。
zh_tw: 支援 RGB 及 HSV 模式的取色器。

source: Controls can be rotated and scaled.
de: Steuerelemente können gedreht und skaliert werden.
es: Los controles se pueden rotar y escalar.
uk: Елементи контролю можна повертати та масштабувати.
zh_cn: 控件可以旋转和缩放。
zh_tw: Control 節點可旋轉與縮放。

source: **Sizing:**
de: **Größenbestimmung:**
es: **Dimensionando:**
uk: **Розміри:**
zh_cn: **调整大小：**
zh_tw: **調整大小:**

source: Anchors to keep GUI elements in a specific corner, edge or centered.
de: Verankerung, um GUI-Elemente in einer bestimmten Ecke, Kante oder Mitte zu halten.
es: Anclas para mantener los elementos de la interfaz gráfica de usuario en una esquina específica, en un borde o en el centro.
uk: Якіри для утримування елементів графічного інтерфейсу в певному куті, краю, або по центру.
zh_cn: 锚点可将固定GUI元素在特定的角落, 边缘, 或者居中.
zh_tw: 通過錨點 (Anchor) 來將 GUI 元素置於特定的角落、邊緣或置中。
