Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: Shadow normal offset bias and shadow pancaking to decrease the amount of visible shadow acne and peter-panning.
de: Schatten-Normalversatz und Schatten-Pancaking zur Verringerung der sichtbaren Schattenakne und des Peter-Panning.
es: "Shadow normal offset bias" y "shadow pancaking" para disminuir la cantidad de acné de sombras visible y el peter-panning.
zh_cn: 要缓解可见的阴影失真和阴影悬浮的情况，可以调整阴影的法线偏移量偏置以及阴影压平。
zh_tw: 陰影通常情況下會偏置補償和陰影平移，以減少可見的陰影失真和陰影懸浮的數量。

source: :abbr:`PCSS (Percentage Closer Soft Shadows)`-like shadow blur based on the light size and distance from the surface the shadow is cast on.
de: :abbr:`PCSS (Percentage Closer Soft Shadows)`-ähnlicher Schatten-Blur, der auf der Größe des Lichts und dem Abstand zur Oberfläche basiert, auf die der Schatten geworfen wird.
es: Difuminado de sombras similar a :abbr:`PCSS (Percentage Closer Soft Shadows)` basado en el tamaño y distancia de la luz a la superficie donde se proyecta la sombra.
uk: :abbr:`PCSS (Percentage Closer Soft Shadows)`- схоже на розмиття тіні на основі розміру світла та відстані до поверхні, на яку відкидається тінь.
zh_cn: 类似 :abbr:`PCSS (Percentage Closer Soft Shadows)` 的阴影模糊是基于光线大小和与阴影投射表面的距离。

source: Adjustable shadow blur on a per-light basis.
de: Weiche Schatten können je Lichtquelle konfiguriert werden.
es: Difuminado de sombra ajustable por cada luz.
uk: Регульоване розмиття тіней на основі кожного світла.
zh_cn: 可以单独调整各个光源的阴影模糊。
zh_tw: 晃動可依像素級別或物件級別來判斷。

source: **Global illumination with indirect lighting:**
de: **Global Illumination mit indirekter Beleuchtung:**
es: ** Iluminación global con iluminación indirecta: **
uk: ** Глобальне освітлення з непрямим світлом: **
zh_cn: **具有间接照明的全局照明：**
zh_tw: **以間接光照進行全域照明：**

source: :ref:`Baked lightmaps <doc_using_lightmap_gi>` (fast, but can't be updated at run-time).
de: :ref:`Gebackene Lightmaps <doc_using_lightmap_gi>` (schnell, können aber nicht zur Laufzeit aktualisiert werden).
es: :ref:`Lightmaps precalculados (baked) <doc_using_lightmap_gi>` (rápidos pero no se pueden actualizar en tiempo de ejecución).
uk: :ref:`Запечені світлові карти <doc_using_lightmap_gi>` (швидко, але не може бути оновлена під час виконання).
zh_cn: :ref:`烘焙光照贴图 <doc_using_lightmap_gi>` （快速，但无法在运行时更新）。
zh_tw: :ref:`Baked lightmaps (烘焙光照圖) <doc_using_lightmap_gi>` (較快，但無法在執行時更新)。

source: Supports baking indirect light only or baking both direct and indirect lighting. The bake mode can be adjusted on a per-light basis to allow for hybrid light baking setups.
de: Unterstützt das Backen von nur indirektem Licht oder das Backen von sowohl direktem als auch indirektem Licht. Der Backmodus kann für jedes einzelne Licht eingestellt werden, um hybride Lichtback-Setups zu ermöglichen.
es: Admite el baking de iluminación indirecta unicamente o el baking de iluminación directa e indirecta. El modo de baking puede ajustarse por nivel de luz para permitir configuraciones híbridas de baking ligero.
uk: Підтримує запікання лише непрямого освітлення або запікання як прямого, так і непрямого освітлення. Режим запікання можна налаштувати залежно від світла, щоб забезпечити гібридні налаштування запікання.
zh_cn: 支持仅烘焙间接光照，或者同时烘焙直接和间接光照。可以给各个光源单独设置烘焙模式，从而实现混合光照烘焙。
zh_tw: 僅支援烘焙間接光源或同時烘焙直接光源和間接光源。 烘焙模式可以在每種光線的基礎上進行調整，以允許混合光線烘焙設定。

source: Supports lighting dynamic objects using automatic and manually placed probes.
de: Unterstützt die Beleuchtung dynamischer Objekte mit automatischen und manuell platzierten Probes.
es: Soporta objetos con iluminación dinámica dinámicos usando sondas manuales y automáticas.
uk: Підтримує освітлення динамічних об'єктів за допомогою автоматичних і ручних зондів.
zh_cn: 支持动态对象照明采用自动和手动布置探针。
zh_tw: 支援使用基於八叉樹的自動系統照明動態對象。 不需要手動放置探頭。

source: Optionally supports directional lighting and rough reflections based on spherical harmonics.
de: Unterstützt optional gerichtete Beleuchtung und grobe Reflexionen auf der Grundlage sphärischer Oberschwingungen.
es: Soporte opcional de iluminación direccional y reflejos duros basados en harmónicas esféricas.
uk: Додатково підтримує спрямоване освітлення та грубі відбиття на основі сферичних обертонів.
zh_cn: 可选支持基于球谐函数的平行光和粗糙反射。
zh_tw: 可選支援基於球諧函式的平行光和粗糙反射。

source: Lightmaps are baked on the GPU using compute shaders (much faster compared to CPU lightmapping). Baking can only be performed from the editor, not in exported projects.
de: Lightmaps werden auf der GPU unter Verwendung von Compute-Shadern gebacken (viel schneller als CPU-Lightmapping). Das Backen kann nur im Editor durchgeführt werden, nicht in exportierten Projekten.
es: Los lightmaps se crean en la GPU usando compute shaders (mucho más rápido comparado con el lightmapping en CPU). El baking sólo puede realizarse desde el editor, no en proyectos exportados.
uk: Карти світла запікаються на GPU за допомогою обчислювальних шейдерів (набагато швидше порівняно з картою освітлення CPU). Запікання можна виконувати лише з редактора, а не в експортованих проектах.
zh_cn: 光照贴图在 GPU 上使用计算着色器烘焙（与 CPU 计算光照贴图相比速度更快）。烘焙只能在编辑器中进行，不能在导出的项目中进行。
zh_tw: 光照貼圖在 GPU 上使用計算著色器烘焙（與 CPU 計算光照貼圖相比速度更快）。烘焙只能在編輯器中進行，不能在匯出的專案中進行。

source: Supports GPU-based :ref:`denoising <doc_using_lightmap_gi_denoising>` with JNLM, or CPU/GPU-based denoising with OIDN.
de: Unterstützt GPU-basiertes :ref:`Denoising <doc_using_lightmap_gi_denoising>` mit JNLM oder CPU/GPU-basiertes Denoising mit OIDN.
es: Soporte de :ref:`reducción de ruido <doc_using_lightmap_gi_denoising>` basado en GPU con JNLM, o reducción de ruido basado en CPU/GPU con OIDN.
uk: Підтримує :ref:`усунення шумів<doc_using_lightmap_gi_denoising>` на основі GPU за допомогою JNLM або на основі CPU/GPU за допомогою OIDN.
zh_cn: 支持使用 JNLM 进行基于 GPU 的 :ref:`降噪 <doc_using_lightmap_gi_denoising>`，或使用 OIDN 进行基于 CPU/GPU 的降噪。

source: :ref:`Voxel-based GI probes <doc_using_voxel_gi>`. Supports dynamic lights *and* dynamic occluders, while also supporting reflections. Requires a fast baking step which can be performed in the editor or at run-time (including from an exported project).
de: :ref:`Voxel-basierte GI-Probes<doc_using_voxel_gi>`. Unterstützt dynamische Lichter *und* dynamische Occluder, während auch Reflexionen unterstützt werden. Erfordert einen schnellen Back-Schritt, der im Editor oder zur Laufzeit durchgeführt werden kann (auch aus einem exportierten Projekt).
es: :ref:`Sondas GI basadas en Voxel <doc_using_voxel_gi>`. Soporta luces y obstructores dinámicos junto con soporte de reflejos. Requiere un paso rápido de bakeo que se puede ejecutar en el editor o en tiempo de ejecución (incluyendo en un proyecto exportado).
uk: :ref:`GI зонди на основі вокселів<doc_using_voxel_gi>`. Підтримує динамічне світло та динамічні оклюдери, а також підтримує відображення. Потрібен швидкий етап запікання, який можна виконати в редакторі або під час виконання (зокрема з експортованого проекту).
zh_cn: :ref:`基于体素的 GI 探针 <doc_using_voxel_gi>`。支持动态灯光\ *和*\ 动态遮挡器，同时还支持反射。需要执行快速烘焙步骤，该步骤可在编辑器中或运行时（包括从导出的项目中）执行。

source: :ref:`Signed-distance field GI <doc_using_sdfgi>` designed for large open worlds. Supports dynamic lights, but not dynamic occluders. Supports reflections. No baking required.
de: :ref:`Signed-Distance Field GI <doc_using_sdfgi>` für große offene Welten. Unterstützt dynamische Beleuchtung, aber keine dynamischen Occluder. Unterstützt Reflexionen. Kein Backen erforderlich.
es: :ref:`Signed-distance field GI <doc_using_sdfgi>` designado para mundos abiertos grandes. Soporta luces dinámicas pero no soporta obstructores ditnamicos, Soporta reflejos. No requiere bakeo.
zh_cn: :ref:`有符号距离场 GI <doc_using_sdfgi>` 是为大型开放世界设计的一种全局照明技术。支持动态光照，不支持动态遮挡器。可以支持反射效果。不需要进行烘焙操作。

source: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` at half or full resolution. Fully real-time and supports any kind of emissive light source (including decals).
de: :ref:`Screen-Space Indirect Lighting (SSIL) <doc_environment_and_post_processing_ssil>` mit halber oder voller Auflösung. Vollständig in Echtzeit und unterstützt jegliche Art von emissiver Lichtquelle (inklusive Decals).
es: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>`a media resolución o completa. Completamente en tiempo real y soporta cualquier tipo de origen de luz emisiva (incluyendo decals).
uk: :ref:`Непряме освітлення екранного простору (Screen-space indirect lighting (SSIL))<doc_environment_and_post_processing_ssil>` із половинною або повною роздільною здатністю. Повністю в реальному часі та підтримує будь-які джерела випромінюваного світла (включаючи декалі).
zh_cn: :ref:`屏幕空间间接光照（SSIL）<doc_environment_and_post_processing_ssil>`，可以选择半分辨率或全分辨率。它完全实时，支持任何类型的自发光光源（包括贴花）。

source: VoxelGI and SDFGI use a deferred pass to allow for rendering GI at half resolution to improve performance (while still having functional MSAA support).
de: VoxelGI und SDFGI verwenden einen verzögerten Durchlauf, um das Rendering von GI in halber Auflösung zu ermöglichen und so die Leistung zu verbessern (und gleichzeitig eine funktionale MSAA-Unterstützung zu bieten).
es: VoxelGI y SDFGI utiliza un paso diferido para permitir que se pueda renderizar la GI a media resolución para mejorar el rendimiento (mientras se mantiene soporte funcional a MSAA).
uk: VoxelGI та SDFGI використовують відкладений прохід, щоб дозволити візуалізацію GI з половинною роздільною здатністю для покращення продуктивності (продовжуючи функціональну підтримку MSAA).
zh_cn: VoxelGI 和 SDFGI 使用延迟渲染通道，可以在半分辨率下渲染全局光照，以提高性能（同时还支持 MSAA 抗锯齿）。
zh_tw: VoxelGI 和 SDFGI 使用延遲算繪通道，可以在半解析度下算繪全域光照，以提高性能（同時還支援 MSAA 抗鋸齒）。

source: **Reflections:**
de: **Reflexionen:**
es: **Reflexiones:**
uk: **Відображення:**
zh_cn: **反射：**
zh_tw: **反射：**

source: Voxel-based reflections (when using GI probes) and SDF-based reflections (when using signed distance field GI). Voxel-based reflections are visible on transparent surfaces, while rough SDF-based reflections are visible on transparent surfaces.
de: Voxelbasierte Reflexionen (bei Verwendung von GI-Probes) und SDF-basierte Reflexionen (bei Verwendung von Signed Distance Field-GI). Voxel-basierte Reflexionen sind auf transparenten Oberflächen sichtbar, während raue SDF-basierte Reflexionen auf transparenten Oberflächen sichtbar sind.
es: Reflejos basados en voxel (cuando se utilizan sondas GI) y reflejos basados en SDF (cuando se utiliza signed distance field GI). Reflejos basados en voxel son visibles en superficies transparentes y reflejos duros basados en SDF también.
uk: Відбиття на основі вокселів (при використанні зондів GI) і відбиття на основі SDF (при використанні SDF GI). Відображення на основі вокселів видно на прозорих поверхнях, тоді як грубі відображення на основі SDF видно на прозорих поверхнях.
zh_cn: 基于体素的反射（使用 GI 探针时）和基于 SDF 的反射（使用符号距离场 GI 时）。基于体素的反射在透明表面上可见，而基于粗糙 SDF 的反射在透明表面上可见。

source: Fast baked reflections or slow real-time reflections using ReflectionProbe. Parallax box correction can optionally be enabled.
de: Schnell gebackene Reflexionen oder langsame Echtzeit-Reflexionen nutzen ReflectionProbe. Parallaxe Korrekturen können wahlweise eingeschaltet werden.
es: Reflexiones rápidas precalculadas o reflexiones lentas en tiempo real usando ReflectionProbe. Opcionalmente, se puede habilitar la corrección de paralaje.
uk: Швидке запечене відображення, або повільне в реальному часі з використанням ReflectionProbe (Зонда Відображення). За бажання можна увімкнути параллаксну коробку корекції.
zh_cn: 使用 ReflectionProbe 实现较快的烘焙反射或较慢的实时反射。可以选择启用视差盒校正。
zh_tw: 使用 ReflectionProbe 來快速烘焙反射或較慢的即時反射。可選擇性開啟平行矯正。

source: Screen-space reflections with support for material roughness.
de: Screen-Space-Reflexionen mit Unterstützung für Material-Rauheit.
es: Reflejos en espacio de pantalla con soporte de rugosidad de material.
uk: Відображення екранного простору з підтримкою шорсткості матеріалу.
zh_cn: 支持材料粗糙度的屏幕空间反射。
zh_tw: 支援材料粗糙度的螢幕空間反射。

source: Reflection techniques can be mixed together for greater accuracy or scalability.
de: Reflexionstechniken können für eine höhere Präzision und Skalierbarkeit kombiniert werden.
es: Las técnicas de reflexión pueden mezclarse para obtener mayor precisión o escalabilidad.
uk: Техніки відображення можна змішувати для більшої точності або масштабованості.
zh_cn: 可以混用反射技术，以获得更高的准确性或可扩展性。
zh_tw: 可混合使用多個反射技術以取得更高的精確度。

source: When using the Forward+ backend (default on desktop), reflection probes are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of reflection probes that can be used on a mesh.
de: Bei Verwendung des Forward+ Backends (Default bei Desktop) werden Reflexions-Probes mit „clustered forward“-Optimierungen gerendert, um ihre individuellen Kosten zu senken. Durch das Cluster-Rendering werden auch alle Beschränkungen für die Anzahl der Reflexions-Probes aufgehoben, die in einem Mesh verwendet werden können.
es: Cuando se utiliza el backend Forward+ (por defecto en escritorio), las sondas de reflejos son renderizadas con optimizaciones clustered forward para disminuir su costo individual. El rendering clustered también aumenta el límite en el número de sondas de reflejo que se puede utilizar en una malla.
uk: При використанні режиму Forward+ (за замовчуванням на настільному комп’ютері) зонди відображення візуалізуються з кластерною оптимізацією вперед, щоб зменшити їх окрему вартість. Кластерний рендеринг також скасовує будь-які обмеження на кількість зондів відбиття, які можна використовувати на сітці.
zh_cn: 使用 Forward+ 后端时（桌面平台的默认设置），反射探针会使用集群前向优化来降低它们的单独开销。集群渲染也消除了在一个网格上使用的反射探针的数量限制。
zh_tw: 使用 Forward+ 後端時（桌面平臺的預設設定），反射探查會使用集群前向優化來降低它們的單獨開銷。集群算繪也消除了在一個網格上使用的反射探查的數量限制。

source: When using the Forward Mobile backend, up to 8 reflection probes can be displayed per mesh resource.
de: Bei Verwendung des Forward Mobile-Backends können bis zu 8 Reflexions-Probes pro Mesh-Ressource angezeigt werden.
es: Cuando se utiliza el backend Forward Mobile, se pueden mostrar hasta 8 sondas de reflejo por cada malla.
uk: При використанні режиму Forward Mobile можна відображати до 8 зондів відбиття на один ресурс сітки.
zh_cn: 使用Forward Mobile后端时，每个网格资源最多可以显示8个反射探针。
zh_tw: 使用Forward Mobile後端時，每個網格資源最多可以顯示8個反射探查。

source: **Decals:**
uk: **Наклейки:**
zh_cn: **贴花：**
zh_tw: **功能：**

source: :ref:`Supports albedo <doc_using_decals>`, emissive, :abbr:`ORM (Occlusion Roughness Metallic)`, and normal mapping.
de: :ref:`Unterstützt Albedo<doc_using_decals>`, emissives, :abbr:`ORM (Occlusion Roughness Metallic)` und Normal-Mapping.
es: :ref:`Soporta albedo <doc_using_decals>`, emissivo, :abbr:`ORM (Occlusion Roughness Metallic)`, y mapa de normales.
uk: :ref:`Підтримує альбедо <doc_using_decals>`, емісію, :abbr:`ORM (Occlusion Roughness Metallic)`, і карти нормалей.
zh_cn: :ref:`支持漫反射 <doc_using_decals>`，自发光， :abbr:`ORM (遮挡度粗糙度金属度)` 和法线贴图。

source: Texture channels are smoothly overlaid on top of the underlying material, with support for normal/ORM-only decals.
de: Texturkanäle werden glatt über das darunterliegende Material gelegt, wobei normale/ORM-only-Decals unterstützt werden.
es: Canales de textura son suavemente superpuestos sobre el material subyacente, con soporte de decals solo de normal/ORM.
uk: Текстурні канали плавно накладаються на базовий матеріал із підтримкою звичайних/лише-ORM декалей.
zh_cn: 纹理通道可以平滑地叠加在底层材料之上，并支持普通/纯 ORM 贴花。
zh_tw: 紋理通道可以平滑地疊加在底層材料之上，並支援普通/純 ORM 裝飾。

source: Support for normal fade to fade the decal depending on its incidence angle.
de: Unterstützung für normales Ausblenden, um das Decal je nach Einfallswinkel auszublenden.
es: Soporte para difuminado normal para difuminar decals dependiendo del ángulo de incidencia.
zh_cn: 支持根据入射角度来淡出贴花的法线淡出效果。
zh_tw: 支援根據入射角度來淡出裝飾的法線淡出效果。

source: Does not rely on run-time mesh generation. This means decals can be used on complex skinned meshes with no performance penalty, even if the decal moves every frame.
de: Ist nicht auf die Generierung von Meshes in der Laufzeit angewiesen. Das bedeutet, dass Decals ohne Leistungseinbußen auf komplexen Skinned-Meshes verwendet werden können, selbst wenn sich das Decal in jedem Frame bewegt.
es: No depende en generación de mallas en tiempo de ejecución. Esto quiere decir que los decals pueden usarse en skinned meshes complejas sin penalización de performance, aún cuando el decal se mueva en cada frame.
uk: Не покладається на генерацію сітки під час виконання. Це означає, що наклейки можна використовувати на сітках зі складною оболонкою без погіршення продуктивності, навіть якщо наклейка пересувається в кожному кадрі.
zh_cn: 不依赖实时网格生成。这意味着贴花可用于复杂的蒙皮网格，即使贴花每帧都在移动，也不会影响性能。
zh_tw: 不依賴即時網格生成。這意味著裝飾可用於複雜的蒙皮網格，即使裝飾每影格都在移動，也不會影響性能。

source: Support for nearest, bilinear, trilinear or anisotropic texture filtering (configured globally).
de: Unterstützung für Nearest, Bilinear, Trilinear oder Anisotropic Texture Filtering (global konfiguriert).
es: Soporte de filtro más cercano, bilineal, trilineal o anisotrópico (configurado globalmente).
uk: Підтримка найближчої, білінійної, трилінійної або анізотропної фільтрації текстур (налаштовується глобально).
zh_cn: 支持最近邻、双线性、三线性、各向异性纹理过滤（全局设置）。
zh_tw: 最近、雙線性、三線性或各向異性篩選。

source: When using the Forward+ backend (default on desktop), decals are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of decals that can be used on a mesh.
de: Bei Verwendung des Forward+-Backends (Default bei Desktop) werden Decals mit Clustered-Forward-Optimierungen gerendert, um ihre individuellen Kosten zu senken. Das Cluster-Rendering hebt auch alle Beschränkungen für die Anzahl der Decals auf, die auf einem Mesh verwendet werden können.
es: Cuando se utiliza el backend Forward+ (por defecto en escritorio), los decals son renderizados con optimizaciones clustered forward para reducir so costo individual. El rendering clustered también aumenta el límide de la cantidad de decals que se pueden utilizar en una malla.
uk: При використанні режиму Forward+ (за умовчанням на настільному комп’ютері) наклейки відображаються з кластерною оптимізацією вперед, щоб зменшити їх окрему вартість. Кластерний рендеринг також скасовує будь-які обмеження на кількість наклейок, які можна використовувати на сітці.
zh_cn: 使用 Forward+ 后端时（桌面平台的默认设置），贴花会使用集群前向优化来降低它们的单独开销。集群渲染也消除了在一个网格上使用的贴花的数量限制。
zh_tw: 使用 Forward+ 後端時（桌面平臺的預設設定），裝飾會使用集群前向優化來降低它們的單獨開銷。集群算繪也消除了在一個網格上使用的裝飾的數量限制。

source: When using the Forward Mobile backend, up to 8 decals can be displayed per mesh resource.
de: Bei Verwendung des Forward Mobile-Backends können bis zu 8 Decals pro Mesh-Ressource angezeigt werden.
es: Cuando se utiliza el backend Forward Mobile, se pueden mostrar hasta 8 decals por malla.
uk: При використанні режиму Forward Mobile можна відображати до 8 наклейок на один ресурс сітки.
zh_cn: 使用Forward Mobile后端时，每个网格资源最多可以显示8个贴花。
zh_tw: 使用Forward Mobile後端時，每個網格資源最多可以顯示8個裝飾。

source: **Sky:**
de: **Himmel:**
es: **Cielo:**
uk: **Небо:**
zh_cn: **天空:**
zh_tw: **天空:**

source: Panorama sky (using an HDRI).
de: Panorama Himmel (nutzt HDRI).
es: Cielo panorámico (usando un HDRI).
uk: Панорамне небо (з використанням HDRI).
zh_cn: 全景天空（使用 HDRI）。
zh_tw: 全景天空 (使用 HDRI)。

source: Procedural sky and Physically-based sky that respond to the DirectionalLights in the scene.
de: Prozeduraler Himmel und Physik-basierter Himmel, die auf die DirectionalLights in der Szene reagieren.
es: Cielo procedural y basado en física que puede responder a las luces direccionales en la escena.
uk: Процедурне небо та фізичне небо, які реагують на направлене світло в сцені.
zh_cn: 程序天空和基于物理的天空，用于响应场景中的方向光。
zh_tw: 程式天空和基於物理的天空，用於回應場景中的方向光。

source: Support for :ref:`custom sky shaders <doc_sky_shader>`, which can be animated.
de: Unterstützung für :ref:`Benutzerdefinierte Himmel-Shader <doc_sky_shader>`, die animiert werden können.
es: Soporte para :ref:`shaders personalizados para el cielo <doc_sky_shader>`, que pueden ser animados.
uk: Підтримує :ref:`користувацькі шейдери неба <doc_sky_shader>`, які можна анімувати.
zh_cn: 支持 :ref:`自定义天空着色器 <doc_sky_shader>` 可以进行动画处理。
zh_tw: 支援 :ref:`自訂天空著色器 <doc_sky_shader>` 可以進行動畫處理。

source: The radiance map used for ambient and specular light can be updated in real-time depending on the quality settings chosen.
de: Die für das Umgebungs- und Glanzlicht verwendete Radiance Map kann je nach den gewählten Qualitätseinstellungen in Echtzeit aktualisiert werden.
es: El mapa de brillo usado para luz ambiental y especular puede ser actualizado en tiempo real dependiendo de los ajuste de calidad seleccionados.
uk: Карту яскравості, яка використовується для навколишнього та дзеркального світла, можна оновлювати в режимі реального часу залежно від вибраних параметрів якості.
zh_cn: 取决于所选的质量设置，用于环境光和镜面反射光的辐射图可以实时更新。
zh_tw: 取決於所選的品質設定，用於環境光和鏡面反射光的輻射圖可以即時更新。

source: **Fog:**
de: **Nebel:**
es: **Niebla:**
uk: **Туман:**
zh_cn: **雾:**
zh_tw: **霧：**

source: Exponential depth fog.
de: Exponentialer Tiefennebel.
es: Niebla de profundidad exponencial.
uk: Глибокий туман.
zh_cn: 指数深度雾。
zh_tw: 指數深度霧。

source: Exponential height fog.
de: Exponentialer Höhennebel.
es: Niebla de altura exponencial.
uk: Високий туман.
zh_cn: 指数高度雾。
zh_tw: 指數高度霧。

source: Support for automatic fog color depending on the sky color (aerial perspective).
de: Unterstützung für automatische Nebelfarbe in Abhängigkeit von der Himmelsfarbe (Luftperspektive).
es: Soporte para coloreado automático de niebla, dependiente del color del cielo (perspectiva aérea).
uk: Підтримка автоматичного кольору туману залежно від кольору неба (повітряна перспектива).
zh_cn: 支持根据天空颜色自动调整雾的颜色（使用大气透视）。
zh_tw: 支援依照相機角度自動調整深度霧色彩 (以配合陽光的色彩)。

source: Support for sun scattering in the fog.
de: Unterstützung der Sonnenstreuung im Nebel.
es: Soporte de dispersión de sol en la niebla.
uk: Підтримка розсіювання сонця в тумані.
zh_cn: 支持雾中的太阳散射。
zh_tw: 支援視覺著色器外掛。

source: Support for controlling how much fog rendering should affect the sky, with separate controls for traditional and volumetric fog.
de: Unterstützung für die Steuerung des Einflusses des Nebels auf den Himmel, mit separaten Steuerelementen für traditionellen und volumetrischen Nebel.
es: Soporte para controlar cuánto renderizado de niebla debería afectar el cielo, con controles separados para niebla tradicional y volumétrica.
uk: Підтримка контролю того, наскільки візуалізація туману має впливати на небо, з окремими елементами керування для традиційного та об’ємного туману.
zh_cn: 支持控制雾的渲染对天空的影响程度，对传统的雾和体积雾进行单独控制。

source: Support for making specific materials ignore fog.
de: Unterstützung für das Ignorieren des Nebels bei bestimmten Materialien.
es: Soporte para que materiales específicos ignoren la niebla.
uk: Підтримка ігнорування туману певними матеріалами.
zh_cn: 支持使特定材质忽略雾。

source: **Volumetric fog:**
de: **Volumetrischer Nebel:**
es: **Niebla volumétrica**
uk: **Об'ємний туман:**
zh_cn: **体积雾：**
zh_tw: **體積霧：**

source: Global :ref:`volumetric fog <doc_volumetric_fog>` that reacts to lights and shadows.
de: Globaler :ref:`volumetrischer Nebel <doc_volumetric_fog>`, der auf Licht und Schatten reagiert.
es: :ref:`Niebla volumétrica <doc_volumetric_fog>`global que reacciona a luces y sombras.
uk: Глобальний :ref:`об'ємний туман<doc_volumetric_fog>`, який реагує на світло і тіні.
zh_cn: 对光影做出反应的全局 :ref:`体积雾<doc_volumetric_fog>`。
zh_tw: 對光影做出反應的全域 :ref:`體積霧<doc_volumetric_fog>`。

source: Volumetric fog can take indirect light into account when using VoxelGI or SDFGI.
de: Volumetrischer Nebel kann bei Verwendung von VoxelGI oder SDFGI auch indirektes Licht berücksichtigen.
es: Niebla volumétrica que toma en cuenta la luz indirecta cuando se utiliza VoxelGI o SDFGI.
uk: Об’ємний туман може враховувати непряме світло при використанні VoxelGI або SDFGI.
zh_cn: 在使用VoxelGI或SDFGI时体积雾可以受间接光影响。
zh_tw: 在使用VoxelGI或SDFGI時體積霧可以受間接光影響。
