Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: Support for visual shader plugins.
de: Unterstützung für visuelle Shader Plugins.
es: Soporte para plugins de visual shader.
uk: Підтримка плагінів візуальних шейдерів.
zh_cn: 支持可视化着色器插件。
zh_tw: 支援視覺著色器外掛。

source: Scripting
de: Skripting
uk: Скриптинґ
zh_cn: 编写脚本
zh_tw: 撰寫腳本

source: **General:**
de: **Allgemein:**
uk: **Загальне:**
zh_cn: **常规:**
zh_tw: **一般：**

source: Object-oriented design pattern with scripts extending nodes.
de: Objektorientiertes Design Pattern mit Skripten, um Nodes zu erweiterten.
es: Patrón de diseño orientado a objetos con scripts que extienden los nodos.
uk: Об'єктно-орієнтований шаблон проєктування зі скриптами, що розширюють вузли.
zh_cn: 具有脚本扩展节点的面向对象设计模式.
zh_tw: 可通過腳本來擴充節點的物件導向設計模式。

source: Signals and groups for communicating between scripts.
de: Signale und Gruppen zur Kommunikation zwischen Skripten.
es: Señales y grupos para la comunicación entre scripts.
uk: Сигнали та групи для обміну даними між скриптами.
zh_cn: 用于脚本之间通信的信号和组.
zh_tw: 可通過訊號與群組來在腳本間進行通訊。

source: Support for :ref:`cross-language scripting <doc_cross_language_scripting>`.
de: Unterstützung für :ref:`sprachübergreifendes Skripten <doc_cross_language_scripting>`.
es: Soporte para :ref:`scripting en varios idiomas <doc_cross_language_scripting>`.
uk: Підтримка :ref:`багатомовних скриптів <doc_cross_language_scripting>`.
zh_cn: 支持\ :ref:`跨语言脚本编程 <doc_cross_language_scripting>`\ 。
zh_tw: 支援 :ref:`跨語言腳本編寫 <doc_cross_language_scripting>` 。

source: Many 2D, 3D and 4D linear algebra data types such as vectors and transforms.
de: Viele 2D-, 3D- und 4D- Datentypen der linearen Algebra wie Vektoren und Transformationen.
es: Muchos tipos de datos de álgebra lineal 2D, 3D y 4D, como vectores y transformaciones.
uk: Багато типів даних 2D, 3D і 4D лінійної алгебри, таких як вектори і перетворення.
zh_cn: 多种二维、三维以及四维线性代数数据类型，比如向量和变换。
zh_tw: 多種 2D 與 3D 線性代數資料型別，如向量與變換(transforms)。

source: :ref:`High-level interpreted language <doc_gdscript>` with :ref:`optional static typing <doc_gdscript_static_typing>`.
de: :ref:`High-Level Interpreter Sprache <doc_gdscript>` mit :ref:`optionaler statischer Typisierung <doc_gdscript_static_typing>`.
es: :ref:`Lenguaje interpretado de alto nivel <doc_gdscript>` con :ref: `tipado estático opcional <doc_gdscript_static_typing>`.
uk: :ref:`Високорівнева інтерпретована мова <doc_gdscript>` з :ref:`необов'язковою статичною типізацією <doc_gdscript_static_typing>`.
zh_cn: 带 :ref:`可选静态类型 <doc_gdscript_static_typing>`\ 的\ :ref:`高级解释语言 <doc_gdscript>`\ 。
zh_tw: 具有 :ref:`可選靜態型別 <doc_gdscript_static_typing>` 的 :ref:`高階直譯式語言 <doc_gdscript>` 。

source: Syntax inspired by Python. However, GDScript is **not** based on Python.
de: Die Syntax ist von Python inspiriert. GDScript basiert jedoch **nicht** auf Python.
es: Sintaxis inspirada en Python. Aunque GDScript **no** está basado en Python.
zh_cn: 语法的灵感来自 Python。然而 GDScript **并不**\ 基于 Python。
zh_tw: 語法的靈感來自 Python。然而 GDScript **不是** 基於 Python。

source: Syntax highlighting is provided on GitHub.
de: Syntax Highlighting auf GitHub wird unterstützt.
es: El resaltado de sintaxis se proporciona en GitHub.
uk: Підсвітка синтаксису передбачена на GitHub.
zh_cn: GitHub 上提供了语法高亮显示。
zh_tw: 在 GitHub 上有語法醒目提示。

source: :ref:`Use threads <doc_using_multiple_threads>` to perform asynchronous actions or make use of multiple processor cores.
de: :ref:`Verwendung von Threads <doc_using_multiple_threads>` um asynchrone Aktionen auszuführen oder um mehrere Prozessor-Cores zu nutzen.
es: :ref:`Use hilos <doc_using_multiple_threads>` para realizar acciones asincrónicas o hacer uso de múltiples núcleos de procesador.
uk: :ref:`Використання потоків <doc_using_multiple_threads>` для виконання асинхронних дій, або використання декількох ядер процесора.
zh_cn: :ref:`使用线程 <doc_using_multiple_threads>`\ 执行异步操作或使用多个处理器内核。
zh_tw: 可 :ref:`使用執行緒 <doc_using_multiple_threads>` 來進行異步操作，或使用多處理器核心。

source: Packaged in a separate binary to keep file sizes and dependencies down.
de: In einer separaten Binärdatei verpackt, um Dateigrößen und Abhängigkeiten gering zu halten.
es: Empaquetado en un binario separado para mantener bajos los tamaños de archivo y las dependencias.
uk: Упаковано в окремий бінарний файл, щоб зменшити розміри файлів та залежності.
zh_cn: 打包成一个单独的二进制文件，以保持文件大小和依赖关系。
zh_tw: 打包為獨立二進位檔案，以減少檔案大小與相依性。

source: Supports .NET 6 and higher.
de: Unterstützt .NET 6 und höher.
es: Soporte de .NET 6 y superior.
zh_cn: 支持.NET 6 及更高版本。

source: Full support for the C# 10.0 syntax and features.
de: Vollständige Unterstützung für C# 10.0 Syntax und Features.
es: Soporte completo para la sintaxis y características de C# 10.0.
uk: Повна підтримка синтаксису та можливостей C# 10.0.
zh_cn: 完全支持C#10.0语法和功能.
zh_tw: 完整支援 C# 7.0 語法與功能。

source: Supports Windows, Linux, and macOS. As of 4.2 experimental support for Android and iOS is also available (requires a .NET 7.0 project for Android and 8.0 for iOS).
de: Unterstützt Windows, Linux und macOS. Ab Version 4.2 ist auch experimentelle Unterstützung für Android und iOS verfügbar (erfordert ein .NET 7.0-Projekt für Android und 8.0 für iOS).
es: Soporte de Windows, Linux y macOS. Desde 4.2 también hay soporte experimental para iOS y Android (requiere un proyecto .NET 7.0 para Android y 8.0 para iOS).
zh_cn: 支持 Windows、Linux 和 macOS。从 4.2 开始，还提供对 Android 和 iOS 的实验性支持（需要适用于 Android 的 .NET 7.0 项目和适用于 iOS 的 .NET 8.0 项目）。

source: On the Android platform only some architectures are supported: ``arm64`` and ``x64``.
de: Auf der Android-Plattform werden nur einige Architekturen unterstützt: ``arm64`` und ``x64``.
es: En la plataforma Android sólo algunas arquitecturas están soportadas: ``arm64`` y ``x64``.
zh_cn: 在 Android 平台上，仅支持部分架构： ``arm64`` 和 ``x64`` 。

source: On the iOS platform only some architectures are supported: ``arm64``.
de: Auf der iOS-Plattform werden nur einige Architekturen unterstützt: ``arm64``.
es: En la plataforma iOS sólo algunas arquitecturas están soportadas ``arm64``.
zh_cn: 在 iOS 平台上，仅支持某部分架构： ``arm64`` 。

source: The web platform is currently unsupported. To use C# on that platform, consider Godot 3 instead.
de: Die Web-Plattform wird derzeit nicht unterstützt. Um C# auf dieser Plattform zu verwenden, sollten Sie stattdessen Godot 3 in Betracht ziehen.
es: La plataforma web actualmente no está soportada. Para utilizar C# en esta plataforma, considera utilizar Godot 3 en su lugar.
zh_cn: 目前不支持 Web 平台。要在该平台上使用 C # ，请考虑改用 Godot 3。
zh_tw: 瀏覽器平臺暫不支援。要在該平臺上使用 C # 請改用 Godot 3。

source: Using an external editor is recommended to benefit from IDE functionality.
de: Nutzung eines externen Editors wird empfohlen um von der IDE-Funktionalität zu profitieren.
es: Se recomienda utilizar un editor externo para beneficiarse de la funcionalidad IDE.
uk: Рекомендується використовувати зовнішній редактор, щоб скористатися функціоналом IDE.
zh_cn: 建议使用外部编辑器以从IDE功能中获益.
zh_tw: 建議使用外部編輯器以獲得更多 IDE 功能。

source: When you need it, link to native libraries for higher performance and third-party integrations.
de: Stellen Sie bei Bedarf eine Verknüpfung zu nativen Bibliotheken her, um eine höhere Leistung und eine Integrationen von Drittanbietern zu erzielen.
es: Cuando lo necesite, enlace a bibliotecas nativas para un mayor rendimiento e integraciones de terceros.
uk: Коли вам це потрібно, перейдіть за посиланням на власні бібліотеки для підвищення продуктивності та сторонніх інтеграцій.
zh_cn: 在需要时, 可以链接到本机库以获得更高的性能和第三方集成.
zh_tw: 當有需要時，可通過連接到原生函式庫以獲得更佳效能與進行第三方整合。

source: For scripting game logic, GDScript or C# are recommended if their performance is suitable.
de: Um Spiele-Logik zu skripten wird GDScript oder C# empfohlen, wenn deren Leistung ausreicht.
es: Para la lógica del juego de secuencias de comandos, se recomiendan GDScript o C # si su rendimiento es adecuado.
uk: Для написання скриптів ігрової логіки рекомендується GDScript, або C#, якщо їх продуктивність підходить.
zh_cn: 对于脚本游戏逻辑, 如果性能足够, 建议使用 GDScript 或 C#.
zh_tw: 若要撰寫遊戲腳本邏輯，則建議在效能允許的情況下使用 GDScript 或 C#。

source: Official GDExtension bindings for `C <https://github.com/godotengine/godot-headers>`__ and `C++ <https://github.com/godotengine/godot-cpp>`__.
de: Offizielle GDExtension Bindings für `C <https://github.com/godotengine/godot-headers>`__ und `C++ <https://github.com/godotengine/godot-cpp>`__.
es: Bindings official de GDExtension para `C <https://github.com/godotengine/godot-headers>`__ y `C++ <https://github.com/godotengine/godot-cpp>`__.
zh_cn: 官方对 `C <https://github.com/godotengine/godot-headers>`__ 和 `C++ <https://github.com/godotengine/godot-cpp>`__ 的 GDExtension 绑定。
zh_tw: 官方對 `C <https://github.com/godotengine/godot-headers>`__ 和 `C++ <https://github.com/godotengine/godot-cpp>`__ 的 GDExtension 綁定。

source: Use any build system and language features you wish.
de: Nutzen Sie das Buildsystem und die Sprachfeatures die Sie möchten.
es: Utilice cualquier sistema de compilación y funciones de idioma que desee.
uk: Використовуйте, за своїм бажанням, будь-яку систему побудови та мовні функції.
zh_cn: 使用任何你想要的构建系统和语言功能.
zh_tw: 可依照需求使用任何建置系統與語言功能。

source: Actively developed GDExtension bindings for `D <https://github.com/godot-dlang/godot-dlang>`__, `Haxe <https://hxgodot.github.io/>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, and `Rust <https://github.com/godot-rust/gdextension>`__ bindings provided by the community. (Some of these bindings may be experimental and not production-ready).
de: Aktiv entwickelte GDExtension Bindings für `D <https://github.com/godot-dlang/godot-dlang>`__, `Haxe <https://hxgodot.github.io/>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, und `Rust <https://github.com/godot-rust/gdextension>`__-Bindings, die von der Community zur Verfügung gestellt werden. (Einige dieser Bindings können experimentell und nicht produktionsreif sein).
es: Bindings de GDExtension desarrollados activamente por la comunidad para `D <https://github.com/godot-dlang/godot-dlang>`__, `Haxe <https://hxgodot.github.io/>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, y `Rust <https://github.com/godot-rust/gdextension>`__. (Algunos de esos bindings pueden ser experimentales y no estar listos para producción).
zh_cn: 社区积极开发对 `D <https://github.com/godot-dlang/godot-dlang>`__\ 、\ `Haxe <https://hxgodot.github.io/>`__\ 、\ `Swift <https://github.com/migueldeicaza/SwiftGodot>`__ 和 `Rust <https://github.com/godot-rust/gdextension>`__ 的 GDExtension 绑定（其中一些绑定可能是实验性的，不适合生产）。

source: Audio
uk: Аудіо
zh_cn: 音频
zh_tw: 音訊

source: Mono, stereo, 5.1 and 7.1 output.
de: Mono, Stereo, 5.1 und 7.1 Ausgabe.
es: Salida mono, estéreo, 5.1 y 7.1.
uk: Вихід моно, стерео, 5.1 та 7.1.
zh_cn: 单声道、立体声、5.1 和 7.1 输出。
zh_tw: 單聲道、立體聲、5.1 與 7.1 輸出。

source: Non-positional and positional playback in 2D and 3D.
de: Positionale und nicht-positionale Wiedergabe in 2D und 3D.
es: Reproducción posicional y no posicional en 2D y 3D.
uk: Непозиційне та позиційне відтворення в 2D та 3D.
zh_cn: 2D 和 3D 的非定位和定位播放。
zh_tw: 在 2D 與 3D 空間中的非位置性與位置性播放。

source: Optional Doppler effect in 2D and 3D.
de: Optionaler Doppler-Effekt in 2D und 3D.
es: Effecto doppler 2D y 3D opcional.
uk: Необов'язковий ефект Доплера в 2D та 3D.
zh_cn: 选择 2D 或 3D 的多普勒效应。
zh_tw: 在 2D 與 3D 中提供可選的都卜勒效應。

source: Support for re-routable :ref:`audio buses <doc_audio_buses>` and effects with dozens of effects included.
de: Unterstützung für Re-Routable :ref:`Audio Busse <doc_audio_buses>` und Effekte.
es: Soporte para redireccionamiento :ref:`audio buses <doc_audio_buses>` y efectos con docenas de efectos incluidos.
uk: Підтримка перенаправлення :ref:`аудіо шин<doc_audio_buses>` і ефектів з десятками включених ефектів.
zh_cn: 支持重路由 :ref:`音频总线 <doc_audio_buses>` 以及大量其它效果.
zh_tw: 支援可重新導向的 :ref:`音訊匯流排 <doc_audio_buses>` 與特效，並包含數十種特效。

source: Support for polyphony (playing several sounds from a single AudioStreamPlayer node).
de: Unterstützung für Polyphonie (Abspielen mehrerer Klänge von einem einzigen AudioStreamPlayer-Node).
es: Soporte para polifonía (reproducir varios sonidos desde un único nodo AudioStreamPlayer).
zh_cn: 支持复调（使用单个 AudioStreamPlayer 节点播放多个声音）。
zh_tw: 支援複調（使用單個 AudioStreamPlayer 節點播放多個聲音）。

source: Support for random volume and pitch.
de: Unterstützung für zufällige Lautstärke und Tonhöhe.
es: Soporte volumen y tono aleatorio.
uk: Підтримка довільної гучності та висоти тону.
zh_cn: 支持随机音量和音高。
zh_tw: 支援視覺著色器外掛。

source: Support for real-time pitch scaling.
de: Unterstützung für die Tonhöhenskalierung in Echtzeit.
es: Soporte de escalado de tono en tiempo real.
uk: Підтримка масштабування висоти тону в реальному часі.
zh_cn: 支持实时音高缩放。
zh_tw: 支援視覺著色器外掛。

source: Support for sequential/random sample selection, including repetition prevention when using random sample selection.
de: Unterstützung für sequentielle/zufällige Stichprobenauswahl, einschließlich der Vermeidung von Wiederholungen wenn eine zufällige Stichprobe gezogen wird.
es: Soporte de selección por muestra secuencial/azar, incluyendo prevención de repetición cuando se utiliza una selección por muestra al azar.
zh_cn: 支持顺序 / 随机采样，包括在随机采样时防止重复。
zh_tw: 支援順序 / 隨機取樣，包括在隨機取樣時防止重複。

source: Listener2D and Listener3D nodes to listen from a position different than the camera.
de: Listener2D und Listener3D Node um von einer anderen Position als die Kamera zu hören.
es: Nodos Listener2D y Listener3D para escuchar desde una posición diferente a la cámara.
uk: Вузли Listener2D та Listener3D для прослуховування з іншої позиції, ніж камера.
zh_cn: Listener2D 和 Listener3D 节点从不同于摄像机的位置进行侦听。
zh_tw: Listener3D 節點可用於在 3D 空間中以與相機的位置進行監聽。

source: Support for :ref:`procedural audio generation <class_AudioStreamGenerator>`.
de: Unterstützung für :ref:`prozedurale Audiogenerierung <class_AudioStreamGenerator>`.
es: Soporte de :ref:`generación de audio procedural <class_AudioStreamGenerator>`.
uk: Підтримка :ref:`процедурної генерації звуку <клас_AudioStreamGenerator>`.
zh_cn: 支持\ :ref:`程序式音频生成 <class_AudioStreamGenerator>`\ 。
zh_tw: 用於 :ref:`產生集合 <doc_procedural_geometry>` 的工具。

source: Audio input to record microphones.
de: Audioeingang zur Aufnahme von Mikrofonen.
es: Entrada de audio para grabar micrófonos.
zh_cn: 录制麦克风的音频输入。
zh_tw: 錄製麥克風的音訊輸入。

source: MIDI input.
de: MIDI-Eingang.
es: Entrada MIDI.
uk: MIDI вхід.
zh_cn: MIDI 输入.
zh_tw: MIDI 輸入。

source: No support for MIDI output yet.
de: Momentan keine Unterstützung für MIDI-Ausgabe.
es: No hay soporte para salida MIDI todavía.
uk: Ще не підтримується вихід MIDI.
zh_cn: 尚不支持MIDI输出.
zh_tw: 尚未支援 MIDI 輸出。

source: **APIs used:**
de: **genutzte APIs:**
es: **APIs usadas:**
uk: **Використані API:**
zh_cn: **使用的 API：**
zh_tw: **所用 API:**

source: *Linux:* PulseAudio or ALSA.
de: *Linux:* PulseAudio oder ALSA.
es: *Linux:* PulseAudio o ALSA.
uk: *Linux:* PulseAudio чи ALSA.
zh_cn: *Linux：* PulseAudio 或 ALSA。
zh_tw: *Linux:* PulseAudio 或 ALSA。

source: Import
de: Importieren
es: Importar
uk: Імпорт
zh_cn: 导入
zh_tw: 匯入

source: Support for :ref:`custom import plugins <doc_import_plugins>`.
de: Unterstützung für :ref:`Eigene Import-Plugins<doc_import_plugins>`.
es: Soporte para :ref:`plugins de importación personalizados <doc_import_plugins>`.
uk: Підтримка :ref:`користувацьких плагінів імпорту<doc_import_plugins>`.
zh_cn: 支持\ :ref:`自定义导入插件 <doc_import_plugins>`\ 。
zh_tw: 支援 :ref:`自定匯入外掛 <doc_import_plugins>` 。

source: **Formats:**
de: **Formate:**
es: **Formatos:**
uk: **Формати:**
zh_cn: **格式：**
zh_tw: **格式:**

source: *Images:* See :ref:`doc_importing_images`.
de: *Bilder:* Siehe :ref:`doc_importing_images`.
es: *Imágenes:* Ver :ref:`doc_importing_images`.
uk: *Зображення:* Дивіться :ref:`doc_importing_images`.
zh_cn: *图片：* 请参阅 :ref:`doc_importing_images` 。
zh_tw: **圖片:** 請參閱 :ref:`doc_import_images` 。

source: *Audio:*
uk: *Аудіо:*
zh_cn: *音频：*
zh_tw: **音訊:**

source: WAV with optional IMA-ADPCM compression.
de: WAV mit optionaler IMA-ADPCM Kompression.
es: WAV con compresión opcional IMA-ADPCM.
uk: WAV з опціональним стисненням IMA-ADPCM.
zh_cn: WAV，可选 IMA-ADPCM 压缩。
zh_tw: WAV，可選擇是否使用 IMA-ADPCM 壓縮。

source: *3D scenes:* See :ref:`doc_importing_3d_scenes`.
de: *3D-Szenen:* Siehe :ref:`doc_importing_3d_scenes`.
es: *Escenas 3D:* Ver :ref:`doc_importing_3d_scenes`.
uk: *3D сцени:* Дивіться :ref:`doc_importing_3d_scenes`.
zh_cn: *3D 场景：* 请参阅 :ref:`doc_importing_3d_scenes` 。
zh_tw: **圖片:** 請參閱 :ref:`doc_import_images` 。

source: glTF 2.0 *(recommended)*.
de: glTF 2.0 *(empfohlen)*.
es: glTF 2.0 *(recomendado)*.
uk: glTF 2.0 *(рекомендовано)*.
zh_cn: glTF 2.0 *（推荐）* 。
zh_tw: glTF 2.0 **(推薦)** 。

source: ``.blend`` (by calling Blender's glTF export functionality transparently).
de: ``.blend`` (durch den transparenten Aufruf von Blenders glTF-Exportfunktion).
es: ``.blend`` (mediante llamado transparente a la funcionalidad de exportación a glTF de Blender).
zh_cn: ``.blend``\ （隐式调用 Blender 的 glTF 导出功能）。
zh_tw: ``.blend`` （隱式呼叫 Blender 的 glTF 匯出功能）。

source: FBX (by calling `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ transparently).
de: FBX (durch transparenten Aufruf von `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__).
es: FBX (llamando transparentemente a `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__).
zh_cn: FBX （通过显式调用 `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ ）。
zh_tw: FBX （通過明確的呼叫 `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ ）。

source: Wavefront OBJ (static scenes only, can be loaded directly as a mesh or imported as a 3D scene).
de: Wavefront OBJ (nur statische Szenen, kann direkt als Mesh geladen oder als 3D-Szene importiert werden).
es: Wavefront OBJ (solo escenas estáticas, se pueden cargar directamente como una malla o importado como escena 3D).
uk: Wavefront OBJ (тільки статичні сцени, можна завантажити безпосередньо як сітку або імпортувати як 3D-сцену).
zh_cn: Wavefront OBJ（仅静态场景，可直接被加载为网格或 3D 场景）。
zh_tw: Wavefront OBJ (僅可使用靜態場景，可直接載入為網格)。

source: Support for loading glTF 2.0 scenes at run-time, including from an exported project.
de: Unterstützung für das Laden von glTF 2.0-Szenen zur Laufzeit, auch aus einem exportierten Projekt.
es: Soporta la carga de escenas glTF 2.0 en tiempo de ejecución, incluyendo desde un proyecto exportado.
uk: Підтримка завантаження сцен glTF 2.0 під час виконання, зокрема з експортованого проекту.
zh_cn: 支持在运行时加载 glTF 2.0 场景（包括已经导出的项目）。
zh_tw: 在編輯器中產生導覽網格。

source: 3D meshes use `Mikktspace <http://www.mikktspace.com/>`__ to generate tangents on import, which ensures consistency with other 3D applications such as Blender.
de: 3D-Meshes nutzen `Mikktspace <http://www.mikktspace.com/>`__ um Tangenten während des Imports zu generieren, in Übereinstimmung mit anderen 3D-Anwendungen wie Blender.
es: Las mallas 3D usan `Mikktspace <http://www.mikktspace.com/>`__ para generar tangentes en la importación, lo que asegura la consistencia con otras aplicaciones 3D como Blender.
uk: 3D меші використовують `Mikktspace <http://www.mikktspace.com/>`__ для генерації дотичних при імпорті, що забезпечує узгодженість з іншими 3D-застосунками, такими як Blender.
zh_cn: 在导入时使用 `Mikktspace <http://www.mikktspace.com/>`__ 为 3D 网格生成切线，保证与 Blender 等其他 3D 应用的一致性。
zh_tw: 在匯入時使用 `Mikktspace <http://www.mikktspace.com/>`__ 為 3D 網格生成切線，保證與 Blender 等其他 3D 應用的一致性。

source: Input
de: Eingabe
es: Entrada
uk: Введення
zh_cn: 输入
zh_tw: 輸入

source: :ref:`Input mapping system <doc_input_examples>` using hardcoded input events or remappable input actions.
de: :ref:`Eingabe-Zuordnungs-System <doc_input_examples>` nutzt fest codierte Eingabeereignisse oder neu zuweisbare Eingabeaktionen.
es: :ref:`Sistema de mapeo de entradas <doc_input_examples>` utilizando eventos de entrada hardcodeados o acciones de entrada remapeables.
uk: ref:`Система відображення вводу <doc_input_examples>` з використанням жорстко закодованих подій вводу або дій вводу, які можна перерозподіляти.
zh_cn: 该 :ref:`输入映射系统 <doc_input_examples>`\ 使用硬编码的输入事件, 也可以使用可重定向的输入动作。
zh_tw: 使用硬式編碼的輸入事件或可重新對應的輸入操作來進行輸入對應。

source: Axis values can be mapped to two different actions with a configurable deadzone.
de: Achsenwerte können zwei verschiedenen Aktionen zugeordnet werden mit einer konfigurierbaren Totzone.
es: Los valores del eje pueden ser asignados a dos acciones diferentes con una zona muerta configurable.
uk: Значення осей можуть бути зіставлені з двома різними діями з настроюваною мертвою зоною.
zh_cn: 坐标轴参数可以映射到两个不同的操作上, 这些操作可以配置死区.
zh_tw: 座標軸數值可對應至兩個不同的操作，並配有可設定的反應區域。

source: Use the same code to support both keyboards and gamepads.
de: Nutze den gleichen Code um Tastatur und Gamepad zu unterstützen.
es: Usa el mismo código para soportar tanto los teclados como los gamepads.
uk: Використовуйте один і той же код для, як для клавіатур, так і для геймпадів.
zh_cn: 使用相同的代码支持键盘和手柄操作.
zh_tw: 使用同一個程式碼來同時支援鍵盤與遊戲控制器。

source: Keyboard input.
de: Tastatureingaben.
es: Entradas del teclado.
uk: Ввід з клавіатури.
zh_cn: 键盘输入。
zh_tw: 鍵盤輸入。

source: Keys can be mapped in "physical" mode to be independent of the keyboard layout.
de: Tasten können im „physischen“ Modus unabhängig vom Tastaturlayout zugeordnet werden.
es: Las teclas pueden ser mapeadas en modo "físico" para ser independientes de la disposición del teclado.
uk: Клавіші можна призначити у "фізичному" режимі, щоб вони не залежали від розкладки клавіатури.
zh_cn: 按键可以被映射到“物理”模式，该模式下按键行为和键盘布局无关。
zh_tw: 可將按鍵以「物理模式」進行對應，以避免因鍵盤配置不同而影響對應。

source: Mouse input.
de: Mauseingaben.
es: Entradas del ratón.
uk: Ввід з мишки.
zh_cn: 鼠标输入。
zh_tw: 滑鼠輸入。

source: The mouse cursor can be visible, hidden, captured or confined within the window.
de: Der Mauszeiger kann sichtbar, ausgeblendet, erfasst oder auf das Fenster begrenzt sein.
es: El cursor del ratón puede ser visible, oculto, capturado o confinado dentro de la ventana.
uk: Курсор миші може бути видимим, прихованим, захопленим або обмеженим у вікні.
zh_cn: 可以将鼠标光标配置为可见、隐藏、捕获，或者将其限制在窗口范围内。
zh_tw: 可將滑鼠遊標設為可見、隱藏、捕捉、或限制於視窗內。

source: When captured, raw input will be used on Windows and Linux to sidestep the OS' mouse acceleration settings.
de: Bei der Erfassung werden Roh-Eingabedaten unter Windows und Linux verwendet, um die Einstellungen der Maus des Betriebssystems zu umgehen.
es: Cuando se capture, la entrada en bruto se utilizará en Windows y Linux para eludir la configuración de la aceleración del ratón del sistema operativo.
uk: При захопленні необроблений ввід буде використовуватися в Windows і Linux для обходу налаштувань прискорення мишки ОС.
zh_cn: 捕获输入时，在 Windows 和 Linux 平台会使用原始输入，回避操作系统的鼠标加速度设置。
zh_tw: 捕捉滑鼠輸入時，在 Windows 與 Linux 上會使用原始輸入，以繞過作業系統的滑鼠加速設定。

source: Gamepad input (up to 8 simultaneous controllers).
de: Gamepad-Eingabe (bis zu 8 Controller gleichzeitig).
es: Entrada de gamepad (hasta 8 controladores simultáneos).
uk: Ввід з геймпаду (до 8 одночасних контролерів).
zh_cn: 手柄输入（最多同时支持 8 个控制器）。
zh_tw: 遊戲控制器輸入 (同時支援最多 8 組控制器)。

source: Pen/tablet input with pressure support.
de: Stift/Tablet-Eingabe mit Erkennung des Anpressdrucks.
es: Entrada de lápiz/tableta con soporte de presión.
uk: Ввід пера/планшета з підтримкою тиску.
zh_cn: 支持带压感的绘图笔和平板输入.
zh_tw: 具有感壓支援的繪圖筆／繪圖板輸入。

source: Navigation
es: Navegación
uk: Навігація
zh_cn: 导航
zh_tw: 導覽

source: A* algorithm in :ref:`2D <class_AStar2D>` and :ref:`3D <class_AStar3D>`.
de: A*-Algorithmus in :ref:`2D <class_AStar2D>` und :ref:`3D <class_AStar3D>`.
es: Algoritmo A* en :ref:`2D <class_AStar2D>` y :ref:`3D <class_AStar3D>`.
zh_cn: A* 算法在 :ref:`2D <class_AStar2D>` 和 :ref:`3D <class_AStar3D>` 里。
zh_tw: A* 演算法在 :ref:`2D <class_AStar2D>` 和 :ref:`3D <class_AStar3D>` 裡。
