Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: Fog volume nodes that can be placed to add fog to specific areas (or remove fog from specific areas). Supported shapes include box, ellipse, cone, cylinder, and 3D texture-based density maps.
de: Nebelvolumen-Nodes, die platziert werden können, um Nebel zu bestimmten Bereichen hinzuzufügen (oder Nebel aus bestimmten Bereichen zu entfernen). Zu den unterstützten Shapes gehören Box, Ellipse, Kegel, Zylinder und 3D-Textur-basierte Dichtekarten.
es: Nodos de niebla volumétrica que pueden ser ubicados para agregar niebla en áreas específicas (o remover niebla de áreas particulares). Las formas soportadas incluyen caja, elipse, cono, cilindro y mapas de densidad basados en texturas 3D.
uk: Вузли об'ємного туману, які можна розмістити, щоб додати туман у певні області (або видалити туман із певних областей). Підтримувані форми включають коробку, еліпс, конус, циліндр і 3D-карти щільності на основі текстури.
zh_cn: 可以放置雾体积节点以向特定区域添加雾（或从特定区域去除雾）。支持的形状包括长方体、椭圆形、圆锥体、圆柱体和基于 3D 纹理的密度图。

source: Each fog volume can have its own custom shader.
de: Jedes Nebelvolumen kann seinen eigenen benutzerdefinierten Shader haben.
es: Cada volumen de niebla puede tener su propio shader personalizado.
uk: Кожен об'єм туману може мати свій власний шейдер.
zh_cn: 每个雾体积都可以有自己的自定义着色器。
zh_tw: 每個霧體積都可以有自己的自訂著色器。

source: Can be used together with traditional fog.
de: Kann zusammen mit herkömmlichem Nebel verwendet werden.
es: Puede ser utilizado con niebla tradicional.
uk: Може бути використаний разом зі звичайним туманом.
zh_cn: 可与传统雾一起使用。
zh_tw: 可與傳統霧一起使用。

source: **Particles:**
de: **Partikel:**
es: **Partículas:**
uk: **Частинки:**
zh_cn: **粒子：**
zh_tw: **粒子：**

source: GPU-based particles with support for subemitters (2D + 3D), trails (2D + 3D), attractors (3D only) and collision (2D + 3D).
de: GPU-basierte Partikel mit Unterstützung für Sub-Emitter (2D + 3D), Trails (2D + 3D), Attraktoren (nur 3D) und Kollision (2D + 3D).
es: Partículas con soporte para sub-emisores (2D + 3D), rastros (2D + 3D), atractores (sólo 3D) y colisiones (2D + 3D).
zh_cn: 基于 GPU 的粒子，支持子发射器（2D + 3D）、尾迹（2D + 3D）、吸引器（仅 3D）和碰撞（2D + 3D）。
zh_tw: 基於 GPU 的粒子，支援子發射器（ 2D+3D ）、尾跡（ 2D+3D ）、吸引器（ 僅限 3D ）和碰撞（ 2D+3D ）。

source: 3D particle attractor shapes supported: box, sphere and 3D vector fields.
de: Unterstützte 3D-Partikelattraktor-Shapes: Box, Kugel und 3D-Vektorfelder.
es: Formas soportadas por atractores de parículas 3D: caja, esfera y campos vectoriales 3D.
uk: Підтримуються форми аттракторів 3D-частинок: коробка, сфера і 3D-векторні поля.
zh_cn: 支持 3D 粒子吸引器形状：长方体、球体和 3D 向量场。
zh_tw: 支援 3D 粒子吸引器形狀：長方體、球體和 3D 向量場。

source: 3D particle collision shapes supported: box, sphere, baked signed distance field and real-time heightmap (suited for open world weather effects).
de: Unterstützte 3D-Partikelkollisions-Shapes: Box, Kugel, gebackenes Signed Distance Field und Echtzeit-Höhenkarte (geeignet für Open-World-Wettereffekte).
es: Formas de colisión de partículas 3D soportadas: caja, esfera, baked signed distance field y mapa de altura en tiempo real (ideal para mundo abierto con efectos de clima).
uk: Підтримуються форми зіткнень 3D частинок: коробка, сфера, запечене підписане поле відстані і карта висот в реальному часі (підходить для ефектів погоди відкритого світу).
zh_cn: 支持 3D 粒子碰撞形状：长方体、球体、烘焙带符号距离场和实时高度图（适用于开放世界天气效果）。
zh_tw: 支援 3D 粒子碰撞形狀：長方體、球體、烘焙帶符號距離場和即時高度圖（適用於開放世界天氣效果）。

source: 2D particle collision is handled using a signed distance field generated in real-time based on :ref:`class_LightOccluder2D` nodes in the scene.
de: 2D-Partikelkollisionen werden mit einem Signed Distance Field behandelt, das in Echtzeit auf der Grundlage von :ref:`class_LightOccluder2D`-Nodes in der Szene erzeugt wird.
es: Colisiones de partículas 2D utilizando signed distance field generado en tiempo real basado en nodos :ref:`class_LightOccluder2D` de la escena.
uk: Зіткнення 2D частинок опрацьовується за допомогою позначеного поля відстані згенерованого в реальному часі на основі вузлів :ref:`class_LightOccluder2D` в сцені.
zh_cn: 2D 粒子碰撞是使用基于场景中的 :ref:`class_LightOccluder2D` 节点实时生成的带符号距离场来处理的。
zh_tw: 2D 粒子碰撞是使用基於場景中的 :ref:`class_LightOccluder2D` 節點即時生成的帶符號距離場來處理的。

source: Trails can use the built-in ribbon trail and tube trail meshes, or custom meshes with skeletons.
de: Trails können die integrierte Ribbon-Trail- und Tube-Trail-Meshes oder eigene Meshes mit Skeletten verwenden.
es: Los rastros pueden usar cintas integradas y mallas de cintas tubo o mallas personalizadas con esqueletos.
zh_cn: 尾迹可以使用内置的带状尾迹和管状尾迹网格，也可以使用带有骨架的自定义网格。
zh_tw: 尾跡可以使用內建的帶狀尾跡和管狀尾跡網格，也可以使用帶有骨架的自訂網格。

source: Support for custom particle shaders with manual emission.
de: Unterstützung für benutzerdefinierte Partikelshader mit manueller Emission.
es: Soporte para shaders de partículas personalizados con emisión manual.
zh_cn: 支持手动发射的自定义粒子着色器。
zh_tw: 支援手動發射的自訂粒子著色器。

source: **Post-processing:**
es: **Postprocesamiento:**
uk: **Пост-обробка:**
zh_cn: **后期处理：**
zh_tw: **後處理：**

source: Tonemapping (Linear, Reinhard, Filmic, ACES).
es: Mapeo de tonos (Linear, Reinhard, Filmic, ACES).
uk: Замалювання (Linear, Reinhard, Filmic, ACES).
zh_cn: 色调映射(线性, Reinhard, Filmic, ACES).
zh_tw: 色調對應 (線性, Reinhard, Filmic, ACES)。

source: Automatic exposure adjustments based on viewport brightness (and manual exposure override).
de: Automatische Belichtungsanpassung auf der Grundlage der Helligkeit des Viewports (und manuelles Überschreiben der Belichtung).
es: Ajustes de exposición automáticos basados en el brillo del viewport (y sobreescritura manual de exposición).
uk: Автоматичне регулювання експозиції на основі яскравості видошукача (і ручне перевизначення експозиції).
zh_cn: 根据视口亮度自动调整曝光（或使用手动曝光覆盖）。
zh_tw: **GLES3:** 基於檢視區亮度自動調整曝光。

source: Near and far depth of field with adjustable bokeh simulation (box, hexagon, circle).
de: Nah- und Fern-Schärfentiefe mit einstellbarer Bokeh-Simulation (Box, Hexagon, Kreis).
es: Campos de profundidad cercana y lejana con simulación bokeh ajustable (cajas, hexágonos, círculos).
zh_cn: 可以通过景深的远近调节对焦外散斑的模拟（方框、六边形、圆形）。
zh_tw: 可以通過景深的遠近調節對焦外散斑的模擬（方框、六邊形、圓形）。

source: Screen-space ambient occlusion (SSAO) at half or full resolution.
de: Screen-Space Ambient Occlusion (SSAO) bei halber oder voller Auflösung.
es: Oclusión ambiental del espacio en pantalla (SSAO) a resolución media o completa.
uk: Екранно-просторова оклюзія навколишнього середовища (SSAO) при половинній або повній роздільній здатності.
zh_cn: 半分辨率或全分辨率的屏幕空间环境光遮蔽（SSAO）。
zh_tw: **GLES3:** 螢幕空間週遭遮擋。

source: Glow/bloom with optional bicubic upscaling and several blend modes available: Screen, Soft Light, Add, Replace, Mix.
de: Glow/Bloom mit optionalem bikubischen Upscaling und verschiedenen Blending-Modi: Screen, Soft Light, Add, Replace, Mix.
es: Brillo/irradiación con escalado bicúbico opcional y varios modos de combinación disponibles: Pantalla, Luz suave, Agregar, Reemplazar, Mezclar.
uk: Сяйво/цвітіння з додатковим бікубічним масштабуванням і кількома режимами накладання: Екран, М'яке світло, Додати, Замінити, Змішати.
zh_cn: 辉光/泛光，可以使用可选的双三次放大和多种混合模式：滤色（Screen）、柔光（Soft Light）、添加（Add）、替换（Replace）、融合（Mix）。
zh_tw: 以可選的雙立方放大發光，並有多種可用的混合模式：螢幕、軟廣、新增、取代。

source: Glow can have a colored dirt map texture, acting as a lens dirt effect.
de: Glow kann eine farbige Dirt-Map-Textur haben, die wie ein Linsenschmutzeffekt wirkt.
es: El brillo puede tener una textura de mapa de suciedad coloreada, actuando como lentte de efecto de suciedad.
zh_cn: 辉光可以使用彩色污渍贴图纹理，实现镜头脏污效果。
zh_tw: 輝光可以使用彩色污漬貼圖紋理，實作鏡頭髒汙效果。

source: Glow can be :ref:`used as a screen-space blur effect <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
de: Glow kann :ref:`als Blur-Effekt im Screen-Space verwendet werden <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
es: El brillo puede ser :ref:`usado como un efecto de difuminado en espacio de pantalla <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
zh_cn: 辉光可 :ref:`用作屏幕空间模糊效果 <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`。

source: Color correction using a one-dimensional ramp or a 3D LUT texture.
de: Farbkorrektur mit einer eindimensionalen Rampe oder einer 3D-LUT-Textur.
es: Corrección de color mediante rampa unidimensional o una textura LUT 3D.
uk: Корекція кольору за допомогою одновимірної рампи або 3D LUT-текстури.
zh_cn: 使用一维渐变或 3D LUT 纹理进行颜色校正。
zh_tw: 使用單維漸變進行色彩校正。

source: Roughness limiter to reduce the impact of specular aliasing.
de: Rauheitsbegrenzer zur Verringerung der Auswirkungen von spiegelndem Aliasing.
es: Limitador de rugosidad para reducir el efecto del suavizado especular.
zh_cn: 可减少镜面反射锯齿的影响的粗糙度限幅器。
zh_tw: 可減少鏡面反射鋸齒的影響的粗糙度限幅器。

source: Brightness, contrast and saturation adjustments.
de: Helligkeit-, Kontrast- und Sättigungs-Regler.
es: Ajustes de brillo, contraste y saturación.
uk: Регулювання яскравості, контрасту та насиченості.
zh_cn: 亮度, 对比度和饱和度调整.
zh_tw: 亮度、對比度與飽和度調整。

source: **Texture filtering:**
de: **Textur-Filterung:**
es: **Filtrado de texturas:**
uk: **Фільтрування текстур:**
zh_cn: **纹理过滤：**
zh_tw: **紋理篩選：**

source: Nearest, bilinear, trilinear or anisotropic filtering.
de: Nearest-Neighbor, bilineare, trilineare oder anisotrope Filterung.
es: Filtrado más cercano, bilineal, trilineal o anisotrópico.
uk: Найближнє, білінійне, трилінійне та анізотропне фільтрування.
zh_cn: 最近邻、双线性、三线性、各向异性过滤。
zh_tw: 最近、雙線性、三線性或各向異性篩選。

source: Filtering options are defined on a per-use basis, not a per-texture basis.
de: Die Filteroptionen werden pro Anwendung und nicht pro Textur definiert.
es: Las opciones de filtrado están definidas por uso, no por textura.
uk: Параметри фільтрації визначаються на основі використання, а не на основі текстури.
zh_cn: 过滤项是基于每次使用定义的，而不是基于每个纹理。
zh_tw: 晃動可依像素級別或物件級別來判斷。

source: **Texture compression:**
de: **Textur-Kompression:**
es: **Compresión de textura:**
uk: **Стиснення текстур:**
zh_cn: **纹理压缩：**
zh_tw: **紋理壓縮：**

source: Basis Universal (slow, but results in smaller files).
de: Basis Universal (langsam, führt aber zu kleineren Dateien).
es: Basis Universal (lento pero resulta en pequeños archivos).
zh_cn: Basis Universal（速度较慢，但文件较小）。
zh_tw: Basis Universal（速度較慢，但檔較小）。

source: BPTC for high-quality compression (not supported on macOS).
de: BPTC für High-Quality Kompression (keine Unterstützung auf MacOS).
es: BPTC para compresión de alta calidad (no compatible con macOS).
uk: BPTC для якісного стиснення (не підтримується на macOS).
zh_cn: 用于高质量压缩的 BPTC（macOS 不支持）。
zh_tw: **GLES3:** BPTC 以獲得高品質壓縮 (在 macOS 上不支援)。

source: ETC2 (not supported on macOS).
de: ETC2 (keine Unterstützung auf MacOS).
es: ETC2 (no soportado en macOS).
uk: ETC2 (не підтримується на macOS).
zh_cn: ETC2（macOS 不支持）。
zh_tw: **GLES3:** ETC2 (在 macOS 上不支援)。

source: S3TC (not supported on mobile/Web platforms).
de: S3TC (keine Unterstützung auf mobilen/Web-Plattformen).
es: S3TC (no soportado en platafirnas móviles/Web).
uk: S3TC (не підтримується на мобільних/веб-платформах).
zh_cn: S3TC（不支持网页和移动平台）。
zh_tw: **GLES3:** S3TC (在行動裝置與網頁平台上不支援)。

source: **Anti-aliasing:**
uk: **Згладжування:**
zh_cn: **抗锯齿：**
zh_tw: **抗鋸齒：**

source: Temporal :ref:`antialiasing <doc_3d_antialiasing>` (TAA).
es: :ref:`Suavizado <doc_3d_antialiasing>` temporal (TAA).
zh_cn: 时间\ :ref:`抗锯齿 <doc_3d_antialiasing>`\ （TAA）。
zh_tw: 時間 :ref:`抗鋸齒 <doc_3d_antialiasing>` （TAA）。

source: AMD FidelityFX Super Resolution 2.2 :ref:`antialiasing <doc_3d_antialiasing>` (FSR2), which can be used at native resolution as a form of high-quality temporal antialiasing.
de: AMD FidelityFX Super Resolution 2.2-:ref:`Antialiasing <doc_3d_antialiasing>` (FSR2), das bei nativer Auflösung als eine Form des hochwertigen temporalen Antialiasing verwendet werden kann.
es: :ref:`Suavizado <doc_3d_antialiasing>` AMD FidelityFX Super Resolution 2.2 (FSR2) que puede ser usado en resolución nativa como una forma de conseguir un suavizado temporal de alta calidad.
zh_cn: AMD FidelityFX Super Resolution 2.2 :ref:`antialiasing <doc_3d_antialiasing>` (FSR2) 可在原始分辨率下用作高质量的时间抗锯齿。

source: Multi-sample antialiasing (MSAA), for both :ref:`doc_2d_antialiasing` and :ref:`doc_3d_antialiasing`.
de: Multi-Sample antialiasing (MSAA), sowohl für :ref:`doc_2d_antialiasing` als auch für :ref:`doc_3d_antialiasing`.
es: Suavizado de muestras múltiples (MSAA), para ambos ver :ref:`doc_2d_antialiasing` y :ref:`doc_3d_antialiasing`.
zh_cn: 多重采样抗锯齿（ MSAA ），同时适用于 :ref:`doc_2d_antialiasing` 和 :ref:`doc_3d_antialiasing` 。
zh_tw: 多重取樣抗鋸齒（ MSAA ），同時適用於 :ref:`doc_2d_antialiasing` 和 :ref:`doc_3d_antialiasing` 。

source: Fast approximate antialiasing (FXAA).
es: Antialiasing aproximado rápido (FXAA).
uk: Швидке приблизне згладжування (FXAA).
zh_cn: 快速近似抗锯齿（FXAA）。
zh_tw: 多取樣抗鋸齒 (MSAA)。

source: Super-sample antialiasing (SSAA) using bilinear 3D scaling and a 3D resolution scale above 1.0.
de: Super-Sample-Antialiasing (SSAA) mit bilinearer 3D-Skalierung und einer 3D-Auflösungsskala über 1,0.
es: Suavizado de super muestreo (SSAA) utilizando escalado 3D bilinear y una resolución de escala por sobre 1.0.
zh_cn: 使用双线性三维缩放和高于 1.0 的三维分辨率比例进行超采样抗锯齿 (SSAA)。
zh_tw: 使用雙線性三維縮放和高於 1.0 的三維解析度比例進行超取樣抗鋸齒 (SSAA)。

source: Alpha antialiasing, MSAA alpha to coverage and alpha hashing on a per-material basis.
de: Alpha-Antialiasing, MSAA Alpha-to-Coverage und Alpha-Hashing auf pro-Material-Basis.
es: Suavizado alfa, MSAA alfa a covertura y alfa hashing por material.
zh_cn: 在每种材质基础上的 Alpha 抗锯齿、基于多重采样（MSAA）的 Alpha 覆盖（Alpha-To-Coverage）和 Alpha 哈希。
zh_tw: 在每種材質基礎上的 Alpha 抗鋸齒、基於多重取樣（MSAA）的 Alpha 覆蓋（Alpha-To-Coverage）和 Alpha 雜湊。

source: **Resolution scaling:**
de: **Skalierung der Auflösung:**
es: **Escalado de resolución:**
uk: **Масштабування роздільної здатності:**
zh_cn: **分辨率缩放：**
zh_tw: **反射：**

source: Support for :ref:`rendering 3D at a lower resolution <doc_resolution_scaling>` while keeping 2D rendering at the original scale. This can be used to improve performance on low-end systems or improve visuals on high-end systems.
de: Unterstützung für :ref:`Darstellung von 3D in einer niedrigeren Auflösung <doc_resolution_scaling>` bei gleichzeitiger Beibehaltung der 2D-Darstellung im Originalmaßstab. Dies kann verwendet werden, um die Leistung auf Low-End-Systemen oder die Darstellungsqualität auf High-End-Systemen zu verbessern.
es: Soporte para :ref:`renderizado 3D a baja resolución <doc_resolution_scaling>` mientras se mantiene la resolución 2D a la escala original. Esto puede ser usado para mejorar el rendimiento en sistemas de gama baja o para mejorar visualmente en sistemas de gama alta.
zh_cn: 支持 :ref:`以较低分辨率渲染 3D <doc_resolution_scaling>`\ ，同时保持原始比例的 2D 渲染。 这可用于提高低端系统的性能或改善高端系统的视觉效果。
zh_tw: 支援 :ref:`以較低解析度算繪 3D <doc_resolution_scaling>` ，同時保持原始比例的 2D 算繪。 這可用於提高低端系統的性能或改善高端系統的視覺效果。

source: Resolution scaling uses bilinear filtering, AMD FidelityFX Super Resolution 1.0 (FSR1) or AMD FidelityFX Super Resolution 2.2 (FSR2).
de: Die Auflösungsskalierung erfolgt mit bilinearer Filterung, AMD FidelityFX Super Resolution 1.0 (FSR1) oder AMD FidelityFX Super Resolution 2.2 (FSR2).
es: El escalado de resolución utiliza filtrado bilineal, AMD FidelityFX Super Resolution 1.0 (FSR1) o AMD FidelityFX Super Resolution 2.2 (FSR2).
zh_cn: 分辨率缩放使用了双线性过滤、 AMD FidelityFX Super Resolution 1.0 （FSR1）和 AMD FidelityFX Super Resolution 2.2 （FSR2）。
zh_tw: 解析度縮放可以選擇雙線性過濾或 AMD FidelityFX Super Resolution 1.0 (FSR1) 或 AMD FidelityFX Super Resolution 2.2 (FSR2)。

source: Texture mipmap LOD bias is adjusted automatically to improve quality at lower resolution scales. It can also be modified with a manual offset.
de: Der LOD-Bias der Textur-Mipmaps wird automatisch angepasst, um die Qualität bei niedrigeren Auflösungsskalen zu verbessern. Sie kann auch mit einem manuellen Offset angepasst werden.
es: Mipmap LOD bias de texturas es ajustado automáticamente para mejorar la calidad a bajas escalas de resolución. Puede ser modificado con un desplazamiento manual.
zh_cn: 多级渐远纹理 LOD 偏置会自动调整，以提高较低分辨率比例下的质量。也可以通过手动偏移进行修改。
zh_tw: 多級漸遠紋理 LOD 偏置會自動調整，以提高較低解析度比例下的品質。也可以通過手動偏移進行修改。

source: Most effects listed above can be adjusted for better performance or to further improve quality. This can be helpful when :ref:`using Godot for offline rendering <doc_creating_movies>`.
de: Die meisten der oben aufgeführten Effekte können für eine bessere Leistung oder zur weiteren Verbesserung der Qualität angepasst werden. Dies kann hilfreich sein, wenn :ref:`Godot für Offline-Rendering <doc_creating_movies>` verwendet wird.
es: La mayoría los efectos mostrados previamente se pueden ajustar para un mejor rendimiento o para mejorar aún más la calidad. Esto puede ser útil cuando :ref:`se utiliza Godot para prerenderizado <doc_creating_movies>`.
uk: Більшість ефектів, перелічених вище, можна налаштувати для кращої продуктивності або для подальшого покращення якості. Це може бути корисним у випадку :ref:`використання Godot для автономного рендерингу <doc_creating_movies>`.
zh_cn: 上述效果中的大多数都可以进行调整，从而提升性能、提高质量。这在 :ref:`使用 Godot 进行脱机渲染 <doc_creating_movies>`\ 时非常有用。
zh_tw: 這些效果中大多數都可以調整為更佳效能或進一步提升品質。這些調整有助於在離線算繪下使用 Godot。

source: 3D tools
es: Herramientas 3D
uk: 3D інструменти
zh_cn: 3D 工具
zh_tw: 3D 工具

source: Built-in meshes: cube, cylinder/cone, (hemi)sphere, prism, plane, quad, torus, ribbon, tube.
de: Built-in-Meshes: Kubus, Zylinder/Kegel, (Halb-)Kugel, Prisma, Ebene, Quad, Torus, Band, Rohr.
es: Mallas integradas: cubo, cilindro/cono, (semi)esfera, prisma, plano, quad, toro, cinta, tubo.
uk: Вбудовані сітки: куб, циліндр/конус, (гемі)сфера, призма, площина, квадрат, тор, стрічка, труба.
zh_cn: 内置网格：立方体、圆柱体/圆锥体、（半）球体、棱柱体、平面、四边形、圆环面、条带、管状。
zh_tw: 內建網格：立方體、圓柱體／錐體、(半)球體、稜柱體、平面、四邊形。

source: :ref:`GridMaps <doc_using_gridmaps>` for 3D tile-based level design.
de: :ref:`GridMaps <doc_using_gridmaps>` für Tile-basiertes 3D-Leveldesign.
es: :ref:`GridMaps <doc_using_gridmaps>` para diseño de niveles 3D basado en tiles.
zh_cn: :ref:`GridMaps <doc_using_gridmaps>` 用于由 3D 图块构建的关卡设计。
zh_tw: :ref:`GridMaps <doc_using_gridmaps>` 用於由 3D 圖塊建構的關卡設計。

source: :ref:`Constructive solid geometry <doc_csg_tools>` (intended for prototyping).
de: :ref:`Konstruktive Festkörpergeometrie <doc_csg_tools>` (vorgesehen für Prototyping).
es: : ref:`Geometría sólida constructiva <doc_csg_tools>` (destinado a la creación de prototipos).
uk: :ref:`Конструктивна геометрія твердого тіла <doc_csg_tools>` (призначена для прототипів).
zh_cn: :ref:`构造实体几何 <doc_csg_tools>`\ （用于原型制作）。
zh_tw: :ref:`建置實體集合 <doc_csg_tools>` (用於製作 Prototype)。

source: Tools for :ref:`procedural geometry generation <doc_procedural_geometry>`.
de: Tools für :ref:`prozedurale Geometrien <doc_procedural_geometry>`.
es: Herramientas para :ref:`generación de geometría procedural <doc_procedural_geometry>`.
uk: Інструменти для :ref:`генерації процедурної геометрії <doc_procedural_geometry>`.
zh_cn: :ref:`程序式几何体生成<doc_procedural_geometry>`\ 工具。
zh_tw: 用於 :ref:`產生集合 <doc_procedural_geometry>` 的工具。

source: Path3D node to represent a path in 3D space.
de: Path3D-Node steht für einen Pfad im 3D-Raum.
es: Nodo Path3D para representar una ruta en el espacio 3D.
uk: Вузол Path3D для зображення шляху в 3D просторі.
zh_cn: Path3D 节点表示 3D 空间中的路径。
zh_tw: 在 3D 空間中表示路徑的 Path3D 節點。

source: PathFollow3D node to make nodes follow a Path3D.
de: PathFollow3D damit Nodes einem Path3D folgen.
es: Nodo PathFollow3D para hacer que los nodos sigan un Path3D.
uk: Вузол PathFollow3D, щоб заставити вузли рухатися по Path3D.
zh_cn: PathFollow3D 节点使节点沿 Path3D 运动。
zh_tw: 使用 PathFollow3D 節點來使節點跟隨 Path3D。

source: :ref:`3D geometry helper class <class_Geometry3D>`.
de: :ref:`3D-Geometrie-Helferklasse<class_Geometry3D>`.
es: :ref:`Clase auxiliar de geometría 3D <class_Geometry3D>`.
uk: :ref:`3D геометрія допоміжного класу <class_Geometry3D>`.
zh_cn: :ref:`3D 几何体辅助类 <class_Geometry3D>`\ 。
zh_tw: 3D 集合 Helper 類別。

source: Support for exporting the current scene as a glTF 2.0 file, both from the editor and at run-time from an exported project.
de: Unterstützung für das Exportieren der aktuellen Szene als glTF 2.0-Datei, sowohl aus dem Editor als auch zur Laufzeit aus einem exportierten Projekt.
es: Soporte para exportar la escena actual como un archivo glTF 2.0, tanto desde el editor como en tiempo de ejecución desde un proyecto exportado.
uk: Підтримка експорту поточної сцени у формат glTF 2.0 як з редактора, так і під час виконання з експортованого проекту.
zh_cn: 支持在编辑器中或在已经被导出的项目的运行时将当前场景导出为 glTF 2.0 文件。
zh_tw: 在編輯器中產生導覽網格。

source: 3D physics
de: 3D Physik
es: Física 3D
uk: 3D фізика
zh_cn: 3D 物理学
zh_tw: 3D 物理

source: Vehicle bodies (intended for arcade physics, not simulation).
de: Fahrzeug-Bodies (vorgesehen für Arcade Physik, keine Simulation).
es: Carrocerías de vehículos (destinadas a la física arcade, no a la simulación).
uk: Транспортні тіла (призначена для аркадної фізики, не симуляцій).
zh_cn: 车身（用于街机物理，而非模拟）。
zh_tw: Vehicle 形體 (用於處理 Arcade 物理而非模擬）。

source: Soft bodies.
es: Cuerpos blandos.
uk: М'які тіла.
zh_cn: 柔体。
zh_tw: 軟體。

source: Ragdolls.
es: Ragdolls (Muñeca de trapo).
uk: Система Ragdolls ("rag" - ганчірка, "doll" - лялька).
zh_cn: 布娃娃。
zh_tw: Ragdoll。

source: Built-in shapes: cuboid, sphere, capsule, cylinder, world boundary (infinite plane).
de: Built-in-Shapes: Quader, Kugel, Capsule, Zylinder, Weltgrenze (unendliche Ebene).
es: Formas integradas: cuboide, esfera, cápsula, cilindro, límite de mundo (plano infinito).
uk: Вбудовані форми: кубоїд, сфера, капсула, циліндр, межа світу (нескінченна площина).
zh_cn: 内置形状：立方体、球体、胶囊体、圆柱体、世界边界（无限平面）。
zh_tw: 內建形狀：長方體、球體、膠囊體、圓柱體 (僅適用於 Bullet 物理)。

source: Generate triangle collision shapes for any mesh from the editor.
de: Erzeugt dreieckige Kollisions-Shapes für jedes Mesh aus dem Editor.
es: Genere formas de colisión triangular para cualquier malla desde el editor.
uk: Генерація трикутникових форм зіткнень для будь-якого меша (сітки) з редактора.
zh_cn: 从编辑器中为任何网格生成三角形碰撞形状。
zh_tw: 在編輯器內為任意網格產生三角碰撞區域。

source: Generate one or several convex collision shapes for any mesh from the editor.
de: Erzeugt eine oder mehrere konvexe Kollisions-Shapes für jedes Mesh aus dem Editor.
es: Genere una o varias formas de colisión convexas para cualquier malla desde el editor.
uk: Створення одної, або кількох, опуклих форм зіткнення для будь-якого меша (сітки) з редактора.
zh_cn: 从编辑器中为任何网格生成一个或多个凸碰撞形状。
zh_tw: 在編輯器內為任意網格產生一個或多個凸碰撞區域。

source: Shaders
de: Shader
uk: Шейдери
zh_cn: 着色器
zh_tw: 著色器

source: *2D:* Custom vertex, fragment, and light shaders.
de: *2D:* Custom Vertex, Fragment und Beleuchtungs-Shader.
es: *2D: * Vértices personalizados, fragmentos y shaders de luz.
uk: *2D:* Користувацькі вершинні, фрагментні та світлові шейдери.
zh_cn: *2D：*\ 自定义顶点、片段和灯光着色器。
zh_tw: **2D：** 自定頂點、Fragment 與光照著色器。

source: *3D:* Custom vertex, fragment, light, and sky shaders.
de: *3D:* Custom Vertex, Fragment, Beleuchtungs- und Himmels-Shader.
es: *3D:* shaders personalizados de vértice, fragmento, luz y cielo.
uk: *3D:* Користувацькі вершинні, фрагментні, світлові та шейдери неба.
zh_cn: *3D：*\ 自定义顶点、片段、灯光和天空着色器。
zh_tw: **3D：** 自定頂點、Fragment、光照與天空著色器。

source: Text-based shaders using a :ref:`shader language inspired by GLSL <doc_shading_language>`.
de: Text-basierende Shader, die eine von der :ref:`GLSL inspirierten Shader-Language <doc_shading_language>` verwenden.
es: shaders basados en texto que usan un :ref:`lenguaje de los shaders inspirado en GLSL <doc_shading_language>`.
uk: Текстові шейдери, що використовують :ref:`мову шейдерів, на зразок GLSL <doc_shading_language>`.
zh_cn: 基于文本的着色器，使用\ :ref:`由 GLSL 启发的着色器语言 <doc_shading_language>`\ 。
zh_tw: 使用 `參考 GLSL 製作的著色器語言 <doc_shading_language>`_ 之純文字著色器。

source: Visual shader editor.
de: Visueller Shader Editor.
es: Editor visual de shaders.
uk: Візуальний редактор шейдерів.
zh_cn: 可视化着色器编辑器。
zh_tw: 視覺著色器編輯器。
