Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: Dynamic fonts support optional font outlines with adjustable width and color.
de: Dynamische Schriftarten unterstützen optionale Schrift-Konturen mit einstellbarer Breite und Farbe.
es: DynamicFont soporta contornos de fuentes opcionales con ancho y color ajustables.
uk: Динамічні шрифти підтримують додаткові контури шрифту з регульованою шириною та кольором.
zh_cn: 动态字体支持具有可调整宽度和颜色的可选字体轮廓。
zh_tw: 動態字形支援具有可調整寬度和顏色的可選字形輪廓。

source: Dynamic fonts support variable fonts and OpenType features including ligatures.
de: Dynamische Schriftarten unterstützen variable Schriftarten und OpenType-Features wie Ligaturen.
es: Las fuentes dinámicas admiten fuentes variables y características OpenType, incluyendo ligaduras.
uk: Динамічні шрифти підтримують змінні шрифти та функції OpenType, включаючи лігатури.
zh_cn: 动态字体支持可变字体和 OpenType 功能，包括连字（ligatures）。
zh_tw: 動態字形支援可變字形和 OpenType 功能，包括連字（ligatures）。

source: Dynamic fonts support simulated bold and italic when the font file lacks those styles.
de: Dynamische Schriftarten unterstützen simulierte Fett- und Kursivschrift, wenn die Schriftdatei diese Stile nicht enthält.
es: Las fuentes dinámicas admiten negrita y cursiva simuladas cuando el archivo de la fuente carece de esos estilos.
uk: Динамічні шрифти підтримують імітацію напівжирного та курсиву, якщо у файлі шрифту відсутні ці стилі.
zh_cn: 当字体文件缺少粗体和斜体样式时，动态字体支持模拟这些样式。
zh_tw: 當字形檔缺少粗體和斜體樣式時，動態字形支援類比這些樣式。

source: Dynamic fonts support oversampling to keep fonts sharp at higher resolutions.
de: Dynamische Schriftarten unterstützen Oversampling, um Schriftarten in höheren Auflösungen scharf zu halten.
es: Las fuentes dinámicas soportan sobremuestreo para mantener fuentes nítidas en resoluciones más altas.
uk: Динамічні шрифти підтримують передискретизацію, щоб зберегти чіткість шрифтів при високій роздільній здатності.
zh_cn: 动态字体支持超采样, 以在更高的分辨率下保持字体的清晰度.
zh_tw: 動態字形支援超取樣, 以在更高的解析度下保持字形的清晰度.

source: Dynamic fonts support subpixel positioning to make fonts crisper at low sizes.
de: Dynamische Schriftarten unterstützen Subpixel-Positionierung, um die Schrift bei kleinen Größen schärfer zu machen.
es: Las fuentes dinámicas soportan de posicionamiento de subpíxeles para que las fuentes sean más nítidas en tamaños bajos.
uk: Динамічні шрифти підтримують субпіксельне позиціонування, щоб зробити шрифти чіткішими при малих розмірах.
zh_cn: 动态字体支持亚像素定位（subpixel positioning），使字体在小尺寸下更清晰。
zh_tw: 動態字形支援亞像素定位（subpixel positioning），使字形在小尺寸下更清晰。

source: Dynamic fonts support LCD subpixel optimizations to make fonts even crisper at low sizes.
de: Dynamische Schriftarten unterstützen LCD-Subpixel-Optimierungen, um die Schrift bei kleinen Größen noch schärfer zu machen.
es: Las fuentes dinámicas soportan optimizaciones de subpíxeles de LCD para que las fuentes sean aún más nítidas en tamaños bajos.
uk: Динамічні шрифти підтримують LCD-субпіксельну оптимізацію, щоб зробити шрифти ще чіткішими за малих розмірів.
zh_cn: 动态字体支持 LCD 亚像素优化，使字体在小尺寸下更加清晰。
zh_tw: 動態字形支援 LCD 亞像素優化，使字形在小尺寸下更加清晰。

source: Signed distance field fonts can be scaled at any resolution without requiring re-rasterization. Multi-channel usage makes SDF fonts scale down to lower sizes better compared to monochrome SDF fonts.
de: Signed Distance Field-Schriftarten können ohne erneute Rasterung in jede Auflösung skaliert werden. Durch die Verwendung mehrerer Kanäle lassen sich SDF-Schriften im Vergleich zu monochromen SDF-Schriften besser auf kleinere Größen skalieren.
es: Las fuentes signed distance field se pueden escalar a cualquier resolución sin volver a rasterizarlas. Utilizar múltiples canales hace que las fuentes SDF escalen mejor a tamaños más pequeños en comparación con las fuentes SDF monocromáticas.
uk: Шрифти підписаних відстаней поля (SDF) можна масштабувати з будь-якою роздільною здатністю без необхідності повторної растеризації. Завдяки багатоканальному використанню шрифти SDF краще зменшуються до менших розмірів, ніж монохромні шрифти SDF.
zh_cn: 带符号距离场字体可以在任何分辨率下进行缩放，而无需重新光栅化。与单色带符号距离场字体相比，利用多通道可使带符号距离场字体更好地缩放至更小尺寸。
zh_tw: 帶符號距離場字形可以在任何解析度下進行縮放，而無需重新光柵化。與單色帶符號距離場字形相比，利用多通道可使帶符號距離場字形更好地縮放至更小尺寸。

source: GPU-based :ref:`particles <doc_particle_systems_2d>` with support for :ref:`custom particle shaders <doc_particle_shader>`.
de: GPU-basierte :ref:`Partikel-Systeme <doc_particle_systems_2d>` mit Unterstützung für :ref:`benutzerdefinierte Partikel-Shader <doc_particle_shader>`.
es: :ref:`Partículas <doc_particle_systems_2d>` basadas en GPU con soporte :ref:`shaders de partículas <doc_particle_shader>` personalizados.
uk: Графічні :ref:`частинки <doc_article_systems_2d>` з підтримкою :ref:`кастомних шейдерів частинок <doc_article_shader>`.
zh_cn: 基于 GPU 的 :ref:`粒子 <doc_particle_systems_2d>`\ ，支持 :ref:`自定义粒子着色器 <doc_particle_shader>`\ 。
zh_tw: 基於 GPU 的 :ref:`粒子 <doc_particle_systems_2d>` ，支援 :ref:`自訂粒子著色器 <doc_particle_shader>` 。

source: CPU-based particles.
de: CPU-basierte Partikel.
es: Partículas basadas en la CPU.
uk: Частинки, що оброблюються CPU.
zh_cn: 基于 CPU 的粒子。
zh_tw: 基於 CPU 的粒子。

source: Optional :ref:`2D HDR rendering <doc_environment_and_post_processing_using_glow_in_2d>` for better glow capabilities.
de: Optionales :ref:`2D-HDR-Rendering <doc_environment_and_post_processing_using_glow_in_2d>` für bessere Glow-Möglichkeiten.
es: :ref:`Rendering 2D HDR <doc_environment_and_post_processing_using_glow_in_2d>` opcional para mejores prestaciones de brillo.
uk: За бажання :ref:`2D HDR рендеринг <doc_environment_and_post_processing_using_glow_in_2d>` для кращого світіння.
zh_cn: 为了更好的辉光功能，可选择 :ref:`2D HDR 渲染 <doc_environment_and_post_processing_using_glow_in_2d>` 。

source: 2D tools
es: Herramientas 2D
uk: 2D інструменти
zh_cn: 2D 工具
zh_tw: 2D 工具

source: :ref:`TileMaps <doc_using_tilemaps>` for 2D tile-based level design.
de: :ref:`TileMaps <doc_using_tilemaps>` für 2D-Tile-basiertes Leveldesign.
es: :ref:`TileMaps <doc_using_tilemaps>` para el diseño de niveles basados en mosaicos 2D.
uk: :ref:`Карти плиток <doc_using_tilemaps>` для проектування 2D рівнів з плиток.
zh_cn: :ref:`TileMap <doc_using_tilemaps>` 用于由 2D 图块构建的关卡设计。
zh_tw: :ref:`TileMap <doc_using_tilemaps>` 用於由 2D 圖塊建構的關卡設計。

source: 2D camera with built-in smoothing and drag margins.
de: 2D-Kamera mit integrierter Glättung und Schlepprändern.
es: Cámara 2D con suavizado integrado y márgenes de arrastre.
uk: 2D-камера з вбудованими функціями згладжування та перетягування країв.
zh_cn: 内置平滑和拖动边距的 2D 相机.
zh_tw: 具有內建平滑與拖移邊距的 2D 相機。

source: Path2D node to represent a path in 2D space.
de: Path2D-Node zur Repräsentation eines Pfades im 2D-Raum.
es: Nodo Path2D para representar una ruta en el espacio 2D.
uk: Path2D вузол для малювання шляху у 2d просторі.
zh_cn: 用于代表 2D 空间中的一条路径的 Path2D 节点。
zh_tw: 用於在 2D 空間中表示路徑的 Path2D 節點。

source: Can be drawn in the editor or generated procedurally.
de: Kann im Editor gezeichnet oder prozedural erzeugt werden.
es: Pueden ser dibujados en el editor o generados de forma procedural.
uk: Може бути намальовано в редакторі або згенеровано процедурно.
zh_cn: 可以在编辑器中绘制或者通过程序生成。
zh_tw: 可在編輯器中繪製或以程式產生。

source: PathFollow2D node to make nodes follow a Path2D.
de: PathFollow2D-Node, um Nodes einem Path2D folgen zu lassen.
es: Nodo PathFollow2D para hacer que los nodos sigan un Path2D.
uk: Вузол PathFollow2D, щоб змусити вузли рухатися по Path2D.
zh_cn: 用于使节点跟随一条Path2D的PathFollow2D 节点.
zh_tw: 可用於使節點跟著 Path2D 路徑的 PathFollow2D 節點。

source: :ref:`2D geometry helper class <class_Geometry2D>`.
de: :ref:`Hilfs-Klasse für 2D-Geometrie <class_Geometry2D>`.
es: :ref:`Clase ayudante para geometría 2D <class_Geometry2D>`.
uk: :ref:`2D геометрія допоміжний клас <class_Geometry2D>`.
zh_cn: :ref:`2D 几何辅助类 <class_Geometry2D>`\ 。
zh_tw: :ref:`2D 幾何輔助類 <class_Geometry2D>` 。

source: 2D physics
de: 2D-Physik
es: Físicas 2D
uk: 2D фізика
zh_cn: 2D 物理
zh_tw: 2D 物理

source: **Physics bodies:**
de: **Physik-Bodies:**
es: **Cuerpos físicos:**
uk: **Фізичні тіла:**
zh_cn: **物理体：**
zh_tw: **物理形體：**

source: Static bodies.
es: Cuerpos estáticos.
uk: Статичні тіла.
zh_cn: 静态物体。
zh_tw: 靜態形體。

source: Animatable bodies (for objects moving only by script or animation, such as doors and platforms).
de: Animierbare Bodies (für Objekte, die sich nur per Skript oder Animation bewegen, z.B. Türen und Plattformen).
es: Cuerpos animables (para objetos que sólo se mueven por script o animación, como puertas y plataformas).
uk: Тіла, які можна анімувати (для об’єктів, що рухаються лише за скриптом або анімацією, як-от двері та платформи).
zh_cn: 动画体（用于仅通过脚本或动画移动的物体，如门和平台）。
zh_tw: 動畫體（用於僅通過腳本或動畫移動的物體，如門和平臺）。

source: Rigid bodies.
es: Cuerpos rígidos.
uk: Тверді тіла.
zh_cn: 刚体。
zh_tw: 剛體。

source: Character bodies.
es: Cuerpos para personajes.
uk: Тіла персонажів.
zh_cn: 角色体。
zh_tw: 靜態形體。

source: Joints.
de: Gelenke.
es: Articulaciones.
uk: Суглоби.
zh_cn: 关节。
zh_tw: 關節。

source: Areas to detect bodies entering or leaving it.
de: Regionen, die Bodies erkennen, die sie betreten oder verlassen.
es: Zonas para detectar cuerpos que entran o salen de él.
uk: Області для виявлення тіл, що входять в них, або виходять за межі цих областей.
zh_cn: 用以检测实体进入或离开的区域.
zh_tw: 用於偵測形體進入或離開的區域。

source: **Collision detection:**
de: **Kollisionserkennung:**
es: **Detección de colisiones:**
uk: **Виявлення зіткнень:**
zh_cn: **碰撞检测:**
zh_tw: **碰撞偵測：**

source: Built-in shapes: line, box, circle, capsule, world boundary (infinite plane).
de: Built-in-Shapes: Linie, Rechteck, Kreis, Capsule, Welt-Grenze (unendliche Fläche).
es: Figuras integradas: línea, caja, círculo, cápsula, límites de mundo (plano infinito).
uk: Вбудовані форми: лінія, коробка, коло, капсула, межа світу (нескінченна площина).
zh_cn: 内置形状：线条，框体，圆圈，胶囊，世界边界（无限平面）。
zh_tw: 內建形狀：線、框、圈、橢圓。

source: Collision polygons (can be drawn manually or generated from a sprite in the editor).
de: Kollisions-Polygone (können manuell gezeichnet oder aus einem Sprite im Editor erzeugt werden).
es: Polígonos de colisión (se pueden dibujar manualmente o generar desde un objeto en el editor).
uk: Полігони зіткнення (можна намалювати вручну або нагенерувати з спрайта в редакторі).
zh_cn: 碰撞多边形（可以人工绘制，或者在编辑器中根据精灵生成）。
zh_tw: 碰撞幾何 (可手動繪製或從編輯器中自 Sprite 產生)。

source: 3D graphics
de: 3D-Grafik
es: Gráficos 3D
uk: 3D графіка
zh_cn: 3D 图形
zh_tw: 3D 圖形

source: HDR rendering with sRGB.
de: HDR-Rendering mit sRGB.
es: Renderizando HDR con sRGB.
uk: HDR-рендеринг з sRGB.
zh_cn: 使用 sRGB 进行 HDR 渲染。
zh_tw: 使用 sRGB 進行 HDR 算繪。

source: Perspective, orthographic and frustum-offset cameras.
de: Perspektivische, orthografische und Frustum-Offset Kameras.
es: Cámaras de perspectiva, ortográficas y offset troncocónicas.
uk: Перспективні, ортографічні та фрустум-офсетні камери.
zh_cn: 透视、正交以及视锥偏移摄像机。
zh_tw: 透視法、正視投影與錐臺偏移相機。

source: When using the Forward+ backend, a depth prepass is used to improve performance in complex scenes by reducing the cost of overdraw.
de: Bei Verwendung des Forward+-Backends wird ein Tiefenvordurchlauf verwendet, um die Leistung in komplexen Szenen zu verbessern, indem die Kosten des Überzeichnens reduziert werden.
es: Cuando se utiliza el backend Forward+, se utiliza un paso previo de profundidad para mejorar el rendimiento en las escenas complejas reduciendo el coste del sobredibujo.
uk: Під час використанні режиму Forward+, для покращення продуктивності, в складних сценах для зменшення вартості перемальовування використовується попередній прохід глибини.
zh_cn: 在使用 Forward+ 后端时，可利用深度预处理（depth prepass）降低过度绘制成本从而提高复杂场景的性能。
zh_tw: 在使用 Forward+ 後端時，可利用深度預處理（depth prepass）降低過度繪製成本從而提高複雜場景的性能。

source: :ref:`doc_variable_rate_shading` on supported GPUs in Forward+ and Forward Mobile.
de: :ref:`doc_variable_rate_shading` auf unterstützten GPUs in Forward+ und Forward Mobile.
es: :ref:`doc_variable_rate_shading` en las GPU compatibles con Forward+ y Forward Mobile.
uk: :ref:`doc_variable_rate_shading` на підтримуваних в Forward+та Forward Mobile GPU-ах.
zh_cn: :ref:`doc_variable_rate_shading` 可在支持的 GPU 并且 Forward+ 和 Forward Mobile 模式下使用。
zh_tw: :ref:`doc_variable_rate_shading` 可在支援的 GPU 並且 Forward+ 和 Forward Mobile 模式下使用。

source: **Physically-based rendering (built-in material features):**
de: **Physikbasiertes Rendering (integrierte Material-Merkmale):**
es: ** Renderización basada en física (características de materiales embebidas): **
uk: **Фізично достовірний рендеринг (вбудовані особливості матеріалів):**
zh_cn: **基于物理的渲染（内置材质特性）：**
zh_tw: **基於物理的算繪（內建材質功能）：**

source: Follows the Disney PBR model.
de: Folgt dem Disney PBR Model.
es: Sigue el modelo Disney PBR.
uk: Наслідує модель Disney PBR.
zh_cn: 遵循迪士尼 PBR 模型。
zh_tw: 依照 Disney PBR 模型。

source: Supports Burley, Lambert, Lambert Wrap (half-Lambert) and Toon diffuse shading modes.
de: Unterstützt Burley-, Lambert-, Lambert Wrap- (Half-Lambert), und Toon-Diffusions-Shading-Modi.
es: Soporta los modos de shading difuso Barley, Lambert, Lambert Wrap (medio Lambert) y Toon.
uk: Підтримує режими розсіяного затінення Burley, Lambert, Lambert Wrap (half-Lambert) і Toon.
zh_cn: 支持 Burley、Lambert、Lambert Wrap（半 Lambert）、Toon 漫反射着色模式。
zh_tw: 支援 Burley、Lambert、Lambert Wrap（半 Lambert）、Toon 漫反射著色模式。

source: Supports Schlick-GGX, Toon and Disabled specular shading modes.
de: Unterstützt Modi Schlick-GGX, Toon und „Deaktiviert“ für Glanz-Reflexion.
es: Soporta los modos de shading especular Schlick-GGX, Toon y deshabilitado.
uk: Підтримує режими дзеркального затінення Schlick-GGX, Toon та Disabled.
zh_cn: 支持 Schlick-GGX、Toon 和 Disabled 镜面反射着色模式。
zh_tw: 支援 Schlick-GGX、Toon 和 Disabled 鏡面反射著色模式。

source: Uses a roughness-metallic workflow with support for ORM textures.
de: Nutzt einen metallisch-rohen Arbeitsablauf mit Unterstützung für ORM Texturen.
es: Utiliza un flujo de trabajo de rugosidad metálica con soporte para texturas ORM.
uk: Використовує шорстко-металевий робочий процес із підтримкою ORM-текстур.
zh_cn: 使用粗糙度金属度工作流，支持 ORM 纹理。
zh_tw: 使用粗糙度金屬度工作流，支援 ORM 紋理。

source: Uses horizon specular occlusion (Filament model) to improve material appearance.
de: Horizon Specular Occlusion (Filamentmodell) um das Erscheinungsbild des Materials zu verbessern.
es: Utiliza la oclusión especular del horizonte (modelo Filament) para mejorar la apariencia del material.
uk: Використовує дзеркальну оклюзію горизонту (модель Filament) для покращення зовнішнього вигляду матеріалу.
zh_cn: 使用地平线镜面反射遮蔽（Filament 模型）提升材质外观。
zh_tw: 使用地平綫镜面反射遮蔽（Filament 模型）提升材质外觀。

source: Normal mapping.
es: Mapeo de normales.
uk: Normal Map (Карта нормалей).
zh_cn: 法线贴图。
zh_tw: 法線貼圖。

source: Parallax/relief mapping with automatic level of detail based on distance.
de: Parallaxen-/Relief-Mapping mit automatischem Detailgrad abhängig von der Entfernung.
es: Mapeo de paralaje/relieve con nivel automático de detalle basado en la distancia.
uk: Мапування паралаксу/рельєфу з автоматичним рівнем деталізації залежно від відстані.
zh_cn: 具有基于距离的自动细节级别的视差/浮雕贴图。
zh_tw: 具有基於距離的自動細節級別的視差/浮雕貼圖。

source: Detail mapping for the albedo and normal maps.
de: Detailmapping für Albedo- und Normalmaps.
es: Mapeo detallado para los mapas de albedo y normales.
uk: Детальне відображення альбедо і карт нормалей.
zh_cn: 反照率及法线贴图的细节贴图。
zh_tw: 反照率和法線貼圖的詳細貼圖。

source: Sub-surface scattering and transmittance.
de: Sub-Surface-Scattering und Lichtdurchlässigkeit.
es: Transmitancia y dispersión subsuperficial.
uk: Підповерхневе розсіювання та пропускання.
zh_cn: 次表面散射和透射率。
zh_tw: 次表面散射和透射率。

source: Screen-space refraction with support for material roughness (resulting in blurry refraction).
de: Screen-Space-Lichtbrechung mit Unterstützung für Material-Rauheit (führt zu verschwommener Brechung).
es: Refracción en espacio de pantalla con soporte para la rugosidad del material (lo que resulta en una refracción borrosa).
uk: Екранно-просторове заломлення з підтримкою шорсткості матеріалу (що призводить до розмитого заломлення).
zh_cn: 支持材质粗糙度的屏幕空间折射（达到模糊折射的效果）。
zh_tw: 支援材質粗糙度的螢幕空間折射（達到模糊折射的效果）。

source: Proximity fade (soft particles) and distance fade.
de: Nahausblendung (Soft-Partikel) und Fernausblendung.
es: Desvanecimiento por proximidad (partículas suaves) y por distancia.
uk: Згасання поблизу (м'які частинки) і згасання на відстані.
zh_cn: 邻近淡出（软粒子）和距离淡出。
zh_tw: 鄰近淡出（軟粒子）和距離淡出。

source: Distance fade can use alpha blending or dithering to avoid going through the transparent pipeline.
de: Fernausblendung kann Alpha-Blending oder Dithering nutzen, um den Weg durch die Transparenz-Pipeline zu vermeiden.
es: Desvanecimiento por distancia puede usar mezcla alfa o difuminado para evitar pasar por el pipeline de transparencia.
uk: Для згладжування відстані можна використовувати альфа-змішування або згладжування, щоб уникнути проходження через прозорий контур.
zh_cn: 远离时淡出可以使用透明度混合（alpha blending）或颜色抖动（dithering）避免穿过透明管线。
zh_tw: 遠離時淡出可以使用透明度混合（alpha blending）或顏色抖動（dithering）避免穿過透明管線。

source: Dithering can be determined on a per-pixel or per-object basis.
de: Dithering kann auf Pixel- oder Objekt-Basis berechnet werden.
es: El difuminado se puede determinar por píxel o por objeto.
uk: Дитеринг може бути визначено на рівні пікселів або окремих об'єктів.
zh_cn: 抖动可以根据每个像素或每个对象来确定。
zh_tw: 晃動可依像素級別或物件級別來判斷。

source: **Real-time lighting:**
de: **Echtzeit-Beleuchtung:**
es: **Iluminación en tiempo real:**
uk: **Освітлення в режимі реального часу:**
zh_cn: **实时光照：**
zh_tw: **即時光照：**

source: Directional lights (sun/moon). Up to 4 per scene.
de: Richtungsabhängige Beleuchtung (Sonne/Mond), bis zu 4 pro Szene.
es: Luces direccionales (sol / luna). Hasta 4 por escena.
uk: Спрямовувані джерела світла (сонце/місяць). До 4 на сцену.
zh_cn: 全向光（日光/月光）。每个场景最多 4 个。
zh_tw: 有向光照 (太陽/月亮)。每個場景最多可有 4 個。

source: Omnidirectional lights.
de: Rundum Beleuchtung.
es: Luces omnidireccionales.
uk: Всебічне світло.
zh_cn: 全向光。
zh_tw: 全向光照。

source: Spot lights with adjustable cone angle and attenuation.
de: Spot Lights mit einstellbarem Kegelwinkel und Dämpfung.
es: Focos con ángulo de cono ajustable y atenuación.
uk: Точкове світло з регульованим кутом конуса і загасанням.
zh_cn: 可调整锥角和衰减的聚光。
zh_tw: 有可調整圓錐角與衰減的聚光。

source: Specular, indirect light, and volumetric fog energy can be adjusted on a per-light basis.
de: Die Energie von spiegelndem, indirektem Licht und volumetrischem Nebel kann für jedes einzelne Licht eingestellt werden.
es: Las energías de efecto especular, luz indirecta y niebla volumétrica se puede ajustar por cada luz.
uk: Енергію дзеркального, непрямого світла та об'ємного туману можна регулювати окремо для кожного джерела світла.
zh_cn: 镜面反射、间接光和体积雾能量可以根据每个光源独立进行调整。

source: Adjustable light "size" for fake area lights (will also make shadows blurrier).
de: Einstellbare Licht-„Größe“ für unechte Flächenlichter (macht auch Schatten unschärfer).
es: "Tamaño" de luz ajustable para luces de área falsas (también difumina las sombras).
uk: Регульований "розмір" світла для штучного освітлення області (також зробить тіні більш розмитими).
zh_cn: 可调节的灯光 "大小" 来帮助虚拟区域打光（也会使阴影更模糊）。
zh_tw: 可調節的燈光 "大小" 來説明虛擬區域打光（也會使陰影更模糊）。

source: Optional distance fade system to fade distant lights and their shadows, improving performance.
de: Optionales Fernausblendungssystem zum Ausblenden entfernter Lichter und ihrer Schatten, um die Leistung zu verbessern.
es: Sistema opcional de atenuación a distancia para atenuar las luces distantes y sus sombras, mejorando el rendimiento.
uk: Додаткова система згасання віддаленого світла та тіней від нього, покращує продуктивність.
zh_cn: 可以选择距离渐变系统（distance fade system）来渐变远处的灯光及其阴影，提高性能。
zh_tw: 可以選擇距離漸變系統（distance fade system ）來漸變遠處的燈光及其陰影，提高性能。

source: When using the Forward+ backend (default on desktop), lights are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of lights that can be used on a mesh.
de: Bei Verwendung des Forward+-Backends (Default bei Desktop) werden die Lichter mit geclusterten Vorwärtsoptimierungen gerendert, um ihre individuellen Kosten zu senken. Das Cluster-Rendering hebt auch alle Beschränkungen für die Anzahl der Lichter auf, die in einem Mesh verwendet werden können.
es: Cuando se utiliza el backend Forward+ (por defecto en escritorio), las luces se renderizan con optimizaciones forward agrupadas para disminuir su coste individual. El renderizado agrupado también elimina los límites en el número de luces que se pueden utilizar en una malla.
uk: При використання режиму Forward+ (за умовчанням на настільних комп’ютерах) світло візуалізується з кластерною попередньою оптимізацією, щоб зменшити його окрему вартість. Кластерний рендеринг також скасовує будь-які обмеження на кількість джерел світла, які можна використовувати в меші.
zh_cn: 当使用 Forward+ 后端（桌面上的默认设置）时，灯光将使用集群前向优化进行渲染，以降低其单独成本。集群渲染还取消了对网格上可以使用的灯光数量的任何限制。
zh_tw: 當使用 Forward+backend （桌面上的預設設定）時，燈光將使用集群前向優化進行算繪，以降低其單獨成本。集群算繪還取消了對網格上可以使用的燈光數量的任何限制。

source: When using the Forward Mobile backend, up to 8 omni lights and 8 spot lights can be displayed per mesh resource. Baked lighting can be used to overcome this limit if needed.
de: Wenn Sie das Forward Mobile Backend verwenden, können bis zu 8 Rundumlichter und 8 Spotlichter pro Mesh-Ressource angezeigt werden. Mit gebackener Beleuchtung kann dieses Limit bei Bedarf überwunden werden.
es: Cuando se utiliza el backend de Forward Mobile, se pueden mostrar hasta 8 luces omnidireccionales y 8 luces puntuales por recurso de malla. Si es necesario, se puede utilizar iluminación bakeada para superar este límite.
uk: При використанні режиму Forward Mobile можна відображати до 8 універсальних і 8 точкових джерел світла на ресурсі меша. Щоб подолати цю межу, якщо необхідно, можна використовувати запечене освітлення.
zh_cn: 使用 Forward 移动后端时，每个网格资源最多可以显示 8 个泛光灯和 8 个聚光灯。如果需要，可以使用烘焙照明来克服这一限制。
zh_tw: 使用 Forward Mobile backend 時，每個網格資源最多可以顯示 8 個泛光燈和 8 個聚光燈。如果需要，可以使用烘焙照明來克服這一限制。

source: **Shadow mapping:**
es: **Mapeo de sombras:**
uk: **Карта затінень:**
zh_cn: **阴影贴图：**
zh_tw: **陰影對應：**

source: *DirectionalLight:* Orthogonal (fastest), PSSM 2-split and 4-split. Supports blending between splits.
de: *DirectionalLight:* Orthogonal (am schnellsten), PSSM 2-split und 4-split. Unterstützt Blending zwischen Splits.
es: * DirectionalLight: * Ortogonal (más rápido), PSSM 2-split y 4-split. Admite la mezcla entre divisiones.
uk: *DirectionalLight (Спрямовуване світло):* Ортогональний (найшвидший), PSSM 2-split та 4-split. Підтримується змішування між розщепленнями.
zh_cn: *DirectionLight：*\ 正交（最快）、二分和四分 PSSM。支持在分割之间做混合。
zh_tw: **DirectionalLight:** 正交 (最快), PSSM 2-Split 與 4-Split。支援在 Split (切割) 間混合。

source: *OmniLight:* Dual paraboloid (fast) or cubemap (slower but more accurate). Supports colored projector textures in the form of panoramas.
de: *OmniLight:* Dual Parabolid (schnell) oder Cubemap (langsamer, aber genauer). Unterstützt farbige Projektortexturen in Form von Panoramen.
es: * OmniLight: * Paraboloide dual (rápido) o mapa de cubos (más lento pero más preciso). Admite texturas de proyector con colores en forma de panorámicas.
uk: *OmniLight (Всебічне світло):* Подвійний параболід (швидкий), або кубічна карта (повільніша, але точніша). Підтримує кольорові текстури проєктора у вигляді панорам.
zh_cn: *OmniLight：*\ 双抛物面（快速）或立方映射（较慢但更精确）。支持全景形式的彩色投影纹理。
zh_tw: **OmniLight:** Dual Paraboloid (較快) 或 Cubemap (較慢但較精確)。支援 Panoramas 格式的色彩透射紋理 (Colored Projector Texture)。

source: *SpotLight:* Single texture. Supports colored projector textures.
de: *SpotLight:* Einzelne Textur. Unterstützt farbige Textur-Projektion.
es: *SpotLight:* Textura única. Soporta texturas de proyector con color.
uk: *SpotLight:* Окрема текстура. Підтримує кольорові текстури проектора.
zh_cn: *SpotLight：*\ 单个材质。支持彩色投影纹理。
zh_tw: **SpotLight:** 單一紋理。
