Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: de, es, uk, zh_cn, zh_tw

source: List of features
de: Featureliste
es: Lista de características
uk: Список особливостей
zh_cn: 特性列表
zh_tw: 功能列表

source: This page aims to list **all** features currently supported by Godot.
de: Diese Seite soll **alle** Features auflisten, die derzeit von Godot unterstützt werden.
es: Esta pagina tiene como objetivo listar **todas** las características actualmente soportadas por Godot.
uk: Ця сторінка має на меті перелічити **всі** можливості, які наразі підтримуються у Godot.
zh_cn: 本页旨在列出 Godot 当前支持的\ **所有**\ 特性。
zh_tw: 本頁列出了目前 Godot 所支援的所有功能。

source: This page lists features supported by the current stable version of Godot. Some of these features may not be available in the `LTS release series (3.x) <https://docs.godotengine.org/en/3.5/about/list_of_features.html>`__.
de: Diese Seite zeigt unterstützte Features der aktuell stabilen Godot-Version. Einige dieser Features sind möglicherweise nicht in der `LTS Release-Reihe (3.x) <https://docs.godotengine.org/en/3.5/about/list_of_features.html>`__ verfügbar.
es: Esta página lista todas las características soportadas por la versión estable actual de Godot. Algunas de esas características no están disponibles en `las versiones LTS (3.x) <https://docs.godotengine.org/en/3.5/about/list_of_features.html>`__.
uk: На цій сторінці перелічено можливості, які підтримуються поточною стабільною версією Godot. Деякі з цих можливостей можуть бути відсутніми у `LTS випусках (3.x) <https://docs.godotengine.org/en/3.5/about/list_of_features.html>`__.
zh_cn: 这个页面列出了当前稳定版本的 Godot 所支持的特性。其中一些功能可能在\ `LTS 版本系列 （3.x） <https://docs.godotengine.org/en/3.5/about/list_of_features.html>`_\中不可用。
zh_tw: 本頁列出了目前 Godot 穩定版中所支援的功能。 有些功能可能不存在於 `長期維護版本 (3.x) <https://docs.godotengine.org/zh_TW/latest/about/list_of_features.html>` 中__ 。

source: Platforms
de: **Plattformen**
es: Plataformas
uk: Платформи
zh_cn: 平台
zh_tw: 支援平台

source: **Can run both the editor and exported projects:**
de: **Mit Editor und exportierten Projekten kompatibel:**
es: **Puede correr, tanto el editor como los proyectos exportados:**
uk: **Можливо запустити як редактор так і експортовані проєкти :**
zh_cn: **可以运行编辑器以及导出项目的：**
zh_tw: **在編輯器與匯出的專案中均可執行：**

source: Binaries are statically linked and can run on any distribution if compiled on an old enough base distribution.
de: Binärdateien werden statisch gelinkt und können auf jeder Distribution ausgeführt werden, wenn sie auf einer ausreichend alten Basisdistribution kompiliert werden.
es: Los binarios están vinculados estáticamente y pueden ejecutarse en cualquier distribución si se compilan en una distribución base lo suficientemente antigua.
uk: Бінарні файли статично пов’язані і можуть працювати на будь-якому дистрибутиві, якщо вони складені на досить старій базі.
zh_cn: 二进制文件是静态链接的，并且如果在足够旧的基本发行版上进行编译，则可以在任何发行版上运行。
zh_tw: 二進位檔使用靜態連結，並且若在一定舊的基礎發行版上編譯，則可在任意發行版上執行。

source: :ref:`Web browsers <doc_using_the_web_editor>`. Experimental in 4.0, using Godot 3.x is recommended instead when targeting HTML5.
de: :ref:`Webbrowser <doc_using_the_web_editor>`. Experimentell in 4.0, es wird empfohlen, stattdessen Godot 3.x zu verwenden, wenn man auf HTML5 abzielt.
es: :ref:`Navegadores web <doc_usando_el_editor_web>`. Experimental en 4.0, se recomienda utilizar Godot 3.x cuando se utilice HTML5.
uk: :ref:`Web браузери <doc_using_the_web_editor>`. Експериментальна в 4.0, рекомендується використовувати Godot 3.x для HTML5.
zh_cn: :ref:`Web 浏览器<doc_using_the_web_editor>` 。在 4.0 中是实验性的，当针对 HTML5 时，建议使用 Godot 3.x。
zh_tw: :ref:`Web 瀏覽器<doc_using_the_web_editor>` 。在 4.0 的實驗中，當您的目標是 HTML5 時建議使用 Godot 3.x。

source: **Runs exported projects:**
de: **Nur mit exportierten Projekten kompatibel:**
es: **Ejecutando proyectos exportados:**
uk: **Запускає експортовані проєкти:**
zh_cn: **运行导出的项目：**
zh_tw: **執行匯出的專案：**

source: :ref:`Consoles <doc_consoles>`.
de: :ref:`Konsolen <doc_consoles>`.
es: :ref:`Consolas <doc_consoles>`.
uk: :ref:`Консолі <doc_consoles>`.
zh_cn: :ref:`主机 <doc_consoles>`。
zh_tw: :ref:`主控台 <doc_consoles>` 。

source: Godot aims to be as platform-independent as possible and can be :ref:`ported to new platforms <doc_custom_platform_ports>` with relative ease.
de: Godot zielt darauf ab, so plattformunabhängig wie möglich zu sein und kann mit relativer Leichtigkeit :ref:`auf neue Plattformen portiert werden <doc_custom_platform_ports>`.
es: Godot pretende ser independiente de plataformas lo más posible y a la vez permitir :ref:`migrar a nuevas plataformas <doc_custom_platform_ports>` con relativa facilidad.
uk: Godot прагне бути максимально незалежним від платформи і може бути відносно легко :ref:`перенесений на нові платформи <doc_custom_platform_ports>`.
zh_cn: Godot 的目标是尽可能地独立于平台，并且可以相对轻松地 :ref:`移植到新平台 <doc_custom_platform_ports>` 。
zh_tw: Godot 的目標是盡可能地獨立於平臺，並且可以相對輕鬆地 :ref:`移植到新平臺 <doc_custom_platform_ports>` 。

source: Projects written in C# using Godot 4 currently cannot be exported to the web platform. To use C# on that platform, consider Godot 3 instead. Android and iOS platform support is available as of Godot 4.2, but is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
de: Projekte, die in C# mit Godot 4 geschrieben wurden, können derzeit nicht auf die Web-Plattform exportiert werden. Um C# auf dieser Plattform zu verwenden, sollten Sie stattdessen Godot 3 verwenden. Unterstützung für die Plattformen Android und iOS ist ab Godot 4.2 verfügbar, dies ist aber experimentell und :ref:`es gelten einige Einschränkungen <doc_c_sharp_platforms>`.
es: Actualmente los proyectos de Godot 4 escritos con C# no pueden ser exportados a plataformas web. Si desea utilizar C# para exportar a esta plataformas, considere utilizar Godot 3. Actualmente el soporte de las plataformas Android y iOS esta disponible a partir de Godot 4.2, pero es experimental y :ref:`se aplican algunas limitaciones <doc_c_sharp_platforms>`.
uk: Проекти, написані на C# для Godot 4, наразі не можна експортувати на веб-платформу. Щоб використовувати C# на цій платформі, розгляньте Godot 3. Підтримка платформ Android та iOS доступна з Godot 4.2, але є експериментальною та :ref:`застосовуванням деяких обмежень <doc_c_sharp_platforms>`.
zh_cn: 在 Godot 4 中用 C# 编写的项目目前无法导出到 Web 平台。如果要在该平台上使用 C#，请考虑使用 Godot 3。 （C# 的）Android 和 iOS 平台支持从 Godot 4.2 开始提供，但仍处于实验阶段，并且 :ref:`存在一些限制 <doc_c_sharp_platforms>` 。

source: Editor
uk: Редактор
zh_cn: 编辑器
zh_tw: 編輯器

source: **Features:**
es: **Características:**
uk: **Особливості:**
zh_cn: **特性：**
zh_tw: **功能：**

source: Scene tree editor.
de: Szenen-Baum Editor.
es: Editor del Árbol de Escenas.
uk: Дерево сцени.
zh_cn: 场景树编辑器。
zh_tw: 場景樹編輯器。

source: Built-in script editor.
de: Integrierter Skript-Editor.
es: Editor de scripts integrado.
uk: Вбудований редактор скриптів.
zh_cn: 内置脚本编辑器。
zh_tw: 內建腳本編輯器。

source: Support for :ref:`external script editors <doc_external_editor>` such as Visual Studio Code or Vim.
de: Unterstützung von :ref:`externen Skript-Editoren <doc_external_editor>` wie z.B. Visual Studio Code oder Vim.
es: Soporte para :ref:`editores externos de código <doc_external_editor_>`tal como Visual Studio Code o Vim.
uk: Підтримка :ref:`зовнішніх редакторів скриптів <doc_external_editor>` таких як Visual Studio Code або Vim.
zh_cn: 支持 Visual Studio Code、VIM 等\ :ref:`外部文本编辑器 <doc_external_editor>`。
zh_tw: 支援如 Visual Studio Code 或 Vim 的 :ref:`外部腳本編輯器 <doc_external_editor>` 。

source: GDScript :ref:`debugger <doc_debugger_panel>`.
es: GDScript :ref:`depurador <doc_debugger_panel>`.
uk: GDScript :ref:`зневаджувач <doc_debugger_panel>`.
zh_cn: GDScript :ref:`调试器 <doc_debugger_panel>`。
zh_tw: GDScript :ref:`除錯工具 <doc_debugger_panel>` 。

source: Visual profiler with CPU and GPU time indications for each step of the rendering pipeline.
de: Visueller Profiler mit CPU- und GPU-Zeitangaben für jeden Schritt der Rendering-Pipeline.
es: Generador de perfiles visual con indicaciones de tiempo de CPU y GPU para cada paso del proceso de renderizado.
uk: Візуальний профайлер із індикацією часу CPU та GPU для кожного кроку шкали візуалізації.
zh_cn: 可视化（性能）分析器能指出在渲染管线中 CPU 与 GPU 在每个步骤花费的时间。
zh_tw: 視覺化（性能）分析器能指出在算繪管線中 CPU 與 GPU 在每個步驟花費的時間。

source: Performance monitoring tools, including :ref:`custom performance monitors <doc_custom_performance_monitors>`.
de: Tools zur Leistungsüberwachung, einschließlich :ref:`Eigener Performance-Monitore <doc_custom_performance_monitors>`.
es: Herramientas de supervisión del rendimiento, incluyendo :ref:`monitores de rendimiento personalizados <doc_custom_performance_monitors>`.
uk: Інструменти моніторингу продуктивності, включаючи :ref:`користувацькі монітори продуктивності <doc_custom_performance_monitors>`.
zh_cn: 性能监视工具，包括\ :ref:`自定义性能监视器 <doc_custom_performance_monitors>`\ 。
zh_tw: 性能監視工具，包括 :ref:`自訂效能監視器 <doc_custom_performance_monitors>` 。

source: Live script reloading.
de: Live-Neuladen von Skripten.
es: Recarga de script en vivo.
uk: Миттєве перезавантаженя скриптів.
zh_cn: 脚本热重载。
zh_tw: 即時腳本重載。

source: Live scene editing.
de: Live-Bearbeitung von Szenen.
es: Edición de escenas en vivo.
uk: Редагування сцени в реальному часі.
zh_cn: 场景热编辑。
zh_tw: 即時場景編輯。

source: Changes will reflect in the editor and will be kept after closing the running project.
de: Änderungen werden im Editor angezeigt und nach dem Schließen des laufenden Projekts auch gespeichert.
es: Los cambios se reflejarán en el editor y se mantendrán después de haber cerrado el proyecto en curso.
uk: Зміни одразу відобразяться в редакторі і збережуться після закриття проєкту.
zh_cn: 更改会在编辑器中生效并且会在关闭当前项目后保留。
zh_tw: 更改將反應到編輯器上，並會在正在執行的專案關閉後保留。

source: Remote inspector.
de: Remote-Inspektor.
es: Inspector remoto.
uk: Дистанційний інспектор.
zh_cn: 远程检查器。
zh_tw: 遠端屬性面板。

source: Changes won't reflect in the editor and won't be kept after closing the running project.
de: Änderungen werden nicht im Editor angezeigt und nach dem Schließen des laufenden Projekts auch nicht gespeichert.
es: Los cambios no se reflejarán en el editor y no se mantendrán después de cerrar el proyecto en ejecución.
uk: Зміни не відобразяться в редакторі і не збережуться після закриття робочого проєкту.
zh_cn: 在关闭正在运行的项目后，更改不会被反映在编辑器中，也不会被保留。
zh_tw: 更改將不會反應到編輯器上，且關閉正在執行的專案後將不會保留。

source: Live camera replication.
de: Live-Kamera-Replikation.
es: Réplica de la cámara en vivo.
uk: Реплікація камери в реальному часі.
zh_cn: 实时摄像机复制。
zh_tw: 即時相機複製。

source: Move the in-editor camera and see the result in the running project.
de: Bewegen Sie die Kamera im Editor und sehen Sie sich das Ergebnis im laufenden Projekt an.
es: Mueve la cámara en el editor y mira el resultado en el proyecto ejecutándose.
uk: Перемістіть камеру в редакторі та перегляньте зміни в робочому проєкті.
zh_cn: 移动编辑器中的摄像头，并在正在运行的项目中查看结果。
zh_tw: 移動編輯器中的相機，並在執行中專案內檢視結果。

source: Built-in offline class reference documentation.
de: Integrierte Offline-Klassenreferenz-Dokumentation.
es: Documentación de referencia de clase fuera de línea incorporada.
uk: Вбудована довідка для класів.
zh_cn: 内置离线类参考文档。
zh_tw: 內寘離線類參攷檔案。

source: Use the editor in dozens of languages contributed by the community.
de: Verwenden Sie den Editor in Dutzenden von Sprachen, die von der Community zur Verfügung gestellt werden.
es: Usa el editor en docenas de lenguajes contribuidos por la comunidad.
uk: Використовуйте редактор на десятках мов, що надаються спільнотою.
zh_cn: 使用由社区贡献的支持数十种语言的编辑器。
zh_tw: 在編輯器中使用數十種由社群支援的語言。

source: **Plugins:**
uk: **Плагіни (додатки):**
zh_cn: **插件：**
zh_tw: **外掛程式：**

source: Editor plugins can be downloaded from the :ref:`asset library <doc_what_is_assetlib>` to extend editor functionality.
de: Editor Plugins können aus der :ref:`Asset-Bibliothek <doc_what_is_assetlib>` heruntergeladen werden, um die Editorfunktionen zu erweitern.
es: Los plugins del editor se pueden descargar de la :ref:`librería de assets <doc_what_is_assetlib>` para extender la funcionalidad del editor.
uk: З :ref:`бібліотеки активів <doc_what_is_assetlib>` можна завантажити плагіни для розширення функціональності редактора.
zh_cn: 可以从\ :ref:`资产库 <doc_what_is_assetlib>`\ 下载编辑器插件，扩展编辑器的功能。
zh_tw: 可以從 :ref:`素材庫 <doc_what_is_assetlib>` 中下載編輯器外掛來擴充編輯器的功能。

source: :ref:`Create your own plugins <doc_making_plugins>` using GDScript to add new features or speed up your workflow.
de: :ref:`Erstellen Sie eigene Plugins <doc_making_plugins>` mittels GDScript, um neue Features hinzuzufügen oder den Arbeitsablauf zu beschleunigen.
es: :ref:` Crea tus propios plugins <doc_making_plugins>` usando GDScript para añadir nuevas características o acelerar tu flujo de trabajo.
uk: :ref:`Створюйте власні плагіни<doc_making_plugins>` за допомогою GDScript, щоб додати нові функції, чи прискорити свою роботу.
zh_cn: 使用 GDScript :ref:`自己创建插件 <doc_making_plugins>`\ ，添加新功能或者加速你的工作流。
zh_tw: 使用 GDScript :ref:`自己建立外掛程式 <doc_making_plugins>` ，新增新功能或者加速你的工作流。

source: :ref:`Download projects from the asset library <doc_using_assetlib_editor>` in the Project Manager and import them directly.
de: :ref:`Laden Sie Projekte von der Asset-Bibliothek <doc_using_assetlib_editor>` in den Projektmanager herunter und importieren diese direkt.
es: :ref:`Descarga proyectos desde la biblioteca de recursos <doc_using_assetlib_editor>` en el Administrador de Proyectos e impórtalos directamente.
uk: :ref:`Звантажуйте проекти з бібліотеки ресурсів <doc_using_assetlib_editor>` у Диспетчері проектів та імпортуйте їх напряму.
zh_cn: 在项目管理器中，\ :ref:`从资产库下载项目 <doc_using_assetlib_editor>`\ 并直接导入。
zh_tw: 在專案管理器中， :ref:`從素材庫下載專案 <doc_using_assetlib_editor>` 並直接匯入。

source: Rendering
de: Rendern
es: Renderización
uk: Рендеринг
zh_cn: 渲染
zh_tw: 算繪

source: 3 rendering *methods* (running over 2 rendering *drivers*) are available:
de: Es stehen 3 Render-*Methoden* zur Verfügung (die über 2 Render-*Treiber* laufen):
es: Hay disponibles 3 *métodos* de renderizado (que funcionan sobre 2 *drivers* de renderizado):
uk: Доступні 3 *методи* рендеринга (працюючі на двох візуалізуючих *драйверах*):
zh_cn: 提供 3 种渲染\ *方法*\ （运行在 2 种渲染\ *驱动*\ 上）：
zh_tw: 提供 3 種算繪 *方法* （運作在 2 種算繪 *驅動* 上）：

source: **Forward+**, running over Vulkan 1.0 (with optional Vulkan 1.1 and 1.2 features). The most advanced graphics backend, suited for desktop platforms only. Used by default on desktop platforms.
de: **Forward+**, läuft über Vulkan 1.0 (mit optionalen Vulkan 1.1 und 1.2-Features). Das fortschrittlichste Grafik-Backend, nur für Desktop-Plattformen geeignet. Standardeinstellung auf Desktop-Plattformen.
es: **Forward+**, que funciona sobre Vulkan 1.0 (con funciones opcionales de Vulkan 1.1 y 1.2). El backend gráfico más avanzado, adecuado únicamente para plataformas de escritorio. Es utilizado por defecto en plataformas de escritorio.
uk: **Forward+**, працює на Vulkan 1.0 (з додатковими Vulkan 1.1 та 1.2). Найдосконаліший графічний сервер, який підходить лише для настільних платформ. Використовується за замовчуванням на настільних платформах.
zh_cn: **Forward+**\ ，在Vulkan 1.0 以上运行（具备可选的 Vulkan 1.1和 1.2 功能）。仅适用于桌面平台的最先进图形后端。在桌面平台上默认使用。
zh_tw: **Forward+** ，在Vulkan 1.0 以上運作（具備可選的 Vulkan 1.1和 1.2 功能）。僅適用於桌面平臺的最先進圖形後端。在桌面平臺上預設使用。

source: **Forward Mobile**, running over Vulkan 1.0 (with optional Vulkan 1.1 and 1.2 features). Less features, but renders simple scenes faster. Suited for mobile and desktop platforms. Used by default on mobile platforms.
de: **Forward Mobile**, läuft über Vulkan 1.0 (mit optionalen Vulkan 1.1 und 1.2-Features). Weniger Features, rendert aber einfache Szenen schneller. Geeignet für mobile und Desktop-Plattformen. Standardeinstellung auf mobilen Plattformen.
es: **Forward Mobile**, que funciona sobre Vulkan 1.0 (con características opcionales de Vulkan 1.1 y 1.2). Menos características, pero renderiza escenas sencillas más rápido. Adecuado para plataformas móviles y de escritorio. Es utilizado por defecto en plataformas móviles.
uk: **Forward Mobile**,працює на Vulkan 1.0 (з додатковими Vulkan 1.1 та 1.2 features). Менше функцій, але швидше рендерить прості сцени. Підходить для мобільних і настільних платформ. Використовується за замовчуванням на мобільних платформах.
zh_cn: **Forward Mobile**\ ，在 Vulkan 1.0 以上运行（带有可选的 Vulkan 1.1 和 1.2 功能）。该功能较少，但渲染简单场景更快。适用于移动和桌面平台。在移动平台上默认使用。
zh_tw: **Forward Mobile** ，在 Vulkan 1.0 以上運作（帶有可選的 Vulkan 1.1 和 1.2 功能）。該功能較少，但算繪簡單場景更快。適用於移動和桌面平臺。在移動平臺上默認使用。

source: **Compatibility**, running over OpenGL 3.3 / OpenGL ES 3.0 / WebGL 2.0. The least advanced graphics backend, suited for low-end desktop and mobile platforms. Used by default on the web platform.
de: **Compatibility**, läuft über OpenGL 3.3 / OpenGL ES 3.0 / WebGL 2.0. Das am wenigsten fortgeschrittene Grafik-Backend, geeignet für Low-End-Desktop- und Mobilplattformen. Standardeinstellung auf der Webplattform.
es: **Compatibilidad**, funciona sobre OpenGL 3.3 / OpenGL ES 3.0 / WebGL 2.0. El backend gráfico menos avanzado, adecuado para plataformas móviles y de escritorio de gama baja. Es utilizado por defecto en plataformas webs.
uk: **Compatibility**, працює на OpenGL 3.3 / OpenGL ES 3.0 / WebGL 2.0. Найменш просунутий графічний сервер, який підходить для настільних і мобільних платформ низького класу. Використовується за замовчуванням на веб-платформі.
zh_cn: **Compatibility（兼容）**\ ，在 OpenGL 3.3、OpenGL ES 3.0 和 WebGL 2.0 以上运行。最低级的图形后端，适合低端桌面和移动平台。在 Web 平台上默认使用。
zh_tw: **Compatibility（相容）** ，在 OpenGL 3.3、OpenGL ES 3.0 和 WebGL 2.0 以上運作。最低級的圖形後端，適合低端桌面和移動平臺。在 Web 平臺上預設使用。

source: 2D graphics
de: 2D Grafik
es: Gráficos 2D
uk: 2D графіка
zh_cn: 2D 图形
zh_tw: 2D 圖形

source: Sprite, polygon and line rendering.
de: Rendern von Sprites, Polygonen und Linien.
es: Renderización de sprites, polígonos y líneas.
uk: Рендер спрайтів, полігонів і ліній.
zh_cn: 精灵、多边形和线条渲染。
zh_tw: Sprite、多邊形與線條算繪引擎。

source: High-level tools to draw lines and polygons such as :ref:`class_Polygon2D` and :ref:`class_Line2D`, with support for texturing.
de: High-Level Tools zum Zeichnen von Linien und Polygonen wie :ref:`class_Polygon2D` und :ref:`class_Line2D`, mit Textur-Support.
es: Herramientas de alto nivel para dibujar líneas y polígonos tales como :ref:`class_Polygon2D` y :ref:`class_Line2D`, con soporte para texturas.
uk: Високорівневі інструменти для малювання ліній та полігонів, такі як :ref:`class_Polygon2D` та :ref:`class_Line2D`, з підтримкою текстурування.
zh_cn: 用于绘制线和多边形的高级工具，例如\ :ref:`class_Polygon2D`\ 和\ :ref:`class_Line2D`\ ，支持纹理。
zh_tw: 用於繪製線和多邊形的高級工具，例如 :ref:`class_Polygon2D` 和 :ref:`class_Line2D` ，支援紋理。

source: AnimatedSprite2D as a helper for creating animated sprites.
de: AnimatedSprite2D als Helfer zur Erstellung von animierten Sprites.
es: AnimatedSprite2D como ayudante para crear sprites animados.
uk: AnimatedSprite2D як помічник для створення анімованих спрайтів.
zh_cn: AnimatedSprite2D 辅助制作动画精灵。
zh_tw: AnimatedSprite2D 輔助製作動畫精靈。

source: Parallax layers.
de: Parallax-Ebenen.
es: Capas de parallax.
uk: Шари паралакса.
zh_cn: 视差层。
zh_tw: 視差圖層。

source: Pseudo-3D support including preview in the editor.
de: Pseudo-3D-Unterstützung inklusive Vorschau im Editor.
es: Compatibilidad con pseudo-3D, incluida la vista previa en el editor.
uk: Підтримка псевдо-3D, з попереднім переглядом у редакторі.
zh_cn: 伪 3D 支持，可在编辑器中进行预览。
zh_tw: 偽3D支援，可在編輯器中進行預覽。

source: :ref:`2D lighting <doc_2d_lights_and_shadows>` with normal maps and specular maps.
de: :ref:`2D-Beleuchtung <doc_2d_lights_and_shadows>` mit Normal Maps und Specular Maps.
es: :ref:`Iluminación 2D <doc_2d_lights_and_shadows>` con mapas de normales y mapas especulares.
uk: :ref:`2D освітлення <doc_2d_lights_and_shadows>`з картами нормалей та картами відображень.
zh_cn: 带有法线贴图和镜面反射贴图的 :ref:`2D 光照 <doc_2d_lights_and_shadows>`\ 。
zh_tw: 帶有法線貼圖和鏡面反射貼圖的 :ref:`2D 光照 <doc_2d_lights_and_shadows>` 。

source: Point (omni/spot) and directional 2D lights.
de: Punkt- (Omni/Spot) und direktionale 2D-Lichter.
es: Luces 2D puntuales (omnidireccional, lámpara) y direccionales.
uk: Точкове (омні/спот) і спрямоване 2D світло.
zh_cn: 2D 点光源（全向灯/聚光灯）和平行光源。
zh_tw: 2D 點光源（全向燈/聚光燈）和平行光源。

source: Hard or soft shadows (adjustable on a per-light basis).
de: Harte oder weiche Schatten (je Lichtquelle wählbar).
es: Sombras duras o difusas (ajustable por luz).
uk: Жорсткі або м'які тіні (регулюються для кожного світла окремо).
zh_cn: 硬阴影或软阴影（可根据每个光源进行调整）。
zh_tw: 晃動可依像素級別或物件級別來判斷。

source: Custom shaders can access a real-time :abbr:`SDF (Signed Distance Field)` representation of the 2D scene based on :ref:`class_LightOccluder2D` nodes, which can be used for improved 2D lighting effects including 2D global illumination.
de: Benutzerdefinierte Shader können auf eine Echtzeit- :abbr:`SDF (Signed Distance Field)`-Darstellung der 2D-Szene zugreifen, die auf :ref:`class_LightOccluder2D`-Node basiert, die für verbesserte 2D-Beleuchtungseffekte einschließlich 2D-Global Illumination verwendet werden können.
es: Los shaders personalizados pueden acceder en tiempo real a una representación :abbr:`SDF (Signed Distance Field)` de la escena 2D basada en nodos :ref:`class_LightOccluder2D`, que puede utilizarse para mejorar los efectos de iluminación 2D, incluida la iluminación global 2D.
uk: Користувацькі шейдери можуть в реальному часі до :abbr:`SDF (Signed Distance Field)` зображення 2D-сцени на основі вузлів :ref:`class_LightOccluder2D`, які можна використовувати для покращення ефектів 2D освітлення, включаючи 2D глобальне освітлення.
zh_cn: 自定义着色器可以访问一个基于 :ref:`class_LightOccluder2D` 节点的，由实时 :abbr:`SDF (Signed Distance Field，带符号距离场)` 表示的二维场景，它可以用于改进二维照明效果，包括二维全局光源。
zh_tw: 自訂著色器可以存取一個基於 :ref:`class_LightOccluder2D` 節點的，由即時 :abbr:`帶符號距離場 (SDF (Signed Distance Field))` 表示的二維場景，它可以用於改進二維照明效果，包括二維全域光源。

source: :ref:`Font rendering <doc_gui_using_fonts>` using bitmaps, rasterization using FreeType or multi-channel signed distance fields (MSDF).
de: :ref:`Schriftarten-Rendern<doc_gui_using_fonts>` unter Verwendung von Bitmaps, Rasterung unter Verwendung von FreeType oder Multi-Channel Signed Distance Fields (MSDF).
es: :ref:`Renderizado de fuentes <doc_gui_using_fonts>` utilizando mapas de bits, rasterización usando FreeType o campos de distancia con signo multicanal (MSDF).
uk: :ref:`Вимальовування шрифтів <doc_gui_using_fonts>` за допомогою растрових зображень, растеризація за допомогою FreeType або багатоканальних знакових полів відстані (MSDF).
zh_cn: :ref:`字体渲染 <doc_gui_using_fonts>`\ 使用位图，光栅化使用 FreeType 或多通道有符号距离场（MSDF）。
zh_tw: :ref:`字形算繪 <doc_gui_using_fonts>` 使用點陣圖，光柵化使用 FreeType 或多通道有符號距離場（MSDF）。

source: Bitmap fonts can be exported using tools like BMFont, or imported from images (for fixed-width fonts only).
de: Bitmap-Schriftarten können mithilfe von Tools wie BMFont exportiert, oder (für Schriftarten mit fester Breite) aus Bildern importiert werden.
es: Las fuentes Bitmap pueden ser exportadas usando herramientas como BMFont o importadas desde imágenes (para fuentes de ancho fijo solamente).
uk: Растрові шрифти можна експортувати за допомогою таких інструментів, як BMFont, або імпортувати із зображень (лише для шрифтів фіксованої ширини).
zh_cn: 位图字体可以使用 BMFont 等工具导出，也可以从图像导入（仅适用于等宽字体）。
zh_tw: 點陣字型可以使用 BMFont 等工具匯出，也可以從圖像匯入（僅適用於等寬字形）。

source: Dynamic fonts support monochrome fonts as well as colored fonts (e.g. for emoji). Supported formats are TTF, OTF, WOFF1 and WOFF2.
de: Dynamische Schriftarten unterstützen monochrome sowie mehrfarbige Schriftarten (z.B. Emoji). Unterstützte Formate sind TTF, OTF, WOFF1 und WOFF2.
es: DynamicFont soporta fuentes monocromáticas así como fuentes con color (ej. para emoji). Los formatos soportados son TTF, OTF, WOFF1 y WOFF2.
uk: DynamicFont підтримує монохромні шрифти, а також кольорові шрифти (наприклад, емодзі). Підтримувані формати: TTF, OTF, WOFF1 та WOFF2.
zh_cn: 动态字体支持单色字体以及彩色字体（例如用于表情符号）。支持的格式有 TTF、OTF、WOFF1 和 WOFF2。
zh_tw: 動態字形支援單色字形以及彩色字形（例如用於表情符號）。支援的格式有 TTF、OTF、WOFF1 和 WOFF2。
