Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/release_policy.po
Languages: de, es, zh_cn, zh_tw

source: Upgrading software while working on a project is inherently risky, so consider whether it's a good idea for your project before attempting an upgrade. Also, make backups of your project or use version control to prevent losing data in case the upgrade goes wrong.
de: Ein Software-Upgrade während der Arbeit an einem Projekt ist mit Risiken verbunden. Überlegen Sie daher vor dem Upgrade, ob es für Ihr Projekt eine gute Idee ist. Erstellen Sie außerdem Sicherungskopien Ihres Projekts oder verwenden Sie eine Versionsverwaltung, um Datenverluste zu vermeiden, falls das Upgrade schiefgeht.
es: Actualizar software mientras se trabaja en un proyecto es inherentemente riesgoso, así que considera si será una buena idea para tu proyecto antes de intentar actualizar. También haz backups para tu proyecto o utiliza un sistema de control de versiones para prevenir la pérdida de datos en caso de que una actualización salga mal.
zh_cn: 在项目中途升级软件本身就有风险，所以在尝试升级之前请慎重考虑，你的项目是否能够从升级中获益。另外，请做好项目的备份或者使用版本控制系统，防止在升级出错时造成数据的丢失。
zh_tw: 在專案中途升級軟體本身就有風險，所以在嘗試升級之前請慎重考慮，你的專案是否能夠從升級中獲益。另外，請做好專案的備份或者使用版本控制系統，防止在升級出錯時造成資料的丟失。

source: That said, we do our best to keep minor and especially patch releases compatible with existing projects.
de: Dennoch tun wir unser Bestes, um Minor- und insbesondere Patch-Releases mit bestehenden Projekten kompatibel zu halten.
es: Dicho esto, hacemos lo mejor posible para mantener las versiones menor y especialmente parche compatibles con proyectos existentes.
zh_cn: 也就是说，我们尽力确保的是次要版本，尤其是补丁版本与现有项目兼容。
zh_tw: 也就是說，我們盡力確保的是次要版本，尤其是更新版本與現有專案相容。

source: The general recommendation is to upgrade your project to follow new *patch* releases, such as upgrading from 4.0.2 to 4.0.3. This ensures you get bug fixes, security updates and platform support updates (which is especially important for mobile platforms). You also get continued support, as only the last patch release receives support on official community platforms.
de: Im Allgemeinen wird empfohlen, Ihr Projekt auf neue *Patch*-Versionen zu aktualisieren, z.B. von 4.0.2 auf 4.0.3. Dadurch wird sichergestellt, dass Sie Fehlerbehebungen, Sicherheitsaktualisierungen und Aktualisierungen der Plattformunterstützung erhalten (was besonders für mobile Plattformen wichtig ist). Außerdem erhalten Sie weiterhin Support, da nur die letzte Patch-Version auf den offiziellen Community-Plattformen unterstützt wird.
es: La recomendación general es actualizar tu proyecto siguiendo las versiones *parche*, como actualizar de 4.0.2 a 4.0.3. Esto asegura que tendrás bugs arreglados, soporte de actualizaciones de seguridad y actualizaciones de plataforma (lo que es importante especialmente en plataformas móviles). También tendrás soporte contínuo, ya que sólo las últimas versiones parche reciben soporte en plataformas oficiales de la comunidad.
zh_cn: 一般性建议是升级你的项目以跟进新的\ *补丁*\ 版本，例如从 4.0.2 升级到 4.0.3。 这可以确保你获得错误修复、安全更新和平台支持更新（这对于移动平台来说尤其重要）。 你还可以获得持续的支持，因为只有最后一个补丁版本才会在官方社区平台上获得支持。
zh_tw: 一般性建議是升級你的專案以跟進新的 *更新* 版本，例如從 4.0.2 升級到 4.0.3。 這可以確保你獲得錯誤修復、安全更新和平臺支援更新（這對於移動平臺來說尤其重要）。 你還可以獲得持續的支援，因為只有最後一個更新版本才會在官方社區平臺上獲得支援。

source: For *minor* releases, you should determine whether it's a good idea to upgrade on a case-by-case basis. We've made a lot of effort in making the upgrade process as seamless as possible, but some breaking changes may be present in minor releases, along with a greater risk of regressions. Some fixes included in minor releases may also change a class' expected behavior as required to fix some bugs. This is especially the case in classes marked as *experimental* in the documentation.
de: Bei *Minor*-Releases sollten Sie von Fall zu Fall entscheiden, ob ein Upgrade sinnvoll ist. Wir haben uns sehr bemüht, den Upgrade-Prozess so reibungslos wie möglich zu gestalten, aber es kann sein, dass in Minor-Releases einige Breaking Changes enthalten sind, die das Risiko von Regressionensfehlern erhöhen. Einige Korrekturen, die in den Minor-Releases enthalten sind, können auch das erwartete Verhalten einer Klasse ändern, was manchmal unausweichlich ist, um bestimmte Fehler zu beheben. Dies ist insbesondere bei Klassen der Fall, die in der Dokumentation als *experimentell* gekennzeichnet sind.
es: Para versiones *menores* deberías determinar caso por caso si es una buena idea actualizar. Hemos hecho el mayor esfuerzo para lograr que el proceso de actualización sea lo más simple posible, pero algunos cambios incompatibles pueden estar presentes en versiones menores, jusnto con un mayor riesgo de regresiones. Algunos arreglos incluídos en versiones menores también pueden cambiar el comportamiento esperado de alguna clase ya que puede requerirse para resolver bugs. Esto es especialmente el caso de clases marcadas como *experimental* en la documentación.
zh_cn: 对于\ *次要*\ 版本，你应该根据具体情况具体分析的原则，来确定升级是否是个好主意。 我们已经付出了很大的努力来使升级过程尽可能无缝，但次要版本中可能会出现一些重大更改，并且回归的风险也更大。次要版本中包含的某些修复，也可能会根据修复某些错误的需要而更改类的预期行为。 在文档中标记为\ *实验性*\ 的类中尤其如此。
zh_tw: 對於 *次要* 版本，你應該根據具體情況具體分析的原則，來確定升級是否是個好主意。 我們已經付出了很大的努力來使升級過程盡可能無縫，但次要版本中可能會出現一些重大更改，並且回歸的風險也更大。次要版本中包含的某些修復，也可能會根據修復某些錯誤的需要而更改類的預期行為。 在文件中標記為 *實驗性* 的類中尤其如此。

source: *Major* releases bring a lot of new functionality, but they also remove previously existing functionality and may raise hardware requirements. They also require much more work to upgrade to compared to minor releases. As a result, we recommend sticking with the major release you've started your project with if you are happy with how your project currently works. For example, if your project was started with 3.5, we recommend upgrading to 3.5.2 and possibly 3.6 in the future, but not to 4.0+, unless your project really needs the new features that come with 4.0+.
de: *Major*-Releases bringen viele neue Funktionen mit sich, aber sie entfernen auch bereits vorhandene Funktionen und können die Hardwareanforderungen erhöhen. Außerdem ist der Aufwand für ein Upgrade im Vergleich zu Minor-Releases deutlich höher. Daher empfehlen wir Ihnen, bei dem Major-Release zu bleiben, mit der Sie Ihr Projekt begonnen haben, wenn Sie mit der derzeitigen Funktionsweise Ihres Projekts zufrieden sind. Wenn Ihr Projekt beispielsweise mit 3.5 begonnen wurde, empfehlen wir ein Upgrade auf 3.5.2 und möglicherweise 3.6 in der Zukunft, aber nicht auf 4.0+, es sei denn, Ihr Projekt benötigt wirklich die neuen Features von 4.0+.
es: Versiones *mayores* agregan muchas nuevas funcionalidades, pero también remueven funcionalidad existente y pueden incrementar los requerimientos de hardware. Estas también requieren más trabajo para actualizar en comparación con las versiones menores. Como resultado, recomendamos quedarse con la versión mayor con la que has iniciado el proyecto si estás satisfecho en como tu proyecto funciona actualmente. Por ejemplo, si tu proyecto comenzó con 3.5, recomendamos actualizar a 3.5.2 y posiblemente 3.6 en el futuro, pero no a 4.0+ a menos qu tu proyecto necesite las características nuevas que vienen con 4.0+.
zh_cn: *主要*\ 版本带来了许多新功能，但它们也会移除以前有的功能，并有可能提高硬件要求。与次要版本相比，它们还需要更多的工作来升级。 因此，如果你对项目当前的运行方式感到满意，我们建议你坚持使用你启动项目时使用的主要版本。 例如，如果你的项目是从 3.5 开始的，那么我们建议升级到 3.5.2，将来也许升级到 3.6，但不要升级到 4.0+，除非你的项目确实需要 4.0+ 带来的新功能。
zh_tw: *主要* 版本帶來了許多新功能，但它們也會移除以前有的功能，並有可能提高硬體要求。與次要版本相比，它們還需要更多的工作來升級。 因此，如果你對專案目前的運作方式感到滿意，我們建議你堅持使用你啟動專案時使用的主要版本。 例如，如果你的專案是從 3.5 開始的，那麼我們建議升級到 3.5.2，將來也許升級到 3.6，但不要升級到 4.0+，除非你的專案確實需要 4.0+ 帶來的新功能。

source: When is the next release out?
de: Wann erscheint das nächste Godot-Release?
es: ¿Cuándo sale el próximo lanzamiento?
zh_cn: 下一个版本什么时候发布？
zh_tw: 下個版本什麼時候出？

source: While Godot contributors aren't working under any deadlines, we strive to publish minor releases relatively frequently.
de: Godot-Mitarbeiter arbeiten zwar nicht unter Termindruck, aber wir bemühen uns, relativ häufig kleinere Versionen zu veröffentlichen.
es: Mientras que los contribuyentes de Godot no trabajan bajo ninguna fecha limite, nos esforzamos por publicar lanzamientos menores con relativa frecuencia.
zh_cn: 虽然 Godot 贡献者的工作没有设置截止日期，次要版本我们会尽量相对高频率地发布。
zh_tw: 雖然對於 Godot 的貢獻者來說並不需要趕專案截止期限，但通常 Godot 每年都會出新的主要或次要版本。按照這個趨勢來看，Godot 4.0 很可能會在 **2021** 年出。

source: In particular, after the very length release cycle for 4.0, we are pivoting to a faster paced development workflow, with the 4.1 release expected within late Q2 / early Q3 2023.
de: Nach dem sehr langen Release-Zyklus für 4.0 stellen wir auf einen schnelleren Entwicklungs-Workflow um, wobei die Veröffentlichung von 4.1 für Ende Q2/Anfang Q3 2023 erwartet wird.
es: En particular, después del largo ciclo de lanzamiento para 4.0, estamos cambiando a un flujo de desarrollo más rápido, con 4.1 esperado al final de Q2/inicios de Q3 2023.
zh_cn: 尤其是在 4.0 经历了漫长的发布周期之后，我们正在转向更快节奏的开发工作流程，预计 4.1 版本将在 2023 年第二季度末 / 第三季度初发布。
zh_tw: 尤其是在 4.0 經歷了漫長的發行週期之後，我們正在轉向更快節奏的開發工作流程，預計 4.1 版本將在 2023 年第二季度末 / 第三季度初發行。

source: Frequent minor releases will enable us to ship new features faster (possibly as experimental), get user feedback quickly, and iterate to improve those features and their usability. Likewise, the general user experience will be improved more steadily with a faster path to the end users.
de: Durch häufige Minor-Releases können wir neue Features schneller bereitstellen (möglicherweise als experimentelle Versionen), schnelles Benutzerfeedback erhalten und diese Features und ihre Benutzerfreundlichkeit durch ständige Iterationen verbessern. Auch die allgemeine Benutzerfreundlichkeit wird durch eine schnelleren Auslieferung zu den Endbenutzern stetig verbessert.
es: Versiones menores frecuentes nos habilitan a lanzar nuevas características rápidamente (posiblemente como experimental), obtener retroalimantación de usuarios rápido e iterar para mejorar esas características y su usabilidad. Asimismo, la experiencia de usuario general mejorará sólidamente con un camino más rápido a los usuarios finales.
zh_cn: 频繁发布的次要版本可以让我们能够更快地发布新功能（有可能是实验性的），快速获得用户反馈，并迭代以改进这些功能及其可用性。 同样地，更快到达最终用户，一般用户的体验就能够得到更稳定的改善。
zh_tw: 頻繁發行的次要版本可以讓我們能夠更快地發行新功能（有可能是實驗性的），快速獲得使用者回饋，並反覆運算以改進這些功能及其可用性。 同樣地，更快到達最終使用者，一般使用者的體驗就能夠得到更穩定的改善。

source: Maintenance (patch) releases are released as needed with potentially very short development cycles, to provide users of the current stable branch with the latest bug fixes for their production needs.
de: Wartungs (Patch)-Releases werden je nach Bedarf mit potentiell sehr kurzen Entwicklungszyklen veröffentlicht, um die Benutzer des aktuellen stabilen Branches mit den neuesten Fehlerkorrekturen für ihre Entwicklungsanforderungen zu versorgen.
es: Las correcciones de errores o parches se publicarán cuando sea necesario con ciclos de desarrollo potencialmente muy cortos, para proveer a los usuarios de la rama estable actual de las ultimas correcciones de bugs para sus necesidades de producción.
zh_cn: 维护（补丁）版本是按需发布的，开发周期可能很短，作用是为当前稳定分支的用户提供最新的错误修复，以满足他们的生产需求。
zh_tw: 維護（更新）版本是按需發行的，開發週期可能很短，作用是為目前穩定分支的使用者提供最新的錯誤修復，以滿足他們的生產需求。

source: The 3.6 release is still planned and should be the last stable branch of Godot 3.x. It will be a Long-Term Support (LTS) release, which we plan to support for as long as users still need it (due to missing features in Godot 4.x, or having published games which they need to keep updating for platform requirements).
de: Das 3.6-Release ist nach wie vor geplant und sollte der letzte stabile Branch von Godot 3.x sein. Es handelt sich dabei um eine LTS-Version (Long-Term Support), die wir so lange unterstützen wollen, wie die Benutzer sie noch benötigen (aufgrund fehlender Features in Godot 4.x oder weil sie Spiele veröffentlicht haben, die sie weiterhin für die Plattformanforderungen aktualisieren müssen).
es: La versión 3.6 todavía está planeada y será la última versión estable de Godot 3.x. Esta será una versión de Soporte de Largo Plazo (LTS), la cual planeamos soportar mientras los usuarios la necesiten (ya sea por características no disponibles en Godot 4.x o por tener juegos publicados que necesiten ser actualizados por requerimientos de plataforma).
zh_cn: 3.6 版本仍在计划中，它应该是 Godot 3.x 的最后一个稳定分支。 这将是一个长期支持 (LTS) 版本，只要用户仍然需要它，我们就计划对其提供支持（由于 Godot 4.x 中缺少功能，或者已发行的游戏需要持续更新以满足平台需求）。
zh_tw: 3.6 版本仍在計畫中，它應該是 Godot 3.x 的最後一個穩定分支。 這將是一個長期支援 (LTS) 版本，只要使用者仍然需要它，我們就計畫對其提供支援（由於 Godot 4.x 中缺少功能，或者已發行的遊戲需要持續更新以滿足平臺需求）。

source: What are the criteria for compatibility across engine versions?
de: Was sind die Kriterien für die Kompatibilität der verschiedenen Engine-Versionen?
es: ¿Cuáles son los criterios de compatibilidad entre versiones del motor?
zh_cn: 引擎版本之间的兼容标准是怎样的？
zh_tw: 引擎版本之間的相容標準是怎樣的？

source: This section is intended to be used by contributors to determine which changes are safe for a given release. The list is not exhaustive; it only outlines the most common situations encountered during Godot's development.
de: Dieser Abschnitt soll den Mitwirkenden helfen, festzustellen, welche Änderungen für eine bestimmte Version sicher sind. Die Liste erhebt keinen Anspruch auf Vollständigkeit; sie umreißt lediglich die häufigsten Situationen, die während der Entwicklung von Godot auftreten.
es: Esta sección está destinada para ser usada por contribuyentes para determinar qué cambios son seguros para cierta versión. La lista n es exhaustiva; sólo delinea las situaciones más comunes encontradas durante el desarrollo de Godot.
zh_cn: 本节旨在供贡献者使用以确定哪些更改对于给定版本是安全的。 该列表并不详尽； 它只是概述了 Godot 开发过程中遇到的最常见的情况。
zh_tw: 本節旨在供貢獻者使用以確定哪些更改對於給定版本是安全的。 該列表並不詳盡； 它只是概述了 Godot 開發過程中遇到的最常見的情況。

source: The following changes are acceptable in patch releases:
de: Die folgenden Änderungen sind in Patch-Releases zulässig:
es: Los siguientes cambios son aceptables para una versión parche:
zh_cn: 补丁版本中可以接收以下更改：
zh_tw: 在 Godot 儲存庫中目前有設定下列 Label：

source: Fixing a bug in a way that has no major negative impact on most projects, such as a visual or physics bug. Godot's physics engine is not deterministic, so physics bug fixes are not considered to break compatibility. If fixing a bug has a negative impact that could impact a lot of projects, it should be made optional (e.g. using a project setting or separate method).
de: Behebung eines Fehlers, der keine größeren negativen Auswirkungen auf die meisten Projekte hat, z.B. ein optischer oder Physik-Fehler. Die Godot-Physik-Engine ist nicht deterministisch, so dass die Behebung von Physik-Fehlern nicht als Kompatibilitätsbruch angesehen wird. Wenn die Behebung eines Fehlers eine negative Auswirkung hat, die sich auf viele Projekte auswirken könnte, sollte sie optional gemacht werden (z.B. durch eine Projekteinstellung oder eine separate Methode).
es: Arreglando un bug de manera que no tenga impacto negativo mayor en la mayoría de los proyectos, como un bug visual o de física. El motor de física de Godot no es determinista, por lo que bugs de física pueden no ser considerados como problemas de compatibilidad. Si arreglar un bug tiene un impacto negativo que pueda afectar muchos proyectos, debería ser hecho como opcional (por ej. utilizando ajustes de proyecto o un método aparte).
zh_cn: 修复一个不会对大多数项目产生重大负面影响的 bug，比如视觉或物理 bug。Godot 的物理引擎不是确定性的，所以修复物理 bug 不会被认为会破坏兼容性。如果修复一个 bug 会产生可能影响很多项目的负面影响，应该将其设置为可选项（例如使用项目设置或单独的方法）。
zh_tw: 修復一個不會對大多數專案產生重大負面影響的 bug，比如視覺或物理 bug。Godot 的物理引擎不是確定性的，所以修復物理 bug 不會被認為會破壞相容性。如果修復一個 bug 會產生可能影響很多專案的負面影響，應該將其設定為可選項（例如使用專案設定或單獨的方法）。

source: Adding a new optional parameter to a method.
de: Hinzufügen eines neuen optionalen Parameters zu einer Methode.
es: Agregar un nuevo parámetro opcional a un método.
zh_cn: 为一个方法新增一个可选参数。
zh_tw: 為一個方法新增一個可選參數。

source: Small-scale editor usability tweaks.
de: Kleinere Verbesserungen an der Benutzerfreundlichkeit des Editors.
es: Pequeños ajustes de usabilidad del editor.
zh_cn: 小规模的编辑器可用性调整。
zh_tw: 小規模的編輯器可用性調整。

source: Note that we tend to be more conservative with the fixes we allow in each subsequent patch release. For instance, 4.0.1 may receive more impactful fixes than 4.0.4 would.
de: Beachten Sie, dass wir beim Akzeptieren von Korrekturen immer konservativer vorgehen, je weiter die Patch-Releases fortgeschritten sind. Zum Beispiel darf 4.0.1 umfassendere Korrekturen erhalten als 4.0.4.
es: Ten en cuenta que tendemos a ser conservativos con las correcciones que permitimos en versiones parche. Por ejemplo, 4.0.1 podrá recibir correcciones más importantes que 4.0.4.
zh_cn: 需要注意的是，我们在每个后续的补丁发布中通常更加保守地处理允许的修复。 例如，4.0.1 可能会比 4.0.4 收到更具影响的修复。
zh_tw: 需要注意的是，我們在每個後續的更新發行中通常更加保守地處理允許的修復。 例如，4.0.1 可能會比 4.0.4 收到更具影響的修復。

source: The following changes are acceptable in minor releases, but not patch releases:
de: Die folgenden Änderungen sind in Minor-Releases akzeptabel, aber nicht in Patch-Releases:
es: Los siguientes cambios son aceptables en versiones menores, pero no en versiones parche:
zh_cn: 以下更改在次要版本中是可接受的，但在补丁版本中则是不可接受的：
zh_tw: 以下更改在次要版本中是可接受的，但在更新版本中則是不可接受的：

source: Significant new features.
de: Bedeutende neue Features.
es: Características nuevas destacadas.
zh_cn: 重大新特性。
zh_tw: 重要新功能。

source: Renaming a method parameter. In C#, method parameters can be passed by name (but not in GDScript). As a result, this can break some projects that use C#.
de: Umbenennen eines Methodenparameters. In C# können Methodenparameter mit Namen übergeben werden (nicht aber in GDScript). Dies kann dazu führen, dass einige Projekte, die C# verwenden, nicht mehr funktionieren.
es: Renombrando el parámetro de métodos. En C#, los parámetros pueden pasarse por nombre (no así en GDScript). Como resultado esto puede romper proyectos que usen C#.
zh_cn: 重命名方法参数。在 C# 中，方法参数可以通过名称传递（但在 GDScript 中不行）。因此这可能会破坏一些使用 C# 的项目。
zh_tw: 重命名方法參數。在 C# 中，方法參數可以通過名稱傳遞（但在 GDScript 中不行）。因此這可能會破壞一些使用 C# 的專案。

source: Deprecating a method, member variable, or class. This is done by adding a deprecated flag to its class reference, which will show up in the editor. When a method is marked as deprecated, it's slated to be removed in the next *major* release.
de: Eine Methode, Membervariable oder Klasse bekommt den Status deprecated (veraltet). Dies geschieht durch das Hinzufügen eines deprecated-Flags zu ihrer Klassenreferenz, die dann im Editor angezeigt wird. Wenn eine Methode als deprecated markiert ist, soll sie in der nächsten *Major*-Version entfernt werden.
es: Deprecando un método, una variable miembro, o una clase. Esto se realiza añadiendo una bandera de deprecado a su referencia de clase que aparecerá en el editor. Cuando un método es marcado como deprecado, está planeada su eliminación en la siguiente versión *mayor*.
zh_cn: 弃用方法、成员变量或类。 这是通过向其类引用添加一个已弃用标志来完成的，该标志将显示在编辑器中。 当一个方法被标记为已弃用时，它将在下一个*主要（major）*版本中删除。
zh_tw: 放棄使用方法、成員變數或類。 這是通過向其類引用新增一個已放棄使用旗標來完成的，該旗標將顯示在編輯器中。 當一個方法被標記為已放棄使用時，它將在下一個*主要（major）*版本中刪除。

source: Changes that affect the default project theme's visuals.
de: Änderungen, die sich auf die visuelle Gestaltung des Default-Projekt-Themes auswirken.
es: Cambios que afectan el tema visual por defecto de los proyectos.
zh_cn: 影响默认项目主题视觉效果的更改。
zh_tw: 影響預設專案主題視覺效果的更改。

source: Bug fixes which significantly change the behavior or the output, with the aim to meet user expectations better. In comparison, in patch releases, we may favor keeping a buggy behavior so we don't break existing projects which likely already rely on the bug or use a workaround.
de: Fehlerkorrekturen, die das Verhalten oder die Ausgabe erheblich verändern, mit dem Ziel, die Erwartungen der Benutzer besser zu erfüllen. Im Vergleich dazu können wir uns bei Patch-Releases dazu entscheiden, ein fehlerhaftes Verhalten beizubehalten, um bestehende Projekte nicht zu kritisch zu beeinflussen, die möglicherweisebereits das Fehlerverhalten bewusst verwenden oder einen Workaround implementiert haben.
es: Arreglos de bugs que puedan cambiar el comportamiento o la salida significativamente, con el objetivo de satisfacer mejor las espectativas de los usuarios. En comparación, en versiones parche favorecemos mantener un comportamiento defectuoso así no rompemos proyectos existentes que puedan estar dependiendo de ese problema o usando una solución alternativa.
zh_cn: 某些引起了行为或输出的明显改变的错误修复，旨在更好地满足用户的期望。相比之下，在补丁版本中，我们可能倾向于保留一些错误行为，这样我们就不会破坏可能已经依赖该错误或使用了解决方法的现有项目。
zh_tw: 某些引起了行為或輸出的明顯改變的錯誤修復，旨在更好地滿足使用者的期望。相比之下，在更新版本中，我們可能傾向於保留一些錯誤行為，這樣我們就不會破壞可能已經依賴該錯誤或使用了解決方法的現有專案。

source: Performance optimizations that result in visual changes.
de: Leistungsoptimierungen, die zu optischen Veränderungen führen.
es: Optimizaciones de rendimiento que resulten en cambios visuales.
zh_cn: 导致了视觉变化的性能优化。
zh_tw: 導致了視覺變化的性能優化。

source: The following changes are considered **compatibility-breaking** and can only be performed in a new major release:
de: Die folgenden Änderungen gelten als **Kompatibilitätsbruch** und können nur in einer neuen Major-Version durchgeführt werden:
es: Los siguientes cambios son considerados de **incompatibilidad** y pueden ser realizados solamente en versiones mayores:
zh_cn: 以下更改被视为**破坏兼容性**，并且只能在新的主要（major）版本中执行：
zh_tw: 以下更改被視為**破壞相容性**，並且只能在新的主要（major）版本中執行：

source: Renaming or removing a method, member variable, or class.
de: Umbenennen oder Entfernen einer Methode, Membervariable oder Klasse.
es: Renombrar o eliminar un método, una variable de miembro o una clase.
zh_cn: 重命名或删除方法、成员变量或类。
zh_tw: 重命名或刪除方法、成員變數或類。

source: Modifying a node's inheritance tree by making it inherit from a different class.
de: Änderung des Vererbungsbaums eines Nodes, indem er danach von einer anderen Klasse erbt.
es: Modificar la el árbol de herencia de un nodo haciéndolo heredar de una clase diferente.
zh_cn: 通过让节点继承不同的类来修改节点的继承树。
zh_tw: 通過讓節點繼承不同的類來修改節點的繼承樹。

source: Changing the default value of a project setting value in a way that affects existing projects. To only affect new projects, the project manager should write a modified ``project.godot`` instead.
de: Ändern des Defaultwerts einer Projekteinstellung in einer Weise, die sich auf bestehende Projekte auswirkt. Um nur neue Projekte zu beeinflussen, sollte der Projektmanager stattdessen eine geänderte ``project.godot`` schreiben.
es: Cambiar el valor por defecto de un valor de ajustes de proyecto de un modo que afecte proyectos existentes. Para afectar nuevos proyectos, el administrador de proyectos debería escribir en un ``project.godot`` modificado.
zh_cn: 改变项目设置的默认值会影响已存在的项目。如果想只影响到新项目，项目管理者应当用编写一份修改的 ``project.godot`` 来代替。
zh_tw: 改變專案設定的預設值會影響已存在的專案。如果想只影響到新專案，專案管理者應當用編寫一份修改的 ``project.godot`` 來代替。

source: Since Godot 5.0 hasn't been branched off yet, we currently discourage making compatibility-breaking changes of this kind.
de: Da Godot 5.0 noch nicht abgebrancht wurde, raten wir derzeit davon ab, solche Änderungen vorzunehmen, die Kompatibilitätsbrüche hervorrufen.
es: Como todavía no se ha creado la rama Godot 5.0, actualmente no recomendamos hacer cambios de incompatibilidad de este tipo.
zh_cn: 由于 Godot 5.0 分支目前还没有建立，我们不建议这种破坏兼容性的更改。
zh_tw: 由於 Godot 5.0 分支目前還沒有建立，我們不建議這種破壞相容性的更改。
