Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/release_policy.po
Languages: de, es, zh_cn, zh_tw

source: When modifying a method's signature in any fashion (including adding an optional parameter), a GDExtension compatibility method must be created. This ensures that existing GDExtensions continue to work across patch and minor releases, so that users don't have to recompile them. See `pull request #76446 <https://github.com/godotengine/godot/pull/76446>`_ for more information.
de: Wenn die Signatur einer Methode in irgendeiner Weise geändert wird (einschließlich des Hinzufügens eines optionalen Parameters), muss eine GDExtension-Kompatibilitätsmethode erstellt werden. Dies stellt sicher, dass bestehende GDExtensions über Patch- und Minor-Releases hinweg weiter funktionieren, so dass die Benutzer sie nicht neu kompilieren müssen. Siehe `pull request #76446 <https://github.com/godotengine/godot/pull/76446>`_ für weitere Informationen.
es: Cuando se modifica la firma de un método de cualquier modo (incluyendo parámetros opcionales), debe crearse un método de compatibilidad GDExtension. Esto asegura que las GDExtensions existentes continuen funcionando entre versiones parche y menores, así los usuarios no deben recompilarlas. Ver `pull request #76446 <https://github.com/godotengine/godot/pull/76446>`_ para más información.
zh_cn: 当以任何方式修改一个方法的签名（包括添加可选参数）时，必须创建一个 GDExtension 兼容方法。这将确保现有的 GDExtensions 能够在补丁版本和次要版本中继续工作，如此用户就不必重新编译它们。更多信息请参见`拉取清求 #76446 <https://github.com/godotengine/godot/pull/76446>`_ 。
zh_tw: 當以任何方式修改一個方法的簽章（包括新增可選參數）時，必須建立一個 GDExtension 相容方法。這將確保現有的 GDExtensions 能夠在更新版本和次要版本中繼續工作，如此使用者就不必重新編譯它們。更多資訊請參見`拉取清求 #76446 <https://github.com/godotengine/godot/pull/76446>`_ 。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: partial
es: parcial
