Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/about/release_policy.po
Languages: de, es, zh_cn, zh_tw

source: Godot release policy
de: Godots Release-Regeln
es: Política de lanzamiento de Godot
zh_cn: Godot 发布策略
zh_tw: Godot 版本釋出政策

source: Godot's release policy is in constant evolution. The description below provides a general idea of what to expect, but what will actually happen depends on the choices of core contributors and the needs of the community at a given time.
de: Die Release-Regeln von Godot befinden sich in ständiger Entwicklung. Die nachstehende Beschreibung vermittelt eine allgemeine Vorstellung davon, was zu erwarten ist, aber was tatsächlich geschieht, hängt von den Entscheidungen der wichtigsten Mitwirkenden und den Bedürfnissen der Community zu einem bestimmten Zeitpunkt ab.
es: La politica de lanzamiento de Godot está en constante evolución. La descripción siguiente da una idea general de qué es lo que se espera, pero lo que actualmente suceda dependerá de las decisiones de contribuyentes principales y de las necesidades de la comunidad en un determinado momento.
zh_cn: Godot 的发布政策是在不断改进的。以下内容提供了大致的预期结果，但实际会发生什么取决于核心贡献者的选择，以及社区在特定时期的需求。
zh_tw: Godot 的發行政策是在不斷改進的。以下內容提供了大致的預期結果，但實際會發生什麼取決於核心貢獻者的選擇，以及社區在特定時期的需求。

source: Godot versioning
de: Godots Versionierung
es: Versionado de Godot
zh_cn: Godot 版本
zh_tw: Godot 版本

source: Godot loosely follows `Semantic Versioning <https://semver.org/>`__ with a ``major.minor.patch`` versioning system, albeit with an interpretation of each term adapted to the complexity of a game engine:
de: Godot lehnt sich mit einem ``major.minor.patch``-Versionsschema lose an die `Semantische Versionierung <https://semver.org/>`__ an, wenn auch mit einer an die Komplexität einer Spiele-Engine angepassten Interpretation der einzelnen Begriffe:
es: Godot sigue vagamente `Semantic Versioning <https://semver.org/>` __ con un sistema de versionado `` major.minor.patch`` , aunque con una interpretación de cada término adaptada a la complejidad de un motor de juego:
zh_cn: Godot 松散地遵循了\ `语义化版本 <https://semver.org/>`__\ ，采用了 ``major.minor.patch`` 的版本系统，不过对每个术语的解释都根据游戏引擎的复杂性进行了调整：
zh_tw: Godot 鬆散地遵循了 `語義化版本 <https://semver.org/>`__ ，採用了 ``major.minor.patch`` 的版本系統，不過對每個術語的解釋都根據遊戲引擎的複雜性進行了調整：

source: The ``major`` version is incremented when major compatibility breakages happen which imply significant porting work to move projects from one major version to another.
de: Die ``major``-Version wird erhöht, wenn größere Kompatibilitätsbrüche auftreten, die erhebliche Portierungsarbeiten erfordern, um Projekte von einer Major-Version in eine andere zu migrieren.
es: La versión ``major`` es incrementada cuando ocurren rupturas de compatibilidad lo que implica un trabajo significante de porteo para mover proyectos de una mayor versión a otra.
zh_cn: ``major``\ （主要）版本在发生重大不兼容时会增加，这意味着项目需要大量的移植工作才能从一个主要版本迁移另一个主要版本。
zh_tw: ``major`` （主要）版本在發生重大不相容時會增加，這意味著專案需要大量的移植工作才能從一個主要版本遷移另一個主要版本。

source: For example, porting Godot projects from Godot 3.x to Godot 4.x requires running the project through a conversion tool, and then performing a number of further adjustments manually for what the tool could not do automatically.
de: Die Portierung von Godot-Projekten von Godot 3.x auf Godot 4.x erfordert beispielsweise, dass das Projekt durch ein Konvertierungstool läuft und dann eine Reihe weiterer Anpassungen manuell vorgenommen werden, die das Tool nicht automatisch vornehmen konnte.
es: Por ejemplo, la migración de proyectos de Godot 3.x a Godot 4.x requiere pasar el proyecto a través de una herramienta de conversión, y luego realizar una serie de ajustes manualmente en lo que la herramienta no pudo hacer automaticamente.
zh_cn: 例如，将 Godot 项目从 Godot 3.x 移植到 Godot 4.x 时，需要通过转换工具运行项目，然后对工具无法自动完成的工作进行进一步的手动调整。
zh_tw: 例如，將 Godot 專案從 Godot 3.x 移植到 Godot 4.x 時，需要通過轉換工具運作專案，然後對工具無法自動完成的工作進行進一步的手動調整。

source: The ``minor`` version is incremented for feature releases that do not break compatibility in a major way. Minor compatibility breakage in very specific areas *may* happen in minor versions, but the vast majority of projects should not be affected or require significant porting work.
de: Die ``minor``-Version wird für Releases mit neuen Features erhöht, wenn die Kompatibilität nicht wesentlich beeinträchtigt wird. Geringfügige Kompatibilitätsbrüche in sehr spezifischen Bereichen *können* in Minor-Versionen vorkommen, aber die große Mehrheit der Projekte sollte davon nicht betroffen sein oder signifikante Portierungsarbeiten erfordern.
es: La versión ``menor`` se incrementa para las versiones de funcionalidad que no rompen la compatibilidad de manera importante. *Pueden* producirse fallas menores en la compatibilidad en áreas muy específicas en versiones menores, pero la gran mayoría de los proyectos no deberían verse afectados o requerir un trabajo de migración significativo.
zh_cn: ``minor``\ （次要）版本在不严重破坏兼容性的功能发布时增加。在非常特定的领域中，小版本\ *可能*\ 会出现轻微的兼容性问题，但绝大部分项目并不会受到影响或需要做大量的移植工作。
zh_tw: ``minor`` （次要）版本在不嚴重破壞相容性的功能發行時增加。在非常特定的領域中，小版本 *可能* 會出現輕微的相容性問題，但絕大部分專案並不會受到影響或需要做大量的移植工作。

source: This is because Godot, as a game engine, covers many areas like rendering, physics, and scripting. Fixing bugs or implementing new features in one area might sometimes require changing a feature's behavior or modifying a class's interface, even if the rest of the engine API remains backwards compatible.
de: Das liegt daran, dass Godot als Spiele-Engine viele Bereiche wie Rendering, Physik und Skripting abdeckt. Die Behebung von Fehlern oder die Implementierung neuer Features in einem Bereich kann es manchmal erforderlich machen, das Verhalten eines Features zu ändern oder die Schnittstelle einer Klasse zu modifizieren, so dass dann aber der Rest der Engine-API abwärtskompatibel bleibt.
es: Esto es porque Godot, como motor de videojuegos, cubre muchas áreas tales como renderizado, física, scripting, etc. Arreglar bugs o implementar nuevas características a un área puede en algunas ocasiones requerir cambiar el comportamiento de alguna característica o modificar la interfaz de una clase determinada, incluso si el resto del API del motor se mantiene compatible con sus versiones anteriores.
zh_cn: 这是因为 Godot 作为一个游戏引擎， 涵盖了渲染、物理、脚本等许多领域。修复某个领域的 Bug 或实现新功能，有时可能需要改变某个功能的行为，或者修改某个类的接口，即便是引擎 API 的其他部分仍然向后兼容。
zh_tw: 這是因為 Godot 作為一個遊戲引擎， 涵蓋了算繪、物理、腳本等許多領域。修復某個領域的 Bug 或實作新功能，有時可能需要改變某個功能的行為，或者修改某個類的介面，即便是引擎 API 的其他部分仍然向後相容。

source: Upgrading to a new minor version is recommended for all users, but some testing is necessary to ensure that your project still behaves as expected.
de: Die Aktualisierung auf eine neue Minor-Version wird allen Benutzern empfohlen, aber es sind einige Tests erforderlich, um sicherzustellen, dass sich Ihr Projekt weiterhin wie erwartet verhält.
es: Por lo tanto, se recomienda a todos los usuarios actualizar a una nueva versión menor, pero es necesario realizar algunas pruebas para asegurarse de que tu proyecto aún se comporta como se espera.
zh_cn: 建议所有用户升级到新的次要版本，但有必要进行一些测试，以确保你的项目仍能按照预期的方式运行。
zh_tw: 建議所有使用者升級到新的次要版本，但有必要進行一些測試，以確保你的專案仍能按照預期的方式運作。

source: The ``patch`` version is incremented for maintenance releases which focus on fixing bugs and security issues, implementing new requirements for platform support, and backporting safe usability enhancements. Patch releases are backwards compatible.
de: Die ``patch``-Version wird für Wartungsversionen erhöht, die sich auf die Behebung von Fehlern und Sicherheitsproblemen, die Implementierung neuer Anforderungen für die Plattformunterstützung und die Rückportierung von sicheren Verbesserungen der Benutzerfreundlichkeit konzentrieren. Patch-Versionen sind abwärtskompatibel.
es: La versión ``parche`` se incrementa para las versiones de mantenimiento que se centran en la corrección de errores y problemas de seguridad, la implementación de nuevos requerimientos para el soporte de la plataforma, y el backport de mejoras de usabilidad seguras. Estas son compatibles con versiones anteriores.
zh_cn: ``patch``\ （补丁）版本是为维护版本而增加的，其重点是修复错误和安全问题，实现平台支持的新要求，以及可用性安全性增强。补丁版本是向后兼容的。
zh_tw: ``patch`` （更新）版本是為維護版本而增加的，其重點是修復錯誤和安全問題，實作平臺支援的新要求，以及可用性安全性增強。更新版本是向後相容的。

source: Patch versions may include minor new features which do not impact the existing API, and thus have no risk of impacting existing projects.
de: Patch-Versionen können kleinere neue Features enthalten, die sich nicht auf die bestehende API auswirken und somit keine Auswirkungen auf bestehende Projekte haben.
es: Las versiones Parche deberán incluir nuevas características menores que no impactaran en la API existente, y por lo tanto no corren riesgo de impactar en los proyectos existentes.
zh_cn: 补丁版本可能包含一些不影响现有 API 的小的新功能，因此没有影响现有项目的风险。
zh_tw: 更新版本可能包含一些不影響現有 API 的小的新功能，因此沒有影響現有專案的風險。

source: Updating to new patch versions is therefore considered safe and strongly recommended to all users of a given stable branch.
de: Die Aktualisierung auf neue Patch-Versionen gilt daher als sicher und wird allen Benutzern eines bestimmten stabilen Branchs dringend empfohlen.
es: La actualización a nuevas versiones de parche es por lo tanto considerada segura y fuertemente recomendada a todos los usuarios de una rama estable dada.
zh_cn: 因此，更新到新的补丁版本被认为是安全的，并强烈推荐给特定稳定分支的所有用户。
zh_tw: 因此，更新到新的更新版本被認為是安全的，並強烈推薦給特定穩定分支的所有使用者。

source: We call ``major.minor`` combinations *stable branches*. Each stable branch starts with a ``major.minor`` release (without the ``0`` for ``patch``) and is further developed for maintenance releases in a Git branch of the same name (for example patch updates for the 4.0 stable branch are developed in the ``4.0`` Git branch).
de: Wir bezeichnen die Kombination ``major.minor`` als *stabile Branches*. Jeder stabile Branch beginnt mit einem ``major.minor``-Release (ohne die ``0`` für ``patch``) und wird für Wartungsversionen in einem Git-Branch gleichen Namens weiterentwickelt (zum Beispiel werden Patch-Updates für den stabilen Branch 4.0 im Git-Branch ``4.0`` entwickelt).
es: Las combinaciones ``mayor.menor`` se denominan *ramas estables*. Cada rama estable comienza con una versión ``mayor.menor`` (sin el ``0`` para ``parche``) y se desarrolla para las versiones de mantenimiento en una rama Git del mismo nombre (por ejemplo, las actualizaciones de parches para la rama estable 4.0 se desarrollan en la rama Git ``4.0``).
zh_cn: 我们将 ``major.minor`` 组合称为\ *稳定分支*\ 。每个稳定分支都从 ``major.minor`` 版本开始（不写为 ``0`` 的 ``patch``\ ），后续维护版本的开发都位于同名的 Git 分支上（例如 4.0 稳定分支补丁更新的开发位于 ``4.0`` Git 分支）。
zh_tw: 我們將 ``major.minor`` 組合稱為 *穩定分支* 。每個穩定分支都從 ``major.minor`` 版本開始（不寫為 ``0`` 的 ``patch`` ），後續維護版本的開發都位於同名的 Git 分支上（例如 4.0 穩定分支更新更新的開發位於 ``4.0`` Git 分支）。

source: Release support timeline
de: Zeitplan für den Support von Releases
es: Línea de tiempo del soporte de liberación
zh_cn: 发布支持时间表
zh_tw: 釋出支援時程

source: Stable branches are supported *at least* until the next stable branch is released and has received its first patch update. In practice, we support stable branches on a *best effort* basis for as long as they have active users who need maintenance updates.
de: Stabile Branches werden *mindestens* so lange unterstützt, bis der nächste stabile Branch veröffentlicht wird und sein erstes Patch-Update erhalten hat. In der Praxis unterstützen wir stabile Branches auf einer *Best-Effort*-Basis so lange, wie es aktive Benutzer gibt, die Wartungsaktualisierungen benötigen.
es: Las ramas estables son compatibles *como mínimo* hasta que se lance la siguiente rama estable y esta haya recibido su primera actualización de parche. En la práctica, soportamos las ramas estables en base al *mejor esfuerzo* mientras tengan usuarios activos que necesiten actualizaciones de mantenimiento.
zh_cn: 对稳定分支的支持会\ *至少*\ 持续到下一个稳定分支发布并获得第一个补丁更新。在实践中，只要还有活跃用户需要维护更新，我们就会\ *以最大努力*\ 去支持稳定分支。
zh_tw: 對穩定分支的支援會 *至少* 持續到下一個穩定分支發行並獲得第一個更新更新。在實踐中，只要還有活躍使用者需要維護更新，我們就會 *以最大努力* 去支援穩定分支。

source: Whenever a new major version is released, we make the previous stable branch a long-term supported release, and do our best to provide fixes for issues encountered by users of that branch who cannot port complex projects to the new major version. This was the case for the 2.1 branch, and is the case for the 3.6 branch.
de: Immer wenn eine neue Major-Version veröffentlicht wird, machen wir den vorherigen stabilen Branch zu einer langfristig unterstützten Version (Long-Term-Support, LTS) und tun unser Bestes, um Fehler zu beheben, die bei Benutzern dieses Branches aufgetreten sind, die aber komplexe Projekte nicht auf die neue Major-Version portieren können. Dies war der Fall für den 2.1-Branch und ist es auch für den 3.6-Branch.
es: Siempre que se lanza una nueva versión mayor, hacemos de la rama estable anterior una versión con soporte a largo plazo y hacemos todo lo posible para proporcionar soluciones a los problemas que encuentran en esa rama los usuarios que no pueden migrar proyectos complejos a la nueva versión mayor. Este es fue el caso de la rama 2.1, y es el caso de la última rama 3.6.
zh_cn: 每当一个新的主版本发布时，我们都会对上一个稳定分支提供长期的支持，并尽最大努力为那些无法将复杂项目移植到新的主要版本中的旧版用户提供修复帮助。2.1 分支如此，3.6 分支也如此。
zh_tw: 每當一個新的主版本發行時，我們都會對上一個穩定分支提供長期的支援，並盡最大努力為那些無法將複雜專案移植到新的主要版本中的舊版使用者提供修復幫助。2.1 分支如此，3.6 分支也如此。

source: In a given minor release series, only the latest patch release receives support. If you experience an issue using an older patch release, please upgrade to the latest patch release of that series and test again before reporting an issue on GitHub.
de: In einer bestimmten Minor-Release-Reihe wird nur das neueste Patch-Release supportet. Wenn Sie ein Problem mit einem älteren Patch-Release haben, aktualisieren Sie bitte auf das neueste Patch-Release dieser Reihe und testen Sie es erneut, bevor Sie ein Problem auf GitHub melden.
es: En una serie de versiones inferiores determinada, solo se admite la última versión del parche. Si tiene algún problema al utilizar una versión de parche anterior, actualice a la versión de parche más reciente de esa serie y vuelva a realizar la prueba antes de informar un problema en GitHub.
zh_cn: 次版本号相同的一系列版本中，只有最新的补丁版本会得到支持。如果你在使用较旧的补丁版本时遇到问题，请在前往 GitHub 提交问题之前先升级到该系列的最新补丁版本并测试。
zh_tw: 次版本號相同的一系列版本中，只有最新的更新版本會得到支援。如果你在使用較舊的更新版本時遇到問題，請在前往 GitHub 提交問題之前先升級到該系列的最新更新版本並測試。

source: **Version**
es: **Versión**
zh_cn: **版本**
zh_tw: **版本**

source: **Release date**
de: **Release-Datum**
es: **Fecha de publicación*
zh_cn: **发布日期**
zh_tw: **釋出日期**

source: **Support level**
es: **Nivel de soporte**
zh_cn: **支持级别**
zh_tw: **支援等級**

source: |unstable| *Development.* Receives new features, usability and performance improvements, as well as bug fixes, while under development.
de: |unstable| *Development.* Erhält neue Features, Verbesserungen der Benutzerfreundlichkeit und Leistung, sowie Fehlerkorrekturen während der Entwicklung.
es: |inestable| *En desarrollo.* Recibe nuevas características, mejoras de usabilidad y desempeño así como correcciones de errores mientras está en desarrollo.
zh_cn: |unstable| *开发版。*\ 在开发过程中接收新功能、可用性和性能的改进，以及错误修复。
zh_tw: |unstable| *開發。*在開發過程中獲得新功能、可用性和效能改進以及錯誤修復。

source: unstable
es: inestable
zh_tw: 啟用

source: |supported| Receives fixes for bugs and security issues, as well as patches that enable platform support.
de: |supported| Behebung von Fehlern und Sicherheitsproblemen, sowie Patches für die Plattformunterstützung.
es: |soportada| Recibe correcciones para errores, problemas de seguridad y así como parches que habiliten el soporte de plataformas.
zh_cn: |supported| 接收错误和安全问题的修复，以及对平台支持的补丁。
zh_tw: |supported| 接收錯誤和安全性問題的修復，以及啟用平台支援的修補程式。

source: supported
es: Archivos soportados
zh_tw: 支援的圖片格式

source: Godot 4.1
zh_tw: Godot 4.0

source: July 2023
de: Juli 2023
es: Julio de 2023
zh_cn: 2023 年 7 月
zh_tw: 2016 年 7 月

source: March 2023
de: März 2023
es: Marzo de 2023
zh_cn: 2023 年 3 月
zh_tw: 2019 年 3 月

source: Godot 3.6 (`3.x`, LTS)
zh_tw: Godot 3.2

source: |supported| *Beta.* Receives new features, usability and performance improvements, as well as bug fixes, while under development.
de: |supported| *Beta.* Erhält neue Features, Verbesserungen der Benutzerfreundlichkeit und Leistung, sowie Fehlerkorrekturen während der Entwicklung.
es: |soportado| *Beta.* Recibe nuevas características, mejoras de usabilidad y desempeño así como correcciones de errores mientras está en desarrollo.
zh_cn: |supported| *测试版。*\ 在开发过程中接收新功能、可用性和性能的改进，以及错误修复。
zh_tw: |supported| *測試版。* 在開發過程中獲得新功能、可用性和效能改進以及錯誤修復。

source: Godot 3.5
zh_tw: Godot 3.2

source: August 2022
es: Agosto 2022
zh_cn: 2022 年 8 月
zh_tw: 2022 年 8 月

source: Godot 3.4
zh_tw: Godot 3.2

source: November 2021
es: Noviembre de 2021
zh_cn: 2021 年 11 月
zh_tw: 2014 年 12 月

source: Godot 3.3
zh_tw: Godot 3.2

source: April 2021
es: Abril de 2021
zh_cn: 2021 年 4 月
zh_tw: 2019 年 3 月

source: January 2020
de: Januar 2020
es: Enero de 2020
zh_cn: 2020 年 1 月
zh_tw: 2020 年 1 月

source: |eol| No longer supported (last update: 3.2.3).
de: |eol| Nicht mehr unterstützt (letztes Update: 3.2.3).
es: |eol| Esta versión ya no es soportada (última actualización: 3.2.3).
zh_cn: |eol| 不再支持（最后更新：3.2.3）。
zh_tw: |eol| 已停止支援。

source: March 2019
de: März 2019
es: Marzo de 2019
zh_cn: 2019 年 3 月
zh_tw: 2019 年 3 月

source: |eol| No longer supported (last update: 3.1.2).
de: |eol| Nicht mehr unterstützt (letztes Update: 3.1.2).
es: |eol| Esta versión ya no es soportada (última actualización: 3.1.2).
zh_cn: |eol| 不再支持（最后更新：3.1.2）。
zh_tw: |eol| 已停止支援。

source: January 2018
de: Januar 2018
es: Enero de 2019
zh_cn: 2018 年 1 月
zh_tw: 2018 年 1 月

source: |eol| No longer supported (last update: 3.0.6).
de: |eol| Nicht mehr unterstützt (letztes Update: 3.0.6).
es: |eol| Esta versión ya no es sostenida (Ultima actualización: 3.0.6).
zh_cn: |eol| 不再支持（最后更新：3.0.6）。
zh_tw: |eol| 已停止支援。

source: July 2016
de: Juli 2016
es: Julio de 2016
zh_cn: 2016 年 7 月
zh_tw: 2016 年 7 月

source: |eol| No longer supported (last update: 2.1.6).
de: |eol| Nicht mehr unterstützt (letztes Update: 2.1.6).
es: |eol| Esta versión ya no es soportada (última actualización: 2.1.6).
zh_cn: |eol| 不再支持（最后更新：2.1.6）。
zh_tw: |eol| 已停止支援。

source: February 2016
de: Februar 2016
es: Febrero de 2016
zh_cn: 2016 年 2 月
zh_tw: 2016 年 2 月

source: |eol| No longer supported (last update: 2.0.4.1).
de: |eol| Nicht mehr unterstützt (letztes Update: 2.0.4.1).
es: |eol| Esta versión ya no es sostenida (ultima actualización: 2.0.4.1).
zh_cn: |eol| 不再支持（最后更新：2.0.4.1）。
zh_tw: |eol| 已停止支援。

source: May 2015
de: Mai 2015
es: Mayo de 2015
zh_cn: 2015 年 5 月
zh_tw: 2015 年 5 月

source: |eol| No longer supported.
de: |eol| Nicht mehr unterstützt.
es: |eol| Sin soporte.
zh_cn: |eol| 不再支持。
zh_tw: |eol| 已停止支援。

source: December 2014
de: Dezember 2014
es: Diciembre de 2014
zh_cn: 2014 年 12 月
zh_tw: 2014 年 12 月

source: **Legend:** |supported| Full support – |partial| Partial support – |eol| No support (end of life) – |unstable| Development version
de: **Legende:** |supported| Volle Unterstützung - |partial| Teilweise Unterstützung - |eol| Keine Unterstützung (End of Life) - |unstable| Entwicklungsversion
es: **Leyenda:** |soportado| Soporte completo - |parcial| Soporte parcial - |eol| No hay soporte (fin de vida) - |inestable| Versión de desarrollo
zh_cn: **图例：** |supported| 完全支持 - |partial| 部分支持 - |eol| 不支持（生命结束） - |unstable| 开发版本
zh_tw: **圖例：** |supported| 完整支援 - |partial| 部分支援 - |eol| 停止支援 (EOL) - |unstable| 開發中版本

source: Pre-release Godot versions aren't intended to be used in production and are provided for testing purposes only.
de: Vorabversionen von Godot sind nicht für den Einsatz in der Produktion gedacht und werden nur zu Testzwecken bereitgestellt.
es: Las versiones de Godot anteriores al lanzamiento no están pensadas para ser utilizadas en la producción y se proporcionan solo con el propósito de realizar pruebas.
zh_cn: Godot 的预览版不是为生产使用准备的，仅用于测试目的。
zh_tw: 我們只會盡最大努力提供預覽版本，但這些預覽版本不應用於正式產品。

source: See :ref:`doc_upgrading_to_godot_4` for instructions on migrating a project from Godot 3.x to 4.x.
de: Siehe :ref:`doc_upgrading_to_godot_4` für Anweisungen zur Migration eines Projekts von Godot 3.x auf 4.x.
es: Ver :ref:`doc_upgrading_to_godot_4` para instrucciones de migración de proyectos de Godot 3.x a 4.x.
zh_cn: 有关将项目从 Godot 3.x 迁移到 4.x 的说明，请参阅 :ref:`doc_upgrading_to_godot_4`\ 。
zh_tw: 有關將專案從 Godot 3.x 遷移到 4.x 的說明，請參閱 :ref:`doc_upgrading_to_godot_4` 。

source: Which version should I use for a new project?
de: Welche Version sollte ich für ein neues Projekt verwenden?
es: ¿Qué versión debería usar para un proyecto nuevo?
zh_cn: 新项目应该使用哪个版本？
zh_tw: GDScript是什麼？為什麼我要用它？

source: We recommend using Godot 4.x for new projects, as the Godot 4.x series will be supported long after 3.x stops receiving updates in the future. One caveat is that a lot of third-party documentation hasn't been updated for Godot 4.x yet. If you have to follow a tutorial designed for Godot 3.x, we recommend keeping :ref:`doc_upgrading_to_godot_4` open in a separate tab to check which methods have been renamed (if you get a script error while trying to use a specific node or method that was renamed in Godot 4.x).
de: Wir empfehlen die Verwendung von Godot 4.x für neue Projekte, da die Godot 4.x-Reihe noch unterstützt werden wird, lange nachdem 3.x keine Updates mehr bekommt. Ein Vorbehalt ist, dass viele Dokumentationen von Drittanbietern noch nicht für Godot 4.x aktualisiert wurden. Wenn Sie ein für Godot 3.x entwickeltes Tutorial befolgen wollen, empfehlen wir, :ref:`doc_upgrading_to_godot_4` in einem separaten Tab geöffnet zu halten, um zu prüfen, welche Methoden umbenannt wurden (falls Sie einen Skriptfehler erhalten, während Sie versuchen, einen bestimmten Node oder eine Methode zu verwenden, die in Godot 4.x umbenannt wurde).
es: Recomendamos utilizar Godot 4.x para proyectos nuevos, ya que la serie Godot 4.x será soportada por mucho tiempo después de que 3.x deje de recibir actualizaciones en el futuro. Un detalle es que mucha de la documentación no ha sido actualizada a Godot 4.x todavía, si estás siguiendo un tutorial diseñado para Godot 3.x, recomendamos tener :ref:`doc_upgrading_to_godot_4` abierta en una pestaña separada para revisar cuáles métodos fueron renombrados (si tienes un error de scripting mientras intentas utilizar un nodo o método específico que fue renombrado en Godot 4.x).
zh_cn: 我们建议在新项目中使用 Godot 4.x，因为在未来 3.x 停止接收更新后很长时间内仍将支持 Godot 4.x 系列。 需要注意的是，许多第三方文档尚未针对 Godot 4.x 进行更新。 如果你必须学习为 Godot 3.x 设计的教程，我们建议在单独的选项卡中保持 :ref:`doc_upgrading_to_godot_4` 打开，以检查哪些方法已被重命名（如果你在尝试使用特定节点或在 Godot 4.x 中被重命名的方法时遇到了脚本错误的话）。
zh_tw: 我們建議在新專案中使用 Godot 4.x，因為在未來 3.x 停止接收更新後很長時間內仍將支援 Godot 4.x 系列。 需要注意的是，許多協力廠商文件尚未針對 Godot 4.x 進行更新。 如果您必須學習為 Godot 3.x 設計的教學，我們建議在單獨的分頁中保持 :ref:`doc_upgrading_to_godot_4` 打開，以檢查哪些方法已被重命名（如果您在嘗試使用特定節點或在 Godot 4.x 中被重命名的方法時遇到了腳本錯誤的話）。

source: If your project requires a feature that is missing in 4.x (such as GLES2/WebGL 1.0), you should use Godot 3.x for a new project instead.
de: Wenn Ihr Projekt ein Feature benötigt, das in 4.x fehlt (z.B. GLES2/WebGL 1.0), sollten Sie stattdessen Godot 3.x für ein neues Projekt verwenden.
es: Si tu proyecto requiere una característica que no está disponible en 4.x (como GLES2/WebGL 1.0), deberías usar Godot 3.x para un proyecto nuevo.
zh_cn: 如果你的项目需要在 4.x 版本中缺失的功能（如GLE2/WebGL 1.0），那么你应该为新项目使用 Godot 3.x。
zh_tw: 如果你的專案需要在 4.x 版本中缺失的功能（如GLE2/WebGL 1.0），那麼你應該為新專案使用 Godot 3.x。

source: Should I upgrade my project to use new engine versions?
de: Sollte ich mein Projekt aktualisieren, um neue Engine-Versionen zu verwenden?
es: ¿Debería actualizar mi proyecto a una versión nueva del motor?
zh_cn: 我应该把项目升级到新版本的引擎吗？
zh_tw: 我應該把專案升級到新版本的引擎嗎？
