Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/editor/editor_style_guide.po
Languages: de

source: Editor style guide
de: Editor Stil-Richtlinien

source: Introduction
de: Einführung

source: Thanks for your interest in contributing to the Godot editor!
de: Vielen Dank für Ihr Interesse, einen Beitrag zum Godot-Editor zu leisten!

source: This page describes the grammar and writing style used throughout the Godot editor. Following this style guide will help your contribution get merged faster since there will be fewer review steps required.
de: Diese Seite beschreibt die Grammatik und den Schreibstil, die im gesamten Godot-Editor verwendet werden. Wenn Sie diese Stil-Richtlinien befolgen, wird Ihr Beitrag schneller gemergt, da weniger Review-Schritte erforderlich sind.

source: Writing style
de: Schreibstil

source: **Write messages (errors, warnings, ...) as full sentences.** They should start with an uppercase letter and end with a period.
de: **Schreiben Sie Meldungen (Fehler, Warnungen, ...) in ganzen Sätzen.** Sie sollten mit einem Großbuchstaben beginnen und mit einem Punkt enden.

source: **Try to keep sentences short.** This makes it more likely that their translations will be short as well, which is a good thing to avoid UI bugs.
de: **Versuchen Sie, Sätze kurz zu halten.** Das macht es wahrscheinlicher, dass ihre Übersetzungen ebenfalls kurz sind, was eine gute Sache ist, um UI-Bugs zu vermeiden.

source: **Use contractions.** For example, use "isn't" instead of "is not". An exception to this rule can be made when you specifically want to emphasize one of the contraction's words.
de: **Verwenden Sie Kontraktionen.** Verwenden Sie z.B. "isn't" statt "is not". Eine Ausnahme von dieser Regel kann gemacht werden, wenn Sie eines der Wörter der Kontraktion besonders betonen wollen.

source: **Use double quotes in messages** (``""``) instead of single quotes (``''``). Double quotes should be used to quote user input, file paths and possibly other things depending on the context.
de: **Verwenden Sie in Nachrichten doppelte Anführungszeichen** (``""``) anstelle von einfachen Anführungszeichen (``''``). Doppelte Anführungszeichen sollten verwendet werden, um Benutzereingaben, Dateipfade und möglicherweise andere Dinge, je nach Kontext, zu zitieren.

source: Try to follow the :ref:`doc_docs_writing_guidelines` in addition to the guidelines outlined above.
de: Versuchen Sie, zusätzlich zu den oben genannten Richtlinien die :ref:`doc_docs_writing_guidelines` zu befolgen.

source: Button and menu texts
de: Buttons und Menütexte

source: Capitalize text in buttons and menu actions:
de: Schreiben Sie Texte in Buttons und Menüs groß:

source: **Good:** *Open Editor Data Folder*
de: **gut:** *Open Editor Data Folder*

source: **Bad:** *Open editor data folder*
de: **schlecht:** *Open editor data folder*

source: If a menu action opens a modal dialog, suffix it with an ellipsis (``...``).
de: Wenn eine Menüaktion einen modalen Dialog öffnet, fügen Sie ihm ein Auslassungszeichen (``...``) hinzu.

source: **Good:** *Editor Settings...*
de: **Gut:** *Editor Settings...*

source: **Bad:** *Editor Settings*
de: **schlecht:** *Editor Settings*

source: Inspector sections
de: Inspektor-Abschnitte

source: In general, don't create sections that contain less than 3 items. Sections that contain few items make it difficult to navigate the inspector, while missing the benefits of using sections such as folding.
de: Generell sollten Sie keine Abschnitte erstellen, die weniger als 3 Elemente enthalten. Abschnitte, die nur wenige Elemente enthalten, erschweren die Navigation im Inspektor und verzichten auf die Vorteile von Abschnitten wie z.B. das Einklappen.

source: There are some valid exceptions for this, such as material features in :ref:`class_StandardMaterial3D`.
de: Es gibt einige gültige Ausnahmen, wie z.B. die Materialmerkmale in :ref:`class_StandardMaterial3D`.

source: This advice also applies to the Project Settings and Editor Settings.
de: Dieser Ratschlag gilt ebenso für die Projekteinstellungen und die Editoreinstellungen.

source: Inspector performance hints
de: Inspektor-Performance-Tipps

source: Enum properties that noticeably impact performance should have a performance hint associated. The hint should refer to the *absolute* performance impact, rather than being relative to the other options provided in the enum. Here are some examples taken from the Godot editor:
de: Enum-Propertys, die sich merklich auf die Performance auswirken, sollten mit einem Performance-Hinweis versehen werden. Der Hinweis sollte sich auf die *absolute* Auswirkung auf die Performance beziehen und nicht relativ zu den anderen in der Aufzählung angegebenen Optionen sein. Hier sind einige Beispiele aus dem Godot-Editor:

source: For consistency, try to stick to the terms below (from fastest to slowest):
de: Versuchen Sie aus Gründen der Konsistenz, die folgenden Begriffe einzuhalten (vom schnellsten zum langsamsten):

source: Their usage doesn't have to be contiguous. For example, you can use only "Fast" and "Slow" from the list above.
de: Ihre Verwendung muss nicht zusammenhängend sein. Sie können zum Beispiel nur "Fast" und "Slow" aus der obigen Liste verwenden.

source: If you're adding a new enum, its values should be ordered from the fastest option to the slowest option.
de: Wenn Sie eine neue Aufzählung hinzufügen, sollten deren Werte von der schnellsten Option zur langsamsten Option sortiert werden.

source: Consider adding tooltips whenever the action performed by a button or menu action isn't obvious. You can also provide additional context or highlight caveats in the tooltip.
de: Ziehen Sie in Erwägung, Tooltips hinzuzufügen, wenn die von einem Button oder einer Menüaktion ausgeführte Aktion nicht offensichtlich ist. Sie können im Tooltip auch zusätzlichen Kontext bereitstellen oder Vorbehalte hervorheben.

source: You can do this by calling ``set_tooltip(TTR("Text here."))`` on the Control-based node in question. If the tooltip is particularly long (more than ~80 characters), wrap it over several lines by adding line breaks using ``\n``.
de: Sie können dies tun, indem Sie ``set_tooltip(TTR("Text here."))`` auf dem betreffenden Control-basierten Node aufrufen. Wenn der Tooltip besonders lang ist (mehr als ~80 Zeichen), brechen Sie ihn über mehrere Zeilen um, indem Sie Zeilenumbrüche mit ``\n`` hinzufügen.

source: Tooltips should follow the writing style described above. In addition to this, use indicative mood instead of imperative mood:
de: Tooltips sollten dem oben beschriebenen Schreibstil folgen. Verwenden Sie außerdem den Indikativ anstelle des Imperativs:

source: **Good:** *Computes global illumination for the selected GIProbe.*
de: **Gut:** *Computes global illumination for the selected GIProbe.*

source: **Bad:** *Compute global illumination for the selected GIProbe.*
de: **Schlecht:** *Compute global illumination for the selected GIProbe.*

source: Translation status
de: Übersetzungsstatus
