Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/background_loading.po
Languages: de, zh_tw

source: Background loading
de: Laden im Hintergrund
zh_tw: 後臺載入

source: Commonly, games need to load resources asynchronously. When switching the main scene of your game (e.g. going to a new level), you might want to show a loading screen with some indication that progress is being made, or you may want to load additional resources during gameplay.
de: In der Regel müssen Spiele Ressourcen asynchron laden. Wenn Sie die Hauptszene Ihres Spiels wechseln (z.B. zu einem neuen Level), möchten Sie vielleicht einen Ladebildschirm mit einem Hinweis darauf anzeigen, dass etwas passiert, oder Sie möchten zusätzliche Ressourcen während des Spiels laden.
zh_tw: 通常，遊戲需要非同步載入資源。當切換遊戲的主場景時（例如，進入新的關卡），您可能想要顯示一個載入畫面，其中包含一些正在進行的指示，或者您可能希望在遊戲過程中載入其他資源。

source: The standard load method (:ref:`ResourceLoader.load <class_ResourceLoader_method_load>` or GDScript's simpler :ref:`load <class_@GDScript_method_load>`) blocks your thread, making your game appear unresponsive while the resource is being loaded.
de: Die Standard-Lademethode (:ref:`ResourceLoader.load <class_ResourceLoader_method_load>` oder die einfachere GDScript-Methode :ref:`load <class_@GDScript_method_load>`) blockiert Ihren Thread, so dass Ihr Spiel nicht mehr reagiert, während die Ressource geladen wird.
zh_tw: 標準載入方法（:ref:`ResourceLoader.load <class_ResourceLoader_method_load>` 或 GDScript 更簡單的:ref:`load <class_@GDScript_method_load>`）會阻塞您的線程，讓您的遊戲在載入資源時顯得無回應。

source: One way around this is using ``ResourceLoader`` to load resources asynchronously in background threads.
de: Eine Möglichkeit, dies zu umgehen, ist die Verwendung von ``ResourceLoader`` zum asynchronen Laden von Ressourcen in Hintergrund-Threads.
zh_tw: 解決這個問題的一種方法是使用「ResourceLoader」在後台執行緒中非同步載入資源。

source: Using ResourceLoader
de: Verwendung von ResourceLoader
zh_tw: 建立 ResourceFormatLoader

source: Generally, you queue requests to load resources for a path using :ref:`ResourceLoader.load_threaded_request <class_ResourceLoader_method_load_threaded_request>`, which will then be loaded in threads in the background.
de: Im Allgemeinen stellt man Anfragen zum Laden von Ressourcen für einen Pfad mit :ref:`ResourceLoader.load_threaded_request <class_ResourceLoader_method_load_threaded_request>` in eine Warteschlange, die dann in Threads im Hintergrund geladen werden.
zh_tw: 通常，您使用 ResourceLoader.load_threaded_request <class_ResourceLoader_method_load_threaded_request> 對載入路徑資源的請求進行排隊，然後將在背景的執行緒中載入。

source: You can check the status with :ref:`ResourceLoader.load_threaded_get_status <class_ResourceLoader_method_load_threaded_get_status>`. Progress can be obtained by passing an array variable via progress which will return a one element array containing the percentage.
de: Sie können den Status mit :ref:`ResourceLoader.load_threaded_get_status <class_ResourceLoader_method_load_threaded_get_status>` überprüfen. Der Fortschritt kann durch die Übergabe einer Array-Variable über progress erhalten werden, die ein Ein-Element-Array zurückgibt, das den Prozentsatz enthält.
zh_tw: 您可以使用 ResourceLoader.load_threaded_get_status <class_ResourceLoader_method_load_threaded_get_status>` 檢查狀態。可以透過 Progress 傳遞一個陣列變數來取得進度，該變數將傳回一個包含百分比的單元素陣列。

source: Finally, you retrieve loaded resources by calling :ref:`ResourceLoader.load_threaded_get <class_ResourceLoader_method_load_threaded_get>`.
de: Schließlich können Sie geladene Ressourcen durch den Aufruf von :ref:`ResourceLoader.load_threaded_get <class_ResourceLoader_method_load_threaded_get>` abrufen.

source: Once you call ``load_threaded_get()``, either the resource finished loading in the background and will be returned instantly or the load will block at this point like ``load()`` would. If you want to guarantee this does not block, you either need to ensure there is enough time between requesting the load and retrieving the resource or you need to check the status manually.
de: Nach dem Aufruf von ``load_threaded_get()`` wird entweder die Ressource im Hintergrund fertig geladen und sofort zurückgegeben oder der Ladevorgang wird an dieser Stelle blockiert, wie es bei ``load()`` der Fall wäre. Wenn Sie sicherstellen wollen, dass der Vorgang nicht blockiert, müssen Sie entweder sicherstellen, dass zwischen der Anforderung des Ladevorgangs und dem Abrufen der Ressource genügend Zeit vergeht, oder Sie müssen den Status manuell überprüfen.
zh_tw: 一旦你呼叫“load_threaded_get()”，資源要么在後台完成加載並立即返回，要么加載將像“load()”一樣在此時阻塞。如果您想保證這不會阻塞，您要么需要確保請求加載和檢索資源之間有足夠的時間，要么需要手動檢查狀態。

source: Example
de: Beispiel
zh_tw: 範例

source: This example demonstrates how to load a scene in the background. We will have a button spawn a enemy when pressed. The enemy will be ``Enemy.tscn`` which we will load on ``_ready`` and instantiate when pressed. The path will be ``"Enemy.tscn"`` which is located at ``res://Enemy.tscn``.
de: Dieses Beispiel zeigt, wie man eine Szene im Hintergrund lädt. Wir werden einen Button haben, der einen Gegner spawnen lässt, wenn er gedrückt wird. Der Gegner wird ``Enemy.tscn`` sein, den wir bei ``_ready`` laden und beim Drücken instanziieren. Der Pfad wird ``"Enemy.tscn"`` sein, der unter ``res://Enemy.tscn`` zu finden ist.
zh_tw: 此範例示範如何在背景載入場景。我們將有一個按鈕，按下時會生成一個敵人。敵人將是“Enemy.tscn”，我們將在“_ready”上載入它並在按下時實例化。路徑為“Enemy.tscn”，位於“res://Enemy.tscn”。

source: First, we will start a request to load the resource and connect the button:
de: Zunächst wird eine Anfrage gestartet, um die Ressource zu laden und den Button zu verbinden:
zh_tw: 首先，我們將啟動一個請求來載入資源並連接按鈕：

source: Now ``_on_button_pressed`` will be called when the button is pressed. This method will be used to spawn an enemy.
de: Jetzt wird ``_on_button_pressed`` aufgerufen, wenn der Button gedrückt wird. Diese Methode wird benutzt, um einen Gegner zu spawnen.
zh_tw: 現在按下按鈕時將呼叫“_on_button_pressed”。此方法將用於生成敵人。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
