Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/data_paths.po
Languages: de, zh_tw

source: File paths in Godot projects
de: Dateipfade in Godot-Projekten
zh_tw: Godot 專案中的檔路徑

source: This page explains how file paths work inside Godot projects. You will learn how to access paths in your projects using the ``res://`` and ``user://`` notations, and where Godot stores project and editor files on your and your users' systems.
de: Diese Seite erklärt, wie Dateipfade innerhalb von Godot-Projekten funktionieren. Sie erfahren, wie Sie mit den Bezeichnungen ``res://`` und ``user://`` auf Pfade in Ihren Projekten zugreifen können und wo Godot Projekt- und Editor-Dateien auf Ihren und den Systemen Ihrer Benutzer speichert.
zh_tw: 本頁面會講解 Godot 專案中檔路徑的工作原理。你會學到如何在專案中使用 ``res://`` 和 ``user://`` 標記來存取路徑，以及 Godot 會在你的以及使用者系統上的哪些位置儲存專案和編輯器檔。

source: Path separators
de: Pfad-Trennzeichen
zh_tw: 路徑分隔符號

source: To make supporting multiple platforms easier, Godot uses **UNIX-style path separators** (forward slash ``/``). These work on all platforms, **including Windows**.
de: Um die Unterstützung mehrerer Plattformen zu erleichtern, verwendet Godot **UNIX-ähnliche Pfad-Trennzeichen** (Schrägstrich ``/``). Diese funktionieren auf allen Plattformen, **auch unter Windows**.
zh_tw: 為了讓支援跨平臺更方便，Godot 使用 **UNIX 風格的路徑分隔符號**（正斜杠 ``/``）。在所有平臺上都可以使用，**包括 Windows**。

source: Instead of writing paths like ``C:\Projects\Game``, in Godot, you should write ``C:/Projects/Game``.
de: In Godot sollten Pfade nicht wie ``C:\Projects\Game``, sondern stattdessen wie ``C:/Projects/Game`` geschreiben werden.
zh_tw: 在 Godot 裡寫的不是類似 ''C：\Projects\Game'' 的路徑，而應該寫 ''C：/Projects/Game''\。

source: Windows-style path separators (backward slash ``\``) are also supported in some path-related methods, but they need to be doubled (``\\``), as ``\`` is normally used as an escape for characters with a special meaning.
de: Pfadtrennzeichen im Windows-Stil (umgekehrter Schrägstrich ``\``) werden in einigen pfadbezogenen Methoden ebenfalls unterstützt, müssen aber gedoppelt werden (``\\``), da ``\`` normalerweise als Escape-Zeichen für Zeichen mit einer besonderen Bedeutung verwendet wird.
zh_tw: 有些路徑相關的方法也支援 Windows 風格的路徑分隔符（反斜杠\ '''''\ ），不過需要寫兩個（\ ''\''），因為 '''' 一般是用來進行字元轉義的，有特殊含義。

source: This makes it possible to work with paths returned by other Windows applications. We still recommend using only forward slashes in your own code to guarantee that everything will work as intended.
de: Dadurch ist es möglich, mit Pfaden zu arbeiten, die von anderen Windows-Anwendungen zurückgegeben werden. Wir empfehlen dennoch, in Ihrem eigenen Code nur normale Schrägstriche zu verwenden, um sicherzustellen, dass alles wie vorgesehen funktioniert.
zh_tw: 這樣就能夠處理其他 Windows 程式所返回的路徑了。我們仍然建議在您自己的程式碼裡只使用正斜杠，這樣才能確保一切都能正常工作。

source: Accessing files in the project folder (``res://``)
de: Zugriff auf Dateien im Projektverzeichnis (``res://``)
zh_tw: 新增檔案至專案

source: Godot considers that a project exists in any folder that contains a ``project.godot`` text file, even if the file is empty. The folder that contains this file is your project's root folder.
de: Godot geht davon aus, dass ein Projekt in einem beliebigen Ordner existiert, der eine ``project.godot``-Textdatei enthält, auch wenn diese Datei leer ist. Der Ordner, der diese Datei enthält, ist das Stammverzeichnis des Projekts.
zh_tw: 只要資料夾中存在名叫 ``project.godot`` 的文字檔，即便是空檔，Godot 也會認為這個資料夾中包含了一個專案。包含這個檔的資料夾是你的專案的根資料夾。

source: You can access any file relative to it by writing paths starting with ``res://``, which stands for resources. For example, you can access an image file ``character.png`` located in the project's root folder in code with the following path: ``res://character.png``.
de: Der Zugriff auf Projektdateien kann durch das Öffnen eines beliebigen Pfades mit ``res://`` (kurz für Ressourcen) als Basis erfolgen. Beispielsweise kann eine Textur ``character.png``, die sich im Stammverzeichnis des Projektordners befindet, vom folgenden Pfad aus geöffnet werden: ``res://character.png``.
zh_tw: 相對於這個資料夾的任何檔，都可以通過以 ``res://`` 開頭的路徑存取，這個前綴代表“資源”（resource）。例如，在程式碼中，你可以通過 ``res://character.png`` 來存取位於專案根資料夾的 ``character.png`` 圖片。

source: Accessing persistent user data (``user://``)
de: Zugriff auf dauerhafte Nutzerdaten (``user://``)
zh_tw: 存取場景節點

source: To store persistent data files, like the player's save or settings, you want to use ``user://`` instead of ``res://`` as your path's prefix. This is because when the game is running, the project's file system will likely be read-only.
de: Um dauerhafte Datendateien zu speichern, wie z.B. die Spielstände oder Einstellungen des Spielers, sollten Sie ``user://`` anstelle von ``res://`` als Präfix für den Pfad verwenden. Der Grund dafür ist, dass das Dateisystem des Projekts wahrscheinlich schreibgeschützt ist, wenn das Spiel läuft.
zh_tw: 要儲存持久化資料檔案，比如玩家的存檔、設定等，你會想要使用 ``user://`` 作為路徑前綴，而不是 ``res://``。這是因為遊戲運作時，專案的檔案系統很可能是唯讀的。

source: The ``user://`` prefix points to a different directory on the user's device. Unlike ``res://``, the directory pointed at by ``user://`` is created automatically and *guaranteed* to be writable to, even in an exported project.
de: Der Präfix ``user://`` verweist auf ein anderes Verzeichnis auf dem Gerät des Benutzers. Im Gegensatz zu ``res://`` wird das Verzeichnis, auf das ``user://`` verweist, automatisch erstellt und *garantiert*, dass es beschreibbar ist, selbst in einem exportierten Projekt.
zh_tw: ``user://`` 前綴指向的是使用者裝置上的其他目錄。與 ``res://`` 不同，即便在匯出後的專案中，``user://`` 指向的這個目錄也會自動建立並且*保證*可寫。

source: The location of the ``user://`` folder depends on what is configured in the Project Settings:
de: Der Ort des Ordners ``user://`` hängt davon ab, was in den Projekteinstellungen konfiguriert ist:
zh_tw: ``user://`` 資料夾的位置由“專案設定”中的配置決定：

source: By default, the ``user://`` folder is created within Godot's :ref:`editor data path <doc_data_paths_editor_data_paths>` in the ``app_userdata/[project_name]`` folder. This is the default so that prototypes and test projects stay self-contained within Godot's data folder.
de: Standardmäßig wird der Ordner ``user://`` in Godots :ref:`Editor-Datenpfad <doc_data_paths_editor_data_paths>` im Ordner ``app_userdata/[project_name]`` angelegt. Dies ist die Standardeinstellung, damit Prototypen und Testprojekte innerhalb des Godot-Datenordners in sich geschlossen bleiben.
zh_tw: 預設情況下，``user://`` 資料夾是在:ref:`編輯器資料路徑 <doc_data_paths_editor_data_paths>`中建立的 ``app_userdata/[專案名稱]`` 資料夾。使用這一預設值的目的是讓原型和測試專案能夠在 Godot 的資料檔案夾中達到自包含。

source: If :ref:`application/config/use_custom_user_dir <class_ProjectSettings_property_application/config/use_custom_user_dir>` is enabled in the Project Settings, the ``user://`` folder is created **next to** Godot's editor data path, i.e. in the standard location for applications data.
de: Wenn :ref:`application/config/use_custom_user_dir <class_ProjectSettings_property_application/config/use_custom_user_dir>` in den Projekteinstellungen aktiviert ist, wird der Ordner ``user://`` **neben** dem Datenpfad des Godot-Editors angelegt, d. h. am Standardort für Anwendungsdaten.
zh_tw: 如果“專案設定”中啟用了 :ref:`application/config/use_custom_user_dir <class_ProjectSettings_property_application/config/use_custom_user_dir>`，``user://`` 資料夾會與 Godot 編輯器的資料路徑*同級*，即程式資料的標準位置。

source: By default, the folder name will be inferred from the project name, but it can be further customized with :ref:`application/config/custom_user_dir_name <class_ProjectSettings_property_application/config/custom_user_dir_name>`. This path can contain path separators, so you can use it e.g. to group projects of a given studio with a ``Studio Name/Game Name`` structure.
de: Standardmäßig wird der Ordnername aus dem Projektnamen abgeleitet, aber er kann mit :ref:`application/config/custom_user_dir_name <class_ProjectSettings_property_application/config/custom_user_dir_name>` weiter angepasst werden. Dieser Pfad kann Pfadtrennzeichen enthalten, so dass man ihn z.B. benutzen kann, um Projekte eines bestimmten Studios mit einer ``Studioname/Spielname``-Struktur zu gruppieren.
zh_tw: 預設情況下，資料夾名稱是從專案名稱推匯出來的，但可以使用 :ref:`application/config/custom_user_dir_name <class_ProjectSettings_property_application/config/custom_user_dir_name>` 進行進一步的自訂。這個路徑可以包含路徑分隔符號，那麼比如你就可以把給定工作室的專案都群組到 ``工作室名稱/遊戲名稱`` 這樣的目錄結構之下。

source: On desktop platforms, the actual directory paths for ``user://`` are:
de: Auf Desktop-Plattformen lauten die tatsächlichen Verzeichnispfade für ``user://``:
zh_tw: 在桌面平臺上，``user://`` 的實際目錄路徑為：

source: Type
de: Typ
zh_tw: 型別

source: Location
de: Ort
zh_tw: 位置

source: Default
zh_tw: 預設

source: Windows: ``%APPDATA%\Godot\app_userdata\[project_name]``
zh_tw: Windows：``%APPDATA%\Godot\script_templates\``

source: macOS: ``~/Library/Application Support/Godot/app_userdata/[project_name]``
zh_tw: macOS：``$HOME/Library/Application Support/Godot/script_templates/``

source: Linux: ``~/.local/share/godot/app_userdata/[project_name]``
zh_tw: Linux: ``$HOME/.local/share/godot/templates/<版本>/``

source: Custom dir
de: Benutzerdefiniertes Verzeichnis
zh_tw: 自定功能

source: Windows: ``%APPDATA%\[project_name]``
zh_tw: Windows：``%APPDATA%\Godot\script_templates\``

source: macOS: ``~/Library/Application Support/[project_name]``
zh_tw: macOS：``$HOME/Library/Application Support/Godot/script_templates/``

source: Linux: ``~/.local/share/[project_name]``
zh_tw: Linux: ``$HOME/.local/share/godot/templates/<版本>/``

source: Custom dir and name
de: Benutzerdefiniertes Verzeichnis und Name
zh_tw: 自定 AudioStream

source: Windows: ``%APPDATA%\[custom_user_dir_name]``
zh_tw: Windows：``%APPDATA%\Godot\script_templates\``

source: macOS: ``~/Library/Application Support/[custom_user_dir_name]``
zh_tw: macOS：``$HOME/Library/Application Support/Godot/script_templates/``

source: Linux: ``~/.local/share/[custom_user_dir_name]``
zh_tw: Linux: ``$HOME/.local/share/godot/templates/<版本>/``

source: ``[project_name]`` is based on the application name defined in the Project Settings, but you can override it on a per-platform basis using :ref:`feature tags <doc_feature_tags>`.
de: ``[project_name]`` basiert auf dem Anwendungsnamen, der in den Projekteinstellungen definiert ist, aber Sie können ihn auf einer plattformspezifischen Basis überschreiben, indem Sie :ref:`feature tags <doc_feature_tags>` verwenden.
zh_tw: ``[專案名稱]`` 基於的是專案設定中定義的應用名稱，不過你可以使用:ref:`功能標籤 <doc_feature_tags>`來為不同平臺單獨進行覆蓋。

source: On mobile platforms, this path is unique to the project and is not accessible by other applications for security reasons.
de: Auf mobilen Plattformen ist dieser Pfad nur für das Projekt bestimmt und aus Sicherheitsgründen für andere Anwendungen nicht zugänglich.
zh_tw: 在移動平臺上，這個路徑是與專案相關的，每個專案都不一樣，並且出於安全原因無法被其他應用程式存取。

source: On HTML5 exports, ``user://`` will refer to a virtual filesystem stored on the device via IndexedDB. (Interaction with the main filesystem can still be performed through the :ref:`JavaScriptBridge <class_JavaScriptBridge>` singleton.)
de: Bei HTML5-Exporten verweist ``user://`` auf ein virtuelles Dateisystem, das über IndexedDB auf dem Gerät gespeichert ist. (Die Interaktion mit dem Hauptdateisystem kann weiterhin über das Singleton :ref:`JavaScriptBridge <class_JavaScriptBridge>` erfolgen).
zh_tw: 在 HTML5 匯出中，``user://`` 會指向裝置上由 IndexedDB 實作的虛擬檔案系統。（與主檔案系統的互動仍然可以通過 :ref:`JavaScript <class_JavaScript>` 進行。）

source: Converting paths to absolute paths or "local" paths
de: Umwandlung von Pfaden in absolute Pfade oder "lokale" Pfade
zh_tw: 將路徑轉換為絕對路徑或“本地”路徑

source: You can use :ref:`ProjectSettings.globalize_path() <class_ProjectSettings_method_globalize_path>` to convert a "local" path like ``res://path/to/file.txt`` to an absolute OS path. For example, :ref:`ProjectSettings.globalize_path() <class_ProjectSettings_method_globalize_path>` can be used to open "local" paths in the OS file manager using :ref:`OS.shell_open() <class_OS_method_shell_open>` since it only accepts native OS paths.
de: Sie können :ref:`ProjectSettings.globalize_path() <class_ProjectSettings_method_globalize_path>` verwenden, um einen "lokalen" Pfad wie ``res://path/to/file.txt`` in einen absoluten OS-Pfad umzuwandeln. Zum Beispiel kann :ref:`ProjectSettings.globalize_path() <class_ProjectSettings_method_globalize_path>` verwendet werden, um "lokale" Pfade im OS-Dateimanager mit :ref:`OS.shell_open() <class_OS_method_shell_open>` zu öffnen, da es nur native OS-Pfade akzeptiert.
zh_tw: 你可以使用 :ref:`ProjectSettings.globalize_path() <class_ProjectSettings_method_globalize_path>` 將類似 ``res://path/to/file.txt`` 的本地路徑轉換為作業系統的絕對路徑。例如，可以使用 :ref:`ProjectSettings.globalize_path() <class_ProjectSettings_method_globalize_path>` 在作業系統的檔案管理員中通過 :ref:`OS.shell_open() <class_OS_method_shell_open>` 打開“本地”路徑，因為這個函式只接受原生作業系統路徑。

source: To convert an absolute OS path to a "local" path starting with ``res://`` or ``user://``, use :ref:`ProjectSettings.localize_path() <class_ProjectSettings_method_localize_path>`. This only works for absolute paths that point to files or folders in your project's root or ``user://`` folders.
de: Um einen absoluten OS-Pfad in einen "lokalen" Pfad umzuwandeln, der mit ``res://`` oder ``user://`` beginnt, verwenden Sie :ref:`ProjectSettings.localize_path() <class_ProjectSettings_method_localize_path>`. Dies funktioniert nur bei absoluten Pfaden, die auf Dateien oder Ordner im Stammverzeichnis oder im Ordner ``user://`` Ihres Projekts zeigen.
zh_tw: 要將作業系統絕對路徑轉換為以 ``res://`` 或 ``user://`` 開頭的“本地”路徑，請使用 :ref:`ProjectSettings.localize_path() <class_ProjectSettings_method_localize_path>`。只對指向專案根目錄或者 ``user://`` 資料夾中的檔案或資料夾有效。

source: Editor data paths
de: Editor-Datenpfade
zh_tw: 編輯器資料路徑

source: The editor uses different paths for editor data, editor settings, and cache, depending on the platform. By default, these paths are:
de: Der Editor verwendet je nach Plattform unterschiedliche Pfade für Editordaten, Editoreinstellungen und Cache. Standardmäßig sind diese Pfade:
zh_tw: 根據平臺的不同，編輯器會使用不同的路徑來儲存編輯器資料、編輯器設定、快取。預設情況下，這些路徑是：

source: Editor data
de: Editordaten
zh_tw: 編輯器使用手冊

source: Linux: ``~/.local/share/godot/``
zh_tw: Linux: ``$HOME/.local/share/godot/templates/<版本>/``

source: Editor settings
de: Editoreinstellungen
zh_tw: 編輯器設定

source: Cache
zh_tw: 快取

source: **Editor data** contains export templates and project-specific data.
de: **Editor data** enthält Exportvorlagen und projektspezifische Daten.
zh_tw: **編輯器資料**包含匯出範本和具體專案資料。

source: **Editor settings** contains the main editor settings configuration file as well as various other user-specific customizations (editor layouts, feature profiles, script templates, etc.).
de: **Editoreinstellungen** enthält die Hauptkonfigurationsdatei für die Editoreinstellungen sowie verschiedene andere benutzerspezifische Anpassungen (Editorlayouts, Funktionsprofile, Skriptvorlagen usw.).
zh_tw: **編輯器設定**包含主編輯器設定的配置，以及各種針對使用者的自訂資訊（編輯器佈局、功能配置、腳本範本等）。

source: **Cache** contains data generated by the editor, or stored temporarily. It can safely be removed when Godot is closed.
de: **Cache** enthält temporäre Daten, oder solche, die vom Editor generiert wurden. Er kann gefahrlos entfernt werden, wenn Godot geschlossen ist.
zh_tw: **快取**包含編輯器生成的資料，或者臨時儲存的資料。當 Godot 關閉時可以放心地移除。

source: Godot complies with the `XDG Base Directory Specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`__ on all platforms. You can override environment variables following the specification to change the editor and project data paths.
de: Godot entspricht auf allen Plattformen der `XDG Base Directory-Spezifikation <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`__. Sie können die Umgebungsvariablen entsprechend der Spezifikation überschreiben, um den Editor und die Projektdatenpfade zu ändern.
zh_tw: Godot 在所有平臺上都遵守 `XDG 基本目錄規範 <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`__。可以根據規範通過覆蓋環境變數來更改編輯器和專案的資料路徑。

source: If you use `Godot packaged as a Flatpak <https://flathub.org/apps/details/org.godotengine.Godot>`__, the editor data paths will be located in subfolders in ``~/.var/app/org.godotengine.Godot/``.
de: Wenn Sie `Godot gepackt als Flatpak <https://flathub.org/apps/details/org.godotengine.Godot>`__ verwenden, befinden sich die Datenpfade des Editors in Unterordnern von ``~/.var/app/org.godotengine.Godot/``.
zh_tw: 如果您使用的是 `Flatpak 打包的 Godot <https://flathub.org/apps/details/org.godotengine.Godot>`__，編輯器資料路徑將位於 ``~/.var/app/org.godotengine.godot/`` 的子資料夾中。

source: Self-contained mode
de: Portabler Modus
zh_tw: 自包含模式

source: If you create a file called ``._sc_`` or ``_sc_`` in the same directory as the editor binary (or in `MacOS/Contents/` for a macOS editor .app bundle), Godot will enable *self-contained mode*. This mode makes Godot write all editor data, settings, and cache to a directory named ``editor_data/`` in the same directory as the editor binary. You can use it to create a portable installation of the editor.
de: Wenn Sie eine Datei mit dem Namen ``._sc_`` oder ``_sc_`` im selben Verzeichnis wie das Editor-Binary (oder in `MacOS/Contents/` für ein macOS-Editor-.app-Bundle) erstellen, aktiviert Godot den *portablen Modus*. Dieser Modus veranlasst Godot, alle Editor-Daten, Einstellungen und den Cache in ein Verzeichnis namens ``editor_data/`` zu schreiben, das sich im gleichen Verzeichnis wie das Editor-Binary befindet. Sie können ihn benutzen, um eine portable Installation des Editors zu erstellen.
zh_tw: 如果您在編輯器二進位檔案所在的目錄下建立了名為 ``._sc_`` 或 ``_sc_`` 的檔（macOS 編輯器 .app 組合包則是在 `MacOS/Contents/` 下），Godot 就會開啟*自包含模式*。這種模式下，Godot 會將所有編輯器資料、設定、快取都寫入一個與編輯器二進位檔案位於同一目錄中的名為 ``editor_data/`` 的目錄。你可以用它來建立便攜安裝的編輯器。

source: The `Steam release of Godot <https://store.steampowered.com/app/404790/>`__ uses self-contained mode by default.
de: Die `Steam-Version von Godot <https://store.steampowered.com/app/404790/>`__ verwendet standardmäßig den portablen Modus.
zh_tw: `Steam 版本的 Godot <https://store.steampowered.com/app/404790/>`__ 預設使用自包含模式。

source: Self-contained mode is not supported in exported projects yet. To read and write files relative to the executable path, use :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>`. Note that writing files in the executable path only works if the executable is placed in a writable location (i.e. **not** Program Files or another directory that is read-only for regular users).
de: Der portable Modus wird in exportierten Projekten noch nicht unterstützt. Um Dateien relativ zum Pfad der ausführbaren Datei zu lesen und zu schreiben, verwenden Sie :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>`. Beachten Sie, dass das Schreiben von Dateien im Pfad der ausführbaren Datei nur funktioniert, wenn die ausführbare Datei an einem beschreibbaren Ort liegt (d.h. **nicht** Programmdateien oder ein anderes Verzeichnis, das für normale Benutzer schreibgeschützt ist).
zh_tw: 匯出後的專案目前不支援自包含模式。要對相對於可執行檔路徑的檔進行讀寫，請使用 :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>`。注意，只有可執行檔位於可寫的位置時，才能夠對可執行檔路徑上的檔進行寫操作（即**不在** Program Files 或者其他普通使用者唯讀的目錄中）。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
