Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/runtime_file_loading_and_saving.po
Languages: de

source: Runtime file loading and saving
de: Laden und Speichern von Dateien zur Laufzeit

source: See :ref:`doc_saving_games` for information on saving and loading game progression.
de: Siehe :ref:`doc_saving_games` für Informationen zum Speichern und Laden von Spielverläufen.

source: Sometimes, :ref:`exporting packs, patches, and mods <doc_exporting_pcks>` is not ideal when you want players to be able to load user-generated content in your project. It requires users to generate a PCK or ZIP file through the Godot editor, which contains resources imported by Godot.
de: Manchmal ist :ref:`Exportieren von Packs, Patches und Mods <doc_exporting_pcks>` nicht ideal, wenn Sie möchten, dass Spieler in der Lage sind, von Benutzern erstellte Inhalte in Ihr Projekt zu laden. Es erfordert, dass Benutzer eine PCK- oder ZIP-Datei über den Godot-Editor erzeugen, die von Godot importierte Ressourcen enthält.

source: Example use cases for runtime file loading and saving include:
de: Beispiele für das Laden und Speichern von Dateien zur Laufzeit sind:

source: Loading texture packs designed for the game.
de: Laden von für das Spiel entwickelten Texturpaketen.

source: Loading user-provided audio tracks and playing them back in an in-game radio station.
de: Laden von benutzerdefinierten Audiotracks und deren Wiedergabe in einem spielinternen Radiosender.

source: Loading custom levels or 3D models that can be designed with any 3D DCC that can export to glTF (including glTF scenes saved by Godot at runtime).
de: Laden von benutzerdefinierten Levels oder 3D-Modellen, die mit jedem 3D-DCC entworfen werden können, das nach glTF exportieren kann (einschließlich glTF-Szenen, die von Godot zur Laufzeit gespeichert werden).

source: Using user-provided fonts for menus and HUD.
de: Verwendung von benutzerdefinierten Schriftarten für Menüs und HUD.

source: Saving/loading a file format that can contain multiple files but can still easily be read by other applications (ZIP).
de: Speichern/Laden eines Dateiformats, das mehrere Dateien enthalten kann, aber dennoch leicht von anderen Anwendungen gelesen werden kann (ZIP).

source: Loading files created by another game or program, or even game data files from another game not made with Godot.
de: Laden von Dateien, die von einem anderen Spiel oder Programm erstellt wurden, oder sogar von Spieldatendateien aus einem anderen, nicht mit Godot erstellten Spiel.

source: Runtime file loading can be combined with :ref:`HTTP requests <doc_http_request_class>` to load resources from the Internet directly.
de: Das Laden von Dateien zur Laufzeit kann mit :ref:`HTTP-Anfragen <doc_http_request_class>` kombiniert werden, um Ressourcen direkt aus dem Internet zu laden.

source: Do **not** use this runtime loading approach to load resources that are part of the project, as it's less efficient and doesn't allow benefiting from Godot's resource handling functionality (such as translation remaps). See :ref:`doc_import_process` for details.
de: Verwenden Sie **nicht** diesen Ansatz zum Laden von Ressourcen, die Teil des Projekts sind, da er weniger effizient ist und es nicht erlaubt, von Godots Ressourcen-Handling-Funktionen (wie z.B. Übersetzungs-Remaps) zu profitieren. Siehe :ref:`doc_import_process` für Details.

source: You can see how saving and loading works in action using the `Run-time File Saving and Loading (Serialization) demo project <https://github.com/godotengine/godot-demo-projects/blob/master/loading/runtime_save_load>`__.
de: Sie können sehen, wie das Speichern und Laden in Aktion funktioniert, indem Sie das `Run-time File Saving and Loading (Serialization)-Demoprojekt <https://github.com/godotengine/godot-demo-projects/blob/master/loading/runtime_save_load>`__ verwenden.

source: Plain text and binary files
de: Klartext- und Binärdateien

source: Godot's :ref:`class_FileAccess` class provides methods to access files on the filesystem for reading and writing:
de: Die Klasse :ref:`class_FileAccess` von Godot bietet Methoden für den Zugriff auf Dateien im Dateisystem zum Lesen und Schreiben:

source: To handle custom binary formats (such as loading file formats not supported by Godot), :ref:`class_FileAccess` provides several methods to read/write integers, floats, strings and more. These FileAccess methods have names that start with ``get_`` and ``store_``.
de: Um benutzerdefinierte Binärformate zu handhaben (wie z.B. das Laden von Dateiformaten, die von Godot nicht unterstützt werden), bietet :ref:`class_FileAccess` mehrere Methoden zum Lesen/Schreiben von Integers, Floats, Strings und mehr. Diese FileAccess-Methoden haben Namen, die mit ``get_`` und ``store_`` beginnen.

source: If you need more control over reading binary files or need to read binary streams that are not part of a file, :ref:`class_PackedByteArray` provides several helper methods to decode/encode series of bytes to integers, floats, strings and more. These PackedByteArray methods have names that start with ``decode_`` and ``encode_``. See also :ref:`doc_binary_serialization_api`.
de: Wenn Sie mehr Kontrolle über das Lesen von Binärdateien benötigen oder Binär-Streams lesen müssen, die nicht Teil einer Datei sind, bietet :ref:`class_PackedByteArray` mehrere Hilfsmethoden zum Dekodieren/Enkodieren von Bytefolgen in Integern, Floats, Strings und mehr. Diese PackedByteArray-Methoden haben Namen, die mit ``decode_`` und ``encode_`` beginnen. Siehe auch :ref:`doc_binary_serialization_api`.

source: Images
de: Bilder

source: Image's :ref:`Image.load_from_file <class_Image_method_load_from_file>` static method handles everything, from format detection based on file extension to reading the file from disk.
de: Die statische Methode :ref:`Image.load_from_file <class_Image_method_load_from_file>` von Image übernimmt alles, von der Formaterkennung anhand der Dateierweiterung bis zum Lesen der Datei von der Festplatte.

source: If you need error handling or more control (such as changing the scale a SVG is loaded at), use one of the following methods depending on the file format:
de: Wenn Sie eine Fehlerbehandlung oder mehr Kontrolle benötigen (z. B. das Ändern des Maßstabs, mit dem ein SVG geladen wird), verwenden Sie je nach Dateiformat eine der folgenden Methoden:

source: :ref:`Image.load_svg_from_buffer <class_Image_method_load_svg_from_buffer>` or :ref:`Image.load_svg_from_string <class_Image_method_load_svg_from_string>`
de: :ref:`Image.load_svg_from_buffer <class_Image_method_load_svg_from_buffer>` oder :ref:`Image.load_svg_from_string <class_Image_method_load_svg_from_string>`

source: Several image formats can also be saved by Godot at runtime using the following methods:
de: Verschiedene Bildformate können von Godot auch zur Laufzeit mit den folgenden Methoden gespeichert werden:

source: :ref:`Image.save_png <class_Image_method_save_png>` or :ref:`Image.save_png_to_buffer <class_Image_method_save_png_to_buffer>`
de: :ref:`Image.save_png <class_Image_method_save_png>` oder :ref:`Image.save_png_to_buffer <class_Image_method_save_png_to_buffer>`

source: :ref:`Image.save_webp <class_Image_method_save_webp>` or :ref:`Image.save_webp_to_buffer <class_Image_method_save_webp_to_buffer>`
de: :ref:`Image.save_webp <class_Image_method_save_webp>` oder :ref:`Image.save_webp_to_buffer <class_Image_method_save_webp_to_buffer>`

source: :ref:`Image.save_jpg <class_Image_method_save_jpg>` or :ref:`Image.save_jpg_to_buffer <class_Image_method_save_jpg_to_buffer>`
de: :ref:`Image.save_jpg <class_Image_method_save_jpg>` oder :ref:`Image.save_jpg_to_buffer <class_Image_method_save_jpg_to_buffer>`

source: :ref:`Image.save_exr <class_Image_method_save_exr>` or :ref:`Image.save_exr_to_buffer <class_Image_method_save_exr_to_buffer>` *(only available in editor builds, cannot be used in exported projects)*
de: :ref:`Image.save_exr <class_Image_method_save_exr>` oder :ref:`Image.save_exr_to_buffer <class_Image_method_save_exr_to_buffer>` *(nur in Editor-Builds verfügbar, kann nicht in exportierten Projekten verwendet werden)*

source: The methods with the ``to_buffer`` suffix save the image to a PackedByteArray instead of the filesystem. This is useful to send the image over the network or into a ZIP archive without having to write it on the filesystem. This can increase performance by reducing I/O utilization.
de: Die Methoden mit dem Suffix ``to_buffer`` speichern das Bild in einem PackedByteArray anstelle des Dateisystems. Dies ist nützlich, um das Bild über das Netzwerk oder in ein ZIP-Archiv zu senden, ohne es in das Dateisystem schreiben zu müssen. Dies kann die Leistung durch eine geringere I/O-Auslastung erhöhen.

source: If displaying the loaded image on a 3D surface, make sure to call :ref:`Image.generate_mipmaps <class_Image_method_generate_mipmaps>` so that the texture doesn't look grainy when viewed at a distance. This is also useful in 2D when following instructions on :ref:`reducing aliasing when downsampling <doc_multiple_resolutions_reducing_aliasing_on_downsampling>`.
de: Wenn Sie das geladene Bild auf einer 3D-Oberfläche anzeigen, stellen Sie sicher, :ref:`Image.generate_mipmaps <class_Image_method_generate_mipmaps>` aufzurufen, damit die Textur nicht körnig aussieht, wenn sie aus der Ferne betrachtet wird. Dies ist auch in 2D nützlich, wenn man den Anweisungen in :ref:`Reduzierung von Aliasing beim Downsampling <doc_multiple_resolutions_reducing_aliasing_on_downsampling>` folgt.

source: Example of loading an image and displaying it in a :ref:`class_TextureRect` node (which requires conversion to :ref:`class_ImageTexture`):
de: Beispiel für das Laden eines Bildes und dessen Anzeige in einem :ref:`class_TextureRect`-Node (was eine Umwandlung in :ref:`class_ImageTexture` erfordert):

source: Audio/video files
de: Audio-/Videodateien

source: Godot supports loading Ogg Vorbis audio at runtime. Note that not *all* files with an ``.ogg`` extension may be Ogg Vorbis files. Some may be Ogg Theora videos, or contain Opus audio within an Ogg container. These files will **not** load correctly as audio files in Godot.
de: Godot unterstützt das Laden von Ogg Vorbis-Audio zur Laufzeit. Beachten Sie dass nicht *alle* Dateien mit einer ``.ogg``-Dateiendung Ogg Vorbis-Dateien sein können. Einige können Ogg Theora-Videos sein oder Opus-Audio innerhalb eines Ogg Containers. Diese Dateien werden **nicht** korrekt als Audiodateien in Godot geladen.

source: Example of loading an Ogg Vorbis audio file in an :ref:`class_AudioStreamPlayer` node:
de: Beispiel für das Laden einer Ogg Vorbis-Audiodatei in einen :ref:`class_AudioStreamPlayer`-Node:

source: Example of loading an Ogg Theora video file in a :ref:`class_VideoStreamPlayer` node:
de: Beispiel für das Laden einer Ogg Theora-Videodatei in einen :ref:`class_VideoStreamPlayer`-Node:

source: Godot doesn't support runtime loading of MP3 or WAV files yet. Until this is implemented, it's feasible to implement runtime WAV loading using a script since :ref:`class_AudioStreamWAV`'s ``data`` property is exposed to scripting.
de: Godot unterstützt noch nicht das Laden von MP3- oder WAV-Dateien während der Laufzeit. Bis dies implementiert ist, ist es möglich, das Laden von WAV-Dateien zur Laufzeit mit einem Skript zu implementieren, da die Property ``data`` von :ref:`class_AudioStreamWAV` für Skripte zugänglich ist.

source: It's still possible to *save* WAV files using :ref:`AudioStreamWAV.save_to_wav <class_AudioStreamWAV_method_save_to_wav>`, which is useful for procedurally generated audio or microphone recordings.
de: Es ist immer noch möglich, WAV-Dateien mit :ref:`AudioStreamWAV.save_to_wav <class_AudioStreamWAV_method_save_to_wav>` zu *speichern*, was für prozedural generiertes Audio oder Mikrofonaufnahmen nützlich ist.

source: 3D scenes
de: 3D-Szenen

source: Godot has first-class support for glTF 2.0, both in the editor and exported projects. Using :ref:`class_gltfdocument` and :ref:`class_gltfstate` together, Godot can load and save glTF files in exported projects, in both text (``.gltf``) and binary (``.glb``) formats. The binary format should be preferred as it's faster to write and smaller, but the text format is easier to debug.
de: Godot hat erstklassige Unterstützung für glTF 2.0, sowohl im Editor als auch in exportierten Projekten. Mit :ref:`class_gltfdocument` und :ref:`class_gltfstate` zusammen kann Godot glTF-Dateien in exportierten Projekten laden und speichern, sowohl im Text- (``.gltf``) als auch im Binärformat (``.glb``). Das binäre Format sollte bevorzugt werden, da es schneller zu schreiben und kleiner ist, aber das Textformat ist einfacher zu debuggen.

source: Example of loading a glTF scene and appending its root node to the scene:
de: Beispiel für das Laden einer glTF-Szene und das Anhängen ihres Root-Nodes an die Szene:

source: When loading a glTF scene, a *base path* must be set so that external resources like textures can be loaded correctly. When loading from a file, the base path is automatically set to the folder containing the file. When loading from a buffer, this base path must be manually set as there is no way for Godot to infer this path.
de: Beim Laden einer glTF-Szene muss ein *Basispfad* festgelegt werden, damit externe Ressourcen wie Texturen korrekt geladen werden können. Beim Laden aus einer Datei wird der Basispfad automatisch auf den Ordner gesetzt, der die Datei enthält. Beim Laden aus einem Puffer muss dieser Basispfad manuell gesetzt werden, da es für Godot keine Möglichkeit gibt, diesen Pfad zu ermitteln.

source: To set the base path, set :ref:`GLTFState.base_path <class_GLTFState_property_base_path>` on your GLTFState instance *before* calling :ref:`GLTFDocument.append_from_buffer <class_GLTFDocument_method_append_from_buffer>` or :ref:`GLTFDocument.append_from_file <class_GLTFDocument_method_append_from_file>`.
de: Um den Basispfad zu setzen, setzen Sie :ref:`GLTFState.base_path <class_GLTFState_property_base_path>` auf Ihrer GLTFState-Instanz *vor* dem Aufruf von :ref:`GLTFDocument. append_from_buffer <class_GLTFDocument_method_append_from_buffer>` oder :ref:`GLTFDocument.append_from_file <class_GLTFDocument_method_append_from_file>`.

source: Fonts
de: Schriftarten

source: :ref:`FontFile.load_dynamic_font <class_FontFile_method_load_bitmap_font>` supports the following font file formats: TTF, OTF, WOFF, WOFF2, PFB, PFM
de: :ref:`FontFile.load_dynamic_font <class_FontFile_method_load_bitmap_font>` unterstützt die folgenden Schriftdateiformate: TTF, OTF, WOFF, WOFF2, PFB, PFM

source: On the other hand, :ref:`FontFile.load_bitmap_font <class_FontFile_method_load_bitmap_font>` supports the `BMFont <https://www.angelcode.com/products/bmfont/>`__ format (``.fnt`` or ``.font``).
de: Andererseits unterstützt :ref:`FontFile.load_bitmap_font <class_FontFile_method_load_bitmap_font>` das Format `BMFont <https://www.angelcode.com/products/bmfont/>`__ (``.fnt`` oder ``.font``).

source: Additionally, it is possible to load any font that is installed on the system using Godot's support for :ref:`doc_using_fonts_system_fonts`.
de: Zusätzlich ist es möglich, jede Schriftart zu laden, die auf dem System installiert ist, indem man Godots Unterstützung für :ref:`doc_using_fonts_system_fonts` nutzt.

source: Example of loading a font file automatically according to its file extension, then adding it as a theme override to a :ref:`class_Label` node:
de: Beispiel für das automatische Laden einer Schriftartdatei anhand ihrer Dateierweiterung und anschließendes Hinzufügen als Theme-Überschreibung zu einem :ref:`class_Label` Node:

source: ZIP archives
de: ZIP-Archive

source: Godot supports reading and writing ZIP archives using the :ref:`class_zipreader` and :ref:`class_zippacker` classes. This supports any ZIP file, including files generated by Godot's "Export PCK/ZIP" functionality (although these will contain imported Godot resources rather than the original project files).
de: Godot unterstützt das Lesen und Schreiben von ZIP-Archiven unter Verwendung der Klassen :ref:`class_zipreader` und :ref:`class_zippacker`. Dies unterstützt jede ZIP-Datei, einschließlich Dateien, die von Godots "Export PCK/ZIP"-Funktionalität erzeugt wurden (obwohl diese importierte Godot-Ressourcen und nicht die ursprünglichen Projektdateien enthalten).

source: Use :ref:`ProjectSettings.load_resource_pack <class_ProjectSettings_method_load_resource_pack>` to load PCK or ZIP files exported by Godot as :ref:`additional data packs <doc_exporting_pcks>`. That approach is preferred for DLCs, as it makes interacting with additional data packs seamless (virtual filesystem).
de: Verwenden Sie :ref:`ProjectSettings.load_resource_pack <class_ProjectSettings_method_load_resource_pack>`, um von Godot exportierte PCK- oder ZIP-Dateien als :ref:`zusätzliche Datenpakete ermöglicht <doc_exporting_pcks>` zu laden. Dieser Ansatz wird für DLCs bevorzugt, da er eine nahtlose Interaktion mit zusätzlichen Datenpaketen ermöglicht (virtuelles Dateisystem).

source: This ZIP archive support can be combined with runtime image, 3D scene and audio loading to provide a seamless modding experience without requiring users to go through the Godot editor to generate PCK/ZIP files.
de: Diese ZIP-Archiv-Unterstützung kann mit dem Laden von Bildern, 3D-Szenen und Audiodateien zur Laufzeit kombiniert werden, um ein nahtloses Modding-Erlebnis zu ermöglichen, ohne dass die Benutzer den Godot-Editor zur Erstellung von PCK/ZIP-Dateien durchlaufen müssen.

source: Example that lists files in a ZIP archive in an :ref:`class_ItemList` node, then writes contents read from it to a new ZIP archive (essentially duplicating the archive):
de: Beispiel, das die Dateien in einem ZIP-Archiv in einem :ref:`class_ItemList` Node auflistet und dann den daraus gelesenen Inhalt in ein neues ZIP-Archiv schreibt (und damit das Archiv dupliziert):

source: Translation status
de: Übersetzungsstatus
