Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/saving_games.po
Languages: de, zh_cn, zh_tw

source: Saving games
de: Spielestände speichern
zh_cn: 保存游戏
zh_tw: 保存遊戲

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: Save games can be complicated. For example, it may be desirable to store information from multiple objects across multiple levels. Advanced save game systems should allow for additional information about an arbitrary number of objects. This will allow the save function to scale as the game grows more complex.
de: Das Behandeln von Spielständen kann komplex sein. So kann es zum Beispiel wünschenswert sein, Informationen von mehreren Objekten über mehrere Levels hinweg zu speichern. Fortgeschrittene Spielespeichersysteme sollten zusätzliche Informationen über eine beliebige Anzahl von Objekten ermöglichen. Dadurch kann die Speicherfunktion skaliert werden, wenn das Spiel komplexer wird.
zh_cn: 保存游戏可能很复杂. 比如, 我们可能会想要储存跨多个关卡的多个物品的信息. 更高级的保存游戏可能需要存储关于具有任意数量的对象的附加信息. 当游戏变得更加复杂时, 这将让保存函数可以随着游戏一同变得更加复杂.
zh_tw: 保存遊戲可能很複雜. 比如, 我們可能會想要儲存跨多個關卡的多個物品的資訊. 更高級的保存遊戲可能需要儲存關於具有任意數量的物件的附加資訊. 當遊戲變得更加複雜時, 這將讓保存函式可以隨著遊戲一同變得更加複雜.

source: If you're looking to save user configuration, you can use the :ref:`class_ConfigFile` class for this purpose.
de: Wenn Sie die Benutzerkonfiguration speichern möchten, können Sie zu diesem Zweck die Klasse :ref:`class_ConfigFile` verwenden.
zh_cn: 如果你想保存玩家的设置，可以用 :ref:`class_ConfigFile` 来实现这个目的。
zh_tw: 如果你想保存玩家的設定，可以用 :ref:`class_ConfigFile` 來實作這個目的。

source: You can see how saving and loading works in action using the `Saving and Loading (Serialization) demo project <https://github.com/godotengine/godot-demo-projects/blob/master/loading/serialization>`__.
de: Sie können sehen, wie das Speichern und Laden in Aktion funktioniert, indem Sie das `Speichern und Laden (Serialisierung) Demo-Projekt <https://github.com/godotengine/godot-demo-projects/blob/master/loading/serialization>`__ verwenden.
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Identify persistent objects
de: Identifizieren beständiger Objekte
zh_cn: 识别持久化对象
zh_tw: 識別持久化物件

source: Firstly, we should identify what objects we want to keep between game sessions and what information we want to keep from those objects. For this tutorial, we will use groups to mark and handle objects to be saved, but other methods are certainly possible.
de: Erstens sollten wir ermitteln, welche Objekte wir zwischen den Spielsitzungen behalten möchten und welche Informationen wir von diesen Objekten behalten möchten. Für dieses Tutorial verwenden wir Gruppen, um zu speichernde Objekte zu markieren und zu behandeln, aber andere Methoden sind genauso möglich.
zh_cn: 首先，我们应该确定在游戏会话中要保存那些对象，以及我们要保存这些对象中的哪些信息。本教程中，我们将使用“分组”来标记和处理要保存的对象，但当然也有其他可行的方法。
zh_tw: 首先，我們應該確定在遊戲會話中要保存那些物件，以及我們要保存這些物件中的哪些資訊。本教學中，我們將使用“群組”來標記和處理要保存的物件，但當然也有其他可行的方法。

source: We will start by adding objects we wish to save to the "Persist" group. We can do this through either the GUI or script. Let's add the relevant nodes using the GUI:
de: Wir beginnen mit dem Hinzufügen von Objekten, die wir der Gruppe "Persist" speichern möchten. Dies können wir entweder über die GUI oder das Skript tun. Fügen wir die entsprechenden Nodes mithilfe der GUI hinzu:
zh_cn: 首先我们将想要保存的对象添加到“Persist”组。我们既可以通过 GUI 也可以通过脚本完成此操作。让我们使用 GUI 来添加相关节点吧：
zh_tw: 首先我們將想要保存的物件新增到“Persist”組。我們既可以通過 GUI 也可以通過腳本完成此操作。讓我們使用 GUI 來新增相關節點吧：

source: Once this is done, when we need to save the game, we can get all objects to save them and then tell them all to save with this script:
de: Sobald dies erledigt ist und wir das Spiel speichern müssen, können wir alle Objekte dazu bringen, sie zu speichern und ihnen dann sagen, dass sie mit diesem Skript speichern sollen:
zh_cn: 完成这个操作后，我们需要保存游戏时，就可以获取所有需要保存的对象，然后通过这个脚本让这些对象去保存数据：
zh_tw: 完成這個操作後，我們需要保存遊戲時，就可以獲取所有需要保存的物件，然後通過這個腳本讓這些物件去保存資料：

source: Serializing
de: Serialisierung
zh_cn: 序列化
zh_tw: 序列化

source: The next step is to serialize the data. This makes it much easier to read from and store to disk. In this case, we're assuming each member of group Persist is an instanced node and thus has a path. GDScript has helper class :ref:`JSON<class_json>` to convert between dictionary and string, Our node needs to contain a save function that returns this data. The save function will look like this:
de: Der nächste Schritt ist die Serialisierung der Daten. Dies erleichtert das Auslesen und Speichern auf der Festplatte. In diesem Fall gehen wir davon aus, dass jedes Mitglied der Gruppe Persist ein instanziierter Node ist und somit einen Pfad hat. GDScript verfügt über die Hilfsklasse :ref:`JSON<class_json>`, um zwischen Dictionary und String zu konvertieren. Unser Node muss eine Speicherfunktion enthalten, die diese Daten zurückgibt. Die Speicherfunktion wird wie folgt aussehen:
zh_tw: 下一步是序列化資料。這使得從硬碟讀取資料和儲存資料到硬碟變得更加容易。在這種情況下, 我們假設 Persist 組的每個成員都是一個產生實體的節點，因此它們都有一個路徑。GDScript 有相關的輔助函式，如 :ref:`to_json() <class_@GDScript_method_to_json>` 和 :ref:`parse_json() <class_@GDScript_method_parse_json>`，所以我們使用 Dictionary 來表示資料。我們的節點需要包含一個返回 Dictionary 的保存函式。保存函式看上去大概會像這樣：

source: This gives us a dictionary with the style ``{ "variable_name":value_of_variable }``, which will be useful when loading.
de: So erhalten wir ein Dictionary in der Form ``{ "variable_name":value_of_variable }``, das beim Laden nützlich sein wird.
zh_cn: 我们得到一个样式为 ``{ "variable_name":that_variables_value }`` 的字典, 它在加载游戏数据时会被用到.
zh_tw: 我們得到一個樣式為 ``{ "variable_name":that_variables_value }`` 的字典, 它在載入遊戲資料時會被用到.

source: Saving and reading data
de: Daten speichern und einlesen
zh_cn: 保存和读取数据
zh_tw: 保存和讀取資料

source: As covered in the :ref:`doc_filesystem` tutorial, we'll need to open a file so we can write to it or read from it. Now that we have a way to call our groups and get their relevant data, let's use the class :ref:`JSON<class_json>` to convert it into an easily stored string and store them in a file. Doing it this way ensures that each line is its own object, so we have an easy way to pull the data out of the file as well.
de: Wie im :ref:`doc_filesystem`-Tutorial behandelt, müssen wir eine Datei öffnen, damit wir in sie schreiben oder aus ihr lesen können. Da wir nun eine Möglichkeit haben, unsere Gruppen aufzurufen und ihre relevanten Daten zu erhalten, verwenden wir die Klasse :ref:`JSON<class_json>`, um sie in einen einfach zu speichernden String umzuwandeln und ihn in einer Datei zu speichern. Auf diese Weise wird sichergestellt, dass jede Zeile ein eigenes Objekt ist, so dass wir die Daten auch leicht aus der Datei herausholen können.
zh_tw: 正如在 :ref:`doc_filesystem` 教學中所述, 我們需要打開一個檔來向其中寫入或讀取資料. 既然我們有辦法呼叫我們的組並獲取它們的相關資料, 那麼就讓我們使用 :ref:`to_json() <class_@GDScript_method_to_json>` 將資料轉換成一個容易儲存的字串並將它儲存在檔中吧. 這樣做可以確保每一行都是一個完整的物件的資訊, 這樣的話將資料從檔中提取出來也會更加容易.

source: Game saved! Now, to load, we'll read each line. Use the :ref:`parse<class_JSON_method_parse>` method to read the JSON string back to a dictionary, and then iterate over the dict to read our values. But we'll need to first create the object and we can use the filename and parent values to achieve that. Here is our load function:
de: Spiel gespeichert! Um das Spiel zu laden, lesen wir nun jede Zeile. Verwenden Sie die Methode :ref:`parse<class_JSON_method_parse>`, um den JSON-String zurück in ein Dictionary zu lesen, und iterieren Sie dann über das Dictionary, um unsere Werte zu lesen. Aber wir müssen zuerst das Objekt erstellen, und wir können den Dateinamen und die Parent-Werte verwenden, um das zu erreichen. Hier ist unsere Ladefunktion:
zh_tw: 遊戲保存好了！ 載入也很簡單. 為此, 我們將讀取每一行, 使用parse_json() 將其讀回到一個字典中, 然後走訪字典以讀取保存的值. 首先我們需要建立物件, 這可以通過使用檔案名和父值來實作. 這就是我們的載入函式:

source: Now we can save and load an arbitrary number of objects laid out almost anywhere across the scene tree! Each object can store different data depending on what it needs to save.
de: Jetzt können wir eine beliebige Anzahl von Objekten speichern und laden, die fast überall im Szenenbaum angeordnet sind! Jedes Objekt kann unterschiedliche Daten speichern, je nachdem was benötigt wird.
zh_cn: 现在我们可以保存和加载几乎任何位于场景树中的任意数量的对象了！ 每个对象可以根据需要保存的内容存储不同的数据.
zh_tw: 現在我們可以保存和載入幾乎任何位於場景樹中的任意數量的物件了！ 每個物件可以根據需要保存的內容儲存不同的資料.

source: Some notes
de: Einige Anmerkungen
zh_cn: 一些注释
zh_tw: 一些注釋

source: We have glossed over setting up the game state for loading. It's ultimately up to the project creator where much of this logic goes. This is often complicated and will need to be heavily customized based on the needs of the individual project.
de: Wir haben die Einrichtung des Spielzustands für das Laden nur am Rande erwähnt. Es ist letztendlich Sache des Projektentwicklers, wo ein Großteil dieser Logik hingeht. Dies ist oft kompliziert und muss je nach den Bedürfnissen des einzelnen Projekts stark angepasst werden.
zh_cn: 我们可能忽略了 "将游戏状态设置到适合以加载数据" 这一步. 最终, 这一步怎么做的决定权在项目创建者手里. 这通常很复杂, 需要根据单个项目的需求对此步骤进行大量定制.
zh_tw: 我們可能忽略了 "將遊戲狀態設定到適合以載入資料" 這一步. 最終, 這一步怎麼做的決定權在專案建立者手裡. 這通常很複雜, 需要根據單個專案的需求對此步驟進行大量定制.

source: Additionally, our implementation assumes no Persist objects are children of other Persist objects. Otherwise, invalid paths would be created. To accommodate nested Persist objects, consider saving objects in stages. Load parent objects first so they are available for the :ref:`add_child() <class_node_method_add_child>` call when child objects are loaded. You will also need a way to link children to parents as the :ref:`NodePath <class_nodepath>` will likely be invalid.
de: Außerdem geht unsere Implementierung davon aus, dass keine Persist-Objekte Child-Objekte von anderen Persist-Objekten sind. Andernfalls würden ungültige Pfade entstehen. Um verschachtelte Persist-Objekte unterzubringen, sollten Sie das Speichern von Objekten in Stufen erwägen. Laden Sie zuerst die Parent-Objekte, damit sie für den Aufruf :ref:`add_child() <class_node_method_add_child>` zur Verfügung stehen, wenn die Child-Objekte geladen werden. Sie brauchen auch eine Möglichkeit, Child-Objekte mit Parent-Objekten zu verknüpfen, da der :ref:`NodePath <class_nodepath>` wahrscheinlich ungültig sein wird.
zh_cn: 另外, 此实现假定没有Persist对象是其他Persist对象的子对象. 否则会产生无效路径. 如果这是项目的需求之一, 可以考虑分阶段保存对象(父对象优先), 以便在加载子对象时可用它们将确保它们可用于 :ref:`add_child() <class_node_method_add_child>` 调用. 由于 :ref:`NodePath <class_nodepath>` 可能无效, 因此可能还需要某种方式将子项链接到父项.
zh_tw: 另外, 此實作假定沒有Persist物件是其他Persist物件的子物件. 否則會產生無效路徑. 如果這是專案的需求之一, 可以考慮分階段保存物件(父物件優先), 以便在載入子物件時可用它們將確保它們可用於 :ref:`add_child() <class_node_method_add_child>` 呼叫. 由於 :ref:`NodePath <class_nodepath>` 可能無效, 因此可能還需要某種方式將子項鍊接到父項.

source: JSON vs binary serialization
de: JSON vs. binäre Serialisierung
zh_cn: JSON 与二进制序列化
zh_tw: 二進位序列化 API

source: For simple game state, JSON may work and it generates human-readable files that are easy to debug.
de: Für einfache Spielzustände kann JSON funktionieren und erzeugt menschenlesbare Dateien, die leicht zu debuggen sind.
zh_cn: 简单的游戏状态可能可以使用 JSON，生成的是人类可读的文件，便于调试。
zh_tw: 對於簡單的遊戲狀態，JSON 可能會起作用，並且它會產生易於除錯的人類可讀檔案。

source: But JSON has many limitations. If you need to store more complex game state or a lot of it, :ref:`binary serialization<doc_binary_serialization_api>` may be a better approach.
de: Aber JSON hat viele Einschränkungen. Wenn Sie komplexere Spielzustände oder viele davon speichern müssen, ist :ref:`binary serialization<doc_binary_serialization_api>` vielleicht ein besserer Ansatz.
zh_cn: 但是 JSON 也存在限制。如果你需要存储比较复杂的游戏状态，或者量比较大，使用\ :ref:`二进制序列化 <doc_binary_serialization_api>`\ 可能更合适。
zh_tw: 但 JSON 有很多限制。如果您需要儲存更複雜的遊戲狀態或大量遊戲狀態，二進位序列化<doc_binary_serialization_api>`可能是更好的方法。

source: JSON limitations
de: JSON-Beschränkungen
zh_cn: JSON 的限制
zh_tw: 限制

source: Here are some important gotchas to know about when using JSON.
de: Hier sind einige wichtige Stolpersteine, die bei der Verwendung von JSON zu beachten sind.
zh_cn: 以下是一些使用 JSON 时会遇到的大坑。
zh_tw: 以下是使用 JSON 時需要了解的一些重要問題。

source: **Filesize:** JSON stores data in text format, which is much larger than binary formats.
de: **Dateigröße:** JSON speichert Daten im Textformat, das viel größer ist als Binärformate.
zh_cn: **文件大小：**\ JSON 使用文本格式存储数据，比二进制格式要大很多。
zh_tw: **檔案大小：** JSON 以文字格式儲存資料，比二進位格式大得多。

source: **Data types:** JSON only offers a limited set of data types. If you have data types that JSON doesn't have, you will need to translate your data to and from types that JSON can handle. For example, some important types that JSON can't parse are: ``Vector2``, ``Vector3``, ``Color``, ``Rect2``, and ``Quaternion``.
de: **Datentypen:** JSON bietet nur eine begrenzte Anzahl von Datentypen. Wenn Sie Datentypen haben, die JSON nicht kennt, müssen Sie Ihre Daten in und aus Typen übersetzen, die JSON verarbeiten kann. Einige wichtige Typen, die JSON nicht parsen kann, sind zum Beispiel: ``Vector2``, ``Vector3``, ``Color``, ``Rect2``, und ``Quaternion``.
zh_cn: **数据类型：**\ JSON 只提供了有限的数据类型。如果你用到了 JSON 没有的数据类型，就需要自己在这个类型和 JSON 能够处理的类型之间来回转换。例如 JSON 无法解析以下重要的类型：\ ``Vector2``\ 、\ ``Vector3``\ 、\ ``Color``\ 、\ ``Rect2``\ 、\ ``Quaternion``\ 。
zh_tw: **資料型別：** JSON 僅提供一組有限的資料型別。如果您擁有 JSON 沒有的資料型別，則需要在資料與 JSON 可以處理的型別之間進行轉換。例如，JSON 無法解析的一些重要型別是：``Vector2``、``Vector3``、``Color``、``Rect2`` 和``Quaternion``。

source: **Custom logic needed for encoding/decoding:** If you have any custom classes that you want to store with JSON, you will need to write your own logic for encoding and decoding those classes.
de: **Benutzerdefinierte Logik für Kodierung/Dekodierung erforderlich:** Wenn Sie benutzerdefinierte Klassen haben, die Sie mit JSON speichern möchten, müssen Sie Ihre eigene Logik für die Kodierung und Dekodierung dieser Klassen schreiben.
zh_cn: **编解码需要自定义逻辑：**\ 如果你想要用 JSON 存储自定义的类，就需要自己编写这些类的编解码逻辑。
zh_tw: **編碼/解碼所需的自訂邏輯：** 如果您有任何想要使用 JSON 儲存的自訂類，您將需要編寫自己的邏輯來編碼和解碼這些類別。

source: Binary serialization
de: Binäre Serialisierung
zh_cn: 二进制序列化
zh_tw: 在地化

source: :ref:`Binary serialization<doc_binary_serialization_api>` is an alternative approach for storing game state, and you can use it with the functions ``get_var`` and ``store_var`` of :ref:`class_FileAccess`.
de: :ref:`Binär-Serialisierung <doc_binary_serialization_api>` ist ein alternativer Ansatz für die Speicherung des Spielstatus und kann mit den Funktionen ``get_var`` und ``store_var`` von :ref:`class_FileAccess` verwendet werden.
zh_cn: 也可以使用\ :ref:`二进制序列化 <doc_binary_serialization_api>`\ 来存储游戏状态，可以使用 :ref:`class_FileAccess`` 的 ``get_var`` 和 ``store_var`` 来实现。
zh_tw: :ref:`二進位序列化<doc_binary_serialization_api>` 是另一種儲存遊戲狀態的方法，您可以將它與 class_FileAccess` 的函式 ``get_var`` 和 ``store_var`` 一起使用。

source: Binary serialization should produce smaller files than JSON.
de: Die binäre Serialisierung sollte kleinere Dateien als JSON erzeugen.
zh_cn: 二进制序列化生成的文件比 JSON 小。
zh_tw: 二進位序列化應該會產生比 JSON 更小的檔案。

source: Binary serialization can handle most common data types.
de: Binäre Serialisierung kann die meisten gängigen Datentypen verarbeiten.
zh_cn: 二进制序列化能够处理大多数常见数据类型。
zh_tw: 二進位序列化可以處理最常見的資料型別。

source: Binary serialization requires less custom logic for encoding and decoding custom classes.
de: Binäre Serialisierung erfordert weniger benutzerdefinierte Logik für die Kodierung und Dekodierung benutzerdefinierter Klassen.
zh_cn: 二进制序列化在编解码自定义类时需要更少的自定义逻辑。
zh_tw: 二進制序列化需要較少的自訂邏輯來編碼和解碼自訂類別。

source: Note that not all properties are included. Only properties that are configured with the :ref:`PROPERTY_USAGE_STORAGE<class_@GlobalScope_constant_PROPERTY_USAGE_STORAGE>` flag set will be serialized. You can add a new usage flag to a property by overriding the :ref:`_get_property_list<class_Object_private_method__get_property_list>` method in your class. You can also check how property usage is configured by calling ``Object._get_property_list``. See :ref:`PropertyUsageFlags<enum_@GlobalScope_PropertyUsageFlags>` for the possible usage flags.
de: Beachten Sie, dass nicht alle Propertys einbezogen werden. Nur Propertys, die mit dem gesetzten :ref:`PROPERTY_USAGE_STORAGE<class_@GlobalScope_constant_PROPERTY_USAGE_STORAGE>`-Flag konfiguriert sind, werden serialisiert. Sie können ein neues Usage-Flag zu einer Property hinzufügen, indem Sie die Methode :ref:`_get_property_list<class_Object_private_method__get_property_list>` in Ihrer Klasse überschreiben. Sie können auch überprüfen, wie die Verwendung von Propertys konfiguriert ist, indem Sie ``Object._get_property_list`` aufrufen. Siehe :ref:`PropertyUsageFlags<enum_@GlobalScope_PropertyUsageFlags>` für die möglichen Usage-Flags.

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
