Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/consoles.po
Languages: de, pt_br, zh_tw

source: Console support in Godot
de: Konsolenunterstützung in Godot
pt_br: Suporte para Consoles em Godot
zh_tw: Godot 支援的主控台應用程式

source: Console porting process
de: Konsolen-Portierungsprozess
pt_br: Processo de portabilidade para consoles
zh_tw: Godot 支援的主控台應用程式

source: In order to develop for consoles in Godot, you need access to the console SDK and export templates for it. These export templates need to be developed either by yourself or someone hired to do it, or provided by a third party company.
de: Um in Godot für Konsolen zu entwickeln, benötigen Sie Zugriff auf das Konsolen-SDK und Exportvorlagen dafür. Diese Exportvorlagen müssen entweder von Ihnen selbst oder von jemandem, der damit beauftragt wurde, entwickelt oder von einem Drittunternehmen bereitgestellt werden.
pt_br: Para desenvolver para consoles em Godot, você precisa de acesso ao SDK do console e modelos de exportação para o mesmo. Estes modelos de exportação precisam desenvolvidos ou por você mesmo ou alguém contratado para fazê-los, ou fornecidos por uma empresa de terceirizada.
zh_tw: 為了在 Godot 中進行控制台開發，您需要存取控制台 SDK 並為其匯出範本。這些匯出範本需要由您自己或僱用的人開發，或由第三方公司提供。

source: Currently, the only console Godot officially supports is Steam Deck (through the official Linux export templates).
de: Die einzige Konsole, die Godot derzeit offiziell unterstützt, ist Steam Deck (über die offiziellen Linux-Exportvorlagen).
pt_br: Atualmente, o único console que o Godot oficialmente suporta é o Steam Deck (através dos modelos de exportação oficiais para Linux).
zh_tw: 目前，Godot 唯一官方支援的控制台是 Steam Deck（透過官方 Linux 匯出模板）。

source: The reason other consoles are not officially supported are:
de: Der Grund, warum andere Konsolen nicht offiziell unterstützt werden, ist folgender:
pt_br: O motivo pelo qual outros consoles não são suportados oficialmente são:
zh_tw: Godot 支援基於 Linux 的 Steam Deck。其他主機尚未獲得官方支援的原因有：

source: To develop for consoles, one must be licensed as a company. As an open source project, Godot has no legal structure to provide console ports.
de: Um für Konsolen zu entwickeln, muss man als Unternehmen lizenziert werden. Als Open-Source-Projekt hat Godot keine rechtliche Struktur, um Konsolenportierungen anzubieten.
pt_br: Para desenvolver para consoles, é preciso ser licenciado como uma empresa. Como um projeto de código aberto, o Godot não tem uma estrutura legal para fornecer portabilidade para consoles.
zh_tw: 要為遊戲機開發遊戲, 必須獲得公司許可. 作為一個開源專案,Godot沒有這樣的法律部分.

source: Console SDKs are secret and covered by non-disclosure agreements. Even if we could get access to them, we could not publish the platform-specific code under an open source license.
de: Konsolen-SDKs sind geheim und unterliegen Geheimhaltungsvereinbarungen. Selbst wenn wir Zugriff auf sie erhielten, könnten wir den plattformspezifischen Code nicht unter einer Open-Source-Lizenz veröffentlichen.
pt_br: SDKs de console são secretas e cobertas por acordos de não-divulgação. Mesmo se pudéssemos conseguir acesso a elas, não poderíamos publicar o código específico da plataforma sob uma licença de código aberto.
zh_tw: 遊戲機的SDK是保密的, 並由保密協定保護. 即使我們可以存取它們, 我們也無法在開源許可下發行特定平臺的程式碼.

source: As explained, however, it is possible to port your games to consoles thanks to services provided by third-party companies.
de: Wie bereits erwähnt, ist es jedoch möglich, Ihre Spiele dank der von Drittanbietern bereitgestellten Dienste auf Konsolen zu portieren.
pt_br: Como explicado, no entanto, ainda é possível portar seus jogos para consoles graças a serviços fornecidos por empresas de terceiros.
zh_tw: 但是，基於協力廠商公司提供的服務，仍然可以將遊戲移植到遊戲機中。

source: In practice, the process is quite similar to Unity and Unreal Engine. In other words, there is no engine that is legally allowed to distribute console export templates without requiring the user to prove that they are a licensed console developer.
de: In der Praxis ist das Verfahren ähnlich wie bei Unity und Unreal Engine. Mit anderen Worten: Es gibt keine Engine, die rechtlich befugt ist, Konsolenexportvorlagen zu vertreiben, ohne dass der Benutzer nachweisen muss, dass er ein lizenzierter Konsolenentwickler ist.
zh_tw: 實際上，這個過程與 Unity 和虛幻引擎十分相似，只是你需要聯繫協力廠商開發者來處理移植過程。換句話說，在法律上，沒有任何一個引擎可以在不要求使用者證明自己是授權的遊戲機開發者的情況下發行遊戲機匯出範本。這樣做會違反遊戲主機製造商的 NDA。

source: Console publishing process
de: Konsolen-Veröffentlichungsprozess
pt_br: Processo de publicação para console
zh_tw: 主機平臺發行流程

source: Regardless of the engine used to create the game, the process to publish a game to a console platform is as follows:
de: Unabhängig von der für die Entwicklung des Spiels verwendeten Engine läuft der Prozess der Veröffentlichung eines Spiels für eine Konsolenplattform folgendermaßen ab:
pt_br: Independentemente do motor usado para criar o jogo, o processo para publicar um jogo para uma plataforma de console é o seguinte:
zh_tw: 無論使用哪種引擎製作遊戲, 將遊戲發行到遊戲主機平臺的流程如下:

source: Register a developer account on the console manufacturer's website, then sign NDAs and publishing contracts. This requires you to have a registered legal entity.
de: Registrieren Sie ein Entwicklerkonto auf der Website des Konsolenherstellers und unterzeichnen Sie dann NDAs und Veröffentlichungsverträge. Dazu müssen Sie eine eingetragene juristische Person sein.
pt_br: Registrar uma conta de desenvolvedor no site da fabricante do console, então assinar acordos de não-divulgação e contratos de publicação. Isso requer que você tenha uma entidade legal registrada.
zh_tw: 在遊戲主機製造商的網站上註冊一個開發者帳號，然後簽署 NDA 和出版合同。這需要你有一個註冊的法人實體。

source: Gain access to the publishing platform by passing the acceptance process. This can take up to several months. Note that this step is significantly easier if an established publisher is backing your game. Nintendo is generally known to be more accepting of smaller developers, but this is not guaranteed.
de: Verschaffen Sie sich Zugang zur Veröffentlichungsplattform, indem Sie das Annahmeverfahren durchlaufen. Dies kann bis zu mehreren Monaten dauern. Beachten Sie, dass dieser Schritt wesentlich einfacher ist, wenn ein etablierter Publisher hinter Ihrem Spiel steht. Nintendo ist im Allgemeinen dafür bekannt, dass es kleinere Entwickler eher akzeptiert, aber es gibt keine Garantie.
pt_br: Obter acesso à plataforma de publicação ao passar no processo de aceitação. Isso pode levar meses. Observe que este passo é significantemente mais fácil se uma publicadora estabelecida está apoiando seu jogo. A Nintendo é geralmente conhecida por aceitar melhor desenvolvedores pequenos, mas isso não é garantido.
zh_tw: 通過驗收程式, 獲得進入出版平臺的機會. 這可能需要長達幾個月的時間. 注意, 如果有成熟的發行商支援你的遊戲, 這一步就會明顯容易很多. 眾所周知, 任天堂通常更接受小型開發商, 但這並不保證.

source: Get access to developer tools and order a console specially made for developers (*devkit*). The cost of those devkits is confidential.
de: Verschaffen Sie sich Zugang zu Entwickler-Tools und bestellen Sie eine speziell für Entwickler entwickelte Konsole (*devkit*). Die Kosten für diese Devkits sind vertraulich.
pt_br: Conseguir acesso a ferramentas de desenvolvedor e encomendar um console especialmente feito para desenvolvedores (*devkit*). O custo desses devkits é confidencial.
zh_tw: 獲得使用開發者工具的許可權，並訂購專門為開發者製作的遊戲主機（*devkit*）。這些 devkit 的費用是保密的。

source: Port the engine to the console platform or pay a company to do it.
de: Portieren Sie die Engine auf die Konsolenplattform oder bezahlen Sie ein Unternehmen dafür.
pt_br: Portar o motor para a plataforma de console ou pagar uma empresa para fazê-lo.
zh_tw: 把引擎移植到遊戲主機平臺上，或者花錢請一家公司來做。

source: To be published, your game needs to be rated in the regions you'd like to sell it in. For example, game ratings are handled by `ESRB <https://www.esrb.org/>`__ in North America, and `PEGI <https://pegi.info/>`__ in Europe. Indie developers can generally get a rating for cheaper compared to more established developers.
de: Um veröffentlicht zu werden, muss Ihr Spiel in den Regionen, in denen Sie es verkaufen möchten, bewertet werden. In Nordamerika wird das Spiel beispielsweise von `ESRB <https://www.esrb.org/>`__ bewertet, in Europa von `PEGI <https://pegi.info/>`__. Indie-Entwickler können in der Regel eine Einstufung für weniger Geld erhalten als etablierte Entwickler.
pt_br: Para ser publicado, seu jogo precisa ser classificado nas regiões em que você deseja vendê-lo. Por exemplo, classificações de jogos são tratadas pela `ESRB <https://www.esrb.org/>`__ na América do Norte, pela `PEGI <https://pegi.info/>`__ na Europa, e pela `ClassInd <https://www.gov.br/mj/pt-br/assuntos/seus-direitos/classificacao-1>`__ no Brasil. Desenvolvedores independentes geralmente podem conseguir uma classificação por um valor menor comparado a desenvolvedores mais estabelecidos.
zh_tw: 要想出版，你的遊戲需要在你想銷售的地區進行評級。例如在北美，`ESRB <https://www.esrb.org/>`__ 處理遊戲評級。在歐洲，這是由 `PEGI <https://pegi.info/>`__ 完成的。與更成熟的開發商相比，獨立開發商通常可以以更低的價格獲得評級。

source: Due to the complexity of the process, many studios and developers prefer to outsource console porting.
de: Aufgrund der Komplexität des Prozesses ziehen es viele Studios und Entwickler vor, die Konsolenportierung auszulagern.
pt_br: Devido à complexidade do processo, muitos estúdios e desenvolvedores preferem terceirizar a portabilidade para consoles.
zh_tw: 由於過程的複雜性，許多工作室和開發者更喜歡外包控制台移植。

source: You can read more about the console publishing process in this article: `Godot and consoles, all you need to know <https://godotengine.org/article/godot-consoles-all-you-need-know/>`__
de: Weitere Informationen über die Veröffentlichung auf Konsolen finden Sie in diesem Artikel: `Godot und Konsolen, alles was Sie wissen müssen <https://godotengine.org/article/godot-consoles-all-you-need-know/>`__
pt_br: Você pode ler mais sobre o processo de publicação para consoles neste artigo (em inglês): `Godot and consoles, all you need to know <https://godotengine.org/article/godot-consoles-all-you-need-know/>`__
zh_tw: 您可以在本文中閱讀有關控制台發布流程的更多資訊：`Godot 和控制台，您需要了解的一切<https://godotengine.org/article/godot-consoles-all-you-need-know/ >`__

source: Third-party support
de: Unterstützung durch Drittanbieter
pt_br: Suporte de terceiros
zh_tw: 協力廠商支援

source: Console ports of Godot are offered by third-party companies (which have ported Godot on their own). These companies also offer publishing of your games to various consoles.
de: Konsolenports von Godot werden von Drittunternehmen angeboten (die Godot selbst portiert haben). Diese Unternehmen bieten auch die Veröffentlichung Ihrer Spiele auf verschiedenen Konsolen an.
pt_br: Portabilidades do Godot para console são oferecidas por empresas de terceiros (que portaram o Godot por conta própria). Estas empresas também oferecem publicação de seus jogos para vários consoles.
zh_tw: 一些協力廠商公司提供將 Godot 移植至遊戲主機的服務（他們已經自己完成了 Godot 的移植工作），另外這些公司還提供在多個遊戲主機平臺的遊戲發行服務。

source: Following is the list of providers:
de: Hier die Liste der Anbieter:
pt_br: Segue uma lista de fornecedoras:
zh_tw: 以下是提供者列表：

source: `Lone Wolf Technology <https://www.lonewolftechnology.com/>`_ offers Switch and Playstation 4 porting and publishing of Godot games.
de: `Lone Wolf Technology <https://www.lonewolftechnology.com/>`_ bietet die Portierung und Veröffentlichung von Godot-Spielen für Switch und Playstation 4 an.
pt_br: A `Lone Wolf Technology <http://www.lonewolftechnology.com/>`_ oferece portabilidade e publicação de jogos em Godot para Switch e PlayStation 4.
zh_tw: `Lone Wolf Technology <http://www.lonewolftechnology.com/>`_ 提供 Switch 和 PS4 的 Godot 遊戲的移植和發行。

source: `Pineapple Works <https://pineapple.works/>`_ offers Switch, Xbox One & Xbox Series X/S (GDK) porting and publishing of Godot games (GDScript/C#).
de: `Pineapple Works <https://pineapple.works/>`_ bietet Switch, Xbox One & Xbox Series X/S (GDK)-Portierung und -Veröffentlichung von Godot-Spielen (GDScript/C#).
pt_br: A `Pineapple Works <https://pineapple.works/>`_ oferece portabilidade e publicação de jogos em Godot (GDScript/C#) para Switch, Xbox One e Xbox Series X/S (GDK).
zh_tw: `Pineapple Works <https://pineapple.works/>`_ 提供 Switch、Xbox One、Xbox Series X/S（GDK）的 Godot 遊戲的移植和發行（GDScript/C#）。

source: `RAWRLAB games <https://www.rawrlab.com/>`_ offers Switch porting of Godot games.
de: `RAWRLAB games <https://www.rawrlab.com/>`_ bietet Switch-Portierungen von Godot-Spielen an.
pt_br: `RAWRLAB games <https://www.rawrlab.com/>`_ oferece a portabilidade para Switch de jogos Godot.
zh_tw: `RAWRLAB games <https://www.rawrlab.com/>`_ 提供 Switch 的 Godot 遊戲的移植。

source: `mazette! games <https://mazette.games/>`_ offers Switch, Xbox One and Xbox Series X/S porting and publishing of Godot games.
de: `mazette! games <https://mazette.games/>`_ bietet Portierung und Veröffentlichung von Godot-Spielen für Switch, Xbox One und Xbox Series X/S an.
pt_br: A `mazette! games <https://mazette.games/>`_ oferece portabilidade e publicação de jogos em Godot para Switch, Xbox One e Xbox Series X/S.
zh_tw: `mazette! games <https://mazette.games/>`_ 提供 Switch、Xbox One、Xbox Series X/S 的 Godot 遊戲的移植和發行。

source: `Olde Sküül <https://oldeskuul.com/>`_ offers Switch, Xbox One, Playstation 4 & Playstation 5 porting and publishing of Godot games.
de: `Olde Sküül <https://oldeskuul.com/>`_ bietet die Portierung und Veröffentlichung von Godot-Spielen für Switch, Xbox One, Playstation 4 & Playstation 5 an.

source: `Tuanisapps <https://www.tuanisapps.com/>`_ offers Switch porting and publishing of Godot games.
de: `Tuanisapps <https://www.tuanisapps.com/>`_ bietet Switch-Portierung und Veröffentlichung von Godot-Spielen.
pt_br: A `Tuanisapps <https://www.tuanisapps.com/>`_ oferece portabilidade e publicação de jogos em Godot para Switch.
zh_tw: `RAWRLAB games <https://www.rawrlab.com/>`_ 提供 Switch 的 Godot 遊戲的移植。

source: Translation status
de: Übersetzungsstatus
pt_br: Progresso da Tradução
zh_tw: 翻譯狀態
