Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/shader_preprocessor.po
Languages: de, ru, zh_tw

source: **Syntax:** ``#else``
ru: **Синтаксис:** ``#else``
zh_tw: **語法：**``#else``

source: Defines the optional block which is included when the previously defined ``#if``, ``#elif``, ``#ifdef`` or ``#ifndef`` directive evaluates to false.
de: Definiert den optionalen Block, der eingeschlossen wird, wenn die zuvor definierte ``#if``-, ``#elif``-, ``#ifdef``- oder ``#ifndef``-Direktive als false ausgewertet wird.
ru: Определяет необязательный блок, который включается, когда ранее определённая директива ``#if``, ``#elif``, ``#ifdef`` или ``#ifndef`` оценивается как false.
zh_tw: 定義當先前定義的「#if」、「#elif」、「#ifdef」或「#ifndef」指令計算結果為 false 時所包含的可選區塊。

source: **Syntax:** ``#endif``
ru: **Синтаксис:** ``#endif``
zh_tw: **語法：**``#endif``

source: Used as terminator for the ``#if``, ``#ifdef``, ``#ifndef`` or subsequent ``#else`` directives.
de: Wird als Endelement für die ``#if``, ``#ifdef``, ``#ifndef`` oder nachfolgende ``#else``-Direktiven verwendet.
ru: Используется в качестве терминатора для директив ``#if``, ``#ifdef``, ``#ifndef`` или последующих ``#else``.
zh_tw: 用作「#if」、「#ifdef」、「#ifndef」或後續「#else」指令的終止符。

source: **Syntax:** ``#include "path"``
de: **Syntax:** ``#include "pfad"``
ru: **Синтаксис:** ``#include "путь"``
zh_tw: **語法：**``#include "路徑"``

source: The ``#include`` directive includes the *entire* content of a shader include file in a shader. ``"path"`` can be an absolute ``res://`` path or relative to the current shader file. Relative paths are only allowed in shaders that are saved to ``.gdshader`` or ``.gdshaderinc`` files, while absolute paths can be used in shaders that are built into a scene/resource file.
de: Die ``#include``-Direktive schließt den *gesamten* Inhalt einer Shader-Include-Datei in einen Shader ein. Der ``pfad`` kann ein absoluter ``res://`` Pfad oder relativ zur aktuellen Shaderdatei sein. Relative Pfade sind nur in Shadern erlaubt, die in ``.gdshader`` oder ``.gdshaderinc`` Dateien gespeichert sind, während absolute Pfade in Shadern verwendet werden können, die in eine Szene/Ressourcendatei eingebaut sind.
ru: Директива ``#include`` включает *полное* содержимое включаемого файла шейдера в шейдер. ``путь`` может быть абсолютным ``res://`` или относительным к текущему файлу шейдера. Относительные пути допустимы только в шейдерах, которые сохраняются в файлах ``.gdshader`` или ``.gdshaderinc``, в то время как абсолютные пути могут использоваться в шейдерах, встроенных в файл сцены/ресурса.
zh_tw: ``#include`` 指令將著色器包含檔案的*整個*內容包含在著色器中。 ``"path"`` 可以是絕對的``res://`` 路徑或相對於目前著色器檔案的路徑。僅允許在儲存至「.gdshader」或「.gdshaderinc」檔案的著色器中使用相對路徑，而絕對路徑可在內建於場景/資源檔案中的著色器中使用。

source: You can create new shader includes by using the **File > Create Shader Include** menu option of the shader editor, or by creating a new :ref:`ShaderInclude<class_ShaderInclude>` resource in the FileSystem dock.
de: Sie können neue Shader-Includes erstellen, indem Sie die Menüoption **Datei > Shader-Include erstellen** des Shader-Editors verwenden oder indem Sie eine neue :ref:`ShaderInclude<class_ShaderInclude>`-Ressource im FileSystem-Dock erstellen.
ru: Вы можете создавать новые шейдерные включения, используя опцию меню **File > Create Shader Include** редактора шейдеров или создав новый ресурс :ref:`ShaderInclude<class_ShaderInclude>` в панели FileSystem.
zh_tw: 您可以使用著色器編輯器的 **檔案 > 建立著色器包含** 選單選項，或透過在檔案系統停靠區中建立新的 ShaderInclude<class_ShaderInclude> 資源來建立新的著色器包含。

source: Shader includes can be included from within any shader, or other shader include, at any point in the file.
de: Shader-Includes können von jedem Shader oder einem anderen Shader-Include aus an jeder beliebigen Stelle der Datei eingefügt werden.
ru: Шейдерные включения могут быть включены в любой шейдер или другой шейдерный элемент в любой точке файла.
zh_tw: 著色器包含可以包含在檔案中任何點的任何著色器或其他著色器包含中。

source: When including shader includes in the global scope of a shader, it is recommended to do this after the initial ``shader_type`` statement.
de: Wenn Sie Shader-Includes in den globalen Bereich eines Shaders aufnehmen, wird empfohlen, dies nach der ersten ``shader_type``-Anweisung zu tun.
ru: При включении шейдерных инклудов в глобальную область видимости шейдера рекомендуется делать это после начального оператора ``shader_type``.
zh_tw: 當著色器包含在著色器的全域範圍中時，建議在初始「shader_type」敘述之後執行此操作。

source: You can also include shader includes from within the body a function. Please note that the shader editor is likely going to report errors for your shader include's code, as it may not be valid outside of the context that it was written for. You can either choose to ignore these errors (the shader will still compile fine), or you can wrap the include in an ``#ifdef`` block that checks for a define from your shader.
de: Sie können Shader-Includes auch innerhalb eines Funktionsrumpfs einbinden. Bitte beachten Sie, dass der Shader-Editor wahrscheinlich Fehler für den Code Ihres Shader-Includes melden wird, da er außerhalb des Kontextes, für den er geschrieben wurde, nicht gültig sein könnte. Sie können diese Fehler entweder ignorieren (der Shader wird trotzdem kompiliert), oder Sie können das Include in einen ``#ifdef``-Block einbinden, der auf eine Definition des Shaders prüft.
ru: Вы также можете включать шейдерные включения в тело функции. Обратите внимание, что редактор шейдеров, скорее всего, сообщит об ошибках для кода вашего шейдерного включения, поскольку он может быть недействительным вне контекста, для которого он был написан. Вы можете либо проигнорировать эти ошибки (шейдер всё равно скомпилируется), либо обернуть include в блок ``#ifdef``, который будет проверять наличие define в шейдере.
zh_tw: 您也可以將著色器包含在主體內的函式中。請注意，著色器編輯器可能會報告著色器包含程式碼的錯誤，因為它在其編寫的本文之外可能無效。您可以選擇忽略這些錯誤（著色器仍然可以正常編譯），也可以將包含內容包裝在「#ifdef」區塊中，該區塊檢查著色器中的定義。

source: ``#include`` is useful for creating libraries of helper functions (or macros) and reducing code duplication. When using ``#include``, be careful about naming collisions, as redefining functions or macros is not allowed.
de: ``#include`` ist nützlich, um Bibliotheken von Hilfsfunktionen (oder Makros) zu erstellen und Code-Duplikation zu reduzieren. Bei der Verwendung von ``#include`` ist auf Namenskollisionen zu achten, da das Umdefinieren von Funktionen oder Makros nicht erlaubt ist.
ru: ``#include`` полезен для создания библиотек вспомогательных функций (или макросов) и сокращения дублирования кода. При использовании ``#include`` будьте осторожны с коллизиями имён, так как переопределение функций или макросов не допускается.
zh_tw: ``#include`` 對於建立輔助函式（或巨集）函式庫和減少程式碼重複很有用。使用“#include”時，請注意命名衝突，因為不允許重新定義函式或巨集。

source: ``#include`` is subject to several restrictions:
de: ``#include`` unterliegt mehreren Einschränkungen:
ru: На ``#include`` наложен ряд ограничений:
zh_tw: ``#include`` 受到幾個限制：

source: Only shader include resources (ending with ``.gdshaderinc``) can be included. ``.gdshader`` files cannot be included by another shader, but a ``.gdshaderinc`` file can include other ``.gdshaderinc`` files.
de: Nur Shader-Include-Ressourcen (mit der Endung ``.gdshaderinc``) können eingebunden werden. ``.gdshader``-Dateien können nicht von einem anderen Shader eingebunden werden, aber eine ``.gdshaderinc``-Datei kann andere ``.gdshaderinc``-Dateien einbinden.
ru: Включать можно только включаемые ресурсы шейдера (заканчивающиеся на ``.gdshaderinc``). Файлы ``.gdshader`` не могут быть включены другим шейдером, но файл ``.gdshaderinc`` может включать другие файлы ``.gdshaderinc``.
zh_tw: 只能包含著色器包含資源（以``.gdshaderinc``結尾）。 ``.gdshader`` 檔案不能被其他著色器包含，但 ``.gdshaderinc`` 檔案可以包含其他 ``.gdshaderinc`` 檔案。

source: Cyclic dependencies are **not** allowed and will result in an error.
de: Zyklische Abhängigkeiten sind **nicht** erlaubt und führen zu einem Fehler.
ru: Циклические зависимости **не** разрешены и приведут к ошибке.
zh_tw: **不允許**允許循環依賴，並且會導致錯誤。

source: To avoid infinite recursion, include depth is limited to 25 steps.
de: Um eine unendliche Rekursion zu vermeiden, ist die Inklusionstiefe auf 25 Schritte begrenzt.
ru: Чтобы избежать бесконечной рекурсии, глубина включения ограничена 25 шагами.
zh_tw: 為了避免無限遞歸，包含深度限制為 25 步。

source: Example shader include file:
de: Beispiel für eine Shader-Include-Datei:
ru: Пример включаемого файла шейдера:
zh_tw: 這樣的例子包含...

source: Example base shader (using the include file we created above):
de: Beispiel für einen Basisshader (unter Verwendung der oben erstellten Include-Datei):
ru: Пример базового шейдера (с использованием файла include, который мы создали выше):
zh_tw: 範例基礎著色器（使用我們上面建立的包含檔案）：

source: **Syntax:** ``#pragma value``
de: **Syntax:** ``#pragma wert``
ru: **Синтаксис:** ``#pragma значение``
zh_tw: **語法：**``#pragma 值``

source: The ``#pragma`` directive provides additional information to the preprocessor or compiler.
de: Die ``#pragma``-Direktive liefert zusätzliche Informationen an den Präprozessor oder Compiler.
ru: Директива ``#pragma`` предоставляет дополнительную информацию препроцессору или компилятору.
zh_tw: ``#pragma`` 指令向預處理器或編譯器提供附加資訊。

source: Currently, it may have only one value: ``disable_preprocessor``. If you don't need the preprocessor, use that directive to speed up shader compilation by excluding the preprocessor step.
de: Derzeit kann sie nur einen Wert haben: ``disable_preprocessor``. Wenn Sie den Präprozessor nicht benötigen, verwenden Sie diese Direktive, um die Shader-Kompilierung zu beschleunigen, indem Sie den Präprozessorschritt weglassen.
ru: В настоящее время она может иметь только одно значение: ``disable_preprocessor``. Если вам не нужен препроцессор, используйте эту директиву, чтобы ускорить компиляцию шейдеров, исключив шаг препроцессора.
zh_tw: 目前，它可能只有一個值：「disable_preprocessor」。如果您不需要預處理器，請使用指令透過排除預處理器步驟來加速著色器編譯。

source: Translation status
de: Übersetzungsstatus
ru: Статус перевода
zh_tw: 翻譯狀態

source: #include
zh_tw: 標頭引用
