Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/shader_preprocessor.po
Languages: de, ru, zh_tw

source: Shader preprocessor
de: Shader-Präprozessor
ru: Шейдерный препроцессор
zh_tw: 著色器前置處理器

source: Why use a shader preprocessor?
de: Warum einen Shader-Präprozessor verwenden?
ru: Зачем нужен шейдерный препроцессор?
zh_tw: 為什麼要使用著色器前置處理器？

source: In programming languages, a *preprocessor* allows changing the code before the compiler reads it. Unlike the compiler, the preprocessor does not care about whether the syntax of the preprocessed code is valid. The preprocessor always performs what the *directives* tell it to do. A directive is a statement starting with a hash symbol (``#``). It is not a *keyword* of the shader language (such as ``if`` or ``for``), but a special kind of token within the language.
de: In Programmiersprachen ermöglicht ein *Präprozessor* die Änderung des Codes, bevor der Compiler ihn liest. Anders als der Compiler kümmert sich der Präprozessor nicht darum, ob die Syntax des vorverarbeiteten Codes gültig ist. Der Präprozessor führt immer das aus, was die *Direktiven* ihm vorgeben. Eine Direktive ist eine Anweisung, die mit einem Rautezeichen (``#``) beginnt. Sie ist kein *Schlüsselwort* der Shader-Sprache (wie ``if`` oder ``for``), sondern eine spezielle Art von Token innerhalb der Sprache.
ru: В языках программирования *препроцессор* позволяет изменить код до того, как его прочитает компилятор. В отличие от компилятора, препроцессор не заботится о том, является ли синтаксис препроцессированного кода правильным. Препроцессор всегда выполняет то, что ему предписывают *директивы*. Директива - это утверждение, начинающееся с хэш-символа (``#``). Это не *ключевое слово* языка шейдеров (такое как ``if`` или ``for``), а особый вид лексем внутри языка.
zh_tw: 在程式語言中，“預處理器”允許在編譯器讀取程式碼之前更改程式碼。與編譯器不同，預處理器不關心預處理程式碼的語法是否有效。預處理器總是執行*指令*告訴它要做的事情。指令是以哈希符號 (``#``) 開頭的敘述。它不是著色器語言的“關鍵字”（例如“if”或“for”），而是語言中的一種特殊型別的標記。

source: From Godot 4.0 onwards, you can use a shader preprocessor within text-based shaders. The syntax is similar to what most GLSL shader compilers support (which in turn is similar to the C/C++ preprocessor).
de: Ab Godot 4.0 können Sie einen Shader-Präprozessor in textbasierten Shadern verwenden. Die Syntax ähnelt dem, was die meisten GLSL-Shader-Compiler unterstützen (was wiederum dem C/C++-Präprozessor ähnelt).
ru: Начиная с Godot 4.0, вы можете использовать шейдерный препроцессор в текстовых шейдерах. Синтаксис похож на тот, который поддерживают большинство компиляторов шейдеров GLSL (которые, в свою очередь, похожи на препроцессор C/C++).
zh_tw: 從 Godot 4.0 開始，您可以在基於文字的著色器中使用著色器預處理器。語法類似於大多數 GLSL 著色器編譯器支援的語法（又類似於 C/C++ 預處理器）。

source: The shader preprocessor is not available in :ref:`visual shaders <doc_visual_shaders>`. If you need to introduce preprocessor statements to a visual shader, you can convert it to a text-based shader using the **Convert to Shader** option in the VisualShader inspector resource dropdown. This conversion is a one-way operation; text shaders cannot be converted back to visual shaders.
de: Der Shader-Präprozessor ist in :ref:`visuellen Shadern <doc_visual_shaders>` nicht verfügbar. Wenn Sie Präprozessoranweisungen in einen visuellen Shader einfügen müssen, können Sie ihn in einen textbasierten Shader konvertieren, indem Sie die Option **In Shader konvertieren** im Ressourcen-Dropdown des VisualShader-Inspektors verwenden. Diese Konvertierung ist eine Einweg-Operation; Text-Shader können nicht zurück in visuelle Shader konvertiert werden.
ru: Препроцессор шейдеров недоступен в :ref:`визуальных шейдерах <doc_visual_shaders>`. Если вам нужно добавить операторы препроцессора в визуальный шейдер, вы можете преобразовать его в текстовый шейдер с помощью опции **Convert to Shader** в выпадающем списке ресурсов инспектора VisualShader. Это преобразование является односторонней операцией; текстовые шейдеры не могут быть преобразованы обратно в визуальные шейдеры.
zh_tw: 著色器預處理器在視覺著色器 <doc_visual_shaders> 中不可用。如果需要將預處理器敘述引入視覺著色器，可以使用 VisualShader 屬性面板資源下拉列表中的 **轉換為著色器** 選項將其轉換為基於文字的著色器。這種轉換是一種單向操作；文字著色器無法轉換回視覺著色器。

source: Directives
de: Direktiven
ru: Директивы
zh_tw: 字典

source: General syntax
de: Allgemeine Syntax
ru: Общий синтаксис
zh_tw: 一般性定義

source: Preprocessor directives do not use brackets (``{}``), but can use parentheses.
de: Präprozessor-Direktiven verwenden keine geschweiften Klammern(``{}``), können aber runde Klammern verwenden.
ru: Директивы препроцессора не используют фигурные скобки (``{}``), но могут использовать круглые скобки.
zh_tw: 前置處理器指令不使用大括弧（``{}``），但會用到括弧。

source: Preprocessor directives **never** end with semicolons (with the exception of ``#define``, where this is allowed but potentially dangerous).
de: Präprozessor-Direktiven enden **nie** mit Semikolons (mit Ausnahme von ``#define``, wo dies erlaubt, aber potentiell gefährlich ist).
ru: Директивы препроцессора **никогда** не заканчиваются точкой с запятой (за исключением ``#define``, где это разрешено, но потенциально опасно).
zh_tw: 前置處理器指令**從不**以分號結尾（除非是 ``#define``，允許這麼做，但是可能比較危險）。

source: Preprocessor directives can span several lines by ending each line with a backslash (``\``). The first line break *not* featuring a backslash will end the preprocessor statement.
de: Präprozessor-Direktiven können sich über mehrere Zeilen erstrecken, indem jede Zeile mit einem Backslash (``\``) abgeschlossen wird. Der erste Zeilenumbruch, der *keinen* Backslash enthält, beendet die Präprozessor-Direktive.
ru: Директивы препроцессора могут занимать несколько строк, завершая каждую строку обратной косой чертой (``\``). Первый разрыв строки, *не* содержащий обратную косую черту, завершает операцию препроцессора.
zh_tw: 預處理器指令可以通過以反斜線 （''\'） 結尾每行來跨越多行。第一個帶有反斜杠的換行符將 *not* 結束預處理器語句。

source: **Syntax:** ``#define <identifier> [replacement_code]``.
de: **Syntax:** ``#define <bezeichner> [ersetzungscode]``.
ru: **Синтаксис:** ``#define <identifier> [заменяемый_код]``.
zh_tw: **語法：**``#define <識別字> [替換程式碼]``.

source: Defines the identifier after that directive as a macro, and replaces all successive occurrences of it with the replacement code given in the shader. Replacement is performed on a "whole words" basis, which means no replacement is performed if the string is part of another string (without any spaces or operators separating it).
de: Definiert den Bezeichner nach dieser Direktive als Makro und ersetzt alle aufeinanderfolgenden Vorkommen durch den im Shader angegebenen Ersetzungscode. Die Ersetzung erfolgt auf der Basis "ganzer Wörter", d.h. es wird keine Ersetzung vorgenommen, wenn der String Teil eines anderen Strings ist (ohne Leerzeichen oder Operatoren als Trennzeichen).
ru: Определяет идентификатор после этой директивы как макрос и заменяет все последующие его вхождения на код замены, указанный в шейдере. Замена выполняется по принципу "целых слов", то есть замена не выполняется, если строка является частью другой строки (без пробелов и операторов, разделяющих её).

source: Defines with replacements may also have one or more *arguments*, which can then be passed when referencing the define (similar to a function call).
de: Defines mit Ersetzungen können auch ein oder mehrere *Argumente* haben, die dann beim Verweis auf das Define übergeben werden können (ähnlich wie bei einem Funktionsaufruf).
ru: Определения с заменой могут также иметь один или несколько *аргументов*, которые могут передаваться при обращении к определению (подобно вызову функции).
zh_tw: 帶有替換的定義也可能有一個或多個*參數*，然後可以在引用定義時傳遞這些參數（類似於函式呼叫）。

source: If the replacement code is not defined, the identifier may only be used with ``#ifdef`` or ``#ifndef`` directives.
de: Wenn der Ersetzungscode nicht definiert ist, darf der Bezeichner nur mit ``#ifdef`` oder ``#ifndef``-Direktiven verwendet werden.
ru: Если код замены не определён, идентификатор можно использовать только с директивами ``#ifdef`` или ``#ifndef``.
zh_tw: 如果未定義替換程式碼，則識別碼只能與「#ifdef」或「#ifndef」指令一起使用。

source: If the *concatenation* symbol (``##``) is present in the replacement code then it will be removed upon macro insertion, together with any space surrounding it, and join the surrounding words and arguments into a new token.
de: Wenn das *Verkettungs*-Symbol (``##``) im Ersetzungscode vorhanden ist, wird es beim Einfügen des Makros zusammen mit einem etwaigen umgebenden Leerzeichen entfernt und die umgebenden Wörter und Argumente zu einem neuen Token zusammengefügt.
ru: Если в коде замены присутствует символ *конкатенации* (``##``), то при вставке макроса он будет удалён вместе с окружающим его пробелом и объединит окружающие слова и аргументы в новую лексему.

source: Compared to constants (``const CONSTANT = value;``), ``#define`` can be used anywhere within the shader (including in uniform hints). ``#define`` can also be used to insert arbitrary shader code at any location, while constants can't do that.
de: Im Vergleich zu Konstanten (``const CONSTANT = value;``) kann ``#define`` an jeder beliebigen Stelle innerhalb des Shaders verwendet werden (auch in Uniform-Hints). ``#define`` kann auch verwendet werden, um beliebigen Shadercode an jeder beliebigen Stelle einzufügen, während dies bei Konstanten nicht möglich ist.
ru: По сравнению с константами (``const CONSTANT = value;``), ``#define`` можно использовать в любом месте шейдера (в том числе в унифицированных подсказках). ``#define`` также можно использовать для вставки произвольного кода шейдера в любое место, в то время как константы этого делать не могут.
zh_tw: 與常數（``const CONSTANT = value;``）相比，``#define`` 可以在著色器中的任何位置使用（包括在均勻提示中）。 ``#define`` 也可以用於在任何位置插入任意著色器程式碼，而常數則不能這樣做。

source: Defining a ``#define`` for an identifier that is already defined results in an error. To prevent this, use ``#undef <identifier>``.
de: Die Definition eines ``#define`` für einen Bezeichner, der bereits definiert ist, führt zu einem Fehler. Um dies zu verhindern, verwenden Sie ``#undef <bezeichner>``.
ru: Определение ``#define`` для идентификатора, который уже определён, приводит к ошибке. Чтобы предотвратить это, используйте ``#undef <identifier>``.
zh_tw: 為已定義的標識符定義“#define”會導致錯誤。為了防止這種情況，請使用``#undef <identifier>``。

source: **Syntax:** ``#undef identifier``
de: **Syntax:** ``#undef bezeichner``
ru: **Синтаксис:** ``#undef identifier``
zh_tw: **語法：**``#undef 識別字``

source: The ``#undef`` directive may be used to cancel a previously defined ``#define`` directive:
de: Die ``#undef``-Direktive kann verwendet werden, um eine zuvor definierte ``#define``-Direktive zu beenden:
ru: Директива ``#undef`` может быть использована для отмены ранее определённой директивы ``#define``:
zh_tw: “#undef”指令可用來取消先前定義的“#define”指令：

source: Without ``#undef`` in the above example, there would be a macro redefinition error.
de: Ohne ``#undef`` im obigen Beispiel würde es einen Fehler bei der Neudefinition des Makros geben.
ru: Если бы в приведённом выше примере не было ``#undef``, то возникла бы ошибка переопределения макроса.
zh_tw: 上例中如果沒有“#undef”，就會出現巨集重定義錯誤。

source: **Syntax:** ``#if <condition>``
de: **Syntax:** ``#if <bedingung>``
ru: **Синтаксис:** ``#if <условие>``
zh_tw: **語法：**``#if <條件>``

source: The ``#if`` directive checks whether the ``condition`` passed. If it evaluates to a non-zero value, the code block is included, otherwise it is skipped.
de: Die ``#if``-Direktive prüft, ob die ``bedingung`` erfüllt ist. Wenn sie einen Wert ungleich Null ergibt, wird der Codeblock verwendet, andernfalls wird er übersprungen.
ru: Директива ``#if`` проверяет, прошло ли ``условие``. Если оно оценивается в ненулевое значение, блок кода включается, в противном случае он пропускается.
zh_tw: ``#if`` 指令檢查``condition`` 是否通過。如果其計算結果為非零值，則包含該程式碼區塊，否則將跳過該程式碼區塊。

source: To evaluate correctly, the condition must be an expression giving a simple floating-point, integer or boolean result. There may be multiple condition blocks connected by ``&&`` (AND) or ``||`` (OR) operators. It may be continued by a ``#else`` block, but **must** be ended with the ``#endif`` directive.
de: Um korrekt ausgewertet zu werden, muss die Bedingung ein Ausdruck sein, der ein einfaches Float-, Integer- oder boolesches Ergebnis liefert. Es kann mehrere Bedingungsblöcke geben, die mit den Operatoren ``&&`` (AND) oder ``||`` (OR) verbunden sind. Er kann durch einen ``#else``-Block fortgesetzt werden, muss aber mit der Anweisung ``#endif`` abgeschlossen werden.
ru: Для правильной оценки условие должно быть выражением, дающим простой результат с плавающей точкой, целым числом или логическим значением. Может быть несколько блоков условия, связанных операторами ``&&`` (AND) или ``||`` (OR). Условие может быть продолжено блоком ``#else``, но **обязательно** должно быть завершено директивой ``#endif``.
zh_tw: 為了正確計算，條件必須是給出簡單浮點、整數或布林結果的表達式。可能有多個條件區塊透過「&&」（AND）或「||」（OR）運算子連接。它可以由「#else」區塊繼續，但**必須**以「#endif」指令結束。

source: Using the ``defined()`` *preprocessor function*, you can check whether the passed identifier is defined a by ``#define`` placed above that directive. This is useful for creating multiple shader versions in the same file. It may be continued by a ``#else`` block, but must be ended with the ``#endif`` directive.
de: Mit Hilfe der ``defined()`` *Präprozessorfunktion* können Sie überprüfen, ob der übergebene Bezeichner durch das ``#define`` definiert ist, das über dieser Direktive steht. Dies ist nützlich, um mehrere Shaderversionen in der gleichen Datei zu erstellen. Sie kann durch einen ``#else`` Block fortgesetzt werden, muss aber mit der ``#endif``-Direktive beendet werden.
ru: Используя *препроцессорную функцию* ``defined()``, вы можете проверить, определён ли переданный идентификатор директивой ``#define``, расположенной над этой директивой. Это полезно для создания нескольких версий шейдеров в одном файле. Она может быть продолжена блоком ``#else``, но должна быть завершена директивой ``#endif``.
zh_tw: 使用“define()”*預處理器函式*，您可以檢查傳遞的識別碼是否由放置在該指令上方的“#define”定義。這對於在同一檔案中建立多個著色器版本非常有用。它可以由“#else”區塊繼續，但必須以“#endif”指令結束。

source: The ``defined()`` function's result can be negated by using the ``!`` (boolean NOT) symbol in front of it. This can be used to check whether a define is *not* set.
de: Das Ergebnis der Funktion ``defined()`` kann mit dem vorangestellten Symbol ``!`` (boolesches NOT) negiert werden. Dies kann verwendet werden, um zu prüfen, ob ein Define *nicht* gesetzt ist.
ru: Результат функции ``defined()`` можно отрицать, используя перед ним символ ``!`` (логическое НЕТ). Это можно использовать для проверки того, что define *не* задан.
zh_tw: ``define()`` 函式的結果可以透過在其前面使用 ``!`` （布爾 NOT）符號來求反。這可用於檢查定義是否“未”設定。

source: Be careful, as ``defined()`` must only wrap a single identifier within parentheses, never more:
de: Seien Sie vorsichtig, da ``defined()`` nur einen einzigen Bezeichner in Klammern einschließen darf, niemals mehr:
ru: Будьте осторожны, так как ``defined()`` должен заключать в круглые скобки только один идентификатор, и никогда больше:
zh_tw: 請小心，因為「define()」只能將單一標識符括在括號內，不能再多了：

source: In the shader editor, preprocessor branches that evaluate to ``false`` (and are therefore excluded from the final compiled shader) will appear grayed out. This does not apply to run-time ``if`` statements.
de: Im Shader-Editor werden Präprozessor-Zweige, die als ``falsch`` ausgewertet werden (und daher vom endgültigen kompilierten Shader ausgeschlossen sind), ausgegraut dargestellt. Dies gilt nicht für ``if``-Anweisungen zur Laufzeit.
ru: В редакторе шейдеров ветви препроцессора, которые оцениваются как ``false`` (и поэтому исключаются из окончательно скомпилированного шейдера), будут отображаться серым цветом. Это не относится к операторам ``if'' во время выполнения.
zh_tw: 在著色器編輯器中，評估為「false」的預處理器分支（因此從最終編譯的著色器中排除）將顯示為灰色。這不適用於運作時“if”敘述。

source: **#if preprocessor versus if statement: Performance caveats**
de: **#if-Präprozessor vs. if-Anweisung: Performance-Hinweise**
ru: **Препроцессор #if в сравнении с оператором if: Предостережения по производительности**
zh_tw: **#if 預處理器與 if 敘述：效能警告**

source: The :ref:`shading language <doc_shading_language>` supports run-time ``if`` statements:
de: Die :ref:`Shading-Sprache <doc_shading_language>` unterstützt ``if``-Anweisungen zur Laufzeit:
ru: :ref:`Язык шейдеров <doc_shading_language>` поддерживает операторы ``if`` во время выполнения:
zh_tw: :ref:`著色語言 <doc_shading_language>` 支援執行時期 ``if`` 敘述：

source: If the uniform is never changed, this behaves identical to the following usage of the ``#if`` preprocessor statement:
de: Wenn das Uniform nie geändert wird, verhält sich dies genauso wie die folgende Verwendung der ``#if``-Präprozessoranweisung:
ru: Если uniform-переменная никогда не изменяется, это поведение идентично следующему использованию оператора препроцессора ``#if``:
zh_tw: 如果制服從未改變，則其行為與「#if」預處理器敘述的以下用法相同：

source: However, the ``#if`` variant can be faster in certain scenarios. This is because all run-time branches in a shader are still compiled and variables within those branches may still take up register space, even if they are never run in practice.
de: Die ``#if``-Variante kann jedoch in bestimmten Szenarien schneller sein. Das liegt daran, dass alle Laufzeitverzweigungen in einem Shader immer noch kompiliert werden und die Variablen innerhalb dieser Verzweigungen immer noch Registerplatz belegen können, auch wenn sie in der Praxis nie ausgeführt werden.
ru: Однако вариант ``#if`` может быть быстрее в некоторых сценариях. Это связано с тем, что все ветви времени выполнения в шейдере всё равно компилируются, и переменные в этих ветвях могут занимать место в регистре, даже если они никогда не будут выполняться на практике.
zh_tw: 然而，“#if”變體在某些情況下可能會更快。這是因為著色器中的所有運作時分支仍然被編譯，並且這些分支中的變數可能仍然佔用寄存器空間，即使它們在實踐中從未運作。

source: Modern GPUs are `quite effective <https://medium.com/@jasonbooth_86226/branching-on-a-gpu-18bfc83694f2>`__ at performing "static" branching. "Static" branching refers to ``if`` statements where *all* pixels/vertices evaluate to the same result in a given shader invocation. However, high amounts of :abbr:`VGPRs (Vector General-Purpose Register)` (which can be caused by having too many branches) can still slow down shader execution significantly.
de: Moderne GPUs sind `recht effektiv <https://medium.com/@jasonbooth_86226/branching-on-a-gpu-18bfc83694f2>`__ bei der Durchführung von "statischen" Verzweigungen. "Statische" Verzweigungen beziehen sich auf ``if``-Anweisungen, bei denen *alle* Pixel/Vertices bei einem bestimmten Shader-Aufruf das gleiche Ergebnis liefern. Allerdings können große Mengen von :abbr:`VGPRs (Vector General-Purpose Register)` (die durch zu viele Verzweigungen verursacht werden können) die Shader-Ausführung immer noch erheblich verlangsamen.
ru: Современные графические процессоры `достаточно эффективно <https://medium.com/@jasonbooth_86226/branching-on-a-gpu-18bfc83694f2>`__ выполняют "статическое" ветвление. Под "статическим" ветвлением подразумеваются операторы ``if``, в которых *все* пиксели/вершины вычисляются одинаково при данном вызове шейдера. Однако большое количество :abbr:`VGPRs (Vector General-Purpose Register)` (которое может быть вызвано слишком большим количеством ветвлений) всё ещё может значительно замедлить выполнение шейдера.
zh_tw: 現代 GPU 在執行「靜態」分支方面「非常有效」<https://medium.com/@jasonbooth_86226/branching-on-a-gpu-18bfc83694f2>」。 「靜態」分支是指「if」敘述，其中*所有*像素/頂點在給定著色器呼叫中計算結果相同。然而，大量的 VGPR（向量通用暫存器）（這可能是由於分支過多引起的）仍然會顯著減慢著色器的執行速度。

source: The ``#elif`` directive stands for "else if" and checks the condition passed if the above ``#if`` evaluated to ``false``. ``#elif`` can only be used within an ``#if`` block. It is possible to use several ``#elif`` statements after an ``#if`` statement.
de: Die Anweisung ``#elif`` steht für "else if" und prüft die Bedingung, die übergeben wird, wenn die obige ``#if`` als ``false`` ausgewertet wird. ``#elif`` kann nur innerhalb eines ``#if``-Blocks verwendet werden. Es ist möglich, mehrere ``#elif``-Anweisungen nach einer ``#if``-Anweisung zu verwenden.
ru: Директива ``#elif`` расшифровывается как "else if" и проверяет условие, переданное, если вышеприведенное ``#if`` равняется ``false``. Директива ``#elif`` может использоваться только внутри блока ``#if``. Можно использовать несколько операторов ``#elif`` после оператора ``#if``.
zh_tw: “#elif” 指令代表“else if”，並檢查如果上述“#if” 計算結果為“false” 則傳遞的條件。 ``#elif`` 只能在``#if`` 區塊中使用。在「#if」敘述之後可以使用多個「#elif」敘述。

source: Like with ``#if``, the ``defined()`` preprocessor function can be used:
de: Wie bei ``#if`` kann die Präprozessorfunktion ``defined()`` verwendet werden:
ru: Как и в случае с ``#if``, можно использовать функцию препроцессора ``defined()``:
zh_tw: 與“#if”一樣，可以使用“define()”預處理器函式：

source: **Syntax:** ``#ifdef <identifier>``
de: **Syntax:** ``#ifdef <bezeichner>``
ru: **Синтаксис:** ``#ifdef <identifier>``
zh_tw: **語法：**``#ifdef <識別字>``

source: This is a shorthand for ``#if defined(...)``. Checks whether the passed identifier is defined by ``#define`` placed above that directive. This is useful for creating multiple shader versions in the same file. It may be continued by a ``#else`` block, but must be ended with the ``#endif`` directive.
de: Dies ist eine Kurzform für ``#if defined(...)``. Prüft, ob der übergebene Bezeichner durch ein ``#define`` definiert ist, das über dieser Direktive steht. Dies ist nützlich, um mehrere Shaderversionen in der gleichen Datei zu erzeugen. Sie kann durch einen ``#else`` Block fortgesetzt werden, muss aber mit der ``#endif`` Direktive beendet werden.
ru: Это сокращение для ``#if defined(...)``. Проверяет, определён ли переданный идентификатор директивой ``#define``, расположенной над этой директивой. Это полезно для создания нескольких версий шейдеров в одном файле. Она может быть продолжена блоком ``#else``, но должна быть завершена директивой ``#endif``.
zh_tw: 這是「#if Defined(...)」的簡寫。檢查傳遞的標識符是否由位於該指令上方的“#define”定義。這對於在同一檔案中建立多個著色器版本非常有用。它可以由“#else”區塊繼續，但必須以“#endif”指令結束。

source: The processor does *not* support ``#elifdef`` as a shortcut for ``#elif defined(...)``. Instead, use the following series of ``#ifdef`` and ``#else`` when you need more than two branches:
de: Der Prozessor unterstützt *nicht* ``#elifdef`` als Abkürzung für ``#elif defined(...)``. Verwenden Sie stattdessen die folgende Reihe von ``#ifdef`` und ``#else``, wenn Sie mehr als zwei Verzweigungen benötigen:
ru: Процессор *не* поддерживает ``#elifdef`` как сокращение для ``#elif defined(...)``. Вместо этого используйте следующие серии ``#ifdef`` и ``#else``, если вам нужно более двух ветвей:
zh_tw: 處理器*不*支援「#elifdef」作為「#elif Defined(...)」的捷徑。相反，當您需要兩個以上的分支時，請使用以下系列的“#ifdef”和“#else”：

source: **Syntax:** ``#ifndef <identifier>``
de: **Syntax:** ``#ifndef <bezeichner>``
ru: **Синтаксис:** ``#ifndef <идентификатор>``
zh_tw: **語法：**``#ifndef <識別字>``

source: This is a shorthand for ``#if !defined(...)``. Similar to ``#ifdef``, but checks whether the passed identifier is **not** defined by ``#define`` before that directive.
de: Dies ist eine Kurzform für ``#if !defined(...)``. Ähnlich wie ``#ifdef``, prüft aber, ob der übergebene Bezeichner **nicht** durch ``#define`` vor dieser Direktive definiert ist.
ru: Это сокращение для ``#if !defined(...)``. Аналогично ``#ifdef``, но проверяет, не является ли переданный идентификатор **не** определённым в ``#define`` до этой директивы.
zh_tw: 這是「#if !define(...)」的簡寫。與“#ifdef”類似，但檢查傳遞的標識符是否不是由該指令之前的“#define”定義的。

source: This is the exact opposite of ``#ifdef``; it will always match in situations where ``#ifdef`` would never match, and vice versa.
de: Dies ist das genaue Gegenteil von ``#ifdef``; es wird immer in Situationen passen, in denen ``#ifdef`` niemals passen würde, und andersherum.
ru: Это полная противоположность ``#ifdef``; он всегда будет соответствовать в ситуациях, в которых ``#ifdef`` никогда не будет соответствовать, и наоборот.
zh_tw: 這與“#ifdef”完全相反；在“#ifdef”永遠不會配對的情況下它總是配對，反之亦然。
