Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/sky_shader.po
Languages: de, zh_tw

source: Sky shaders
de: Sky-Shader
zh_tw: 著色器

source: Sky shaders are a special type of shader used for drawing sky backgrounds and for updating radiance cubemaps which are used for image-based lighting (IBL). Sky shaders only have one processing function, the ``sky()`` function.
de: Sky-Shader sind eine spezielle Art von Shader, die zum Zeichnen von Himmelshintergründen und zum Aktualisieren von Strahlungs-Cubemaps verwendet werden, die für die bildbasierte Beleuchtung (IBL) eingesetzt werden. Himmels-Shader haben nur eine Verarbeitungsfunktion, die Funktion ``Sky()``.
zh_tw: 天空著色器是一種特殊型別的著色器，用於繪製天空背景和更新用於基於影像的照明 (IBL) 的輻射立方體貼圖。天空著色器只有一個處理函式，即「sky()」函式。

source: There are three places the sky shader is used.
de: Es gibt drei Stellen, an denen der Sky-Shader verwendet wird.
zh_tw: 有兩個地方可以管理樣板。

source: First the sky shader is used to draw the sky when you have selected to use a Sky as the background in your scene.
de: Zunächst wird der Sky-Shader verwendet, um den Himmel zu zeichnen, wenn Sie einen Himmel als Hintergrund in Ihrer Szene ausgewählt haben.
zh_tw: 首先，當您選擇使用天空作為場景中的背景時，天空著色器用於繪製天空。

source: Second, the sky shader is used to update the radiance cubemap when using the Sky for ambient color or reflections.
de: Zweitens wird der Sky-Shader verwendet, um die Radiance-Cubemap zu aktualisieren, wenn der Himmel für Umgebungsfarben oder Reflexionen verwendet wird.
zh_tw: 其次，當使用天空作為環境顏色或反射時，天空著色器用於更新輻射立方體貼圖。

source: Third, the sky shader is used to draw the lower res subpasses which can be used in the high-res background or cubemap pass.
de: Drittens wird der Sky-Shader verwendet, um die niedriger aufgelösten Subpasses zu zeichnen, die im hochauflösenden Hintergrund oder Cubemap-Pass verwendet werden können.
zh_tw: 第三，天空著色器用於繪製可在高解析度背景或立方體貼圖通道中使用的較低解析度子通道。

source: In total, this means the sky shader can run up to six times per frame, however, in practice it will be much less than that because the radiance cubemap does not need to be updated every frame, and not all subpasses will be used. You can change the behavior of the shader based on where it is called by checking the ``AT_*_PASS`` booleans. For example:
de: Insgesamt bedeutet dies, dass der Sky-Shader bis zu sechsmal pro Frame ausgeführt werden kann. In der Praxis wird es jedoch viel weniger sein, da die Radiance Cubemap nicht bei jedem Frame aktualisiert werden muss und nicht alle Subpasses verwendet werden. Man kann das Verhalten des Shaders ändern, je nachdem, wo er aufgerufen wird, indem man die ``AT_*_PASS`` Booleschen Werte überprüft. Zum Beispiel:
zh_tw: 總的來說，這意味著天空著色器每影格最多可以運作六次，但實際上它會少得多，因為輻射立方體貼圖不需要每影格更新，並且並非所有子通道都會被使用。您可以透過檢查“AT_*_PASS”布林值來根據呼叫位置來變更著色器的行為。例如：

source: When using the sky shader to draw a background, the shader will be called for all non-occluded fragments on the screen. However, for the background's subpasses, the shader will be called for every pixel of the subpass.
de: Wenn Sie den Sky-Shader verwenden, um einen Hintergrund zu zeichnen, wird der Shader für alle nicht verdeckten Fragmente auf dem Bildschirm aufgerufen. Bei den Unter-Durchläufen des Hintergrunds wird der Shader jedoch für jedes Pixel des Unter-Durchlaufs aufgerufen.
zh_tw: 當使用天空著色器繪製背景時，將為螢幕上所有非遮蔽片段呼叫該著色器。但是，對於背景的子通道，將為子通道的每個像素呼叫著色器。

source: When using the sky shader to update the radiance cubemap, the sky shader will be called for every pixel in the cubemap. On the other hand, the shader will only be called when the radiance cubemap needs to be updated. The radiance cubemap needs to be updated when any of the shader parameters are updated. For example, if ``TIME`` is used in the shader, then the radiance cubemap will update every frame. The following list of changes force an update of the radiance cubemap:
de: Wenn Sie den Sky-Shader zur Aktualisierung der Radiance Cubemap verwenden, wird der Sky-Shader für jedes Pixel in der Cubemap aufgerufen. Andererseits wird der Shader nur aufgerufen, wenn die Radiance Cubemap aktualisiert werden muss. Die Radiance Cubemap muss aktualisiert werden, wenn einer der Shader-Parameter aktualisiert wird. Wenn zum Beispiel ``TIME`` im Shader verwendet wird, dann wird die Radiance Cubemap bei jedem Frame aktualisiert. Die folgende Liste von Änderungen erzwingt eine Aktualisierung der Radiance Cubemap:
zh_tw: 當使用天空著色器更新輻射立方體貼圖時，將為立方體貼圖中的每個像素呼叫天空著色器。另一方面，只有當輻射立方體貼圖需要更新時才會呼叫著色器。當任何著色器參數更新時，需要更新輻射立方體貼圖。例如，如果在著色器中使用“TIME”，則輻射立方體貼圖將更新每一影格。以下更改列表強制更新輻射立方體貼圖：

source: ``TIME`` is used.
de: ``TIME`` wird verwendet.
zh_tw: 使用“TIME”。

source: ``POSITION`` is used and the camera position changes.
de: ``POSITION`` wird verwendet und die Kameraposition ändert sich.
zh_tw: 使用“POSITION”並且攝影機位置變化。

source: If any ``LIGHTX_*`` properties are used and any :ref:`DirectionalLight3D <class_DirectionalLight3D>` changes.
de: Wenn irgendwelche ``LIGHTX_*`` Propertys verwendet werden und sich irgendwelche :ref:`DirectionalLight3D <class_DirectionalLight3D>` ändern.
zh_tw: 如果使用任何「LIGHTX_*」屬性且任何:ref:`DirectionalLight3D <class_DirectionalLight3D>`發生變化。

source: If any uniform is changed in the shader.
de: Wenn ein Uniform im Shader geändert wird.
zh_tw: 如果著色器中更改了任何制服。

source: If the screen is resized and either of the subpasses are used.
de: Wenn die Größe des Bildschirms geändert wird und einer der Unter-Durchläufe verwendet wird.
zh_tw: 如果調整螢幕大小並且使用任一子頻道。

source: Try to avoid updating the radiance cubemap needlessly. If you do need to update the radiance cubemap each frame, make sure your :ref:`Sky process mode <class_Sky_property_process_mode>` is set to :ref:`REALTIME <class_Sky_constant_PROCESS_MODE_REALTIME>`.
de: Versuchen Sie, eine unnötige Aktualisierung der Radiance Cubemap zu vermeiden. Wenn Sie die Radiance Cubemap bei jedem Frame aktualisieren müssen, stellen Sie sicher, dass Ihr :ref:`Sky process mode <class_Sky_property_process_mode>` auf :ref:`REALTIME <class_Sky_constant_PROCESS_MODE_REALTIME>` gesetzt ist.
zh_tw: 盡量避免不必要地更新輻射立方體貼圖。如果您確實需要每影格更新輻射立方體貼圖，請確保您的 Sky 處理模式 <class_Sky_property_process_mode>` 設定為 :ref:`REALTIME <class_Sky_constant_PROCESS_MODE_REALTIME>`。

source: Note that the :ref:`process mode <class_Sky_property_process_mode>` only affects the rendering of the radiance cubemap. The visible sky is always rendered by calling the fragment shader for every pixel. With complex fragment shaders, this can result in a high rendering overhead. If the sky is static (the conditions listed above are met) or changes slowly, running the full fragment shader every frame is not needed. This can be avoided by rendering the full sky into the radiance cubemap, and reading from this cubemap when rendering the visible sky. With a completely static sky, this means that it needs to be rendered only once.
de: Beachten Sie, dass der :ref:`Prozessierungmodus <class_Sky_property_process_mode>` nur das Rendering der Radiance Cubemap beeinflusst. Der sichtbare Himmel wird immer durch den Aufruf des Fragment-Shaders für jedes Pixel gerendert. Bei komplexen Fragment-Shadern kann dies zu einem hohen Rendering-Overhead führen. Wenn der Himmel statisch ist (die oben genannten Bedingungen sind erfüllt) oder sich nur langsam ändert, ist es nicht erforderlich, den vollständigen Fragment-Shader für jedes Bild aufzurufen. Dies kann vermieden werden, indem der gesamte Himmel in die Radiance Cubemap gerendert und beim Rendern des sichtbaren Himmels aus dieser Cubemap gelesen wird. Bei einem völlig statischen Himmel bedeutet dies, dass er nur einmal gerendert werden muss.

source: The following code renders the full sky into the radiance cubemap and reads from that cubemap for displaying the visible sky:
de: Der folgende Code rendert den gesamten Himmel in die Radiance Cubemap und liest aus dieser Cubemap den sichtbaren Himmel aus:

source: This way, the complex calculations happen only in the cubemap pass, which can be optimized by setting the sky's :ref:`process mode <class_Sky_property_process_mode>` and the :ref:`radiance size <class_Sky_property_radiance_size>` to get the desired balance between performance and visual fidelity.
de: Auf diese Weise finden die komplexen Berechnungen nur im Cubemap-Durchlauf statt, der durch Einstellen des :ref:`Prozessmodus <class_Sky_property_process_mode>` und der :ref:`Radianzgröße <class_Sky_property_radiance_size>` optimiert werden kann, um die gewünschte Balance zwischen Performance und visueller Wiedergabetreue zu erreichen.

source: Render modes
de: Render-Modi
zh_tw: 算繪模式

source: Subpasses allow you to do more expensive calculations at a lower resolution to speed up your shaders. For example the following code renders clouds at a lower resolution than the rest of the sky:
de: Mit Unter-Durchläufen können Sie aufwändigere Berechnungen mit einer niedrigeren Auflösung durchführen, um Ihre Shader zu beschleunigen. Der folgende Code rendert zum Beispiel die Wolken mit einer niedrigeren Auflösung als den Rest des Himmels:
zh_tw: 子通道可讓您以較低的解析度進行更昂貴的計算，以加快著色器的速度。例如，以下程式碼以低於天空其餘部分的解析度算繪雲：

source: Render mode
de: Rendermodus
zh_tw: 算繪模式

source: Description
de: Beschreibung
zh_tw: 說明

source: Allows the shader to write to and access the half resolution pass.
de: Ermöglicht dem Shader das Schreiben in und den Zugriff auf den Halbe-Auflösungs-Durchlauf.
zh_tw: 允許著色器對半解析度階段進行寫入和存取。

source: Allows the shader to write to and access the quarter resolution pass.
de: Ermöglicht dem Shader das Schreiben in und den Zugriff auf den Viertel-Auflösungs-Durchlauf.
zh_tw: 允許著色器對四分之一解析度階段進行寫入和存取。

source: If used, fog will not affect the sky.
de: Wenn er verwendet wird, hat der Nebel keine Auswirkungen auf den Himmel.
zh_tw: 使用後，霧不會影響天空。

source: Values marked as "in" are read-only. Values marked as "out" are for optional writing and will not necessarily contain sensible values. Samplers cannot be written to so they are not marked.
de: Die als "in" gekennzeichneten Werte sind schreibgeschützt. Mit "out" gekennzeichnete Werte sind zum optionalen Schreiben vorgesehen und enthalten nicht unbedingt sinnvolle Werte. Sampler können nicht beschrieben werden, daher sind sie nicht markiert.
zh_tw: 標記為 "in" 的值是唯讀的. 標記為 "out" 的值是可以選擇寫入的, 不一定包含合理的值. 標記為 "inout" 的值提供一個合理的預設值, 並且可以選擇寫入. 取樣器不是寫入的物件, 它們沒有被標記.

source: Global built-ins
de: Globale Built-ins
zh_tw: 定數

source: Global built-ins are available everywhere, including in custom functions.
de: Globale Built-ins sind überall verfügbar, auch in benutzerdefinierten Funktionen.
zh_tw: 全域內建的功能隨處可見, 包括自訂功能.

source: There are 4 ``LIGHTX`` lights, accessed as ``LIGHT0``, ``LIGHT1``, ``LIGHT2``, and ``LIGHT3``.
de: Es gibt 4 ``LIGHTX``-Lichter, die als ``LIGHT0``, ``LIGHT1``, ``LIGHT2`` und ``LIGHT3`` angesprochen werden.
zh_tw: ``LIGHTX`` 燈光有 4 個，可以通過 ``LIGHT0``、``LIGHT1``、``LIGHT2``、``LIGHT3`` 存取。

source: Global time, in seconds.
de: Globale Zeit in Sekunden.
zh_tw: 全球時間, 以秒為單位.

source: Camera position in world space
de: Kameraposition im World-Space
zh_tw: 相機位置，使用世界空間

source: Radiance cubemap. Can only be read from during background pass. Check ``!AT_CUBEMAP_PASS`` before using.
de: Radiance Cubemap. Kann nur während des Hintergrund-Durchlaufs gelesen werden. Prüfen Sie ``!AT_CUBEMAP_PASS`` vor der Verwendung.
zh_tw: 輻射度立方體貼圖。只能在背景階段讀取。使用前請檢查 ``!AT_CUBEMAP_PASS``。

source: Currently rendering to half resolution pass.
de: Derzeit wird der Halbe-Auflösungs-Durchlauf gerendert.
zh_tw: 目前正在算繪半解析度階段。

source: Currently rendering to quarter resolution pass.
de: Derzeit wird der Viertel-Auflösungs-Durchlauf gerendert.
zh_tw: 目前正在算繪四分之一解析度階段。

source: Currently rendering to radiance cubemap.
de: Derzeit wird in die Radiance Cubemap gerendert.
zh_tw: 目前正在算繪輻射度立方體貼圖。

source: ``LightX`` is visible and in the scene. If ``false``, other light properties may be garbage.
de: ``LightX`` ist sichtbar und in der Szene. Wenn ``false``, können andere Light Propertys Müll sein.
zh_tw: 場景中存在 ``LightX`` 並且可見。如果為 ``false``，則其他燈光屬性可能為垃圾值。

source: Energy multiplier for ``LIGHTX``.
de: Energiemultiplikator für ``LIGHTX``.
zh_tw: ``LIGHTX`` 的能量乘數。

source: Direction that ``LIGHTX`` is facing.
de: Richtung, in die ``LIGHTX`` gerichtet ist.
zh_tw: ``LIGHTX`` 面朝的方向。

source: Color of ``LIGHTX``.
de: Farbe von ``LIGHTX``.
zh_tw: ``LIGHTX`` 的顏色。

source: Angular diameter of ``LIGHTX`` in the sky. Expressed in degrees. For reference, the sun from earth is about 0.5 degrees.
de: Winkeldurchmesser von ``LIGHTX`` am Himmel. Ausgedrückt in Grad. Zum Vergleich: Die Sonne ist von der Erde aus gesehen etwa 0,5 Grad groß.
zh_tw: 天空中“LIGHTX”的角直徑。以度數表示。作為參考，太陽與地球的夾角約為0.5度。

source: A ``PI`` constant (``3.141592``). A ratio of a circle's circumference to its diameter and amount of radians in half turn.
de: Eine ``PI``-Konstante (``3,141592``). Das Verhältnis des Umfangs eines Kreises zu seinem Durchmesser und die Anzahl der Bogenmaßeinheiten in einer halben Umdrehung.
zh_tw: 一個“PI”常數（“3.141592”）。圓的周長與其直徑的比率以及半圈的弧度數。

source: A ``TAU`` constant (``6.283185``). An equivalent of ``PI * 2`` and amount of radians in full turn.
de: Eine ``TAU``-Konstante (``6.283185``). Ein Äquivalent von ``PI * 2`` und die Anzahl der Bogenmaßeinheiten in einer vollen Umdrehung.
zh_tw: 一個“TAU”常數（“6.283185”）。相當於“PI * 2”和完整的弧度數。

source: A ``E`` constant (``2.718281``). Euler's number and a base of the natural logarithm.
de: Eine ``E``-Konstante (``2,718281``). Eulersche Zahl und eine Basis des natürlichen Logarithmus.
zh_tw: 一個“E”常數（“2.718281”）。歐拉數和自然對數的底數。

source: Sky built-ins
de: Himmels-Built-ins
zh_tw: 定數

source: Normalized direction of current pixel. Use this as your basic direction for procedural effects.
de: Normalisierte Richtung des aktuellen Pixels. Verwenden Sie dies als Grundrichtung für prozedurale Effekte.
zh_tw: 目前像素的標準化方向。將此作為程式效果的基本方向。

source: Screen UV coordinate for current pixel. Used to map a texture to the full screen.
de: Bildschirm-UV-Koordinate für das aktuelle Pixel. Wird verwendet, um eine Textur auf den gesamten Bildschirm abzubilden.
zh_tw: 螢幕目前像素的UV座標.

source: Sphere UV. Used to map a panorama texture to the sky.
de: Kugel-UV. Wird verwendet, um eine Panoramatextur auf den Himmel abzubilden.
zh_tw: 球體紫外線。用於將全景紋理對應到天空。

source: Color value of corresponding pixel from half resolution pass. Uses linear filter.
de: Farbwert des entsprechenden Pixels aus dem Halbe-Auflösungs-Durchlauf. Verwendet einen linearen Filter.
zh_tw: 來自半解析度通道的相應像素的顏色值。使用線性濾波器。

source: Color value of corresponding pixel from quarter resolution pass. Uses linear filter.
de: Farbwert des entsprechenden Pixels aus dem Viertel-Auflösungs-Durchlauf. Verwendet einen linearen Filter.
zh_tw: 來自四分之一解析度通道的相應像素的顏色值。使用線性濾波器。

source: Output color.
de: Farbe der Ausgabe.
zh_tw: 輸出顏色。

source: Output alpha value, can only be used in subpasses.
de: Alphawert der Ausgabe, kann nur in Unterdurchläufen verwendet werden.
zh_tw: 輸出 alpha 值，只能在子通道中使用。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Built-ins
zh_tw: 內建

source: Built-in
zh_tw: 內建
