Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/debugging/using_sanitizers.po
Languages: de, zh_tw

source: Using sanitizers
de: Verwendung von Sanitizern
zh_tw: 建立內容

source: What are sanitizers?
de: Was sind Sanitizer?
zh_tw: 什麼是 Sanitizer？

source: Sanitizers are static instrumentation tools that help find bugs that traditional debuggers usually cannot catch. This is particularly useful when combined with :ref:`doc_unit_testing` in continuous integration.
de: Sanitizer sind statische Instrumentierungswerkzeuge, die dabei helfen, Bugs zu finden, die traditionelle Debugger normalerweise nicht aufspüren können. Dies ist besonders nützlich in Kombination mit :ref:`doc_unit_testing` bei der Continuous Integration.
zh_tw: Sanitizer 是一種靜態偵測工具，能夠説明找出傳統除錯器通常無法捕捉的問題。非常適合在持續集成中與 :ref:`doc_unit_testing` 結合使用。

source: Sanitizers can be used on Windows, macOS and Linux by using the Clang (LLVM), GCC or Visual Studio compilers. :ref:`Certain platforms <doc_using_sanitizers_platform_specific_sanitizers>` may also have their own sanitizers available. In situations where a single sanitizer is provided by several different compilers, remember that their output and behavior will differ slightly.
de: Sanitizer können unter Windows, macOS und Linux mit den Compilern Clang (LLVM), GCC oder Visual Studio verwendet werden. :ref:`Bestimmte Plattformen <doc_using_sanitizers_platform_specific_sanitizers>` können auch ihre eigenen Sanitizer zur Verfügung stellen. In Situationen, in denen ein einziger Sanitizer von mehreren verschiedenen Compilern bereitgestellt wird, sollten Sie daran denken, dass sich ihre Ausgabe und ihr Verhalten leicht unterscheiden werden.
zh_tw: 在 Windows、macOS、Linux 平臺使用 Clang（LLVM）、GCC、Visual Studio 編譯器時能夠使用 Sanitizer。:ref:`部分平臺 <doc_using_sanitizers_platform_specific_sanitizers>`可能也可以使用其獨有的 Sanitizer。多種不同的編譯器都提供相同的某種 Sanitizer 時，請記住它們的輸出和行為有可能略有不同。

source: Using sanitizers on Godot
de: Verwendung von Sanitizern in Godot
zh_tw: 在 Godot 中使用 NuGet 套件

source: Sanitizers **require** recompiling the binary. This means you cannot use official Godot binaries to run sanitizers.
de: Sanitizer **erfordern** eine Neukompilierung der Binärdatei. Das bedeutet, dass Sie keine offiziellen Godot-Binärdateien verwenden können, um Sanitizer auszuführen.
zh_tw: Sanitizer **要求**重新編譯二進位檔案。這意味著你無法使用官方 Godot 二進位檔案來運作 Sanitizer。

source: When :ref:`compiling <toc-devel-compiling>` with any of the sanitizers enabled, the resulting binary will have the ``.san`` suffix added to its name to distinguish it from a binary without sanitizers.
de: Wenn einer der Sanitizer beim :ref:`Kompilieren <toc-devel-compiling>` aktiviert ist, bekommt die resultierende Binärdatei das Suffix ``.san`` an ihren Namen angehängt, um sie von einer Binärdatei ohne Sanitizer zu unterscheiden.
zh_tw: 當在啟用任何消毒劑的情況下編譯 <toc-devel-compiling>` 時，生成的二進位檔案將在其名稱中新增``.san`` 後綴，以將其與沒有消毒劑的二進位檔案區分開來。

source: There is a performance impact as many additional runtime checks need to be performed. Memory utilization will also increase. It is possible to enable certain combinations of multiple sanitizers in a single build. Beware of the performance impact when using multiple sanitizers at once though, as the resulting binary may be excessively slow.
de: Dies hat Auswirkungen auf die Performance, da viele zusätzliche Laufzeitprüfungen durchgeführt werden müssen. Auch die Speichernutzung wird sich erhöhen. Es ist möglich, bestimmte Kombinationen von mehreren Sanitizern in einem einzigen Build zu aktivieren. Beachten Sie jedoch die Auswirkungen auf die Performance, wenn Sie mehrere Sanitizer gleichzeitig verwenden, da die resultierende Binärdatei übermäßig langsam sein kann.
zh_tw: 由於需要執行許多額外的運作時檢查，因此會對效能產生影響。記憶體利用率也會增加。可以在單一建構中啟用多種消毒劑的某些組合。不過，請注意同時使用多個消毒劑時的性能影響，因為生成的二進位可能會非常慢。

source: Certain options can be passed to sanitizers without having to recompile the binary using environment variables.
de: Bestimmte Optionen können mit Hilfe von Umgebungsvariablen an Sanitizer übergeben werden, ohne dass die Binärdatei neu kompiliert werden muss.
zh_tw: 某些選項可以傳遞給清理程式，而無需使用環境變數重新編譯二進位。

source: Address sanitizer (ASAN)
de: Adress-Sanitizer (ASAN)
zh_tw: 地址 Sanitizer（ASAN）

source: Available in Clang and GCC.
de: Verfügbar in Clang und GCC.
zh_tw: 與其他腳本語言溝通

source: **Supported platforms:** Linux, macOS, Windows (Visual Studio), Web
de: **Unterstützte Plattformen:** Linux, macOS, Windows (Visual Studio), Web
zh_tw: **支援的平臺：**Linux、macOS、Windows（Visual Studio）、Web

source: `Clang ASAN documentation <https://clang.llvm.org/docs/AddressSanitizer.html>`__
de: `Clang ASAN-Dokumentation <https://clang.llvm.org/docs/AddressSanitizer.html>`__
zh_tw: `Clang ASAN 文件 <https://clang.llvm.org/docs/AddressSanitizer.html>`__

source: The address sanitizer is generally the most frequently used sanitizer. It can diagnose issues such as buffer overruns and out-of-bounds access. If the engine crashes with a message such as ``free(): invalid pointer``, this is typically the result of a buffer overrun. (This message is printed by the C runtime, not Godot.)
de: Der Adress-Sanitizer ist im Allgemeinen der am häufigsten verwendete Sanitizer. Er kann Probleme wie Buffer Overruns und Out-of-Bounds-Zugriffe diagnostizieren. Wenn die Engine mit einer Meldung wie ``free(): invalid pointer`` abstürzt, ist dies typischerweise das Ergebnis eines Buffer Overruns. (Diese Meldung wird von der C-Runtime ausgegeben, nicht von Godot).
zh_tw: 地址消毒劑通常是最常用的消毒劑。它可以診斷緩衝區溢位和越界存取等問題。如果引擎當機並顯示諸如“free()：無效指標”之類的訊息，這通常是緩衝區溢位的結果。 （此訊息是由 C 運作時列印的，而不是 Godot。）

source: In certain situations (such as detecting uninitialized memory reads), the address sanitizer doesn't suffice. The :ref:`doc_using_sanitizers_memory_sanitizer` should be used instead.
de: In bestimmten Situationen (z.B. beim Erkennen von nicht initialisierten Speicherlesevorgängen) reicht der Adress-Sanitizer nicht aus. Stattdessen sollte der :ref:`doc_using_sanitizers_memory_sanitizer` verwendet werden.
zh_tw: 在某些情況下（例如偵測未初始化的記憶體讀取），位址清理程式還不夠。應使用 :ref:`doc_using_sanitizers_memory_sanitizer` 來代替。

source: It is also possible to detect use-after-return situations by specifying the ``ASAN_OPTIONS=detect_stack_use_after_return=1`` environment variable before *running* Godot (not when compiling it). This increases the address sanitizer's runtime overhead, so only enable this feature when you actually need it.
de: Es ist auch möglich, Use-after-return-Situationen zu erkennen, indem man die Umgebungsvariable ``ASAN_OPTIONS=detect_stack_use_after_return=1`` angibt, bevor man Godot *ausführt* (nicht beim Kompilieren). Dies erhöht den Laufzeit-Overhead des Adress-Sanitizers, daher sollten Sie dieses Feature nur aktivieren, wenn Sie es tatsächlich benötigen.
zh_tw: 也可以透過在*執行* Godot 之前（而不是在編譯時）指定「ASAN_OPTIONS=detect_stack_use_after_return=1」環境變數來偵測返回後使用情況。這會增加地址清理程式的運作時開銷，因此僅在實際需要時才啟用此功能。

source: To enable the address sanitizer in a Godot build, pass the ``use_asan=yes`` SCons option when compiling. Enabling ASAN generally makes the resulting binary about 2× slower.
de: Um den Adress-Sanitizer in einem Godot-Build zu aktivieren, übergeben Sie beim Kompilieren die SCons-Option ``use_asan=yes``. Die Aktivierung von ASAN macht die resultierende Binärdatei im Allgemeinen etwa zweimal langsamer.
zh_tw: 若要在 Godot 建置中啟用地址清理程式，請在編譯時傳遞“use_asan=yes”SCons 選項。啟用 ASAN 通常會使產生的二進位檔案變慢約 2 倍。

source: Due to a `design decision <https://stackoverflow.com/questions/36971902/why-cant-clang-enable-all-sanitizers/>`__, the address, memory and thread sanitizers are mutually exclusive. This means you can only use one of those sanitizers in a given binary.
de: Aufgrund einer `Designentscheidung <https://stackoverflow.com/questions/36971902/why-cant-clang-enable-all-sanitizers/>`__ schließen sich die Adress-, Memory- und Thread-Sanitizer gegenseitig aus. Das bedeutet, dass Sie nur einen dieser Sanitizer in einer bestimmten Binärdatei verwenden können.
zh_tw: 由於“設計決策<https://stackoverflow.com/questions/36971902/why-cant-clang-enable-all-sanitizers/>”，位址、記憶體和執行緒清理器是互斥的。這意味著您只能在給定的二進位檔案中使用其中一種消毒劑。

source: Leak sanitizer (LSAN)
zh_tw: 洩漏 Sanitizer（LSAN）

source: **Supported platforms:** Linux, Web
de: **Unterstützte Plattformen:** Linux, Web
zh_tw: 支援所有平台。

source: `Clang LSAN documentation <https://clang.llvm.org/docs/LeakSanitizer.html>`__
de: `Clang LSAN-Dokumentation <https://clang.llvm.org/docs/LeakSanitizer.html>`__
zh_tw: `Clang LSAN 文件 <https://clang.llvm.org/docs/LeakSanitizer.html>`__

source: The leak sanitizer can detect memory leaks, which are situations where memory that is no longer in use is never freed by the running program. This can potentially lead to out-of-memory situations if the program runs for long enough. Since Godot may run on :ref:`dedicated servers <doc_exporting_for_dedicated_servers>` for months or even years without a restart, it's important to fix memory leaks when they occur.
de: Der Leak-Sanitizer kann Speicherleaks aufspüren, d. h. Situationen, in denen Speicher, der nicht mehr verwendet wird, vom laufenden Programm nie freigegeben wird. Dies kann möglicherweise zu Out-of-Memory-Situationen führen, wenn das Programm lange genug läuft. Da Godot auf :ref:`dedizierten Servern <doc_exporting_for_dedicated_servers>` über Monate oder sogar Jahre ohne Neustart laufen kann, ist es wichtig, Speicherleaks zu beheben, wenn sie auftreten.
zh_tw: 洩漏清理程式可以偵測記憶體洩漏，即執行的程式永遠不會釋放不再使用的記憶體的情況。如果程式運作時間夠長，這可能會導致記憶體不足的情況。由於 Godot 可能會在專用伺服器 <doc_exporting_for_dedicated_servers>` 上運作數月甚至數年而無需重新啟動，因此在發生記憶體洩漏時修復記憶體洩漏非常重要。

source: To enable the leak sanitizer in a Godot build, pass the ``use_lsan=yes`` SCons option when compiling. Enabling LSAN only has a small performance overhead, but the program will be much slower to exit as leak detection occurs when the program exits.
de: Um den Leak-Sanitizer in einem Godot-Build zu aktivieren, übergeben Sie beim Kompilieren die SCons-Option ``use_lsan=yes``. Die Aktivierung von LSAN hat nur einen geringen Performance-Overhead, aber das Programm wird viel langsamer beendet, da die Leak-Erkennung beim Beenden des Programms erfolgt.
zh_tw: 若要在 Godot 建置中啟用洩漏清理程式，請在編譯時傳遞「use_lsan=yes」SCons 選項。啟用LSAN只會有很小的效能開銷，但程式退出時會慢很多，因為程式退出時會發生洩漏偵測。

source: Memory sanitizer (MSAN)
zh_tw: 記憶體 Sanitizer（MSAN）

source: Available in Clang only, not GCC.
de: Nur in Clang verfügbar, nicht in GCC.
zh_tw: 僅 Clang 可用，GCC 不可用。

source: **Supported platforms:** Linux
de: **Unterstützte Plattformen:** Linux
zh_tw: 支援所有平台。

source: `Clang MSAN documentation <https://clang.llvm.org/docs/MemorySanitizer.html>`__
de: `Clang MSAN-Dokumentation <https://clang.llvm.org/docs/MemorySanitizer.html>`__
zh_tw: `Clang MSAN 文件 <https://clang.llvm.org/docs/MemorySanitizer.html>`__

source: The memory sanitizer complements the :ref:`doc_using_sanitizers_address_sanitizer`. Unlike the address sanitizer, the memory sanitizer can detect uninitialized memory reads.
de: Der Memory-Sanitizer ergänzt den :ref:`doc_using_sanitizers_address_sanitizer`. Im Gegensatz zum Adress-Sanitizer kann der Memory-Sanitizer nicht-initialisierte Memory Reads erkennen.
zh_tw: 記憶體清理程式是 doc_using_sanitizers_address_sanitizer 的補充。與位址清理程式不同，記憶體清理程式可以偵測未初始化的記憶體讀取。

source: To enable the memory sanitizer in a Godot build, pass the ``use_msan=yes`` SCons option when compiling. Enabling MSAN generally makes the resulting binary about 3× slower.
de: Um den Memory-Sanitizer in einem Godot-Build zu aktivieren, übergeben Sie beim Kompilieren die SCons-Option ``use_msan=yes``. Die Aktivierung von MSAN macht die resultierende Binärdatei im Allgemeinen etwa 3x langsamer.
zh_tw: 若要在 Godot 建置中啟用記憶體清理程式，請在編譯時傳遞「use_msan=yes」SCons 選項。啟用 MSAN 通常會使產生的二進位檔案變慢約 3 倍。

source: Thread sanitizer (TSAN)
zh_tw: 執行緒 Sanitizer（TSAN）

source: **Supported platforms:** Linux, macOS
de: **Unterstützte Plattformen:** Linux, macOS
zh_tw: 支援所有平台。

source: `Clang TSAN documentation <https://clang.llvm.org/docs/ThreadSanitizer.html>`__
de: `Clang TSAN-Dokumentation <https://clang.llvm.org/docs/ThreadSanitizer.html>`__
zh_tw: `Clang TSAN 文件 <https://clang.llvm.org/docs/ThreadSanitizer.html>`__

source: The thread sanitizer is used to track down race conditions related to multithreading. A race condition is when multiple threads try to modify the same data at the same time. Since thread scheduling can be ordered in any fashion by the operating system, this leads to incorrect behavior that only occurs occasionally (and can be difficult to track as a result). To prevent a race condition, you need to add a lock to ensure only one thread can access the shared data at a given time.
de: Der Thread-Sanitizer wird verwendet, um Race Conditions im Zusammenhang mit Multithreading aufzuspüren. Eine Race Condition liegt vor, wenn mehrere Threads versuchen, dieselben Daten zur gleichen Zeit zu ändern. Da die Threads beim Scheduling vom Betriebssystem in beliebiger Reihenfolge angeordnet werden können, führt dies zu fehlerhaftem Verhalten, das aber nur gelegentlich auftritt (und daher schwer zu tracken sein kann). Um eine Race Condition zu verhindern, müssen Sie ein Lock hinzufügen, um sicherzustellen, dass nur ein Thread zu einem bestimmten Zeitpunkt auf die gemeinsamen Daten zugreifen kann.
zh_tw: 執行緒清理程式用於追蹤與多執行緒相關的競爭條件。競爭條件是指多個執行緒嘗試同時修改相同的資料。由於作業系統可以以任何方式對執行緒調度進行排序，因此這會導致偶爾發生的不正確行為（並且因此可能難以追蹤）。為了防止競爭條件，您需要新增一把鎖以確保在給定時間只有一個執行緒可以存取共享資料。

source: To enable the thread sanitizer in a Godot build, pass the ``use_tsan=yes`` SCons option when compiling. Enabling TSAN generally makes the resulting binary 10× slower, while also multiplying memory usage by an approximately 8× factor.
de: Um den Thread-Sanitizer in einem Godot-Build zu aktivieren, übergeben Sie beim Kompilieren die SCons-Option ``use_tsan=yes``. Durch die Aktivierung von TSAN wird die resultierende Binärdatei im Allgemeinen um das 10-fache langsamer, während sich die Speichernutzung um das 8-fache erhöht.
zh_tw: 若要在 Godot 建置中啟用執行緒清理程式，請在編譯時傳遞“use_tsan=yes”SCons 選項。啟用 TSAN 通常會使產生的二進位檔案變慢 10 倍，同時也會使記憶體使用量增加約 8 倍。

source: Undefined behavior sanitizer (UBSAN)
de: Sanitizer für undefiniertes Verhalten (UBSAN)
zh_tw: 未定義行為 Sanitizer（UBSAN）

source: **Supported platforms:** Linux, macOS, Web
de: **Unterstützte Plattformen:** Linux, macOS, Web
zh_tw: 支援所有平台。

source: `Clang UBSAN documentation <https://clang.llvm.org/docs/UndefinedBehaviorSanitizer.html>`__
de: `Clang UBSAN-Dokumentation <https://clang.llvm.org/docs/UndefinedBehaviorSanitizer.html>`__
zh_tw: `Clang UBSAN 文件 <https://clang.llvm.org/docs/UndefinedBehaviorSanitizer.html>`__

source: The undefined behavior sanitizer is used to track down situations where the program exhibits random and unpredictable behavior. This is due to C/C++ code that is accepted by the compiler, but is not *correct*. Compiling with a different set of optimizations can also change the observed results of undefined behavior.
de: Der Sanitizer für undefiniertes Verhalten wird verwendet, um Situationen aufzuspüren, in denen das Programm ein zufälliges und unvorhersehbares Verhalten zeigt. Dies ist auf C/C++-Code zurückzuführen, der zwar vom Compiler akzeptiert wird, aber nicht *korrekt* ist. Auch das Kompilieren mit einem anderen Satz von Optimierungen kann die beobachteten Ergebnisse von undefiniertem Verhalten verändern.
zh_tw: 未定義行為清理器用於追蹤程式表現出隨機和不可預測行為的情況。這是因為 C/C++ 程式碼被編譯器接受，但不*正確*。使用不同的最佳化集進行編譯還可以更改未定義行為的觀察結果。

source: To enable the undefined behavior sanitizer in a Godot build, pass the ``use_ubsan=yes`` SCons option when compiling. Enabling UBSAN only has a small performance overhead.
de: Um den Sanitizer für undefiniertes Verhalten in einem Godot-Build zu aktivieren, übergeben Sie die SCons-Option ``use_ubsan=yes`` beim Kompilieren. Die Aktivierung von UBSAN hat nur einen geringen Performance-Overhead.
zh_tw: 若要在 Godot 建置中啟用未定義行為清理程式，請在編譯時傳遞“use_ubsan=yes”SCons 選項。啟用 UBSAN 僅產生很小的效能開銷。

source: Platform-specific sanitizers
de: Plattformspezifische Sanitizer
zh_tw: 個別平台

source: When :ref:`compiling for the Web <doc_compiling_for_web>`, there are 2 additional sanitizer SCons options available:
de: Bei der :ref:`Kompilierung für das Web <doc_compiling_for_web>` gibt es 2 zusätzliche Sanitizer SCons-Optionen:
zh_tw: 當為 Web 編譯 <doc_compiling_for_web>` 時，有 2 個額外的 sanitizer SCons 選項可用：

source: ``use_assertions=yes`` enables runtime Emscripten assertions, which can catch various issues.
de: ``use_assertions=yes`` aktiviert Emscripten-Assertions zur Laufzeit, die verschiedene Probleme abfangen können.
zh_tw: ``use_assertions=yes`` 啟用運作時 Emscripten 判斷提示，它可以捕獲各種問題。

source: ``use_safe_heap=yes`` enables `Emscripten's SAFE_HEAP sanitizer <https://emscripten.org/docs/debugging/Sanitizers.html>`__. It provides similar functionality to ASAN, but it focuses on issues that are specific to WebAssembly. ``SAFE_HEAP`` is not guaranteed to be compatible with ASAN and UBSAN in the same binary, so you may have to build it separately.
de: ``use_safe_heap=yes`` aktiviert `Emscriptens SAFE_HEAP-Sanitizer <https://emscripten.org/docs/debugging/Sanitizers.html>`__. Er bietet eine ähnliche Funktionalität wie ASAN, aber es konzentriert sich auf Probleme, die spezifisch für WebAssembly sind. Es ist nicht garantiert, dass ``SAFE_HEAP`` mit ASAN und UBSAN in der gleichen Binärdatei kompatibel ist, so dass Sie es möglicherweise separat bauen müssen.
zh_tw: ``use_safe_heap=yes`` 啟用 `Emscripten 的 SAFE_HEAP 清理器 <https://emscripten.org/docs/debugging/Sanitizers.html>`__。它提供與 ASAN 類似的功能，但它側重於 WebAssembly 特有的問題。 ``SAFE_HEAP`` 不保證與相同二進位檔案中的 ASAN 和 UBSAN 相容，因此您可能需要單獨建置它。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
