Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/compute_shaders.po
Languages: de, zh_tw

source: Using compute shaders
de: Verwendung von Compute-Shadern
zh_tw: 使用計算著色器

source: This tutorial will walk you through the process of creating a minimal compute shader. But first, a bit of background on compute shaders and how they work with Godot.
de: Dieses Tutorial wird Sie durch den Prozess der Erstellung eines minimalen Compute-Shaders führen. Zunächst aber ein paar Hintergrundinformationen zu Compute-Shadern und wie sie mit Godot funktionieren.
zh_tw: 本教學將引導您完成建立最小計算著色器的過程。但首先，我們先了解計算著色器的背景知識以及它們如何與 Godot 搭配使用。

source: This tutorial assumes you are familiar with shaders generally. If you are new to shaders please read :ref:`doc_introduction_to_shaders` and :ref:`your first shader <toc-your-first-shader>` before proceeding with this tutorial.
de: Dieses Tutorial setzt voraus, dass Sie mit Shadern im Allgemeinen vertraut sind. Wenn Sie neu im Bereich Shader sind, lesen Sie bitte :ref:`doc_introduction_to_shaders` und :ref:`your first shader <toc-your-first-shader>` bevor Sie mit diesem Tutorial fortfahren.
zh_tw: 本教學假設您通常熟悉著色器。如果您是著色器新手，請在繼續本教學之前閱讀 :ref:`doc_introduction_to_shaders` 和 :ref:`您的第一個著色器 <toc-your-first-shader>`。

source: A compute shader is a special type of shader program that is orientated towards general purpose programming. In other words, they are more flexible than vertex shaders and fragment shaders as they don't have a fixed purpose (i.e. transforming vertices or writing colors to an image). Unlike fragment shaders and vertex shaders, compute shaders have very little going on behind the scenes. The code you write is what the GPU runs and very little else. This can make them a very useful tool to offload heavy calculations to the GPU.
de: Ein Compute-Shader ist eine besondere Art von Shader-Programm, das auf die allgemeine Programmierung ausgerichtet ist. Mit anderen Worten, sie sind flexibler als Vertex-Shader und Fragment-Shader, da sie keinen festen Zweck haben (z.B. die Umwandlung von Vertices oder das Schreiben von Farben in ein Bild). Im Gegensatz zu Fragment-Shadern und Vertex-Shadern läuft bei Compute-Shadern sehr wenig im Hintergrund ab. Der Code, den Sie schreiben, ist das, was die GPU ausführt, und sehr wenig anderes. Dies kann sie zu einem sehr nützlichen Werkzeug machen, um aufwendige Berechnungen auf den Grafikprozessor zu verlagern.
zh_tw: 計算著色器是一種特殊型別的著色器程式，面向通用編程。換句話說，它們比頂點著色器和片段著色器更靈活，因為它們沒有固定的用途（即轉換頂點或將顏色寫入圖像）。與片段著色器和頂點著色器不同，計算著色器在幕後幾乎沒有進行任何操作。您編寫的程式碼是 GPU 運作的程式碼，除此之外幾乎沒有其他程式碼。這使得它們成為一個非常有用的工具，可以將繁重的計算解除安裝到 GPU。

source: Now let's get started by creating a short compute shader.
de: Beginnen wir nun mit der Erstellung eines kurzen Compute-Shaders.
zh_tw: 現在讓我們開始建立一個簡短的計算著色器。

source: First, in the **external** text editor of your choice, create a new file called ``compute_example.glsl`` in your project folder. When you write compute shaders in Godot, you write them in GLSL directly. The Godot shader language is based on GLSL. If you are familiar with normal shaders in Godot, the syntax below will look somewhat familiar.
de: Erstellen Sie zunächst in einem **externen** Texteditor Ihrer Wahl eine neue Datei namens ``compute_example.glsl`` in Ihrem Projektordner. Wenn Sie Compute-Shader in Godot schreiben, schreiben Sie sie direkt in GLSL. Die Shader-Sprache von Godot basiert auf GLSL. Wenn Sie mit normalen Shadern in Godot vertraut sind, wird Ihnen die folgende Syntax bekannt vorkommen.
zh_tw: 首先，在您選擇的**外部**文字編輯器中，在專案資料夾中建立一個名為「compute_example.glsl」的新檔案。當您在 Godot 中編寫計算著色器時，您可以直接在 GLSL 中編寫它們。 Godot 著色器語言是基於 GLSL。如果您熟悉 Godot 中的普通著色器，那麼下面的語法看起來有些熟悉。

source: Compute shaders can only be used from RenderingDevice-based renderers (the Forward+ or Mobile renderer). To follow along with this tutorial, ensure that you are using the Forward+ or Mobile renderer. The setting for which is located in the top right-hand corner of the editor.
de: Compute-Shader können nur von RenderingDevice-basierten Renderern (dem Forward+- oder Mobile-Renderer) verwendet werden. Um diesem Tutorial folgen zu können, müssen Sie sicherstellen, dass Sie den Forward+- oder Mobile-Renderer verwenden. Die Einstellung dafür befindet sich in der oberen rechten Ecke des Editors.
zh_tw: 計算著色器只能在基於 RenderingDevice 的算繪器（Forward+ 或 Mobile 算繪器）中使用。若要按照本教學進行操作，請確保您使用的是 Forward+ 或 Mobile 算繪器。其設定位於編輯器的右上角。

source: Note that compute shader support is generally poor on mobile devices (due to driver bugs), even if they are technically supported.
de: Beachten Sie, dass die Unterstützung für Compute Shader auf mobilen Geräten im Allgemeinen schlecht ist (aufgrund von Treiberfehlern), auch wenn sie technisch unterstützt werden.
zh_tw: 請注意，計算著色器在行動裝置上的支援通常很差（由於驅動程式錯誤），即使它們在技術上得到支援。

source: Let's take a look at this compute shader code:
de: Werfen wir einen Blick auf diesen Compute-Shader-Code:
zh_tw: 我們把它調成藍色：

source: This code takes an array of floats, multiplies each element by 2 and store the results back in the buffer array. Now let's look at it line-by-line.
de: Dieser Code nimmt ein Array von Floats, multipliziert jedes Element mit 2 und speichert die Ergebnisse zurück in das Puffer-Array. Schauen wir uns den Code nun Zeile für Zeile an.
zh_tw: 此程式碼採用浮點數陣列，將每個元素乘以 2，並將結果儲存回緩衝區陣列中。現在讓我們逐行看一下。

source: These two lines communicate two things:
de: Diese beiden Zeilen vermitteln zwei Dinge:
zh_tw: 這兩行傳達了兩件事：

source: The following code is a compute shader. This is a Godot-specific hint that is needed for the editor to properly import the shader file.
de: Der folgende Code ist ein Compute-Shader. Dies ist ein Godot-spezifischer Hinweis, der benötigt wird, damit der Editor die Shader-Datei korrekt importieren kann.
zh_tw: 以下程式碼是計算著色器。這是編輯器正確匯入著色器檔案所需的特定於 Godot 的提示。

source: The code is using GLSL version 450.
de: Der Code verwendet GLSL Version 450.
zh_tw: 程式碼使用 GLSL 版本 450。

source: You should never have to change these two lines for your custom compute shaders.
de: Sie sollten niemals diese beiden Zeilen für Ihre benutzerdefinierten Compute-Shader ändern müssen.
zh_tw: 您永遠不必為自訂計算著色器更改這兩行。

source: Next, we communicate the number of invocations to be used in each workgroup. Invocations are instances of the shader that are running within the same workgroup. When we launch a compute shader from the CPU, we tell it how many workgroups to run. Workgroups run in parallel to each other. While running one workgroup, you cannot access information in another workgroup. However, invocations in the same workgroup can have some limited access to other invocations.
de: Als Nächstes teilen wir die Anzahl der Aufforderungen mit, die in jeder Arbeitsgruppe verwendet werden sollen. Aufrufe sind Instanzen des Shaders, die innerhalb derselben Arbeitsgruppe ausgeführt werden. Wenn wir einen Compute-Shader von der CPU starten, teilen wir ihm mit, wie viele Arbeitsgruppen er ausführen soll. Arbeitsgruppen werden parallel zueinander ausgeführt. Während eine Arbeitsgruppe ausgeführt wird, können Sie nicht auf Informationen in einer anderen Arbeitsgruppe zugreifen. Allerdings können Aufrufe in derselben Workgroup in begrenztem Umfang auf andere Aufrufe zugreifen.
zh_tw: 接下來，我們傳達每個工作組中要使用的呼叫次數。呼叫是在同一工作群組中執行的著色器的實例。當我們從 CPU啟動計算著色器時，我們會告訴它要運作多少個工作組。工作小組彼此並行運作。執行一個工作群組時，您無法存取另一工作群組中的資訊。但是，同一工作群組中的呼叫可以對其他呼叫具有一些有限的存取權。

source: Think about workgroups and invocations as a giant nested ``for`` loop.
de: Betrachten Sie Arbeitsgruppen und Aufrufe als eine riesige verschachtelte ``for``-Schleife.
zh_tw: 將工作群組和呼叫視為一個巨大的巢狀“for”循環。

source: Workgroups and invocations are an advanced topic. For now, remember that we will be running two invocations per workgroup.
de: Arbeitsgruppen und Aufrufe sind ein Thema für Fortgeschrittene. Denken Sie zunächst daran, dass wir zwei Aufrufe pro Arbeitsgruppe durchführen werden.
zh_tw: 工作小組和呼叫是一個高級主題。現在，請記住，我們將為每個工作組執行兩次呼叫。

source: Here we provide information about the memory that the compute shader will have access to. The ``layout`` property allows us to tell the shader where to look for the buffer, we will need to match these ``set`` and ``binding`` positions from the CPU side later.
de: Hier stellen wir Informationen über den Speicher zur Verfügung, auf den der Compute-Shader Zugriff haben wird. Die Property ``layout`` erlaubt es uns, dem Shader mitzuteilen, wo er nach dem Puffer suchen soll. Wir werden diese ``set`` und ``binding``-Positionen später auf der CPU-Seite abgleichen müssen.
zh_tw: 在這裡，我們提供有關計算著色器將存取的記憶體的資訊。 “layout” 屬性允許我們告訴著色器在哪裡尋找緩衝區，稍後我們需要從 CPU 端配對這些“set” 和“binding” 位置。

source: The ``restrict`` keyword tells the shader that this buffer is only going to be accessed from one place in this shader. In other words, we won't bind this buffer in another ``set`` or ``binding`` index. This is important as it allows the shader compiler to optimize the shader code. Always use ``restrict`` when you can.
de: Das Schlüsselwort ``restrict`` sagt dem Shader, dass auf diesen Puffer nur von einer Stelle in diesem Shader zugegriffen werden soll. Mit anderen Worten, wir werden diesen Puffer nicht in einen anderen ``set`` oder ``binding``-Index einbinden. Dies ist wichtig, da es dem Shader-Compiler erlaubt, den Shader-Code zu optimieren. Benutzen Sie immer ``restrict`` wenn Sie können.
zh_tw: “restrict” 關鍵字告訴著色器該緩衝區只能從該著色器中的一個位置存取。換句話說，我們不會將此緩衝區綁定到另一個「set」或「binding」索引中。這很重要，因為它允許著色器編譯器最佳化著色器程式碼。盡可能使用“restrict”。

source: This is an *unsized* buffer, which means it can be any size. So we need to be careful not to read from an index larger than the size of the buffer.
de: Es handelt sich um einen *unsized* Puffer, d.h. er kann beliebig groß sein. Wir müssen also aufpassen, dass wir nicht aus einem Index lesen, der größer ist als die Größe des Puffers.
zh_tw: 這是一個*未確定大小的*緩衝區，這表示它可以是任意大小。所以我們需要小心，不要從大於緩衝區大小的索引中讀取資料。

source: Finally, we write the ``main`` function which is where all the logic happens. We access a position in the storage buffer using the ``gl_GlobalInvocationID`` built in variables. ``gl_GlobalInvocationID`` gives you the global unique ID for the current invocation.
de: Schließlich schreiben wir die Funktion ``main``, in der die gesamte Logik abläuft. Wir greifen auf eine Position im Speicherpuffer zu, indem wir die Built-in-Variable ``gl_GlobalInvocationID`` verwenden. ``gl_GlobalInvocationID`` gibt Ihnen die global eindeutige ID für den aktuellen Aufruf.
zh_tw: 最後，我們編寫“main”函式，這是所有邏輯發生的地方。我們使用內建變數「gl_GlobalInitationID」來存取儲存緩衝區中的位置。 “gl_GlobalInitationID” 為您提供目前呼叫的全域唯一 ID。

source: To continue, write the code above into your newly created ``compute_example.glsl`` file.
de: Um fortzufahren, schreiben Sie den obigen Code in Ihre neu erstellte Datei ``compute_example.glsl``.
zh_tw: 要繼續，請將上面的程式碼寫入新建立的“compute_example.glsl”檔案中。

source: Create a local RenderingDevice
de: Erstellen eines lokalen RenderingDevices
zh_tw: 建立局部 RenderingDevice

source: To interact with and execute a compute shader, we need a script. Create a new script in the language of your choice and attach it to any Node in your scene.
de: Um mit einem Compute-Shader zu interagieren und ihn auszuführen, benötigen wir ein Skript. Erstellen Sie ein neues Skript in einer Sprache Ihrer Wahl und fügen Sie es an einen beliebigen Node in Ihrer Szene an.
zh_tw: 為了與計算著色器互動並執行計算著色器，我們需要一個腳本。使用您選擇的語言建立新腳本並將其附加到場景中的任何節點。

source: Now to execute our shader we need a local :ref:`class_RenderingDevice` which can be created using the :ref:`class_RenderingServer`:
de: Um nun unseren Shader auszuführen, benötigen wir ein lokales :ref:`class_RenderingDevice`, das mit Hilfe des :ref:`class_RenderingServer` erstellt werden kann:
zh_tw: 現在要執行我們的著色器，我們需要一個本地 class_RenderingDevice ，可以使用 class_RenderingServer 來建立它：

source: After that, we can load the newly created shader file ``compute_example.glsl`` and create a precompiled version of it using this:
de: Danach können wir die neu erstellte Shaderdatei ``compute_example.glsl`` laden und damit eine vorkompilierte Version erstellen:
zh_tw: 之後，我們可以載入新建立的著色器檔案“compute_example.glsl”並使用以下指令建立它的預編譯版本：

source: Local RenderingDevices cannot be debugged using tools such as `RenderDoc <https://renderdoc.org/>`__.
de: Lokale RenderingDevices können nicht mit Tools wie `RenderDoc <https://renderdoc.org/>`__ debuggt werden.

source: Provide input data
de: Bereitstellung von Eingabedaten
zh_tw: 提供輸入資料

source: As you might remember, we want to pass an input array to our shader, multiply each element by 2 and get the results.
de: Wie Sie sich vielleicht erinnern, wollen wir ein Eingabe-Array an unseren Shader übergeben, jedes Element mit 2 multiplizieren und das Ergebnis erhalten.
zh_tw: 您可能還記得，我們希望將輸入陣列傳遞給著色器，將每個元素乘以 2 並獲得結果。

source: We need to create a buffer to pass values to a compute shader. We are dealing with an array of floats, so we will use a storage buffer for this example. A storage buffer takes an array of bytes and allows the CPU to transfer data to and from the GPU.
de: Wir müssen einen Puffer erstellen, um Werte an einen Compute-Shader zu übergeben. Da wir es mit einem Array von Floats zu tun haben, werden wir für dieses Beispiel einen Speicherpuffer verwenden. Ein Speicherpuffer nimmt ein Array von Bytes auf und ermöglicht der CPU die Übertragung von Daten zur und von der GPU.
zh_tw: 我們需要建立一個緩衝區來將值傳遞給計算著色器。我們正在處理浮點陣列，因此我們將在本範例中使用儲存緩衝區。儲存緩衝區採用位元組陣列，並允許 CPU 與 GPU 之間傳輸資料。

source: So let's initialize an array of floats and create a storage buffer:
de: Initialisieren wir also ein Array von Floats und erstellen einen Speicherpuffer:
zh_tw: 因此，讓我們初始化一個浮點陣列並建立一個儲存緩衝區：

source: With the buffer in place we need to tell the rendering device to use this buffer. To do that we will need to create a uniform (like in normal shaders) and assign it to a uniform set which we can pass to our shader later.
de: Nachdem der Puffer jetzt vorhanden ist, müssen wir dem Rendering-Gerät mitteilen, dass es diesen Puffer verwenden soll. Dazu müssen wir ein Uniform erstellen (wie in normalen Shadern) und sie einem Uniform-Set zuweisen, das wir später an unseren Shader übergeben können.
zh_tw: 緩衝區就位後，我們需要告訴算繪裝置使用該緩衝區。為此，我們需要建立一個均勻（就像在普通著色器中一樣）並將其指派給一個均勻集，稍後我們可以將其傳遞給著色器。

source: Defining a compute pipeline
de: Definieren einer Berechnungs-Pipeline
zh_tw: 定義計算管線

source: The next step is to create a set of instructions our GPU can execute. We need a pipeline and a compute list for that.
de: Der nächste Schritt besteht darin, eine Reihe von Anweisungen zu erstellen, die unsere GPU ausführen kann. Dazu benötigen wir eine Pipeline und eine Berechnungs-Liste.
zh_tw: 下一步是建立 GPU 可以執行的一組指令。我們需要一個管道和一個計算列表。

source: The steps we need to do to compute our result are:
de: Die Schritte, die wir zur Berechnung unseres Ergebnisses durchführen müssen, sind:
zh_tw: 計算結果需要執行的步驟是：

source: Create a new pipeline.
de: Erstellen einer neuen Pipeline.
zh_tw: 建立新專案

source: Begin a list of instructions for our GPU to execute.
de: Beginnen mit einer Liste von Anweisungen, die unsere GPU ausführen soll.
zh_tw: 開始我們的 GPU 執行的指令列表。

source: Bind our compute list to our pipeline
de: Binden unserer Berechnungsliste an unsere Pipeline
zh_tw: 將我們的計算列表綁定到我們的管道

source: Bind our buffer uniform to our pipeline
de: Binden unseres Puffer-Uniforms an unsere Pipeline
zh_tw: 將我們的緩衝區均勻綁定到我們的管道

source: Specify how many workgroups to use
de: Festlegen, wie viele Arbeitsgruppen verwendet werden sollen
zh_tw: 指定要使用的工作群組數量

source: End the list of instructions
de: Beenden der Liste von Anweisungen
zh_tw: 編輯器整合

source: Note that we are dispatching the compute shader with 5 work groups in the X axis, and one in the others. Since we have 2 local invocations in the X axis (specified in our shader), 10 compute shader invocations will be launched in total. If you read or write to indices outside of the range of your buffer, you may access memory outside of your shaders control or parts of other variables which may cause issues on some hardware.
de: Beachten Sie, dass wir den Compute-Shader mit 5 Arbeitsgruppen in der X-Achse und einer in den anderen Achsen starten. Da wir 2 lokale Aufrufe in der X-Achse haben (angegeben in unserem Shader), werden insgesamt 10 Compute-Shader-Aufrufe gestartet. Wenn Sie in Indizes außerhalb des Bereichs Ihres Puffers lesen oder schreiben, greifen Sie möglicherweise auf Speicher außerhalb der Kontrolle Ihres Shaders oder auf Teile anderer Variablen zu, was auf mancher Hardware zu Problemen führen kann.
zh_tw: 請注意，我們將計算著色器分派給 X 軸上的 5 個工作組，以及其他一個工作組。由於我們在 X 軸上有 2 個本地呼叫（在著色器中指定），因此總共將啟動 10 個計算著色器呼叫。如果您讀取或寫入緩衝區範圍之外的索引，則可能會存取著色器控制之外的記憶體或其他變數的一部分，這可能會導致某些硬體出現問題。

source: Execute a compute shader
de: Ausführen eines Compute-Shaders
zh_tw: 執行計算著色器

source: After all of this we are almost done, but we still need to execute our pipeline. So far we have only recorded what we would like the GPU to do; we have not actually run the shader program.
de: Nach all dem sind wir fast fertig, aber wir müssen noch unsere Pipeline ausführen. Bisher haben wir nur aufgezeichnet, was wir von der GPU erwarten; wir haben das Shader-Programm noch nicht ausgeführt.
zh_tw: 所有這些之後我們就快完成了，但我們仍然需要執行我們的管道。到目前為止，我們只記錄了我們希望 GPU 執行的操作；我們還沒有真正運作著色器程式。

source: To execute our compute shader we need to submit the pipeline to the GPU and wait for the execution to finish:
de: Um unseren Compute-Shader auszuführen, müssen wir die Pipeline an die GPU senden und warten, bis die Ausführung abgeschlossen ist:
zh_tw: 要執行計算著色器，我們需要將管道提交給 GPU 並等待執行完成：

source: Ideally, you would not call ``sync()`` to synchronize the RenderingDevice right away as it will cause the CPU to wait for the GPU to finish working. In our example, we synchronize right away because we want our data available for reading right away. In general, you will want to wait *at least* 2 or 3 frames before synchronizing so that the GPU is able to run in parallel with the CPU.
de: Idealerweise sollten Sie nicht ``sync()`` aufrufen, um das RenderingDevice sofort zu synchronisieren, da dies dazu führt, dass die CPU auf die Beendigung der Arbeit der GPU wartet. In unserem Beispiel synchronisieren wir sofort, weil wir unsere Daten sofort zum Lesen zur Verfügung haben wollen. Im Allgemeinen sollten Sie *mindestens* 2 oder 3 Frames warten, bevor Sie synchronisieren, damit die GPU parallel zur CPU arbeiten kann.
zh_tw: 理想情況下，您不會立即呼叫「sync()」來同步 RenderingDevice，因為這會導致 CPU 等待 GPU 完成工作。在我們的範例中，我們立即同步，因為我們希望資料可供立即讀取。一般來說，您需要在同步之前等待「至少」2 或 3 影格，以便 GPU 能夠與 CPU 並行運作。

source: Long computations can cause Windows graphics drivers to "crash" due to :abbr:`TDR (Timeout Detection and Recovery)` being triggered by Windows. This is a mechanism that reinitializes the graphics driver after a certain amount of time has passed without any activity from the graphics driver (usually 5 to 10 seconds).
de: Lange Berechnungen können dazu führen, dass Windows-Grafiktreiber "abstürzen", weil :abbr:`TDR (Timeout Detection and Recovery)` von Windows ausgelöst wird. Dabei handelt es sich um einen Mechanismus, der den Grafiktreiber neu initialisiert, nachdem eine bestimmte Zeitspanne ohne Aktivität des Grafiktreibers verstrichen ist (normalerweise 5 bis 10 Sekunden).
zh_tw: 由於 Windows 觸發 TDR（逾時偵測和復原），長時間運算可能會導致 Windows 圖形驅動程式「當機」。這是一種在圖形驅動程式沒有任何活動（通常為 5 到 10 秒）一段時間後重新初始化圖形驅動程式的機制。

source: Depending on the duration your compute shader takes to execute, you may need to split it into multiple dispatches to reduce the time each dispatch takes and reduce the chances of triggering a TDR. Given TDR is time-dependent, slower GPUs may be more prone to TDRs when running a given compute shader compared to a faster GPU.
de: Je nachdem, wie lange die Ausführung Ihres Compute-Shaders dauert, müssen Sie ihn möglicherweise in mehrere Dispatches aufteilen, um die Zeit für jeden Dispatch zu verkürzen und die Wahrscheinlichkeit der Auslösung eines TDR zu verringern. Da TDR zeitabhängig ist, können langsamere GPUs bei der Ausführung eines bestimmten Compute-Shaders anfälliger für TDRs sein als schnellere GPUs.
zh_tw: 根據計算著色器執行所需的持續時間，您可能需要將其拆分為多個調度，以減少每個調度所需的時間並減少觸發 TDR 的機會。鑑於 TDR 與時間相關，與較快的 GPU 相比，在運作給定計算著色器時，較慢的 GPU 可能更容易出現 TDR。

source: Retrieving results
de: Abrufen von Ergebnissen
zh_tw: 測試結果

source: You may have noticed that, in the example shader, we modified the contents of the storage buffer. In other words, the shader read from our array and stored the data in the same array again so our results are already there. Let's retrieve the data and print the results to our console.
de: Sie haben vielleicht bemerkt, dass wir im Beispiel-Shader den Inhalt des Speicherpuffers verändert haben. Mit anderen Worten, der Shader hat aus unserem Array gelesen und die Daten in demselben Array wieder gespeichert, so dass unsere Ergebnisse bereits vorhanden sind. Lassen Sie uns die Daten abrufen und die Ergebnisse auf unserer Konsole ausgeben.
zh_tw: 您可能已經注意到，在範例著色器中，我們修改了儲存緩衝區的內容。換句話說，著色器從我們的陣列中讀取資料並將資料再次儲存在同一陣列中，因此我們的結果已經存在。讓我們檢索資料並將結果列印到控制台。

source: With that, you have everything you need to get started working with compute shaders.
de: Damit haben Sie alles, was Sie brauchen, um mit Compute-Shadern zu arbeiten.
zh_tw: 這樣，您就擁有了開始使用計算著色器所需的一切。

source: The demo projects repository contains a `Compute Shader Heightmap demo <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__ This project performs heightmap image generation on the CPU and GPU separately, which lets you compare how a similar algorithm can be implemented in two different ways (with the GPU implementation being faster in most cases).
de: Das Repository für Demoprojekte enthält eine `Compute Shader Höhenkarten-Demo <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__. Dieses Projekt führt die Erzeugung von Höhenkarten-Bildern auf der CPU und der GPU getrennt durch, wodurch Sie vergleichen können, wie ein ähnlicher Algorithmus auf zwei verschiedene Arten implementiert werden kann (wobei die GPU-Implementierung in den meisten Fällen schneller ist).
zh_tw: 示範專案儲存庫包含一個「Compute Shader Heightmap demo <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__ 此專案分別在CPU 和GPU 上執行高度圖片圖像生成，它可以讓您比較如何以兩種不同的方式實作類似的演算法（大多數情況下 GPU 實作速度更快）。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
