Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/custom_postprocessing.po
Languages: de, zh_tw

source: Custom post-processing
de: Benutzerdefinierte Nachbearbeitung
zh_tw: 自訂後期處理

source: Introduction
de: Einführung
zh_tw: 前言

source: Godot provides many post-processing effects out of the box, including Bloom, DOF, and SSAO, which are described in :ref:`doc_environment_and_post_processing`. However, advanced use cases may require custom effects. This article explains how to write your own custom effects.
de: Godot bietet von Haus aus viele Nachbearbeitungseffekte, einschließlich Bloom, DOF und SSAO, die in :ref:`doc_environment_and_post_processing` beschrieben sind. Für fortgeschrittene Anwendungsfälle können jedoch eigene Effekte erforderlich sein. Dieser Artikel erklärt, wie Sie Ihre eigenen benutzerdefinierten Effekte schreiben können.

source: The easiest way to implement a custom post-processing shader is to use Godot's built-in ability to read from the screen texture. If you're not familiar with this, you should read the :ref:`Screen Reading Shaders Tutorial <doc_screen-reading_shaders>` first.
de: Der einfachste Weg einen benutzerdefinierten Nachbearbeitungs-Shader zu implementieren, besteht darin, die in Godot integrierte Fähigkeit zum Lesen der Bildschirmtextur zu verwenden. Wenn Sie damit nicht vertraut sind, sollten Sie zuerst die :ref:`Screen Reading-Shader Anleitung <doc_screen-reading_shaders>` lesen.
zh_tw: 實作自訂後期處理著色器的最簡單方法是使用Godot的內建功能從螢幕紋理中讀取. 如果您不熟悉這個, 您應該先閱讀 :ref:`螢幕閱讀著色器教學 <doc_screen-reading_shaders>` .

source: Post-processing effects are shaders applied to a frame after Godot has rendered it. To apply a shader to a frame, create a :ref:`CanvasLayer <class_CanvasLayer>`, and give it a :ref:`ColorRect <class_ColorRect>`. Assign a new :ref:`ShaderMaterial <class_ShaderMaterial>` to the newly created ``ColorRect``, and set the ``ColorRect``'s layout to "Full Rect".
de: Nachbearbeitungseffekte sind Shader, die auf ein Bild angewendet werden, nachdem Godot es gerendert hat. Um einen Shader auf ein Frame anzuwenden, erstellen Sie einen :ref:`CanvasLayer <class_CanvasLayer>`, und geben Sie ihm einen :ref:`ColorRect <class_ColorRect>`. Weisen Sie ein neues :ref:`ShaderMaterial <class_ShaderMaterial>` dem neu erstellten ``ColorRect`` zu und setzen Sie das Layout des ``ColorRect`` auf "Vollständiges Rechteck".
zh_tw: 後處理效果是在 Godot 算繪影格後應用於影格的著色器。若要將著色器套用到影格，請建立一個 CanvasLayer <class_CanvasLayer>`，並為其指定一個 ColorRect <class_ColorRect>`。將新的 ShaderMaterial <class_ShaderMaterial> 指派給新建立的“ColorRect”，並將“ColorRect”的佈局設為“完整矩形”。

source: Your scene tree will look something like this:
de: Ihr Szenenbaum wird in etwa so aussehen:
zh_tw: 最後場景應該長這樣。

source: Another more efficient method is to use a :ref:`BackBufferCopy <class_BackBufferCopy>` to copy a region of the screen to a buffer and to access it in a shader script through a ``sampler2D`` using ``hint_screen_texture``.
de: Eine weitere, effizientere Methode ist die Verwendung eines :ref:`BackBufferCopy <class_BackBufferCopy>`, um einen Bereich des Bildschirms in einen Puffer zu kopieren und in einem Shader-Skript über einen ``sampler2D`` mit ``hint_screen_texture`` darauf zuzugreifen.
zh_tw: 另一種更有效的方法是使用 BackBufferCopy <class_BackBufferCopy>` 將螢幕區域複製到緩衝區，並使用「hint_screen_texture」透過「sampler2D」在著色器腳本中存取它。

source: As of the time of writing, Godot does not support rendering to multiple buffers at the same time. Your post-processing shader will not have access to other render passes and buffers not exposed by Godot (such as depth or normal/roughness). You only have access to the rendered frame and buffers exposed by Godot as samplers.
de: Zum Zeitpunkt der Erstellung dieses Artikels unterstützt Godot nicht das gleichzeitige Rendern in mehrere Puffer. Ihr Post-Processing-Shader hat keinen Zugriff auf andere Render-Passes und Puffer, die nicht von Godot bereitgestellt werden (wie Tiefe oder Normalen/Rauheit). Sie haben nur Zugriff auf den gerenderten Frame und die Puffer, die von Godot als Sampler bereitgestellt werden.

source: For this demo, we will use this :ref:`Sprite <class_Sprite2D>` of a sheep.
de: Für diese Demo werden wir diesen :ref:`Sprite <class_Sprite2D>` eines Schafes verwenden.
zh_tw: 這個演示中，我們使用的是這張小羊的:ref:`精靈 <class_Sprite2D>`。

source: Assign a new :ref:`Shader <class_Shader>` to the ``ColorRect``'s ``ShaderMaterial``. You can access the frame's texture and UV with a ``sampler2D`` using ``hint_screen_texture`` and the built in ``SCREEN_UV`` uniforms.
de: Weisen Sie dem ``ShaderMaterial`` des ``ColorRect`` einen neuen :ref:`Shader <class_Shader>` zu. Sie können auf die Textur und UV des Frames mit einem ``sampler2D`` zugreifen, indem Sie ``hint_screen_texture`` und die Built-in-``SCREEN_UV``-Uniforms benutzen.
zh_tw: 為 ``ColorRect`` 的 ``ShaderMaterial`` 分配一個新的 :ref:`Shader <class_Shader>`。你可以通過使用帶 ``hint_screen_texture`` 的 ``sampler2D`` 以及內建的 uniform ``SCREEN_UV`` 來存取這一影格的紋理和 UV。

source: Copy the following code to your shader. The code below is a hex pixelization shader by `arlez80 <https://bitbucket.org/arlez80/hex-mosaic/src/master/>`_,
de: Kopieren Sie den folgenden Code in Ihren Shader. Der folgende Code ist ein Hex-Pixelisierungs-Shader von `arlez80 <https://bitbucket.org/arlez80/hex-mosaic/src/master/>`_,
zh_tw: 將以下程式碼複製到著色器. 上面的程式碼是單通道邊緣偵測濾波器, `Sobel 濾波器 <https://en.wikipedia.org/wiki/Sobel_operator>`_ ，

source: The sheep will look something like this:
de: Das Schaf wird etwa so aussehen:
zh_tw: 最後場景應該長這樣。

source: Some post-processing effects like blurs are resource intensive. You can make them run a lot faster if you break them down in multiple passes. In a multipass material, each pass takes the result from the previous pass as an input and processes it.
de: Einige Post Processing-Effekte wie Unschärfen sind ressourcenintensiv. Sie können viel schneller ausgeführt werden, wenn Sie sie in mehrere Durchgänge aufteilen. In einem Multi Pass-Material nimmt jeder Durchlauf das Ergebnis des vorherigen Durchlaufs als Eingabe und verarbeitet es.
zh_tw: 像模糊這樣的後期處理效果是資源密集型的. 但是如果您在多次通過中將它們分解, 您可以讓它們運作得更快. 在多通道材質中, 每次傳遞都將前一次傳遞的結果作為輸入並對其進行處理.

source: To produce a multi-pass post-processing shader, you stack ``CanvasLayer`` and ``ColorRect`` nodes. In the example above, you use a ``CanvasLayer`` object to render a shader using the frame on the layer below. Apart from the node structure, the steps are the same as with the single-pass post-processing shader.
de: Um einen Multi-Pass Post-Processing-Shader zu erzeugen, stapeln Sie ``CanvasLayer`` und ``ColorRect``-Nodes. Im obigen Beispiel verwenden Sie ein ``CanvasLayer``-Objekt, um einen Shader zu rendern, der das Frame der darunter liegenden Ebene verwendet. Abgesehen von der Struktur der Nodes sind die Schritte die gleichen wie beim Single Pass Post Processing-Shader.
zh_tw: 若要產生多通道後處理著色器，請堆疊“CanvasLayer”和“ColorRect”節點。在上面的範例中，您使用「CanvasLayer」物件來使用下面圖層上的框架來算繪著色器。除了節點結構之外，步驟與單通道後處理著色器相同。

source: As an example, you could write a full screen Gaussian blur effect by attaching the following pieces of code to each of the ``ColorRect`` nodes. The order in which you apply the shaders depends on the position of the ``CanvasLayer`` in the scene tree, higher means sooner. For this blur shader, the order does not matter.
de: Als Beispiel könnten Sie einen Vollbild-Gaußschen Weichzeichner-Effekt schreiben, indem Sie die folgenden Code-Stücke an jeden der ``ColorRect``-Nodes anhängen. Die Reihenfolge, in der Sie die Shader anwenden, hängt von der Position des ``CanvasLayer`` im Szenenbaum ab, höher bedeutet früher. Für diesen Blur-Shader spielt die Reihenfolge keine Rolle.
zh_tw: 例如，可以通過將下面的程式碼片段附加到每個 ``ColorRect`` 上來編寫全屏高斯模糊效果。應用著色器的順序取決於場景樹中 ``CanvasLayer`` 的位置，越往上越早應用。對於這個模糊著色器而言，順序是無所謂的。

source: Using the above code, you should end up with a full screen blur effect like below.
de: Wenn Sie den obigen Code verwenden, sollten Sie einen Unschärfeeffekt für den gesamten Bildschirm erhalten, wie unten dargestellt.
zh_tw: 使用上面的程式碼, 您應該得到如下所示的全屏模糊效果.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Single pass post-processing
zh_tw: 單通後期處理

source: Multi-pass post-processing
zh_tw: 多階段後期處理
