Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/introduction_to_shaders.po
Languages: de, fr, ru, zh_tw

source: Introduction to shaders
de: Einführung in Shader
fr: Introduction aux shaders
ru: Введение в шейдеры
zh_tw: 匯出簡介

source: This page explains what shaders are and will give you an overview of how they work in Godot. For a detailed reference of the engine's shading language, see :ref:`doc_shading_language`.
de: Diese Seite erklärt, was Shader sind und gibt einen Überblick über ihre Funktionsweise in Godot. Für eine detaillierte Referenz der Shading-Sprache der Engine siehe :ref:`doc_shading_language`.
fr: Cette page explique ce que sont les shaders et vous donnera un aperçu de leur fonctionnement dans Godot. Pour une référence détaillée du langage de shader du moteur, voir :ref:`doc_shading_language`.
ru: Эта страница объясняет, что такое шейдеры, и даёт представление о том, как они работают в Godot. Подробную информацию о языке шейдеров движка можно найти в :ref:`doc_shading_language`.
zh_tw: 本頁面會講解什麼是著色器，會為你綜述其在 Godot 中的使用方法。引擎中著色語言的詳細參考見 :ref:`doc_shading_language`。

source: Shaders are a special kind of program that runs on Graphics Processing Units (GPUs). They were initially used to shade 3D scenes but can nowadays do much more. You can use them to control how the engine draws geometry and pixels on the screen, allowing you to achieve all sorts of effects.
de: Shader sind eine spezielle Art von Programmen, die auf Grafikprozessoren (GPUs) laufen. Ursprünglich dienten sie der Schattierung von 3D-Szenen, heute können sie aber weitaus mehr. Sie können damit steuern, wie die Engine Geometrie und Pixel auf dem Bildschirm zeichnet, sodass Sie alle möglichen Effekte erzielen können.
fr: Les shaders sont un type particulier de programme qui fonctionne sur les unités de traitement graphique (GPU). Ils étaient initialement utilisés pour ombrer les scènes 3D mais peuvent aujourd'hui faire beaucoup plus. Vous pouvez les utiliser pour contrôler la façon dont le moteur dessine la géométrie et les pixels à l'écran, ce qui vous permet d'obtenir toutes sortes d'effets.
ru: Шейдеры - это особый вид программ, которые работают на графических процессорах (GPU). Изначально они использовались для просчёта 3D-сцен, но сегодня могут делать гораздо больше. С их помощью можно управлять тем, как движок отрисовывает геометрию и пиксели на экране, что позволяет добиться самых разных эффектов.
zh_tw: 著色器（Shader）是一種在圖形處理單元（GPU）上運作的特殊程式。他們最初使用來為 3D 場景著色的，不過現在能做的事情就更多了。你可以用它們來控制引擎在螢幕上繪製幾何體以及像素的方式，可以用來實作各種特效。

source: Modern rendering engines like Godot draw everything with shaders: graphics cards can run thousands of instructions in parallel, leading to incredible rendering speed.
de: Moderne Rendering-Engines wie Godot zeichnen alles mit Shadern: Grafikkarten können Tausende von Anweisungen parallel ausführen, was zu einer unglaublichen Rendering-Geschwindigkeit führt.
fr: Les moteurs de rendu modernes comme Godot dessinent tout avec des shaders : les cartes graphiques peuvent exécuter des milliers d'instructions en parallèle, ce qui permet une vitesse de rendu incroyable.
ru: Современные движки рендеринга, такие как Godot, рисуют всё с помощью шейдеров: видеокарты могут выполнять тысячи инструкций параллельно, что приводит к невероятной скорости рендеринга.
zh_tw: 類似 Godot 的現代算繪引擎都會用著色器來執行所有繪製操作：圖形卡可以並存執行成千上萬條指令，可以達到驚人的算繪速度。

source: Because of their parallel nature, though, shaders don't process information the way a typical program does. Shader code runs on each vertex or pixel in isolation. You cannot store data between frames either. As a result, when working with shaders, you need to code and think differently from other programming languages.
de: Aufgrund ihrer parallelen Natur verarbeiten Shader Informationen jedoch nicht wie ein typisches Programm. Shader-Code wird isoliert auf jedem Vertex oder Pixel ausgeführt. Sie können auch keine Daten zwischen Frames speichern. Daher müssen Sie bei der Arbeit mit Shadern anders programmieren und denken als in anderen Programmiersprachen.
fr: Cependant, en raison de leur nature parallèle, les shaders ne traitent pas les informations comme le fait un programme classique. Le code du shader s'exécute sur chaque sommet ou pixel de manière isolée. Vous ne pouvez pas non plus stocker des données entre les images. Par conséquent, lorsque vous travaillez avec des shaders, vous devez coder et penser différemment des autres langages de programmation.
ru: Однако из-за своей параллельной природы шейдеры обрабатывают информацию не так, как обычные программы. Код шейдера работает с каждой вершиной или пикселем в отдельности. Вы также не можете хранить данные между кадрами. В результате при работе с шейдерами вам придется писать код и думать иначе, чем в других языках программирования.
zh_tw: 因為天生就是並行的，所以著色器處理資訊的方式與普通的程式有所不同。著色器程式碼是單獨針對頂點或像素執行的。你也無法在影格與影格之間儲存資料。因此，使用著色器時，你需要使用與其他程式設計語言不同的編碼和思考方式。

source: Suppose you want to update all the pixels in a texture to a given color. In GDScript, your code would use ``for`` loops::
de: Angenommen, Sie möchten alle Pixel einer Textur in einer bestimmten Farbe aktualisieren. In GDScript würde Ihr Code ``for``-Schleifen verwenden::
fr: Supposons que vous vouliez mettre à jour tous les pixels d'une texture à une couleur donnée. En GDScript, votre code utiliserait des boucles ``for`` :
ru: Предположим, вы хотите обновить все пиксели в текстуре до заданного цвета. На языке GDScript в коде будут использоваться циклы ``for``::
zh_tw: 假設你想要把紋理中的所有像素點都設定成某個給定的顏色。使用 GDScript，你的程式碼會用 ``for`` 迴圈： ::

source: Your code is already part of a loop in a shader, so the corresponding code would look like this.
de: Ihr Code ist bereits Teil einer Schleife in einem Shader, so dass der entsprechende Code wie folgt aussehen würde.
fr: Votre code fait déjà partie d'une boucle dans un shader, donc le code correspondant ressemblerait à ceci.
ru: Ваш код уже является частью цикла в шейдере, поэтому соответствующий код будет выглядеть следующим образом.
zh_tw: 在著色器中，你的程式碼已經是迴圈的一部分了，所以對應的程式碼應該類似這樣。

source: The graphics card calls the ``fragment()`` function once or more for each pixel it has to draw. More on that below.
de: Die Grafikkarte ruft die Funktion ``fragment()`` einmal oder mehrmals für jedes Pixel auf, das sie zeichnen muß. Mehr dazu weiter unten.
fr: La carte graphique appelle la fonction ``fragment()`` une fois ou plus pour chaque pixel qu'elle doit dessiner. Nous y reviendrons plus loin.
ru: Видеокарта вызывает функцию ``fragment()`` один или несколько раз для каждого пикселя, который она должна нарисовать. Подробнее об этом ниже.
zh_tw: 圖形卡會為需要繪製的每一個像素呼叫若干次 ``fragment()`` 函式。後面會詳細說明。

source: Shaders in Godot
de: Shader in Godot
fr: Shaders dans Godot
ru: Шейдеры в Godot
zh_tw: 設定 Godot

source: Godot provides a shading language based on the popular OpenGL Shading Language (GLSL) but simplified. The engine handles some of the lower-level initialization work for you, making it easier to write complex shaders.
de: Godot bietet eine Shading-Sprache, die auf der beliebten OpenGL Shading Language (GLSL) basiert, jedoch vereinfacht ist. Die Engine übernimmt einen Teil der Initialisierungsarbeit auf unterer Ebene für Sie und erleichtert so das Schreiben komplexer Shader.
fr: Godot fournit un langage de shader basé sur le populaire langage de shader OpenGL (GLSL), mais simplifié. Le moteur gère une partie du travail d'initialisation de bas niveau pour vous, ce qui facilite l'écriture de shaders complexes.
ru: Godot предоставляет язык шейдеров, основанный на популярном OpenGL Shading Language (GLSL), но упрощённый. Движок обрабатывает за вас часть работы по инициализации нижнего уровня, что упрощает написание сложных шейдеров.
zh_tw: Godot 所提供的著色語言是基於流行的 OpenGL 著色語言（GLSL）的簡化。引擎會為你處理一些底層的初始化工作，讓編寫複雜著色器更為簡單。

source: In Godot, shaders are made up of main functions called "processor functions". Processor functions are the entry point for your shader into the program. There are seven different processor functions.
de: In Godot bestehen Shader aus Hauptfunktionen, die "Prozessorfunktionen" genannt werden. Prozessorfunktionen sind der Einstiegspunkt für Ihren Shader in das Programm. Es gibt sieben verschiedene Prozessorfunktionen.
fr: Dans Godot, les shaders sont faits de fonctions principales appelées "fonctions de traitement". Ces fonctions de traitement sont les points d'entré de vos shaders dans le processus. Il y a sept fonctions de traitement différentes.
ru: В Godot шейдеры состоят из основных функций, называемых "процессорными функциями". Процессорные функции - это точка входа шейдера в программу. Существует семь различных функций процессора.
zh_tw: 在 Godot 中，著色器由若干主函式組成，這些函式被稱為“處理器函式”。處理器函式是著色器程式的入口。有七種不同的處理器函式。

source: The ``vertex()`` function runs over all the vertices in the mesh and sets their positions and some other per-vertex variables. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
de: Die Funktion ``vertex()`` durchläuft alle Vertices im Mesh und setzt ihre Positionen und einige andere Variablen pro Vertex. Wird verwendet in :ref:`canvas_item shaders <doc_canvas_item_shader>` und :ref:`spatial shaders <doc_spatial_shader>`.
fr: La fonction ``vertex()`` s'exécute sur tous les vertex du mesh et définit leurs positions ainsi que d'autres attributs propres aux vertex. Utilisée dans les types de shader :ref :`canvas_item <doc_canvas_item_shader>` et :ref :`spatial <doc_spatial_shader>`.
ru: Функция ``vertex()`` пробегает по всем вершинам сетки и задаёт их положение и некоторые другие переменные для каждой вершины. Используется в шейдерах :ref:`canvas_item <doc_canvas_item_shader>` и :ref:`spatial shaders <doc_spatial_shader>`.
zh_tw: ``vertex()`` 函式會為網格中的所有頂點各運作一次，用來設定頂點的位置和其他與頂點相關的變數。在 :ref:`canvas_item 著色器 <doc_canvas_item_shader>`和:ref:`空間著色器 <doc_spatial_shader>`中使用。

source: The ``fragment()`` function runs for every pixel covered by the mesh. It uses values output by the ``vertex()`` function, interpolated between the vertices. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
de: Die Funktion ``fragment()`` wird für jedes vom Mesh abgedeckte Pixel ausgeführt. Sie benutzt Werte, die von der ``vertex()``-Funktion ausgegeben werden, interpoliert zwischen den Vertices. Wird verwendet in :ref:`canvas_item shaders <doc_canvas_item_shader>` und :ref:`spatial shaders <doc_spatial_shader>`.
fr: La fonction ``fragment()`` s'exécute sur chaque pixel couvert par le mesh. Elle utilise les valeurs de sorties de la fonction ``vertex()``, interpolées entre les vertex. Utilsisée dans type de shader :ref :`canvas_item <doc_canvas_item_shader>` et :ref :`spatial <doc_spatial_shader>`.
ru: Функция ``fragment()`` выполняется для каждого пикселя, покрытого сеткой. Она использует значения, выводимые функцией ``vertex()``, интерполированные между вершинами. Используется в шейдерах :ref:`canvas_item shader <doc_canvas_item_shader>` и :ref:`spatial shader <doc_spatial_shader>`.
zh_tw: ``fragment()`` 函式會為網格所覆蓋的所有像素各運作一次。這個函式會用到 ``vertex()`` 函式輸出的值，這些值會在頂點之間進行插值。在 :ref:`canvas_item 著色器 <doc_canvas_item_shader>`和:ref:`空間著色器 <doc_spatial_shader>`中使用。

source: The ``light()`` function runs for every pixel and for every light. It takes variables from the ``fragment()`` function and from its previous runs. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
de: Die Funktion ``light()`` wird für jedes Pixel und für jede Lichtquelle ausgeführt. Sie nimmt Variablen von der ``fragment()``-Funktion und von ihren vorherigen Durchläufen. Sie wird verwendet in :ref:`canvas_item shaders <doc_canvas_item_shader>` und :ref:`spatial shaders <doc_spatial_shader>`.
fr: La fonction ``light()`` s'exécute sur chaque pixel et sur chaque lumière. Elle prends des attributs de la fonction ``fragment()`` et de ses exécutions précédentes. Utilisée dans les types de shaders :ref :`canvas_item <doc_canvas_item_shader>` et :ref :`spatial <doc_spatial_shader>`.
ru: Функция ``light()`` выполняется для каждого пикселя и для каждого освещения. Она берёт переменные из функции ``fragment()`` и из предыдущих запусков. Используется в шейдерах :ref:`canvas_item <doc_canvas_item_shader>` и :ref:`spatial shaders <doc_spatial_shader>`.
zh_tw: ``light()`` 函式會為每個像素和每個燈光各運作一次。這個函式會用到 ``fragment()`` 函式以及前幾次運作中的變數。在 :ref:`canvas_item 著色器 <doc_canvas_item_shader>`和:ref:`空間著色器 <doc_spatial_shader>`中使用。

source: The ``start()`` function runs for every particle in a particle system once when the particle is first spawned. Used in :ref:`particles shaders <doc_particle_shader>`.
de: Die Funktion ``start()`` wird für jedes Partikel in einem Partikelsystem einmal ausgeführt, wenn das Partikel zum ersten Mal gespawnt wird. Wird verwendet in :ref:`Partikel-Shadern <doc_particle_shader>`.
ru: Функция ``start()`` запускается для каждой частицы в системе частиц один раз, когда частица впервые порождается. Используется в шейдерах :ref:`particles shader <doc_particle_shader>`.
zh_tw: ``start()`` 函式會在粒子系統中的每個粒子出生時各運作一次。在:ref:`粒子著色器 <doc_particle_shader>`中使用。

source: The ``process()`` function runs for every particle in a particle system for each frame. Used in :ref:`particles shaders <doc_particle_shader>`.
de: Die Funktion ``process()`` läuft für jedes Partikel in einem Partikelsystem für jedes Frame. Sie wird verwendet in :ref:`Partikel-Shadern <doc_particle_shader>`.
ru: Функция ``process()`` выполняется для каждой частицы в системе частиц для каждого кадра. Используется в шейдерах :ref:`particles shader <doc_particle_shader>`.
zh_tw: ``start()`` 函式會為粒子系統中的每個粒子每影格時各運作一次。在:ref:`粒子著色器 <doc_particle_shader>`中使用。

source: The ``sky()`` function runs for every pixel in the radiance cubemap when the radiance cubemap needs to be updated, and for every pixel on the current screen. Used in :ref:`sky shaders <doc_sky_shader>`.
de: Die Funktion ``sky()`` wird für jedes Pixel in der Radiance Cubemap ausgeführt, wenn die Radiance Cubemap aktualisiert werden muss, und für jedes Pixel auf dem aktuellen Bildschirm. Wird verwendet in :ref:`Sky Shader <doc_sky_shader>`.
ru: Функция ``sky()`` запускается для каждого пикселя в кубической карте сияния, когда необходимо обновить кубическую карту сияния, и для каждого пикселя на текущем экране. Используется в :ref:`sky shaders <doc_sky_shader>`.
zh_tw: ``sky()`` 函式會在輻射度立方體貼圖需要更新時為輻射度立方體貼圖中的每個像素各運作一次，也會為目前螢幕上的每個像素運作一次。在:ref:`天空著色器 <doc_sky_shader>`中使用。

source: The ``fog()`` function runs for every froxel in the volumetric fog froxel buffer that intersects with the :ref:`FogVolume <class_FogVolume>`. Used by :ref:`fog shaders <doc_fog_shader>`.
de: Die Funktion ``fog()`` wird für jedes Froxel im volumetrischen Nebel-Froxel-Puffer ausgeführt, das sich mit dem :ref:`FogVolume <class_FogVolume>` schneidet. Wird verwendet von :ref:`Fog-Shadern <doc_fog_shader>`.
ru: Функция ``fog()`` выполняется для каждого фрокселя в объемном буфере фрокселей тумана, который пересекается с :ref:`FogVolume <class_FogVolume>`. Используется шейдерами :ref:`fog shader <doc_fog_shader>`.
zh_tw: ``fog()`` 函式會為體積霧片段體素緩衝中與 :ref:`FogVolume <class_FogVolume>` 相交的每個片段體素運作一次。在:ref:`霧著色器 <doc_fog_shader>`中使用。

source: The ``light()`` function won't run if the ``vertex_lighting`` render mode is enabled, or if **Rendering > Quality > Shading > Force Vertex Shading** is enabled in the Project Settings. It's enabled by default on mobile platforms.
de: Die Funktion ``light()`` wird nicht ausgeführt, wenn der Rendermodus ``vertex_lighting`` aktiviert ist, oder wenn **Rendering > Qualität > Schattierung > Vertex-Schattierung erzwingen** in den Projekteinstellungen aktiviert ist. Auf mobilen Plattformen ist es standardmäßig aktiviert.
fr: La fonction ``light()`` ne sera pas exécutée si le mode de rendu ``vertex_lighting`` est activé, ou si **Rendering > Quality > Shading > Force Vertex Shading** est activé dans les paramètres du projet. C'est activée par défaut sur les plateformes mobiles.
ru: Функция ``light()`` не будет выполняться, если включен режим рендеринга ``vertex_lighting`` или если в настройках проекта включено **Rendering > Quality > Shading > Force Vertex Shading**. На мобильных платформах он включен по умолчанию.
zh_tw: 如果啟用了 ``vertex_lighting`` 算繪模式，或者在專案設定中啟用了 **Rendering > Quality > Shading > Force Vertex Shading**（算繪 > 品質 > 著色 > 強制頂點著色），則不會運作 ``light()`` 函式。在移動平臺上預設啟用。

source: Godot also exposes an API for users to write totally custom GLSL shaders. For more information see :ref:`doc_compute_shaders`.
de: Godot stellt auch eine API zur Verfügung, mit der Benutzer völlig eigene GLSL-Shader schreiben können. Für weitere Informationen siehe :ref:`doc_compute_shaders`.
ru: Godot также предоставляет пользователям API для написания полностью собственных GLSL-шейдеров. Более подробную информацию можно найти в :ref:`doc_compute_shaders`.
zh_tw: Godot 還為使用者編寫完全自訂的 GLSL 著色器暴露了 API。詳見 :ref:`doc_compute_shaders`。

source: Shader types
de: Shader-Typen
fr: Types de shader
ru: Типы шейдеров
zh_tw: 著色器型別

source: Instead of supplying a general-purpose configuration for all uses (2D, 3D, particles, sky, fog), you must specify the type of shader you're writing. Different types support different render modes, built-in variables, and processing functions.
de: Anstatt eine Allzweckkonfiguration für alle Verwendungszwecke (2D, 3D, Partikel, Himmel, Nebel) bereitzustellen, müssen Sie den Typ des Shaders angeben, den Sie schreiben. Verschiedene Typen unterstützen unterschiedliche Rendermodi, Built-in-Variablen und Prozessierungsfunktionen.
ru: Вместо того, чтобы предоставлять конфигурацию общего назначения для всех случаев использования (2D, 3D, частицы, небо, туман), вы должны указать тип шейдера, который вы пишете. Разные типы поддерживают различные режимы рендеринга, встроенные переменные и функции обработки.
zh_tw: 你所編寫的著色器必須指定型別（2D、3D、粒子、天空、霧），不存在所有場景都可以使用的通用配置。不同的型別支援不同的算繪模式、內建變數、處理函式。

source: In Godot, all shaders need to specify their type in the first line, like so:
de: In Godot müssen alle Shader ihren Typ in der ersten Zeile angeben, etwa so:
fr: Dans Godot, tous les shaders doivent spécifier leur type dans la première ligne, comme ceci :
ru: В Godot все шейдеры должны указывать свой тип в первой строке, например, так:
zh_tw: 在 Godot 中，所有的著色器都需要在第一行指定它們的型別，類似這樣：

source: Here are the available types:
de: Hier sind die verfügbaren Typen:
fr: Voici les types disponibles :
ru: Ниже представлены доступные типы:
zh_tw: 有六種搜尋模式：

source: :ref:`spatial <doc_spatial_shader>` for 3D rendering.
de: :ref:`spatial <doc_spatial_shader>` für 3D-Rendering.
fr: :ref:`spatial <doc_spatial_shader>` pour le rendu 3D.
ru: :ref:`spatial <doc_spatial_shader>` для 3D визуализации.
zh_tw: :ref:`doc_spatial_shader`

source: :ref:`canvas_item <doc_canvas_item_shader>` for 2D rendering.
de: :ref:`canvas_item <doc_canvas_item_shader>` für 2D-Rendering.
fr: :ref:`canvas_item <doc_canvas_item_shader>` pour le rendu 2D.
ru: :ref:`canvas_item <doc_canvas_item_shader>` для 2D визуализации.
zh_tw: :ref:`doc_canvas_item_shader`

source: :ref:`particles <doc_particle_shader>` for particle systems.
de: :ref:`particles <doc_particle_shader>` für Partikelsysteme.
fr: :ref:`particles <doc_particle_shader>` pour les systèmes de particules.
ru: :ref:`particles <doc_particle_shader>` для системы частиц.
zh_tw: :ref:`doc_particle_shader`

source: :ref:`sky <doc_sky_shader>` to render :ref:`Skies <class_Sky>`.
de: :ref:`Himmel <doc_sky_shader>` zum Rendern eines :ref:`Himmels <class_Sky>`.
ru: :ref:`sky <doc_sky_shader>` для визуализации :ref:`Неба <class_Sky>`.
zh_tw: 用於算繪 :ref:`Skies <class_Sky>` 的 :ref:`sky <doc_sky_shader>`。

source: :ref:`fog <doc_fog_shader>` to render :ref:`FogVolumes <class_FogVolume>`
de: :ref:`Nebel <doc_fog_shader>` zum Rendern von :ref:`Fog-Volumes<class_FogVolume>`
ru: :ref:`fog <doc_fog_shader>` для визуализации :ref:`Объёмного тумана <class_FogVolume>`
zh_tw: 用於算繪 :ref:`FogVolumes <class_FogVolume>` 的 :ref:`fog <doc_fog_shader>`

source: Render modes
de: Render-Modi
fr: Mode de rendu
ru: Режимы визуализации
zh_tw: 算繪模式

source: Shaders have optional render modes you can specify on the second line, after the shader type, like so:
de: Shader haben optionale Rendermodi, die Sie in der zweiten Zeile nach dem Shader-Typ angeben können, etwa so:
fr: Les shaders ont des modes de rendu optionnels que vous pouvez spécifier sur la deuxième ligne, après le type de shader, comme suit :
ru: Шейдеры имеют дополнительные режимы рендеринга, которые можно указать во второй строке после типа шейдера, например, так:
zh_tw: 可以在著色器的第二行，也就是在著色器型別之後，指定算繪模式，類似這樣：

source: Render modes alter the way Godot applies the shader. For example, the ``unshaded`` mode makes the engine skip the built-in light processor function.
de: Rendermodi verändern die Art und Weise, wie Godot den Shader anwendet. Zum Beispiel überspringt die Engine im Modus ``unshaded`` die eingebaute Lichtprozessorfunktion.
fr: Les modes de rendu modifient la façon dont Godot applique le shader. Par exemple, le mode ``unshaded`` fait ignorer au moteur la fonction intégrée de processeur de lumière.
ru: Режимы рендеринга изменяют способ применения шейдера Godot. Например, режим ``unshaded`` заставляет движок пропустить встроенную функцию обработки света.
zh_tw: 算繪模式會修改 Godot 應用著色器的方式。例如，``unshaded`` 模式會讓引擎跳過內建的光線處理器函式。

source: Each shader type has different render modes. See the reference for each shader type for a complete list of render modes.
de: Jeder Shader-Typ hat verschiedene Render-Modi. Eine vollständige Liste der Rendermodi finden Sie in der Referenz für jeden Shadertyp.
fr: Chaque type de shader possède différents modes de rendu. Consultez la référence de chaque type de shader pour obtenir une liste complète des modes de rendu.
ru: Каждый тип шейдера имеет различные режимы рендеринга. Полный список режимов рендеринга см. в справке по каждому типу шейдера.
zh_tw: 每種著色器型別都有不同的算繪模式。每種著色器型別的完整算繪模式列表請參閱參考手冊。

source: Vertex processor
de: Vertex-Prozessor
fr: Processeur de sommet
ru: Вершинный процессор
zh_tw: 頂點處理器

source: The ``vertex()`` processing function is called once for every vertex in ``spatial`` and ``canvas_item`` shaders. For ``particles`` shaders, it is called once for every particle.
de: Die Prozessierungsfunktion ``vertex()`` wird in ``spatial`` und ``canvas_item``-Shadern einmal für jeden Vertex aufgerufen. Bei ``Partikel``-Shadern wird sie für jedes Partikel einmal aufgerufen.
fr: La fonction de traitement ``vertex()`` est appelée une fois pour chaque vertex dans les shaders ``spatial`` et ``canvas_item``. Pour les shaders ``particles``, elle est appelé une fois pour chaque particule.
ru: Функция обработки ``vertex()`` вызывается один раз для каждой вершины в шейдерах ``spatial`` и ``canvas_item``. В шейдерах ``particles`` она вызывается один раз для каждой частицы.
zh_tw: 在 ``spatial`` 和 ``canvas_item`` 著色器中，會為每一個頂點呼叫 ``vertex()`` 處理函式。在 ``particles`` 著色器中則會為每一個粒子呼叫一次。
