Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/introduction_to_shaders.po
Languages: de, fr, ru, zh_tw

source: Each vertex in your world's geometry has properties like a position and color. The function modifies those values and passes them to the fragment function. You can also use it to send extra data to the fragment function using varyings.
de: Jeder Vertex in der Geometrie Ihrer Welt hat Eigenschaften, wie eine Position und eine Farbe. Die Funktion ändert diese Werte und übergibt sie an die Fragment-Funktion. Sie können damit auch zusätzliche Daten an die Fragmentfunktion senden, indem Sie Varyings verwenden.
fr: Chaque sommet de la géométrie de votre monde possède des propriétés telles qu'une position et une couleur. Cette fonction modifie ces valeurs et les transmet à la fonction fragment. Vous pouvez également l'utiliser pour envoyer des données supplémentaires à la fonction fragment en utilisant des varyings.
ru: Каждая вершина в геометрии вашего мира имеет такие свойства, как положение и цвет. Функция изменяет эти значения и передает их в функцию fragment. Вы также можете использовать её для передачи дополнительных данных в функцию fragment с помощью varying.
zh_tw: 你的世界中的幾何體上，每一個頂點都有位置、顏色等屬性。該函式會修改這些值，並將其傳入片段函式。你也可以借助 varying 向片段著色器傳遞額外的資料。

source: By default, Godot transforms your vertex information for you, which is necessary to project geometry onto the screen. You can use render modes to transform the data yourself; see the :ref:`Spatial shader doc <doc_spatial_shader>` for an example.
de: Standardmäßig transformiert Godot die Vertex-Informationen für Sie, die notwendig sind, um die Geometrie auf den Bildschirm zu projizieren. Sie können Rendermodi verwenden, um die Daten selbst zu transformieren; ein Beispiel finden Sie in der :ref:`Spatial-Shader-Dokumentation<doc_spatial_shader>`.
fr: Par défaut, Godot transforme vos informations de vertex pour vous, ce qui est nécessaire pour projeter la géométrie sur l'écran. Vous pouvez utiliser les modes de rendu pour transformer les données vous-même ; voir le :ref:`Spatial shader doc <doc_spatial_shader>` pour un exemple.
ru: По умолчанию Godot преобразует для вас информацию о вершинах, которая необходима для проецирования геометрии на экран. Вы можете использовать режимы рендеринга для самостоятельного преобразования данных; пример смотрите в :ref:`Шейдер Spatial doc <doc_spatial_shader>`.
zh_tw: 預設情況下，Godot 會為你對頂點資訊進行變換，這是將幾何體投影到螢幕上所必須的。你可以使用算繪模式來自行變換資料；範例見 :ref:`Spatial 著色器文件 <doc_spatial_shader>`。

source: Fragment processor
de: Fragment-Prozessor
fr: Processeur de fragments
ru: Фрагментный процессор
zh_tw: 片段處理器

source: The ``fragment()`` processing function is used to set up the Godot material parameters per pixel. This code runs on every visible pixel the object or primitive draws. It is only available in ``spatial``, ``canvas_item``, and ``sky`` shaders.
de: Die Prozessierungsfunktion ``fragment()`` wird verwendet, um die Godot-Materialparameter pro Pixel einzustellen. Dieser Code läuft auf jedem sichtbaren Pixel, den das Objekt oder Primitiv zeichnet. Er ist nur in ``spatial``, ``canvas_item`` und ``sky``-Shadern verfügbar.
ru: Функция обработки ``fragment()`` используется для установки параметров материала Godot на каждый пиксель. Этот код запускается на каждом видимом пикселе, который рисует объект или примитив. Он доступен только в шейдерах ``spatial``, ``canvas_item`` и ``sky``.
zh_tw: ``fragment()`` 處理函式的作用是設定每一個像素的 Godot 材質參數。這裡的程式碼會在繪製的物件或像素的每一個可見像素上執行。只能在 ``spatial``、``canvas_item``、``sky`` 著色器中使用。

source: The standard use of the fragment function is to set up material properties used to calculate lighting. For example, you would set values for ``ROUGHNESS``, ``RIM``, or ``TRANSMISSION``, which would tell the light function how the lights respond to that fragment. This makes it possible to control a complex shading pipeline without the user having to write much code. If you don't need this built-in functionality, you can ignore it and write your own light processing function, and Godot will optimize it away. For example, if you do not write a value to ``RIM``, Godot will not calculate rim lighting. During compilation, Godot checks to see if ``RIM`` is used; if not, it cuts all the corresponding code out. Therefore, you will not waste calculations on the effects that you do not use.
de: Die Standardanwendung der Fragmentfunktion ist die Einstellung von Materialeigenschaften, die zur Berechnung der Beleuchtung verwendet werden. Zum Beispiel würden Sie Werte für ``ROUGHNESS``, ``RIM`` oder ``TRANSMISSION`` setzen, die der Lichtfunktion mitteilen, wie die Lichter auf dieses Fragment reagieren. Dies macht es möglich, eine komplexe Shading-Pipeline zu steuern, ohne dass der Benutzer viel Code schreiben muss. Wenn Sie diese eingebaute Funktionalität nicht benötigen, können Sie sie ignorieren und Ihre eigene Lichtverarbeitungsfunktion schreiben, und Godot wird sie wegoptimieren. Wenn Sie zum Beispiel keinen Wert für ``RIM`` schreiben, wird Godot keine Randbeleuchtung berechnen. Während des Kompilierens prüft Godot, ob ``RIM`` verwendet wird; wenn nicht, schneidet es den gesamten entsprechenden Code heraus. Daher werden Sie keine Berechnungen für Effekte verschwenden, die Sie nicht verwenden.
fr: L'utilisation standard de la fonction de fragment consiste à définir les propriétés des matériaux qui seront utilisées pour calculer l'éclairage. Par exemple, vous pouvez définir des valeurs pour ``ROUGHNESS``, ``RIM``, ou ``TRANSMISSION`` qui indiquent à la fonction de lumière comment les lumières réagissent à ce fragment. Cela permet de contrôler un pipeline de shading complexe sans que l'utilisateur n'ait à écrire beaucoup de code. Si vous n'avez pas besoin de cette fonctionnalité intégrée, vous pouvez l'ignorer et écrire votre propre fonction de traitement de la lumière et Godot l'optimisera. Par exemple, si vous n'écrivez pas de valeur à ``RIM``, Godot ne calculera pas l'éclairage rim. Lors de la compilation, Godot vérifie si ``RIM`` est utilisé ; si ce n'est pas le cas, il coupe tout le code correspondant. Par conséquent, vous ne gaspillerez pas les calculs sur des effets que vous n'utilisez pas.
ru: Стандартным использованием фрагментной функции является настройка свойств материала, которые будут использоваться для расчёта освещения. Например, вы должны установить значения для ``ROUGHNESS`` (шероховатости поверхности), ``RIM`` (контура света) или ``TRANSMISSION`` (пропускания света), которые сообщат световой функции, как свет реагирует на этот фрагмент. Это позволяет контролировать сложную последовательность процессов шейдинга без необходимости написания пользователем большого количества кода. Если вам не нужен этот встроенный функционал, вы можете игнорировать его и написать свою собственную функцию обработки света, и Godot её оптимизирует. Например, если вы не укажете значение для ``RIM``, Godot не будет рассчитывать контурное освещение. Во время компиляции Godot проверяет, используется ли ``RIM``; если нет, то он вырежет весь соответствующий код. Таким образом, вы не будете тратить вычисления на эффекты, которые не используете.
zh_tw: 片段函式的標準用途是設定用於計算光照的材質屬性。例如，你可以為 ``ROUGHNESS``、``RIM``、``TRNASMISSION`` 等設定值，告訴光照函式光照應該如何處理對應的片段。這樣就可以控制複雜的著色管線，而不必讓使用者編寫過多的程式碼。如果你不需要這一內建功能，那麼你可以忽略它，自行編寫光照處理函式，Godot 會將其優化掉。例如，如果你沒有向 ``RIM`` 寫入任何值，那麼 Godot 就不會計算邊緣光照。編譯時，Godot 會檢查是否使用了 ``RIM``；如果沒有，那麼它就會把對應的程式碼刪除。因此，你就不會在沒有使用的效果上浪費算力。

source: Light processor
de: Licht-Prozessor
fr: Processeur de lumière
ru: Световой процессор
zh_tw: 光照處理器

source: The ``light()`` processor runs per pixel too, and it runs once for every light that affects the object. It does not run if no lights affect the object. It exists as a function called inside the ``fragment()`` processor and typically operates on the material properties setup inside the ``fragment()`` function.
de: Der ``Licht()`` -Prozessor läuft ebenfalls pro Pixel, und er läuft einmal für jedes Licht, das auf das Objekt einwirkt. Er wird nicht ausgeführt, wenn keine Lichter das Objekt beeinflussen. Er existiert als eine Funktion, die innerhalb des ``Fragment()``-Prozessors aufgerufen wird und arbeitet normalerweise mit den Materialeigenschaften, die innerhalb der ``Fragment()`` Funktion eingestellt wurden.
fr: Le traitement ``light()`` fonctionne également par pixel, et il s'exécute une fois pour chaque lumière qui affecte l'objet. Il ne s'exécute pas si aucune lumière n'affecte l'objet. Il existe sous la forme d'une fonction appelée à l'intérieur du traitement ``fragment()`` et opère généralement sur les propriétés du matériau configurées à l'intérieur de la fonction ``fragment()``.
ru: Процессор ``light()`` также работает попиксельно, и он запускается один раз для каждого источника освещения, который влияет на объект. Он не запускается, если ни один источник освещения не влияет на объект. Он существует как функция, вызываемая внутри процессора ``fragment()`` и обычно оперирует свойствами материала, заданными в функции ``fragment()``.
zh_tw: ``light()`` 處理器也會在每一個像素上運作，並且同時還會在每一個影響該物件的燈光上運作。如果沒有燈光影響該物件則不會運作。它會被用於 ``fragment()`` 處理器，一般會在 ``fragment()`` 函式中進行材質屬性設定時執行。

source: The ``light()`` processor works differently in 2D than it does in 3D; for a description of how it works in each, see their documentation, :ref:`CanvasItem shaders <doc_canvas_item_shader>` and :ref:`Spatial shaders <doc_spatial_shader>`, respectively.
de: Der ``Licht()``-Prozessor arbeitet in 2D anders als in 3D; für eine Beschreibung, wie er in beiden Fällen arbeitet, siehe deren Dokumentation, :ref:`CanvasItem-Shader <doc_canvas_item_shader>` und :ref:`Spatial-Shader <doc_spatial_shader>`.
fr: Le traitement ``light()`` fonctionne différemment en 2D et en 3D ; pour une description du fonctionnement de chacun, consultez leur documentation, :ref:`CanvasItem shaders <doc_canvas_item_shader>` et :ref:`Spatial shaders <doc_spatial_shader>`, respectivement.
ru: Процессор ``light()`` работает в 2D иначе, чем в 3D; для описания того, как он работает в каждом из них, смотрите их документацию, :ref:`Шейдеры CanvasItem <doc_canvas_item_shader>` и :ref:`Шейдеры Spatial <doc_spatial_shader>`, соответственно.
zh_tw: ``light()`` 處理器在 2D 和 3D 中的工作方式不同；每種工作方式的詳細描述請參閱它們對應的文件 :ref:`CanvasItem 著色器 <doc_canvas_item_shader>` and :ref:`Spatial 著色器 <doc_spatial_shader>`。

source: Translation status
de: Übersetzungsstatus
fr: État de la traduction
ru: Статус перевода
zh_tw: 翻譯狀態
