Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/screen-reading_shaders.po
Languages: de, zh_cn, zh_tw

source: Screen-reading shaders
de: Screen-Reading-Shader
zh_cn: 屏幕读取着色器
zh_tw: 螢幕閱讀著色器

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: It is often desired to make a shader that reads from the same screen to which it's writing. 3D APIs, such as OpenGL or DirectX, make this very difficult because of internal hardware limitations. GPUs are extremely parallel, so reading and writing causes all sorts of cache and coherency problems. As a result, not even the most modern hardware supports this properly.
de: Es ist oft erwünscht, einen Shader zu erstellen, der von demselben Bildschirm liest, auf den er schreibt. 3D-APIs wie OpenGL oder DirectX machen dies aufgrund interner Hardwarebeschränkungen sehr schwierig. GPUs sind extrem parallel, so dass das Lesen und Schreiben alle möglichen Cache- und Kohärenzprobleme verursacht. Infolgedessen wird dies nicht einmal von der modernsten Hardware richtig unterstützt.
zh_cn: 很多人想要让着色器在写屏幕的同时读取该屏幕的数据。因为内部硬件限制，OpenGL 和 DirectX 等 3D API 都很难实现这一功能。GPU 是极其并行的，所以同时进行读写会导致各种缓存和一致性问题。因此，即便是最新的硬件也对此进行无法正确的支持。
zh_tw: 很多人想要讓著色器在寫螢幕的同時讀取該螢幕的資料。因為內部硬體限制，OpenGL 和 DirectX 等 3D API 都很難實作這一功能。GPU 是極其並行的，所以同時進行讀寫會導致各種快取和一致性問題。因此，即便是最新的硬體也對此進行無法正確的支援。

source: The workaround is to make a copy of the screen, or a part of the screen, to a back-buffer and then read from it while drawing. Godot provides a few tools that make this process easy.
de: Der Workaround besteht darin, eine Kopie des Bildschirms oder eines Teils des Bildschirms in einen Hintergrundpuffer zu erstellen und dann beim Zeichnen daraus zu lesen. Godot bietet einige Tools, die diesen Prozess vereinfachen.
zh_cn: 解决办法是将屏幕或屏幕的一部分复制到一个后台缓冲区，然后在绘图时从那里读取。Godot 提供了一些工具，可以使这一过程变得很容易。
zh_tw: 解決辦法是將螢幕或螢幕的一部分複製到一個背景緩衝區，然後在繪圖時從那裡讀取。Godot 提供了一些工具，可以使這一過程變得很容易。

source: Screen texture
de: Bildschirmtextur
zh_cn: 屏幕纹理
zh_tw: 匯入紋理

source: Godot :ref:`doc_shading_language` has a special texture to access the already rendered contents of the screen. It is used by specifying a hint when declaring a ``sampler2D`` uniform: ``hint_screen_texture``. A special built-in varying ``SCREEN_UV`` can be used to obtain the UV relative to the screen for the current fragment. As a result, this canvas_item fragment shader results in an invisible object, because it only shows what lies behind:
de: Godot :ref:`doc_shading_language` hat eine spezielle Textur, um auf den bereits gerenderten Inhalt des Bildschirms zuzugreifen. Sie wird durch die Angabe eines Hints bei der Deklaration einer ``sampler2D``-Uniform verwendet: ``hint_screen_texture``. Ein spezielles Built-in-Varying ``SCREEN_UV`` kann verwendet werden, um die UV relativ zum Bildschirm für das aktuelle Fragment zu erhalten. Das Ergebnis dieses canvas_item Fragment-Shaders ist ein unsichtbares Objekt, da er nur das zeigt, was dahinter liegt:
zh_tw: Godot :ref:`doc_shading_language` 有一個特殊的紋理, ``SCREEN_TEXTURE`` (在3D的情況下, ``DEPTH_TEXTURE`` 代表深度). 它以螢幕的UV作為參數, 並返回一個帶有顏色的RGB vec3. 一個特殊的內建變數.SCREEN_UV可以用來獲取目前片段的UV. 因此, 這是個簡單的canvas_item片段著色器:

source: ``textureLod`` is used here as we only want to read from the bottom mipmap. If you want to read from a blurred version of the texture instead, you can increase the third argument to ``textureLod`` and change the hint ``filter_nearest`` to ``filter_nearest_mipmap`` (or any other filter with mipmaps enabled). If using a filter with mipmaps, Godot will automatically calculate the blurred texture for you.
de: ``textureLod`` wird hier verwendet, da wir nur die untere Mipmap auslesen wollen. Wenn Sie stattdessen von einer unscharfen Version der Textur lesen wollen, können Sie das dritte Argument auf ``textureLod`` erhöhen und den Hint ``filter_nearest`` auf ``filter_nearest_mipmap`` ändern (oder jeden anderen Filter mit aktivierten Mipmaps). Wenn Sie einen Filter mit Mipmaps verwenden, wird Godot automatisch die unscharfe Textur für Sie berechnen.
zh_tw: 這裡使用「textureLod」是因為我們只想從底部 mipmap 讀取。如果您想讀取紋理的模糊版本，則可以將第三個參數增加為“textureLod”，並將提示“filter_nearest”更改為“filter_nearest_mipmap”（或啟用 mipmap 的任何其他篩選器） 。如果使用具有 mipmap 的濾鏡，Godot 會自動為您計算模糊紋理。

source: If the filter mode is not changed to a filter mode that contains ``mipmap`` in its name, ``textureLod`` with a LOD parameter greater than ``0.0`` will have the same appearance as with the ``0.0`` LOD parameter.
de: Wenn der Filtermodus nicht in einen Filtermodus geändert wird, der ``mipmap`` in seinem Namen enthält, hat ``textureLod`` mit einem LOD-Parameter größer als ``0.0`` das gleiche Aussehen wie mit dem LOD-Parameter ``0.0``.

source: Screen texture example
de: Beispiel für eine Bildschirmtextur
zh_cn: 屏幕纹理示例
zh_tw: 另一個範例：

source: The screen texture can be used for many things. There is a special demo for *Screen Space Shaders*, that you can download to see and learn. One example is a simple shader to adjust brightness, contrast and saturation:
de: Die Bildschirmtextur kann für viele Dinge verwendet werden. Es gibt eine spezielle Demo für *Screen Space-Shader*, die Sie herunterladen können, um sie anzuschauen und daraus zu lernen. Ein Beispiel ist ein einfacher Shader zur Anpassung von Helligkeit, Kontrast und Sättigung:
zh_cn: 屏幕纹理可以用来做很多事情。有一个针对\ *屏幕空间着色器*\ 的特殊演示项目，你可以下载后查看学习。其中的一个例子就是用简单的着色器来调整亮度、对比度以及饱和度：
zh_tw: 螢幕紋理可以用來做很多事情。有一個針對*螢幕空間著色器*的特殊演示專案，你可以下載後查看學習。其中的一個例子就是用簡單的著色器來調整亮度、對比度以及飽和度：

source: Behind the scenes
de: Hinter den Kulissen
zh_cn: 幕后
zh_tw: 幕後

source: While this seems magical, it's not. In 2D, when ``hint_screen_texture`` is first found in a node that is about to be drawn, Godot does a full-screen copy to a back-buffer. Subsequent nodes that use it in shaders will not have the screen copied for them, because this ends up being inefficient. In 3D, the screen is copied after the opaque geometry pass, but before the transparent geometry pass, so transparent objects will not be captured in the screen texture.
de: Obwohl dies wie Magie erscheint, ist es das nicht. In 2D, wenn ``hint_screen_texture`` zum ersten Mal in einem Node gefunden wird, der gerade gezeichnet werden soll, kopiert Godot den gesamten Bildschirm in einen Hintergrund-Puffer. Nachfolgende Nodes, die ihn in Shadern verwenden, werden den Bildschirm nicht kopieren, da dies ineffizient ist. In 3D wird der Bildschirm nach dem Durchlauf der undurchsichtigen Geometrie, aber vor dem Durchlauf der transparenten Geometrie kopiert, so dass transparente Objekte nicht in der Bildschirmtextur erfasst werden.
zh_cn: 虽然这看起来很神奇，但其实不然。在 2D 中，第一次在即将绘制的节点中发现 ``hint_screen_texture`` 时，Godot 就会将整个屏幕拷贝到后台缓冲之中。后续在着色器中使用它的节点将不会造成屏幕的复制，因为否则的话效率非常低。在 3D 中，进行屏幕拷贝的时机是在不透明几何体阶段之后、透明几何体阶段之前，所以透明的物体不会被捕捉到屏幕纹理之中。
zh_tw: 雖然這看起來很神奇，但其實不然。在 2D 中，第一次在即將繪製的節點中發現 ``hint_screen_texture`` 時，Godot 就會將整個螢幕拷貝到後臺緩衝之中。後續在著色器中使用它的節點將不會造成螢幕的複製，因為否則的話效率非常低。在 3D 中，進行螢幕拷貝的時機是在不透明幾何體階段之後、透明幾何體階段之前，所以透明的物體不會被捕捉到螢幕紋理之中。

source: As a result, in 2D, if shaders that use ``hint_screen_texture`` overlap, the second one will not use the result of the first one, resulting in unexpected visuals:
de: Wenn sich Shader, die ``hint_screen_texture`` verwenden, in 2D überlappen, wird der zweite Shader nicht das Ergebnis des ersten verwenden, was zu unerwarteten visuellen Effekten führt:
zh_cn: 因此，在 2D 中，如果使用 ``hint_screen_texture`` 的着色器存在覆盖，那么后一个着色器使用的就不是第一个着色器的结果，会导致意外的图像：
zh_tw: 因此，在 2D 中，如果使用 ``hint_screen_texture`` 的著色器存在覆蓋，那麼後一個著色器使用的就不是第一個著色器的結果，會導致意外的圖像：

source: In the above image, the second sphere (top right) is using the same source for the screen texture as the first one below, so the first one "disappears", or is not visible.
de: Im obigen Bild verwendet die zweite Kugel (oben rechts) die gleiche Quelle für die Bildschirmtextur wie die erste darunter, so dass die erste Kugel "verschwindet" oder nicht sichtbar ist.
zh_cn: 在上图中，第二个球体（右上）所使用的屏幕纹理和第一个球体所使用的屏幕纹理的来源是一致的，所以第一个球体会“消失”，或者说不可见。
zh_tw: 在上圖中，第二個球體（右上）所使用的螢幕紋理和第一個球體所使用的螢幕紋理的來源是一致的，所以第一個球體會“消失”，或者說不可見。

source: In 2D, this can be corrected via the :ref:`BackBufferCopy <class_BackBufferCopy>` node, which can be instantiated between both spheres. BackBufferCopy can work by either specifying a screen region or the whole screen:
de: In 2D kann dies durch den Node :ref:`BackBufferCopy <class_BackBufferCopy>` korrigiert werden, der zwischen beiden Kugeln instanziiert werden kann. BackBufferCopy kann entweder durch Angabe eines Bildschirmbereichs oder des gesamten Bildschirms arbeiten:
zh_cn: 在 2D 中，这个问题可以通过 :ref:`BackBufferCopy <class_BackBufferCopy>` 节点修正，在这两个球体之间实例化即可。BackBufferCopy 可以指定屏幕上的某个区域进行复制，也可以复制整个屏幕：
zh_tw: 在 2D 中，這個問題可以通過 :ref:`BackBufferCopy <class_BackBufferCopy>` 節點修正，在這兩個球體之間產生實體即可。BackBufferCopy 可以指定螢幕上的某個區域進行複製，也可以複製整個螢幕：

source: With correct back-buffer copying, the two spheres blend correctly:
de: Bei richtigem Kopieren des Hintergrundpuffers zeigen die beiden Kugeln ein korrektes Blending:
zh_cn: 正确复制后台缓冲之后，这两个球体就能够正确混合了：
zh_tw: 正確複製後臺緩衝之後，這兩個球體就能夠正確混合了：

source: In 3D, materials that use ``hint_screen_texture`` are considered transparent themselves and will not appear in the resulting screen texture of other materials. If you plan to instance a scene that uses a material with ``hint_screen_texture``, you will need to use a BackBufferCopy node.
de: In 3D werden Materialien, die ``hint_screen_texture`` verwenden, selbst als transparent angesehen und erscheinen nicht in der resultierenden Bildschirmtextur anderer Materialien. Wenn Sie eine Szene instanziieren wollen, die ein Material mit ``hint_screen_texture`` verwendet, müssen Sie einen BackBufferCopy-Node verwenden.

source: In 3D, there is less flexibility to solve this particular issue because the screen texture is only captured once. Be careful when using the screen texture in 3D as it won't capture transparent objects and may capture some opaque objects that are in front of the object using the screen texture.
de: In 3D gibt es weniger Möglichkeiten, dieses Problem zu lösen, da die Bildschirmtextur nur einmal erfasst wird. Seien Sie vorsichtig, wenn Sie die Bildschirmtextur in 3D verwenden, da sie keine transparenten Objekte erfasst und möglicherweise einige undurchsichtige Objekte erfasst, die sich vor dem Objekt befinden, das die Bildschirmtextur verwendet.
zh_cn: 在 3D 中，这个问题解决起来就没有那么灵活，因为屏幕纹理只会捕捉一次。在 3D 中使用屏幕纹理时请多加小心，因为它并不会捕获到透明的对象，反而可能捕获到位于使用屏幕纹理的对象之前的不透明对象。
zh_tw: 在 3D 中，這個問題解決起來就沒有那麼靈活，因為螢幕紋理只會捕捉一次。在 3D 中使用螢幕紋理時請多加小心，因為它並不會捕獲到透明的物件，反而可能捕獲到位於使用螢幕紋理的物件之前的不透明物件。

source: You can reproduce the back-buffer logic in 3D by creating a :ref:`Viewport <class_Viewport>` with a camera in the same position as your object, and then use the :ref:`Viewport's <class_Viewport>` texture instead of the screen texture.
de: Sie können die Hintergrund-Puffer-Logik in 3D reproduzieren, indem Sie einen :ref:`Viewport <class_Viewport>` mit einer Kamera an der gleichen Position wie Ihr Objekt erstellen und dann die Textur des :ref:`Viewports <class_Viewport>` anstelle der Bildschirmtextur verwenden.
zh_cn: 要在 3D 中重现后台缓冲的逻辑，可以创建一个 :ref:`Viewport <class_Viewport>` 并在对象的位置创建一个相机，然后就可以使用该 :ref:`Viewport <class_Viewport>` 的纹理来代替屏幕纹理。
zh_tw: 要在 3D 中重現後臺緩衝的邏輯，可以建立一個 :ref:`Viewport <class_Viewport>` 並在物件的位置建立一個相機，然後就可以使用該 :ref:`Viewport <class_Viewport>` 的紋理來代替螢幕紋理。

source: Back-buffer logic
de: Hintergrundpuffer-Logik
zh_cn: 后台缓冲逻辑
zh_tw: 後臺緩衝邏輯

source: So, to make it clearer, here's how the backbuffer copying logic works in 2D in Godot:
de: Zur Verdeutlichung: So funktioniert die Hintergrundpuffer-Kopierlogik in 2D in Godot:
zh_cn: 好的，想要对后台缓冲有更清晰的理解的话，Godot 在 2D 中后台缓冲复制的原理是这样的：
zh_tw: 好的，想要對後臺緩衝有更清晰的理解的話，Godot 在 2D 中後臺緩衝複製的原理是這樣的：

source: If a node uses ``hint_screen_texture``, the entire screen is copied to the back buffer before drawing that node. This only happens the first time; subsequent nodes do not trigger this.
de: Wenn ein Node ``hint_screen_texture`` verwendet, wird der gesamte Bildschirm in den Hintergrundpuffer kopiert, bevor dieser Knoten gezeichnet wird. Dies geschieht nur beim ersten Mal; nachfolgende Nodes lösen dies nicht aus.
zh_cn: 如果某个节点使用了 ``hint_screen_texture``\ ，那么绘制该节点之前就会将整个屏幕复制到后台缓冲之中。只有第一次才会这么做，后续的节点不会触发。
zh_tw: 如果某個節點使用了 ``hint_screen_texture``，那麼繪製該節點之前就會將整個螢幕複製到後臺緩衝之中。只有第一次才會這麼做，後續的節點不會觸發。

source: If a BackBufferCopy node was processed before the situation in the point above (even if ``hint_screen_texture`` was not used), the behavior described in the point above does not happen. In other words, automatic copying of the entire screen only happens if ``hint_screen_texture`` is used in a node for the first time and no BackBufferCopy node (not disabled) was found before in tree-order.
de: Wenn ein BackBufferCopy-Node vor der Situation im obigen Punkt verarbeitet wurde (auch wenn ``hint_screen_texture`` nicht verwendet wurde), tritt das im obigen Punkt beschriebene Verhalten nicht auf. Mit anderen Worten, das automatische Kopieren des gesamten Bildschirms geschieht nur, wenn ``hint_screen_texture`` zum ersten Mal in einem Node verwendet wird und vorher kein BackBufferCopy-Node (nicht deaktiviert) in der Baumreihenfolge gefunden wurde.
zh_cn: 如果上述情况发生前遇到过 BackBufferCopy 节点（即便尚未使用过 ``hint_screen_texture``\ ），那么也不会执行相关的行为。换句话说，自动复制整个屏幕的条件只有：某个节点中首次使用 ``hint_screen_texture`` 并且按照树顺序不存在更早的（未被禁用的）BackBufferCopy 节点。
zh_tw: 如果上述情況發生前遇到過 BackBufferCopy 節點（即便尚未使用過 ``hint_screen_texture``），那麼也不會執行相關的行為。換句話說，自動複製整個螢幕的條件只有：某個節點中首次使用 ``hint_screen_texture`` 並且按照樹順序不存在更早的（未被禁用的）BackBufferCopy 節點。

source: BackBufferCopy can copy either the entire screen or a region. If set to only a region (not the whole screen) and your shader uses pixels not in the region copied, the result of that read is undefined (most likely garbage from previous frames). In other words, it's possible to use BackBufferCopy to copy back a region of the screen and then read the screen texture from a different region. Avoid this behavior!
de: BackBufferCopy kann entweder den gesamten Bildschirm oder einen Bereich kopieren. Wenn nur ein Bereich (nicht der gesamte Bildschirm) kopiert wird und Ihr Shader Pixel verwendet, die nicht in dem kopierten Bereich liegen, ist das Ergebnis des Lesevorgangs undefiniert (höchstwahrscheinlich Müll aus früheren Frames). Mit anderen Worten, es ist möglich, BackBufferCopy zu verwenden, um einen Bereich des Bildschirms zurückzukopieren und dann die Bildschirmtextur aus einem anderen Bereich zu lesen. Vermeiden Sie dieses Verhalten!
zh_cn: BackBufferCopy 可以选择复制整个屏幕或者只复制某个区域。如果设置为区域（非整个屏幕），但是着色器使用了复制区域之外的像素，那么读取到的结果就是未定义的（很可能是上一帧残留的垃圾数据）。换句话说，你确实能够使用 BackBufferCopy 复制屏幕上的某个区域，然后读取屏幕纹理上的其他区域。但请避免这样的行为！
zh_tw: BackBufferCopy 可以選擇複製整個螢幕或者只複製某個區域。如果設定為區域（非整個螢幕），但是著色器使用了複製區域之外的像素，那麼讀取到的結果就是未定義的（很可能是上一影格殘留的垃圾資料）。換句話說，你確實能夠使用 BackBufferCopy 複製螢幕上的某個區域，然後讀取螢幕紋理上的其他區域。但請避免這樣的行為！

source: Depth texture
de: Tiefentextur
zh_cn: 深度纹理
zh_tw: 深度紋理

source: For 3D shaders, it's also possible to access the screen depth buffer. For this, the ``hint_depth_texture`` hint is used. This texture is not linear; it must be converted using the inverse projection matrix.
de: Für 3D-Shader ist es auch möglich, auf den Tiefenpuffer des Bildschirms zuzugreifen. Hierfür wird der Hint ``hint_depth_texture`` verwendet. Diese Textur ist nicht linear; sie muss mit Hilfe der inversen Projektionsmatrix konvertiert werden.
zh_cn: 3D 着色器也可以访问屏幕深度缓冲，使用 ``hint_depth_texture`` 提示即可。该纹理不是线性的；必须通过逆投影矩阵进行转换。
zh_tw: 3D 著色器也可以存取螢幕深度緩衝，使用 ``hint_depth_texture`` 提示即可。該紋理不是線性的；必須通過逆投影矩陣進行轉換。

source: The following code retrieves the 3D position below the pixel being drawn:
de: Mit dem folgenden Code wird die 3D-Position unter dem gezeichneten Pixel ermittelt:
zh_cn: 以下代码会获取正在绘制的像素所在的 3D 位置：
zh_tw: 以下程式碼會獲取正在繪製的像素所在的 3D 位置：

source: Normal-roughness texture
de: Normalen-Rauheits-Textur
zh_cn: 法线-粗糙度纹理
zh_tw: 法線-粗糙度紋理

source: Normal-roughness texture is only supported in the Forward+ rendering method, not Mobile or Compatibility.
de: Normalen-Rauheits-Textur wird nur in der Forward+ Rendering-Methode unterstützt, nicht in Mobile oder Kompatibilität.

source: Similarly, the normal-roughness texture can be used to read the normals and roughness of objects rendered in the depth prepass. The normal is stored in the ``.xyz`` channels (mapped to the 0-1 range) while the roughness is stored in the ``.w`` channel.
de: In ähnlicher Weise kann die Normalen-Rauheits-Textur verwendet werden, um die Normalen und die Rauheit von Objekten zu lesen, die im Tiefenvordurchlauf gerendert wurden. Die Normalen werden in den ``.xyz``-Kanälen gespeichert (auf den Bereich 0-1 abgebildet), während die Rauheit im ``.w``-Kanal gespeichert wird.
zh_cn: 类似的，如果对象在深度预阶段中进行了渲染，就可以用法线-粗糙度纹理来读取该对象的法线和粗糙度。法线存储在 ``.xyz`` 通道中（映射到了 0-1 范围内），而粗糙度则存储在 ``.w`` 通道中。
zh_tw: 類似的，如果物件在深度預階段中進行了算繪，就可以用法線-粗糙度紋理來讀取該對象的法線和粗糙度。法線儲存在 ``.xyz`` 通道中（對應到了 0-1 範圍內），而粗糙度則儲存在 ``.w`` 通道中。

source: Redefining screen textures
de: Neudefinition von Bildschirmtexturen
zh_cn: 重定义屏幕纹理
zh_tw: 匯入紋理

source: The screen texture hints (``hint_screen_texture``, ``hint_depth_texture``, and ``hint_normal_roughness_texture``) can be used with multiple uniforms. For example, you may want to read from the texture multiple times with a different repeat flag or filter flag.
de: Die Bildschirmtextur-Hints (``hint_screen_texture``, ``hint_depth_texture`` und ``hint_normal_roughness_texture``) können mit mehreren Uniforms verwendet werden. Zum Beispiel kann es sein, dass Sie die Textur mehrmals mit einem anderen Wiederholungsflag oder Filterflag lesen wollen.
zh_cn: 可以对多个 uniform 使用屏幕纹理提示（\ ``hint_screen_texture``\ 、\ ``hint_depth_texture``\ 、\ ``hint_normal_roughness_texture``\ ）。例如，你可能会想要使用不同的重复标志和过滤标志多次读取该纹理。
zh_tw: 可以對多個 uniform 使用螢幕紋理提示（``hint_screen_texture``、``hint_depth_texture``、``hint_normal_roughness_texture``）。例如，你可能會想要使用不同的重複旗標和篩選旗標多次讀取該紋理。

source: The following example shows a shader that reads the screen space normal with linear filtering, but reads the screen space roughness using nearest neighbor filtering.
de: Das folgende Beispiel zeigt einen Shader, der die Screen Space-Normale mit linearer Filterung, die Screen Space-Rauheit jedoch mit Nearest Neighbour-Filterung ausliest.
zh_cn: 下面的例子中，着色器在读取屏幕空间法线时使用的就是线性过滤，而读取屏幕空间粗糙度时使用的就是最邻近过滤。
zh_tw: 下面的例子中，著色器在讀取螢幕空間法線時使用的就是線性篩選，而讀取螢幕空間粗糙度時使用的就是最鄰近篩選。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
