Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_materials.po
Languages: de, zh_tw

source: Shader materials
de: Shader-Materialien
zh_tw: 著色器材質

source: Introduction
de: Einführung
zh_tw: 前言

source: For the most common cases, Godot provides ready to use materials for most types of shaders, such as :ref:`StandardMaterial3D <class_StandardMaterial3D>`, :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` and :ref:`ParticleProcessMaterial <class_ParticleProcessMaterial>`. They are flexible implementations that cover most use cases.
de: Für die häufigsten Fälle bietet Godot fertige Materialien für die meisten Shadertypen, wie :ref:`StandardMaterial3D <class_StandardMaterial3D>`, :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` und :ref:`ParticleProcessMaterial <class_ParticleProcessMaterial>`. Es handelt sich um flexible Implementierungen zur Abdeckung der meisten Anwendungsfälle.
zh_tw: 對於最常見的情況,Godot為大多數型別的著色器提供了隨時可用的材質, 例如 :ref:`SpatialMaterial <class_SpatialMaterial>` , :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` 和 :ref:`ParticlesMaterial <class_ParticlesMaterial>` . 它們是涵蓋了大多數用例的靈活實作.

source: Shader materials allow writing a custom shader directly, for maximum flexibility. Examples of this are:
de: Shader-Materialien ermöglichen das direkte Schreiben eines benutzerdefinierten Shaders für maximale Flexibilität. Beispiele hierfür sind:
zh_tw: 著色器材質允許直接編寫自訂著色器, 以獲得最大的靈活性. 這方面的範例是:

source: Create procedural textures.
de: Erstellen prozeduraler Texturen.
zh_tw: 建立程式式紋理。

source: Create complex texture blending effects.
de: Erstellen komplexer Textur-Blending-Effekte.
zh_tw: 建立複雜的紋理混合效果.

source: Create animated materials, or materials that change over time.
de: Erstellen von animierten Materialien oder Materialien, die sich im Laufe der Zeit verändern.
zh_tw: 建立動畫材質, 或隨時間變化的材質.

source: Create refractive effects or other advanced effects.
de: Erstellen von Brechungseffekten oder anderen fortgeschrittenen Effekten.
zh_tw: 建立折射效果或其他高級效果.

source: Create special lighting shaders for more exotic materials.
de: Erstellen spezieller Beleuchtungs-Shader für exotischere Materialien.
zh_tw: 為更具異國情調的材質建立特殊照明著色器.

source: Animate vertices, like tree leaves or grass.
de: Animieren von Vertices, wie Laub oder Gras.
zh_tw: 動畫頂點, 如樹葉或草.

source: Create custom particle code.
de: Erstellen von Benutzerdefiniertem Partikelcode.
zh_tw: 建立自訂粒子程式碼.

source: And much more!
de: Und vieles mehr!
zh_tw: 以及更多！

source: Godot provides built in functionality to make frequent operations easier. Additionally, Godot's shader editor will detect errors as you type, so you can see your edited shaders in real-time. It is also possible to edit shaders using a visual, node-based graph editor.
de: Godot bietet Built-in-Funktionen, die häufige Operationen erleichtern. Außerdem erkennt der Shader-Editor von Godot Fehler während der Eingabe, so dass Sie Ihre bearbeiteten Shader in Echtzeit sehen können. Es ist auch möglich, Shader mit einem visuellen, nodebasierten Graph-Editor zu bearbeiten.
zh_tw: Godot提供了內建的功能, 使頻繁的操作更容易. 此外,Godot的著色器編輯器會在你輸入時偵測錯誤, 所以你可以即時看到編輯的著色器. 也可以使用視覺化的, 基於節點的圖形編輯器來編輯著色器.

source: Creating a ShaderMaterial
de: Erzeugen eines Shader-Materials
zh_tw: 建立 ShaderMaterial

source: Create a new ShaderMaterial in some object of your choice. Go to the "Material" property and create a ShaderMaterial.
de: Erstellen Sie ein neues ShaderMaterial in einem Objekt Ihrer Wahl. Gehen Sie zur Property "Material" und erstellen Sie ein ShaderMaterial.
zh_tw: 在您選擇的某個物件中建立一個新的 ShaderMaterial。轉到 ``Material`` 屬性並建立 ShaderMaterial。

source: Next, click on the shader material to see its properties. From here you can create a shader or visual shader. Regular shaders use code to set their properties while a visual shader uses a node based workflow.
de: Klicken Sie anschließend auf das Shader-Material um dessen Propertys anzuzeigen. Von hier aus können Sie einen Shader oder einen visuellen Shader erstellen. Normale Shader verwenden Code um ihre Eigenschaften festzulegen, während ein visueller Shader einen Node-basierten Ablauf verwendet.
zh_tw: 接下來, 點擊著色器材質, 查看其屬性. 從這裡你可以建立一個著色器或視覺著色器. 常規著色器使用程式碼來設定它們的屬性, 而視覺著色器則使用基於節點的工作流程.

source: If you need to you can convert a visual shader to a text shader. However you can't convert a text shader to a visual shader.
de: Bei Bedarf können Sie einen visuellen Shader in einen Text-Shader konvertieren. Sie können einen Text-Shader jedoch nicht in einen visuellen Shader konvertieren.
zh_tw: 如果你需要, 你可以將視覺著色器轉換為文字著色器. 但是你不能將文字著色器轉換為視覺著色器.

source: Choose one of them and you can start editing your shader.
de: Wählen Sie eine davon aus und Sie können mit der Bearbeitung Ihres Shaders beginnen.
zh_tw: 選擇其中一個, 你就可以開始編輯你的著色器.

source: If you create a regular shader click on it and the shader editor will open.
de: Wenn Sie einen regulären Shader erstellen, klicken Sie darauf und der Shader-Editor wird geöffnet.
zh_tw: 編輯新建立的著色器, 著色器編輯器將打開.

source: If you create a visual shader the visual shader editor will open automatically.
de: Wenn Sie einen Visual Shader erstellen, wird der Visual Shader-Editor automatisch geöffnet.
zh_tw: 編輯新建立的著色器, 著色器編輯器將打開.

source: In the visual shader editor you can click a button and see what your visual shader looks like as shader code. This can be useful if you're trying to replicate a text shader as nodes, or it can be used as a preview for converting your visual shader to a text shader.
de: Im Visual Shader-Editor können Sie auf einen Button klicken und sehen, wie Ihr Visual Shader als Shader-Code aussieht. Dies kann nützlich sein, wenn Sie versuchen, einen Text-Shader als Node zu replizieren, oder es ist ebenfalls nützlich als Vorschau für die Konvertierung Ihres visuellen Shaders in einen Text-Shader.
zh_tw: 在視覺著色器編輯器中, 你可以點擊一個按鈕, 看看你的視覺著色器作為著色器程式碼的樣子. 如果你想複製一個文字著色器作為節點, 這可能是有用的, 或者它可以作為將你的視覺著色器轉換為文字著色器的預覽.

source: To learn more about visual shaders, read :ref:`doc_visual_shaders`.
de: Weitere Informationen zu Visual Shadern finden Sie unter :ref:`doc_visual_shaders`.
zh_tw: 要瞭解更多關於視覺化著色器的資訊, 請閱讀 :ref:`doc_visual_shaders` .

source: Converting to ShaderMaterial
de: Umwandeln nach ShaderMaterial
zh_tw: 轉換為 ShaderMaterial

source: It is possible to convert from StandardMaterial3D, CanvasItemMaterial and ParticleProcessMaterial to ShaderMaterial. To do so, go to the material properties and select the convert option.
de: Es ist möglich, von StandardMaterial3D, CanvasItemMaterial und ParticleProcessMaterial in ShaderMaterial zu konvertieren. Gehen Sie dazu zu den Material-Propertys und wählen Sie die Option "Konvertieren".
zh_tw: 可以將 SpatialMaterial、CanvasItemMaterial 和 ParticlesMaterial 轉換為 ShaderMaterial。要做到這一點，請進入材質屬性並選擇轉換選項。

source: Using the convert option will turn the StandardMaterial3D into a ShaderMaterial with a text shader, not a visual shader.
de: Mit der Option "Konvertieren" wird aus dem StandardMaterial3D ein ShaderMaterial mit einem Text-Shader, nicht mit einem visuellen Shader.
zh_tw: 使用convert選項將把SpatialMaterial變成一個帶有文字著色器的ShaderMaterial, 而不是視覺著色器.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
