Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/using_viewport_*_texture.po
Languages: de, zh_tw

source: One final thing to make this look more like a planet. The ocean and the land reflect light differently. So we want the ocean to shine a little more than the land. We can do this by passing a fourth value into the ``alpha`` channel of our output ``COLOR`` and using it as a Roughness map.
de: Eine letzte Sache, damit es mehr wie ein Planet aussieht. Der Ozean und das Land reflektieren das Licht unterschiedlich. Wir wollen also, dass der Ozean ein wenig mehr leuchtet als das Land. Wir können dies erreichen, indem wir einen vierten Wert in den ``Alpha``-Kanal unserer Ausgabe ``COLOR`` eingeben und ihn als Rauheitskarte verwenden.
zh_tw: 讓這個看起來更像是一顆行星的最後一件事. 海洋和陸地以不同的方式反射光線. 因此, 我們希望海洋比陸地更加閃耀. 我們可以通過將第四個值傳遞到輸出 ``COLOR`` 的 ``alpha`` 通道並將其用作粗糙度圖來實作.

source: This line returns ``0.3`` for water and ``1.0`` for land. This means that the land is going to be quite rough, while the water will be quite smooth.
de: Diese Zeile liefert ``0.3`` für Wasser und ``1.0`` für Land. Das bedeutet, dass das Land ziemlich rau sein wird, während das Wasser ziemlich glatt sein wird.
zh_tw: 該行對於水返回 ``0.3`` , 對於土地返回 ``1.0`` . 這意味著土地將變得很粗糙, 而水將變得非常光滑.

source: And then, in the material, under the "Metallic" section, make sure ``Metallic`` is set to ``0`` and ``Specular`` is set to ``1``. The reason for this is the water reflects light really well, but isn't metallic. These values are not physically accurate, but they are good enough for this demo.
de: Dann stellen Sie im Material unter dem Abschnitt "Metallic" sicher, daß ``Metallic`` auf ``0`` und ``Specular`` auf ``1`` gesetzt ist. Der Grund dafür ist, daß das Wasser das Licht sehr gut reflektiert, aber nicht metallisch ist. Diese Werte sind nicht physikalisch genau, aber für diese Demo sind sie gut genug.
zh_tw: 然後，在材質中，在“Metallic”（金屬性）部分，請確保 ``Metallic`` 為 ``0``、``Specular`` 為 ``1``。這樣做的原因是水對光線的反射非常好，但它不是金屬的。這些值在物理上並不準確，但對於這個演示來說已經足夠好了。

source: Next, under the "Roughness" section, set ``Roughness`` to ``1`` and set the roughness texture to a :ref:`Viewport Texture <class_ViewportTexture>` pointing to our planet texture :ref:`Viewport <class_Viewport>`. Finally, set the ``Texture Channel`` to ``Alpha``. This instructs the renderer to use the ``alpha`` channel of our output ``COLOR`` as the ``Roughness`` value.
de: Als nächstes setzen Sie im Abschnitt "Rauheit" den Wert ``Rauheit`` auf ``1`` und setzen die Rauheitstextur auf eine :ref:`Viewport Texture <class_ViewportTexture>`, die auf unsere Planetentextur :ref:`Viewport <class_Viewport>` zeigt. Schließlich setzen wir den ``Texturkanal`` auf ``Alpha``. Dies weist den Renderer an, den ``Alpha``-Kanal unserer ``COLOR``-Ausgabe als ``Rauheits``-Wert zu verwenden.
zh_tw: 接下來, 在 "Roughness" 部分, 將 ``Roughness`` 設定為 ``1`` , 並將粗糙度紋理設定為 :ref:`Viewport Texture <class_ViewportTexture>` , 指向我們的行星紋理 :ref:`Viewport <class_Viewport>` . 最後, 將 ``Texture Channel`` 設定為 ``Alpha`` . 這將指示算繪器使用我們輸出的 ``COLOR`` 的 ``alpha`` 通道作為 ``Roughness`` 值.

source: You'll notice that very little changes except that the planet is no longer reflecting the sky. This is happening because, by default, when something is rendered with an alpha value, it gets drawn as a transparent object over the background. And since the default background of the :ref:`Viewport <class_Viewport>` is opaque, the ``alpha`` channel of the :ref:`Viewport Texture <class_ViewportTexture>` is ``1``, resulting in the planet texture being drawn with slightly fainter colors and a ``Roughness`` value of ``1`` everywhere. To correct this, we go into the :ref:`Viewport <class_Viewport>` and enable the "Transparent Bg" property. Since we are now rendering one transparent object on top of another, we want to enable ``blend_premul_alpha``:
de: Sie werden feststellen, dass sich nur sehr wenig ändert, außer dass der Planet den Himmel nicht mehr spiegelt. Dies geschieht, weil standardmäßig, wenn etwas mit einem Alpha-Wert gerendert wird, es als transparentes Objekt über den Hintergrund gezeichnet wird. Und da der Default-Hintergrund des :ref:`Viewport <class_Viewport>` undurchsichtig ist, hat der ``Alpha``-Kanal der :ref:`Viewport Texture <class_ViewportTexture>` den Wert ``1``, was dazu führt, dass die Planetentextur überall mit etwas blasseren Farben und einem ``Rauheits``-Wert von ``1`` gezeichnet wird. Um dies zu korrigieren, gehen wir in den :ref:`Viewport <class_Viewport>` und aktivieren die "Transparent Bg"-Property. Da wir nun ein transparentes Objekt über ein anderes legen, müssen wir ``blend_premul_alpha`` aktivieren:
zh_tw: 你會注意到, 除了行星不再反射天空外, 幾乎沒有什麼變化. 這是因為預設情況下, 當某樣東西以Alpha值算繪時, 它會被繪製為背景上的透明物體. 因為 :ref:`Viewport <class_Viewport>` 的預設背景是不透明的, 所以 :ref:`Viewport Texture <class_ViewportTexture>` 的 ``alpha`` 通道是 ``1`` , 導致行星紋理的顏色略微變淡, 並且到處的 ``Roughness`` 值都是 ``1`` . 為了糾正這個問題, 我們轉到 :ref:`Viewport <class_Viewport>` 並啟用 "Transparent Bg" 屬性. 由於現在是在另一個透明物體上算繪, 要啟用 ``blend_premul_alpha`` :

source: This pre-multiplies the colors by the ``alpha`` value and then blends them correctly together. Typically, when blending one transparent color on top of another, even if the background has an ``alpha`` of ``0`` (as it does in this case), you end up with weird color bleed issues. Setting ``blend_premul_alpha`` fixes that.
de: Dadurch werden die Farben mit dem ``Alpha``-Wert vormultipliziert und dann korrekt zusammengemischt. Wenn man eine transparente Farbe über eine andere mischt, selbst wenn der Hintergrund einen ``Alpha``-Wert von ``0`` hat (wie in diesem Fall), kommt es normalerweise zu seltsamen Farbverläufen. Die Einstellung ``blend_premul_alpha`` behebt das.
zh_tw: 這是將顏色預先乘以 ``alpha`` 值, 然後將它們正確地混合在一起. 通常情況下, 當在一個透明的顏色上混合另一個顏色時, 即使背景的 ``alpha`` 為 ``0`` (如本例), 也會出現奇怪的顏色滲漏問題. 設定 ``blend_premul_alpha`` 可以解決這個問題.

source: Now the planet should look like it is reflecting light on the ocean but not the land. If you haven't done so already, add an :ref:`OmniLight3D <class_OmniLight3D>` to the scene so you can move it around and see the effect of the reflections on the ocean.
de: Jetzt sollte der Planet so aussehen, als würde er das Licht auf dem Meer reflektieren, aber nicht auf dem Land. Wenn Sie es noch nicht getan haben, fügen Sie ein :ref:`OmniLight3D <class_OmniLight3D>` zur Szene hinzu, damit Sie es bewegen und den Effekt der Reflexionen auf dem Ozean sehen können.
zh_tw: 現在這個星球看起來海洋上能夠反射光線, 而不是在陸地上. 如果你還沒有這樣做, 在場景中新增一個 :ref:`OmniLight <class_OmniLight>` , 這樣你就可以移動它, 看到海洋上反射的效果.

source: And there you have it. A procedural planet generated using a :ref:`Viewport <class_Viewport>`.
de: Und da haben Sie es. Ein prozeduraler Planet, der unter Verwendung eines :ref:`Viewports <class_Viewport>` generiert wurde.
zh_tw: 這就是你的作品。使用 :ref:`Viewport <class_Viewport>` 生成的程式式行星。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
