Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/using_viewport_*_texture.po
Languages: de, zh_tw

source: Using a Viewport as a texture
de: Verwendung des Viewports als Textur
zh_tw: 使用 Viewport 作為紋理

source: Introduction
de: Einführung
zh_tw: 前言

source: This tutorial will introduce you to using the :ref:`Viewport <class_Viewport>` as a texture that can be applied to 3D objects. In order to do so, it will walk you through the process of making a procedural planet like the one below:
de: In diesem Tutorial lernen Sie die Verwendung von :ref:`Viewport <class_Viewport>` als Textur kennen, die auf 3D-Objekte angewendet werden kann. Zu diesem Zweck erstellen wir einen prozeduralen Planeten wie dem folgenden hier:
zh_tw: 本教學將向您介紹如何使用 :ref:`Viewport <class_Viewport>` 作為可應用於 3D 對象的紋理。為了做到這一點，它將引導您完成製作程式式星球的過程，如下所示：

source: This tutorial does not cover how to code a dynamic atmosphere like the one this planet has.
de: Dieses Tutorial behandelt nicht, wie man eine dynamische Atmosphäre, wie die dieses Planeten, programmiert.
zh_tw: 本教學沒有介紹如何編寫像這個星球那樣的動態氛圍.

source: This tutorial assumes you are familiar with how to set up a basic scene including: a :ref:`Camera3D <class_Camera3D>`, a :ref:`light source <class_OmniLight3D>`, a :ref:`MeshInstance3D <class_MeshInstance3D>` with a :ref:`Primitive Mesh <class_PrimitiveMesh>`, and applying a :ref:`StandardMaterial3D <class_StandardMaterial3D>` to the mesh. The focus will be on using the :ref:`Viewport <class_Viewport>` to dynamically create textures that can be applied to the mesh.
de: Dieses Tutorial setzt voraus, dass Sie mit der Einrichtung einer grundlegenden Szene vertraut sind, einschließlich: einer :ref:`Camera3D <class_Camera3D>`, einer :ref:`Lichtquelle <class_OmniLight3D>`, einer :ref:`MeshInstance3D <class_MeshInstance3D>` mit einem :ref:`Primitive Mesh <class_PrimitiveMesh>`, und der Anwendung eines :ref:`StandardMaterial3D <class_StandardMaterial3D>` auf das Mesh. Der Schwerpunkt liegt auf der Verwendung des :ref:`Viewport <class_Viewport>` zur dynamischen Erstellung von Texturen, die auf das Mesh angewendet werden können.
zh_tw: 本教學假定你熟悉如何設定基本場景，其中包括：一個 :ref:`相機 <class_Camera>`、一個 :ref:`光源 <class_OmniLight>`、一個 :ref:`像素網格 <class_PrimitiveMesh>`的 :ref:`網格實例 <class_MeshInstance>`，並將一個 :ref:`SpatialMaterial <class_SpatialMaterial>` 應用於網格。我們的重點將會是使用 :ref:`Viewport <class_Viewport>` 來動態地建立可應用於網格的紋理。

source: In this tutorial, we'll cover the following topics:
de: In diesem Tutorial werden wir die folgenden Themen behandeln:
zh_tw: 在本教學中, 我們將介紹以下主題:

source: How to use a :ref:`Viewport <class_Viewport>` as a render texture
de: Verwendung von :ref:`Viewport <class_Viewport>` als Rendertextur
zh_tw: 如何使用 :ref:`Viewport <class_Viewport>` 作為算繪紋理

source: Mapping a texture to a sphere with equirectangular mapping
de: Abbilden einer Textur auf eine Kugel mit gleichwinkliger Zuordnung
zh_tw: 使用 equirectangular 對應將紋理對應到球體

source: Fragment shader techniques for procedural planets
de: Fragment-Shader-Techniken für prozedurale Planeten
zh_tw: 程式式行星的片段著色器技術

source: Setting a Roughness map from a :ref:`Viewport Texture <class_ViewportTexture>`
de: Festlegen einer Rauheitskarte aus einer :ref:`Viewport-Textur <class_ViewportTexture>`
zh_tw: 從:ref:`視口紋理 <class_ViewportTexture>`設定粗糙度貼圖

source: Setting up the Viewport
de: Einrichten des Viewports
zh_tw: 設定視口

source: First, add a :ref:`Viewport <class_Viewport>` to the scene.
de: Fügen Sie zuerst :ref:`Viewport <class_Viewport>` zu der Szene hinzu.
zh_tw: 首先, 在場景中新增 :ref:`Viewport <class_Viewport>` .

source: Next, set the size of the :ref:`Viewport <class_Viewport>` to ``(1024, 512)``. The :ref:`Viewport <class_Viewport>` can actually be any size so long as the width is double the height. The width needs to be double the height so that the image will accurately map onto the sphere, as we will be using equirectangular projection, but more on that later.
de: Als nächstes setzen Sie die Größe des :ref:`Viewport <class_Viewport>` auf ``(1024, 512)``. Das :ref:`Viewport <class_Viewport>` kann eigentlich jede Größe haben, solange die Breite doppelt so groß ist wie die Höhe. Die Breite muss doppelt so groß sein wie die Höhe, damit das Bild genau auf die Kugel abgebildet werden kann, da wir eine gleichwinklige Projektion verwenden werden, aber dazu später mehr.
zh_tw: 接下來, 將 :ref:`Viewport <class_Viewport>` 的大小設定為 ``(1024, 512)`` . :ref:`Viewport <class_Viewport>` 實際上可以是任何尺寸, 只要其寬度是高度的兩倍. 寬度需要是高度的兩倍, 這樣圖像才能準確地對應到球體上, 因為我們將使用等量矩形投影, 後面會有更多的介紹.

source: Next, disable HDR and disable 3D. We don't need HDR because our planet's surface will not be especially bright, so values between ``0`` and ``1`` will be fine. And we will be using a :ref:`ColorRect <class_ColorRect>` to render the surface, so we don't need 3D either.
de: Als nächstes deaktivieren Sie HDR und 3D. Wir brauchen kein HDR, weil die Oberfläche unseres Planeten nicht besonders hell sein wird, also sind Werte zwischen ``0`` und ``1`` ausreichend. Und wir werden ein :ref:`ColorRect <class_ColorRect>` zum Rendern der Oberfläche verwenden, also brauchen wir auch kein 3D.
zh_tw: 接下來, 禁用HDR和禁用3D. 我們不需要HDR, 因為星球的表面不會特別亮, 所以數值在 ``0`` 和 ``1`` 之間就可以了. 將使用一個 :ref:`ColorRect <class_ColorRect>` 來算繪表面, 所以我們也不需要3D.

source: Select the Viewport and add a :ref:`ColorRect <class_ColorRect>` as a child.
de: Wählen Sie den Viewport und fügen Sie ein :ref:`ColorRect <class_ColorRect>` als Child-Element hinzu.
zh_tw: 選擇視口並新增 :ref:`ColorRect <class_ColorRect>` 作為子項.

source: Set the anchors "Right" and "Bottom" to ``1``, then make sure all the margins are set to ``0``. This will ensure that the :ref:`ColorRect <class_ColorRect>` takes up the entire :ref:`Viewport <class_Viewport>`.
de: Setzen Sie die Anker "Rechts" und "Unten" auf ``1``, und stellen Sie sicher, dass alle Ränder auf ``0`` gesetzt sind. Dadurch wird sichergestellt, dass das :ref:`ColorRect <class_ColorRect>` den gesamten :ref:`Viewport <class_Viewport>` einnimmt.
zh_tw: 將“Right”和“Bottom”的 Anchor 設定為 ``1``，然後確保所有邊距都設定為 ``0``。這樣就確保 :ref:`ColorRect <class_ColorRect>` 佔據了整個 :ref:`Viewport <class_Viewport>`。

source: Next, we add a :ref:`Shader Material <class_ShaderMaterial>` to the :ref:`ColorRect <class_ColorRect>` (ColorRect > CanvasItem > Material > Material > ``New ShaderMaterial``).
de: Als nächstes fügen wir ein :ref:`Shader Material <class_ShaderMaterial>` zum :ref:`ColorRect <class_ColorRect>` hinzu (ColorRect > CanvasItem > Material > Material > ``Neu: ShaderMaterial``).
zh_tw: 接下來, 我們為 :ref:`Shader Material <class_ShaderMaterial>` 新增一個 :ref:`ColorRect <class_ColorRect>` (ColorRect > CanvasItem > Material > Material > ``New ShaderMaterial``).

source: Basic familiarity with shading is recommended for this tutorial. However, even if you are new to shaders, all the code will be provided, so you should have no problem following along.
de: Grundlegende Vertrautheit mit Shading wird für dieses Tutorial empfohlen. Aber auch wenn Sie keine Erfahrung mit Shadern haben, wird der gesamte Code zur Verfügung gestellt, so dass Sie keine Probleme haben sollten, diesem Tutorial zu folgen.
zh_tw: 建議本教學基本瞭解陰影. 但是, 即使您不熟悉著色器, 也將提供所有程式碼, 因此後續操作應該沒有問題.

source: ColorRect > CanvasItem > Material > Material > click / Edit > ShaderMaterial > Shader > ``New Shader`` > click / Edit:
de: ColorRect > CanvasItem > Material > Material > Klicken / Bearbeiten > ShaderMaterial > Shader > ``Neuer Shader`` > Klicken / Bearbeiten:
zh_tw: ColorRect > CanvasItem > Material > Material > 點擊 / 編輯 > ShaderMaterial > Shader > ``新建 Shader`` > 點擊 / 編輯：

source: The above code renders a gradient like the one below.
de: Der obige Code rendert einen Farbverlauf wie den folgenden.
zh_tw: 上面的程式碼呈現如下所示的漸變。

source: Now we have the basics of a :ref:`Viewport <class_Viewport>` that we render to and we have a unique image that we can apply to the sphere.
de: Jetzt haben wir die Grundlagen für einen :ref:`Viewport <class_Viewport>`, den wir rendern, und wir haben ein eindeutiges Bild, das wir auf die Kugel anwenden können.
zh_tw: 現在我們有一個基礎 :ref:`Viewport <class_Viewport>` 我們算繪到的, 我們有一個可以應用於球體的獨特圖像.

source: Applying the texture
de: Anwenden der Textur
zh_tw: 應用紋理

source: MeshInstance3D > GeometryInstance > Geometry > Material Override > ``New StandardMaterial3D``:
de: MeshInstance3D > GeometryInstance > Geometrie > Material-Überschreibung > ``Neu: StandardMaterial3D``:
zh_tw: MeshInstance > GeometryInstance > Geometry > Material Override > ``新建 SpatialMaterial``：

source: Now we go into the :ref:`MeshInstance3D <class_MeshInstance3D>` and add a :ref:`StandardMaterial3D <class_StandardMaterial3D>` to it. No need for a special :ref:`Shader Material <class_ShaderMaterial>` (although that would be a good idea for more advanced effects, like the atmosphere in the example above).
de: Jetzt gehen wir in die :ref:`MeshInstance3D <class_MeshInstance3D>` und fügen ein :ref:`StandardMaterial3D <class_StandardMaterial3D>` dazu. Es besteht keine Notwendigkeit für ein spezielles :ref:`Shader Material <class_ShaderMaterial>` (obwohl das eine gute Idee für fortgeschrittene Effekte wäre, wie die Atmosphäre im obigen Beispiel).
zh_tw: 現在我們進入 :ref:`Mesh Instance <class_MeshInstance>` 並新增一個 :ref:`SpatialMaterial <class_SpatialMaterial>` 給它. 不需要一個特殊的 :ref:`Shader Material <class_ShaderMaterial>` (儘管這對於更高級的效果來說是個好主意, 比如上面例子中的大氣).

source: MeshInstance3D > GeometryInstance > Geometry > Material Override > ``click`` / ``Edit``:
de: MeshInstance3D > GeometryInstance > Geometrie > Material-Überschreibung > ``Klicken`` / ``Bearbeiten``:
zh_tw: MeshInstance > GeometryInstance > Geometry > Material Override > ``點擊`` / ``編輯``：

source: Open the newly created :ref:`StandardMaterial3D <class_StandardMaterial3D>` and scroll down to the "Albedo" section and click beside the "Texture" property to add an Albedo Texture. Here we will apply the texture we made. Choose "New ViewportTexture"
de: Öffnen Sie das neu erstellte :ref:`StandardMaterial3D <class_StandardMaterial3D>` und scrollen Sie nach unten zum Abschnitt "Albedo" und klicken Sie neben der Property "Texture", um eine Albedo-Textur hinzuzufügen. Hier werden wir die von uns erstellte Textur anwenden. Wählen Sie "Neu: ViewportTexture"
zh_tw: 打開新建立的 :ref:`SpatialMaterial <class_SpatialMaterial>` , 向下滾動到 "Albedo" 部分, 點擊 "Texture" 屬性旁邊, 新增一個Albedo Texture. 這裡我們將應用製作的紋理. 選擇 "New ViewportTexture"

source: Then, from the menu that pops up, select the Viewport that we rendered to earlier.
de: Wählen Sie dann aus dem angezeigten Menü den Viewport aus, in den zuvor gerendert wurde.
zh_tw: 然後, 從彈出的功能表中, 選擇我們先前算繪的視圖.

source: Your sphere should now be colored in with the colors we rendered to the Viewport.
de: Ihre Kugel sollte jetzt mit den Farben eingefärbt sein, die wir im Viewport gerendert haben.
zh_tw: 現在, 您的球體應使用我們算繪到視口的顏色進行著色.

source: Notice the ugly seam that forms where the texture wraps around? This is because we are picking a color based on UV coordinates and UV coordinates do not wrap around the texture. This is a classic problem in 2D map projection. Game developers often have a 2-dimensional map they want to project onto a sphere, but when it wraps around, it has large seams. There is an elegant workaround for this problem that we will illustrate in the next section.
de: Haben Sie die hässliche Naht bemerkt, die sich an der Stelle bildet, an der die Textur um die Textur gewickelt wird? Das liegt daran, dass wir eine Farbe auf der Grundlage von UV-Koordinaten auswählen, und UV-Koordinaten lassen sich nicht um die Textur herumführen. Dies ist ein klassisches Problem bei der 2D-Kartenprojektion. Spieleentwickler haben oft eine 2-dimensionale Karte, die sie auf eine Kugel projizieren wollen, aber wenn sie sich um die Kugel wickelt, entstehen große Nähte. Es gibt eine elegante Lösung für dieses Problem, die wir im nächsten Abschnitt erläutern werden.
zh_tw: 注意到在紋理環繞的地方形成的醜陋縫隙嗎？這是因為我們是根據UV座標來選取顏色的, 而UV座標並不會環繞紋理. 這是二維地圖投影中的一個典型問題. 遊戲開發人員通常有一個二維貼圖, 他們想投射到一個球體上, 但是當它環繞時, 將有接縫. 這個問題有一個優雅的解決方法, 我們將在下一節中說明.

source: Making the planet texture
de: Erzeugen der Planetentextur
zh_tw: 製作行星紋理

source: So now, when we render to our :ref:`Viewport <class_Viewport>`, it appears magically on the sphere. But there is an ugly seam created by our texture coordinates. So how do we get a range of coordinates that wrap around the sphere in a nice way? One solution is to use a function that repeats on the domain of our texture. ``sin`` and ``cos`` are two such functions. Let's apply them to the texture and see what happens.
de: Wenn wir nun auf unser :ref:`Viewport <class_Viewport>` rendern, erscheint es wie von Zauberhand auf der Kugel. Aber es gibt eine hässliche Naht, die durch unsere Texturkoordinaten entsteht. Wie bekommen wir also einen Bereich von Koordinaten, der die Kugel auf schöne Weise umhüllt? Eine Lösung besteht darin, eine Funktion zu verwenden, die sich auf dem Bereich unserer Textur wiederholt. ``sin`` und ``cos`` sind zwei solcher Funktionen. Wenden wir sie auf die Textur an und sehen wir, was passiert.
zh_tw: 所以現在我們算繪到我們的 :ref:`Viewport <class_Viewport>` 它在球體上神奇地出現了. 但是我們的紋理座標會產生一個醜陋的縫隙. 那麼我們如何以一種很好的方式獲得圍繞球體的一系列座標？ 一種解決方案是使用在紋理域上重複的函式. ``sin`` 和 ``cos`` 是兩個這樣的函式. 讓我們將它們應用於紋理, 看看會發生什麼.

source: Not too bad. If you look around, you can see that the seam has now disappeared, but in its place, we have pinching at the poles. This pinching is due to the way Godot maps textures to spheres in its :ref:`StandardMaterial3D <class_StandardMaterial3D>`. It uses a projection technique called equirectangular projection, which translates a spherical map onto a 2D plane.
de: Gar nicht so schlecht. Wenn Sie sich umsehen, können Sie sehen, dass die Naht jetzt verschwunden ist, aber an ihrer Stelle haben wir eine Quetschung an den Polen. Das liegt an der Art und Weise, wie Godot in seinem :ref:`StandardMaterial3D <class_StandardMaterial3D>` Texturen auf Kugeln abbildet. Es verwendet eine Projektionstechnik namens gleichwinklige Projektion, die eine sphärische Karte auf eine 2D-Ebene überträgt.
zh_tw: 不算太壞. 如果你環顧四周, 可以看到接縫現在已經消失了, 但在它所處位置, 會有兩極的擠壓. 這種擠壓是由於Godot在其 :ref:`SpatialMaterial <class_SpatialMaterial>` 中把紋理對應到球體的方式造成的. 它使用了一種叫做 "等角投影" 的投影技術, 將球面圖形轉化為一個二維平面.

source: If you are interested in a little extra information on the technique, we will be converting from spherical coordinates into Cartesian coordinates. Spherical coordinates map the longitude and latitude of the sphere, while Cartesian coordinates are, for all intents and purposes, a vector from the center of the sphere to the point.
de: Wenn Sie sich für ein paar zusätzliche Informationen über die Methode interessieren, werden wir von sphärischen Koordinaten in kartesische Koordinaten umrechnen. Sphärische Koordinaten bilden die Längen- und Breitengrade der Kugel ab, während kartesische Koordinaten im Grunde ein Vektor vom Mittelpunkt der Kugel zum aktuellen Punkt sind.
zh_tw: 如果你對技術方面的一些額外資訊感興趣，我們將從球面座標轉換為直角坐標。球面座標對應的是球體的經度和緯度，而直角坐標則是從球體中心到點的一個向量。

source: For each pixel, we will calculate its 3D position on the sphere. From that, we will use 3D noise to determine a color value. By calculating the noise in 3D, we solve the problem of the pinching at the poles. To understand why, picture the noise being calculated across the surface of the sphere instead of across the 2D plane. When you calculate across the surface of the sphere, you never hit an edge, and hence you never create a seam or a pinch point on the pole. The following code converts the ``UVs`` into Cartesian coordinates.
de: Für jedes Pixel wird seine 3D-Position auf der Kugel berechnet. Daraus ermitteln wir mit Hilfe von 3D-Rauschen einen Farbwert. Indem wir das Rauschen in 3D berechnen, lösen wir das Problem des Quetschens an den Polen. Um zu verstehen, warum das so ist, stellen Sie sich vor, dass das Rauschen über die Oberfläche der Kugel und nicht über die 2D-Ebene berechnet wird. Wenn man über die Oberfläche der Kugel rechnet, stößt man nie auf eine Kante und erzeugt somit auch keine Naht oder einen Quetschungspunkt am Pol. Der folgende Code wandelt die ``UVs`` in kartesische Koordinaten um.
zh_tw: 對於每個像素, 我們將計算它在球體上的三維位置. 由此, 我們將使用3D噪波來確定一個顏色值. 通過計算3D噪波, 我們解決了兩極的擠壓問題. 要理解為什麼, 想像一下在球體表面而不是在二維平面上計算雜訊. 當你跨越球體表面進行計算時, 你永遠不會碰到邊緣, 因此你永遠不會在極點上產生接縫或夾點。下面的程式碼會將“UV”轉換為笛卡爾座標。

source: And if we use ``unit`` as an output ``COLOR`` value, we get:
de: Und wenn wir ``unit`` als Ausgabe-``COLOR``-Wert verwenden, erhalten wir:
zh_tw: 如果我們使用 ``unit`` 作為輸出 ``COLOR`` 值, 我們可以得到:

source: Now that we can calculate the 3D position of the surface of the sphere, we can use 3D noise to make the planet. We will be using this noise function directly from a `Shadertoy <https://www.shadertoy.com/view/Xsl3Dl>`_:
de: Da wir nun die 3D-Position der Kugeloberfläche berechnen können, können wir 3D-Rauschen verwenden, um den Planeten zu erstellen. Wir werden diese Rauschfunktion direkt aus einem `Shadertoy <https://www.shadertoy.com/view/Xsl3Dl>`_ verwenden:
zh_tw: 現在我們可以計算出球體表面的3D位置, 可以使用3D雜訊來製作球體. 直接從 `Shadertoy <https://www.shadertoy.com/view/Xsl3Dl>`_ 中使用這個雜訊函式:

source: All credit goes to the author, Inigo Quilez. It is published under the ``MIT`` licence.
de: Alle Anerkennung gebührt dem Autor Inigo Quilez. Es wird unter der ``MIT``-Lizenz veröffentlicht.
zh_tw: 所有功勞歸作者Inigo Quilez所有. 它是在 ``MIT`` 許可下發行的.

source: Now to use ``noise``, add the following to the ``fragment`` function:
de: Um nun ``Rauschen`` zu verwenden, fügen Sie der Funktion ``Fragment`` folgendes hinzu:
zh_tw: 現在使用 ``noised`` , 將以下內容新增到 ``fragment`` 函式中:

source: In order to highlight the texture, we set the material to unshaded.
de: Um die Textur hervorzuheben, setzen wir das Material auf unschattiert.
zh_tw: 為了突出顯示紋理, 我們將材質設定為無陰影.

source: You can see now that the noise indeed wraps seamlessly around the sphere. Although this looks nothing like the planet you were promised. So let's move onto something more colorful.
de: Sie können jetzt sehen, dass das Rauschen tatsächlich nahtlos um die Kugel herumgeht. Allerdings sieht das nicht aus wie der Planet, der Ihnen versprochen wurde. Gehen wir also zu etwas Bunterem über.
zh_tw: 你現在可以看到, 儘管這看起來完全不像所承諾的球體, 但噪音確實無縫地包裹著球體. 對此, 讓我們進入一些更豐富多彩的東西.

source: Coloring the planet
de: Einfärben des Planeten
zh_tw: 著色這個星球

source: Now to make the planet colors. While there are many ways to do this, for now, we will stick with a gradient between water and land.
de: Nun zum Einfärben des Planeten. Es gibt zwar viele Möglichkeiten, dies zu tun, aber für den Moment werden wir bei einem Farbverlauf zwischen Wasser und Land bleiben.
zh_tw: 現在來製作行星的顏色. 雖然有很多方法可以做到這一點, 但目前, 我們將使用水和陸地之間的梯度.

source: To make a gradient in GLSL, we use the ``mix`` function. ``mix`` takes two values to interpolate between and a third argument to choose how much to interpolate between them; in essence, it *mixes* the two values together. In other APIs, this function is often called ``lerp``. However, ``lerp`` is typically reserved for mixing two floats together; ``mix`` can take any values whether it be floats or vector types.
de: Um einen Gradienten in GLSL zu erzeugen, benutzen wir die Funktion ``mix``. Die Funktion ``mix`` nimmt zwei Werte, zwischen denen interpoliert werden soll, und ein drittes Argument, um festzulegen, wie stark zwischen ihnen interpoliert werden soll; im Wesentlichen *mischt* sie die beiden Werte zusammen. In anderen APIs wird diese Funktion oft ``lerp`` genannt. Allerdings ist ``lerp`` typischerweise für das Mischen von zwei Float-Zahlen reserviert; ``mix`` kann beliebige Werte annehmen, seien es Float-Zahlen oder Vektortypen.
zh_tw: 要在 GLSL 中建立漸變, 我們使用 ``mix`` 函式. ``mix`` 需要兩個值來插值和第三個參數來選擇在它們之間插入多少, 實質上它將兩個值 *混合* 在一起. 在其他API中, 此函式通常稱為 ``lerp`` . 雖然 ``lerp`` 通常用於將兩個浮點數混合在一起, 但 ``mix`` 可以取任何值, 無論它是浮點數還是向量型別.

source: The first color is blue for the ocean. The second color is a kind of reddish color (because all alien planets need red terrain). And finally, they are mixed together by ``n * 0.5 + 0.5``. ``n`` smoothly varies between ``-1`` and ``1``. So we map it into the ``0-1`` range that ``mix`` expects. Now you can see that the colors change between blue and red.
de: Die erste Farbe ist blau für den Ozean. Die zweite Farbe ist eine Art rötliche Farbe (weil alle außerirdischen Planeten rotes Terrain brauchen). Und schließlich werden sie durch ``n * 0,5 + 0,5`` zusammengemischt. ``n`` variiert gleichmäßig zwischen ``-1`` und ``1``. Also übertragen wir es auf den Bereich ``0-1``, den ``mix`` erwartet. Jetzt kann man sehen, dass die Farben zwischen blau und rot wechseln.
zh_tw: 第一種顏色是藍色, 代表海洋. 第二種顏色是一種偏紅的顏色, 因為所有外星球都需要紅色的地形. 最後, 它們 ``n * 0.5 + 0.5`` 混合在一起. ``n`` 在 ``-1`` 和 ``1`` 之間平滑變化. 所以我們把它對應到 ``mix`` 預期的 ``0-1`` 範圍內. 現在你可以看到, 顏色在藍色和紅色之間變化.

source: That is a little more blurry than we want. Planets typically have a relatively clear separation between land and sea. In order to do that, we will change the last term to ``smoothstep(-0.1, 0.0, n)``. And thus the whole line becomes:
de: Das ist ein bisschen unschärfer, als wir wollen. Planeten haben normalerweise eine relativ klare Trennung zwischen Land und Meer. Um das zu erreichen, ändern wir den letzten Term in ``smoothstep(-0.1, 0.0, n)``. Und so wird die ganze Zeile zu:
zh_tw: 這比我們想要的還要模糊一些. 行星通常在陸地和海洋之間有一個相對清晰的分隔. 為了做到這一點, 我們將把最後一項改為 ``smoothstep(-0.1, 0.0, n)`` . 整條線就變成了這樣:

source: What ``smoothstep`` does is return ``0`` if the third argument is below the first and ``1`` if the third argument is larger than the second and smoothly blends between ``0`` and ``1`` if the third number is between the first and the second. So in this line, ``smoothstep`` returns ``0`` whenever ``n`` is less than ``-0.1`` and it returns ``1`` whenever ``n`` is above ``0``.
de: Was ``smoothstep`` macht, ist ``0`` zurückzugeben, wenn das dritte Argument kleiner als das erste ist und ``1``, wenn das dritte Argument größer als das zweite ist. Es gibt einen gleitenden Wert zwischen ``0`` und ``1`` zurück, wenn die dritte Zahl zwischen dem ersten und dem zweiten liegt. In dieser Zeile liefert ``smoothstep`` also ``0``, wenn ``n`` kleiner als ``-0.1`` ist und ``1``, wenn ``n`` größer als ``0`` ist.
zh_tw: ``smoothstep`` 所做的是, 如果第三個參數低於第一個參數, 則返回 ``0`` , 如果第三個參數大於第二個參數, 則返回 ``1`` , 如果第三個數字在第一個和第二個之間, 則在 ``0`` 和 ``1`` 之間平滑地混合. 所以在這一行中, 當 ``n`` 小於 ``-0.1`` 時, ``smoothstep`` 返回 ``0`` , 當 ``n`` 高於 ``0`` 時, 它返回 ``1`` .

source: One more thing to make this a little more planet-y. The land shouldn't be so blobby; let's make the edges a little rougher. A trick that is often used in shaders to make rough looking terrain with noise is to layer levels of noise over one another at various frequencies. We use one layer to make the overall blobby structure of the continents. Then another layer breaks up the edges a bit, and then another, and so on. What we will do is calculate ``n`` with four lines of shader code instead of just one. ``n`` becomes:
de: Noch eine Sache, um das Ganze ein wenig planetarer zu machen. Das Land sollte nicht so klumpig sein; wir sollten die Kanten ein wenig rauer gestalten. Ein Trick, der oft in Shadern verwendet wird, um rau aussehendes Terrain mit Rauschen zu erzeugen, ist das Übereinanderschichten von Rauschebenen mit verschiedenen Frequenzen. Wir verwenden eine Ebene, um die allgemeine Klecksstruktur der Kontinente zu erzeugen. Eine weitere Ebene bricht die Kanten ein wenig auf, dann eine weitere und so weiter. Wir werden ``n`` mit vier Zeilen Shader-Code berechnen, anstatt nur mit einer. Aus ``n`` wird:
zh_tw: 還有一件事, 使其更像一個行星. 這片土地不應該是圓球狀的；讓我們把邊緣變得更粗糙一些. 在著色器中經常使用的一個技巧是在不同的頻率下將不同層次的雜訊疊加在一起, 使地形看起來粗糙. 我們使用一個層來製作大陸的整體球狀結構. 然後, 另一層將邊緣打碎, 然後是另一層, 以此類推. 我們要做的是用四行著色器程式碼來計算 ``n`` , 而不是只有一行. ``n`` 變成了:

source: And now the planet looks like:
de: Nun sieht der Planet so aus:
zh_tw: 現在這個星球看起來像:

source: And with shading turned back on, it looks like:
de: Und wenn das Shading wieder aktiviert ist, sieht es so aus:
zh_tw: 而在重新打開陰影後, 看起來就像:

source: Making an ocean
de: Erzeugen eines Ozeans
zh_tw: 製作海洋
