Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/visual_shaders.po
Languages: de, zh_tw

source: Using VisualShaders
de: Verwendung von VisualShaders
zh_tw: 使用視覺化著色器

source: VisualShaders are the visual alternative for creating shaders.
de: VisualShaders sind die visuelle Alternative zur Erstellung von Shadern.
zh_tw: VisualShaders 是建立著色器的視覺化替代方案。

source: As shaders are inherently linked to visuals, the graph-based approach with previews of textures, materials, etc. offers a lot of additional convenience compared to purely script-based shaders. On the other hand, VisualShaders do not expose all features of the shader script and using both in parallel might be necessary for specific effects.
de: Da Shader von Natur aus mit visuellen Effekten verknüpft sind, bietet der grafikbasierte Ansatz mit Vorschauen von Texturen, Materialien usw. im Vergleich zu rein skriptbasierten Shadern eine Menge zusätzlichen Komfort. Andererseits stellen VisualShader nicht alle Funktionen des Shader-Skripts zur Verfügung, und für bestimmte Effekte kann es notwendig sein, beide parallel zu verwenden.
zh_tw: 由於著色器本質上與視覺效果有聯繫, 與純粹基於腳本的著色器相比, 基於圖的方式, 有紋理, 材質等的預覽, 提供了很多額外的便利. 另一方面,VisualShaders並沒有暴露出著色器腳本的所有功能, 對於特定的效果, 並行使用兩者可能是必要的.

source: If you are not familiar with shaders, start by reading :ref:`doc_introduction_to_shaders`.
de: Wenn Sie mit Shadern nicht vertraut sind, lesen Sie zunächst :ref:`doc_introduction_to_shaders`.
zh_tw: 如果你對著色器不熟悉，可以從閱讀 :ref:`doc_introduction_to_shaders` 開始。

source: Creating a VisualShader
de: Erstellen eines VisualShaders
zh_tw: 建立內容

source: VisualShaders can be created in any :ref:`class_ShaderMaterial`. To begin using VisualShaders, create a new ``ShaderMaterial`` in an object of your choice.
de: VisualShader können in jedem :ref:`class_ShaderMaterial` erstellt werden. Um VisualShader zu benutzen, erstellen Sie ein neues ``ShaderMaterial`` in einem Objekt Ihrer Wahl.
zh_tw: VisualShader 可以在任何 :ref:`class_ShaderMaterial` 中建立。要開始使用 VisualShader，請在你選擇的物件中建立一個新的 ``ShaderMaterial``。

source: Then assign a :ref:`class_VisualShader` resource to the ``Shader`` property.
de: Weisen Sie dann der Property ``Shader`` eine Ressource :ref:`class_VisualShader` zu.
zh_tw: 然後將一個 :ref:`class_VisualShader` 資源配置給 ``Shader`` 屬性。

source: Click on the new ``Shader`` resource and the Create Shader dialog will open automatically. Change the Type option to VisualShader in the dropdown.
de: Klicken Sie auf die neue ``Shader``-Ressource und der Dialog Shader Erzeugen wird automatisch geöffnet. Ändern Sie in der Dropdown-Liste die Option "Typ" in "VisualShader".
zh_tw: 點擊新的 ``VisualShader`` 資源，Visual Shader 編輯器就會自動打開。Visual Shader 編輯器的佈局包括兩部分：上層工具列和圖表本身。

source: The layout of the Visual Shader Editor comprises two parts: the upper toolbar and the graph itself.
de: Das Layout des Visual Shader-Editors besteht aus zwei Teilen: der oberen Symbolleiste und dem Diagramm selbst.
zh_tw: 點擊新的 ``VisualShader`` 資源，Visual Shader 編輯器就會自動打開。Visual Shader 編輯器的佈局包括兩部分：上層工具列和圖表本身。

source: From left to right in the toolbar:
de: Von links nach rechts in der Toolbar:
zh_tw: 在工具列中從左到右：

source: The ``Add Node`` button displays a popup menu to let you add nodes to the shader graph.
de: Der ``Add Node``-Button zeigt ein Popup-Menü an, mit dem Sie dem Shader-Graphen Nodes hinzufügen können.
zh_tw: ``新增節點`` 按鈕會顯示一個彈出式功能表，讓你為著色器圖新增節點。

source: The drop-down menu is the shader type: Vertex, Fragment and Light. Like for script shaders, it defines what built-in nodes will be available.
de: Das Drop-Down-Menü ist der Shader-Typ: Vertex, Fragment und Licht. Wie bei Skript-Shadern definiert es, welche Built-in-Nodes verfügbar sein werden.
zh_tw: 下拉式功能表是著色器型別. 頂點, 碎片和光線和腳本著色器一樣, 它定義了哪些內建節點將是可用的.

source: The following buttons and number input control the zooming level, grid snapping and distance between grid lines (in pixels).
de: Die folgenden Buttons und die Zahleneingabe steuern die Zoomstufe, das Einrasten des Rasters und den Abstand zwischen den Rasterlinien (in Pixeln).
zh_tw: 下面的按鈕和數位輸入控制縮放級別, 網格捕捉和格線之間的距離(單位為像素).

source: The last icon shows the generated shader code corresponding to your graph.
de: Das letzte Icon zeigt den generierten Shader-Code, der dem Graphen entspricht.
zh_tw: 最後一個圖示顯示了與你的圖形對應生成的著色器程式碼.

source: Although VisualShaders do not require coding, they share the same logic with script shaders. It is advised to learn the basics of both to have a good understanding of the shading pipeline.
de: Obwohl VisualShader kein Coding erfordern, teilen sie dieselbe Logik mit Skript-Shadern. Es wird empfohlen, die Grundlagen von beiden zu erlernen, um ein gutes Verständnis der Shading-Pipeline zu haben.
zh_tw: 雖然 VisualShader 不需要編碼，但它們與腳本著色器有著相同的邏輯。建議學習這兩者的基礎知識，以便對著色管道有一個很好的理解。

source: The visual shader graph is converted to a script shader behind the scene, and you can see this code by pressing the last button in the toolbar. This can be convenient to understand what a given node does and how to reproduce it in scripts.
de: Der visuelle Shader-Graph wird im Hintergrund in einen Skript-Shader umgewandelt. Sie können diesen Code sehen, indem Sie den letzten Button in der Toolbar drücken. Dies kann praktisch sein, um zu verstehen, was ein bestimmter Node tut und wie man ihn in Skripten reproduzieren kann.
zh_tw: 視覺化的著色器圖形在場景後臺轉換為腳本著色器, 按下工具列上的最後一個按鈕就可以看到程式碼. 這可以方便理解特定節點的作用, 以及如何在腳本中呈現.

source: Using the Visual Shader Editor
de: Verwendung des visuellen Shader-Editors
zh_tw: 使用 Visual Shader 編輯器

source: By default, every new ``VisualShader`` will have an output node. Every node connection ends at one of the output node's sockets. A node is the basic unit to create your shader. To add a new node, click on the ``Add Node`` button on the upper left corner or right click on any empty location in the graph, and a menu will pop up.
de: Standardmäßig wird jeder neue ``VisualShader`` einen Ausgangs-Node haben. Jede Nodeverbindung endet an einem der Socket des Ausgangsnodes. Ein Node ist die Basiseinheit zur Erstellung eines Shaders. Um ein neuen Node hinzuzufügen, klicken Sie auf den ``Add Node``-Button in der oberen linken Ecke oder klicken mit der rechten Maustaste auf eine beliebige leere Stelle im Graphen und ein Menü öffnet sich.
zh_tw: 預設情況下, 每個新的 ``VisualShader`` 都會有一個輸出節點. 每個節點的連接都在輸出節點的一個套接處結束. 節點是建立著色器的基本單元. 要新增一個新的節點, 點擊左上角的 ``新增節點`` 按鈕, 或者在圖形中的任何一個空的位置上右擊, 就會彈出一個功能表.

source: This popup has the following properties:
de: Das Popup zeigt die folgenden Propertys an:
zh_tw: 此快顯視窗具有以下屬性:

source: If you right-click on the graph, this menu will be called at the cursor position and the created node, in that case, will also be placed under that position; otherwise, it will be created at the graph's center.
de: Wenn Sie mit der rechten Maustaste auf den Graphen klicken, wird dieses Menü an der Cursorposition aufgerufen und das erzeugte Node wird in diesem Fall ebenfalls unter dieser Position platziert; andernfalls wird es in der Mitte des Graphen platziert.
zh_tw: 如果你在圖形上按一下右鍵, 這個功能表將在游標位置被調出, 建立的節點, 在這種情況下, 也將被放在該位置, 否則, 將在圖形的中心位置建立.

source: It can be resized horizontally and vertically allowing more content to be shown. Size transform and tree content position are saved between the calls, so if you suddenly closed the popup you can easily restore its previous state.
de: Es kann horizontal und vertikal in der Größe verändert werden, so dass mehr Inhalte angezeigt werden können. Die Größentransformation und die Position des Bauminhalts werden zwischen den Aufrufen gespeichert. Wenn also das Popup plötzlich geschlossen wird, kann man den vorherigen Zustand leicht wiederherstellen.
zh_tw: 它可以在水平和垂直方向上調整大小, 以允許顯示更多的內容. 尺寸變換和樹的內容位置在呼叫當中被保存, 所以如果突然關閉了快顯視窗, 可以很容易地恢復它以前的狀態.

source: The ``Expand All`` and ``Collapse All`` options in the drop-down option menu can be used to easily list the available nodes.
de: Die Optionen ``Alles Ausklappen`` und ``Alles Einklappen`` im Drop-Down-Menü können verwendet werden, um die verfügbaren Nodes einfach aufzulisten.
zh_tw: 下拉選項功能表中的 ``展開全部`` 和 ``折疊全部`` 選項可用於輕鬆列出可用節點.

source: You can also drag and drop nodes from the popup onto the graph.
de: Sie können auch Nodes aus dem Popup auf den Graphen ziehen.
zh_tw: 你也可以從彈出式功能表中拖放節點到圖形上.

source: While the popup has nodes sorted in categories, it can seem overwhelming at first. Try to add some of the nodes, plug them in the output socket and observe what happens.
de: Obwohl im Popup Nodes in Kategorien sortiert sind, kann dies auf den ersten Blick überwältigend erscheinen. Versuchen Sie einige der Nodes hinzuzufügen, stecken diese in den Ausgangssocket und beobachten, was passiert.
zh_tw: 雖然彈出的節點是按類別分類的, 但一開始會不知所以. 試著新增一些節點, 將它們插入輸出套接處, 觀察會發生什麼.

source: When connecting any ``scalar`` output to a ``vector`` input, all components of the vector will take the value of the scalar.
de: Wenn ein beliebiger ``scalar``-Ausgang mit einem ``vector``-Eingang verbunden wird, nehmen alle Komponenten des Vektors den Wert des Skalars an.
zh_tw: 當把任何 ``scalar`` 輸出連接到 ``vector`` 輸入時, 向量的所有分量將取標量的值.

source: When connecting any ``vector`` output to a ``scalar`` input, the value of the scalar will be the average of the vector's components.
de: Wenn ein beliebiger ``vector``-Ausgang mit einem ``scalar``-Eingang verbunden wird, ist der Wert des Skalars der Mittelwert der Komponenten des Vektors.
zh_tw: 當把任何 ``vector`` 輸出連接到 ``scalar`` 輸入時, 標量的值將是向量分量的平均值.

source: Visual Shader node interface
de: Node-Interface von Visuellen Shadern

source: Visual shader nodes have input and output ports. The input ports are located on the left side of the node, and output ports are located on the right side of the node.
de: Visuelle Shader-Nodes haben Eingangs- und Ausgangs-Ports. Die Eingabe-Ports befinden sich auf der linken Seite des Nodes, die Ausgabe-Ports auf der rechten Seite des Nodes.

source: These ports are colored to differentiate type of port:
de: Diese Ports sind farblich gekennzeichnet, um den Typ des Ports zu unterscheiden:

source: Port types
de: Port-Typen

source: Type
de: Typ
zh_tw: 型別

source: Color
de: Farbe
zh_tw: 顏色

source: Description
de: Beschreibung
zh_tw: 說明

source: Example
de: Beispiel
zh_tw: 範例

source: Scalar
de: Skalar

source: Cyan
de: Türkis

source: Scalar is a single value.
de: Skalar ist ein einzelner Wert.

source: Vector
de: Vektor
zh_tw: 向量 Vector

source: Purple
de: Violett

source: Vector is a set of values.
de: Ein Vektor ist eine Menge von Werten.

source: Blue
de: Blau

source: On or off, true or false.
de: Ein oder aus, wahr oder falsch.

source: Transform
de: Transformation
zh_tw: 變換

source: A matrix, usually used to transform vertices.
de: Eine Matrix, wird in der Regel zur Transformation von Vertices verwendet.

source: Yellow
de: Gelb

source: A texture sampler. It can be used to sample textures.
de: Ein Textur-Sampler. Er kann verwendet werden, um Texturen abzutasten.

source: All of the types are used in the calculations of vertices, fragments, and lights in the shader. For example: matrix multiplication, vector addition, or scalar division.
de: Alle Typen werden bei den Berechnungen von Vertices, Fragmenten und Lichtern im Shader verwendet. Zum Beispiel: Matrixmultiplikation, Vektoraddition oder Skalardivision.

source: There are other types but these are the main ones.
de: Es gibt noch andere Arten, aber das sind die wichtigsten.

source: Below are some special nodes that are worth knowing about. The list is not exhaustive and might be expanded with more nodes and examples.
de: Nachfolgend sind einige spezielle Nodes aufgeführt, die wissenswert sind. Die Liste ist nicht erschöpfend und kann mit weiteren Nodes und Beispielen erweitert werden.
zh_tw: 以下是一些值得瞭解的特殊節點. 該列表並非詳盡無遺, 可能會增加更多的節點和範例.

source: The ``Expression`` node allows you to write Godot Shading Language (GLSL-like) expressions inside your visual shaders. The node has buttons to add any amount of required input and output ports and can be resized. You can also set up the name and type of each port. The expression you have entered will apply immediately to the material (once the focus leaves the expression text box). Any parsing or compilation errors will be printed to the Output tab. The outputs are initialized to their zero value by default. The node is located under the Special tab and can be used in all shader modes.
de: Der ``Expression``-Node erlaubt es Ihnen, Godot Shading Language (GLSL-ähnliche)-Ausdrücke in Ihre Visual Shader zu schreiben. Der Node verfügt über Buttons, mit denen Sie eine beliebige Anzahl von Ein- und Ausgabe-Ports hinzufügen können, und kann in der Größe verändert werden. Sie können auch den Namen und den Typ jedes Ports festlegen. Der von Ihnen eingegebene Ausdruck wird sofort auf das Material angewendet (sobald der Fokus das Textfeld des Ausdrucks verlässt). Alle Parsing- oder Kompilierungsfehler werden auf dem Ausgabe-Tab ausgegeben. Die Ausgänge werden standardmäßig mit dem Wert Null initialisiert. Der Node befindet sich auf dem Spezial-Tab und kann in allen Shader-Modi verwendet werden.
zh_tw: ``Expression`` 節點允許你在視覺著色器中編寫 Godot 著色語言(GLSL-like)運算式. 該節點具有新增任意數量的所需輸入和輸出埠的按鈕, 並且可以調整其大小. 你還可以設定每個埠的名稱和型別. 輸入的運算式將立即應用於材質(焦點離開運算式文字方塊後). 任何解析或編譯錯誤都將列印到 "輸出" 分頁. 預設情況下, 輸出初始化為零值. 該節點位於 "特殊" 分頁下, 可用於所有著色器模式.

source: The possibilities of this node are almost limitless – you can write complex procedures, and use all the power of text-based shaders, such as loops, the ``discard`` keyword, extended types, etc. For example:
de: Die Möglichkeiten dieses Nodes sind fast grenzenlos - Sie können komplexe Prozeduren schreiben und alle Möglichkeiten textbasierter Shader nutzen, wie z.B. Schleifen, das Schlüsselwort ``discard``, erweiterte Typen, etc. Zum Beispiel:
zh_tw: 這個節點的可能性幾乎無窮無盡 —— 你可以編寫複雜的過程, 並使用基於文字的著色器的全部力量, 例如迴圈, 關鍵字 ``discard`` , 擴充型別, 等等. 例如:

source: The ``Fresnel`` node is designed to accept normal and view vectors and produces a scalar which is the saturated dot product between them. Additionally, you can setup the inversion and the power of equation. The ``Fresnel`` node is great for adding a rim-like lighting effect to objects.
de: Der ``Fresnel`` -Node ist so ausgelegt, dass er Normal- und Ansichtsvektoren akzeptiert und einen Skalar erzeugt, der das gesättigte Skalarprodukt zwischen ihnen ist. Zusätzlich können Sie die Inversion und die Potenz der Gleichung einstellen. Der ``Fresnel``-Node eignet sich hervorragend, um Objekten einen randartigen Lichteffekt zu verleihen.
zh_tw: ``Fresnel`` 節點用於接受法線向量和視圖向量, 並生成一個標量, 即它們之間的飽和點積. 此外, 你可以設定反轉和方程的冪. ``Fresnel`` 節點非常適合為對象新增類似邊緣的照明效果.

source: Boolean node
de: Boolescher Node
zh_tw: Boolean 節點

source: The ``Boolean`` node can be converted to ``Scalar`` or ``Vector`` to represent ``0`` or ``1`` and ``(0, 0, 0)`` or ``(1, 1, 1)`` respectively. This property can be used to enable or disable some effect parts with one click.
de: Der ``Boolean``-Node kann in ``Scalar`` oder ``Vector`` umgewandelt werden, um ``0`` oder ``1`` und ``(0, 0, 0)`` bzw. ``(1, 1, 1)`` zu repräsentieren. Diese Property kann verwendet werden, um einige Effektteile mit einem Klick zu aktivieren oder zu deaktivieren.
zh_tw: ``Boolean`` 節點可以轉換為或 ``Scalar`` 或 ``Vector`` , 分別表示 ``0`` 或 ``1`` 和 ``(0, 0, 0)`` 或 ``(1, 1, 1)`` . 該屬性可用於一鍵啟用或禁用某些效果元件.

source: The ``If`` node allows you to setup a vector which will be returned the result of the comparison between ``a`` and ``b``. There are three vectors which can be returned: ``a == b`` (in that case the tolerance parameter is provided as a comparison threshold – by default it is equal to the minimal value, i.e. ``0.00001``), ``a > b`` and ``a < b``.
de: Der ``If``-Node erlaubt es Ihnen, einen Vektor zu definieren, der das Ergebnis des Vergleichs zwischen ``a`` und ``b`` zurückgibt. Es gibt drei Vektoren, die zurückgegeben werden können: ``a == b`` (in diesem Fall wird der Toleranzparameter als Vergleichsschwelle angegeben - standardmäßig ist er gleich dem Minimalwert, d.h. ``0.00001``), ``a > b`` und ``a < b``.
zh_tw: ``If`` 節點允許你設定一個向量, 它將返回 ``a`` 和 ``b`` 之間的比較結果. 有三個向量可以返回: ``a == b`` (在這種情況下, 容差參數是作為比較閾值提供的--預設情況下它等於最小值, 即 ``0.00001`` ), ``a > b`` 和 ``a < b`` .

source: The ``Switch`` node returns a vector if the boolean condition is ``true`` or ``false``. ``Boolean`` was introduced above. If you convert a vector to a true boolean, all components of the vector should be above zero.
de: Der ``Switch``-Node gibt einen Vektor zurück, wenn die boolesche Bedingung ``true`` oder ``false`` ist. ``Boolean`` wurde oben eingeführt. Wenn Sie einen Vektor in einen booleschen true-Wert umwandeln, sollten alle Komponenten des Vektors über Null liegen.
zh_tw: 如果布林條件是 ``true`` 或 ``false`` , ``Switch`` 節點返回一個向量. ``Boolean`` 在上面介紹過. 如果你把一個向量轉換為真布林值, 那麼向量的所有分量都應該高於零.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Visual Shader nodes
zh_tw: 可視化著色器節點

source: Expression node
zh_tw: Expression 節點

source: Fresnel node
zh_tw: Fresnel 結點

source: If node
zh_tw: If 節點

source: Switch node
zh_tw: Switch 節點
