Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/jitter_stutter.po
Languages: de, zh_tw

source: Fixing jitter, stutter and input lag
de: Behebung von Jitter, Stutter und Input-Lag
zh_tw: 修復抖動、卡頓和輸入延遲

source: What is jitter, stutter and input lag?
de: Was ist Jitter, Stutter und Input-Lag?
zh_tw: 什麼是抖動、卡頓和輸入延遲？

source: *Jitter* and *stutter* are two different alterations to visible motion of objects on screen that may affect a game, even when running at full speed. These effects are mostly visible in games where the world moves at a constant speed in a fixed direction, like runners or platformers.
de: *Jitter* und *Stutter* sind zwei verschiedene Änderungen der sichtbaren Bewegung von Objekten auf dem Bildschirm, die sich auf ein Spiel auswirken können, selbst wenn sie mit voller Geschwindigkeit laufen. Diese Effekte sind vor allem in Spielen sichtbar, in denen sich die Welt mit konstanter Geschwindigkeit in eine feste Richtung bewegt, wie Runner oder Plattformer.
zh_tw: *抖動*（Jitter）和*卡頓*（stutter）是即使遊戲在全速運作時，也可能出現在螢幕上物體可見運動中的兩種不同變化，可能會影響遊戲體驗。這些問題在世界以恒定速度朝著固定方向運動的遊戲中影響最明顯, 比如跑酷或平臺類遊戲.

source: *Input lag* is unrelated to jitter and stutter, but is sometimes discussed alongside. Input lag refers to visible on-screen delay when performing actions with the mouse, keyboard, controller or touchscreen. It can be related to game code, engine code or external factors (such as hardware). Input lag is most noticeable in games that use the mouse to aim, such as first-person games. Input lag can't be completely eliminated, but it can be reduced in several ways.
de: Der *Input-Lag* hat nichts mit Jitter und Stutter zu tun, wird aber manchmal zusammen mit ihnen diskutiert. Input-Lag bezieht sich auf die sichtbare Verzögerung auf dem Bildschirm bei der Ausführung von Aktionen mit der Maus, der Tastatur, dem Controller oder dem Touchscreen. Sie kann mit dem Spielcode, dem Enginecode oder externen Faktoren (wie der Hardware) zusammenhängen. Input-Lag macht sich vor allem in Spielen bemerkbar, bei denen die Maus zum Zielen verwendet wird, z.B. in Ego-Shootern. Input-Lag lässt sich zwar nicht vollständig beseitigen, aber auf verschiedene Weise reduzieren.
zh_tw: *輸入延遲*與抖動和卡頓無關，但有時會同時討論。輸入延遲是指使用滑鼠、鍵盤、控制器或觸控螢幕執行操作時可見的螢幕延遲。它可以與遊戲程式碼、引擎程式碼或外部因素（例如硬體）有關。輸入延遲在使用滑鼠瞄準的遊戲（例如第一人稱遊戲）中最為明顯。輸入延遲無法完全消除，但可以透過多種方式減少。

source: Distinguishing between jitter and stutter
de: Unterscheidung zwischen Jitter und Stutter
zh_tw: 抖動和卡頓的區分

source: A game running at a normal framerate without exhibiting any effect will appear smooth:
de: Ein Spiel, das mit einer normalen Framerate läuft, ohne einen Effekt zu zeigen, erscheint flüssig:
zh_tw: 一款在正常影格下運作, 而不顯示任何效果的遊戲將顯得平滑:

source: A game exhibiting *jitter* will shake constantly in a very subtle way:
de: Ein Spiel, das *Jitter* aufweist, wackelt ständig auf eine sehr subtile Weise:
zh_tw: 遊戲展示了*抖動*將以非常細微的方式持續抖動：

source: Finally, a game exhibiting *stutter* will appear smooth, but appear to *stop* or *roll back a frame* every few seconds:
de: Schließlich erscheint ein Spiel mit *Stutter* flüssig, scheint jedoch alle paar Sekunden *anzuhalten* oder *einen Frame zurückzusetzen*:
zh_tw: 最後，存在“卡頓”的遊戲看上去是流暢的，但似乎每隔幾秒鐘就會*停頓*或*回滾一影格*：

source: Jitter
zh_tw: 抖動

source: There can be many causes of jitter, the most typical one happens when the game *physics frequency* (usually 60 Hz) runs at a different resolution than the monitor refresh rate. Check whether your monitor refresh rate is different from 60 Hz.
de: Es kann viele Ursachen für Jitter geben. Die typischste tritt auf, wenn die *Physikfrequenz* des Spiels (normalerweise 60 Hz) mit einer anderen Auflösung als die Monitor-Aktualisierungsrate läuft. Überprüfen Sie, ob die Aktualisierungsrate Ihres Monitors eine andere als 60 Hz ist.
zh_tw: 產生抖動的原因有很多，最典型的情況發生在運作遊戲時的*物理頻率*（通常為 60 Hz）以與顯示器更新率不同。檢查您的顯示器更新率是否為 60 Hz。

source: This is generally not a problem, given that most monitors are 60 Hz, and starting with Godot 3.1, a frame timer was introduced that tries to synchronize with refresh as well as possible.
de: Dies ist in der Regel kein Problem, da die meisten Monitore mit 60 Hz arbeiten und mit Godot 3.1 ein Frame-Timer eingeführt wurde, der versucht, sich so gut wie möglich mit der Bildwiederholung zu synchronisieren.
zh_tw: 這通常不是一個問題, 因為大多數顯示器都是60赫茲, 而且從Godot 3.1開始, 引入了一個影格計時器, 儘量與更新同步.

source: Sometimes only some objects appear to jitter (character or background). This happens when they are processed in different time sources (one is processed in the physics step while another is processed in the idle step). Godot 3.1 does some improvements to this, from allowing kinematic bodies to be animated in the regular ``_process()`` loop, to further fixes in the frame timer.
de: Manchmal scheinen nur einige Objekte zu jittern (Charakter oder Hintergrund). Dies geschieht, wenn sie in verschiedenen Zeitquellen verarbeitet werden (eines wird im Physikschritt verarbeitet, ein anderes im Leerlaufschritt). Godot 3.1 hat hier einige Verbesserungen vorgenommen, angefangen bei der Möglichkeit, Kinematic Bodys in der regulären ``_process()`` Schleife zu animieren, bis hin zu weiteren Korrekturen im Frame-Timer.
zh_tw: 有時只有一些物件會出現抖動（角色或背景）。當它們在不同的時間源中處理時，就會發生這種情況（一個在物理步驟中處理，另一個在空閒步驟中處理）。Godot 3.1 版本對此做了一些改進，從允許運動體在規則的 _process 迴圈中被動畫化，進一步修正影格計時器。

source: You can use physics interpolation to mitigate physics-related jittering. See `lawnjelly's smoothing-addon <https://github.com/lawnjelly/smoothing-addon>`__ for an add-on that can be dropped into any project to enable physics interpolation.
de: Sie können Physik-Interpolation verwenden, um physikalisch bedingtes Jittern zu mildern. Siehe `lawnjelly's Smoothing-Add-on <https://github.com/lawnjelly/smoothing-addon>`__ für ein Add-on, das in jedes Projekt eingefügt werden kann, um Physik-Interpolation zu aktivieren.
zh_tw: 你可以使用物理插值來緩解物理相關的抖動。請參閱 `lawnjelly 的平滑外掛程式 <https://github.com/lawnjelly/smoothing-addon>`__，可以將其新增到任何專案中以啟用物理插值。

source: Stutter
zh_tw: 卡頓

source: Stutter may happen due to two different reasons. The first, and most obvious one, is the game not being able to keep full framerate performance. Solving this is game specific and will require optimization.
de: Stottern kann aus zwei verschiedenen Gründen auftreten. Der erste und offensichtlichste Grund ist, dass das Spiel nicht in der Lage ist, die volle Framerate zu halten. Die Lösung dieses Problems ist spielspezifisch und erfordert eine Optimierung.
zh_tw: 產生卡頓有兩個不同原因。第一個，也是最明顯的一個，就是遊戲無法保持完整的影格率性能。解決方法是因遊戲而異的，需要進行優化。

source: The second is more complicated, because it is often not associated to the engine or game but the underlying operating system. Here is some information regarding stutter on different OSs.
de: Die zweite ist komplizierter, da sie häufig nicht der Engine oder dem Spiel, sondern dem zugrunde liegenden Betriebssystem zugeordnet ist. Hier finden Sie einige Informationen zum Stutter auf verschiedenen Betriebssystemen.
zh_tw: 第二個原因更複雜，因為它通常與引擎或遊戲無關，而與底層作業系統有關。下面是不同作業系統上，關於卡頓的一些資訊。

source: On platforms that support disabling V-Sync, stuttering can be made less noticeable by disabling V-Sync in the project settings. This will however cause tearing to appear, especially on monitors with low refresh rates. If your monitor supports it, consider enabling variable refresh rate (G-Sync/FreeSync) while leaving V-Sync enabled. This avoids mitigating some forms of stuttering without introducing tearing.
de: Auf Plattformen, die Deaktivierung von V-Sync unterstützen, kann das Stuttering durch die Deaktivierung von V-Sync in den Projekteinstellungen reduziert werden. Dies führt jedoch zu Tearing, insbesondere auf Monitoren mit niedrigen Bildwiederholraten. Wenn Ihr Monitor dies unterstützt, sollten Sie die variable Bildwiederholfrequenz (G-Sync/FreeSync) aktivieren und V-Sync aktiviert lassen. Dadurch werden einige Formen des Stutterings gemildert, ohne dass es zu Tearing kommt.
zh_tw: 在支援禁用垂直同步的平台上，透過在專案設定中停用垂直同步可以使卡頓現象變得不那麼明顯。然而，這會導致出現撕裂現象，尤其是在更新率較低的顯示器上。如果您的顯示器支援，請考慮啟用可變更新率（G-Sync/FreeSync），同時啟用垂直同步。這避免了減輕某些形式的口吃而不引起撕裂。

source: Forcing your graphics card to use the maximum performance profile can also help reduce stuttering, at the cost of increased GPU power draw.
de: Wenn Sie Ihre Grafikkarte zwingen, das maximale Performance-Profil zu verwenden, kann dies auch dazu beitragen, das Stuttering zu verringern, allerdings auf Kosten eines höheren Energieverbrauchs der GPU.
zh_tw: 強制顯示卡使用最大效能設定檔也有助於減少卡頓，但代價是增加 GPU 功耗。

source: Windows is known to cause stutter in windowed games. This mostly depends on the hardware installed, drivers version and processes running in parallel (e.g. having many browser tabs open may cause stutter in a running game). To avoid this, starting with 3.1, Godot raises the game priority to "Above Normal". This helps considerably but may not completely eliminate stutter.
de: Es ist bekannt, dass Windows beim Spielen im Fenstermodus Stuttering verursacht. Dies hängt hauptsächlich von der installierten Hardware, der Treiberversion und den parallel ausgeführten Prozessen ab (z.B. kann das Öffnen vieler Browser-Tabs in einem laufenden Spiel zu Stuttering führen). Um dies zu vermeiden erhöht Godot ab 3.1 die Spielpriorität auf "Über Normal". Dies hilft erheblich, kann jedoch das Stuttering nicht vollständig beseitigen.
zh_tw: 眾所周知，Windows 作業系統在視窗化遊戲時會產生卡頓。這主要取決於您所安裝的硬體，驅動程式版本和並行運作的程序（例如，打開多個瀏覽器標籤頁可能導致遊戲在運作時出現卡頓）。為了避免這種情況，從 3.1 版本開始，Godot 將遊戲的優先順序提升到了“高於標準”。這樣能夠相當程度緩解問題，但可能無法完全消除卡頓現象。

source: Eliminating this completely requires giving your game full privileges to become "time critical", which is not advised. Some games may do it, but it is advised to learn to live with this problem, as it is common for Windows games and most users won't play games windowed (games that are played in a window, e.g. puzzle games, will usually not exhibit this problem anyway).
de: Um dies vollständig zu beseitigen, müssen Sie Ihrem Spiel die vollen Berechtigungen geben, um "zeitkritisch" zu werden, was nicht empfohlen wird. Einige Spiele können dies tun, es wird jedoch empfohlen mit diesem Problem zu leben, da dies bei Windows-Spielen üblich ist und die meisten Benutzer keine Spiele im Fenstermodus spielen (Spiele, die in einem Fenster gespielt werden, z.B. Puzzlespiele, zeigen dieses Problem normalerweise nicht).
zh_tw: 完全消除這種情況需要給你的遊戲以充分的許可權, 使之成為 "time critical" , 這是不建議的. 有些遊戲可能會這樣做, 但建議學會忍受這個問題, 因為這對Windows遊戲來說很常見, 而且大多數使用者不會在視窗中玩遊戲(反正在視窗中玩的遊戲, 如益智遊戲, 通常不會出現這個問題).

source: For fullscreen, Windows gives special priority to the game so stutter is no longer visible and very rare. This is how most games are played.
de: Für den Vollbildmodus gibt Windows dem Spiel besondere Priorität, sodass Stuttering nicht mehr sichtbar und sehr selten ist. Die meisten Spiele werden so gespielt.
zh_tw: 對於全屏來說，Windows 系統對遊戲給予了特殊的優先順序，所以卡頓現象不再可見，也非常罕見。大多數遊戲都是這樣玩的。

source: Stutter may be visible on desktop Linux, but this is usually associated with different video drivers and compositors. Some compositors may also trigger this problem (e.g. KWin), so it is advised to try using a different one to rule it out as the cause. Some window managers such as KWin and Xfwm allow you to manually disable compositing, which can improve performance (at the cost of tearing).
de: Stuttering kann unter Desktop-Linux sichtbar sein, aber das hängt in der Regel mit verschiedenen Videotreibern und Compositors zusammen. Einige Compositors können dieses Problem ebenfalls auslösen (z. B. KWin), so dass es ratsam ist, einen anderen Compositor zu verwenden, um ihn als Ursache auszuschließen. Bei einigen Fenstermanagern wie KWin und Xfwm können Sie das Compositing manuell deaktivieren, was die Performance verbessern kann (zum Preis von Tearing).
zh_tw: 在 Linux 桌面系統上可以看到卡頓現象，這通常與不同的影片驅動程式和合成程式相關。Nouveau 驅動程式經常表現出這一點，而使用 AMD 和英偉達的驅動程式卻不會出現。一些合成器程式也可能引發這個問題（例如 KWin），因此我們建議用另一種方法來排除其原因。

source: `Feral GameMode <https://github.com/FeralInteractive/gamemode>`__ can be used to automatically apply optimizations (such as forcing the GPU performance profile) when running specific processes.
de: `Feral GameMode <https://github.com/FeralInteractive/gamemode>`__ kann verwendet werden, um automatisch Optimierungen (wie z.B. das Erzwingen des GPU-Performanceprofils) anzuwenden, wenn bestimmte Prozesse laufen.
zh_tw: `Feral GameMode <https://github.com/FeralInteractive/gamemode>`__ 可用於在執行特定程序時自動套用最佳化（例如強制 GPU 效能設定檔）。

source: Generally, macOS is stutter-free, although recently some bugs were reported when running on fullscreen (this is a macOS bug). If you have a machine exhibiting this behavior, please let us know.
de: Im Allgemeinen ist MacOS ruckelfrei, obwohl kürzlich einige Fehler beim Ausführen im Vollbildmodus gemeldet wurden (dies ist ein MacOS-Bug). Wenn Sie eine Maschine haben, die dieses Verhalten zeigt, teilen Sie uns dies bitte mit.
zh_tw: 通常情況下，macOS 不會出現卡頓現象，儘管最近在全屏運作時報告了一些 bug（這是 macOS 的 bug）。如果你的機器表現出這種行為，請將這問題提交給我們。

source: Generally, Android is stutter and jitter-free because the running activity gets all the priority. That said, there may be problematic devices (older Kindle Fire is known to be one). If you see this problem on Android, please let us know.
de: Im Allgemeinen ist Android frei von Stuttering und Jittering, da die laufende Aktivität immer Vorrang hat. Es kann jedoch problematische Geräte geben (z.B. ältere Kindle Fire). Wenn Sie dieses Problem auf Android sehen, lassen Sie es uns bitte wissen.
zh_tw: 通常情況下，Android 平臺不會出現卡頓和抖動現象，因為運作活動擁有所有的優先順序。也就是說，可能會出現問題的裝置（較舊的 Kindle Fire 就是其中之一）。如果你在 Android 平臺上看到這些問題，請將問題提交給我們。

source: iOS devices are generally stutter-free, but older devices running newer versions of the operating system may exhibit problems. This is generally unavoidable.
de: iOS-Geräte sind im Allgemeinen Stuttering-frei, ältere Geräte, auf denen neuere Versionen des Betriebssystems ausgeführt werden, können jedoch Probleme aufweisen. Dies ist in der Regel unvermeidlich.
zh_tw: iOS裝置通常沒有卡頓現象，但運作新版作業系統的舊式裝置可能會出現問題。這通常是不可避免的。

source: Input lag
zh_tw: 輸入

source: Project configuration
de: Projektkonfiguration
zh_tw: 組織專案

source: On platforms that support disabling V-Sync, input lag can be made less noticeable by disabling V-Sync in the project settings. This will however cause tearing to appear, especially on monitors with low refresh rates.
de: Auf Plattformen, auf denen die Deaktivierung von V-Sync möglich ist, kann der Input-Lag durch die Deaktivierung von V-Sync in den Projekteinstellungen verringert werden. Dies führt jedoch zu Tearing, insbesondere bei Monitoren mit niedrigen Bildwiederholraten.
zh_tw: 在支援停用垂直同步的平台上，透過在專案設定中停用垂直同步可以使輸入延遲變得不那麼明顯。然而，這會導致出現撕裂現象，尤其是在更新率較低的顯示器上。

source: Increasing the number of physics iterations per second can also reduce physics-induced input latency. This is especially noticeable when using physics interpolation (which improves smoothness but increases latency). To do so, set **Physics > Common > Physics Ticks Per Second** to a value higher than the default ``60``, or set ``Engine.physics_ticks_per_second`` at run-time in a script. Values that are a multiple of the monitor refresh rate (typically ``60``) work best when physics interpolation is disabled, as they will avoid jitter. This means values such as ``120``, ``180`` and ``240`` are good starting points. As a bonus, higher physics FPSes make tunneling and physics unstability issues less likely to occur.
de: Eine Erhöhung der Anzahl der Physik-Iterationen pro Sekunde kann auch die durch die Physik verursachte Eingabe-Latenz verringern. Dies macht sich besonders bei der Verwendung von Physik-Interpolation bemerkbar (die zwar die Glätte verbessert, aber die Latenz erhöht). Um dies zu erreichen, setzen Sie **Physik > Allgemein > Physik-Ticks Pro Sekunde** auf einen höheren Wert als den Defaultwert ``60``, oder setzen Sie ``Engine.physics_ticks_per_second`` zur Laufzeit in einem Skript. Werte, die ein Vielfaches der Bildwiederholrate des Monitors sind (typischerweise ``60``), funktionieren am besten, wenn die Physik-Interpolation deaktiviert ist, da sie Jitter vermeiden. Das bedeutet, dass Werte wie ``120``, ``180`` und ``240`` gute Ausgangspunkte sind. Ein weiterer Vorteil ist, dass höhere FPS das Auftreten von Tunneling und Instabilitätsproblemen der Physik weniger wahrscheinlich machen.
zh_tw: 增加每秒物理迭代的數量也可以減少物理引起的輸入延遲。當使用物理插值（提高平滑度但增加延遲）時，這一點尤其明顯。為此，請將**Physics > Common >Physics Ticks Per Second** 設定為高於預設「60」的值，或在腳本執行時設定「Engine.physical_ticks_per_second」。當停用物理內插時，顯示器更新率的倍數（通常為「60」）的值效果最佳，因為它們可以避免抖動。這意味著「120」、「180」和「240」等值是很好的起點。作為獎勵，更高的物理 FPS 使得隧道效應和物理不穩定問題不太可能發生。

source: The downside of increasing physics FPS is that CPU usage will increase, which can lead to performance bottlenecks in games that have heavy physics simulation code. This can be alleviated by increasing physics FPS only in situations where low latency is critical, or by letting players adjust physics FPS to match their hardware. However, different physics FPS will lead to different outcomes in physics simulation, even when ``delta`` is consistently used in your game logic. This can give certain players an advantage over others. Therefore, allowing the player to change the physics FPS themselves should be avoided for competitive multiplayer games.
de: Der Nachteil einer Erhöhung der Physik-FPS ist, dass die CPU-Auslastung steigt, was in Spielen mit umfangreichem Physiksimulationscode zu Performance-Engpässen führen kann. Dies kann dadurch gemildert werden, dass die Physik-FPS nur in Situationen erhöht wird, in denen eine niedrige Latenzzeit wichtig ist, oder dass die Spieler die Physik-FPS an ihre Hardware anpassen können. Allerdings führen unterschiedliche Physik-FPS zu unterschiedlichen Ergebnissen in der Physiksimulation, selbst wenn ``Delta`` konsequent in der Spiellogik verwendet wird. Dies kann bestimmten Spielern einen Vorteil gegenüber anderen verschaffen. Daher sollte es bei kompetitiven Multiplayer-Spielen vermieden werden, dem Spieler die Möglichkeit zu geben, die Physik-FPS selbst zu ändern.
zh_tw: 提高實體 FPS 的缺點是 CPU 使用率會增加，這可能會導致具有大量實體模擬程式碼的遊戲出現效能瓶頸。僅在低延遲至關重要的情況下增加物理 FPS，或者讓玩家調整物理 FPS 以配對他們的硬件，可以緩解這一問題。然而，不同的物理 FPS 會導致物理模擬中不同的結果，即使在遊戲邏輯中一致使用「delta」時也是如此。這可以讓某些玩家比其他玩家更有優勢。因此，對於競技性多人遊戲，應避免允許玩家自行更改實體 FPS 。

source: Lastly, you can disable input buffering on a per-rendered frame basis by calling ``Input.set_use_accumulated_input(false)`` in a script. This will make it so the ``_input()`` and ``_unhandled_input()`` functions in your scripts are called on every input, rather than accumulating inputs and waiting for a frame to be rendered. Disabling input accumulation will increase CPU usage, so it should be done with caution.
de: Schließlich können Sie die Pufferung von Eingaben für jedes gerenderte Frame deaktivieren, indem Sie ``Input.set_use_accumulated_input(false)`` in einem Skript aufrufen. Dadurch werden die Funktionen ``_input()`` und ``_unhandled_input()`` in Ihren Skripten bei jeder Eingabe aufgerufen, anstatt Eingaben zu akkumulieren und darauf zu warten, daß ein Frame gerendert wird. Die Deaktivierung der Eingabeakkumulation erhöht die CPU-Auslastung, daher sollte sie mit Vorsicht durchgeführt werden.
zh_tw: 最後，您可以透過在腳本中呼叫「Input.set_use_accumulated_input(false)」來在每個算繪影格的基礎上停用輸入緩衝。這將使腳本中的 _input() 和 _unhandled_input() 函式在每個輸入上被呼叫，而不是累積輸入並等待算繪影格。停用輸入累積會增加 CPU 使用率，因此應謹慎操作。

source: Hardware/OS-specific
de: Hardware/OS-spezifisch
zh_tw: 針對硬體/作業系統

source: If your monitor supports it, consider enabling variable refresh rate (G-Sync/FreeSync) while leaving V-Sync enabled, then cap the framerate in the project settings to a slightly lower value than your monitor's maximum refresh rate as per `this page <https://blurbusters.com/howto-low-lag-vsync-on/>`__. For example, on a 144 Hz monitor, you can set the project's framerate cap to ``141``. This may be counterintuitive at first, but capping the FPS below the maximum refresh rate range ensures that the OS never has to wait for vertical blanking to finish. This leads to *similar* input lag as V-Sync disabled with the same framerate cap (usually less than 1 ms greater), but without any tearing.
de: Wenn Ihr Monitor dies unterstützt, sollten Sie die variable Bildwiederholfrequenz (G-Sync/FreeSync) aktivieren, während Sie V-Sync aktiviert lassen, und dann die Bildwiederholfrequenz in den Projekteinstellungen auf einen Wert begrenzen, der etwas unter der maximalen Bildwiederholfrequenz Ihres Monitors liegt (siehe `diese Seite <https://blurbusters.com/howto-low-lag-vsync-on/>`__). Bei einem 144-Hz-Monitor können Sie zum Beispiel die Framerate des Projekts auf ``141`` einstellen. Dies mag auf den ersten Blick kontraintuitiv erscheinen, aber die Begrenzung der FPS unterhalb der maximalen Bildwiederholrate stellt sicher, dass das Betriebssystem nie auf das Ende der vertikalen Austastlücke warten muss. Dies führt zu einem *ähnlichen* Input-Lag wie bei deaktiviertem V-Sync mit der gleichen Frameraten-Begrenzung (normalerweise weniger als 1 ms länger), aber ohne Tearing.
zh_tw: 如果您的顯示器支援，請考慮啟用可變更新率（G-Sync/FreeSync），同時啟用垂直同步，然後將專案設定中的影格速率限制為略低於顯示器最大更新率的值，如下所示： https://blurbusters.com/howto-low-lag-vsync-on/>`__。例如，在 144 Hz 顯示器上，您可以將專案的影格速率上限設定為「141」。起初這可能違反直覺，但將 FPS 限制在最大更新率範圍以下可確保作業系統永遠不必等待垂直消隱完成。這會導致與停用垂直同步相同的影格速率上限（通常大不到 1 毫秒）的「類似」輸入延遲，但不會出現任何撕裂。

source: This can be done by changing the **Application > Run > Max FPS** project setting or assigning ``Engine.max_fps`` at run-time in a script.
de: Dies kann durch Änderung der Projekteinstellung **Anwendung > Ausführen > Max FPS** oder durch Zuweisung von ``Engine.max_fps`` zur Laufzeit in einem Skript geschehen.
zh_tw: 這可以透過變更 **Application > Run > Max FPS** 專案設定或在執行時間在腳本中指派「Engine.max_fps」來完成。

source: On some platforms, you can also opt into a low-latency mode in the graphics driver options (such as the NVIDIA Control Panel on Windows). The **Ultra** setting will give you the lowest possible latency, at the cost of slightly lower average framerates. Forcing the GPU to use the maximum performance profile can also further reduce input lag, at the cost of higher power consumption (and resulting heat/fan noise).
de: Auf einigen Plattformen können Sie in den Optionen des Grafiktreibers (z.B. in der NVIDIA-Systemsteuerung unter Windows) auch einen Modus mit niedriger Latenz wählen. Mit der Einstellung **Ultra** erhalten Sie die geringstmögliche Latenz, allerdings auf Kosten einer etwas niedrigeren durchschnittlichen Framerate. Wenn Sie den Grafikprozessor zwingen, das maximale Performance-Profil zu verwenden, können Sie den Input-Lag noch weiter reduzieren, allerdings zum Preis eines höheren Stromverbrauchs (und der daraus resultierenden Wärme-/Lüftergeräusche).
zh_tw: 在某些平台上，您也可以在圖形驅動程式選項中選擇低延遲模式（例如 Windows 上的 NVIDIA 控制台）。 **Ultra** 設定將為您提供盡可能低的延遲，但代價是平均影格速率略低。強制 GPU 使用最大效能設定檔還可以進一步減少輸入延遲，但代價是更高的功耗（以及由此產生的熱量/風扇噪音）。

source: Finally, make sure your monitor is running at its highest possible refresh rate in the OS' display settings.
de: Vergewissern Sie sich schließlich, dass Ihr Monitor in den Anzeigeeinstellungen des Betriebssystems mit der höchstmöglichen Bildwiederholfrequenz läuft.
zh_tw: 最後，確保您的顯示器在作業系統的顯示設定中以盡可能高的更新率運作。
