Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/jitter_stutter.po
Languages: de, zh_tw

source: Also, ensure that your mouse is configured to use its highest polling rate (typically 1,000 Hz for gaming mice, sometimes more). High USB polling rates can however result in high CPU usage, so 500 Hz may be a safer bet on low-end CPUs. If your mouse offers multiple :abbr:`DPI (Dots Per Inch)` settings, consider also `using the highest possible setting and reducing in-game sensitivity to reduce mouse latency <https://www.youtube.com/watch?v=6AoRfv9W110>`__.
de: Stellen Sie außerdem sicher, dass Ihre Maus so konfiguriert ist, dass sie die höchste Polling-Rate verwendet (in der Regel 1.000 Hz bei Gaming-Mäusen, manchmal auch mehr). Hohe USB-Polling-Raten können jedoch zu einer hohen CPU-Belastung führen, so dass 500 Hz auf Low-End-CPUs eine sichere Wahl sein kann. Wenn Ihre Maus mehrere :abbr:`DPI (Dots Per Inch)`-Einstellungen bietet, sollten Sie auch `die höchstmögliche Einstellung verwenden und die Empfindlichkeit im Spiel verringern, um die Mauslatenz <https://www.youtube.com/watch?v=6AoRfv9W110>`__ zu reduzieren.
zh_tw: 另外，請確保您的滑鼠配置為使用最高輪詢率（遊戲滑鼠通常為 1,000 Hz，有時更高）。然而，高 USB 輪詢率可能會導致 CPU 使用率高，因此對於低階 CPU，500 Hz 可能是更安全的選擇。如果您的滑鼠提供多種 DPI（每英吋點數）設定，也請考慮「使用盡可能高的設定並降低遊戲中的靈敏度以減少滑鼠延遲 <https://www.youtube.com/watch?v = 6AoRfv9W110>`__。

source: On Linux, disabling compositing in window managers that allow it (such as KWin or Xfwm) can reduce input lag significantly.
de: Unter Linux kann die Deaktivierung von Compositing in Fenstermanagern, die dies zulassen (wie KWin oder Xfwm), den Input-Lag erheblich reduzieren.
zh_tw: 在 Linux 上，在允許合成的視窗管理器（例如 KWin 或 Xfwm）中停用合成可以顯著減少輸入延遲。

source: Reporting jitter, stutter or input lag problems
de: Melden von Problemen mit Jitter, Stutter oder Input-Lag
zh_tw: 報告卡頓、抖動或輸入延遲問題

source: If you are reporting a stutter or jitter problem (opening an issue) not caused by any of the above reasons, please specify very clearly all the information possible about device, operating system, driver versions, etc. This may help to better troubleshoot it.
de: Wenn Sie Stuttering oder Jittering melden (eine Issue eröffnen), das nicht aus einem der oben genannten Gründe verursacht wurde, geben Sie bitte alle möglichen Informationen zu Gerät, Betriebssystem, Treiberversionen usw. sehr detailliert an. Dies kann zur besseren Fehlerbehebung beitragen.
zh_tw: 如果您報告的卡頓或抖動問題（提交 Issue）不是由上述原因引起的，請盡可能詳細說明關於您的裝置配置、作業系統、驅動程式版本等資訊。這有助於我們更好地排除故障。

source: If you are reporting input lag problems, please include a capture made with a high speed camera (such as your phone's slow motion video mode). The capture **must** have both the screen and the input device visible so that the number of frames between an input and the on-screen result can be counted. Also, make sure to mention your monitor's refresh rate and your input device's polling rate (especially for mice).
de: Wenn Sie Probleme mit Input-Lag melden, fügen Sie bitte eine Aufnahme bei, die mit einer Hochgeschwindigkeitskamera gemacht wurde (z. B. mit dem Zeitlupenmodus Ihres Telefons). Bei der Aufnahme **müssen** sowohl der Bildschirm als auch das Eingabegerät sichtbar sein, damit die Anzahl der Bilder zwischen einer Eingabe und dem Ergebnis auf dem Bildschirm gezählt werden kann. Vergewissern Sie sich auch, dass Sie die Bildwiederholfrequenz Ihres Bildschirms und die Polling-Rate Ihres Eingabegeräts (insbesondere bei Mäusen) angeben.
zh_tw: 如果您回報輸入延遲問題，請附上使用高速相機（例如手機的慢動作影片模式）拍攝的影像。擷取**必須**使螢幕和輸入裝置都可見，以便可以計算輸入和螢幕結果之間的影格數。另外，請務必提及顯示器的更新率和輸入裝置的輪詢率（尤其是滑鼠）。

source: Also, make sure to use the correct term (jitter, stutter, input lag) based on the exhibited behavior. This will help understand your issue much faster. Provide a project that can be used to reproduce the issue, and if possible, include a screen capture demonstrating the bug.
de: Stellen Sie außerdem sicher, dass Sie den richtigen Begriff (Jitter, Stutter, Input-Lag) für das gezeigte Verhalten verwenden. Das hilft, Ihr Problem schneller zu verstehen. Geben Sie ein Projekt an, mit dem das Problem reproduziert werden kann, und fügen Sie, wenn möglich, eine Bildschirmaufnahme bei, die den Bug demonstriert.
zh_tw: 還要確保根據所展示的行為使用正確的術語（抖動或卡頓）。這有助於更快地理解您的問題。請提供可用來複現問題的專案，如果可能的話，還需要您提供一張螢幕截圖來闡述這個 bug。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: There is no workaround for driver or compositor stuttering, other than reporting it as an issue to the driver or compositor developers. Stutter may be more present when playing in windowed mode as opposed to fullscreen, even with compositing disabled.
de: Es gibt keinen Workaround für Stuttering des Treibers oder des Compositors, es sei denn, Sie melden das Problem an die Entwickler des Treibers oder des Compositors. Das Stuttering kann bei der Wiedergabe im Fenstermodus stärker ausgeprägt sein als im Vollbildmodus, auch wenn das Compositing deaktiviert ist.
