Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: de, zh_tw

source: **Stretch Aspect = Expand**: Keep aspect ratio when stretching the screen, but keep neither the base width nor height. Depending on the screen aspect ratio, the viewport will either be larger in the horizontal direction (if the screen is wider than the base size) or in the vertical direction (if the screen is taller than the original size).
de: **Streckverhältnis = Erweitern**: Beim Strecken des Bildschirms das Seitenverhältnis beibehalten, aber weder die Basisbreite noch die Basishöhe beibehalten. Je nach Seitenverhältnis des Bildschirms wird der Viewport entweder in horizontaler Richtung (wenn der Bildschirm breiter ist als die Basisgröße) oder in vertikaler Richtung (wenn der Bildschirm höher ist als die Originalgröße) vergrößert.
zh_tw: **Stretch Aspect = Expand** : 在拉伸螢幕時保持長寬比, 但既不保持基本寬度也不保持高度. 根據螢幕的長寬比, 視口將在水平方向(如果螢幕比基本尺寸寬)或垂直方向上變大(如果螢幕比原始尺寸高).

source: To support both portrait and landscape mode with a similar automatically determined scale factor, set your project's base resolution to be a *square* (1:1 aspect ratio) instead of a rectangle. For instance, if you wish to design for 1280×720 as the base resolution but wish to support both portrait and landscape mode, use 720×720 as the project's base window size in the Project Settings.
de: Um sowohl den Hoch- als auch den Querformatmodus mit einem ähnlichen automatisch ermittelten Skalierungsfaktor zu unterstützen, stellen Sie die Basisauflösung Ihres Projekts auf ein *Quadrat* (Seitenverhältnis 1:1) statt auf ein Rechteck ein. Wenn Sie beispielsweise eine Basisauflösung von 1280×720 wählen, aber sowohl den Hoch- als auch den Querformatmodus unterstützen möchten, verwenden Sie in den Projekteinstellungen 720×720 als Basisfenstergröße des Projekts.
zh_tw: 為了以類似的自動確定的比例係數支援縱向和橫向模式，請將您的專案的基本解析度設定為 *方形* （1:1長寬比）而不是矩形。例如，如果你希望以1280×720為基本解析度進行設計，但又希望同時支援縱向和橫向模式，那麼在專案設定中使用720×720作為專案的基本視窗尺寸。

source: To allow the user to choose their preferred screen orientation at run-time, remember to set **Display > Window > Handheld > Orientation** to ``sensor``.
de: Um dem Benutzer die Möglichkeit zu geben, seine bevorzugte Bildschirmausrichtung zur Laufzeit zu wählen, müssen Sie **Anzeige > Fenster > Handheld > Ausrichtung** auf ``Sensor`` setzen.
zh_tw: 為了讓使用者在運作時選擇自己喜歡的螢幕方向，記得將**Display > Window > Handheld > Orientation** 設定為 ``sensor`` (感測器).

source: To configure the stretch aspect at runtime from a script, use the ``get_tree().root.content_scale_aspect`` property (see :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` and the :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>` enum).
de: Um das Streckungsverhältnis zur Laufzeit aus einem Skript heraus zu konfigurieren, verwenden Sie die Property ``get_tree().root.content_scale_aspect`` (siehe :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` und das :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>`-Enum).
zh_tw: 要在運作時從腳本中配置拉伸, 請使用 ``get_tree().set_screen_stretch()`` 方法(見 :ref:`SceneTree.set_screen_stretch() <class_SceneTree_method_set_screen_stretch>` ).

source: Stretch Scale
de: Streckungs-Skalierung
zh_tw: 根縮放

source: The **Scale** setting allows you to add an extra scaling factor on top of what the **Stretch** options above already provide. The default value of ``1.0`` means that no additional scaling occurs.
de: Mit der Einstellung **Skalierung** können Sie einen zusätzlichen Skalierungsfaktor zu den bereits vorhandenen **Streckungs**-Optionen hinzufügen. Der Defaultwert ``1,0`` bedeutet, dass keine zusätzliche Skalierung erfolgt.
zh_tw: **Shrink** 設定允許你在上面的 **Stretch** 選項已經提供的基礎上增加一個額外的縮放係數. 預設值為1意味著不發生縮放.

source: For example, if you set **Scale** to ``2.0`` and leave **Stretch Mode** on **Disabled**, each unit in your scene will correspond to 2×2 pixels on the screen. This is a good way to provide scaling options for non-game applications.
de: Wenn Sie zum Beispiel **Skalierung** auf ``2.0`` setzen und **Streckungsmodus** auf **Deaktiviert** lassen, wird jede Einheit in Ihrer Szene 2×2 Pixeln auf dem Bildschirm entsprechen. Dies ist ein guter Weg, um Skalierungsoptionen für Nicht-Spiel-Anwendungen bereitzustellen.
zh_tw: 例如, 如果你將 **Shrink** 設定為4, 並將 **Stretch Mode** 置於 **Disabled** 狀態, 那麼你的場景中的每個單元將對應於螢幕上的4×4像素.

source: If **Stretch Mode** is set to **canvas_items**, 2D elements will be scaled relative to the base window size, then multiplied by the **Scale** setting. This can be exposed to players to allow them to adjust the automatically determined scale to their liking, for better accessibility.
de: Wenn **Streckungsmodus** auf **canvas_items** eingestellt ist, werden 2D-Elemente relativ zur Basisfenstergröße skaliert und dann mit der Einstellung **Skalierung** multipliziert. Dies kann den Spielern mitgeteilt werden, um ihnen die Möglichkeit zu geben, die automatisch ermittelte Skalierung an ihre Wünsche anzupassen, um die Barrierefreiheit zu verbessern.
zh_tw: 如果 **拉伸模式** 設定為 **canvas_items**，2D 元素將相對於基本視窗大小進行縮放，然後乘以 **縮放** 設定。這可以公開給玩家，讓他們根據自己的喜好調整自動確定的比例，以獲得更好的可存取性。

source: If **Stretch Mode** is set to **viewport**, the viewport's resolution is divided by **Scale**. This makes pixels look larger and reduces rendering resolution (with a given window size), which can improve performance.
de: Wenn **Streckungsmodus** auf **Viewport** eingestellt ist, wird die Auflösung des Viewports durch **Skalierung** geteilt. Dies lässt die Pixel größer aussehen und reduziert die Rendering-Auflösung (bei einer bestimmten Fenstergröße), was die Performance verbessern kann.
zh_tw: 如果**拉伸模式**設定為**視口**，則視口的解析度除以**比例**。這使得像素看起來更大並降低算繪解析度（在給定視窗大小的情況下），從而可以提高效能。

source: To configure the stretch scale at runtime from a script, use the ``get_tree().root.content_scale_factor`` property (see :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
de: Um die Skalierung zur Laufzeit von einem Skript aus zu konfigurieren, verwenden Sie die Property ``get_tree().root.content_scale_factor`` (siehe :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
zh_tw: 要在運作時從腳本中配置拉伸, 請使用 ``get_tree().set_screen_stretch()`` 方法(見 :ref:`SceneTree.set_screen_stretch() <class_SceneTree_method_set_screen_stretch>` ).

source: Stretch Scale Mode
de: Streckungs-Skalierungsmodus

source: Since Godot 4.2, the **Stretch Scale Mode** setting allows you to constrain the automatically determined scale factor (as well as the manually specified **Stretch Scale** setting) to integer values. By default, this setting is set to ``fractional``, which allows any scale factor to be applied (including fractional values such as ``2.5``). When set to ``integer``, the value is rounded down to the nearest integer. For example, instead of using a scale factor of ``2.5``, it would be rounded down to ``2.0``. This is useful to prevent distortion when displaying pixel art.
de: Seit Godot 4.2 können Sie mit der Einstellung **Streckungs-Skalierungsmodus** den automatisch ermittelten Skalierungsfaktor (wie auch die manuell festgelegte **Streckungs-Skalierung**-Einstellung) auf ganzzahlige Werte beschränken. Standardmäßig ist diese Einstellung auf ``Kommazahl`` gesetzt, was die Anwendung eines beliebigen Skalierungsfaktors erlaubt (einschließlich Kommazahlen wie ``2,5``). Wenn die Einstellung auf ``Ganzzahl`` gesetzt ist, wird der Wert auf die nächste Ganzzahl abgerundet. Anstelle eines Skalierungsfaktors von ``2.5`` würde er z.B. auf ``2.0`` abgerundet. Dies ist nützlich, um Verzerrungen bei der Darstellung von Pixelgrafiken zu vermeiden.

source: Compare this pixel art which is displayed with the ``viewport`` stretch mode, with the stretch scale mode set to ``fractional``:
de: Vergleichen Sie diese Pixelgrafik, die mit dem ``Viewport``-Streckungs-Modus angezeigt wird, wobei der Streckungs-Skalierungsmodus auf ``Kommazahl`` eingestellt ist:

source: Fractional scaling example (incorrect pixel art appearance)
de: Beispiel für Kommazahl-Skalierung (Pixel-Art sieht falsch aus)

source: Checkerboard doesn't look "even". Line widths in the logo and text varies wildly.
de: Das Schachbrett sieht nicht "gleichmäßig" aus. Die Linienbreiten im Logo und im Text sind sehr unterschiedlich.

source: This pixel art is also displayed with the ``viewport`` stretch mode, but the stretch scale mode is set to ``integer`` this time:
de: Diese Pixelgrafik wird auch mit dem ``Viewport``-Streckungsmodus dargestellt, aber der Streckungs-Skalierungsmodus ist diesmal auf ``Ganzzahl`` eingestellt:

source: Integer scaling example (correct pixel art appearance)
de: Beispiel für Ganzzahl-Skalierung (Pixel-Art wird korrekt dargestellt)

source: Checkerboard looks perfectly even. Line widths are consistent.
de: Das Schachbrett sieht vollkommen gleichmäßig aus. Die Linienbreiten sind gleichmäßig.

source: For example, if your viewport base size is 640×360 and the window size is 1366×768:
de: Wenn die Basisgröße des Viewports zum Beispiel 640×360 und die Fenstergröße 1366×768 beträgt:

source: When using ``fractional``, the viewport is displayed at a resolution of 1366×768 (scale factor is roughly 2.133×). The entire window space is used. Each pixel in the viewport corresponds to 2.133×2.133 pixels in the displayed area. However, since displays can only display "whole" pixels, this will lead to uneven pixel scaling which results in incorrect appearance of pixel art.
de: Bei der Verwendung von ``fractional`` wird der Viewport mit einer Auflösung von 1366×768 angezeigt (Skalierungsfaktor ist ungefähr 2.133×). Der gesamte Fensterbereich wird genutzt. Jedes Pixel im Ansichtsfenster entspricht 2,133×2,133 Pixeln im angezeigten Bereich. Da Bildschirme jedoch nur "ganze" Pixel anzeigen können, führt dies zu einer ungleichmäßigen Pixel-Skalierung, die ein falsches Erscheinungsbild der Pixel-Art zur Folge hat.

source: When using ``integer``, the viewport is displayed at a resolution of 1280×720 (scale factor is 2×). The remaining space is filled with black bars on all four sides, so that each pixel in the viewport corresponds to 2×2 pixels in the displayed area.
de: Bei der Verwendung von ``Ganzzahl`` wird der Viewport mit einer Auflösung von 1280×720 angezeigt (Skalierungsfaktor ist 2×). Der verbleibende Platz wird mit schwarzen Balken an allen vier Seiten gefüllt, so dass jedes Pixel im Ansichtsfenster 2×2 Pixeln im angezeigten Bereich entspricht.

source: This setting is effective with any stretch mode. However, when using the ``disabled`` stretch mode, it will only affect the **Stretch Scale** setting by rounding it *down* to the nearest integer value. This can be used for 3D games that have a pixel art UI, so that the visible area in the 3D viewport doesn't reduce in size (which occurs when using ``canvas_items`` or ``viewport`` stretch mode with the ``integer`` scale mode).
de: Diese Einstellung ist in jedem Streckungsmodus wirksam. Wenn man jedoch den ``deaktiviert``-Streckungsmodus benutzt, wird nur die **Streckungs-Skalierung**-Einstellung beeinflusst, indem sie auf den nächsten ganzzahligen Wert *abgerundet* wird. Dies kann für 3D Spiele mit einer Pixel Art-UI verwendet werden, so dass der sichtbare Bereich im 3D-Viewport nicht verkleinert wird (was passiert, wenn man den ``canvas_items`` oder den ``Viewport``-Streckungsmodus mit dem ``Ganzzahl``-Skalierungsmodus verwendet).

source: Common use case scenarios
de: Häufige Anwendungsszenarien
zh_tw: 常見使用場景

source: The following settings are recommended to support multiple resolutions and aspect ratios well.
de: Die folgenden Einstellungen werden empfohlen für eine optimale Unterstützung unterschiedlicher Bildschirmauflösungen und Seitenverhältnissen.
zh_tw: 建議使用以下設定以更好地支援多種分辨率和縱橫比。

source: Desktop game
de: Desktop-Spiel
zh_tw: 桌面遊戲

source: **Non-pixel art:**
de: **Nicht-Pixel Art:**
zh_tw: **非像素風：**

source: Set the base window width to ``1920`` and window height to ``1080``. If you have a display smaller than 1920×1080, set **Window Width Override** and **Window Height Override** to lower values to make the window smaller when the project starts.
de: Setzen Sie die Basisfensterbreite auf ``1920`` und die Fensterhöhe auf ``1080``. Wenn Sie einen Bildschirm haben, der kleiner als 1920×1080 ist, setzen Sie **Fensterbreite Überschreiben** und **Fensterhöhe Überschreiben** auf niedrigere Werte, damit das Fenster beim Start des Projekts kleiner ist.
zh_tw: 將基礎視窗寬度設定為 ``1920``、視窗高度設定為 ``1080``。如果你的顯示器小於 1920×1080，就將 **Test Width** 和 **Test Height**（測試寬度和測試高度）設定為較小的值，專案啟動時就會將視窗調小。

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``3840`` and window height to ``2160``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
de: Alternativ können Sie, wenn Sie hauptsächlich High-End-Geräte ansprechen, die Basisfensterbreite auf ``3840`` und die Fensterhöhe auf ``2160`` einstellen. Dadurch können Sie 2D-Assets mit höherer Auflösung bereitstellen, was zu einer schärferen Darstellung führt, allerdings zum Preis einer höheren Speichernutzung und Dateigröße. Beachten Sie, dass dies dazu führt, dass nicht-Mipmapping-Texturen auf Geräten mit niedriger Auflösung körnig werden, also stellen Sie sicher, dass Sie die Anweisungen befolgen, die in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` beschrieben sind.
zh_tw: 或者如果你主要針對的是高端裝置，那麼就把基礎視窗寬度設定為 ``3840``、視窗高度設定為 ``2160`` 。這樣你就可以提供更高解析度的 2D 素材，用更高的記憶體佔用和檔大小換取更清晰的畫面。注意，這樣做會讓未做 mipmap 的紋理在低解析度裝置上具有顆粒感，請參考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 進行操作。

source: Set the stretch mode to ``canvas_items``.
de: Setzen Sie den Streckungsmodus auf ``canvas_items``.
zh_tw: 將拉伸模式（Stretch Mode）設定為 ``viewport`` （視圖）。

source: Set the stretch aspect to ``expand``. This allows for supporting multiple aspect ratios and makes better use of tall smartphone displays (such as 18:9 or 19:9 aspect ratios).
de: Setzen Sie das Streckungsverhältnis auf ``expandieren``. Dadurch werden mehrere Seitenverhältnisse unterstützt und hohe Smartphone-Displays (wie 18:9 oder 19:9) besser genutzt.
zh_tw: 將拉伸比例（Stretch Aspect）設定為 ``expand`` （擴充）。這樣可以支援多種解析度，並且能夠更好地利用較長的智慧手機螢幕（例如 18:9 和 19:9 的長寬比）。

source: Configure Control nodes' anchors to snap to the correct corners using the **Layout** menu.
de: Konfigurieren Sie die Anker der Control-Nodes so, dass sie an den richtigen Ecken einrasten, indem Sie das Menü **Layout** verwenden.
zh_tw: 使用 **佈局** 功能表將 Control 節點的錨點吸附到正確的角落。

source: Set the base window size to the viewport size you intend to use. Most pixel art games use viewport sizes between 256×224 and 640×480. 640×360 is a good baseline, as it scales to 1280×720, 1920×1080, 2560×1440, and 3840×2160 without any black bars when using integer scaling. Higher viewport sizes will require using higher resolution artwork, unless you intend to show more of the game world at a given time.
de: Setzen Sie die Basisfenstergröße auf die Größe des Ansichtsfensters, das Sie verwenden möchten. Die meisten Pixel-Art-Spiele verwenden Fenstergrößen zwischen 256×224 und 640×480. 640×360 ist eine gute Basisgröße, da sie sich bei ganzzahliger Skalierung ohne schwarze Balken auf 1280×720, 1920×1080, 2560×1440 und 3840×2160 skalieren lässt. Höhere Viewport-Größen erfordern eine höhere Auflösung des Bildmaterials, es sei denn, Sie wollen mehr von der Spielwelt zu einem bestimmten Zeitpunkt zeigen.

source: Set the stretch mode to ``viewport``.
de: Setzen Sie den Streckungsmodus auf ``Viewport``.
zh_tw: 將拉伸模式（Stretch Mode）設定為 ``viewport`` （視圖）。

source: Set the stretch aspect to ``keep`` to enforce a single aspect ratio (with black bars). As an alternative, you can set the stretch aspect to ``expand`` to support multiple aspect ratios.
de: Setzen Sie das Streckungsverhältnis auf ``beibehalten``, um ein einziges Seitenverhältnis (mit schwarzen Balken) zu erzwingen. Alternativ können Sie das Streckungsverhältnis auf ``expandieren`` setzen, um mehrere Seitenverhältnisse zu unterstützen.
zh_tw: 將拉伸比例（Stretch Aspect）設定為 ``keep`` （保持）可以（通過新增黑條的方式）強制使用固定的長寬比。如果你想支援不同長寬比的話，也可以把拉伸模式設定為 ``expand`` （擴充）。

source: If using the ``expand`` stretch aspect, Configure Control nodes' anchors to snap to the correct corners using the **Layout** menu.
de: Wenn Sie das Streckungsverhältnis ``expandieren`` verwenden, konfigurieren Sie die Anker der Control-Nodes so, dass sie an den richtigen Ecken einrasten, indem Sie das Menü **Layout** verwenden.
zh_tw: 如果選用 ``expand`` 拉伸比例，使用 **佈局** 功能表將 Control 節點的錨點吸附到正確的角落。

source: Set the stretch scale mode to ``integer``. This prevents uneven pixel scaling from occurring, which makes pixel art not display as intended.
de: Setzen Sie den Streckungs-Skalierungsmodus auf ``Ganzzahl``. Dies verhindert eine ungleichmäßige Pixelskalierung, die dazu führt, dass Pixel-Art nicht wie beabsichtigt angezeigt wird.

source: The ``viewport`` stretch mode provides low-resolution rendering that is then stretched to the final window size. If you are OK with sprites being able to move or rotate in "sub-pixel" positions or wish to have a high resolution 3D viewport, you should use the ``canvas_items`` stretch mode instead of the ``viewport`` stretch mode.
de: Der ``Viewport``-Streckungsmodus bietet ein Rendering mit niedriger Auflösung, das dann auf die endgültige Fenstergröße gestreckt wird. Wenn Sie kein Problem damit haben, daß sich Sprites in "Sub-Pixel"-Positionen bewegen oder rotieren können, oder wenn Sie ein hochauflösendes 3D-Viewport haben wollen, sollten Sie den ``canvas_items``-Streckungsmodus anstelle des ``Viewport``-Streckungsmodus verwenden.
zh_tw: ``viewport`` 拉伸模式會先以較低解析度算繪，然後拉伸到最終視窗的大小。如果你能夠接受精靈可以移動或者旋轉到“次像素”位置，或者希望有高解析度的 3D 視圖，可以把 ``viewport`` 拉伸模式換成 ``2d`` 模式。

source: Mobile game in landscape mode
de: Mobiles Spiel im Querformat
zh_tw: 橫屏的手機遊戲

source: Godot is configured to use landscape mode by default. This means you don't need to change the display orientation project setting.
de: Godot ist standardmäßig für die Verwendung des Querformatmodus konfiguriert. Das bedeutet, dass Sie die Projekteinstellung für die Anzeigeausrichtung nicht ändern müssen.
zh_tw: Godot 預設使用橫屏模式，所以你無需在專案設定中調整顯示方向。

source: Set the base window width to ``1280`` and window height to ``720``.
de: Setzen Sie die Basisfensterbreite auf ``1280`` und die Fensterhöhe auf ``720``.
zh_tw: 將基礎視窗寬度設定為 ``1280``，視窗高度設定為 ``720``。

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``1920`` and window height to ``1080``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Many devices have even higher resolution displays (1440p), but the difference with 1080p is barely visible given the small size of smartphone displays. Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
de: Alternativ können Sie, wenn Sie hauptsächlich High-End-Geräte ansprechen, die Basisfensterbreite auf ``1920`` und die Fensterhöhe auf ``1080`` einstellen. Dadurch können Sie 2D-Assets mit höherer Auflösung bereitstellen, was zu einer schärferen Darstellung führt, allerdings auf Kosten einer höheren Speichernutzung und Dateigröße. Viele Geräte haben Displays mit noch höherer Auflösung (1440p), aber der Unterschied zu 1080p ist angesichts der geringen Größe von Smartphone-Displays kaum sichtbar. Beachten Sie, dass dies dazu führt, dass nicht-Mipmapping-Texturen auf Geräten mit niedriger Auflösung körnig werden. Beachten Sie daher die Anweisungen in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
zh_tw: 或者如果你主要針對的是高端裝置，那麼就把基礎視窗寬度設定為 ``1920``、視窗高度設定為 ``1080``。這樣你就可以提供更高解析度的 2D 素材，用更高的記憶體佔用和檔大小換取更清晰的畫面。很多裝置擁有更高解析度的顯示幕（1440p），但因為智慧手機的螢幕比較小，所以很難看出和 1080p 的區別。注意，這樣做會讓未做 mipmap 的紋理在低解析度裝置上具有顆粒感，請參考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 進行操作。

source: To better support tablets and foldable phones (which frequently feature displays with aspect ratios close to 4:3), consider using a base resolution that has a 4:3 aspect ratio while following the rest of the instructions here. For instance, you can set the base window width to ``1280`` and the base window height to ``960``.
de: Um Tablets und faltbare Smartphones (die häufig Bildschirme mit einem Seitenverhältnis von fast 4:3 haben) besser zu unterstützen, sollten Sie eine Basisauflösung mit einem Seitenverhältnis von 4:3 verwenden, während Sie den Rest der Anweisungen hier befolgen. Sie können zum Beispiel die Basisfensterbreite auf ``1280`` und die Basisfensterhöhe auf ``960`` einstellen.
zh_tw: 為了更好地支援平板電腦和可折疊手機（其顯示器的寬高比通常接近 4:3），請考慮使用寬高比為 4:3 的基本分辨率，同時遵循此處的其餘說明。例如，您可以將基本視窗寬度設為“1280”，將基本視窗高度設定為“960”。

source: Mobile game in portrait mode
de: Mobiles Spiel im Hochformat
zh_tw: 豎屏的手機遊戲

source: Set the base window width to ``720`` and window height to ``1280``.
de: Setzen Sie die Basisfensterbreite auf ``720`` und die Fensterhöhe auf ``1280``.
zh_tw: 將基礎視窗寬度設定為 ``720``，視窗高度設定為 ``1080``。

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``1080`` and window height to ``1920``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Many devices have even higher resolution displays (1440p), but the difference with 1080p is barely visible given the small size of smartphone displays. Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
de: Alternativ können Sie die Basisfensterbreite auf ``1080`` und die Fensterhöhe auf ``1920`` setzen, wenn Sie hauptsächlich auf High-End-Geräte abzielen. Dadurch können Sie 2D-Assets mit höherer Auflösung bereitstellen, was zu einer schärferen Darstellung führt, allerdings auf Kosten einer höheren Speichernutzung und Dateigröße. Viele Geräte haben Displays mit noch höherer Auflösung (1440p), aber der Unterschied zu 1080p ist angesichts der geringen Größe von Smartphone-Displays kaum sichtbar. Beachten Sie, dass dies dazu führt, dass nicht-Mipmapping-Texturen auf Geräten mit niedriger Auflösung körnig werden. Beachten Sie daher die Anweisungen in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
zh_tw: 或者如果你主要針對的是高端裝置，那麼就把基礎視窗寬度設定為 ``1080``、視窗高度設定為 ``1920``。這樣你就可以提供更高解析度的 2D 素材，用更高的記憶體佔用和檔大小換取更清晰的畫面。很多裝置擁有更高解析度的顯示幕（1440p），但因為智慧手機的螢幕比較小，所以很難看出和 1080p 的區別。注意，這樣做會讓未做 mipmap 的紋理在低解析度裝置上具有顆粒感，請參考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 進行操作。

source: Set **Display > Window > Handheld > Orientation** to ``portrait``.
de: Stellen Sie **Anzeige > Fenster > Handheld > Ausrichtung** auf ``Hochformat``.
zh_tw: 將 **Display > Window > Handheld > Orientation** 設定為 ``portrait`` （豎屏）。
