Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: de, zh_tw

source: Multiple resolutions
de: Mehrere Auflösungen
zh_tw: 多解析度

source: The problem of multiple resolutions
de: Das Problem mit mehreren Auflösungen
zh_tw: 多解析度問題

source: Developers often have trouble understanding how to best support multiple resolutions in their games. For desktop and console games, this is more or less straightforward, as most screen aspect ratios are 16:9 and resolutions are standard (720p, 1080p, 1440p, 4K, …).
de: Entwickler haben oft Probleme zu verstehen, wie sie mehrere Auflösungen in ihren Spielen am besten unterstützen können. Bei Desktop- und Konsolenspielen ist dies mehr oder weniger einfach, da die meisten Seitenverhältnisse auf dem Bildschirm 16: 9 betragen und die Auflösungen Standard sind (720p, 1080p, 1440p, 4K,…).
zh_tw: 開發人員經常會遇到麻煩, 不知道如何在他們的遊戲中最好地支援多種解析度. 對於桌面和控制台遊戲, 這或多或少是簡單的, 因為大多數螢幕長寬比是16:9, 解析度是標準的720p, 1080p, 1440p, 4K,.......

source: For mobile games, at first, it was easy. For many years, the iPhone and iPad used the same resolution. When *Retina* was implemented, they just doubled the pixel density; most developers had to supply assets in default and double resolutions.
de: Für mobile Spiele war es zunächst einfach. Das iPhone und das iPad verwendeten viele Jahre lang dieselbe Auflösung. Bei der Implementierung von *Retina* wurde die Pixeldichte nur verdoppelt. Die meisten Entwickler mussten nun Inhalte in Standard- und doppelter Auflösung bereitstellen.
zh_tw: 對於手機遊戲來說，起初，這很容易。許多年來，iPhone 和 iPad 使用相同的解析度。當實行 *Retina* 後，他們只是將像素密度提高了一倍；大多數開發商不得不以預設和雙倍的解析度提供素材。

source: Nowadays, this is no longer the case, as there are plenty of different screen sizes, densities, and aspect ratios. Non-conventional sizes are also becoming increasingly popular, such as ultrawide displays.
de: Heutzutage ist dies nicht mehr der Fall, da es viele verschiedene Bildschirmgrößen, Dichten und Seitenverhältnisse gibt. Auch unkonventionelle Größen wie Ultrawide-Displays werden immer beliebter.
zh_tw: 如今, 情況已不再如此, 因為有很多不同的螢幕尺寸, 密度和長寬比. 非傳統的尺寸也越來越受歡迎, 如超寬顯示幕.

source: For 3D games, there is not much of a need to support multiple resolutions (from the aesthetic point of view). The 3D geometry will just fill the screen based on the field of view, disregarding the aspect ratio. The main reason one may want to support this, in this case, is for *performance* reasons (running in lower resolution to increase frames per second).
de: Bei 3D-Spielen besteht keine große Notwendigkeit, mehrere Auflösungen zu unterstützen (aus ästhetischer Sicht). Die 3D-Geometrie füllt den Bildschirm nur basierend auf dem Sichtfeld aus, ohne das Seitenverhältnis zu berücksichtigen. Der Hauptgrund, warum man dies unterstützen würde, ist in diesem Fall die *Performance* (niedrigere Auflösung, um die Bilder pro Sekunde zu erhöhen).
zh_tw: 對於3D遊戲來說, 沒有太大的必要支援多種解析度(從審美角度來看).3D幾何圖形將根據視場填充螢幕, 而不考慮長寬比. 在這種情況下, 人們可能想要支援的主要原因是為了 *性能* 的原因(以較低的解析度運作以增加每秒的影格數).

source: For 2D and game UIs, this is a different matter, as art needs to be created using specific pixel sizes in software such as Photoshop, GIMP or Krita.
de: Für 2D und Spiele-Benutzeroberflächen ist das eine andere Sache, da Grafik mit bestimmten Pixelgrößen in Software wie Photoshop, GIMP oder Krita erstellt werden muss.
zh_tw: 對於2D和遊戲UI, 這是一個不同的問題, 因為設計需要在Photoshop, GIMP或Krita等軟體中使用特定的像素尺寸來建立.

source: Since layouts, aspect ratios, resolutions, and pixel densities can change so much, it is no longer possible to design UIs for every specific screen. Another method must be used.
de: Da sich Layouts, Seitenverhältnisse, Auflösungen und Pixeldichten so stark ändern können, ist es nicht mehr möglich, Benutzeroberflächen für jeden bestimmten Bildschirm zu entwerfen. Eine andere Methode muss verwendet werden.
zh_tw: 由於佈局, 長寬比, 解析度和像素密度會有很大的變化, 因此不再可能為每個特定的螢幕設計UI. 必須使用另一種方法.

source: One size fits all
de: Eine Größe für alle
zh_tw: 萬全之策

source: The most common approach is to use a single *base* resolution and then fit it to everything else. This resolution is how most players are expected to play the game (given their hardware). For mobile, Google has useful `stats <https://developer.android.com/about/dashboards>`_ online, and for desktop, Steam `also does <https://store.steampowered.com/hwsurvey/>`_.
de: Der gebräuchlichste Ansatz besteht darin, eine einzelne *Basis* -Auflösung zu verwenden und diese dann an alles andere anzupassen. Bei dieser Auflösung wird erwartet, dass die meisten Spieler das Spiel spielen können (sofern sie über die entsprechende Hardware verfügen). Für Handys hat Google nützliche `Statistiken <https://developer.android.com/about/dashboards>`_ online, genauso bietet Steam dies `auch für Desktops <https://store.steampowered.com/hwsurvey/>`_.
zh_tw: 最常見的方法是使用一個單一的 *基礎* 解析度, 然後將其適用於其他所有情況. 這個解析度是大多數玩家預期的玩遊戲的方式, 鑒於他們的硬體. 對於移動裝置, 穀歌在網上有有用的 `統計資料 <https://developer.android.com/about/dashboards>`__ , 對於桌面裝置,Steam `也有 <https://store.steampowered.com/hwsurvey/>`__ .

source: As an example, Steam shows that the most common *primary display resolution* is 1920×1080, so a sensible approach is to develop a game for this resolution, then handle scaling for different sizes and aspect ratios.
de: Steam zeigt beispielsweise, dass die häufigste *primäre Anzeigeauflösung* 1920 × 1080 ist. Daher ist es sinnvoll, ein Spiel für diese Auflösung zu entwickeln und dann die Skalierung für verschiedene Größen und Seitenverhältnisse durchzuführen.
zh_tw: 舉個例子,Steam顯示最常見的 *主要顯示解析度是* 1920×1080, 所以明智的做法是為這個解析度開發一個遊戲, 然後期處理不同尺寸和長寬比的縮放.

source: Godot provides several useful tools to do this easily.
de: Godot bietet verschiedene nützliche Werkzeuge, um dies einfach zu erledigen.
zh_tw: Godot 還提供了一系列通用的容器.

source: You can see how Godot's support for multiple resolutions works in action using the `Multiple Resolutions and Aspect Ratios demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__.
de: Sie können sehen, wie Godots Unterstützung für mehrere Auflösungen in Aktion funktioniert, indem Sie das `Multiple Resolutions and Aspect Ratios Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__ ausprobieren.
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Base size
de: Basisgröße
zh_tw: 基本大小

source: A base size for the window can be specified in the Project Settings under **Display → Window**.
de: Eine Basisgröße für das Fenster kann in den Projekteinstellungen unter **Anzeige → Fenster** angegeben werden.
zh_tw: 視窗的基本尺寸可以在專案設定中的 **Display → Window** 下指定.

source: However, what it does is not completely obvious; the engine will *not* attempt to switch the monitor to this resolution. Rather, think of this setting as the "design size", i.e. the size of the area that you work with in the editor. This setting corresponds directly to the size of the blue rectangle in the 2D editor.
de: Was es tut, ist jedoch nicht ganz offensichtlich; Die Engine wird *nicht* versuchen, den Monitor auf diese Auflösung umzuschalten. Stellen Sie sich diese Einstellung vielmehr als "Entwurfsgröße" vor, d.h. als Größe des Bereichs, mit dem Sie im Editor arbeiten. Diese Einstellung entspricht direkt der Größe des blauen Rechtecks im 2D-Editor.
zh_tw: 然而, 它的作用並不完全明顯; 引擎將 *不* 嘗試將顯示器切換到此解析度. 相反, 將此設定視為 "設計大小", 即您在編輯器中使用的區域的大小. 此設定直接對應於2D編輯器中藍色矩形的大小.

source: There is often a need to support devices with screen and window sizes that are different from this base size. Godot offers many ways to control how the viewport will be resized and stretched to different screen sizes.
de: Es besteht häufig die Notwendigkeit, Geräte mit Bildschirm- und Fenstergrößen zu unterstützen, die sich von dieser Basisgröße unterscheiden. Godot bietet viele Möglichkeiten wie die Größe des Ansichtsfensters geändert und auf verschiedene Bildschirmgrößen gestreckt werden kann.
zh_tw: 通常需要支援具有與該基本大小不同的螢幕和視窗大小的裝置. Godot提供了許多方法來控制視口的大小調整和拉伸到不同的螢幕大小.

source: To configure the stretch base size at runtime from a script, use the ``get_tree().root.content_scale_size`` property (see :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Changing this value can indirectly change the size of 2D elements. However, to provide an user-accessible scaling option, using :ref:`doc_multiple_resolutions_stretch_scale` is recommended as it's easier to adjust.
de: Um die Basisgröße der Streckung zur Laufzeit von einem Skript aus zu konfigurieren, verwenden Sie die Property ``get_tree().root.content_scale_size`` (siehe :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Das Ändern dieses Wertes kann indirekt die Größe von 2D-Elementen verändern. Um jedoch eine für den Benutzer zugängliche Skalierungsoption bereitzustellen, wird die Verwendung von :ref:`doc_multiple_resolutions_stretch_scale` empfohlen, da sie einfacher anzupassen ist.
zh_tw: 若要在執行時間從腳本配置伸展基本尺寸，請使用「get_tree().root.content_scale_size」屬性（請參閱 :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`）。更改此值可以間接更改 2D 元素的大小。但是，為了提供使用者可存取的縮放選項，建議使用 doc_multiple_resolutions_stretch_scale`，因為它更容易調整。

source: Godot follows a modern approach to multiple resolutions. The engine will never change the monitor's resolution on its own. While changing the monitor's resolution is the most efficient approach, it's also the least reliable approach as it can leave the monitor stuck on a low resolution if the game crashes. This is especially common on macOS or Linux which don't handle resolution changes as well as Windows.
de: Godot verfolgt einen modernen Ansatz für mehrere Auflösungen. Die Engine wird die Auflösung des Monitors niemals von sich aus ändern. Das Ändern der Monitorauflösung ist zwar der effizienteste Ansatz, aber auch der unzuverlässigste, da der Monitor auf einer niedrigen Auflösung hängen bleiben kann, wenn das Spiel abstürzt. Dies ist besonders häufig unter macOS oder Linux der Fall, da diese Betriebssysteme mit Auflösungsänderungen nicht so gut umgehen können wie Windows.
zh_tw: Godot遵循了現代多種解析度的方法. 引擎永遠不會自行改變顯示器的解析度. 雖然改變顯示器的解析度是最有效的方法, 但這也是最不可靠的方法, 因為如果遊戲當機, 它可能會讓顯示器卡在一個低解析度上. 這在macOS或Linux上很常見, 因為它們對解析度變化的處理不如Windows.

source: Changing the monitor's resolution also removes any control from the game developer over filtering and aspect ratio stretching, which can be important to ensure correct display for pixel art games.
de: Durch das Ändern der Bildschirmauflösung wird dem Spieleentwickler auch die Kontrolle über die Filterung und die Streckung des Seitenverhältnisses entzogen, was für die korrekte Darstellung von Pixel-Art-Spielen wichtig sein kann.
zh_tw: 更改顯示器的解析度還會取消遊戲開發者對篩選和縱橫比拉伸的控制, 這對於確保像素遊戲的正確顯示畫面非常重要.

source: On top of that, changing the monitor's resolution makes alt-tabbing in and out of a game much slower since the monitor has to change resolutions every time this is done.
de: Außerdem wird durch die Änderung der Bildschirmauflösung das Ein- und Ausblenden eines Spiels durch Alt-Tabbing viel langsamer, da der Bildschirm jedes Mal die Auflösung ändern muss.
zh_tw: 最重要的是, 更改顯示器的解析度會使遊戲的Alt-Tab鍵切換速度變慢, 因為每次切換時顯示器都必須更改解析度.

source: Resizing
de: Größenänderung
zh_tw: 調整大小

source: There are several types of devices, with several types of screens, which in turn have different pixel density and resolutions. Handling all of them can be a lot of work, so Godot tries to make the developer's life a little easier. The :ref:`Viewport <class_Viewport>` node has several functions to handle resizing, and the root node of the scene tree is always a viewport (scenes loaded are instanced as a child of it, and it can always be accessed by calling ``get_tree().root`` or ``get_node("/root")``).
de: Es gibt verschiedene Gerätetypen mit verschiedenen Bildschirmtypen, die wiederum unterschiedliche Pixeldichten und Auflösungen haben. Sie alle zu handhaben, kann eine Menge Arbeit sein, daher versucht Godot, das Leben des Entwicklers ein wenig einfacher zu machen. Der :ref:`Viewport <class_Viewport>`-Node hat mehrere Funktionen, um die Größenänderung zu handhaben, und der Root-Node des Szenenbaums ist immer ein Viewport (geladene Szenen werden als Child davon instanziiert, und es kann immer durch den Aufruf von ``get_tree().root`` oder ``get_node("/root")`` darauf zugegriffen werden).
zh_tw: 市面上有著各種各樣的裝置, 擁有各種型別的螢幕, 依次有著不同的像素密度和解析度. 處理所有的型別工作量巨大, 所以Godot試圖讓開發者的生活變得更簡單. :ref:`Viewport <class_Viewport>` 節點提供了幾個處理大小調整的函式, 而場景樹的根節點始終是一個Viewport (場景將作為它的子節點被產生實體, 並且始終可以通過呼叫 ``get_tree().get_root()`` 或 ``get_node("/root")`` 來存取它.

source: In any case, while changing the root Viewport params is probably the most flexible way to deal with the problem, it can be a lot of work, code and guessing, so Godot provides a set of parameters in the project settings to handle multiple resolutions.
de: In jedem Fall ist das Ändern der Root-Viewport-Parameter wahrscheinlich der flexibelste Weg, mit dem Problem umzugehen, aber es kann eine Menge Arbeit, Code und Rätselraten bedeuten, daher bietet Godot eine Reihe von Parametern in den Projekteinstellungen, um mehrere Auflösungen zu handhaben.
zh_tw: 在任何情況下，雖然更改根 Viewport 的參數可能是解決問題的最靈活方法，但這樣做的可能包含大量工作、大量程式碼、大量推測過程，因此 Godot 在專案設定中提供了一組簡單的參數來處理多解析度問題。

source: Stretch settings
de: Streckungseinstellungen
zh_tw: 拉伸設定

source: Stretch settings are located in the project settings and provide several options:
de: Die Streckungseinstellungen befinden sich in den Projekteinstellungen und bieten verschiedene Optionen:
zh_tw: 拉伸設定位於專案設定中, 提供了幾個選項:

source: Stretch Mode
de: Streckungsmodus
zh_tw: 拉伸模式

source: The **Stretch Mode** setting defines how the base size is stretched to fit the resolution of the window or screen.
de: Die Einstellung **Streckungsmodus** definiert, wie die Basisgröße gestreckt wird, um der Auflösung des Fensters oder Bildschirms zu entsprechen.
zh_tw: **Stretch Mode** 設定定義了基本尺寸如何被伸展以適應視窗或螢幕的解析度.

source: The animations below use a "base size" of just 16×9 pixels to demonstrate the effect of different stretch modes. A single sprite, also 16×9 pixels in size, covers the entire viewport, and a diagonal :ref:`Line2D <class_Line2D>` is added on top of it:
de: Die folgenden Animationen verwenden eine "Basisgröße" von nur 16×9 Pixeln, um die Wirkung der verschiedenen Streckungsmodi zu demonstrieren. Ein einzelnes Sprite, ebenfalls 16×9 Pixel groß, deckt das gesamte Ansichtsfenster ab, und ein diagonales :ref:`Line2D <class_Line2D>` wird darüber gelegt:
zh_tw: 下面的動畫使用僅16×9像素的 "基本大小" 來演示不同拉伸模式的效果. 單個精靈, 大小也是16×9像素, 覆蓋整個視口, 並在其上新增一個對角線 :ref:`Line2D <class_Line2D>` :

source: **Stretch Mode = Disabled** (default): No stretching happens. One unit in the scene corresponds to one pixel on the screen. In this mode, the **Stretch Aspect** setting has no effect.
de: **Streckungsmodus = Deaktiviert** (Default): Es findet keine Streckung statt. Eine Einheit in der Szene entspricht einem Pixel auf dem Bildschirm. In diesem Modus hat die Einstellung **Streckungsverhältnis** keine Auswirkung.
zh_tw: **Stretch Mode = Disabled** (預設). 不發生拉伸. 場景中的一個單位對應於螢幕上的一個像素. 在這種模式下, **Stretch Aspect** 設定沒有效果.

source: **Stretch Mode = Canvas Items**: In this mode, the base size specified in width and height in the project settings is stretched to cover the whole screen (taking the **Stretch Aspect** setting into account). This means that everything is rendered directly at the target resolution. 3D is unaffected, while in 2D, there is no longer a 1:1 correspondence between sprite pixels and screen pixels, which may result in scaling artifacts.
de: **Streckungmodus = Canvas-Elemente**: In diesem Modus wird die in den Projekteinstellungen in Breite und Höhe angegebene Basisgröße so gestreckt, dass sie den gesamten Bildschirm abdeckt (unter Berücksichtigung der Einstellung **Streckungsverhältnis**). Das bedeutet, dass alles direkt in Zielauflösung gerendert wird. 3D ist davon nicht betroffen, während es in 2D keine 1:1-Entsprechung zwischen Sprite-Pixeln und Bildschirm-Pixeln mehr gibt, was zu Skalierungs-Artefakten führen kann.
zh_tw: **Stretch Mode = 2D**：在這種模式下，專案設定中所指定的寬高尺寸會被拉伸到覆蓋整個螢幕（會考慮 **Stretch Aspect** 設定）。這意味著所有的東西都直接在目標解析度下進行算繪。3D 不受影響，而在2D中，精靈像素和螢幕像素之間不再有 1:1 的對應關係，這可能會導致縮放的偽影。

source: **Stretch Mode = Viewport**: Viewport scaling means that the size of the root :ref:`Viewport <class_Viewport>` is set precisely to the base size specified in the Project Settings' **Display** section. The scene is rendered to this viewport first. Finally, this viewport is scaled to fit the screen (taking the **Stretch Aspect** setting into account).
de: **Streckungsmodus = Viewport**: Viewport-Skalierung bedeutet, dass die Größe des Root-:ref:`Viewport <class_Viewport>` genau auf die im Abschnitt **Display** der Projekteinstellungen angegebene Basisgröße eingestellt wird. Die Szene wird zunächst in diesem Viewport gerendert. Schließlich wird dieser Viewport skaliert, um ihn an den Bildschirm anzupassen (unter Berücksichtigung der Einstellung **Streckungsverhältnis**).
zh_tw: **Stretch Mode = Viewport** : 視口縮放意味著根 :ref:`Viewport <class_Viewport>` 的尺寸被精確地設定為在專案設定的 **Display** 部分指定的基本尺寸. 場景首先被算繪到這個視口. 最後, 這個視口被縮放以適應螢幕(考慮 **Stretch Aspect** 的設定).

source: To configure the stretch mode at runtime from a script, use the ``get_tree().root.content_scale_mode`` property (see :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` and the :ref:`ContentScaleMode <enum_Window_ContentScaleMode>` enum).
de: Um den Streckungsmodus zur Laufzeit von einem Skript aus zu konfigurieren, verwenden Sie die Property ``get_tree().root.content_scale_mode`` (siehe :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` und das :ref:`ContentScaleMode <enum_Window_ContentScaleMode>`-Enum).
zh_tw: 要在運作時從腳本中配置拉伸, 請使用 ``get_tree().set_screen_stretch()`` 方法(見 :ref:`SceneTree.set_screen_stretch() <class_SceneTree_method_set_screen_stretch>` ).

source: Stretch Aspect
de: Streckungsverhältnis
zh_tw: 拉伸比例（Stretch Aspect）

source: The second setting is the stretch aspect. Note that this only takes effect if **Stretch Mode** is set to something other than **Disabled**.
de: Die zweite Einstellung ist das Seitenverhältnis der Streckung. Beachten Sie, dass dies nur wirksam wird, wenn **Streckungsmodus** auf etwas anderes als **Deaktiviert** eingestellt ist.
zh_tw: 第二個設定是拉伸縱橫比. 請注意, 只有在 **Stretch Mode** 被設定為 **Disabled** 以外的情況下, 這才會生效.

source: In the animations below, you will notice gray and black areas. The black areas are added by the engine and cannot be drawn into. The gray areas are part of your scene, and can be drawn to. The gray areas correspond to the region outside the blue frame you see in the 2D editor.
de: In den Animationen unten sehen Sie graue und schwarze Bereiche. Die schwarzen Bereiche werden von der Engine hinzugefügt und können nicht eingezeichnet werden. Die grauen Bereiche sind Teil Ihrer Szene und können eingezeichnet werden. Die grauen Bereiche entsprechen dem Bereich außerhalb des blauen Rahmens, den Sie im 2D-Editor sehen.
zh_tw: 在下面的動畫中, 您會注意到灰色和黑色區域. 黑色區域由引擎新增, 無法繪製. 灰色區域是場景的一部分, 可以繪製. 灰色區域對應於您在2D編輯器中看到的藍色框架外的區域.

source: **Stretch Aspect = Ignore**: Ignore the aspect ratio when stretching the screen. This means that the original resolution will be stretched to exactly fill the screen, even if it's wider or narrower. This may result in nonuniform stretching: things looking wider or taller than designed.
de: **Streckungsverhältnis = Ignorieren**: Ignoriert das Seitenverhältnis bei der Streckung des Bildschirms. Das bedeutet, dass die ursprüngliche Auflösung so gestreckt wird, dass sie genau den Bildschirm ausfüllt, auch wenn dieser breiter oder schmaler ist. Dies kann zu einer ungleichmäßigen Streckung führen: Dinge sehen breiter oder höher aus als vorgesehen.
zh_tw: **Stretch Aspect = Ignore** : 在拉伸螢幕時忽略長寬比. 這意味著原始解析度將被拉伸以完全填滿螢幕, 即使它更寬或更窄. 這可能會導致不均勻的拉伸, 事物看起來比設計的更寬或更高.

source: **Stretch Aspect = Keep**: Keep aspect ratio when stretching the screen. This means that the viewport retains its original size regardless of the screen resolution, and black bars will be added to the top/bottom of the screen ("letterboxing") or the sides ("pillarboxing").
de: **Streckungsverhältnis = Beibehalten**: Behält das Seitenverhältnis bei der Streckung des Bildschirms bei. Dies bedeutet, dass der Viewport seine ursprüngliche Größe unabhängig von der Bildschirmauflösung beibehält und schwarze Balken am oberen/unteren Bildschirmrand ("Letterboxing") oder an den Seiten ("Pillarboxing") hinzugefügt werden.
zh_tw: **Stretch Aspect = Keep** : 在拉伸螢幕的時候保持長寬比. 這意味著無論螢幕解析度如何, 視口都會保留原來的尺寸, 黑條會被新增到螢幕的頂部或底部("寬屏模式 ")或側面(" 豎屏模式").

source: This is a good option if you know the aspect ratio of your target devices in advance, or if you don't want to handle different aspect ratios.
de: Dies ist eine gute Option, wenn Sie das Seitenverhältnis Ihrer Zielgeräte im Voraus kennen oder wenn Sie nicht mit unterschiedlichen Seitenverhältnissen arbeiten möchten.
zh_tw: 如果您事先知道目標裝置的寬高比, 或者您不想處理不同的寬高比, 這是一個不錯的選擇.

source: **Stretch Aspect = Keep Width**: Keep aspect ratio when stretching the screen. If the screen is wider than the base size, black bars are added at the left and right (pillarboxing). But if the screen is taller than the base resolution, the viewport will be grown in the vertical direction (and more content will be visible to the bottom). You can also think of this as "Expand Vertically".
de: **Streckverhältnis = Breite beibehalten**: Behält das Seitenverhältnis bei, wenn der Bildschirm gestreckt wird. Wenn der Bildschirm breiter ist als die Basisgröße, werden links und rechts schwarze Balken hinzugefügt (Pillarboxing). Ist der Bildschirm jedoch höher als die Basisauflösung, wird das Ansichtsfenster in vertikaler Richtung vergrößert (und es wird mehr Inhalt nach unten hin sichtbar). Sie können sich dies auch als "Vertikal erweitern" vorstellen.
zh_tw: **Stretch Aspect = Keep Width** : 在拉伸螢幕時保持長寬比. 如果螢幕比基本尺寸寬, 則會在左右兩邊新增黑條(豎屏模式). 但如果螢幕比基本解析度高, 視口將在垂直方向上增長(更多的內容將在底部可見). 你也可以把它看作是 "垂直擴充" .

source: This is usually the best option for creating GUIs or HUDs that scale, so some controls can be anchored to the bottom (:ref:`doc_size_and_anchors`).
de: Dies ist normalerweise die beste Option zum Erstellen von skalierbaren GUIs oder HUDs, sodass einige Steuerelemente unten verankert werden können (:ref:`doc_size_and_anchors`).
zh_tw: 這通常是建立可擴充的GUI或HUD的最佳選擇, 因此一些控制項可以錨定到底部( :ref:`doc_size_and_anchors`).

source: **Stretch Aspect = Keep Height**: Keep aspect ratio when stretching the screen. If the screen is taller than the base size, black bars are added at the top and bottom (letterboxing). But if the screen is wider than the base resolution, the viewport will be grown in the horizontal direction (and more content will be visible to the right). You can also think of this as "Expand Horizontally".
de: **Streckverhältnis = Höhe beibehalten**: Behält das Seitenverhältnis bei, wenn der Bildschirm gestreckt wird. Wenn der Bildschirm größer als die Basisgröße ist, werden oben und unten schwarze Balken hinzugefügt (Letterboxing). Ist der Bildschirm jedoch breiter als die Basisauflösung, wird das Ansichtsfenster in horizontaler Richtung vergrößert (und es wird mehr Inhalt auf der rechten Seite sichtbar). Sie können dies auch als "Horizontal erweitern" bezeichnen.
zh_tw: **Stretch Aspect = Keep Height** : 在拉伸螢幕時保持長寬比. 如果螢幕比基本尺寸高, 則會在頂部和底部新增黑條(寬屏模式). 但如果螢幕比基本解析度寬, 視口將在水平方向上增長(更多的內容將在右邊可見). 你也可以把它看作是 "水平擴充" .

source: This is usually the best option for 2D games that scroll horizontally (like runners or platformers).
de: Dies ist in der Regel die beste Option für 2D-Spiele, die horizontal gescrollt werden (z.B. Runner oder Plattformer).
zh_tw: 這通常是水平滾動的2D遊戲的最佳選擇(如跑步者或平臺遊戲者).
