Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: de, zh_tw

source: To better support tablets and foldable phones (which frequently feature displays with aspect ratios close to 4:3), consider using a base resolution that has a 3:4 aspect ratio while following the rest of the instructions here. For instance, you can set the base window width to ``960`` and the base window height to ``1280``.
de: Um Tablets und faltbare Smartphones (die häufig Bildschirme mit einem Seitenverhältnis von fast 4:3 haben) besser zu unterstützen, sollten Sie eine Basisauflösung mit einem Seitenverhältnis von 3:4 verwenden, während Sie den Rest der Anweisungen hier befolgen. Sie können zum Beispiel die Basisfensterbreite auf ``960`` und die Basisfensterhöhe auf ``1280`` einstellen.
zh_tw: 為了更好地支援平板電腦和可折疊手機（其顯示器的寬高比通常接近 4:3），請考慮使用寬高比為 3:4 的基本分辨率，同時遵循此處的其餘說明。例如，您可以將基本視窗寬度設為“960”，將基本視窗高度設定為“1280”。

source: Non-game application
de: Nicht-Spiel-Anwendung
zh_tw: 語言規範

source: Set the base window width and height to the smallest window size that you intend to target. This is not required, but this ensures that you design your UI with small window sizes in mind.
de: Setzen Sie die Basisfensterbreite und -höhe auf die kleinste Fenstergröße, die Sie anvisieren. Dies ist nicht erforderlich, stellt aber sicher, dass Sie Ihre Benutzeroberfläche mit Blick auf kleine Fenstergrößen gestalten.
zh_tw: 將基礎視窗寬高設定為你想要支援的最小視窗尺寸。這不是必須的，但是可以保證你在設計 UI 時考慮較小的視窗尺寸。

source: Keep the stretch mode to its default value, ``disabled``.
de: Lassen Sie den Streckungsmodus auf seinem Defaultwert, ``deaktiviert``.
zh_tw: 保持拉伸模式（Stretch Mode）為預設值 ``disabled``（禁用）。

source: Keep the stretch aspect to its default value, ``ignore`` (its value won't be used since the stretch mode is ``disabled``).
de: Behalten Sie das Streckungsverhältnis auf seinem Defaultwert, ``ignorieren`` (sein Wert wird nicht verwendet, da der Streckungsmodus ``deaktiviert`` ist).
zh_tw: 保持拉伸比例（Stretch Aspect）為預設值 ``ignore（忽略）`` （因為拉伸模式是 ``disabled`` ，所以這裡的值不會被用到）。

source: You can define a minimum window size by setting ``OS.min_window_size`` in a script's ``_ready()`` function. This prevents the user from resizing the application below a certain size, which could break the UI layout.
de: Sie können eine minimale Fenstergröße definieren, indem Sie ``OS.min_window_size`` in der ``_ready()`` Funktion eines Skripts setzen. Dies verhindert, dass der Benutzer die Größe der Anwendung unter eine bestimmte Größe ändert, was das UI-Layout zerstören könnte.
zh_tw: 你可以在腳本的 ``_ready()`` 函式中通過設定 ``OS.min_window_size`` 來定義視窗的最小尺寸。這樣可以防止使用者將應用視窗縮得過小，導致 UI 佈局的問題。

source: Godot doesn't support manually overriding the 2D scale factor yet, so it is not possible to have hiDPI support in non-game applications. Due to this, it is recommended to leave **Allow Hidpi** disabled in non-game applications to allow for the OS to use its low-DPI fallback.
de: Godot unterstützt noch nicht das manuelle Überschreiben des 2D-Skalierungsfaktors, daher ist es nicht möglich, hiDPI-Unterstützung in Nicht-Spiel-Anwendungen zu haben. Aus diesem Grund wird empfohlen, **Hidpi Erlauben** in Nicht-Spiel-Anwendungen deaktiviert zu lassen, damit das Betriebssystem seinen Low-DPI-Fallback verwenden kann.
zh_tw: Godot 尚未支援手動設定 2D 縮放比例，所以無法在非遊戲應用中支援 hiDPI。因此，推薦為非遊戲應用禁用 **Allow Hidpi** 選項，作業系統會退回到低 DPI。

source: hiDPI support
de: hiDPI-Unterstützung
zh_tw: 支援平台

source: By default, Godot projects aren't considered DPI-aware by the operating system. This is done to improve performance on low-end systems, since the operating system's DPI fallback scaling will be faster than letting the application scale itself (even when using the ``viewport`` stretch mode).
de: Standardmäßig werden Godot-Projekte vom Betriebssystem nicht als DPI-kompatibel angesehen. Dies geschieht, um die Performance auf Low-End-Systemen zu verbessern, da die DPI-Fallback-Skalierung des Betriebssystems schneller ist als die Skalierung der Anwendung selbst (sogar bei Verwendung des Streckungsmodus ``Viewport``).
zh_tw: 預設情況下，作業系統會認為 Godot 專案是 DPI 無關的。因為作業系統的 DPI 退回縮放比讓應用程式自己做縮放要快很多（即便用的是 ``viewport`` 拉伸模式），所以這樣做可以提高在低端系統上的性能。

source: However, the OS-provided DPI fallback scaling doesn't play well with fullscreen mode. If you want crisp visuals on hiDPI displays or if project uses fullscreen, it's recommended to enable **Display > Window > Dpi > Allow Hidpi** in the Project Settings.
de: Die vom Betriebssystem bereitgestellte DPI-Fallback-Skalierung funktioniert jedoch nicht gut im Vollbildmodus. Wenn Sie eine scharfe Darstellung auf HiDPI-Displays wünschen oder das Projekt den Vollbildmodus verwendet, empfiehlt es sich, **Anzeige > Fenster > DPI > Hidpi zulassen** in den Projekteinstellungen zu aktivieren.
zh_tw: 不過作業系統的 DPI 退回縮放功能在全屏模式下並不好用。如果你想在 hiDPI 顯示器下得到清晰的畫面，又或者想要支援全屏，那麼推薦啟用專案設定中的 **Display > Window > Dpi > Allow Hidpi** 。

source: **Allow Hidpi** is only effective on Windows and macOS. It's ignored on all other platforms.
de: **Hidpi zulassen** ist nur unter Windows und macOS wirksam. Auf allen anderen Plattformen wird es ignoriert.
zh_tw: **Allow Hidpi（允許 hiDPI）** 僅在 Windows 和 macOS 上有效，其它平臺會忽略這個選項。

source: The Godot editor itself is always marked as DPI-aware. Running the project from the editor will only be DPI-aware if **Allow Hidpi** is enabled in the Project Settings.
de: Der Godot-Editor selbst ist immer als DPI-fähig gekennzeichnet. Die Ausführung des Projekts aus dem Editor ist nur dann DPI-fähig, wenn **Hidpi zulassen** in den Projekteinstellungen aktiviert ist.
zh_tw: Godot 編輯器本身是打開了這個選項，與 DPI 相關的。但在編輯器中運作專案時，只有在專案設定裡啟用 **Allow Hidpi** 才會讓專案與 DPI 相關。

source: Reducing aliasing on downsampling
de: Reduzierung von Aliasing beim Downsampling
zh_tw: 減少縮減取樣的混疊

source: If the game has a very high base resolution (e.g. 3840×2160), aliasing might appear when downsampling to something considerably lower like 1280×720.
de: Wenn das Spiel eine sehr hohe Basisauflösung hat (z.B. 3840×2160), kann Aliasing auftreten, wenn das Downsampling auf eine wesentlich niedrigere Auflösung wie 1280×720 erfolgt.
zh_tw: 如果遊戲的基本解析度很高（如 3840×2160），當取樣降到相當低的解析度（如 1280×720）時，可能會出現鋸齒。可以通過在載入時將所有圖像縮小 2 倍來減少鋸齒的出現。這可以通過在載入遊戲資料之前呼叫下面的方法來實作。

source: To resolve this, you can :ref:`enable mipmaps <doc_importing_images_mipmaps>` on all your 2D textures. However, enabling mipmaps will increase memory usage which can be an issue on low-end mobile devices.
de: Um dieses Problem zu lösen, können Sie :ref:`Mipmaps <doc_importing_images_mipmaps>` für alle 2D-Texturen aktivieren. Die Aktivierung von Mipmaps erhöht jedoch die Speichernutzung, was auf leistungsschwachen mobilen Geräten ein Problem darstellen kann.

source: Handling aspect ratios
de: Umgang mit Seitenverhältnissen
zh_tw: 處理縱橫比

source: Once scaling for different resolutions is accounted for, make sure that your *user interface* also scales for different aspect ratios. This can be done using :ref:`anchors <doc_size_and_anchors>` and/or :ref:`containers <doc_gui_containers>`.
de: Sobald die Skalierung für verschiedene Auflösungen berücksichtigt ist, stellen Sie sicher, dass Ihre *Benutzeroberfläche* auch für verschiedene Seitenverhältnisse skaliert. Dies kann mit :ref:`Ankern <doc_size_and_anchors>` und/oder :ref:`Containern <doc_gui_containers>` geschehen.
zh_tw: 一旦考慮到不同解析度的縮放, 請確保你的 *user interface* 也能為不同的長寬比進行縮放. 這可以使用 :ref:`anchors <doc_size_and_anchors>` 和/或 :ref:`containers <doc_gui_containers>` 來完成.

source: Field of view scaling
de: Skalierung des Sichtfelds
zh_tw: 視場角縮放

source: The 3D Camera node's **Keep Aspect** property defaults to the **Keep Height** scaling mode (also called *Hor+*). This is usually the best value for desktop games and mobile games in landscape mode, as widescreen displays will automatically use a wider field of view.
de: Die Eigenschaft **Seitenverhältnis beibehalten** des 3D-Kamera-Nodes ist standardmäßig auf den Skalierungsmodus **Höhe beibehalten** (auch *Hor+* genannt) eingestellt. Dies ist in der Regel der beste Wert für Desktop-Spiele und mobile Spiele im Querformat, da Breitbildschirme automatisch ein breiteres Sichtfeld verwenden.
zh_tw: 3D相機節點的 **Keep Aspect** 屬性預設為 **Keep Height** 縮放模式(也稱為 *Hor+* ). 在橫屏模式下, 這通常是桌面遊戲和手機遊戲的最佳選擇, 因為寬屏顯示器會自動使用更寬的視野.

source: However, if your 3D game is intended to be played in portrait mode, it may make more sense to use **Keep Width** instead (also called *Vert-*). This way, smartphones with an aspect ratio taller than 16:9 (e.g. 19:9) will use a *taller* field of view, which is more logical here.
de: Wenn Ihr 3D-Spiel jedoch im Hochformat gespielt werden soll, kann es sinnvoller sein, stattdessen **Breite beibehalten** (auch *Vert-* genannt) zu verwenden. Auf diese Weise werden Smartphones mit einem größeren Seitenverhältnis als 16:9 (z. B. 19:9) ein *größeres* Sichtfeld verwenden, was hier logischer ist.
zh_tw: 然而, 如果您的3D遊戲打算使用縱向模式, 那麼使用 **Keep Width保持寬度** 稱為( *Vert-* )可能會更有意義. 這樣, 寬高比大於16:9(例如19:9)的智慧手機將使用 *更高* 的視野, 這在這裡更符合邏輯.

source: Scaling 2D and 3D elements differently using Viewports
de: Skalieren von 2D- und 3D-Elementen in Viewports
zh_tw: 使用視圖埠以不同的方式縮放 2D 和 3D 元素

source: Using multiple Viewport nodes, you can have different scales for various elements. For instance, you can use this to render the 3D world at a low resolution while keeping 2D elements at the native resolution. This can improve performance significantly while keeping the HUD and other 2D elements crisp.
de: Durch die Verwendung mehrerer Viewport-Nodes können Sie verschiedene Skalierungen für verschiedene Elemente verwenden. Auf diese Weise können Sie beispielsweise die 3D-Welt mit einer niedrigen Auflösung rendern, während 2D-Elemente in der nativen Auflösung bleiben. Dies kann die Performance erheblich verbessern, während das HUD und andere 2D-Elemente gestochen scharf bleiben.
zh_tw: 使用多個視圖視窗節點, 可以對不同的元素使用不同的比例. 例如, 您可以使用此選項以低解析度算繪3D世界, 同時將2D元素保持在原生解析度. 這可以顯著提高性能, 同時保持HUD和其他2D元素的清晰度.

source: This is done by using the root Viewport node only for 2D elements, then creating a Viewport node to display the 3D world and displaying it using a SubViewportContainer or TextureRect node. There will effectively be two viewports in the final project. One upside of using TextureRect over SubViewportContainer is that it allows enable linear filtering. This makes scaled 3D viewports look better in many cases.
de: Dazu wird der Root-Viewport-Node nur für 2D-Elemente verwendet, dann wird ein Viewport-Node erstellt, um die 3D-Welt anzuzeigen, und dieser wird mit einem SubViewportContainer- oder TextureRect-Node dargestellt. Im endgültigen Projekt wird es effektiv zwei Viewports geben. Ein Vorteil der Verwendung von TextureRect gegenüber SubViewportContainer besteht darin, dass lineare Filterung möglich ist. Dies lässt skalierte 3D-Viewports in vielen Fällen besser aussehen.
zh_tw: 這是通過只對2D元素使用根Viewport節點, 然後建立一個Viewport節點來顯示3D世界並使用ViewportContainer或TextureRect節點來實作的. 最終專案中實際上將有兩個視圖視窗. 與ViewportContainer相比, 使用TextureRect的一個好處是它允許啟用線性篩選. 這使得縮放的3D視圖視窗在許多情況下看起來更好.

source: See the `3D viewport scaling demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__ for examples.
de: Siehe die `3D-Viewport-Skalierungs-Demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__ für Beispiele.
zh_tw: 若欲檢視範例專案，請參考作業系統示範專案： https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: **Pixel art:**
zh_tw: **PCK 格式:**
