Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/viewports.po
Languages: de

source: Using Viewports
de: Verwenden von Viewports

source: Introduction
de: Einführung

source: Think of a :ref:`Viewport <class_Viewport>` as a screen onto which the game is projected. In order to see the game, we need to have a surface on which to draw it. That surface is the Root Viewport.
de: Stellen Sie sich ein :ref:`Viewport <class_Viewport>` als einen Bildschirm vor, auf den das Spiel projiziert wird. Um das Spiel sehen zu können, brauchen wir eine Oberfläche, auf der wir es zeichnen können. Diese Fläche ist der Root-Viewport.

source: :ref:`SubViewports <class_SubViewport>` are a kind of Viewport that can be added to the scene so that there are multiple surfaces to draw on. When we are drawing to a SubViewport, we call it a render target. We can access the contents of a render target by accessing its corresponding :ref:`texture <class_Viewport_method_get_texture>`. By using a SubViewport as render target, we can either render multiple scenes simultaneously or we can render to a :ref:`ViewportTexture <class_ViewportTexture>` which is applied to an object in the scene, for example a dynamic skybox.
de: :ref:`SubViewports <class_SubViewport>` sind eine Art von Viewport, die der Szene hinzugefügt werden können, so dass es mehrere Oberflächen gibt, auf die man zeichnen kann. Wenn wir auf ein SubViewport zeichnen, nennen wir es ein Render-Target. Wir können auf den Inhalt eines Render-Targets zugreifen, indem wir auf die entsprechende :ref:`Textur <class_Viewport_method_get_texture>` zugreifen. Wenn wir ein SubViewport als Render-Target verwenden, können wir entweder mehrere Szenen gleichzeitig rendern oder wir können auf eine :ref:`ViewportTexture <class_ViewportTexture>` rendern, die auf ein Objekt in der Szene angewendet wird, zum Beispiel eine dynamische Skybox.

source: :ref:`SubViewports <class_SubViewport>` have a variety of use cases, including:
de: :ref:`SubViewports <class_SubViewport>` haben eine Vielzahl von Anwendungsfällen, einschließlich:

source: Rendering 3D objects within a 2D game
de: Rendern von 3D-Objekten in einem 2D-Spiel

source: Rendering 2D elements in a 3D game
de: Rendern von 2D-Elementen in einem 3D-Spiel

source: Rendering dynamic textures
de: Rendern von dynamischen Texturen

source: Generating procedural textures at runtime
de: Generieren von prozeduralen Texturen zur Laufzeit

source: Rendering multiple cameras in the same scene
de: Rendern mehrerer Kameras in derselben Szene

source: What all these use cases have in common is that you are given the ability to draw objects to a texture as if it were another screen and can then choose what to do with the resulting texture.
de: Allen diese Anwendungsfällen haben gemeinsam, dass Sie Objekte auf eine Textur zeichnen können als wäre es ein anderer Bildschirm und dann auswählen können, was mit der resultierenden Textur geschehen soll.

source: Another kind of Viewports in Godot are :ref:`Windows <class_Window>`. They allow their content to be projected onto a window. While the Root Viewport is a Window, they are less flexible. If you want to use the texture of a Viewport, you'll be working with :ref:`SubViewports <class_SubViewport>` most of the time.
de: Eine andere Art von Viewports in Godot sind :ref:`Fenster <class_Window>`. Sie erlauben es, ihren Inhalt auf ein Fenster zu projizieren. Auch wenn der Root Viewport ein Fenster ist, sind sie doch weniger flexibel. Wenn Sie die Textur eines Viewports verwenden wollen, werden Sie die meiste Zeit mit :ref:`SubViewports <class_SubViewport>` arbeiten.

source: Input
de: Eingabe

source: :ref:`Viewports <class_Viewport>` are also responsible for delivering properly adjusted and scaled input events to their children nodes. By default :ref:`SubViewports <class_SubViewport>` don't automatically receive input, unless they receive it from their direct :ref:`SubViewportContainer <class_SubViewportContainer>` parent node. In this case, input can be disabled with the :ref:`Disable Input <class_Viewport_property_gui_disable_input>` property.
de: :ref:`Viewports <class_Viewport>` sind auch dafür verantwortlich, ihren Child-Nodes korrekt angepasste und skalierte Eingabeereignisse zu liefern. Standardmäßig erhalten :ref:`SubViewports <class_SubViewport>` nicht automatisch Eingaben, es sei denn, sie erhalten sie von ihrem direkten :ref:`SubViewportContainer <class_SubViewportContainer>` Parent-Node. In diesem Fall kann die Eingabe mit der Property :ref:`Eingabe Deaktivieren <class_Viewport_property_gui_disable_input>` deaktiviert werden.

source: For more information on how Godot handles input, please read the :ref:`Input Event Tutorial <doc_inputevent>`.
de: Für weitere Informationen darüber, wie Godot mit Eingaben umgeht, lesen Sie bitte das :ref:`Input Event Tutorial <doc_inputevent>`.

source: Godot supports 3D sound (in both 2D and 3D nodes). More on this can be found in the :ref:`Audio Streams Tutorial <doc_audio_streams>`. For this type of sound to be audible, the :ref:`Viewport <class_Viewport>` needs to be enabled as a listener (for 2D or 3D). If you are using a :ref:`SubViewport <class_SubViewport>` to display your :ref:`World3D <class_World3D>` or :ref:`World2D <class_World2D>`, don't forget to enable this!
de: Godot unterstützt 3D-Audio (sowohl in 2D- als auch in 3D-Nodes). Mehr dazu finden Sie im :ref:`Audio Streams-Tutorial <doc_audio_streams>`. Damit diese Art von Audio hörbar ist, muss das :ref:`Viewport <class_Viewport>` als Listener (für 2D oder 3D) aktiviert sein. Wenn Sie einen :ref:`SubViewport <class_SubViewport>` verwenden, um Ihre :ref:`World3D <class_World3D>` oder :ref:`World2D <class_World2D>` anzuzeigen, vergessen Sie nicht, dies zu aktivieren!

source: Cameras (2D & 3D)
de: Kameras (2D & 3D)

source: When using a :ref:`Camera3D <class_Camera3D>` or :ref:`Camera2D <class_Camera2D>`, it will always display on the closest parent :ref:`Viewport <class_Viewport>` (going towards the root). For example, in the following hierarchy:
de: Wenn eine :ref:`Camera3D <class_Camera3D>` oder :ref:`Camera2D <class_Camera2D>` verwendet wird, wird sie immer auf dem nächstgelegenen Parent-:ref:`Viewport <class_Viewport>` (in Richtung Root) angezeigt. Zum Beispiel, in der folgenden Hierarchie:

source: ``CameraA`` will display on the Root :ref:`Viewport <class_Viewport>` and it will draw ``MeshA``. ``CameraB`` will be captured by the :ref:`SubViewport <class_SubViewport>` along with ``MeshB``. Even though ``MeshB`` is in the scene hierarchy, it will still not be drawn to the Root Viewport. Similarly, ``MeshA`` will not be visible from the SubViewport because SubViewports only capture nodes below them in the hierarchy.
de: ``CameraA`` wird auf dem Root :ref:`Viewport <class_Viewport>` angezeigt und es wird ``MeshA`` gezeichnet. ``CameraB`` wird von dem :ref:`SubViewport <class_SubViewport>` zusammen mit ``MeshB`` aufgezeichnet. Obwohl ``MeshB`` in der Szenenhierarchie ist, wird es trotzdem nicht in den Root-Viewport gezeichnet. Ebenso wird ``MeshA`` im SubViewport nicht sichtbar sein, da SubViewports nur Nodes unterhalb von ihnen in der Hierarchie erfassen.

source: There can only be one active camera per :ref:`Viewport <class_Viewport>`, so if there is more than one, make sure that the desired one has the :ref:`current <class_Camera3D_property_current>` property set, or make it the current camera by calling:
de: Es kann nur eine aktive Kamera pro :ref:`Viewport <class_Viewport>` geben. Wenn es also mehr als eine gibt, stellen Sie sicher, dass die gewünschte Kamera die Property :ref:`current <class_Camera3D_property_current>` gesetzt hat, oder machen Sie sie durch einen Aufruf zur aktuellen Kamera:

source: By default, cameras will render all objects in their world. In 3D, cameras can use their :ref:`cull_mask <class_Camera3D_property_cull_mask>` property combined with the :ref:`VisualInstance3D's <class_VisualInstance3D>` :ref:`layer <class_VisualInstance3D_property_layers>` property to restrict which objects are rendered.
de: Standardmäßig rendern Kameras alle Objekte in ihrer Welt. In 3D können Kameras ihre :ref:`cull_mask <class_Camera3D_property_cull_mask>`-Property in Kombination mit der :ref:`VisualInstance3D's <class_VisualInstance3D>` :ref:`layer <class_VisualInstance3D_property_layers>`-Property verwenden, um einzuschränken, welche Objekte gerendert werden.

source: Scale & stretching
de: Skalieren & Dehnen

source: :ref:`SubViewports <class_SubViewport>` have a :ref:`size<class_SubViewport_property_size>` property, which represents the size of the SubViewport in pixels. For SubViewports which are children of :ref:`SubViewportContainers <class_SubViewportContainer>`, these values are overridden, but for all others, this sets their resolution.
de: :ref:`SubViewports <class_SubViewport>` haben eine :ref:`size<class_SubViewport_property_size>` Property, zur Darstellung der Größe des SubViewports in Pixeln. Für SubViewports, die Child-Elemente von :ref:`SubViewportContainers <class_SubViewportContainer>` sind, werden diese Werte überschrieben, aber für alle anderen left dies ihre Auflösung fest.

source: It is also possible to scale the 2D content and make the :ref:`SubViewport <class_SubViewport>` resolution different from the one specified in size, by calling:
de: Es ist auch möglich, den 2D-Inhalt zu skalieren und die Auflösung des :ref:`SubViewport <class_SubViewport>` von der in der Größe angegebenen Auflösung zu unterscheiden, indem man folgendes aufruft:

source: For information on scaling and stretching with the Root Viewport visit the :ref:`Multiple Resolutions Tutorial <doc_multiple_resolutions>`
de: Für Informationen zum Skalieren und Dehnen mit dem Root-Viewport besuchen Sie das :ref:`Mehrfache-Auflösungen-Tutorial <doc_multiple_resolutions>`

source: Worlds
de: Welten

source: For 3D, a :ref:`Viewport <class_Viewport>` will contain a :ref:`World3D <class_World3D>`. This is basically the universe that links physics and rendering together. Node3D-based nodes will register using the World3D of the closest Viewport. By default, newly created Viewports do not contain a World3D but use the same as their parent Viewport. The Root Viewport always contains a World3D, which is the one objects are rendered to by default.
de: Für 3D wird ein :ref:`Viewport <class_Viewport>` ein :ref:`World3D <class_World3D>` enthalten. Dies ist im Grunde das Universum, das Physik und Rendering miteinander verbindet. Node3D-basierte Nodes registrieren sich mit dem World3D des nächstgelegenen Viewports. Standardmäßig enthalten neu erstellte Viewports kein World3D, sondern verwenden das gleiche wie der Parent-Viewport. Der Root-Viewport enthält immer ein World3D, in dem Objekte standardmäßig gerendert werden.

source: A :ref:`World3D <class_World3D>` can be set in a :ref:`Viewport <class_Viewport>` using the :ref:`World 3D<class_Viewport_property_world_3d>` property, that will separate all children nodes of this :ref:`Viewport <class_Viewport>` and will prevent them from interacting with the parent Viewport's World3D. This is especially useful in scenarios where, for example, you might want to show a separate character in 3D imposed over the game (like in StarCraft).
de: Ein :ref:`World3D <class_World3D>` kann in einem :ref:`Viewport <class_Viewport>` mit der :ref:`World 3D<class_Viewport_property_world_3d>`-Property gesetzt werden, die alle untergeordneten Nodes dieses :ref:`Viewports <class_Viewport>` trennt und verhindert, dass sie mit dem World3D des übergeordneten Viewports interagieren. Dies ist besonders nützlich in Szenarien, in denen man z.B. einen separaten Charakter in 3D über dem Spiel zeigen möchte (wie in StarCraft).

source: As a helper for situations where you want to create :ref:`Viewports <class_Viewport>` that display single objects and don't want to create a :ref:`World3D <class_World3D>`, Viewport has the option to use its :ref:`Own World3D <class_Viewport_property_own_world_3d>`. This is useful when you want to instance 3D characters or objects in :ref:`World2D <class_World2D>`.
de: Als Hilfe für Situationen, in denen man :ref:`Viewports <class_Viewport>` erstellen möchte, die einzelne Objekte anzeigen und keine :ref:`World3D <class_World3D>` erstellen wollen, hat Viewport die Option, seine :ref:`Eigene World3D <class_Viewport_property_own_world_3d>` zu verwenden. Dies ist nützlich, wenn Sie 3D-Charaktere oder Objekte in :ref:`World2D <class_World2D>` instanziieren wollen.

source: For 2D, each :ref:`Viewport <class_Viewport>` always contains its own :ref:`World2D <class_World2D>`. This suffices in most cases, but in case sharing them may be desired, it is possible to do so by setting :ref:`world_2d<class_Viewport_property_world_2d>` on the Viewport through code.
de: Für 2D enthält jeder :ref:`Viewport <class_Viewport>` immer sein eigenes :ref:`World2D <class_World2D>`. Dies reicht in den meisten Fällen aus, aber falls eine gemeinsame Nutzung erwünscht ist, ist es möglich, dies zu tun, indem :ref:`world_2d<class_Viewport_property_world_2d>` auf dem Viewport durch Code gesetzt wird.

source: For an example of how this works, see the demo projects `3D in 2D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_in_2d>`_ and `2D in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/2d_in_3d>`_ respectively.
de: Ein Beispiel dafür finden Sie in den Demo-Projekten `3D in 2D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_in_2d>`_ und `2D in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/2d_in_3d>`_.

source: It is possible to query a capture of the :ref:`Viewport <class_Viewport>` contents. For the Root Viewport, this is effectively a screen capture. This is done with the following code:
de: Es ist möglich, eine Aufnahme des Inhalts des :ref:`Viewport <class_Viewport>` abzufragen. Für den Root-Viewport ist dies effektiv eine Bildschirmaufnahme. Dies wird mit folgendem Code erreicht:

source: But if you use this in ``_ready()`` or from the first frame of the :ref:`Viewport's <class_Viewport>` initialization, you will get an empty texture because there is nothing to get as texture. You can deal with it using (for example):
de: Wenn Sie dies jedoch in ``_ready()`` oder ab dem ersten Frame der :ref:`Viewport's <class_Viewport>`-Initialisierung verwenden, erhalten Sie eine leere Textur, da nichts als Textur definiert ist. Sie können dies beispielsweise so handhaben:

source: If the :ref:`SubViewport <class_SubViewport>` is a child of a :ref:`SubViewportContainer <class_SubViewportContainer>`, it will become active and display anything it has inside. The layout looks like this:
de: Wenn der :ref:`SubViewport <class_SubViewport>` ein Child eines :ref:`SubViewportContainer <class_SubViewportContainer>` ist, wird er aktiv und zeigt alles an, was er enthält. Das Layout sieht wie folgt aus:

source: The :ref:`SubViewport <class_SubViewport>` will cover the area of its parent :ref:`SubViewportContainer <class_SubViewportContainer>` completely if :ref:`Stretch<class_SubViewportContainer_property_stretch>` is set to ``true`` in the SubViewportContainer.
de: Der :ref:`SubViewport <class_SubViewport>` deckt den Bereich seines Parent-:ref:`SubViewportContainer <class_SubViewportContainer>` vollständig ab, wenn :ref:`Stretch<class_SubViewportContainer_property_stretch>` im SubViewportContainer auf ``true`` gesetzt ist.

source: The size of the :ref:`SubViewportContainer <class_SubViewportContainer>` cannot be smaller than the size of the :ref:`SubViewport <class_SubViewport>`.
de: Die Größe des :ref:`SubViewportContainer <class_SubViewportContainer>` kann nicht kleiner sein als die Größe des :ref:`SubViewport <class_SubViewport>`.

source: Rendering
de: Rendern

source: Due to the fact that the :ref:`Viewport <class_Viewport>` is an entryway into another rendering surface, it exposes a few rendering properties that can be different from the project settings. You can choose to use a different level of :ref:`MSAA <class_Viewport_property_msaa_2d>` for each Viewport. The default behavior is ``Disabled``.
de: Da der :ref:`Viewport <class_Viewport>` ein Zugang zu einer anderen Rendering-Oberfläche darstellt, legt er einige Rendering-Propertys offen, die sich von den Projekteinstellungen unterscheiden können. Sie können für jeden Viewport eine andere Stufe von :ref:`MSAA <class_Viewport_property_msaa_2d>` verwenden. Das Default-Verhalten ist ``Deaktiviert``.

source: If you know that the :ref:`Viewport <class_Viewport>` is only going to be used for 2D, you can :ref:`Disable 3D<class_Viewport_property_disable_3d>`. Godot will then restrict how the Viewport is drawn. Disabling 3D is slightly faster and uses less memory compared to enabled 3D. It's a good idea to disable 3D if your viewport doesn't render anything in 3D.
de: Wenn Sie wissen, dass der :ref:`Viewport <class_Viewport>` nur für 2D verwendet werden soll, können Sie :ref:`Disable 3D<class_Viewport_property_disable_3d>`. Godot wird dann einschränken, wie der Viewport gezeichnet wird. Die Deaktivierung von 3D ist etwas schneller und verbraucht weniger Speicher im Vergleich zu aktiviertem 3D. Es ist eine gute Idee, 3D zu deaktivieren, wenn Ihr Viewport nichts in 3D rendert.

source: If you need to render 3D shadows in the viewport, make sure to set the viewport's :ref:`positional_shadow_atlas_size<class_Viewport_property_positional_shadow_atlas_size>` property to a value higher than ``0``. Otherwise, shadows won't be rendered. By default, the equivalent project setting is set to ``4096`` on desktop platforms and ``2048`` on mobile platforms.
de: Wenn Sie 3D-Schatten im Viewport rendern müssen, stellen Sie sicher, dass Sie die Property :ref:`positional_shadow_atlas_size<class_Viewport_property_positional_shadow_atlas_size>` des Viewports auf einen Wert größer als ``0`` setzen. Andernfalls werden die Schatten nicht gerendert. Standardmäßig ist die entsprechende Projekteinstellung auf ``4096`` auf Desktop-Plattformen und ``2048`` auf mobilen Plattformen gesetzt.

source: Godot also provides a way of customizing how everything is drawn inside :ref:`Viewports <class_Viewport>` using :ref:`Debug Draw<class_Viewport_property_debug_draw>`. Debug Draw allows you to specify a mode which determines how the Viewport will display things drawn inside it. Debug Draw is ``Disabled`` by default. Some other options are ``Unshaded``, ``Overdraw``, and ``Wireframe``. For a full list, refer to the :ref:`Viewport Documentation<class_Viewport_property_debug_draw>`.
de: Godot bietet auch eine Möglichkeit, die Art und Weise, wie alles in :ref:`Viewports <class_Viewport>` gezeichnet wird, mit :ref:`Debug Draw<class_Viewport_property_debug_draw>` anzupassen. Debug Draw erlaubt es, einen Modus zu spezifizieren, der bestimmt, wie das Viewport Dinge, die darin gezeichnet werden, anzeigt. Debug Draw ist standardmäßig ``Deactivated``. Einige andere Optionen sind ``Unshaded``, ``Overdraw``, und ``Wireframe``. Eine vollständige Liste finden Sie in der :ref:`Viewport Dokumentation<class_Viewport_property_debug_draw>`.

source: **Debug Draw = Disabled** (default): The scene is drawn normally.
de: **Debug Draw = Disabled** (Default): Die Szene wird normal gezeichnet.

source: **Debug Draw = Unshaded**: Unshaded draws the scene without using lighting information so all the objects appear flatly colored in their albedo color.
de: **Debug Draw = Unshaded**: Unshaded zeichnet die Szene ohne Beleuchtungsinformationen, so dass alle Objekte flach in ihrer Albedo-Farbe erscheinen.

source: **Debug Draw = Overdraw**: Overdraw draws the meshes semi-transparent with an additive blend so you can see how the meshes overlap.
de: **Debug Draw = Overdraw**: Overdraw zeichnet die Meshes halbtransparent mit additivem Blending, damit Sie sehen können, wie sich die Meshes überlappen.

source: **Debug Draw = Wireframe**: Wireframe draws the scene using only the edges of triangles in the meshes.
de: **Debug Draw = Wireframe**: Wireframe zeichnet die Szene nur mit den Kanten der Dreiecke in den Meshes.

source: Debug Draw modes are currently **not** supported when using the Compatibility rendering method. They will appear as regular draw modes.
de: Debug-Zeichenmodi werden derzeit **nicht** unterstützt, wenn die Kompatibilität-Rendermethode verwendet wird. Sie werden als normale Zeichenmodi angezeigt.

source: When rendering to a :ref:`SubViewport <class_SubViewport>`, whatever is inside will not be visible in the scene editor. To display the contents, you have to draw the SubViewport's :ref:`ViewportTexture <class_ViewportTexture>` somewhere. This can be requested via code using (for example):
de: Wenn man in ein :ref:`SubViewport <class_SubViewport>` rendert, ist der Inhalt im Szeneneditor nicht sichtbar. Um den Inhalt anzuzeigen, muss man irgendwo die :ref:`ViewportTexture <class_ViewportTexture>` des SubViewports zeichnen. Dies kann per Code angefordert werden, indem man (zum Beispiel):

source: Or it can be assigned in the editor by selecting "New ViewportTexture"
de: Oder sie kann im Editor durch Auswahl von "Neu: ViewportTexture" zugewiesen werden

source: and then selecting the :ref:`Viewport <class_Viewport>` you want to use.
de: und dann durch Auswahl des :ref:`Viewport <class_Viewport>`, den Sie verwenden möchten.

source: Every frame, the :ref:`Viewport's <class_Viewport>` texture is cleared away with the default clear color (or a transparent color if :ref:`Transparent BG<class_Viewport_property_transparent_bg>` is set to ``true``). This can be changed by setting :ref:`Clear Mode<class_SubViewport_property_render_target_clear_mode>` to ``Never`` or ``Next Frame``. As the name implies, Never means the texture will never be cleared, while next frame will clear the texture on the next frame and then set itself to Never.
de: In jedem Frame wird die Textur des :ref:`Viewport's <class_Viewport>` mit der Standard-Clear-Farbe geleert (oder einer transparenten Farbe, wenn :ref:`Transparent BG<class_Viewport_property_transparent_bg>` auf ``true`` gesetzt ist). Dies kann geändert werden, indem man :ref:`Clear Mode<class_SubViewport_property_render_target_clear_mode>` auf ``Never`` oder ``Next Frame`` setzt. Wie der Name schon sagt, bedeutet "Never", dass die Textur nie gelöscht wird, während "Next Frame" die Textur im nächsten Frame löscht und sich dann auf "Never" setzt.
