Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/viewports.po
Languages: de

source: By default, re-rendering of the :ref:`SubViewport <class_SubViewport>` happens when its :ref:`ViewportTexture <class_ViewportTexture>` has been drawn in a frame. If visible, it will be rendered, otherwise, it will not. This behavior can be changed by setting :ref:`Update Mode<class_SubViewport_property_render_target_update_mode>` to ``Never``, ``Once``, ``Always``, or ``When Parent Visible``. Never and Always will never or always re-render respectively. Once will re-render the next frame and change to Never afterwards. This can be used to manually update the Viewport. This flexibility allows users to render an image once and then use the texture without incurring the cost of rendering every frame.
de: Standardmäßig wird das :ref:`SubViewport <class_SubViewport>` neu gerendert, wenn seine :ref:`ViewportTexture <class_ViewportTexture>` in einem Frame gezeichnet wurde. Wenn er sichtbar ist, wird er gerendert, andernfalls wird er nicht gerendert. Dieses Verhalten kann durch Setzen von :ref:`Update Mode<class_SubViewport_property_render_target_update_mode>` auf ``Never``, ``Once``, ``Always``, oder ``When Parent Visible`` geändert werden. Never und Always werden nie bzw. immer neu gerendert. Once wird im nächsten Frame neu gerendert und wechselt danach zu Never. Dies kann verwendet werden, um das Ansichtsfenster manuell zu aktualisieren. Diese Flexibilität ermöglicht es dem Benutzer, ein Bild einmal zu rendern und dann die Textur zu verwenden, ohne dass die Kosten für das Rendern jedes Frames anfallen.

source: Make sure to check the Viewport demos. They are available in the viewport folder of the demos archive, or at https://github.com/godotengine/godot-demo-projects/tree/master/viewport.
de: Sehen Sie sich unbedingt die Viewport-Demos an. Sie sind im Viewport-Ordner des Demos-Archivs oder unter https://github.com/godotengine/godot-demo-projects/tree/master/viewport verfügbar.

source: Translation status
de: Übersetzungsstatus
