Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/collision_shapes_3d.po
Languages: de, zh_tw

source: Collision shapes (3D)
de: Kollisions-Shapes (3D)
zh_tw: 碰撞形體

source: This guide explains:
de: Diese Anleitung erklärt:
zh_tw: 本指南解釋：

source: The types of collision shapes available in 3D in Godot.
de: Die in Godot in 3D verfügbaren Kollisions-Shapes.
zh_tw: Godot 3D 中可用的碰撞形狀型別。

source: Using a convex or a concave mesh as a collision shape.
de: Verwendung eines konvexen oder konkaven Mesh als Kollisions-Shape.
zh_tw: 使用凸形或凹形網格作為碰撞形狀.

source: Performance considerations regarding 3D collisions.
de: Performance-Überlegungen zu 3D-Kollisionen.
zh_tw: 執行效能偵測

source: Godot provides many kinds of collision shapes, with different performance and accuracy tradeoffs.
de: Godot bietet viele Arten von Kollisions-Shapes mit unterschiedlichen Kompromissen zwischen Performance und Genauigkeit.
zh_tw: Godot提供多種碰撞形狀, 具有不同的性能和精度權衡.

source: You can define the shape of a :ref:`class_PhysicsBody3D` by adding one or more :ref:`CollisionShape3Ds <class_CollisionShape3D>` as child nodes. Note that you must add a :ref:`class_Shape3D` *resource* to collision shape nodes in the Inspector dock.
de: Sie können die Shape eines :ref:`class_PhysicsBody3D` definieren, indem Sie einen oder mehrere :ref:`CollisionShape3Ds <class_CollisionShape3D>` als untergeordnete Nodes hinzufügen. Beachten Sie, dass Sie eine :ref:`class_Shape3D`-*Ressource* zu Kollisions-Shape-Nodes im Inspector Dock hinzufügen müssen.
zh_tw: 您可以通過新增一個或多個 :ref:`class_PhysicsBody` 作為子節點來定義 :ref:`CollisionShapes <class_CollisionShape>` 的形狀。請注意，你必須在屬性面板面板中為碰撞形狀節點新增一個 :ref:`class_Shape` *資源*。

source: When you add multiple collision shapes to a single PhysicsBody, you don't have to worry about them overlapping. They won't "collide" with each other.
de: Wenn Sie mehrere Kollisions-Shapes zu einem einzelnen PhysicsBody hinzufügen, müssen Sie sich keine Sorgen machen, dass sie sich überlappen. Sie werden nicht miteinander "kollidieren".
zh_tw: 當你將多個碰撞形狀新增到一個PhysicsBody中時, 你不必擔心它們會重疊, 它們不會相互 "碰撞".

source: Primitive collision shapes
de: Primitive Kollisions-Shapes
zh_tw: 顯示碰撞區域

source: Godot provides the following primitive collision shape types:
de: Godot bietet die folgenden primitiven Kollisions-Shape-Typen:
zh_tw: Godot 可匯入下列圖片格式：

source: :ref:`class_BoxShape3D`
zh_tw: :ref:`Basis <class_Basis>`

source: :ref:`class_SphereShape3D`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`class_CapsuleShape3D`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`class_CylinderShape3D`
zh_tw: :ref:`Plane <class_Plane>`

source: You can represent the collision of most smaller objects using one or more primitive shapes. However, for more complex objects, such as a large ship or a whole level, you may need convex or concave shapes instead. More on that below.
de: Sie können die Kollision der meisten kleineren Objekte mit einer oder mehreren einfachen Shapes darstellen. Für komplexere Objekte wie ein großes Schiff oder eine ganze Ebene benötigen Sie möglicherweise stattdessen konvexe oder konkave Shapes. Mehr dazu weiter unten.
zh_tw: 您可以使用一個或多個原始形狀來表示大多數較小物體的碰撞. 然而, 對於更複雜的物體, 如大型船舶或整個水平面, 你可能需要凸形或凹形來代替. 下面會有更多的介紹.

source: Convex collision shapes
de: Konvexe Kollisions-Shapes
zh_tw: 碰撞形體

source: :ref:`Convex collision shapes <class_ConvexPolygonShape3D>` are a compromise between primitive collision shapes and concave collision shapes. They can represent shapes of any complexity, but with an important caveat. As their name implies, an individual shape can only represent a *convex* shape. For instance, a pyramid is *convex*, but a hollow box is *concave*. To define a concave object with a single collision shape, you need to use a concave collision shape.
de: :ref:`Konvexe Kollisions-Shapes <class_ConvexPolygonShape3D>` sind ein Kompromiss zwischen primitiven Kollisions-Shapes und konkaven Kollisions-Shapes. Sie können Shapes jeglicher Komplexität darstellen, allerdings mit einem wichtigen Vorbehalt. Wie ihr Name schon sagt, kann eine einzelne Shape nur eine *konvexe* Shape darstellen. Eine Pyramide ist zum Beispiel *konvex*, aber ein hohler Kasten ist *konkav*. Um ein konkaves Objekt mit einer einzelnen Kollisions-Shape zu definieren, müssen Sie eine konkave Kollisions-Shape verwenden.
zh_tw: :ref:`凸形碰撞形狀 <class_ConvexPolygonShape>` 是基礎碰撞形狀和凹形碰撞形狀之間的折衷, 可以表示任何複雜的形狀, 但要警告的是, 正如名稱所示, 一個單獨的形狀只能表示一個 *凸* 的形狀. 要用單個碰撞形狀定義一個凹形物件, 需要使用一個凹形碰撞形狀. 例如, 一個金字塔是 *凸* 的, 但一個空心盒子是 *凹* 的.

source: Depending on the object's complexity, you may get better performance by using multiple convex shapes instead of a concave collision shape. Godot lets you use *convex decomposition* to generate convex shapes that roughly match a hollow object. Note this performance advantage no longer applies after a certain amount of convex shapes. For large and complex objects such as a whole level, we recommend using concave shapes instead.
de: Je nach Komplexität des Objekts können Sie eine bessere Performance erzielen, wenn Sie mehrere konvexe Shapes anstelle eines konkaven Kollisions-Shape verwenden. Mit Godot können Sie *konvexe Zerlegung* verwenden, um konvexe Shapes zu erzeugen, die in etwa einem hohlen Objekt entsprechen. Beachten Sie, dass dieser Performance-Vorteil ab einer bestimmten Anzahl von konvexen Shapes nicht mehr gilt. Für große und komplexe Objekte, wie z. B. eine ganze Ebene, empfehlen wir, stattdessen konkave Shapes zu verwenden.
zh_tw: 根據物件的複雜程度, 可能要通過使用多個凸形而不是一個凹形碰撞形狀來獲得更好的性能.Godot可以使用 *凸分解* 來生成與空心物體大致配對的凸形. 請注意, 在一定數量的凸形之後, 就沒有了這種性能優勢, 對於大而複雜的物件, 如整個關卡, 建議使用凹形代替.

source: You can generate one or several convex collision shapes from the editor by selecting a MeshInstance3D and using the **Mesh** menu at the top of the 3D viewport. The editor exposes two generation modes:
de: Sie können eine oder mehrere konvexe Kollisions-Shapes aus dem Editor erzeugen, indem Sie eine MeshInstance3D auswählen und das Menü **Mesh** oben im 3D Viewport verwenden. Der Editor verfügt über zwei Generierungsmodi:
zh_tw: 您可以通過選擇一個網格實例, 並使用3D視圖頂部的 **網格** 功能表從編輯器中生成一個或多個凸形碰撞形狀. 編輯器有兩種生成模式:

source: **Create Single Convex Collision Sibling** uses the Quickhull algorithm. It creates one CollisionShape node with an automatically generated convex collision shape. Since it only generates a single shape, it provides good performance and is ideal for small objects.
de: **Einfachen konvexen Kollisionsnachbarn erzeugen** verwendet den Quickhull-Algorithmus. Er erzeugt einen CollisionShape-Node mit einer automatisch generierten konvexen Kollisions-Shape. Da er nur eine einzige Shape erzeugt, bietet er eine gute Performance und ist ideal für kleine Objekte.
zh_tw: **建立單凸碰撞同級** 使用Quickhull演算法, 建立一個CollisionShape碰撞形狀節點, 並自動生成一個凸碰撞形狀, 由於只生成單個形狀, 因此提供了良好的性能, 非常適合小物件.

source: **Create Multiple Convex Collision Siblings** uses the V-HACD algorithm. It creates several CollisionShape nodes, each with a convex shape. Since it generates multiple shapes, it is more accurate for concave objects at the cost of performance. For objects with medium complexity, it will likely be faster than using a single concave collision shape.
de: **Mehrere konvexe Kollisionsnachbarn erstellen** verwendet den V-HACD-Algorithmus. Er erzeugt mehrere CollisionShape-Nodes, jeder mit einer konvexen Shape. Da er mehrere Shapes erzeugt, ist er bei konkaven Objekten genauer, geht aber auf Kosten der Performance. Bei Objekten mit mittlerer Komplexität ist er wahrscheinlich schneller als die Verwendung einer einzelnen konkaven Shape.
zh_tw: **建立多個凸形碰撞同級** 使用V-HACD演算法. 建立多個CollisionShape碰撞形狀節點, 每個節點都有一個凸形, 由於它能生成多個形狀, 所以對於凹形物體來說, 精度更高, 但性能不佳. 對於中等複雜度的物件, 可能會比使用單個凹形碰撞形狀更快.

source: Concave or trimesh collision shapes
de: Konkave oder Trimesh Kollisions-Shapes
zh_tw: 碰撞形體

source: Even though concave shapes offer the most accurate *collision*, contact reporting can be less precise than primitive shapes.
de: Auch wenn konkave Shapes die genauesten *Kollisionen* bieten, kann die Kontaktrückmeldung weniger präzise sein als bei primitiven Shapes.
zh_tw: 即使凹形提供了最準確的 *碰撞*, 但觸碰資訊的精度可能不如基礎形狀.

source: When not using GridMaps for level design, concave shapes are the best approach for a level's collision. That said, if your level has small details, you may want to exclude those from collision for performance and game feel. To do so, you can build a simplified collision mesh in a 3D modeler and have Godot generate a collision shape for it automatically. More on that below
de: Wenn Sie keine GridMaps für das Leveldesign verwenden, sind konkave Shapes der beste Ansatz für die Kollisionen in einem Level. Wenn Ihr Level jedoch kleine Details enthält, sollten Sie diese aus Gründen der Performance und des Spielgefühls von der Kollision ausschließen. Zu diesem Zweck können Sie ein vereinfachtes Kollisions-Mesh in einem 3D-Modellierer erstellen und Godot automatisch eine Kollisions-Shape dafür generieren lassen. Mehr dazu weiter unten
zh_tw: 當不使用網路地圖進行關卡設計時, 凹形是關卡碰撞的最佳方法, 也就是說, 如果關卡有一些小細節, 可能希望將這些細節排除碰撞之外, 以保證性能和遊戲體驗, 要做到這一點, 可以在3D建模中建立一個簡化的碰撞網格, 並讓Godot為其自動生成一個碰撞形狀. 下面會有更多的介紹

source: Note that unlike primitive and convex shapes, a concave collision shape doesn't have an actual "volume". You can place objects both *outside* of the shape as well as *inside*.
de: Beachten Sie, dass eine konkave Shape im Gegensatz zu primitiven und konvexen Shapes kein tatsächliches "Volumen" hat. Sie können Objekte sowohl *außerhalb* der Shape als auch *innerhalb* platzieren.
zh_tw: 請注意, 與基礎形狀和凸形狀不同, 凹形碰撞形狀沒有實際的 "體積", 既可以將物件放置在形狀的 *外側*, 也可以放置在 *內側*.

source: You can generate a concave collision shape from the editor by selecting a MeshInstance3D and using the **Mesh** menu at the top of the 3D viewport. The editor exposes two options:
de: Sie können eine konkave Shape aus dem Editor erzeugen, indem Sie eine MeshInstance3D auswählen und das Menü **Mesh** oben im 3D-Viewport verwenden. Der Editor bietet zwei Optionen an:
zh_tw: 選中一個網格實例，然後使用 3D 視口頂部的**網格**功能表就可以在編輯器中生成一個凹形碰撞形狀。編輯器提供了兩個選項：

source: **Create Trimesh Static Body** is a convenient option. It creates a StaticBody containing a concave shape matching the mesh's geometry.
de: **Trimesh-Static Body erzeugen** ist eine komfortable Option. Sie erzeugt einen StaticBody mit einer konkaven Form, die der Geometrie des Meshes entspricht.
zh_tw: 建立三網格靜態體是個方便的選擇. 它建立一個包含與網格幾何學配對的凹形的靜態體.

source: **Create Trimesh Collision Sibling** creates a CollisionShape node with a concave shape matching the mesh's geometry.
de: **Trimesh Kollisions-Nachbarn erzeugen** erstellt einen CollisionShape-Node mit einer konkaven Form, die der Geometrie des Meshs entspricht.
zh_tw: **建立Trimesh(三角面)碰撞同級** 建立具有與網格幾何體配對的凹面形狀的CollisionShape(碰撞形狀)節點.

source: See :ref:`doc_importing_3d_scenes` for information on how to export models for Godot and automatically generate collision shapes on import.
de: Siehe :ref:`doc_importing_3d_scenes` für Informationen darüber, wie man Modelle für Godot exportiert und beim Import automatisch Shapes für Kollisionen erzeugt.
zh_tw: 有關如何匯出 Godot 模型並在匯入時自動產生碰撞形狀的信息，請參閱 doc_importing_3d_scenes`。

source: Performance caveats
de: Performance-Hinweise
zh_tw: 效能

source: When using a single non-transformed collision shape in a StaticBody, the engine's *broad phase* algorithm can discard inactive PhysicsBodies. The *narrow phase* will then only have to take into account the active bodies' shapes. If a StaticBody has many collision shapes, the broad phase will fail. The narrow phase, which is slower, must then perform a collision check against each shape.
de: Bei Verwendung eines einzigen nicht transformierten Kollisions-Shape in einem StaticBody kann der Algorithmus der *breiten Phase* der Engine inaktive PhysicsBodys verwerfen. Die *schmale Phase* muss dann nur noch die Shapes der aktiven Bodys berücksichtigen. Wenn ein StaticBody viele Kollisions-Shape hat, wird die breite Phase fehlschlagen. Die schmale Phase, die langsamer ist, muss dann für jeden Shape eine Kollisionsprüfung durchführen.
zh_tw: 在靜態體中使用單個非轉換碰撞形狀時, 引擎的寬相位演算法可以丟棄不活躍的物理體. 這個窄相只需考慮到活躍物體的形狀. 如果一個StaticBody有許多碰撞形狀, 那麼寬相位就會失敗. 較慢的窄相位必須對每個形狀執行碰撞檢查.

source: If you run into performance issues, you may have to make tradeoffs in terms of accuracy. Most games out there don't have a 100% accurate collision. They find creative ways to hide it or otherwise make it unnoticeable during normal gameplay.
de: Wenn Sie auf Performance-Probleme stoßen, müssen Sie möglicherweise Abstriche bei der Genauigkeit machen. Bei den meisten Spielen gibt es keine 100% genaue Kollision. Sie finden kreative Wege, um sie zu verstecken oder anderweitig während des normalen Spielverlaufs unbemerkbar zu machen.
zh_tw: 如果遇到性能問題, 您可能需要在準確性方面進行權衡. 大多數遊戲都沒有100%的精確碰撞. 他們找到了一些創造性的方法來隱藏它, 或者在正常的遊戲中讓它變得不讓人注意.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: We recommend favoring primitive shapes for dynamic objects such as RigidBodies and CharacterBodies as their behavior is the most reliable. They often provide better performance as well.
de: Wir empfehlen, primitive Shapes für dynamische Objekte wie RigidBodys und CharacterBodys zu bevorzugen, da ihr Verhalten am zuverlässigsten ist. Außerdem bieten sie oft eine bessere Performance.

source: :ref:`Concave collision shapes <class_ConcavePolygonShape3D>`, also called trimesh collision shapes, can take any form, from a few triangles to thousands of triangles. Concave shapes are the slowest option but are also the most accurate in Godot. **You can only use concave shapes within StaticBodies.** They will not work with CharacterBodies or RigidBodies unless the RigidBody's mode is Static.
de: :ref:`Konkave Kollisions-Shapes <class_ConcavePolygonShape3D>`, auch Trimesh-Kollisions-Shapes genannt, können jede Form annehmen, von ein paar Dreiecken bis zu Tausenden von Dreiecken. Konkave Shapes sind die langsamste Option, aber auch die genaueste in Godot. **Konkave Shapes können nur innerhalb von StaticBodys verwendet werden.** Sie funktionieren nicht mit CharacterBodys oder RigidBodys, es sei denn, der Modus des RigidBody ist Statisch.

source: You aren't limited to a single collision shape per PhysicsBody. Still, we recommend keeping the number of shapes as low as possible to improve performance, especially for dynamic objects like RigidBodies and CharacterBodies. On top of that, avoid translating, rotating, or scaling CollisionShapes to benefit from the physics engine's internal optimizations.
de: Sie sind nicht auf einen einzigen Kollisions-Shape pro PhysicsBody beschränkt. Dennoch empfehlen wir, die Anzahl der Shapes so gering wie möglich zu halten, um die Performance zu verbessern, insbesondere für dynamische Objekte wie RigidBodys und CharacterBodys. Vermeiden Sie außerdem das Verschieben, Drehen oder Skalieren von CollisionShapes, um von den internen Optimierungen der Physik-Engine zu profitieren.
