Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/collision_shapes_2d.po
Languages: de, zh_tw

source: Collision shapes (2D)
zh_tw: 碰撞形體

source: This guide explains:
de: Diese Anleitung erklärt:
zh_tw: 本指南解釋：

source: The types of collision shapes available in 2D in Godot.
de: Die in Godot in 2D verfügbaren Arten von Collision Shapes.
zh_tw: Godot 3D 中可用的碰撞形狀型別。

source: Using an image converted to a polygon as a collision shape.
de: Verwendung eines in ein Polygon konvertierten Bildes als Kollisions-Shape.
zh_tw: 使用凸形或凹形網格作為碰撞形狀.

source: Performance considerations regarding 2D collisions.
de: Performance-Überlegungen zu 2D-Kollisionen.
zh_tw: 執行效能偵測

source: Godot provides many kinds of collision shapes, with different performance and accuracy tradeoffs.
de: Godot bietet viele Arten von Kollisions-Shapes mit unterschiedlichen Kompromissen zwischen Performance und Genauigkeit.
zh_tw: Godot提供多種碰撞形狀, 具有不同的性能和精度權衡.

source: You can define the shape of a :ref:`class_PhysicsBody2D` by adding one or more :ref:`CollisionShape2Ds <class_CollisionShape2D>` or :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` as child nodes. Note that you must add a :ref:`class_Shape2D` *resource* to collision shape nodes in the Inspector dock.
de: Sie können die Shape eines :ref:`class_PhysicsBody2D` definieren, indem Sie ein oder mehrere :ref:`CollisionShape2Ds <class_CollisionShape2D>` oder :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` als Child-Nodes hinzufügen. Beachten Sie, dass Sie eine :ref:`class_Shape2D` *Ressource* zu Kollisions-Shape-Nodes im Inspektor-Dock hinzufügen müssen.
zh_tw: 您可以通過新增一個或多個 :ref:`class_PhysicsBody` 作為子節點來定義 :ref:`CollisionShapes <class_CollisionShape>` 的形狀。請注意，你必須在屬性面板面板中為碰撞形狀節點新增一個 :ref:`class_Shape` *資源*。

source: When you add multiple collision shapes to a single PhysicsBody2D, you don't have to worry about them overlapping. They won't "collide" with each other.
de: Wenn Sie mehrere Kollisions-Shapes zu einem einzelnen PhysicsBody2D hinzufügen, müssen Sie sich keine Sorgen machen, dass sie sich überlappen. Sie werden nicht miteinander "kollidieren".
zh_tw: 當你將多個碰撞形狀新增到一個PhysicsBody中時, 你不必擔心它們會重疊, 它們不會相互 "碰撞".

source: Primitive collision shapes
de: Primitive Kollisions-Shapes
zh_tw: 顯示碰撞區域

source: Godot provides the following primitive collision shape types:
de: Godot bietet die folgenden primitiven Kollisions-Shape-Typen:
zh_tw: Godot 可匯入下列圖片格式：

source: :ref:`class_RectangleShape2D`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`class_CircleShape2D`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`class_CapsuleShape2D`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`class_SegmentShape2D`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`class_SeparationRayShape2D` (designed for characters)
de: :ref:`class_SeparationRayShape2D` (entworfen für Charaktere)
zh_tw: :ref:`class_SeparationRayShape2D` （專為角色設計）

source: :ref:`class_WorldBoundaryShape2D` (infinite plane)
de: :ref:`class_WorldBoundaryShape2D` (unendliche Ebene)
zh_tw: :ref:`class_WorldBoundaryShape2D`（無限平面）

source: You can represent the collision of most smaller objects using one or more primitive shapes. However, for more complex objects, such as a large ship or a whole level, you may need convex or concave shapes instead. More on that below.
de: Sie können die Kollision der meisten kleineren Objekte mit einer oder mehreren einfachen Shapes darstellen. Für komplexere Objekte wie ein großes Schiff oder eine ganze Ebene benötigen Sie möglicherweise stattdessen konvexe oder konkave Shapes. Mehr dazu weiter unten.
zh_tw: 您可以使用一個或多個原始形狀來表示大多數較小物體的碰撞. 然而, 對於更複雜的物體, 如大型船舶或整個水平面, 你可能需要凸形或凹形來代替. 下面會有更多的介紹.

source: Convex collision shapes
de: Konvexe Kollisions-Shapes
zh_tw: 碰撞形體

source: Godot currently doesn't offer a built-in way to create 2D convex collision shapes. This section is mainly here for reference purposes.
de: Godot bietet derzeit keine fest integrierte Möglichkeit, 2D konvexe Kollisions-Shapes zu erstellen. Dieser Abschnitt dient hauptsächlich zu Referenzzwecken.
zh_tw: Godot 目前不提供建立 2D 凸碰撞形狀的內建方法。這一部分主要是為了參考。

source: :ref:`Convex collision shapes <class_ConvexPolygonShape2D>` are a compromise between primitive collision shapes and concave collision shapes. They can represent shapes of any complexity, but with an important caveat. As their name implies, an individual shape can only represent a *convex* shape. For instance, a pyramid is *convex*, but a hollow box is *concave*. To define a concave object with a single collision shape, you need to use a concave collision shape.
de: :ref:`Konvexe Kollisions-Shapes <class_ConvexPolygonShape2D>` sind ein Kompromiss zwischen primitiven Kollisions-Shapes und konkaven Kollisions-Shapes. Sie können Shapes jeglicher Komplexität darstellen, allerdings mit einer wichtigen Einschränkung. Wie ihr Name schon sagt, kann ein einzelner Shape nur eine *konvexe* Form darstellen. Eine Pyramide ist zum Beispiel *konvex*, aber ein hohler Kasten ist *konkav*. Um ein konkaves Objekt mit einem einzelnen Kollisions-Shape zu definieren, müssen Sie ein konkaves Kollisions-Shape verwenden.
zh_tw: :ref:`凸形碰撞形狀 <class_ConvexPolygonShape>` 是基礎碰撞形狀和凹形碰撞形狀之間的折衷, 可以表示任何複雜的形狀, 但要警告的是, 正如名稱所示, 一個單獨的形狀只能表示一個 *凸* 的形狀. 要用單個碰撞形狀定義一個凹形物件, 需要使用一個凹形碰撞形狀. 例如, 一個金字塔是 *凸* 的, 但一個空心盒子是 *凹* 的.

source: Depending on the object's complexity, you may get better performance by using multiple convex shapes instead of a concave collision shape. Godot lets you use *convex decomposition* to generate convex shapes that roughly match a hollow object. Note this performance advantage no longer applies after a certain amount of convex shapes. For large and complex objects such as a whole level, we recommend using concave shapes instead.
de: Je nach Komplexität des Objekts können Sie eine bessere Performance erzielen, wenn Sie mehrere konvexe Shapes anstelle eines konkaven Kollisions-Shape verwenden. Mit Godot können Sie *konvexe Zerlegung* verwenden, um konvexe Shapes zu erzeugen, die in etwa einem hohlen Objekt entsprechen. Beachten Sie, dass dieser Performance-Vorteil ab einer bestimmten Anzahl von konvexen Shapes nicht mehr gilt. Für große und komplexe Objekte, wie z. B. eine ganze Ebene, empfehlen wir, stattdessen konkave Shapes zu verwenden.
zh_tw: 根據物件的複雜程度, 可能要通過使用多個凸形而不是一個凹形碰撞形狀來獲得更好的性能.Godot可以使用 *凸分解* 來生成與空心物體大致配對的凸形. 請注意, 在一定數量的凸形之後, 就沒有了這種性能優勢, 對於大而複雜的物件, 如整個關卡, 建議使用凹形代替.

source: Concave or trimesh collision shapes
de: Konkave oder Trimesh Kollisions-Shapes
zh_tw: 碰撞形體

source: Even though concave shapes offer the most accurate *collision*, contact reporting can be less precise than primitive shapes.
de: Auch wenn konkave Shapes die genauesten *Kollisionen* bieten, kann die Kontaktrückmeldung weniger präzise sein als bei primitiven Shapes.
zh_tw: 即使凹形提供了最準確的 *碰撞*, 但觸碰資訊的精度可能不如基礎形狀.

source: When not using TileMaps for level design, concave shapes are the best approach for a level's collision.
de: Wenn Sie keine TileMaps für das Leveldesign verwenden, sind konkave Shapes der beste Ansatz für die Kollisionen in einem Level.
zh_tw: 當不使用 TileMap 進行關卡設計時，凹形是關卡碰撞的最佳方法。

source: You can configure the CollisionPolygon2D node's *build mode* in the inspector. If it is set to **Solids** (the default), collisions will include the polygon and its contained area. If it is set to **Segments**, collisions will only include the polygon edges.
de: Sie können den *Baumodus* des CollisionPolygon2D-Nodes im Inspektor konfigurieren. Wenn er auf **Solids** (Standardeinstellung) eingestellt ist, umfassen die Kollisionen das Polygon und den darin enthaltenen Bereich. Wenn er auf **Segmente** eingestellt ist, umfassen Kollisionen nur die Polygonkanten.
zh_tw: 您可以在屬性面板中設定 CollisionPolygon2D 節點的*建置模式*。如果將其設為 **Solids**（預設值），則碰撞將包括多邊形及其包含的區域。如果將其設為 **Segments**，則碰撞將僅包括多邊形邊緣。

source: You can generate a concave collision shape from the editor by selecting a Sprite2D and using the **Sprite2D** menu at the top of the 2D viewport. The Sprite2D menu dropdown exposes an option called **Create CollisionPolygon2D Sibling**. Once you click it, it displays a menu with 3 settings:
de: Sie können eine konkave Kollisions-Shape aus dem Editor erzeugen, indem Sie ein Sprite2D auswählen und das Menü **Sprite2D** oben im 2D-Viewport verwenden. Die Dropdown-Liste des Sprite2D-Menüs enthält eine Option namens **CollisionPolygon2D-Nachbar erstellen**. Sobald Sie darauf klicken, wird ein Menü mit 3 Einstellungen angezeigt:
zh_tw: 選中一個網格實例，然後使用 3D 視口頂部的**網格**功能表就可以在編輯器中生成一個凹形碰撞形狀。編輯器提供了兩個選項：

source: **Simplification:** Higher values will result in a less detailed shape, which improves performance at the cost of accuracy.
de: **Vereinfachung:** Höhere Werte führen zu einem weniger detaillierten Shape, was die Performance auf Kosten der Genauigkeit verbessert.
zh_tw: **簡化：** 較高的值將導致不太詳細的形狀，這會以犧牲準確性為代價提高性能。

source: **Shrink (Pixels):** Higher values will shrink the generated collision polygon relative to the sprite's edges.
de: **Schrumpfen (Pixel):** Höhere Werte schrumpfen das erzeugte Kollisionspolygon relativ zu den Kanten des Sprites.
zh_tw: **收縮（像素）：** 較高的值將相對於精靈的邊緣收縮所產生的碰撞多邊形。

source: **Grow (Pixels):** Higher values will grow the generated collision polygon relative to the sprite's edges. Note that setting Grow and Shrink to equal values may yield different results than leaving both of them on 0.
de: **Wachsen (Pixel):** Höhere Werte lassen das generierte Kollisionspolygon relativ zu den Sprite-Kanten wachsen. Beachten Sie, dass die Einstellung von Grow und Shrink auf gleiche Werte andere Ergebnisse liefern kann, als wenn Sie beide auf 0 lassen.
zh_tw: **成長（像素）：** 較高的值將使產生的碰撞多邊形相對於精靈的邊緣成長。請注意，將 Grow 和 Shrink 設為相等的值可能會產生與將它們都保留為 0 不同的結果。

source: If you have an image with many small details, it's recommended to create a simplified version and use it to generate the collision polygon. This can result in better performance and game feel, since the player won't be blocked by small, decorative details.
de: Wenn Sie ein Bild mit vielen kleinen Details haben, empfiehlt es sich, eine vereinfachte Version zu erstellen und diese zur Erzeugung des Kollisionspolygons zu verwenden. Dies kann zu einer besseren Performance und einem besseren Spielgefühl führen, da der Spieler nicht durch kleine, dekorative Details behindert wird.
zh_tw: 如果您的影像包含許多小細節，建議建立一個簡化版本並使用它來產生碰撞多邊形。這可以帶來更好的性能和遊戲感覺，因為玩家不會被小的裝飾性細節所阻擋。

source: To use a separate image for collision polygon generation, create another Sprite2D, generate a collision polygon sibling from it then remove the Sprite2D node. This way, you can exclude small details from the generated collision.
de: Um ein separates Bild für die Erzeugung von Kollisionspolygonen zu verwenden, erstellen Sie ein weiteres Sprite2D, erzeugen daraus ein Kollisionspolygon und entfernen dann den Sprite2D-Node. Auf diese Weise können Sie kleine Details von der generierten Kollision ausschließen.
zh_tw: 若要使用單獨的映像來產生碰撞多邊形，請建立另一個 Sprite2D，從中產生碰撞多邊形同級，然後刪除 Sprite2D 節點。這樣，您可以從生成的碰撞中排除小細節。

source: Performance caveats
de: Performance-Hinweise
zh_tw: 效能

source: When using a single non-transformed collision shape in a StaticBody, the engine's *broad phase* algorithm can discard inactive PhysicsBodies. The *narrow phase* will then only have to take into account the active bodies' shapes. If a StaticBody has many collision shapes, the broad phase will fail. The narrow phase, which is slower, must then perform a collision check against each shape.
de: Bei Verwendung eines einzigen nicht transformierten Kollisions-Shape in einem StaticBody kann der Algorithmus der *breiten Phase* der Engine inaktive PhysicsBodys verwerfen. Die *schmale Phase* muss dann nur noch die Shapes der aktiven Bodys berücksichtigen. Wenn ein StaticBody viele Kollisions-Shape hat, wird die breite Phase fehlschlagen. Die schmale Phase, die langsamer ist, muss dann für jeden Shape eine Kollisionsprüfung durchführen.
zh_tw: 在靜態體中使用單個非轉換碰撞形狀時, 引擎的寬相位演算法可以丟棄不活躍的物理體. 這個窄相只需考慮到活躍物體的形狀. 如果一個StaticBody有許多碰撞形狀, 那麼寬相位就會失敗. 較慢的窄相位必須對每個形狀執行碰撞檢查.

source: If you run into performance issues, you may have to make tradeoffs in terms of accuracy. Most games out there don't have a 100% accurate collision. They find creative ways to hide it or otherwise make it unnoticeable during normal gameplay.
de: Wenn Sie auf Performance-Probleme stoßen, müssen Sie möglicherweise Abstriche bei der Genauigkeit machen. Bei den meisten Spielen gibt es keine 100% genaue Kollision. Sie finden kreative Wege, um sie zu verstecken oder anderweitig während des normalen Spielverlaufs unbemerkbar zu machen.
zh_tw: 如果遇到性能問題, 您可能需要在準確性方面進行權衡. 大多數遊戲都沒有100%的精確碰撞. 他們找到了一些創造性的方法來隱藏它, 或者在正常的遊戲中讓它變得不讓人注意.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: We recommend favoring primitive shapes for dynamic objects such as RigidBodies and CharacterBodies as their behavior is the most reliable. They often provide better performance as well.
de: Wir empfehlen, primitive Shapes für dynamische Objekte wie RigidBodys und CharacterBodys zu bevorzugen, da ihr Verhalten am zuverlässigsten ist. Außerdem bieten sie oft eine bessere Performance.

source: :ref:`Concave collision shapes <class_ConcavePolygonShape2D>`, also called trimesh collision shapes, can take any form, from a few triangles to thousands of triangles. Concave shapes are the slowest option but are also the most accurate in Godot. **You can only use concave shapes within StaticBodies.** They will not work with CharacterBodies or RigidBodies unless the RigidBody's mode is Static.
de: :ref:`Konkave Kollisions-Shapes <class_ConcavePolygonShape2D>`, auch Trimesh-Kollisions-Shapes genannt, können jede Form annehmen, von wenigen Dreiecken bis zu Tausenden von Dreiecken. Konkave Shapes sind die langsamste Option, aber auch die genaueste in Godot. **Konkave Shapes können nur innerhalb von StaticBodys verwendet werden**. Sie funktionieren nicht mit CharacterBodys oder RigidBodys, es sei denn, der Modus des RigidBody ist Statisch.

source: You aren't limited to a single collision shape per PhysicsBody. Still, we recommend keeping the number of shapes as low as possible to improve performance, especially for dynamic objects like RigidBodies and CharacterBodies. On top of that, avoid translating, rotating, or scaling CollisionShapes to benefit from the physics engine's internal optimizations.
de: Sie sind nicht auf einen einzigen Kollisions-Shape pro PhysicsBody beschränkt. Dennoch empfehlen wir, die Anzahl der Shapes so gering wie möglich zu halten, um die Performance zu verbessern, insbesondere für dynamische Objekte wie RigidBodys und CharacterBodys. Vermeiden Sie außerdem das Verschieben, Drehen oder Skalieren von CollisionShapes, um von den internen Optimierungen der Physik-Engine zu profitieren.
