Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/physics_introduction.po
Languages: de, zh_tw

source: Physics introduction
de: Einführung in die Physik
zh_tw: 物理介紹

source: In game development, you often need to know when two objects in the game intersect or come into contact. This is known as **collision detection**. When a collision is detected, you typically want something to happen. This is known as **collision response**.
de: In der Spielentwicklung muss man oft wissen, ob sich zwei Objekte im Spiel berühren oder überlagern. Dies wird als **Kollisionserkennung** bezeichnet. Falls es zu solch einer Kollision kommt, soll normalerweise etwas passieren. Dies wird als **Kollisionsreaktion** bezeichnet.
zh_tw: 在遊戲開發領域，你常常會需要在遊戲中兩個物體相交或是接觸時得到提醒。這被稱為 **碰撞偵測(collision detection)**。當偵測到碰撞，你通常會想要讓某些事情發生。這被稱作**碰撞反應(collision response)**。

source: Godot offers a number of collision objects in 2D and 3D to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each works and what their pros and cons are.
de: Godot bietet eine Reihe von Kollisionsobjekten in 2D und 3D, um sowohl die Kollisionserkennung als auch die Reaktion darauf zu ermöglichen. Die Entscheidung, welches davon für Ihr Projekt verwendet werden soll, kann verwirrend sein. Sie können Probleme vermeiden und die Entwicklung vereinfachen, wenn Sie verstehen, wie jedes Objekt funktioniert und welche Vor- und Nachteile es hat.
zh_tw: Godot在2D和3D中提供了許多碰撞物件, 以提供碰撞偵測和回應. 你可能很難決定哪個適合你的專案. 一旦瞭解了每種方法的工作原理以及它們的優缺點, 你就可以避免出現問題並簡化開發過程.

source: In this guide, you will learn:
de: In dieser Anleitung lernen Sie:
zh_tw: 在本指南中，我們將學到：

source: Godot's four collision object types
de: Godots vier Arten von Kollisionsobjekten
zh_tw: Godot的四種碰撞對象型別

source: How each collision object works
de: Wie jedes Kollisionsobjekt funktioniert
zh_tw: 每個碰撞物件的工作原理

source: When and why to choose one type over another
de: Wann und warum man sich für einen Typ entscheidet
zh_tw: 何時以及為何選擇這種型別而不是另一種型別

source: This document's examples will use 2D objects. Every 2D physics object and collision shape has a direct equivalent in 3D and in most cases they work in much the same way.
de: In den Beispielen dieses Dokuments werden 2D-Objekte verwendet. Jedes 2D-Physikobjekt und jede Collision Shape hat ein direktes Äquivalent in 3D und funktioniert in den meisten Fällen auf die gleiche Weise.
zh_tw: 本文件的範例將使用2D物件. 每個2D物理物件和碰撞形狀在3D中具有直接等價物, 並且在大多數情況下它們以相同的方式工作.

source: Collision objects
de: Kollisionsobjekte
zh_tw: 碰撞物體

source: Godot offers four kinds of collision objects which all extend :ref:`CollisionObject2D <class_CollisionObject2D>`. The last three listed below are physics bodies and additionally extend :ref:`PhysicsBody2D <class_PhysicsBody2D>`.
de: Godot bietet vier Arten von Kollisionsobjekten, die alle :ref:`CollisionObject2D <class_CollisionObject2D>` erweitern. Die letzten drei unten aufgeführten sind Physik-Bodys und erweitern zusätzlich :ref:`PhysicsBody2D <class_PhysicsBody2D>`.
zh_tw: Godot 提供了四個碰撞對象，它們都擴充了:ref:`CollisionObject2D <class_CollisionObject2D>`。以下列出的最後三個是物理體，也擴充了 :ref:`PhysicsBody2D <class_PhysicsBody2D>`。

source: ``Area2D`` nodes provide **detection** and **influence**. They can detect when objects overlap and can emit signals when bodies enter or exit. An ``Area2D`` can also be used to override physics properties, such as gravity or damping, in a defined area.
de: ``Area2D``-Nodes bieten **Erkennung** und **Einfluss**. Sie können erkennen, wenn sich Objekte überlappen, und Signale ausgeben, wenn Bodys den Bereich betreten oder verlassen. Eine ``Area2D`` kann auch verwendet werden, um physikalische Eigenschaften wie Schwerkraft oder Dämpfung in einem definierten Bereich zu umgehen.
zh_tw: ``Area2D`` 節點提供 **偵測** 和 **影響** . 它們可以偵測物體何時重疊, 並在物體進入或離開時發出訊號. ``Area2D`` 也可用於覆蓋物理屬性, 例如一定區域內的重力或阻尼.

source: A static body is one that is not moved by the physics engine. It participates in collision detection, but does not move in response to the collision. They are most often used for objects that are part of the environment or that do not need to have any dynamic behavior.
de: Ein Static Body wird nicht von der Physik-Engine bewegt. Es nimmt an der Kollisionserkennung teil, bewegt sich jedoch nicht als Reaktion auf die Kollision. Sie werden am häufigsten für Objekte verwendet, die Teil der Umgebung sind oder kein dynamisches Verhalten benötigen.
zh_tw: 靜態主體是物理引擎不移動的主體. 它參與碰撞偵測, 但不會回應碰撞而移動. 它們通常用於屬於環境的物件或不需要任何動態行為的物件.

source: This is the node that implements simulated 2D physics. You do not control a ``RigidBody2D`` directly, but instead you apply forces to it (gravity, impulses, etc.) and the physics engine calculates the resulting movement. :ref:`Read more about using rigid bodies. <doc_rigid_body>`
de: Dies ist der Node, der simulierte 2D-Physik implementiert. Sie steuern einen ``RigidBody2D`` nicht direkt, sondern üben stattdessen Kräfte auf ihn aus (Schwerkraft, Impulse usw.) und die Physik-Engine berechnet die resultierende Bewegung. :ref:`Lesen Sie mehr über die Verwendung von Rigid Bodys <doc_rigid_body>`
zh_tw: 這是實作類比2D物理的節點. 您不直接控制 ``RigidBody2D`` , 而是您對它施加力(重力, 衝動等), 物理引擎計算得到的運動. :ref:`閱讀更多關於使用剛體的資訊. <doc_rigid_body>`

source: :ref:`CharacterBody2D <class_CharacterBody2D>`
zh_tw: :ref:`Vector2 <class_Vector2>`

source: A body that provides collision detection, but no physics. All movement and collision response must be implemented in code.
de: Ein Body, der Kollisionserkennung bietet, aber keine Physik. Alle Bewegungs- und Kollisionsreaktionen müssen im Code implementiert sein.
zh_tw: 提供碰撞偵測的物體, 但沒有物理功能. 所有移動和碰撞回應必須在程式碼中實作.

source: Physics material
de: Physikmaterial
zh_tw: 物理屬性

source: Static bodies and rigid bodies can be configured to use a :ref:`PhysicsMaterial <class_PhysicsMaterial>`. This allows adjusting the friction and bounce of an object, and set if it's absorbent and/or rough.
de: Static Bodys und Rigid Bodys können so konfiguriert werden, dass sie ein :ref:`PhysicsMaterial <class_PhysicsMaterial>` verwenden. Dies erlaubt es, die Reibung und das Abprallen eines Objekts einzustellen und festzulegen, ob es absorbierend und/oder rau ist.
zh_tw: 靜態體和剛性體可以被配置為使用:ref:`物理材質 <class_PhysicsMaterial>`。這允許調整一個物體的摩擦力和反彈力，並設定它是否具有吸收性、粗糙性。

source: Collision shapes
zh_tw: 碰撞形體

source: A physics body can hold any number of :ref:`Shape2D <class_Shape2D>` objects as children. These shapes are used to define the object's collision bounds and to detect contact with other objects.
de: Ein Physik-Body kann eine beliebige Anzahl von :ref:`Shape2D <class_Shape2D>`-Objekten als Child-Objekte enthalten. Diese Shapes werden verwendet, um die Kollisionsgrenzen des Objekts zu definieren und den Kontakt mit anderen Objekten zu erkennen.
zh_tw: 物理體可以包含任意數量的 :ref:`Shape2D <class_Shape2D>` 對象作為子物件. 這些形狀用於定義物件的碰撞邊界並偵測與其他物件的接觸.

source: In order to detect collisions, at least one ``Shape2D`` must be assigned to the object.
de: Um Kollisionen zu erkennen, muss dem Objekt mindestens eine ``Shape2D`` zugewiesen werden.
zh_tw: 為了偵測碰撞, 必須至少為物件分配一個 ``Shape2D`` .

source: The most common way to assign a shape is by adding a :ref:`CollisionShape2D <class_CollisionShape2D>` or :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` as a child of the object. These nodes allow you to draw the shape directly in the editor workspace.
de: Die häufigste Methode zum Zuweisen einer Shape ist das Hinzufügen von :ref:`CollisionShape2D <class_CollisionShape2D>` oder :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` als Child des Objekt. Mit diesen Nodes können Sie die Shape direkt im Editor-Arbeitsbereich zeichnen.
zh_tw: 分配形狀的最常用方法是新增 :ref:`CollisionShape2D <class_CollisionShape2D>` 或 :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` 作為對象的子項. 這些節點允許您直接在編輯器工作區中繪製形狀.

source: Be careful to never scale your collision shapes in the editor. The "Scale" property in the Inspector should remain ``(1, 1)``. When changing the size of the collision shape, you should always use the size handles, **not** the ``Node2D`` scale handles. Scaling a shape can result in unexpected collision behavior.
de: Achten Sie darauf, Ihre Collision Shapes niemals im Editor zu skalieren. Die Eigenschaft "Skalierung" im Inspektor sollte ``(1, 1)`` bleiben. Wenn Sie die Größe der Collision Shape ändern, sollten Sie immer die Größenregler verwenden und **nicht** die ``Node2D``-Skalenregler. Das Skalieren einer Shape kann zu unerwartetem Kollisionsverhalten führen.
zh_tw: 注意，不要在編輯器中縮放碰撞形狀。“屬性面板”中的“Scale”屬性應保持為 ``(1, 1)``。改變碰撞形狀的大小時，你應該使用尺寸控制柄，而**不是** ``Node2D`` 縮放控制柄。縮放形狀可能會導致意外的碰撞行為。

source: Physics process callback
de: Physikprozess-Callback
zh_tw: 物理過程回呼函式

source: The physics engine runs at a fixed rate (a default of 60 iterations per second). This rate is typically different from the frame rate which fluctuates based on what is rendered and available resources.
de: Die Physik-Engine läuft mit einer festen Rate (standardmäßig 60 Iterationen pro Sekunde). Diese Rate unterscheidet sich in der Regel von der Framerate, die je nach gerendertem Inhalt und verfügbaren Ressourcen schwankt.
zh_tw: 物理引擎以固定速率運作（預設為每秒 60 次迭代）。此速率通常不同於影格速率，影格速率根據算繪內容和可用資源而波動。

source: It is important that all physics related code runs at this fixed rate. Therefore Godot differentiates :ref:`between physics and idle processing <doc_idle_and_physics_processing>`. Code that runs each frame is called idle processing and code that runs on each physics tick is called physics processing. Godot provides two different callbacks, one for each of those processing rates.
de: Es ist wichtig, dass der gesamte physikbezogene Code mit dieser festen Rate läuft. Deshalb unterscheidet Godot :ref:`zwischen Physik- und Leerlaufverarbeitung <doc_idle_and_physics_processing>`. Code, der bei jedem Frame läuft, wird Leerlaufverarbeitung genannt und Code, der bei jedem Physik-Tick läuft, wird Physik-Verarbeitung genannt. Godot bietet zwei verschiedene Callbacks, einen für jede dieser Verarbeitungsraten.
zh_tw: 重要的是所有與物理相關的程式碼都以這個固定速率運作。因此，Godot 區分了物理處理和空閒處理 <doc_idle_and_physical_processing>`。運作每一影格的程式碼稱為空閒處理，在每個物理滴答上運作的程式碼稱為物理處理。 Godot 提供了兩種不同的回調，每種回調對應一種處理速率。

source: It's recommended to always use the ``delta`` parameter when relevant in your physics calculations, so that the game behaves correctly if you change the physics update rate or if the player's device can't keep up.
de: Es wird empfohlen immer den Parameter ``delta`` zu verwenden wenn dies für Ihre Physikberechnungen relevant ist, damit sich das Spiel korrekt verhält wenn Sie die Aktualisierungsrate der Physik ändern oder wenn das Gerät des Spielers nicht mithalten kann.
zh_tw: 建議在物理計算中使用 ``delta`` 參數, 以便當您更改物理更新速率或玩家裝置跟不上時, 遊戲能夠正確運作.

source: Collision layers and masks
de: Kollisionsebenen und -masken
zh_tw: 碰撞層與遮罩

source: One of the most powerful, but frequently misunderstood, collision features is the collision layer system. This system allows you to build up complex interactions between a variety of objects. The key concepts are **layers** and **masks**. Each ``CollisionObject2D`` has 32 different physics layers it can interact with.
de: Eine der leistungsfähigsten, aber häufig missverstandenen Kollisionsfunktionen ist das System der Kollisionsebenen. Dieses System ermöglicht es Ihnen, komplexe Interaktionen zwischen einer Vielzahl von Objekten aufzubauen. Die Schlüsselkonzepte sind **Ebenen** und **Masken**. Jedes ``CollisionObject2D`` hat 32 verschiedene Physik-Ebenen, mit denen es interagieren kann.
zh_tw: 碰撞層系統是最強大但經常被誤解的碰撞功能之一。該系統允許您在各種物件之間建立複雜的互動。關鍵概念是**層**（Layer）和**遮罩**（Mask）。每個 ``CollisionObject2D`` 都有 20 個不同的實體層可以相互作用。

source: Let's look at each of the properties in turn:
de: Schauen wir uns nacheinander die einzelnen Propertys an:
zh_tw: 讓我們依次看看每個屬性：

source: This describes the layers that the object appears **in**. By default, all bodies are on layer ``1``.
de: Dies beschreibt die Ebenen, **in** denen das Objekt erscheint. Standardmäßig sind alle Objekte auf Ebene ``1``.
zh_tw: 表示該物件**位於**哪些層。預設情況下，所有實體都在圖層 ``1`` 上。

source: This describes what layers the body will **scan** for collisions. If an object isn't in one of the mask layers, the body will ignore it. By default, all bodies scan layer ``1``.
de: Dies beschreibt, welche Ebenen der Body auf Kollisionen **prüfen** wird. Wenn sich ein Objekt nicht in einer der Maskenebenen befindet, wird es vom Body ignoriert. Standardmäßig scannen alle Bodys die Ebene ``1``.
zh_tw: 表示該物件會對哪些層上的實體進行**掃描**。如果物件不在任何遮罩層中，則該實體將其忽略。預設情況下，所有實體都會掃描圖層 ``1``。

source: These properties can be configured via code, or by editing them in the Inspector.
de: Diese Eigenschaften können per Code oder im Inspektor konfiguriert werden.
zh_tw: 可以通過程式碼配置這些屬性，也可以在“屬性面板”中對其進行編輯。

source: Keeping track of what you're using each layer for can be difficult, so you may find it useful to assign names to the layers you're using. Names can be assigned in Project Settings -> Layer Names.
de: Es kann schwierig sein den Überblick darüber zu behalten, wofür Sie die einzelnen Ebenen verwenden. Daher ist es möglicherweise hilfreich, den von Ihnen verwendeten Ebenen Namen zuzuweisen. Namen können unter Projekteinstellungen -> Ebenen-Namen vergeben werden.
zh_tw: 追蹤您正在使用每個圖層的內容可能很困難，因此您可能會發現為您正在使用的圖層指定名稱很有用。可以在“專案設定 -> Layer Names”中指定名稱。

source: GUI example
de: GUI-Beispiel
zh_tw: 計時器範例

source: You have four node types in your game: Walls, Player, Enemy, and Coin. Both Player and Enemy should collide with Walls. The Player node should detect collisions with both Enemy and Coin, but Enemy and Coin should ignore each other.
de: Sie haben vier Node-Typen in Ihrem Spiel: Wände, Spieler, Gegner und Münze. Sowohl der Spieler als auch der Gegner sollten mit Wänden kollidieren können. Der Spieler-Node sollte Kollisionen mit dem Gegner und der Münze erkennen, aber der Gegner und die Münze sollten sich gegenseitig ignorieren.
zh_tw: 遊戲中有四種節點型別：牆（Wall）、玩家（Player）、敵人（Enemy）、金幣（Coin）。玩家和敵人都應該與牆碰撞。玩家節點應該偵測與敵人和硬幣的碰撞，但敵人和硬幣應該互相忽略。

source: Start by naming layers 1-4 "walls", "player", "enemies", and "coins" and place each node type in its respective layer using the "Layer" property. Then set each node's "Mask" property by selecting the layers it should interact with. For example, the Player's settings would look like this:
de: Benennen Sie zunächst die Ebenen 1 bis 4 "walls", "player", "enemies" und "coins" und platzieren Sie jeden Node-Typ mithilfe der Property "Ebene" in der jeweiligen Ebene. Legen Sie dann die "Masken"-Property jedes Nodes fest, indem Sie die Ebenen auswählen, mit denen er interagieren soll. Die Einstellungen des Spielers sehen beispielsweise folgendermaßen aus:
zh_tw: 首先將 1 至 4 層分別命名為“walls”（牆）“player”（玩家）“enemies”（敵人）“coins”（金幣）並使用“Layer”屬性將每個節點型別放在其各自的層中。然後通過選擇它應該與之互動的層來設定每個節點的“Mash”屬性。例如，玩家的設定將看起來像這樣：

source: Code example
de: Code-Beispiel
zh_tw: 計時器範例

source: In function calls, layers are specified as a bitmask. Where a function enables all layers by default, the layer mask will be given as ``0xffffffff``. Your code can use binary, hexadecimal, or decimal notation for layer masks, depending on your preference.
de: In Funktionsaufrufen werden die Ebenen als Bitmaske angegeben. Wenn eine Funktion standardmäßig alle Ebenen aktiviert, wird die Ebenenmaske als ``0xffffffff`` angegeben. Ihr Code kann je nach Vorliebe binäre, hexadezimale oder dezimale Notation für Ebenenmasken verwenden.
zh_tw: 在函式呼叫中, 為層指定位元遮罩. 當一個函式預設啟用所有圖層時, 圖層遮罩將被指定為 ``0x7fffffff``. 根據你的喜好, 你的程式碼可以使用二進位, 十六進位或十進位來展示層遮罩.

source: The code equivalent of the above example where layers 1, 3 and 4 were enabled would be as follows::
de: Das Code-Äquivalent des obigen Beispiels, in dem die Ebenen 1, 3 und 4 aktiviert wurden, lautet wie folgt::
zh_tw: 如果要用程式碼來啟用第 1、3、4 層： ::

source: Area nodes provide **detection** and **influence**. They can detect when objects overlap and emit signals when bodies enter or exit. Areas can also be used to override physics properties, such as gravity or damping, in a defined area.
de: Area-Nodes bieten **Erkennung** und **Einfluss**. Sie können erkennen wenn sich Objekte überlappen und Signale aussenden wenn Bodys den Bereich betreten oder verlassen. Bereiche können auch verwendet werden, um Physik-Eigenschaften wie Schwerkraft oder Dämpfung in einem definierten Bereich zu umgehen.
zh_tw: Area 節點的作用是**偵測**和**影響**。它們可以偵測物體何時重疊，並在物體進入或離開時發出訊號。Area 也可用於覆蓋物理屬性，例如一定區域內的重力或阻尼。

source: There are three main uses for :ref:`Area2D <class_Area2D>`:
de: Es gibt drei Hauptanwendungen für :ref:`Area2D <class_Area2D>`:
zh_tw: :ref:`Area2D <class_Area2D>` 的主要用途有三種：

source: Overriding physics parameters (such as gravity) in a given region.
de: Überschreiben von Physik-Parametern (wie z.B. der Schwerkraft) in einer bestimmten Region.
zh_tw: 覆蓋給定區域中的物理參數（例如重力）。

source: Detecting when other bodies enter or exit a region or what bodies are currently in a region.
de: Erkennen, wann andere Bodys eine Region betreten oder verlassen oder welche Bodys sich derzeit in einer Region befinden.
zh_tw: 偵測其他實體何時進入或退出某個區域或目前哪個實體位於某個區域。

source: Checking other areas for overlap.
de: Überprüfen anderer Bereiche auf Überlappung.
zh_tw: 檢查是否與其他區域重疊。

source: By default, areas also receive mouse and touchscreen input.
de: Standardmäßig empfangen Bereiche auch Maus- und Touchscreen-Eingaben.
zh_tw: 預設情況下,area還會接收滑鼠和觸控式螢幕輸入.

source: A static body is one that is not moved by the physics engine. It participates in collision detection, but does not move in response to the collision. However, it can impart motion or rotation to a colliding body **as if** it were moving, using its ``constant_linear_velocity`` and ``constant_angular_velocity`` properties.
de: Ein Static Body wird von der Physik-Engine nicht bewegt. Es nimmt an der Kollisionserkennung teil, bewegt sich jedoch nicht als Reaktion auf die Kollision. Er kann jedoch einem kollidierenden Körper Bewegung oder Rotation verleihen **als ob** er sich bewegen würde, und zwar unter Verwendung seiner Propertys ``constant_linear_velocity`` und ``constant_angular_velocity`` (konstante lineare Geschwindigkeit und konstante Winkelgeschwindigkeit).
zh_tw: 靜態主體是物理引擎不移動的主體. 它參與碰撞偵測, 但不會回應碰撞而移動. 然而, 它可以使用它的 ``constant_linear_velocity`` 和 ``constant_angular_velocity`` 屬性將運動或旋轉傳遞給碰撞體, **好像** 它正在移動一樣.

source: ``StaticBody2D`` nodes are most often used for objects that are part of the environment or that do not need to have any dynamic behavior.
de: `` StaticBody2D``-Nodes werden am häufigsten für Objekte verwendet, die Teil der Umgebung sind oder kein dynamisches Verhalten benötigen.
zh_tw: ``StaticBody2D`` 節點最常用於屬於環境的物件或不需要任何動態行為的物件.

source: Example uses for ``StaticBody2D``:
de: Beispiele für ``StaticBody2D``:
zh_tw: ``StaticBody2D`` 的範例用法：

source: Platforms (including moving platforms)
de: Plattformen (einschließlich beweglicher Plattformen)
zh_tw: 平臺（包括可移動的平臺）

source: Conveyor belts
de: Förderbänder
zh_tw: 輸送帶

source: Walls and other obstacles
de: Wände und andere Hindernisse
zh_tw: 牆壁和其他障礙

source: This is the node that implements simulated 2D physics. You do not control a :ref:`RigidBody2D <class_RigidBody2D>` directly. Instead, you apply forces to it and the physics engine calculates the resulting movement, including collisions with other bodies, and collision responses, such as bouncing, rotating, etc.
de: Dies ist der Node, der simulierte 2D-Physik implementiert. Sie steuern ein :ref:`RigidBody2D <class_RigidBody2D>` nicht direkt. Stattdessen üben Sie Kräfte darauf aus, und die Physik-Engine berechnet die resultierende Bewegung, einschließlich Kollisionen mit anderen Körpern, und Kollisionsreaktionen wie Abprallen, Rotation etc.
zh_tw: 這是實作類比2D物理的節點. 你不能直接控制一個 :ref:`RigidBody2D <class_RigidBody2D>`. 取而代之的是, 對它施加力, 物理引擎會計算由此產生的運動, 包括與其他物體的碰撞, 以及碰撞回應, 如彈跳, 旋轉等.

source: You can modify a rigid body's behavior via properties such as "Mass", "Friction", or "Bounce", which can be set in the Inspector.
de: Sie können das Verhalten eines Rigid Bodys über Eigenschaften wie "Masse", "Reibung" oder "Elastizität" ändern, die im Inspektor eingestellt werden können.
zh_tw: 你可以通過“Mass”（品質）“Friction”（摩擦）“Bounce”（反彈）等屬性修改剛體的行為，這些都可以在屬性面板中設定。

source: The body's behavior is also affected by the world's properties, as set in `Project Settings -> Physics`, or by entering an :ref:`Area2D <class_Area2D>` that is overriding the global physics properties.
de: Das Verhalten des Bodys wird auch von den Eigenschaften der Welt beeinflusst, wie unter `Projekteinstellungen -> Physik` festgelegt ist, oder durch Eingabe eines :ref:`Area2D <class_Area2D>`, das die globalen Physik-Eigenschaften überschreibt.
zh_tw: 物體的行為也受到“專案設定 -> Physics”中設定的世界屬性的影響，或者通過輸入覆蓋全域物理屬性的 :ref:`Area2D <class_Area2D>`。

source: When a rigid body is at rest and hasn't moved for a while, it goes to sleep. A sleeping body acts like a static body, and its forces are not calculated by the physics engine. The body will wake up when forces are applied, either by a collision or via code.
de: Wenn ein Rigid Body in Ruhe ist und sich eine Weile nicht bewegt hat, legt er sich schlafen. Ein schlafender Body wirkt wie ein Static Body und seine Kräfte werden nicht von der Physik-Engine berechnet. Der Körper wacht auf, wenn Kräfte angendet werden, entweder durch eine Kollision oder per Code.
zh_tw: 當一個剛體處於靜止狀態, 有一段時間沒有移動, 它就會進入睡眠狀態. 睡眠的物體就像一個靜態的物體, 它的力不會被物理引擎計算. 當力被施加時, 無論是通過碰撞還是通過程式碼, 該物體都會被喚醒.

source: Using RigidBody2D
de: Nutzung von RigidBody2D
zh_tw: 使用 RigidBody2D

source: One of the benefits of using a rigid body is that a lot of behavior can be had "for free" without writing any code. For example, if you were making an "Angry Birds"-style game with falling blocks, you would only need to create RigidBody2Ds and adjust their properties. Stacking, falling, and bouncing would automatically be calculated by the physics engine.
de: Einer der Vorteile der Verwendung eines Rigid Bodys besteht darin, dass viele Verhaltensweisen "kostenlos" ausgeführt werden können, ohne dass Code geschrieben werden muss. Wenn Sie beispielsweise ein Spiel im "Angry Birds"-Stil mit fallenden Blöcken erstellen, müssen Sie nur RigidBody2Ds erstellen und deren Eigenschaften anpassen. Das Stapeln, Fallen und Abprallen wird automatisch von der Physik-Engine berechnet.
zh_tw: 使用剛體的一個好處是，可以“免費”獲得許多行為而無需編寫任何程式碼。例如，如果您正在製作一個帶有下降塊的《憤怒的小鳥》式遊戲，您只需要建立 RigidBody2D 並調整它們的屬性。堆疊、下降、彈跳將由物理引擎自動計算。

source: For example, here is the code for an "Asteroids" style spaceship:
de: Hier ist zum Beispiel der Code für ein Raumschiff im "Asteroids"-Stil:
zh_tw: 例如，以下是《爆破彗星》式太空船的程式碼：

source: Note that we are not setting the ``linear_velocity`` or ``angular_velocity`` properties directly, but rather applying forces (``thrust`` and ``torque``) to the body and letting the physics engine calculate the resulting movement.
de: Beachten Sie, dass wir die Propertys ``linear_velocity`` oder ``angular_velocity`` nicht direkt einstellen, sondern Kräfte (``thrust`` und ``torque`` - "Schub" und "Drehmoment") auf den Körper ausüben, und die Physik-Engine die resultierende Bewegung berechnet .
zh_tw: 請注意, 我們不是直接設定 ``linear_velocity`` 或 ``angular_velocity`` 屬性, 而是將力( ``thrust`` 和 ``torque`` )施加到物體上並讓物理引擎計算出最終的運動.
