Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/physics_introduction.po
Languages: de, zh_tw

source: When a rigid body goes to sleep, the ``_integrate_forces()`` function will not be called. To override this behavior, you will need to keep the body awake by creating a collision, applying a force to it, or by disabling the :ref:`can_sleep <class_RigidBody2D_property_can_sleep>` property. Be aware that this can have a negative effect on performance.
de: Wenn sich ein Rigid Body schlafen legt, wird die Funktion ``_integrate_forces()`` nicht aufgerufen. Um dieses Verhalten zu überschreiben, müssen Sie den Körper wach halten, indem Sie eine Kollision erstellen, eine Kraft auf ihn ausüben oder die Property :ref:`can_sleep <class_RigidBody2D_property_can_sleep>` deaktivieren. Beachten Sie, dass sich dies negativ auf die Performance auswirken kann.
zh_tw: 當一個剛體進入睡眠狀態時, ``_integrate_forces()`` 函式將不會被呼叫. 要重寫這一行為, 您需要通過建立碰撞, 對其施加力或禁用 :ref:`can_sleep <class_RigidBody2D_property_can_sleep>` 屬性來保持物體的啟動. 請注意, 這可能會對性能產生負面影響.

source: Contact reporting
de: Kontakt-Meldungen
zh_tw: 接觸報告

source: By default, rigid bodies do not keep track of contacts, because this can require a huge amount of memory if many bodies are in the scene. To enable contact reporting, set the :ref:`max_contacts_reported <class_RigidBody2D_property_max_contacts_reported>` property to a non-zero value. The contacts can then be obtained via :ref:`PhysicsDirectBodyState2D.get_contact_count() <class_PhysicsDirectBodyState2D_method_get_contact_count>` and related functions.
de: Standardmäßig behalten Rigid Bodys keine Kontakte im Auge, da dies bei vielen Bodys in der Szene sehr viel Speicherplatz beanspruchen kann. Um die Kontakt-Meldungen zu aktivieren, setzen Sie die Property :ref:`max_contacts_reported <class_RigidBody2D_property_max_contacts_reported>` auf einen Wert ungleich Null. Die Kontakte können dann über :ref:`PhysicsDirectBodyState2D.get_contact_count() <class_PhysicsDirectBodyState2D_method_get_contact_count>` und verwandte Funktionen ermittelt werden.
zh_tw: 預設情況下, 剛體不會追蹤接觸點, 因為如果場景中存在許多體, 這可能需要大量的記憶體. 要啟用接觸報告, 請將 :ref:`contacts_reported <class_RigidBody2D_property_contacts_reported>` 屬性設定為非零值. 然後可以通過 :ref:`Physics2DDirectBodyState.get_contact_count() <class_Physics2DDirectBodyState_method_get_contact_count>` 和相關函式獲得聯繫.

source: Contact monitoring via signals can be enabled via the :ref:`contact_monitor <class_RigidBody2D_property_contact_monitor>` property. See :ref:`RigidBody2D <class_RigidBody2D>` for the list of available signals.
de: Die Kontaktüberwachung über Signale kann über die Property :ref:`contact_monitor <class_RigidBody2D_property_contact_monitor>` aktiviert werden. Eine Liste der verfügbaren Signale finden Sie unter :ref:`RigidBody2D <class_RigidBody2D>`.
zh_tw: 通過訊號的接觸監控, 啟用 :ref:`contact_monitor <class_RigidBody2D_property_contact_monitor>` 屬性. 請參閱 :ref:`RigidBody2D <class_RigidBody2D>` 的可用訊號列表.

source: :ref:`CharacterBody2D <class_CharacterBody2D>` bodies detect collisions with other bodies, but are not affected by physics properties like gravity or friction. Instead, they must be controlled by the user via code. The physics engine will not move a character body.
de: :ref:`CharacterBody2D <class_CharacterBody2D>`-Bodys erkennen Kollisionen mit anderen Bodys, werden aber nicht von physikalischen Eigenschaften wie Schwerkraft oder Reibung beeinflusst. Stattdessen müssen sie vom Benutzer durch Code gesteuert werden. Die Physik-Engine wird einen Character Body nicht bewegen.
zh_tw: :ref:`KinematicBody2D <class_KinematicBody2D>` 物體偵測與其他物體的碰撞, 但不受重力或摩擦等物理屬性的影響. 相反, 它們必須由使用者通過程式碼控制. 物理引擎不會移動運動體.

source: When moving a character body, you should not set its ``position`` directly. Instead, you use the ``move_and_collide()`` or ``move_and_slide()`` methods. These methods move the body along a given vector, and it will instantly stop if a collision is detected with another body. After the body has collided, any collision response must be coded manually.
de: Wenn man einen Character Body bewegt, sollte man seine ``position`` nicht direkt setzen. Stattdessen benutzen Sie die Methoden ``move_and_collide()`` oder ``move_and_slide()``. Diese Methoden bewegen den Body entlang eines gegebenen Vektors, und er hält sofort an, wenn eine Kollision mit einem anderen Body festgestellt wird. Nachdem der Body kollidiert ist, muss jede Kollisionsreaktion manuell kodiert werden.
zh_tw: 移動運動體時, 不應直接設定其 ``position`` . 相反, 您使用 ``move_and_collide()`` 或 ``move_and_slide()`` 方法. 這些方法沿著給定的向量移動物體, 如果與另一個物體偵測到碰撞, 它將立即停止. 在物體發生碰撞後, 必須手動編碼任何碰撞回應.

source: Character collision response
de: Character-Kollisions-Reaktion
zh_tw: 顯示碰撞區域

source: After a collision, you may want the body to bounce, to slide along a wall, or to alter the properties of the object it hit. The way you handle collision response depends on which method you used to move the CharacterBody2D.
de: Nach einer Kollision möchten Sie vielleicht, dass der Body abprallt, an einer Wand entlang gleitet oder die Eigenschaften des getroffenen Objekts ändert. Die Art und Weise, wie Sie die Kollisionsreaktion behandeln, hängt davon ab, welche Methode Sie zum Bewegen des CharacterBody2D verwendet haben.
zh_tw: 碰撞後, 您可能希望物體反彈, 沿著牆壁滑動, 或者改變它所擊中的物體的屬性. 處理碰撞回應的方式取決於您用於移動KinematicBody2D的方法.

source: :ref:`move_and_collide <class_PhysicsBody2D_method_move_and_collide>`
zh_tw: :ref:`move_and_collide <class_KinematicBody2D_method_move_and_collide>`

source: When using ``move_and_collide()``, the function returns a :ref:`KinematicCollision2D <class_KinematicCollision2D>` object, which contains information about the collision and the colliding body. You can use this information to determine the response.
de: Bei Verwendung von ``move_and_collide()`` gibt die :ref:`KinematicCollision2D <class_KinematicCollision2D>`-Funktion ein Objekt zurück, das Informationen über die Kollision und den kollidierenden Body enthält. Sie können diese Informationen verwenden, um die Reaktion zu bestimmen.
zh_tw: 當使用 ``move_and_collide()`` 時, 該函式返回一個 :ref:`KinematicCollision2D <class_KinematicCollision2D>` 物件, 其中包含有關碰撞和碰撞體的資訊. 您可以使用此資訊來確定回應.

source: For example, if you want to find the point in space where the collision occurred:
de: Wenn Sie beispielsweise den Punkt im Raum suchen möchten, an dem die Kollision aufgetreten ist:
zh_tw: 例如, 如果要搜尋發生碰撞的空間點:

source: Or to bounce off of the colliding object:
de: Oder um vom kollidierenden Objekt abzuprallen:
zh_tw: 或者從碰撞物體反彈:

source: :ref:`move_and_slide <class_CharacterBody2D_method_move_and_slide>`
zh_tw: :ref:`move_and_slide <class_KinematicBody2D_method_move_and_slide>`

source: Sliding is a common collision response; imagine a player moving along walls in a top-down game or running up and down slopes in a platformer. While it's possible to code this response yourself after using ``move_and_collide()``, ``move_and_slide()`` provides a convenient way to implement sliding movement without writing much code.
de: Gleiten ist eine häufige Kollisionsreaktion. Stellen Sie sich einen Spieler vor, der sich in einem Top-Down-Spiel an Wänden entlang bewegt oder in einem Plattformer an Schrägen auf und ab läuft. Während es möglich ist, diese Reaktion nach der Verwendung von ``move_and_collide()`` selbst zu programmieren, bietet ``move_and_slide()`` eine bequeme Möglichkeit, eine Gleitbewegung zu implementieren, ohne viel Code zu schreiben.
zh_tw: 滑動是一種常見的碰撞回應; 想像一個遊戲角色在上帝視角的遊戲中沿著牆壁移動, 或者在平臺遊戲中上下坡. 雖然可在使用 ``move_and_collide()`` 之後自己編寫這個回應, 但 ``move_and_slide()`` 提供了一種快捷方法來實作滑動且無需編寫太多程式碼.

source: ``move_and_slide()`` automatically includes the timestep in its calculation, so you should **not** multiply the velocity vector by ``delta``.
de: ``move_and_slide()`` bezieht automatisch den Zeitschritt in seine Berechnung ein, daher sollten Sie den Geschwindigkeitsvektor **nicht** mit ``delta`` multiplizieren.
zh_tw: ``move_and_slide()`` 在計算中自動包含時間步長, 因此您 **不** 應將速度向量乘以 ``delta`` .

source: For example, use the following code to make a character that can walk along the ground (including slopes) and jump when standing on the ground:
de: Verwenden Sie beispielsweise den folgenden Code, um einen Charakter zu erstellen, der über den Boden laufen (einschließlich Schrägen) und auch springen kann, wenn er auf dem Boden steht:
zh_tw: 例如, 使用以下程式碼製作一個可以沿著地面(包括斜坡)行走的角色, 並在站在地面時跳躍:

source: See :ref:`doc_kinematic_character_2d` for more details on using ``move_and_slide()``, including a demo project with detailed code.
de: Siehe :ref:`doc_kinematic_character_2d` für weitere Details zur Verwendung von ``move_and_slide()``, einschließlich eines Demo-Projekts mit detailliertem Code.
zh_tw: 有關使用 ``move_and_slide()`` 的更多詳細資訊, 請參閱 :ref:`doc_kinematic_character_2d` , 包括帶有詳細程式碼的演示專案.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: The physics callback, :ref:`Node._physics_process() <class_Node_private_method__physics_process>`, is called before each physics step. Any code that needs to access a body's properties should be run in here. This method will be passed a ``delta`` parameter, which is a floating-point number equal to the time passed in *seconds* since the last step. When using the default 60 Hz physics update rate, it will typically be equal to ``0.01666...`` (but not always, see below).
de: Der Physik-Callback, :ref:`Node._physics_process() <class_Node_private_method__physics_process>`, wird vor jedem Physikschritt aufgerufen. Jeder Code, der auf die Propertys eines Körpers zugreifen muss, sollte hier ausgeführt werden. Dieser Methode wird ein Parameter ``delta`` übergeben, der eine Float-Zahl ist, die der Zeit in *Sekunden* seit dem letzten Schritt entspricht. Wenn man die Default-Aktualisierungsrate der Physik von 60 Hz verwendet, wird sie normalerweise gleich ``0.01666...`` sein (aber nicht immer, siehe unten).

source: However, if you do wish to have some control over the body, you should take care - altering the ``position``, ``linear_velocity``, or other physics properties of a rigid body can result in unexpected behavior. If you need to alter any of the physics-related properties, you should use the :ref:`_integrate_forces() <class_RigidBody2D_private_method__integrate_forces>` callback instead of ``_physics_process()``. In this callback, you have access to the body's :ref:`PhysicsDirectBodyState2D <class_PhysicsDirectBodyState2D>`, which allows for safely changing properties and synchronizing them with the physics engine.
de: Wenn Sie jedoch eine gewisse Kontrolle über den Body haben wollen, sollten Sie vorsichtig sein - das Ändern der ``position``, ``linear_velocity`` oder anderer Physik-Propertys eines Rigid Bodys kann zu unerwartetem Verhalten führen. Wenn Sie eine der physikbezogenen Propertys ändern müssen, sollten Sie den :ref:`_integrate_forces() <class_RigidBody2D_private_method__integrate_forces>`-Callback anstelle von ``_physics_process()`` verwenden. In diesem Callback hat man Zugriff auf den :ref:`PhysicsDirectBodyState2D <class_PhysicsDirectBodyState2D>` des Bodys, was eine sichere Änderung von Propertys und deren Synchronisation mit der Physik-Engine ermöglicht.
