Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/ragdoll_system.po
Languages: de, zh_tw

source: Ragdoll system
zh_tw: 布娃娃系統

source: Introduction
de: Einführung
zh_tw: 前言

source: Since version 3.1, Godot supports ragdoll physics. Ragdolls rely on physics simulation to create realistic procedural animation. They are used for death animations in many games.
de: Seit Version 3.1 unterstützt Godot die Ragdoll-Physik. Ragdolls verlassen sich auf Physiksimulationen, um realistische prozedurale Animationen zu erstellen. Sie werden in vielen Spielen für Todesanimationen verwendet.
zh_tw: Godot 從 3.1 版本開始支援布娃娃物理。布娃娃依靠物理類比來建立逼真的程式式動畫，它們被用於許多遊戲中的死亡動畫。

source: In this tutorial, we will be using the Platformer3D demo to set up a ragdoll.
de: In diesem Tutorial verwenden wir die Platformer3D-Demo, um eine Ragdoll einzurichten.
zh_tw: 在本教學中，我們將使用 Platformer3D 演示來進行布娃娃的設定。

source: You can download the Platformer3D demo on `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ or using the `Asset Library <https://godotengine.org/asset-library/asset/125>`_.
de: Sie können die Platformer3D-Demo auf `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ oder über die `Asset-Bibliothek <https://godotengine.org/asset-library/asset/125>`_ herunterladen.
zh_tw: 您可以在 `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ 上下載Platformer3D演示或使用 `Asset Library <https://godotengine.org/asset-library/asset/125>`_ .

source: Setting up the ragdoll
de: Einrichten der Ragdoll
zh_tw: 設定布娃娃

source: Creating physical bones
de: Erstellen von Physik-Knochen
zh_tw: 建立物理骨骼

source: Like many other features in the engine, there is a node to set up a ragdoll: the :ref:`PhysicalBone3D <class_PhysicalBone3D>` node. To simplify the setup, you can generate ``PhysicalBone`` nodes with the "Create physical skeleton" feature in the skeleton node.
de: Wie viele andere Funktionen in der Engine gibt es einen Node, um eine Ragdoll einzurichten: den :ref:`PhysicalBone3D <class_PhysicalBone3D>`-Node. Um die Einrichtung zu vereinfachen, kann man ``PhysicalBone`` Nodes mit dem "Physisches Skelett erzeugen"-Feature im Skelett-Node erzeugen.
zh_tw: 與引擎中的許多其他功能一樣，有一個節點可以設定布娃娃：:ref:`PhysicalBone <class_PhysicalBone>` 節點。為了簡化設定，您可以使用骨架節點中的“建立物理骨架”功能生成 ``PhysicalBone`` 節點。

source: Open the platformer demo in Godot, and then the Robi scene. Select the ``Skeleton`` node. A skeleton button appears on the top bar menu:
de: Öffnen Sie die Platformer-Demo in Godot und dann die Robi-Szene. Wählen Sie den ``Skeleton``-Node. Ein Skelett-Knopf erscheint in der oberen Menüleiste:
zh_tw: 在 Godot 中打開 Platformer 演示專案，然後打開 Robi 場景。選擇 ``Skeleton`` 節點。頂部欄功能表上顯示骨架按鈕：

source: Click it and select the ``Create physical skeleton`` option. Godot will generate ``PhysicalBone`` nodes and collision shapes for each bone in the skeleton and pin joints to connect them together:
de: Klicken Sie darauf und wählen Sie die Option ``Physikalisches Skelett erstellen``. Godot erzeugt ``PhysicalBone``-Nodes und Collision Shapes für jeden Knochen im Skelett und Gelenkpunkte, um sie miteinander zu verbinden:
zh_tw: 按一下它並選擇 ``建立物理骨架`` 選項。Godot 將為骨架中的每個骨骼生成 ``PhysicalBone`` 節點和碰撞形狀，並用釘關節將它們連接在一起：

source: Some of the generated bones aren't necessary: the ``MASTER`` bone for example. So we're going to clean up the skeleton by removing them.
de: Einige der erzeugten Knochen sind nicht notwendig: der ``MASTER``-Knochen zum Beispiel. Wir werden also das Skelett bereinigen, indem wir sie entfernen.
zh_tw: 一些生成的骨骼不是必需的：例如 ``MASTER`` 骨骼。因此，我們將通過刪除它們來清理骨架。

source: Cleaning up the skeleton
de: Bereinigen des Skeletts
zh_tw: 清理骨骼

source: Each ``PhysicalBone`` the engine needs to simulate has a performance cost, so you want to remove every bone that is too small to make a difference in the simulation, as well as all utility bones.
de: Jeder ``PhysicalBone``, den die Engine simulieren muss, kostet Performance, so dass Sie alle Knochen entfernen wollen, die zu klein sind, um einen Unterschied in der Simulation zu machen, ebenso wie alle Hilfsknochen.
zh_tw: 引擎需要類比的每一個 ``PhysicalBone`` 都有性能成本, 所以你要把每一個太小的骨頭都去掉, 以便所有的實用骨頭在模擬中發揮作用.

source: For example, if we take a humanoid, you do not want to have physical bones for each finger. You can use a single bone for the entire hand instead, or one for the palm, one for the thumb, and a last one for the other four fingers.
de: Nehmen wir zum Beispiel einen Humanoiden, so wollen Sie nicht für jeden Finger einen physikalischen Knochen haben. Man kann stattdessen einen einzigen Knochen für die gesamte Hand verwenden, oder einen für die Handfläche, einen für den Daumen und einen letzten für die anderen vier Finger.
zh_tw: 例如, 如果我們拿一個人形動物來說, 不希望每個手指都有物理骨骼. 可以用一根骨頭代替整個手, 或者用一根骨頭代替手掌, 一根骨頭代替拇指, 最後一根骨頭代替其他四個手指.

source: Remove these physical bones: ``MASTER``, ``waist``, ``neck``, ``headtracker``. This gives us an optimized skeleton and makes it easier to control the ragdoll.
de: Entfernen Sie diese physikalischen Knochen: ``MASTER``, ``waist``, ``neck``, ``headtracker``. Dies gibt uns ein optimiertes Skelett und macht es einfacher, die Ragdoll zu kontrollieren.
zh_tw: 刪除這些物理骨骼：``MASTER``、``waist``、``neck``、``headtracker``。這樣就有了一個優化的骨架，使其更容易控制布娃娃。

source: Collision shape adjustment
de: Anpassen der Collision Shape
zh_tw: 碰撞形狀調整

source: The next task is adjusting the collision shape and the size of physical bones to match the part of the body that each bone should simulate.
de: Die nächste Aufgabe ist die Anpassung der Collision Shape und der Größe der physikalischen Knochen an den Teil des Bodys, den jeder Knochen simulieren soll.
zh_tw: 接下來的工作是調整碰撞形狀和物理骨骼的大小, 以配對每個骨骼應該模擬的身體部位.

source: Joints adjustment
de: Justierung der Gelenke
zh_tw: 關節調整

source: Once you adjusted the collision shapes, your ragdoll is almost ready. You just want to adjust the pin joints to get a better simulation. ``PhysicalBone`` nodes have an unconstrained pin joint assigned to them by default. To change the pin joint, select the ``PhysicalBone`` and change the constraint type in the ``Joint`` section. There, you can change the constraint's orientation and its limits.
de: Nachdem Sie die Collision Shapes angepasst haben, ist Ihre Ragdoll fast fertig. Sie müssen nur noch die Gelenkpunkte anpassen, um eine bessere Simulation zu erhalten. Nodes mit dem Namen ``PhysicalBone`` sind standardmäßig mit einem unbeschränkten Gelenkpunkt versehen. Um den Gelenkpunkt zu ändern, selektieren Sie den ``PhysicalBone`` und ändern Sie den Beschränkungs-Typ im ``Joint``-Abschnitt. Dort können Sie die Ausrichtung und die Grenzen der Beschränkung ändern.
zh_tw: 一旦你調整了碰撞形狀，布娃娃就差不多準備好了。只需要調整釘關節以獲得更好的模擬效果。``PhysicalBone`` 節點在預設情況下有一個不受限制的釘關節。要改變釘關節，請選擇 ``PhysicalBone`` 並在 ``Joint`` 部分改變約束型別。在那裡，你可以改變約束的方向和限制。

source: This is the final result:
de: Dies ist das Endergebnis:
zh_tw: 這是最終效果:

source: Simulating the ragdoll
de: Simulation der Ragdoll
zh_tw: 模擬布娃娃

source: The ragdoll is now ready to use. To start the simulation and play the ragdoll animation, you need to call the ``physical_bones_start_simulation`` method. Attach a script to the skeleton node and call the method in the ``_ready`` method:
de: Die Ragdoll ist jetzt einsatzbereit. Um die Simulation zu starten und die Ragdoll-Animation abzuspielen, müssen Sie die Methode ``physical_bones_start_simulation`` aufrufen. Hängen Sie ein Skript an den Skelett-Node an und rufen Sie diese Methode in der ``_ready`` Methode auf:
zh_tw: 布娃娃現在可以使用了。要開始模擬並播放布娃娃動畫，您需要呼叫 ``physical_bones_start_simulation`` 方法。將腳本附加到骨架節點並在 ``_ready`` 方法中呼叫該方法：

source: To stop the simulation, call the ``physical_bones_stop_simulation()`` method.
de: Um die Simulation zu stoppen, rufen Sie die Methode ``physical_bones_stop_simulation()`` auf.
zh_tw: 要停止模擬, 請呼叫 ``physical_bones_stop_simulation()`` 方法.

source: You can also limit the simulation to only a few bones. To do so, pass the bone names as a parameter. Here's an example of partial ragdoll simulation:
de: Sie können die Simulation auch auf einige wenige Knochen beschränken. Dazu übergeben Sie die Knochennamen als Parameter. Hier ist ein Beispiel für eine partielle Ragdoll-Simulation:
zh_tw: 您還可以將模擬限制為僅幾個骨骼。為此，請將骨骼名稱作為參數傳遞。這是部分佈娃娃模擬的一個範例：

source: Collision layer and mask
de: Kollisionsebene und Maske
zh_tw: 碰撞層與遮罩

source: Make sure to set up your collision layers and masks properly so the ``CharacterBody3D``'s capsule doesn't get in the way of the physics simulation:
de: Stellen Sie sicher, daß Sie Ihre Kollisionsebenen und Masken richtig einstellen, damit die Capsule der ``CharacterBody3D`` nicht der Physiksimulation in die Quere kommt:
zh_tw: 確保正確設定碰撞層和遮罩，這樣 ``KinematicBody`` 的膠囊不會妨礙物理類比：

source: For more information, read :ref:`doc_physics_introduction_collision_layers_and_masks`.
de: Für weitere Informationen, siehe :ref:`doc_physics_introduction_collision_layers_and_masks`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
