Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/rigid_body.po
Languages: de, zh_tw

source: Using RigidBody
de: Verwenden von RigidBody
zh_tw: 使用 RigidBody

source: What is a rigid body?
de: Was ist ein Rigid Body?
zh_tw: 什麼是剛體？

source: A rigid body is one that is directly controlled by the physics engine in order to simulate the behavior of physical objects. In order to define the shape of the body, it must have one or more :ref:`Shape3D <class_Shape3D>` objects assigned. Note that setting the position of these shapes will affect the body's center of mass.
de: Ein Rigid Body ist ein Körper, der direkt von der Physik-Engine gesteuert wird, um das Verhalten von physikalischen Objekten zu simulieren. Um die Form des Bodys zu definieren, müssen ihm ein oder mehrere :ref:`Shape3D <class_Shape3D>`-Objekte zugewiesen werden. Beachten Sie, dass das Setzen der Position dieser Shapes den Massenschwerpunkt des Körpers beeinflusst.
zh_tw: 剛體是直接由物理引擎控制以類比物理物件行為的物體. 為了定義物體的形狀, 必須分配一個或多個 :ref:`Shape <class_Shape>` 對象. 注意, 設定這些形狀的位置將影響物體的重心.

source: How to control a rigid body
de: Wie man einen Rigid Body kontrolliert
zh_tw: 如何控制剛體

source: A rigid body's behavior can be altered by setting its properties, such as mass and weight. A physics material needs to be added to the rigid body to adjust its friction and bounce, and set if it's absorbent and/or rough. These properties can be set in the Inspector or via code. See :ref:`RigidBody3D <class_RigidBody3D>` and :ref:`PhysicsMaterial <class_PhysicsMaterial>` for the full list of properties and their effects.
de: Das Verhalten eines Rigid Bodys kann durch die Einstellung seiner Eigenschaften, wie Masse und Gewicht, verändert werden. Ein physikalisches Material muss dem Rigid Body hinzugefügt werden, um seine Reibung und Elastizität einzustellen und festzulegen, ob er absorbierend und/oder rau ist. Diese Propertys können im Inspector oder per Code eingestellt werden. Siehe :ref:`RigidBody3D <class_RigidBody3D>` und :ref:`PhysicsMaterial <class_PhysicsMaterial>` für die vollständige Liste der Propertys und ihre Auswirkungen.
zh_tw: 剛體的行為可以通過設定其屬性來改變，比如品質和重量。需要給剛體新增一個物理材質來調整它的摩擦力和反彈力，並設定它是否具有吸收性、粗糙度。這些屬性可以在屬性面板中或通過程式碼來設定。參見 :ref:`RigidBody <class_RigidBody>` 和 :ref:`PhysicsMaterial <class_PhysicsMaterial>` 獲取完整的屬性列表和它們的效果。

source: There are several ways to control a rigid body's movement, depending on your desired application.
de: Abhängig von Ihrer gewünschten Anwendung gibt es verschiedene Möglichkeiten, die Bewegung eines Rigid Bodys zu steuern.
zh_tw: 有幾種方法可以控制剛體的運動, 這取決於您的應用程式.

source: If you only need to place a rigid body once, for example to set its initial location, you can use the methods provided by the :ref:`Node3D <class_Node3D>` node, such as ``set_global_transform()`` or ``look_at()``. However, these methods cannot be called every frame or the physics engine will not be able to correctly simulate the body's state. As an example, consider a rigid body that you want to rotate so that it points towards another object. A common mistake when implementing this kind of behavior is to use ``look_at()`` every frame, which breaks the physics simulation. Below, we'll demonstrate how to implement this correctly.
de: Wenn Sie einen Rigid Body nur einmal platzieren müssen, z.B. um seine anfängliche Position zu bestimmen, können Sie die Methoden verwenden, die vom :ref:`Node3D <class_Node3D>`-Node bereitgestellt werden, wie ``set_global_transform()`` oder ``look_at()``. Diese Methoden können jedoch nicht in jedem Frame aufgerufen werden, da die Physik-Engine sonst nicht in der Lage ist, den Zustand des Bodys korrekt zu simulieren. Nehmen wir als Beispiel einen Rigid Body, der so gedreht werden soll, dass er auf ein anderes Objekt zeigt. Ein häufiger Fehler bei der Implementierung dieser Art von Verhalten ist die Verwendung von ``look_at()`` in jedem Frame, was die Physiksimulation unterbricht. Im Folgenden werden wir zeigen, wie man dies korrekt implementiert.
zh_tw: 如果你只需要放置一次剛體, 例如設定它的初始位置, 你可以使用 :ref:`Spatial <class_Spatial>` 節點提供的方法, 例如 ``set_global_transform()`` 或 ``look_at()`` . 但是, 這些方法不能每一影格都被呼叫, 否則物理引擎將無法正確地類比物體的狀態. 舉個例子, 考慮一個剛體, 你想旋轉它, 使它指向另一個對象. 在實作這種行為時, 一個常見的錯誤是每一影格都使用 ``look_at()`` , 這樣會破壞物理類比. 下面, 我們將演示如何正確地實作這一點.

source: The fact that you can't use ``set_global_transform()`` or ``look_at()`` methods doesn't mean that you can't have full control of a rigid body. Instead, you can control it by using the ``_integrate_forces()`` callback. In this method, you can add *forces*, apply *impulses*, or set the *velocity* in order to achieve any movement you desire.
de: Die Tatsache, dass Sie die Methoden ``set_global_transform()`` oder ``look_at()`` nicht verwenden können, bedeutet nicht, dass Sie nicht die vollständige Kontrolle über einen Rigid Body haben können, stattdessen können Sie hierfür ``_integrate_forces()`` nutzen. Bei dieser Methode können Sie *Kräfte* hinzufügen, *Impulse* anwenden oder die *Geschwindigkeit* einstellen, um jede gewünschte Bewegung zu erzielen.
zh_tw: 你不能使用 ``set_global_transform()`` 或 ``look_at()`` 方法並不意味著你不能完全控制一個剛體. 相反, 你可以通過使用 ``_integrate_forces()`` 回呼函式來控制它. 在這個方法中, 你可以新增 *力* , 應用 *脈衝* , 或者設定 *速度* , 以實作你想要的任何運動.

source: The "look at" method
de: Die "look at" -Methode
zh_tw: “look at”方法

source: As described above, using the Node3D's ``look_at()`` method can't be used each frame to follow a target. Here is a custom ``look_at()`` method called ``look_follow()`` that will work with rigid bodies:
de: Wie oben beschrieben, kann die ``look_at()``-Methode von Node3D nicht in jedem Frame verwendet werden, um ein Ziel zu verfolgen. Hier ist eine eigene ``look_at()``-Methode namens ``look_follow()``, die mit Rigid Bodys funktioniert:

source: This method uses the rigid body's ``angular_velocity`` property to rotate the body. The axis to rotate around is given by the cross product between the current forward direction and the direction one wants to look in. The ``clamp`` is a simple method used to prevent the amount of rotation from going past the direction which is wanted to be looked in, as the total amount of rotation needed is given by the arccosine of the dot product. This method can be used with ``axis_lock_angular_*`` as well. If more precise control is needed, solutions such as ones relying on :ref:`class_Quaternion` may be required, as discussed in :ref:`doc_using_transforms`.
de: Diese Methode benutzt die Property ``angular_velocity`` des Rigid Body, um den Body zu rotieren. Die Achse, um die rotiert werden soll, wird durch das Kreuzprodukt zwischen der aktuellen Vorwärtsrichtung und der Richtung, in die man schauen möchte, bestimmt. Das ``Clamping`` ist eine einfache Methode, um zu verhindern, daß die Rotation über die Richtung hinausgeht, in die man schauen möchte, da die gesamte benötigte Rotation durch den Arkussinus des Skalarprodukts gegeben ist. Diese Methode kann auch mit ``axis_lock_angular_*`` verwendet werden. Wenn eine genauere Kontrolle benötigt wird, können Lösungen, die auf :ref:`class_Quaternion` beruhen, erforderlich sein, wie in :ref:`doc_using_transforms` beschrieben.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
