Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/soft_body.po
Languages: de, zh_tw

source: Using SoftBody
de: Verwenden von SoftBody
zh_tw: 使用模組

source: Soft bodies (or *soft-body dynamics*) simulate movement, changing shape and other physical properties of deformable objects. This can for example be used to simulate cloth or to create more realistic characters.
de: Soft Bodys (oder *Soft-Body-Dynamik*) simulieren Bewegungen, Änderungen der Form und andere physikalische Eigenschaften verformbarer Objekte. Dies kann zum Beispiel verwendet werden, um Stoff zu simulieren oder realistischere Charaktere zu erstellen.
zh_tw: 柔體（或*柔體動力學*）類比可變形物體的運動，改變形狀和其他物理功能。例如，這可以用於模擬布料或建立更逼真的角色。

source: Basic set-up
de: Grundlegende Einrichtung
zh_tw: 基本設定

source: A :ref:`SoftBody3D <class_SoftBody3D>` node is used for soft body simulations.
de: Ein :ref:`SoftBody3D <class_SoftBody3D>`-Node wird für Soft Body-Simulationen verwendet.
zh_tw: 用一個 :ref:`SoftBody <class_SoftBody>` 節點來做柔體模擬。

source: We will create a bouncy cube to demonstrate the setup of a soft body.
de: Wir werden einen elastischen Würfel erstellen, um die Einrichtung eines Soft Body zu demonstrieren.
zh_tw: 我們將建立一個彈性立方體來演示柔體的設定。

source: Create a new scene with a ``Node3D`` node as root. Then, create a ``Softbody`` node. Add a ``CubeMesh`` in the ``mesh`` property of the node in the inspector and increase the subdivision of the mesh for simulation.
de: Erstellen Sie eine neue Szene mit einem ``Node3D``-Node als Root. Erstellen Sie dann einen ``Soft Body``-Node. Fügen Sie ein ``CubeMesh`` in der ``mesh``-Property des Nodes im Inspektor hinzu und erhöhen Sie die Unterteilung des Meshes für die Simulation.
zh_tw: 建立一個以 ``Spatial`` 節點為根節點的新場景。然後再建立一個 ``Softbody`` 節點。之後在 ``Softbody`` 節點的屬性面板面板中的 ``mesh`` 中新增 ``CubeMesh`` 並增加網格的細分以進行模擬。

source: Set the parameters to obtain the type of soft body you aim for. Try to keep the ``Simulation Precision`` above 5, otherwise, the soft body may collapse.
de: Stellen Sie die Parameter ein, um den gewünschten Soft Body-Typ zu erhalten. Versuchen Sie, die ``Simulationsgenauigkeit`` über 5 zu halten, da sonst der Soft Body zusammenbrechen kann.
zh_tw: 設定參數以獲得您想要的柔體型別。儘量保持 ``Simulation Precision``（模擬精度）的數值高於 5，否則該柔體結構可能會瓦解。

source: Handle some parameters with care, as some value can lead to strange results. For example, if the shape is not completely closed and you set pressure to more than 0, the softbody will fly around like a plastic bag under strong wind.
de: Gehen Sie vorsichtig mit einigen Parametern um, da gewisse Werte zu seltsamen Ergebnissen führen können. Wenn beispielsweise die Shape nicht vollständig geschlossen ist und Sie den Druck auf mehr als 0 einstellen, fliegt der Soft Body bei starkem Wind wie eine Plastiktüte herum.
zh_tw: 小心處理一些參數，因為改動某些數值會導致奇怪的結果。例如，如果形狀未完全封閉並且您將壓力設定為大於 0，則柔體將如同在強風下的塑膠袋一樣飛舞。

source: Play the scene to view the simulation.
de: Starten Sie die Szene, um sich die Simulation anzusehen.
zh_tw: 播放該場景以查看模擬結果。

source: To improve the simulation's result, increase the ``Simulation Precision``, this will give significant improvement at the cost of performance.
de: Um das Simulationsergebnis zu verbessern, erhöhen Sie die ``Simulationsgenauigkeit``. Dies führt zu einer signifikanten Verbesserung der Performance.
zh_tw: 要改善模擬結果，可以增大 ``Simulation Precision``，但同時會大幅度增加性能成本。

source: Cloak simulation
de: Stoffsimulation
zh_tw: 斗篷模擬

source: Let's make a cloak in the Platformer3D demo.
de: Erstellen wir einen Umhang in der Platformer3D-Demo.
zh_tw: 我們將在 Platformer3D 演示中製作一個斗篷。

source: You can download the Platformer3D demo on `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ or `the Asset Library <https://godotengine.org/asset-library/asset/125>`_.
de: Sie können die Platformer3D-Demo auf `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ oder aus der `Asset-Bibliothek <https://godotengine.org/asset-library/asset/125>`_ herunterladen.
zh_tw: 你可以在 `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ 或`素材庫 <https://godotengine.org/asset-library/asset/125>`_上下載 Platformer3D 演示。

source: Open the ``Player`` scene, add a ``SoftBody`` node and assign a ``PlaneMesh`` to it.
de: Öffnen Sie die Szene ``Player``, fügen Sie einen ``SoftBody``-Node hinzu und weisen Sie ihm ein ``PlaneMesh`` zu.
zh_tw: 打開 ``Player`` 場景，新增一個 ``SoftBody`` 節點並為其指定一個 ``PlaneMesh``。

source: Open the ``PlaneMesh`` properties and set the size(x: 0.5 y: 1) then set ``Subdivide Width`` and ``Subdivide Depth`` to 5. Adjust the ``SoftBody``'s position. You should end up with something like this:
de: Öffnen Sie die ``PlaneMesh``-Property und stellen Sie die Größe ein (x: 0.5 y: 1), dann setzen Sie ``Unterteilungsbreite`` und ``Unterteilungstiefe`` auf 5. Passen Sie die Position des ``SoftBody`` an. Am Ende sollten Sie etwas wie dieses erhalten:
zh_tw: 打開 ``PlaneMesh`` 屬性並設定大小（x:0.5 y:1），然後將 ``Subdivide Width``（寬度細分）和 ``Subdivide Depth``（深度細分）設定為 5。調整 ``SoftBody`` 的位置。您應該看到如下所示：

source: Subdivision generates a more tessellated mesh for better simulations.
de: Die Unterteilung erzeugt ein stärker mosaikartiges Mesh für bessere Simulationen.
zh_tw: 細分會生成更細密的網格，以便更好地進行模擬。

source: Add a :ref:`BoneAttachment3D <class_BoneAttachment3D>` node under the skeleton node and select the Neck bone to attach the cloak to the character skeleton.
de: Füge einen :ref:`BoneAttachment3D <class_BoneAttachment3D>`-Node unter dem Skeleton-Node hinzu und wähle den Hals-Knochen aus, um den Umhang am Charakterskelett zu befestigen.
zh_tw: 在骨架節點下新增 :ref:`BoneAttachment <class_BoneAttachment>` 節點，然後選擇 Neck（頸部）骨骼，將斗篷附加到角色骨架。

source: ``BoneAttachment3D`` node is to attach objects to a bone of a armature. The attached object will follow the bone's movement, weapon of a character can be attached this way.
de: Der Node ``BoneAttachment3D`` dient zum Anhängen von Objekten an einen Bone einer Armatur. Das angehängte Objekt wird der Bewegung des Knochens folgen, Waffen eines Charakters können auf diese Weise angehängt werden.
zh_tw: ``BoneAttachment`` 節點的作用是將物體附著到骨架的某根骨骼上。附著的物體會隨著骨骼運動，角色的武器可以通過這種方式附加。

source: To create pinned joints, select the upper vertices in the ``SoftBody`` node:
de: Um Gelenkpunkte zu erzeugen, wählen Sie die oberen Vertices im ``SoftBody``-Node:
zh_tw: 要建立固定的關節，選擇 ``SoftBody`` 節點上方的頂點：

source: The pinned joints can be found in ``SoftBody``'s ``Attachments`` property, choose the ``BoneAttachment`` as the ``SpatialAttachment`` for each pinned joints, the pinned joints are now attached to the neck.
de: Die Gelenkpunkte sind in der ``Attachments``-Property von ``SoftBody`` zu finden, wählen Sie ``BoneAttachment`` als ``SpatialAttachment`` für jeden Gelenkpunkt, die Gelenkpunkte sind nun mit dem Hals verbunden.
zh_tw: 在 ``SoftBody`` 的 ``Attachments`` 屬性中可以找到圖釘關節，為每個被圖釘關節選擇 ``BoneAttachment`` 作為 ``SpatialAttachment``，被圖釘關節連接到頸部。

source: Last step is to avoid clipping by adding the Kinematic Body `Player` to ``Parent Collision Ignore`` of the ``SoftBody``.
de: Der letzte Schritt ist das Vermeiden von Clipping, indem der Kinematic Body `Player` zu ``Parent Collision Ignore`` des ``SoftBody`` hinzugefügt wird.
zh_tw: 最後一步，通過在 ``SoftBody`` 的 ``Parent Collision Ignore`` 中新增動力學物體 `Player` 來避免裁切。

source: Play the scene and the cloak should simulate correctly.
de: Spielen Sie die Szene ab und der Umhang sollte korrekt simuliert werden.
zh_tw: 播放場景，應該已經正確模擬了斗篷。

source: This covers the basic settings of softbody, experiment with the parameters to achieve the effect you are aiming for when making your game.
de: Experimentieren Sie mit den Parametern, um den Effekt zu erzielen, den Sie bei der Entwicklung Ihres Spiels anstreben.
zh_tw: 這涵蓋了柔體的基本設定，當你製作遊戲時，嘗試這些參數來達到你想要的效果。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
