Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/troubleshooting_physics_issues.po
Languages: de, zh_tw

source: Troubleshooting physics issues
de: Fehlersuche bei Physik-Problemen
zh_tw: 測試與回報問題

source: When working with a physics engine, you may encounter unexpected results.
de: Wenn Sie mit einer Physik-Engine arbeiten, können Sie auf unerwartete Ergebnisse stoßen.
zh_tw: 使用實體引擎時，您可能會遇到意想不到的結果。

source: While many of these issues can be resolved through configuration, some of them are the result of engine bugs. For known issues related to the physics engine, see `open physics-related issues on GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>`__. Looking through `closed issues <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ can also help answer questions related to physics engine behavior.
de: Während viele dieser Probleme durch die Konfiguration behoben werden können, sind einige von ihnen das Ergebnis von Fehlern in der Engine. Für bekannte Bugs im Zusammenhang mit der Physik-Engine, siehe `offene Physik-bezogene Probleme auf GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>`__. Ein Blick in `geschlossene Issues <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ kann ebenfalls helfen, Fragen zum Verhalten der Physik-Engine zu beantworten.
zh_tw: 雖然其中許多問題可以透過配置解決，但其中一些問題是引擎錯誤造成的。有關與實體引擎相關的已知問題，請參閱「GitHub 上開放的物理相關問題<https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysicals >” __。查看「已關閉的問題<https://github.com/godotengine/godot/issues?q=+is%3Alined+is%3Aissue+label%3Atopic%3Aphysicals>」__ 還可以幫助回答與物理引擎行為相關的問題。

source: Objects are passing through each other at high speeds
de: Objekte bewegen sich mit hoher Geschwindigkeit durcheinander hindurch
zh_tw: 高速運動的物件會互相穿透

source: This is known as *tunneling*. Enabling **Continuous CD** in the RigidBody properties can sometimes resolve this issue. If this does not help, there are other solutions you can try:
de: Dies ist als *Tunneling* bekannt. Das Aktivieren von **Kontinuierliche CD** in den RigidBody-Propertys kann dieses Problem manchmal beheben. Wenn dies nicht hilft, gibt es andere Lösungen, die Sie ausprobieren können:
zh_tw: 這稱為*隧道*。在 RigidBody 屬性中啟用**連續 CD** 有時可以解決此問題。如果這沒有幫助，您可以嘗試其他解決方案：

source: Make your static collision shapes thicker. For example, if you have a thin floor that the player can't get below in some way, you can make the collider thicker than the floor's visual representation.
de: Machen Sie Ihre statischen Kollisions-Shapes dicker. Wenn Sie zum Beispiel einen dünnen Boden haben, unter den der Spieler nicht gelangen kann, können Sie den Collider dicker machen als die visuelle Darstellung des Bodens.
zh_tw: 讓你的靜態碰撞形狀更厚。例如，如果您的地板很薄，玩家無法以某種方式到達下方，則可以使對撞機比地板的視覺表示更厚。

source: Modify your fast-moving object's collision shape depending on its movement speed. The faster the object moves, the larger the collision shape should extend outside of the object to ensure it can collide with thin walls more reliably.
de: Ändern Sie die Shape des sich schnell bewegenden Objekts in Abhängigkeit von seiner Bewegungsgeschwindigkeit. Je schneller sich das Objekt bewegt, desto größer sollte die Shape für die Kollision außerhalb des Objekts sein, damit es zuverlässiger mit dünnen Wänden kollidieren kann.
zh_tw: 根據快速移動物體的移動速度修改其碰撞形狀。物體移動得越快，碰撞形狀應該延伸到物體外部越大，以確保它能夠更可靠地與薄壁碰撞。

source: Increase **Physics Ticks Per Second** in the advanced Project Settings. While this has other benefits (such as more stable simulation and reduced input lag), this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
de: Erhöhen Sie **Physik-Ticks pro Sekunde** in den erweiterten Projekteinstellungen. Dies hat zwar andere Vorteile (wie z.B. eine stabilere Simulation und eine geringere Eingabeverzögerung), erhöht aber die CPU-Auslastung und ist für Mobil-/Webplattformen möglicherweise nicht praktikabel. Multiplikatoren des Default-Wertes von ``60`` (wie ``120``, ``180`` oder ``240``) sollten für ein flüssiges Erscheinungsbild auf den meisten Displays bevorzugt werden.
zh_tw: 在進階專案設定中增加**每秒物理滴答數**。雖然這還有其他好處（例如更穩定的模擬和減少輸入延遲），但這會增加 CPU 使用率，並且可能不適用於行動/網路平台。為了在大多數顯示器上獲得平滑的外觀，應首選預設值「60」（例如「120」、「180」或「240」）的乘數。

source: Stacked objects are unstable and wobbly
de: Gestapelte Objekte sind instabil und wackelig
zh_tw: 堆疊的對象搖擺不定

source: Despite seeming like a simple problem, stable RigidBody simulation with stacked objects is difficult to implement in a physics engine. This is caused by integrating forces going against each other. The more stacked objects are present, the stronger the forces will be against each other. This eventually causes the simulation to become wobbly, making the objects unable to rest on top of each other without moving.
de: Obwohl es wie ein einfaches Problem aussieht, ist eine stabile RigidBody-Simulation mit gestapelten Objekten in einer Physik-Engine schwer zu implementieren. Dies wird durch die Integration von Kräften verursacht, die gegeneinander wirken. Je mehr gestapelte Objekte vorhanden sind, desto stärker sind die Kräfte, die gegeneinander wirken. Dies führt schließlich dazu, dass die Simulation wackelig wird und die Objekte nicht mehr aufeinander liegen können, ohne sich zu bewegen.
zh_tw: 儘管看起來是一個簡單的問題，但在物理引擎中很難實作具有堆疊物件的穩定剛體模擬。這是由相互對抗的力量整合所造成的。堆疊的物體越多，彼此之間的作用力就越強。這最終會導致模擬變得不穩定，使物體無法在不移動的情況下相互堆疊。

source: Increasing the physics simulation rate can help alleviate this issue. To do so, increase **Physics Ticks Per Second** in the advanced Project Settings. Note that increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
de: Eine Erhöhung der Physiksimulationsrate kann dieses Problem beheben. Erhöhen Sie dazu **Physik-Ticks pro Sekunde** in den erweiterten Projekteinstellungen. Beachten Sie, dass dies die CPU-Auslastung erhöht und für Mobil-/Webplattformen möglicherweise nicht praktikabel ist. Multiplikatoren des Standardwertes von ``60`` (wie ``120``, ``180`` oder ``240``) sollten für ein flüssiges Erscheinungsbild auf den meisten Displays bevorzugt werden.
zh_tw: 提高物理模擬速率可以幫助緩解這個問題。為此，請在進階專案設定中增加**每秒物理滴答數**。請注意，這會增加 CPU 使用率，並且可能不適用於行動/網路平台。為了在大多數顯示器上獲得平滑的外觀，應首選預設值「60」（例如「120」、「180」或「240」）的乘數。

source: Scaled physics bodies or collision shapes do not collide correctly
de: Skalierte Physik-Bodys oder Kollisions-Shapes kollidieren nicht korrekt
zh_tw: 縮放後的物理體或碰撞形狀無法正確碰撞

source: Godot does not currently support scaling of physics bodies or collision shapes. As a workaround, change the collision shape's extents instead of changing its scale. If you want the visual representation's scale to change as well, change the scale of the underlying visual representation (Sprite2D, MeshInstance3D, …) and change the collision shape's extents separately. Make sure the collision shape is not a child of the visual representation in this case.
de: Godot unterstützt derzeit keine Skalierung von Physik-Bodys oder Kollisions-Shapes. Als Abhilfe können Sie die Ausdehnungen des Shapes ändern, anstatt seinen Maßstab zu ändern. Wenn Sie möchten, dass sich die Skalierung der visuellen Darstellung ebenfalls ändert, ändern Sie die Skalierung der zugrunde liegenden visuellen Darstellung (Sprite2D, MeshInstance3D, ...) und ändern Sie die Ausdehnung der Kollisions-Shape separat. Vergewissern Sie sich in diesem Fall, dass die Shape der Kollision kein Child der visuellen Darstellung ist.
zh_tw: Godot 目前不支援物理體或碰撞形狀的縮放。作為解決方法，更改碰撞形狀的範圍而不是更改其比例。如果您希望視覺表示的比例也會發生變化，請變更基礎視覺表示的比例（Sprite2D、MeshInstance3D...）並分別變更碰撞形狀的範圍。在這種情況下，請確保碰撞形狀不是視覺表示的子代。

source: Since resources are shared by default, you'll have to make the collision shape resource unique if you don't want the change to be applied to all nodes using the same collision shape resource in the scene. This can be done by calling ``duplicate()`` in a script on the collision shape resource *before* changing its size.
de: Da Ressourcen standardmäßig gemeinsam genutzt werden, müssen Sie die Kollisions-Shape-Ressource eindeutig machen, wenn Sie nicht wollen, dass die Änderung auf alle Nodes angewendet wird, die dieselbe Kollisions-Shape-Ressource in der Szene verwenden. Dies kann durch den Aufruf von ``duplicate()`` in einem Skript für die Kollisions-Shape-Ressource *vor* der Änderung ihrer Größe geschehen.
zh_tw: 由於預設資源是共享的，因此如果您不希望將變更套用至場景中使用相同碰撞形狀資源的所有節點，則必須使碰撞形狀資源唯一。這可以透過在碰撞形狀資源*更改其大小之前*在腳本中呼叫「duplicate()」來完成。

source: Thin objects are wobbly when resting on the floor
de: Dünne Objekte sind wackelig, wenn sie auf dem Boden liegen
zh_tw: 薄的物體放在地板上時會搖晃

source: This can be due to one of two causes:
de: Dafür kann es einen von zwei Gründen geben:
zh_tw: 填寫下列設定：

source: The floor's collision shape is too thin.
de: Die Kollisions-Shape des Bodens ist zu dünn.
zh_tw: 地板的碰撞形狀太薄。

source: The RigidBody's collision shape is too thin.
de: Der Shape des RigidBodys ist zu dünn.
zh_tw: RigidBody 的碰撞形狀太薄。

source: In the first case, this can be alleviated by making the floor's collision shape thicker. For example, if you have a thin floor that the player can't get below in some way, you can make the collider thicker than the floor's visual representation.
de: Im ersten Fall kann dies dadurch gemildert werden, dass die Shape des Bodens für die Kollision dicker gemacht wird. Wenn Sie zum Beispiel einen dünnen Boden haben, unter den der Spieler nicht gelangen kann, können Sie den Collider dicker machen als die visuelle Darstellung des Bodens.
zh_tw: 在第一種情況下，可以透過使地板的碰撞形狀更厚來緩解這種情況。例如，如果您的地板很薄，玩家無法以某種方式到達下方，則可以使對撞機比地板的視覺表示更厚。

source: In the second case, this can usually only be resolved by increasing the physics simulation rate (as making the shape thicker would cause a disconnect between the RigidBody's visual representation and its collision).
de: Im zweiten Fall lässt sich dies in der Regel nur durch eine Erhöhung der Physiksimulationsrate beheben (da eine Verdickung der Shape zu einem Unterschied zwischen der visuellen Darstellung des RigidBodys und seiner Kollision führen würde).
zh_tw: 在第二種情況下，這通常只能透過增加物理模擬速率來解決（因為使形狀更厚會導致 RigidBody 的視覺表示與其碰撞之間脫節）。

source: In both cases, increasing the physics simulation rate can also help alleviate this issue. To do so, increase **Physics Ticks Per Second** in the advanced Project Settings. Note that this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
de: In beiden Fällen kann auch eine Erhöhung der Physiksimulationsrate helfen, dieses Problem zu beheben. Erhöhen Sie dazu **Physik-Ticks pro Sekunde** in den erweiterten Projekteinstellungen. Beachten Sie, dass dies die CPU-Auslastung erhöht und für Mobil-/Webplattformen möglicherweise nicht praktikabel ist. Multiplikatoren des Default-Wertes von ``60`` (wie ``120``, ``180`` oder ``240``) sollten für ein flüssiges Erscheinungsbild auf den meisten Displays bevorzugt werden.
zh_tw: 在這兩種情況下，提高物理模擬速率也可以幫助緩解這個問題。為此，請在進階專案設定中增加**每秒物理滴答數**。請注意，這會增加 CPU 使用率，並且可能不適用於行動/網路平台。為了在大多數顯示器上獲得平滑的外觀，應首選預設值「60」（例如「120」、「180」或「240」）的乘數。

source: Cylinder collision shapes are unstable
de: Zylinder-Kollisions-Shapes sind instabil
zh_tw: 碰撞形體

source: During the transition from Bullet to GodotPhysics in Godot 4, cylinder collision shapes had to be reimplemented from scratch. However, cylinder collision shapes are one of the most difficult shapes to support, which is why many other physics engines don't provide any support for them. There are several known bugs with cylinder collision shapes currently.
de: Während des Übergangs von Bullet zu GodotPhysics in Godot 4 mussten die Zylinder-Kollisions-Shapes von Grund auf neu implementiert werden. Zylinder-Kollisions-Shapes gehören jedoch zu den am schwierigsten zu unterstützenden Shapes, weshalb viele andere Physik-Engines keine Unterstützung für sie bieten. Derzeit gibt es mehrere bekannte Bugs bei Zylinder-Kollisions-Shapes.
zh_tw: 在 Godot 4 中從 Bullet 到 GodotPhysics 的過渡過程中，必須從頭開始重新實作圓柱體碰撞形狀。然而，圓柱體碰撞形狀是最難支援的形狀之一，這就是為什麼許多其他物理引擎不為它們提供任何支援的原因。目前有幾個已知的圓柱體碰撞形狀錯誤。

source: We recommend using box or capsule collision shapes for characters for now. Boxes generally provide the best reliability, but have the downside of making the character take more space diagonally. Capsule collision shapes do not have this downside, but their shape can make precision platforming more difficult.
de: Wir empfehlen die Verwendung von Box- oder Capsule-Shapes für die Kollision von Figuren. Boxen bieten im Allgemeinen die beste Zuverlässigkeit, haben aber den Nachteil, dass die Figur diagonal mehr Platz einnimmt. Capsule-Kollisions-Shapes haben diesen Nachteil nicht, aber ihre Shape kann präzises Platforming erschweren.
zh_tw: 我們目前建議對角色使用盒子或膠囊碰撞形狀。盒子通常提供最好的可靠性，但缺點是使角色佔用更多對角線空間。膠囊碰撞形狀沒有這個缺點，但它們的形狀會使精確平台變得更加困難。

source: VehicleBody simulation is unstable, especially at high speeds
de: Die VehicleBody-Simulation ist instabil, insbesondere bei hohen Geschwindigkeiten
zh_tw: 車身模擬不穩定，尤其是在高速時

source: When a physics body moves at a high speed, it travels a large distance between each physics step. For instance, when using the 1 unit = 1 meter convention in 3D, a vehicle moving at 360 km/h will travel 100 units per second. With the default physics simulation rate of 60 Hz, the vehicle moves by ~1.67 units each physics tick. This means that small objects may be ignored entirely by the vehicle (due to tunneling), but also that the simulation has little data to work with in general at such a high speed.
de: Wenn sich ein Physik-Body mit hoher Geschwindigkeit bewegt, legt er zwischen jedem Physik-Schritt eine große Strecke zurück. Wenn Sie beispielsweise die Konvention 1 Einheit = 1 Meter in 3D verwenden, legt ein Fahrzeug, das sich mit 360 km/h bewegt, 100 Einheiten pro Sekunde zurück. Bei der Default-Physiksimulationsrate von 60 Hz bewegt sich das Fahrzeug um ~1,67 Einheiten pro Physik-Tick. Das bedeutet, dass kleine Objekte vom Fahrzeug vollständig ignoriert werden können (aufgrund von Tunneling), aber auch, dass die Simulation bei einer so hohen Geschwindigkeit im Allgemeinen wenig Daten zur Verfügung hat.
zh_tw: 當物理體高速移動時，它在每個物理步驟之間行進很長的距離。例如，當在 3D 中使用 1 單位 = 1 公尺約定時，以 360 公里/小時的速度移動的車輛每秒將行駛 100 單位。在預設物理模擬速率為 60 Hz 的情況下，車輛每個物理刻度移動約 1.67 個單位。這意味著車輛可能會完全忽略小物體（由於隧道效應），而且在如此高的速度下，模擬通常幾乎沒有可用的資料。

source: Fast-moving vehicles can benefit a lot from an increased physics simulation rate. To do so, increase **Physics Ticks Per Second** in the advanced Project Settings. Note that this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
de: Schnell fahrende Fahrzeuge können sehr von einer erhöhten Physiksimulationsrate profitieren. Erhöhen Sie dazu **Physik-Ticks pro Sekunde** in den erweiterten Projekteinstellungen. Beachten Sie, dass dies die CPU-Auslastung erhöht und für Mobil-/Web-Plattformen möglicherweise nicht praktikabel ist. Multiplikatoren des Default-Wertes von ``60`` (wie ``120``, ``180`` oder ``240``) sollten für ein flüssiges Erscheinungsbild auf den meisten Displays bevorzugt werden.
zh_tw: 快速移動的車輛可以從物理模擬速率的提高中受益匪淺。為此，請在進階專案設定中增加**每秒物理滴答數**。請注意，這會增加 CPU 使用率，並且可能不適用於行動/網路平台。為了在大多數顯示器上獲得平滑的外觀，應首選預設值「60」（例如「120」、「180」或「240」）的乘數。

source: Collision results in bumps when an object moves across tiles
de: Kollisionen führen zu Erschütterungen, wenn sich ein Objekt über Tiles bewegt
zh_tw: 當物體在瓷磚上移動時，碰撞會導致碰撞

source: This is a known issue in the physics engine caused by the object bumping on a shape's edges, even though that edge is covered by another shape. This can occur in both 2D and 3D.
de: Dies ist ein bekanntes Problem in der Physik-Engine, das dadurch verursacht wird, dass das Objekt an den Kanten eines Shapes anstößt, obwohl diese Kante von einem anderen Shape verdeckt wird. Dies kann sowohl in 2D als auch in 3D auftreten.
zh_tw: 這是物理引擎中的已知問題，由物件在形狀邊緣碰撞而引起，即使該邊緣被另一個形狀覆蓋。這在 2D 和 3D 中都可能發生。

source: The best way to work around this issue is to create a "composite" collider. This means that instead of individual tiles having their collision, you create a single collision shape representing the collision for a group of tiles. Typically, you should split composite colliders on a per-island basis (which means each group of touching tiles gets its own collider).
de: Die beste Möglichkeit, dieses Problem zu umgehen, besteht darin, einen "zusammengesetzten" Collider zu erstellen. Das bedeutet, dass Sie statt einzelner Tiles, die ihre Kollision haben, ein einziges Kollisions-Shape erstellen, das die Kollision für eine Gruppe von Kacheln darstellt. Normalerweise sollten Sie zusammengesetzte Collider auf pro-Insel-Basis aufteilen (was bedeutet, dass jede Gruppe von sich berührenden Tiles ihren eigenen Collider erhält).
zh_tw: 解決這個問題的最佳方法是建立一個“複合”碰撞器。這表示您可以建立一個表示一組圖塊碰撞的單一碰撞形狀，而不是單一圖塊發生碰撞。通常，您應該在每個島嶼的基礎上拆分複合碰撞器（這意味著每組接觸的圖塊都有自己的碰撞器）。

source: Using a composite collider can also improve physics simulation performance in certain cases. However, since the composite collision shape is much more complex, this may not be a net performance win in all cases.
de: Die Verwendung eines zusammengesetzten Colliders kann in bestimmten Fällen auch die Performance der Physiksimulation verbessern. Da die zusammengesetzte Kollisions-Shape jedoch sehr viel komplexer ist, kann dies nicht in allen Fällen einen Performance-Gewinn bedeuten.
zh_tw: 在某些情況下，使用複合對撞機還可以提高物理模擬性能。然而，由於複合碰撞形狀要複雜得多，因此這可能並非在所有情況下都能帶來淨性能優勢。

source: Framerate drops when an object touches another object
de: Framerate sinkt, wenn ein Objekt ein anderes Objekt berührt
zh_tw: 當一個物體接觸另一個物體時影格率下降

source: This is likely due to one of the objects using a collision shape that is too complex. Convex collision shapes should use a number of shapes as low as possible for performance reasons. When relying on Godot's automatic generation, it's possible that you ended up with dozens if not hundreds of shapes created for a single convex shape collision resource.
de: Dies liegt wahrscheinlich daran, dass eines der Objekte eine zu komplexe Shape für die Kollision verwendet. Konvexe Kollisions-Shapes sollten aus Performance-Gründen eine möglichst geringe Anzahl von Shapes verwenden. Wenn Sie sich auf die automatische Generierung von Godot verlassen, ist es möglich, dass Sie am Ende Dutzende, wenn nicht Hunderte von Shapes für eine einzige konvexe Kollisionsressource erstellt haben.
zh_tw: 這可能是由於其中一個物件使用的碰撞形狀過於複雜。出於性能原因，凸碰撞形狀應使用盡可能少的形狀。當依賴 Godot 的自動產生時，您最終可能會為單一凸形碰撞資源建立數十個甚至數百個形狀。

source: In some cases, replacing a convex collider with a couple of primitive collision shapes (box, sphere, or capsule) can deliver better performance.
de: In einigen Fällen kann das Ersetzen eines konvexen Colliders durch ein paar primitive Shapes (Box, Kugel oder Capsule) zu einer besseren Performance führen.
zh_tw: 在某些情況下，用幾個原始碰撞形狀（盒子、球體或膠囊）替換凸碰撞體可以提供更好的性能。

source: This issue can also occur with StaticBodies that use very detailed trimesh (concave) collisions. In this case, use a simplified representation of the level geometry as a collider. Not only this will improve physics simulation performance significantly, but this can also improve stability by letting you remove small fixtures and crevices from being considered by collision.
de: Dieses Problem kann auch bei StaticBodys auftreten, die sehr detaillierte Trimesh (konkave)-Kollisionen verwenden. Verwenden Sie in diesem Fall eine vereinfachte Darstellung der Level-Geometrie als Collider. Dadurch wird nicht nur die Performance der Physiksimulation erheblich verbessert, sondern auch die Stabilität, da kleine Anbauten und Spalten nicht mehr von der Kollision berücksichtigt werden.
zh_tw: 使用非常詳細的修剪網格（凹面）碰撞的靜態物體也會出現此問題。在這種情況下，使用關卡幾何體的簡化表示法作為碰撞器。這不僅會顯著提高物理模擬性能，而且還可以透過讓您從碰撞考慮中刪除小型固定裝置和裂縫來提高穩定性。

source: Physics simulation is unreliable when far away from the world origin
de: Die Physiksimulation ist unzuverlässig, wenn sie weit vom Ursprung der Welt entfernt ist
zh_tw: 遠離世界原點時實體模擬不可靠

source: This is caused by floating-point precision errors, which become more pronounced as the physics simulation occurs further away from the world origin. This issue also affects rendering, which results in wobbly camera movement when far away from the world origin. See :ref:`doc_large_world_coordinates` for more information.
de: Dies wird durch Gleitkomma-Präzisionsfehler verursacht, die umso ausgeprägter werden, je weiter die Physiksimulation vom Ursprung der Welt entfernt ist. Dieses Problem wirkt sich auch auf das Rendering aus, was zu wackeligen Kamerabewegungen führt, wenn man weit vom Ursprung der Welt entfernt ist. Siehe :ref:`doc_large_world_coordinates` für weitere Informationen.
zh_tw: 這是由浮點精度誤差引起的，當物理模擬遠離世界原點時，浮點精度誤差變得更加明顯。此問題也會影響算繪，導致遠離世界原點時相機移動不穩定。請參閱:ref:`doc_large_world_座標` 以了解更多資訊。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
