Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_character_body_2d.po
Languages: de, zh_tw

source: What if you don't want a sliding collision response? For this example ("bounce_and_collide.tscn" in the sample project), we have a character shooting bullets and we want the bullets to bounce off the walls.
de: Was ist, wenn Sie keine gleitende Kollisionsreaktion wünschen? In diesem Beispiel ("bounce_and_collide.tscn" im Beispielprojekt) haben wir einen Charakter, der Kugeln abschießt, und wir wollen, dass die Kugeln von den Wänden abprallen.
zh_tw: 如果您不想要滑動碰撞回應怎麼辦？ 對於這個範例(範例專案中的 "BounceandCollide.tscn"), 我們有一個角色射擊子彈, 我們希望子彈從牆上反彈.

source: This example uses three scenes. The main scene contains the Player and Walls. The Bullet and Wall are separate scenes so that they can be instanced.
de: In diesem Beispiel werden drei Szenen verwendet. Die Hauptszene enthält den Spieler und die Wände. Die Geschosse und die Wand sind separate Szenen, damit sie instanziiert werden können.
zh_tw: 此範例使用三個場景. 主場景包含遊戲角色和牆壁. 子彈和牆是單獨的場景, 以便它們可以產生實體.

source: The Player is controlled by the ``w`` and ``s`` keys for forward and back. Aiming uses the mouse pointer. Here is the code for the Player, using ``move_and_slide()``:
de: Der Spieler wird mit den Tasten ``w`` und ``s`` für vorwärts und rückwärts gesteuert. Das Zielen erfolgt mit dem Mauszeiger. Hier ist der Code für den Spieler, unter Verwendung von ``move_and_slide()``:
zh_tw: 遊戲角色由 `w` 和 `s` 鍵控制前進和後退. 瞄準使用滑鼠指標. 這是遊戲角色的程式碼, 使用 ``move_and_slide()`` :

source: And the code for the Bullet:
de: Und der Code für das Geschoss:
zh_tw: 子彈的程式碼:

source: The action happens in ``_physics_process()``. After using ``move_and_collide()``, if a collision occurs, a ``KinematicCollision2D`` object is returned (otherwise, the return is ``null``).
de: Die Aktion geschieht in ``_physics_process()``. Nach der Verwendung von ``move_and_collide()`` wird, falls eine Kollision auftritt, ein ``KinematicCollision2D``-Objekt zurückgegeben (andernfalls ist die Rückgabe ``null``).
zh_tw: 動作發生在 ``_physics_process()`` 中. 在使用 ``move_and_collide()`` 後, 如果發生碰撞, 將返回一個 ``KinematicCollision2D`` 物件, 否則, 返回 ``Nil`` .

source: If there is a returned collision, we use the ``normal`` of the collision to reflect the bullet's ``velocity`` with the ``Vector2.bounce()`` method.
de: Wenn es eine zurückgegebene Kollision gibt, verwenden wir die ``Normale`` der Kollision, um die Geschwindigkeit ``velocity`` des Geschosses mit der ``Vector2.bounce()``-Methode zu reflektieren.
zh_tw: 如果有一個返回的碰撞, 我們使用碰撞的 ``normal`` 來反映子彈的 ``velocity`` 和 ``Vector2.bounce()`` 方法.

source: If the colliding object (``collider``) has a ``hit`` method, we also call it. In the example project, we've added a flashing color effect to the Wall to demonstrate this.
de: Wenn das kollidierende Objekt (``collider``) eine ``hit``-Methode hat, rufen wir sie auf. Im Beispielprojekt haben wir der Wand einen blinkenden Farbeffekt hinzugefügt, um dies zu demonstrieren.
zh_tw: 如果碰撞物件( ``collider`` )有一個 ``hit`` 方法, 我們也呼叫它. 在範例專案中, 我們為牆壁新增了一個顏色閃爍效果來演示這一點.

source: Platformer movement
de: Plattformer-Bewegungen
zh_tw: 平臺運動

source: Let's try one more popular example: the 2D platformer. ``move_and_slide()`` is ideal for quickly getting a functional character controller up and running. If you've downloaded the sample project, you can find this in "platformer.tscn".
de: Versuchen wir es mit einem weiteren populären Beispiel: dem 2D-Plattformer. Die Funktion ``move_and_slide()`` ist ideal, um schnell einen funktionierenden Charakter-Controller zum Laufen zu bringen. Wenn Sie das Beispielprojekt heruntergeladen haben, finden Sie dies in "platformer.tscn".
zh_tw: 讓我們嘗試一個更流行的範例:2D平臺遊戲. ``move_and_slide()`` 非常適合快速啟動和運作功能字元控制器. 如果您已下載範例專案, 可以在 "Platformer.tscn" 中找到它.

source: For this example, we'll assume you have a level made of one or more ``StaticBody2D`` objects. They can be any shape and size. In the sample project, we're using :ref:`Polygon2D <class_Polygon2D>` to create the platform shapes.
de: In diesem Beispiel gehen wir davon aus, dass Sie ein Level haben, das aus einem oder mehreren ``StaticBody2D``-Objekten besteht. Sie können jede Form und Größe haben. Im Beispielprojekt verwenden wir :ref:`Polygon2D <class_Polygon2D>`, um die Plattformformen zu erstellen.
zh_tw: 對於這個範例, 我們假設您有一個由 ``StaticBody2D`` 物件構成的級別. 它們可以是任何形狀和大小. 在範例專案中, 我們使用 :ref:`Polygon2D <class_Polygon2D>` 來建立平臺形狀.

source: Here's the code for the player body:
de: Hier ist der Code für den Spieler-Body:
zh_tw: 這是遊戲角色物體的程式碼:

source: In this code we're using ``move_and_slide()`` as described above - to move the body along its velocity vector, sliding along any collision surfaces such as the ground or a platform. We're also using ``is_on_floor()`` to check if a jump should be allowed. Without this, you'd be able to "jump" in midair; great if you're making Flappy Bird, but not for a platformer game.
de: In diesem Code benutzen wir ``move_and_slide()`` wie oben beschrieben - um den Body entlang seines Geschwindigkeitsvektors zu bewegen und entlang von Kollisionsflächen, wie dem Boden oder einer Plattform, zu gleiten. Wir benutzen auch ``is_on_floor()``, um zu prüfen, ob ein Sprung erlaubt sein sollte. Ohne diese Funktion könnte man in der Luft "springen"; das ist toll, wenn man Flappy Bird macht, aber nicht für ein Jump'n'Run-Spiel.
zh_tw: 在這段程式碼中，我們使用如上所述的“move_and_slide()” - 沿著其速度向量移動物體，沿著任何碰撞表面（例如地面或平台）滑動。我們也使用「is_on_floor()」來檢查是否允許跳躍。沒有這個，你就可以在半空中「跳躍」；如果您正在製作《Flappy Bird》，那麼這很好，但不適用於平台遊戲。

source: There is a lot more that goes into a complete platformer character: acceleration, double-jumps, coyote-time, and many more. The code above is just a starting point. You can use it as a base to expand into whatever movement behavior you need for your own projects.
de: Es gibt noch viel mehr, was zu einem vollständigen Plattformer-Charakter gehört: Beschleunigung, Doppelsprünge, Coyote-Time und vieles mehr. Der obige Code ist nur ein Startpunkt. Sie können ihn als Basis verwenden, um das Bewegungsverhalten zu erweitern, das Sie für Ihre eigenen Projekte benötigen.
zh_tw: 完整的平台遊戲角色還有很多東西：加速、二段跳、郊狼時間等等。上面的程式碼只是一個起點。您可以使用它作為基礎來擴充您自己的專案所需的任何運動行為。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
