Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_area_2d.po
Languages: de, zh_tw

source: Using Area2D
de: Verwendung von Area2D
zh_tw: 使用 Area2D

source: Introduction
de: Einführung
zh_tw: 前言

source: Godot offers a number of collision objects to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each of them works and what their pros and cons are. In this tutorial, we'll look at the :ref:`Area2D <class_Area2D>` node and show some examples of how it can be used.
de: Godot bietet eine Reihe von Kollisionsobjekten an, um sowohl Kollisionserkennung als auch Reaktion zu ermöglichen. Der Versuch zu entscheiden, welches für Ihr Projekt verwendet werden soll, kann verwirrend sein. Sie können Probleme vermeiden und die Entwicklung vereinfachen, wenn Sie verstehen wie sie funktionieren und welche Vor- und Nachteile sie haben. In diesem Tutorial sehen wir uns den Node :ref:`Area2D <class_Area2D>` an und zeigen einige Beispiele dafür, wie er verwendet werden kann.
zh_tw: Godot提供了許多碰撞物件來提供碰撞偵測和回應. 試圖決定為你的專案使用哪一個可能會讓人感到困惑. 如果你瞭解它們各自的工作原理以及它們的優點和缺點, 你就可以避免問題並簡化開發. 在本教學中, 我們將查看 :ref:`Area2D <class_Area2D>` 節點, 並展示一些如何使用它的例子.

source: This document assumes you're familiar with Godot's various physics bodies. Please read :ref:`doc_physics_introduction` first.
de: In diesem Dokument wird davon ausgegangen, dass Sie mit den verschiedenen Physik-Bodys von Godot vertraut sind. Bitte lesen Sie zuerst :ref:`doc_physics_introduction`.
zh_tw: 本文假設你熟悉 Godot 中的各種物理體，否則請先閱讀 :ref:`doc_physics_introduction` 。

source: What is an area?
de: Was ist eine Area?
zh_tw: 什麼是區域？

source: An Area2D defines a region of 2D space. In this space you can detect other :ref:`CollisionObject2D <class_CollisionObject2D>` nodes overlapping, entering, and exiting. Areas also allow for overriding local physics properties. We'll explore each of these functions below.
de: Eine Area2D definiert eine Region im 2D-Raum. Innerhalb dieser Region werden andere :ref:`CollisionObject2D <class_CollisionObject2D>`-Nodes beim Überlappen, Ein- und Austreten erkannt. Diese Areas erlauben es auch, Physik-Eigenschaften zu umgehen. Wir werden auf jede dieser Funktionen genauer eingehen.
zh_tw: Area2D定義了二維空間的區域. 在這個空間中, 您可以偵測到其他 :ref:`CollisionObject2D <class_CollisionObject2D>` 節點的重疊, 進入和退出. 區域(Area)還允許覆蓋本地物理屬性. 我們將在下面討論這些功能中的每一個.

source: Area properties
de: Area-Propertys
zh_tw: Area 的屬性

source: Areas have many properties you can use to customize their behavior.
de: Areas haben viele Propertys, mit denen Sie ihr Verhalten anpassen können.
zh_tw: 區域有許多屬性可用於自訂它們的行為.

source: The ``Gravity``, ``Linear Damp``, and ``Angular Damp`` sections are used to configure the area's physics override behavior. We'll look at how to use those in the *Area influence* section below.
de: Die Abschnitte ``Gravitation``, ``Lineare Dämpfung`` und ``Winkel-Dämpfung`` werden verwendet, um das Verhalten der Area zu konfigurieren, das die Physik umgeht. Wir werden uns im Abschnitt *Area-Einfluss* weiter unten ansehen, wie man sie verwendet.
zh_tw: 前八個屬性用於配置區域的物理覆蓋行為. 我們將在下面一節中介紹如何使用這些內容.

source: ``Monitoring`` and ``Monitorable`` are used to enable and disable the area.
de: ``Monitoring`` und ``Monitorable`` werden verwendet, um die Area zu aktivieren und zu deaktivieren.
zh_tw: *Monitoring* 和 *Monitorable* 用於啟用和禁用該區域偵測.

source: The ``Audio Bus`` section allows you to override audio in the area, for example to apply an audio effect when the player moves through.
de: Der Abschnitt ``Audiobus`` erlaubt es Ihnen, den Ton in der Area zu überschreiben, zum Beispiel um einen Audioeffekt anzuwenden, wenn der Spieler sich durch den Bereich bewegt.
zh_tw: 音訊匯流排 (Audio Bus) 部分, 允許重寫該區域內的音訊, 例如當玩家移動時的音訊效果.

source: Note that Area2D extends :ref:`CollisionObject2D <class_CollisionObject2D>`, so it also provides properties inherited from that class. The ``Collision`` section of ``CollisionObject2D`` is where you configure the area's collision layer(s) and mask(s).
de: Beachten Sie, dass Area2D :ref:`CollisionObject2D <class_CollisionObject2D>` erweitert, so dass es auch von dieser Klasse geerbte Propertys bietet. Im Abschnitt ``Kollision`` von ``CollisionObject2D`` konfigurieren Sie die Kollisionsebene(n) und Maske(n) der Area.
zh_tw: 請注意,Area2D擴充了 :ref:`CollisionObject2D <class_CollisionObject2D>`, 所以它也提供了從該類繼承的屬性, 例如 ``input_pickable`` .

source: Overlap detection
de: Überlappungs-Detektion
zh_tw: 重疊偵測

source: Perhaps the most common use of Area2D nodes is for contact and overlap detection. When you need to know that two objects have touched, but don't need physical collision, you can use an area to notify you of the contact.
de: Die wohl häufigste Verwendung von Area2D-Nodes ist die Kontakt- und Überlappungsdetektion. Wenn Sie wissen müssen, dass sich zwei Objekte berührt haben, aber keine physische Kollision erforderlich ist, können Sie eine Area verwenden, um Sie über den Kontakt zu informieren.
zh_tw: 也許Area2D節點最常見的用途是用於觸碰和重疊偵測. 當需要知道兩個物體已經觸碰, 但不需要物理碰撞時, 可以使用一個區域來通知.

source: For example, let's say we're making a coin for the player to pick up. The coin is not a solid object - the player can't stand on it or push it - we just want it to disappear when the player touches it.
de: Nehmen wir zum Beispiel an, wir erstellen eine Münze, die der Spieler aufheben kann. Die Münze ist kein festes Objekt (der Spieler kann nicht darauf stehen oder sie schieben) wir möchten nur, dass sie verschwindet, wenn der Spieler sie berührt.
zh_tw: 例如, 要做一個硬幣讓玩家去撿. 硬幣並不是一個實心的物體, 玩家不能站在上面, 也不能推它, 只是想讓它在玩家觸碰它的時候消失.

source: Here's the node setup for the coin:
de: Hier ist das Node-Setup für die Münze:
zh_tw: 這是硬幣節點的設定:

source: To detect the overlap, we'll connect the appropriate signal on the Area2D. Which signal to use depends on the player's node type. If the player is another area, use ``area_entered``. However, let's assume our player is a ``CharacterBody2D`` (and therefore a ``CollisionObject2D`` type), so we'll connect the ``body_entered`` signal.
de: Um die Überlappung zu erkennen, verbinden wir das entsprechende Signal mit dem Area2D. Welches Signal zu verwenden ist, hängt vom Node-Typ des Spielers ab. Wenn der Spieler eine andere Area ist, verwenden wir ``area_entered``. Nehmen wir jedoch an, dass unser Spieler ein ``CharacterBody2D`` ist (und damit ein ``CollisionObject2D``-Typ), so werden wir das Signal ``body_entered`` verwenden.
zh_tw: 為了偵測重疊, 我們將在Area2d上連接相應的訊號, 使用哪個訊號取決於玩家的節點型別. 如果玩家是另一個區域(Area2d), 就使用 ``area_entered`` . 然而假設玩家是一個 ``KinematicBody2D`` (因此也是一個 ``CollisionObject2D`` 型別), 將連接 ``body_entered`` 訊號.

source: If you're not familiar with using signals, see :ref:`doc_signals` for an introduction.
de: Wenn Sie mit der Verwendung von Signalen nicht vertraut sind, finden Sie eine Einführung unter :ref:`doc_signals`.
zh_tw: 如果熟悉使用訊號, 請參閱 :ref:`doc_signals` 的介紹.

source: Now our player can collect the coins!
de: Jetzt kann unser Spieler die Münzen sammeln!
zh_tw: 現在我們的遊戲角色可以收集硬幣了！

source: Some other usage examples:
de: Weitere nützliche Beispiele:
zh_tw: 其他一些使用實例：

source: Areas are great for bullets and other projectiles that hit and deal damage, but don't need any other physics such as bouncing.
de: Areas eignen sich hervorragend für Geschosse und andere Projektile, die treffen und Schaden verursachen, aber keine andere Physik benötigen, wie etwa das Abprallen.
zh_tw: 區域對於子彈和其他彈丸物體來說是非常好用, 它可以擊中並造成傷害, 但不需要其他物理效果, 如彈跳.

source: Use a large circular area around an enemy to define its "detect" radius. When the player is outside the area, the enemy can't "see" it.
de: Verwenden Sie eine große kreisförmige Area um einen Gegner, um dessen "Erkennungs"-Radius zu definieren. Wenn sich der Spieler außerhalb der Area befindet, kann der Gegner ihn nicht "sehen".
zh_tw: 用敵人周圍的一個大圓圈區域設定為 "探測" 半徑, 當玩家在該區域外時, 敵人就無法 "看到" 玩家.

source: "Security cameras" - In a large level with multiple cameras, attach areas to each camera and activate them when the player enters.
de: "Überwachungskameras" - Befestigen Sie in einem großen Level mit mehreren Kameras Areas an jeder Kamera und aktivieren Sie sie, wenn der Spieler sie betritt.
zh_tw: 安保攝像頭 - 在有多個攝像頭的大型關卡中, 在每個攝像頭上附加區域(area), 並在玩家進入時啟動它們.

source: See the :ref:`doc_your_first_2d_game` for an example of using Area2D in a game.
de: Siehe :ref:`doc_your_first_2d_game` für ein Beispiel zur Verwendung von Area2D in einem Spiel.
zh_tw: 遊戲中使用 Area2D 的範例請參閱 :ref:`doc_your_first_2d_game`。

source: Area influence
de: Area-Einfluss
zh_tw: 區域影響

source: The second major use for area nodes is to alter physics. By default, the area won't do this, but you can enable this with the ``Space Override`` property. When areas overlap, they are processed in ``Priority`` order (higher priority areas are processed first). There are four options for override:
de: Die zweite wichtige Anwendung für Area-Nodes ist die Veränderung der Physik. Standardmäßig wird die Area dies nicht tun, aber Sie können es mit der ``Space Override``-Property aktivieren. Wenn sich Areas überlappen, werden sie in der Reihenfolge der ``Priorität`` bearbeitet ( Areas mit höherer Priorität werden zuerst bearbeitet). Es gibt vier Optionen zum Überschreiben:
zh_tw: 區域節點的第二個主要用途是改變物理效果。預設情況下，區域不會這樣做，但你可以用 *空間覆蓋（Space Override）* 屬性啟用這個功能。當區域重疊時，它們會按照 *優先順序（Priority）* 的順序進行處理（優先順序較高的區域會被優先處理）。覆蓋有四個選項:

source: *Combine* - The area adds its values to what has been calculated so far.
de: *Combine* - Die Area addiert ihre Werte zu den bisher berechneten Werten.
zh_tw: *合併(Combine)* - 該區域將其數值加到目前已計算的數值上.

source: *Replace* - The area replaces physics properties, and lower priority areas are ignored.
de: *Replace* - Die Area ersetzt Physik-Propertys, und Areas mit niedrigerer Priorität werden ignoriert.
zh_tw: *替換(Replace)* - 該區域替換物理屬性, 低優先順序區域被忽略.

source: *Combine-Replace* - The area adds its gravity/damping values to whatever has been calculated so far (in priority order), ignoring any lower priority areas.
de: *Combine-Replace* - Die Area addiert ihre Schwerkraft-/Dämpfungswerte zu den bisher berechneten Werten (in Prioritätsreihenfolge), wobei Areas mit niedrigerer Priorität ignoriert werden.
zh_tw: *合併-替換 (Combine-Replace)* - 該區域將其重力/阻尼值加到目前為止計算出的所有數值上(按優先順序), 忽略任何較低優先順序的區域.

source: *Replace-Combine* - The area replaces any gravity/damping calculated so far, but keeps calculating the rest of the areas.
de: *Replace-Combine* - Die Area ersetzt die bisher berechnete Schwerkraft/Dämpfung, berechnet jedoch weiterhin den Rest der Area.
zh_tw: *替換-合併 (Replace-Combine)* - 該區域替換了目前為止計算的所有重力或阻尼, 但繼續計算其餘區域.

source: Using these properties, you can create very complex behavior with multiple overlapping areas.
de: Mit diesen Propertys können Sie ein sehr komplexes Verhalten mit mehreren überlappenden Areas erstellen.
zh_tw: 使用這些屬性, 可以建立具有多個重疊區域的複雜行為.

source: The physics properties that can be overridden are:
de: Die Physik-Propertys, die überschrieben werden können, sind:
zh_tw: 可以重寫的物理屬性有:

source: *Gravity* - Gravity's strength inside the area.
de: *Gravity* - Die Stärke der Schwerkraft innerhalb der Area.
zh_tw: *重力(Gravity)* - 區域內的重力強度.

source: *Gravity Direction* - This vector does not need to be normalized.
de: *Gravity Direction* - Dieser Vektor muss nicht normiert werden.
zh_tw: *重力方向 (Gravity Direction)* - 此向量不需要正規化。

source: *Linear Damp* - How quickly objects stop moving - linear velocity lost per second.
de: *Linear Damp* - Wie Objekte aufhören, sich zu bewegen - Reduktion der linearen Geschwindigkeit pro Sekunde.
zh_tw: *線性阻尼 (Linear Damp)* - 物體停止移動的速度-每秒損失的線速度.

source: *Angular Damp* - How quickly objects stop spinning - angular velocity lost per second.
de: *Angular Damp* - Wie Objekte aufhören, zu rotieren - Reduktion der Winkelgeschwindigkeit pro Sekunde.
zh_tw: *角度阻尼 (Angular Damp)* - 物體停止旋轉的速度-每秒損失的角速度.

source: Point gravity
de: Punkt-Schwerkraft
zh_tw: 重力點

source: The ``Gravity Point`` property allows you to create an "attractor". Gravity in the area will be calculated towards a point, given by the ``Point Center`` property. Values are relative to the Area2D, so for example using ``(0, 0)`` will attract objects to the center of the area.
de: Mit dem Property ``Gravity Point`` können Sie einen "Attraktor" erzeugen. Die Schwerkraft in der Area wird in Richtung eines Punktes berechnet, der durch die Property ``Point Center`` angegeben wird. Die Werte sind relativ zur Area2D, so dass z.B. die Verwendung von ``(0, 0)`` Objekte zum Zentrum der Area anzieht.
zh_tw: *重力點 (Gravity Point)* 屬性允許您建立一個 "吸引器" . 區域中的重力將按 *重力向量 (Gravity Vec)* 屬性給出的點進行計算. 值是相對於Area2D而言的, 因此例如使用 ``(0, 0)`` 將吸引物件到區域中心.

source: Examples
de: Beispiele
zh_tw: 範例

source: The example project attached below has three areas demonstrating physics override.
de: Das unten angehängte Beispielprojekt enthält drei Areas, in denen die Umgehung der Physik demonstriert wird.
zh_tw: 以下所附中的範例專案包含三個區域, 它們說明了物理重寫.

source: You can download this project here: `area_2d_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/area_2d_starter.zip>`_
de: Sie können dieses Projekt hier herunterladen: `area_2d_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/area_2d_starter.zip>`_
zh_tw: 您可以在此處下載專案：`area_2d_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/area_2d_starter.zip>`_

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
