Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_character_body_2d.po
Languages: de, zh_tw

source: Using CharacterBody2D/3D
de: Verwenden von CharacterBody2D/3D
zh_tw: 使用 CharacterBody2D/3D

source: Introduction
de: Einführung
zh_tw: 前言

source: Godot offers several collision objects to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each of them works and what their pros and cons are. In this tutorial, we'll look at the :ref:`CharacterBody2D <class_CharacterBody2D>` node and show some examples of how to use it.
de: Godot bietet mehrere Kollisionsobjekte, die sowohl die Kollisionserkennung als auch die Reaktion darauf ermöglichen. Der Versuch zu entscheiden, welches für Ihr Projekt verwendet werden soll, kann verwirrend sein. Sie können Probleme vermeiden und die Entwicklung vereinfachen, wenn Sie verstehen, wie jedes dieser Objekte funktioniert und welche Vor- und Nachteile sie haben. In diesem Tutorial schauen wir uns den Node :ref:`CharacterBody2D <class_CharacterBody2D>` an und zeigen einige Beispiele, wie man ihn verwenden kann.
zh_tw: Godot 提供了多種碰撞物件來提供碰撞偵測和回應。試圖決定在你的專案中使用哪一個可能會讓你感到困惑。如果你瞭解它們中的每一個是如何工作的，以及它們的優點和缺點是什麼，你就可以避免問題並簡化開發。在本教學中，我們將查看 :ref:`CharacterBody2D <class_CharacterBody2D>` 節點，並展示一些如何使用它的例子.

source: While this document uses ``CharacterBody2D`` in its examples, the same concepts apply in 3D as well.
de: Während dieses Dokument ``CharacterBody2D`` in seinen Beispielen verwendet, gelten die gleichen Konzepte auch in 3D.
zh_tw: 雖然本文件在其範例中使用 ``CharacterBody2D`` ，但相同的概念也適用於 3D。

source: What is a character body?
de: Was ist ein Character Body?
zh_tw: 什麼是角色體？

source: ``CharacterBody2D`` is for implementing bodies that are controlled via code. Character bodies detect collisions with other bodies when moving, but are not affected by engine physics properties, like gravity or friction. While this means that you have to write some code to create their behavior, it also means you have more precise control over how they move and react.
de: ``CharacterBody2D`` ist für die Implementierung von Körpern gedacht, die über Code gesteuert werden. Character Bodys erkennen Kollisionen mit anderen Bodys, wenn sie sich bewegen, sind aber nicht von den Physik-Eigenschaften der Engine, wie Schwerkraft oder Reibung, betroffen. Dies bedeutet zwar, dass Sie etwas Code schreiben müssen, um ihr Verhalten zu erzeugen, aber es bedeutet auch, dass Sie eine genauere Kontrolle darüber haben, wie sie sich bewegen und reagieren.
zh_tw: ``CharacterBody2D`` 用於實作通過程式碼控制的物體。Character bodies 在移動時可以偵測到與其他物體的碰撞，但不受引擎物理屬性（如重力、摩擦力等）的影響。雖然這意味著你必須編寫一些程式碼來建立它們的行為，但這也意味著你可以更精確地控制它們如何移動和反應。

source: This document assumes you're familiar with Godot's various physics bodies. Please read :ref:`doc_physics_introduction` first, for an overview of the physics options.
de: In diesem Dokument wird davon ausgegangen, dass Sie mit den verschiedenen Physik-Bodys von Godot vertraut sind. Bitte lesen Sie zuerst :ref:`doc_physics_introduction`, um einen Überblick über die Physikoptionen zu erhalten.
zh_tw: 本文假設你熟悉 Godot 中的各種物理體。否則請先閱讀 :ref:`doc_physics_introduction` 。

source: A `CharacterBody2D` can be affected by gravity and other forces, but you must calculate the movement in code. The physics engine will not move a `CharacterBody2D`.
de: Ein `CharacterBody2D` kann von der Schwerkraft und anderen Kräften beeinflusst werden, aber Sie müssen die Bewegung im Code berechnen. Die Physik-Engine wird einen `CharacterBody2D` nicht bewegen.
zh_tw: `CharacterBody2D` 可以受到重力和其他力的影響，但您必須在程式碼中計算它的運動。物理引擎不會移動 `CharacterBody2D`。

source: Movement and collision
de: Bewegung und Kollision
zh_tw: 運動與碰撞

source: When moving a ``CharacterBody2D``, you should not set its ``position`` property directly. Instead, you use the ``move_and_collide()`` or ``move_and_slide()`` methods. These methods move the body along a given vector and detect collisions.
de: Wenn Sie einen ``CharacterBody2D`` bewegen, sollten Sie seine ``position``-Property nicht direkt setzen. Stattdessen benutzen Sie die Methoden ``move_and_collide()`` oder ``move_and_slide()``. Diese Methoden bewegen den Body entlang eines gegebenen Vektors und erkennen Kollisionen.
zh_tw: 當移動一個 ``CharacterBody2D`` 時，你不應該直接設定它的 ``position`` 屬性，而應該使用 ``move_and_collide()`` 或 ``move_and_slide()`` 方法。這些方法沿著給定的向量移動物體，並且偵測碰撞。

source: You should handle physics body movement in the ``_physics_process()`` callback.
de: Sie sollten die Bewegung des Physik-Bodys in dem ``_physics_process()``-Callback behandeln.
zh_tw: 你應該在 ``_physics_process()`` 回呼函式中處理物理體的運動。

source: The two movement methods serve different purposes, and later in this tutorial, you'll see examples of how they work.
de: Die beiden Bewegungsmethoden dienen unterschiedlichen Zwecken. Später in diesem Tutorial sehen Sie Beispiele für deren Funktionsweise.
zh_tw: 這兩種運動方法有不同的作用, 在後面的教學中, 你會看到它們如何工作的例子.

source: This method takes one required parameter: a :ref:`Vector2 <class_Vector2>` indicating the body's relative movement. Typically, this is your velocity vector multiplied by the frame timestep (``delta``). If the engine detects a collision anywhere along this vector, the body will immediately stop moving. If this happens, the method will return a :ref:`KinematicCollision2D <class_KinematicCollision2D>` object.
de: Diese Methode benötigt einen Parameter: einen :ref:`Vector2 <class_Vector2>`, der die relative Bewegung des Körpers angibt. Typischerweise ist dies der Geschwindigkeitsvektor, multipliziert mit dem Zeitschritt des Frames (``delta``). Wenn die Engine irgendwo entlang dieses Vektors eine Kollision feststellt, stoppt der Body sofort seine Bewegung. Wenn dies geschieht, gibt die Methode ein :ref:`KinematicCollision2D <class_KinematicCollision2D>`-Objekt zurück.
zh_tw: 這個方法需要一個 :ref:`Vector2 <class_Vector2>` 參數以表示物體的相對運動。通常，這是速度向量乘以影格時間步長( ``delta`` )。如果引擎在沿著此向量方向的任何位置偵測到碰撞，則物體將立即停止移動。如果發生這種情況，該方法將返回一個 :ref:`KinematicCollision2D <class_KinematicCollision2D>` 對象。

source: ``KinematicCollision2D`` is an object containing data about the collision and the colliding object. Using this data, you can calculate your collision response.
de: ``KinematicCollision2D`` ist ein Objekt, das Daten über die Kollision und das kollidierende Objekt enthält. Mit diesen Daten können Sie Ihre Kollisionsreaktion berechnen.
zh_tw: ``KinematicCollision2D`` 是一個包含碰撞和碰撞物件資料的物件. 使用這些資料, 你可以計算出你的碰撞回應.

source: ``move_and_collide`` is most useful when you just want to move the body and detect collision, but don't need any automatic collision response. For example, if you need a bullet that ricochets off a wall, you can directly change the angle of the velocity when you detect a collision. See below for an example.
de: Die Funktion ``move_and_collide`` ist am nützlichsten, wenn Sie den Body nur bewegen und eine Kollision erkennen wollen, aber keine automatische Reaktion auf eine Kollision benötigen. Wenn Sie zum Beispiel eine Kugel brauchen, die von einer Wand abprallt, können Sie direkt den Winkel der Geschwindigkeit ändern, wenn Sie eine Kollision erkennen. Siehe unten für ein Beispiel.
zh_tw: 當你只想移動物體並偵測碰撞，並且不需要任何自動碰撞回應時， ``move_and_collide`` 最有用。例如，如果你需要一顆從牆上彈開的子彈，你可以在偵測到碰撞時直接更改速度角度。請參閱下面的範例。

source: The ``move_and_slide()`` method is intended to simplify the collision response in the common case where you want one body to slide along the other. It is especially useful in platformers or top-down games, for example.
de: Die Methode ``move_and_slide()`` ist dazu gedacht, das Kollisionsverhalten in dem häufigen Fall zu vereinfachen, dass ein Body an einem anderen entlang gleiten soll. Sie ist zum Beispiel in Jump'n'Run- oder Top-Down-Spielen besonders nützlich.
zh_tw: ``move_and_slide()`` 方法旨在簡化常見情況下的碰撞回應, 即你希望一個物體沿著另一個物體滑動. 例如, 在平臺遊戲或自上而下的遊戲中, 它特別有用.

source: When calling ``move_and_slide()``, the function uses a number of node properties to calculate its slide behavior. These properties can be found in the Inspector, or set in code.
de: Beim Aufruf von ``move_and_slide()`` verwendet die Funktion eine Reihe von Node-Propertys, um das Gleitverhalten zu berechnen. Diese Propertys können im Inspektor gefunden oder im Code gesetzt werden.
zh_tw: 當呼叫 ``move_and_slide()`` 時，該函式使用許多節點屬性來計算其滑動行為。這些屬性可以在屬性面板中找到，或在程式碼中設定。

source: ``velocity`` - *default value:* ``Vector2( 0, 0 )``
zh_tw: ``up_direction`` - *預設值:* ``Vector2( 0, 0 )``

source: This property represents the body's velocity vector in pixels per second. ``move_and_slide()`` will modify this value automatically when colliding.
de: Diese Property stellt den Geschwindigkeitsvektor des Bodys in Pixeln pro Sekunde dar. ``move_and_slide()`` ändert diesen Wert bei Kollisionen automatisch.
zh_tw: 此屬性表示身體的速度向量（以每秒像素為單位）。 ``move_and_slide()`` 會在碰撞時自動修改此值。

source: ``motion_mode`` - *default value:* ``MOTION_MODE_GROUNDED``
zh_tw: ``max_slides`` - *預設值:* ``4``

source: This property is typically used to distinguish between side-scrolling and top-down movement. When using the default value, you can use the ``is_on_floor()``, ``is_on_wall()``, and ``is_on_ceiling()`` methods to detect what type of surface the body is in contact with, and the body will interact with slopes. When using ``MOTION_MODE_FLOATING``, all collisions will be considered "walls".
de: Diese Property wird typischerweise verwendet, um zwischen Side-Scrolling und Top-Down-Bewegung zu unterscheiden. Wenn Sie den Default-Wert verwenden, können Sie die Methoden ``is_on_floor()``, ``is_on_wall()`` und ``is_on_ceiling()`` verwenden, um zu erkennen, mit welcher Art von Oberfläche der Body in Kontakt ist, zudem interagiert der Body mit Schrägen. Wenn ``MOTION_MODE_FLOATING`` verwendet wird, werden alle Kollisionen als "Wände" betrachtet.
zh_tw: 這個參數允許你定義哪些表面應該被引擎視為地板. 設定這個參數可以讓你使用 ``is_on_floor()`` , ``is_on_wall()`` 和 ``is_on_ceiling()`` 方法來偵測物體接觸的表面型別. 預設值意味著所有的表面都被認為是牆壁.

source: ``up_direction`` - *default value:* ``Vector2( 0, -1 )``
zh_tw: ``up_direction`` - *預設值:* ``Vector2( 0, 0 )``

source: This property allows you to define what surfaces the engine should consider being the floor. Its value lets you use the ``is_on_floor()``, ``is_on_wall()``, and ``is_on_ceiling()`` methods to detect what type of surface the body is in contact with. The default value means that the top side of horizontal surfaces will be considered "ground".
de: Mit dieser Property können Sie festlegen, welche Oberflächen die Engine als Boden betrachten soll. Mit ihrem Wert können Sie die Methoden ``is_on_floor()``, ``is_on_wall()`` und ``is_on_ceiling()`` verwenden, um zu erkennen, mit welcher Art von Oberfläche der Body in Kontakt ist. Der Default-Wert bedeutet, dass die Oberseite von horizontalen Flächen als "Boden" betrachtet wird.
zh_tw: 這個參數允許你定義哪些表面應該被引擎視為地板. 設定這個參數可以讓你使用 ``is_on_floor()`` , ``is_on_wall()`` 和 ``is_on_ceiling()`` 方法來偵測物體接觸的表面型別. 預設值意味著所有的表面都被認為是牆壁.

source: ``floor_stop_on_slope`` - *default value:* ``true``
zh_tw: ``stop_on_slope`` - *預設值:* ``false``

source: This parameter prevents a body from sliding down slopes when standing still.
de: Dieser Parameter verhindert, dass ein Body im Stillstand an Schrägen herunterrutscht.
zh_tw: 該參數可以防止物體站立不動時從斜坡上滑落.

source: ``wall_min_slide_angle`` - *default value:* ``0.261799`` (in radians, equivalent to ``15`` degrees)
de: ``wall_min_slide_angle`` - *default value:* ``0.261799`` (in Bogenmaß, entspricht ``15`` Grad)
zh_tw: ``floor_max_angle`` - *預設值:* ``0.785398`` (以弧度表示, 相當於 ``45`` 度)

source: This is the minimum angle where the body is allowed to slide when it hits a slope.
de: Dies ist der Mindestwinkel, bei dem der Body beim Auftreffen auf einer Schräge gleiten darf.
zh_tw: 這是當身體碰到斜坡時允許滑動的最小角度。

source: ``floor_max_angle`` - *default value:* ``0.785398`` (in radians, equivalent to ``45`` degrees)
de: ``floor_max_angle`` - *default value:* ``0.785398`` (in Bogenmaß, entspricht ``45`` Grad)
zh_tw: ``floor_max_angle`` - *預設值:* ``0.785398`` (以弧度表示, 相當於 ``45`` 度)

source: This parameter is the maximum angle before a surface is no longer considered a "floor."
de: Dieser Parameter ist der maximale Winkel, bevor eine Oberfläche nicht mehr als "Boden" betrachtet wird.
zh_tw: 這是表面不再被視為 "地板" 之前的最大角度

source: There are many other properties that can be used to modify the body's behavior under specific circumstances. See the :ref:`CharacterBody2D <class_CharacterBody2D>` docs for full details.
de: Es gibt viele andere Propertys, die verwendet werden können, um das Verhalten des Bodys unter bestimmten Umständen zu ändern. Siehe die :ref:`CharacterBody2D <class_CharacterBody2D>`-Dokumente für alle Details.
zh_tw: 還有許多其他屬性可用於在特定情況下改變身體的行為。有關完整詳細信息，請參閱:ref:`CharacterBody2D <class_CharacterBody2D>` 檔案。

source: Detecting collisions
de: Erkennen von Kollisionen
zh_tw: 偵測碰撞

source: When using ``move_and_collide()`` the function returns a ``KinematicCollision2D`` directly, and you can use this in your code.
de: Bei Verwendung von ``move_and_collide()`` gibt die Funktion direkt eine ``KinematicCollision2D`` zurück, die Sie in Ihrem Code verwenden können.
zh_tw: 當使用 ``move_and_collide()`` 時, 函式直接返回一個 ``KinematicCollision2D`` , 你可以在程式碼中使用這個.

source: When using ``move_and_slide()`` it's possible to have multiple collisions occur, as the slide response is calculated. To process these collisions, use ``get_slide_collision_count()`` and ``get_slide_collision()``:
de: Bei der Verwendung von ``move_and_slide()`` ist es möglich, daß mehrere Kollisionen auftreten, während die Slide-Reaktion berechnet wird. Um diese Kollisionen zu verarbeiten, verwenden Sie ``get_slide_collision_count()`` und ``get_slide_collision()``:
zh_tw: 當使用 ``move_and_slide()`` 時, 有可能發生多次碰撞, 因為滑動回應是計算出來的. 要處理這些碰撞, 使用 ``get_slide_count()`` 和 ``get_slide_collision()``:

source: `get_slide_collision_count()` only counts times the body has collided and changed direction.
de: Die Funktion `get_slide_collision_count()` zählt nur, wenn der Body kollidiert ist und die Richtung geändert hat.
zh_tw: `get_slide_count()` 只計算物體碰撞和改變方向的次數.

source: See :ref:`KinematicCollision2D <class_KinematicCollision2D>` for details on what collision data is returned.
de: Siehe :ref:`KinematicCollision2D <class_KinematicCollision2D>` für Details zu den zurückgegebenen Kollisionsdaten.
zh_tw: 關於返回哪些碰撞資料, 請參見 :ref:`KinematicCollision2D <class_KinematicCollision2D>` .

source: Which movement method to use?
de: Welche Bewegungsmethode ist zu verwenden?
zh_tw: 使用哪種運動方式？

source: A common question from new Godot users is: "How do you decide which movement function to use?" Often, the response is to use ``move_and_slide()`` because it seems simpler, but this is not necessarily the case. One way to think of it is that ``move_and_slide()`` is a special case, and ``move_and_collide()`` is more general. For example, the following two code snippets result in the same collision response:
de: Eine häufige Frage von neuen Godot-Nutzern lautet: "Wie entscheidet man, welche Bewegungsfunktion man verwenden soll?" Oft ist die Antwort, ``move_and_slide()`` zu benutzen, weil es einfacher erscheint, aber das ist nicht unbedingt der Fall. Man kann sich das so vorstellen, daß ``move_and_slide()`` ein Spezialfall ist, und ``move_and_collide()`` allgemeiner ist. Zum Beispiel führen die folgenden zwei Codeschnipsel zu der gleichen Kollisionsreaktion:
zh_tw: Godot新使用者的一個常見問題是:"你如何決定使用哪個移動函式？" 通常, 回答是使用 ``move_and_slide()`` , 因為它 "更簡單" , 但情況不一定如此. 有一種思路是, ``move_and_slide()`` 是一種特殊情況, 而 ``move_and_collide()`` 更通用. 例如, 下面兩個程式碼片段的結果是相同的碰撞回應:

source: Anything you do with ``move_and_slide()`` can also be done with ``move_and_collide()``, but it might take a little more code. However, as we'll see in the examples below, there are cases where ``move_and_slide()`` doesn't provide the response you want.
de: Alles was Sie mit ``move_and_slide()`` tun, kann auch mit ``move_and_collide()`` ausgeführt werden, es kann jedoch etwas mehr Code erforderlich sein. Wie wir in den folgenden Beispielen sehen werden, gibt es Fälle, in denen ``move_and_slide()`` nicht die gewünschte Reaktion liefert.
zh_tw: 您用 ``move_and_slide()`` 做的任何事情都可以用 ``move_and_collide()`` 來完成, 但它可能需要更多的程式碼. 但是, 正如我們在下面的範例中將看到的, 有些情況下 ``move_and_slide()`` 不能提供您想要的回應.

source: In the example above, ``move_and_slide()`` automatically alters the ``velocity`` variable. This is because when the character collides with the environment, the function recalculates the speed internally to reflect the slowdown.
de: In dem obigen Beispiel ändert ``move_and_slide()`` automatisch die Variable ``velocity``. Das liegt daran, dass die Funktion die Geschwindigkeit intern neu berechnet, wenn der Charakter mit der Umgebung kollidiert, um die Verlangsamung widerzuspiegeln.
zh_tw: 在上面的例子中, 我們將 ``move_and_slide()`` 返回的速度賦值給 ``velocity`` 變數. 這是因為當角色與環境發生碰撞時, 函式會在內部重新計算速度, 以反映減速的情況.

source: For example, if your character fell on the floor, you don't want it to accumulate vertical speed due to the effect of gravity. Instead, you want its vertical speed to reset to zero.
de: Wenn Ihre Figur zum Beispiel auf den Boden fällt, soll sie nicht durch die Schwerkraft an vertikaler Geschwindigkeit zunehmen. Stattdessen soll die vertikale Geschwindigkeit auf Null zurückgesetzt werden.
zh_tw: 例如, 如果角色倒在地上, 不希望它因為重力的影響而積累垂直速度, 而希望它的垂直速度重設為零.

source: ``move_and_slide()`` may also recalculate the kinematic body's velocity several times in a loop as, to produce a smooth motion, it moves the character and collides up to five times by default. At the end of the process, the character's new velocity is available for use on the next frame.
de: Die Funktion ``move_and_slide()`` kann die Geschwindigkeit des Kinematic Bodys auch mehrmals in einer Schleife neu berechnen, da sie den Charakter bewegt und standardmäßig bis zu fünf Mal kollidiert, um eine flüssige Bewegung zu erzeugen. Am Ende des Prozesses steht die neue Geschwindigkeit des Charakters für die Verwendung im nächsten Frame zur Verfügung.
zh_tw: ``move_and_slide()`` 還可以在迴圈中多次重新計算運動體的速度, 為了產生一個平滑的運動, 它預設會移動角色, 並碰撞5次, 在這個過程結束時, 函式返回角色的新速度, 可以將其儲存在 ``velocity`` 變數中, 並在下一影格中使用.

source: Examples
de: Beispiele
zh_tw: 範例

source: To see these examples in action, download the sample project: `character_body_2d_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/character_body_2d_starter.zip>`_
de: Um diese Beispiele in Aktion zu sehen, laden Sie das Beispielprojekt herunter: `character_body_2d_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/character_body_2d_starter.zip>`_
zh_tw: 若要查看這些範例的實際效果，請下載範例專案：`character_body_2d_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/character_body_2d_starter.zip> ` _

source: Movement and walls
de: Bewegung und Wände
zh_tw: 移動和牆壁

source: If you've downloaded the sample project, this example is in "basic_movement.tscn".
de: Wenn Sie das Beispielprojekt heruntergeladen haben, befindet sich dieses Beispiel in "basic_movement.tscn".
zh_tw: 如果你已經下載了範例專案, 這個例子在 "BasicMovement.tscn" 中.

source: For this example, add a ``CharacterBody2D`` with two children: a ``Sprite2D`` and a ``CollisionShape2D``. Use the Godot "icon.svg" as the Sprite2D's texture (drag it from the Filesystem dock to the *Texture* property of the ``Sprite2D``). In the ``CollisionShape2D``'s *Shape* property, select "New RectangleShape2D" and size the rectangle to fit over the sprite image.
de: Für dieses Beispiel fügen Sie ein ``CharacterBody2D`` mit zwei Child-Nodes hinzu: ein ``Sprite2D`` und ein ``CollisionShape2D``. Benutzen Sie die Godot "icon.svg" als Textur des Sprite2Ds (ziehen Sie sie aus dem Dateisystem-Dock auf die *Textur*-Property des ``Sprite2D``). In der *Shape*-Property des ``CollisionShape2D`` wählen Sie "Neu: RectangleShape2D" und vergrößern das Rechteck so, daß es über das Sprite-Bild passt.
zh_tw: 在這個例子中, 新增一個 ``KinematicBody2D`` , 有兩個子級: ``Sprite`` 和 ``CollisionShape2D`` . 使用Godot "icon.png" 作為Sprite的紋理, 將其從檔案系統欄拖到 ``Sprite`` 的 *Texture* 屬性. 在 ``CollisionShape2D`` 的 *Shape* 屬性中, 選擇 "New RectangleShape2D" , 並將矩形的大小調整到適合sprite圖像的大小.

source: See :ref:`doc_2d_movement` for examples of implementing 2D movement schemes.
de: Siehe :ref:`doc_2d_movement` für Beispiele zur Implementierung von 2D-Bewegungsschemas.
zh_tw: 有關實作2D移動方案的範例, 請參閱 :ref:`doc_2d_movement` .

source: Attach a script to the CharacterBody2D and add the following code:
de: Hängen Sie ein Skript an den CharacterBody2D an und fügen Sie den folgenden Code hinzu:
zh_tw: 點擊 [場景] -> [新增場景]，然後新增下列節點：

source: Run this scene and you'll see that ``move_and_collide()`` works as expected, moving the body along the velocity vector. Now let's see what happens when you add some obstacles. Add a :ref:`StaticBody2D <class_StaticBody2D>` with a rectangular collision shape. For visibility, you can use a Sprite2D, a Polygon2D, or turn on "Visible Collision Shapes" from the "Debug" menu.
de: Starten Sie diese Szene und Sie werden sehen, dass ``move_and_collide()`` wie erwartet funktioniert und den Body entlang des Geschwindigkeitsvektors bewegt. Lassen Sie uns nun sehen, was passiert, wenn Sie einige Hindernisse hinzufügen. Fügen Sie einen :ref:`StaticBody2D <class_StaticBody2D>` mit einer rechteckigen Collision Shape hinzu. Für die Sichtbarkeit können Sie ein Sprite2D oder ein Polygon2D verwenden oder die Option "Sichtbare Collision Shapes" im Menü "Debug" aktivieren.
zh_tw: 運作這個場景, 您會看到 ``move_and_collide()`` 按預期工作, 沿著速度向量方向移動物體. 現在讓我們看看當您新增一些障礙時會發生什麼. 新增一個具有矩形碰撞形狀的 :ref:`StaticBody2D <class_StaticBody2D>` . 為了可見性, 您可以使用精靈,Polygon2D, 或從 "除錯" 選單中打開 "可見碰撞形狀".

source: Run the scene again and try moving into the obstacle. You'll see that the ``CharacterBody2D`` can't penetrate the obstacle. However, try moving into the obstacle at an angle and you'll find that the obstacle acts like glue - it feels like the body gets stuck.
de: Starten Sie die Szene erneut und versuchen Sie, sich auf das Hindernis zuzubewegen. Sie werden sehen, dass der ``CharacterBody2D`` das Hindernis nicht durchdringen kann. Versuchen Sie jedoch, sich in einem Winkel auf das Hindernis zuzubewegen und Sie werden feststellen, dass sich das Hindernis wie Klebstoff verhält - es fühlt sich an, als ob der Body stecken bleibt.
zh_tw: 再次運作場景並嘗試移動到障礙物中. 您會看到 ``KinematicBody2D`` 無法穿透障礙物. 但是, 嘗試以某個角度進入障礙物, 您會發現障礙物就像膠水一樣 - 感覺物體被卡住了.

source: This happens because there is no *collision response*. ``move_and_collide()`` stops the body's movement when a collision occurs. We need to code whatever response we want from the collision.
de: Dies geschieht, weil es keine *Kollisionreaktion* gibt. ``move_and_collide()`` stoppt die Bewegung des Bodys, wenn eine Kollision auftritt. Wir müssen jede gewünschte Reaktion auf die Kollision programmieren.
zh_tw: 發生這種情況是因為沒有 *碰撞回應* . ``move_and_collide()`` 在碰撞發生時停止物體的運動. 我們需要編寫我們想要的碰撞響應.

source: Try changing the function to ``move_and_slide()`` and running again.
de: Versuchen Sie, die Funktion in ``move_and_slide()`` zu ändern und erneut auszuführen.
zh_tw: 嘗試將函式更改為 ``move_and_slide(velocity)`` 並再次運作. 請注意, 我們從速度計算中刪除了 "delta".

source: ``move_and_slide()`` provides a default collision response of sliding the body along the collision object. This is useful for a great many game types, and may be all you need to get the behavior you want.
de: ``move_and_slide()`` bietet eine Default-Kollisionsreaktion, die den Body entlang des Kollisionsobjekts verschiebt. Dies ist nützlich für sehr viele Typen von Spielen und kann schon alles sein, was Sie benötigen, um das gewünschte Verhalten zu erreichen.
zh_tw: ``move_and_slide()`` 提供了一個沿碰撞物件滑動物體的預設碰撞響應. 這對於許多遊戲型別都很有用, 並且可能是獲得所需行為所需的全部內容.

source: Bouncing/reflecting
de: Abprallen/Reflektieren
zh_tw: 彈跳/反射
