Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: de, zh_cn, zh_tw

source: As C# support is quite new in Godot, there are some growing pains and things that need to be ironed out. Below is a list of the most important issues you should be aware of when diving into C# in Godot, but if in doubt, also take a look over the official `issue tracker for .NET issues <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_.
de: Da die C#-Unterstützung in Godot noch recht neu ist, gibt es noch einige Anlaufschwierigkeiten und Dinge, die ausgebügelt werden müssen. Im Folgenden finden Sie eine Liste der wichtigsten Probleme, die Sie beachten sollten, wenn Sie sich mit C# in Godot befassen. Im Zweifelsfall sollten Sie aber auch einen Blick auf den offiziellen `issue tracker for .NET issues <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_ werfen.
zh_cn: 由于 Godot 中 C# 支持相对较新，因此存在一些发展过程中的问题和需要解决的事项。以下是在 Godot 中使用 C# 时应注意的最重要问题的列表，但如果有疑问，还可以查看官方的 `.NET 问题的跟踪 <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_ 。
zh_tw: 由於 Godot 中的 C# 支援還很新，所以還有一些需要解決的問題。下表為在 Godot 中使用 C# 需要注意的幾個最重要的問題，另外也請參考一下官方的 `Mono 問題追蹤器 <https://github.com/godotengine/godot/labels/topic%3Amono>`_ 。

source: Writing editor plugins is possible, but it is currently quite convoluted.
de: Editor-Plugins zu schreiben ist möglich, aber zur Zeit ziemlich unübersichtlich.
zh_cn: 编写编辑器插件是可能的，但是目前相当复杂。
zh_tw: 雖然還是可以寫編輯器外掛，但目前很複雜。

source: State is currently not saved and restored when hot-reloading, with the exception of exported variables.
de: Der Status wird derzeit beim Hot-Reloading nicht gespeichert und wiederhergestellt, mit Ausnahme der exportierten Variablen.
zh_cn: 热重载时，当前状态不被保存和恢复，导出变量除外。
zh_tw: 除了匯出的變數以外，熱重載時狀態不會保存並重新載入。

source: Attached C# scripts should refer to a class that has a class name that matches the file name.
de: Angehängte C#-Skripte sollten sich auf eine Klasse beziehen, deren Klassenname mit dem Dateinamen übereinstimmt.
zh_cn: 附加 C# 脚本需要引用一个类，该类名需要匹配其文件名。
zh_tw: 附加 C# 腳本時參照的類別名稱必須與檔名一致。

source: There are some methods such as ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` and signal connection method ``Connect()`` that rely on Godot's ``snake_case`` API naming conventions. So when using e.g. ``CallDeferred("AddChild")``, ``AddChild`` will not work because the API is expecting the original ``snake_case`` version ``add_child``. However, you can use any custom properties or methods without this limitation. Prefer using the exposed ``StringName`` in the ``PropertyName``, ``MethodName`` and ``SignalName`` to avoid extra ``StringName`` allocations and worrying about snake_case naming.
de: Es gibt einige Methoden wie ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` und die Signalverbindungsmethode ``Connect()``, die sich auf Godots ``snake_case``-API-Namenskonventionen verlassen. Wenn Sie also z.B. ``CallDeferred("AddChild")`` verwenden, wird ``AddChild`` nicht funktionieren, da die API die ursprüngliche ``snake_case``-Version ``add_child`` erwartet. Sie können jedoch alle benutzerdefinierten Propertys oder Methoden ohne diese Einschränkung verwenden. Bevorzugen Sie die Verwendung des zugreifbaren ``StringName`` im ``PropertyName``, ``MethodName`` und ``SignalName``, um zusätzliche ``StringName``-Zuweisungen und die Sorge um die snake_case-Benennung zu vermeiden.
zh_cn: ``Get()``/``Set()`` 、 ``Call()``/``CallDeferred()`` 等方法，以及信号连接方法 ``Connect()`` 都依赖于 Godot 的 ``snake_case`` API 命名规范。所以， ``CallDeferred("AddChild")`` 无法调用 ``AddChild`` ，因为API需要原始 ``snake_case`` 版本的 ``add_child`` 。不过，自定义属性和方法没有此限制。建议在 ``PropertyName`` 、 ``MethodName`` 和 ``SignalName`` 中使用公开的 ``StringName`` ，以避免额外的 ``StringName`` 分配以及担心蛇形（snake_case）命名。
zh_tw: 有些方法，如 ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` 與訊號連接方法 ``Connect()`` 都還依賴 Godot 的 ``snake_case`` API 命名規範。所以使用如 ``CallDeferred("AddChild")`` 時，無法正常使用 ``AddChild`` ，因為 API 預期使用原本 ``snake_case`` 版的 ``add_child`` 。但依然可以使用自定屬性與方法而不受此限。

source: As of Godot 4.0, exporting .NET projects is supported for desktop platforms (Linux, Windows and macOS). Other platforms will gain support in future 4.x releases.
de: Ab Godot 4.0 wird der Export von .NET-Projekten für Desktop-Plattformen (Linux, Windows und macOS) unterstützt. Andere Plattformen werden in zukünftigen 4.x-Versionen unterstützt.
zh_cn: 截止到 Godot 4.0 版本，支持将 .NET 项目导出到桌面平台（Linux、Windows和macOS）。其他平台将在未来的 4.x 版本中获得支持。
zh_tw: 自 Godot 3.2.2 版起，匯出 Mono 專案支援桌面平台 (Linux, Windows 與 macOS), Android, HTML5 與 iOS。唯一還不支援的平台為 UWP。

source: Common pitfalls
de: Häufige Fallstricke
zh_cn: 常见陷阱
zh_tw: 註解

source: You might encounter the following error when trying to modify some values in Godot objects, e.g. when trying to change the X coordinate of a ``Node2D``:
de: Der folgende Fehler kann auftreten, wenn Sie versuchen, einige Werte in Godot-Objekten zu ändern, z.B. wenn Sie versuchen, die X-Koordinate eines ``Node2D`` zu ändern:
zh_cn: 你可能会在尝试修改 Godot 对象中的一些值时遇到以下错误，例如在尝试改变一个 ``Node2D`` 的 X 坐标时：
zh_tw: 你可能會在嘗試修改 Godot 物件中的一些值時遇到以下錯誤，例如在嘗試改變一個 ``Node2D`` 的 X 座標時：

source: This is perfectly normal. Structs (in this example, a ``Vector2``) in C# are copied on assignment, meaning that when you retrieve such an object from a property or an indexer, you get a copy of it, not the object itself. Modifying said copy without reassigning it afterwards won't achieve anything.
de: Das ist völlig normal. Strukturen (in diesem Beispiel ein ``Vector2``) werden in C# bei der Zuweisung kopiert, d.h. wenn Sie ein solches Objekt von einer Property oder einem Indexer abrufen, erhalten Sie eine Kopie davon, nicht das Objekt selbst. Diese Kopie zu ändern, ohne sie anschließend neu zuzuweisen, bringt nichts.
zh_cn: 这是完全正常的。C# 中的结构体（在这个例子中，是一个 ``Vector2`` ）在赋值时会被复制，意味着当你从一个属性或索引器中获取这样一个对象时，你得到的是它的一个副本，而不是它本身。修改这个副本而不重新赋值是没有任何效果的。
zh_tw: 這是完全正常的。C# 中的結構體（在這個例子中，是一個 ``Vector2`` ）在賦值時會被複製，意味著當你從一個屬性或索引子中獲取這樣一個物件時，你得到的是它的一個副本，而不是它本身。修改這個副本而不重新賦值是沒有任何效果的。

source: The workaround is simple: retrieve the entire struct, modify the value you want to modify, and reassign the property.
de: Die Abhilfe ist einfach: Rufen Sie die gesamte Struktur ab, ändern Sie den Wert, den Sie ändern möchten, und weisen Sie die Property erneut zu.
zh_cn: 解决方法很简单：获取整个结构体，修改你想要修改的值，然后重新赋值给属性。
zh_tw: 解決方法很簡單：獲取整個結構體，修改你想要修改的值，然後重新賦值給屬性。

source: Since C# 10, it is also possible to use `with expressions <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ on structs, allowing you to do the same thing in a single line.
de: Seit C# 10 ist es auch möglich, `with-Ausdrücke <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ auf Strukturen zu verwenden, wodurch Sie das Gleiche in einer einzigen Zeile tun können.
zh_cn: 自 C# 10 起，还可以在结构体上使用 `with 表达式 <https://learn.microsoft.com/zh-cn/dotnet/csharp/language-reference/operators/with-expression>`_ ，让你只需一行实现相同的效果。
zh_tw: 自 C# 10 起，還可以在結構體上使用 `with 運算式 <https://learn.microsoft.com/zh-cn/dotnet/csharp/language-reference/operators/with-expression>`_ ，讓你只需一行實作相同的效果。

source: You can read more about this error on the `C# language reference <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_.
de: Sie können mehr über diesen Fehler in der `C#-Sprachreferenz <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_ lesen.
zh_cn: 你可以在 `C# 语言参考 <https://learn.microsoft.com/zh-cn/dotnet/csharp/language-reference/compiler-messages/cs1612>`_ 中了解更多关于这个错误的信息。
zh_tw: 你可以在 `C# 語言參考 <https://learn.microsoft.com/zh-cn/dotnet/csharp/language-reference/compiler-messages/cs1612>`_ 中瞭解更多關於這個錯誤的資訊。

source: Performance of C# in Godot
de: Die Performance von C# in Godot
zh_cn: C# 在 Godot 中的性能
zh_tw: Godot 中的 C# 效能

source: According to some preliminary `benchmarks <https://github.com/cart/godot3-bunnymark>`_, the performance of C# in Godot — while generally in the same order of magnitude — is roughly **~4×** that of GDScript in some naive cases. C++ is still a little faster; the specifics are going to vary according to your use case. GDScript is likely fast enough for most general scripting workloads.
de: Nach einigen vorläufigen `Benchmarks <https://github.com/cart/godot3-bunnymark>`_ liegt die Leistung von C# in Godot - obwohl sie im Allgemeinen in der gleichen Größenordnung liegt - in einigen naiven Fällen etwa **~4×** über der von GDScript. C++ ist immer noch ein wenig schneller; die Einzelheiten werden je nach Anwendungsfall variieren. GDScript ist wahrscheinlich schnell genug für die Rechenlast der meisten allgemeinen Skripting-Aufgaben.
zh_cn: 根据一些初步的 `基准测试 <https://github.com/cart/godot3-bunnymark>`_ ，C# 在 Godot 中的性能，虽然总体在相同数量级，但在某些简单情况下大约是 GDScript 的 **~4×** 。C++ 仍然稍微快一些；具体情况将根据你的使用情况而变化。对于大多数常规脚本工作负载而言，GDScript 可能足够快。
zh_tw: 根據一些初步的 `效能評定 <https://github.com/cart/godot3-bunnymark>`_ ，在一般情況下，Godot 中的 C# 效能比起一些單純的 GDScript 情況還要快上 **～ 4 倍** 。C++ 依然稍微快一點。實際情況還是依據使用方式而異。GDScript 一般來說對於普通的程式編寫來說已經夠快了，而 C# 雖然更快，但與 Godot 通訊時則需要耗費許多吃效能的封送處理。

source: Most properties of Godot C# objects that are based on ``GodotObject`` (e.g. any ``Node`` like ``Control`` or ``Node3D`` like ``Camera3D``) require native (interop) calls as they talk to Godot's C++ core. Consider assigning values of such properties into a local variable if you need to modify or read them multiple times at a single code location:
de: Die meisten Propertys von Godot-C#-Objekten, die auf ``GodotObject`` basieren (z.B. jeder ``Node`` wie ``Control`` oder jeder ``Node3D`` wie ``Camera3D``), erfordern native (Interop-) Aufrufe, da sie mit dem C++-Kern von Godot kommunizieren. Ziehen Sie in Erwägung, die Werte solcher Propertys einer lokalen Variable zuzuweisen, wenn Sie sie mehrfach an einer einzigen Codestelle ändern oder lesen müssen:
zh_cn: 大多数基于 ``GodotObject`` 的 Godot C# 对象（例如任何像 ``Control`` 这样的 ``Node`` 或 ``Camera3D`` 这样的 ``Node3D`` ）的属性，需要使用本地（互操作）调用，因为它们与 Godot 的 C++ 核心进行通信。如果你需要在单个代码位置多次修改或读取这些属性的值，请考虑将其分配给本地变量：
zh_tw: 大多數基於 ``GodotObject`` 的 Godot C# 物件（例如任何像 ``Control`` 這樣的 ``Node`` 或 ``Camera3D`` 這樣的 ``Node3D`` ）的屬性，需要使用本地（互動操作）呼叫，因為它們與 Godot 的 C++ 核心進行通信。如果你需要在單個程式碼位置多次修改或讀取這些屬性的值，請考慮將其分配給本地變數：

source: Passing raw arrays (such as ``byte[]``) or ``string`` to Godot's C# API requires marshalling which is comparatively pricey.
de: Die Übergabe von rohen Arrays (wie z.B. ``Byte[]``) oder ``Strings`` an Godots C#-API erfordert Marshalling, das vergleichsweise kostspielig ist.
zh_cn: 将原始数组（例如 ``byte[]`` ）或 ``string`` 传递给 Godot 的 C# API 需要进行数据封装，这在性能上相对较昂贵。
zh_tw: 將原始陣列（例如 ``byte[]`` ）或 ``string`` 傳遞給 Godot 的 C# API 需要進行資料封裝，這在性能上相對較昂貴。

source: The implicit conversion from ``string`` to ``NodePath`` or ``StringName`` incur both the native interop and marshalling costs as the ``string`` has to be marshalled and passed to the respective native constructor.
de: Die implizite Konvertierung von ``String`` in ``NodePath`` oder ``StringName`` verursacht sowohl native Interop- als auch Marshalling-Kosten, da der ``String`` gemarshallt und an den entsprechenden nativen Konstruktor übergeben werden muss.
zh_cn: 将 ``string`` 隐式转换为 ``NodePath`` 或 ``StringName`` 会产生本地互操作和数据封装的成本，因为必须将 ``string`` 封装并传递到相应的本地构造函数。
zh_tw: 將 ``string`` 隱式轉換為 ``NodePath`` 或 ``StringName`` 會產生本地互動操作和資料封裝的成本，因為必須將 ``string`` 封裝並傳遞到相應的本地建構子。

source: Using NuGet packages in Godot
de: Verwendung von NuGet-Paketen in Godot
zh_cn: 在 Godot 中使用 NuGet 包
zh_tw: 在 Godot 中使用 NuGet 套件

source: `NuGet <https://www.nuget.org/>`_ packages can be installed and used with Godot, as with any C# project. Many IDEs are able to add packages directly. They can also be added manually by adding the package reference in the ``.csproj`` file located in the project root:
de: `NuGet <https://www.nuget.org/>`_-Pakete können wie jedes C#-Projekt mit Godot installiert und verwendet werden. Viele IDEs können Pakete direkt hinzufügen. Sie können auch manuell hinzugefügt werden, indem die Paketreferenz in die Datei ``.csproj`` im Projekt-Root eingefügt wird:
zh_cn: `NuGet <https://www.nuget.org/>`_ 包可以与 Godot 一起安装和使用，就像任何 C# 项目一样。许多 IDE 都可以直接添加软件包，也可以通过在项目根目录下的 ``.csproj`` 文件中添加软件包引用来手动添加它们：
zh_tw: 可以在 Godot 中配合任意 C# 專案安裝與使用 `NuGet <https://www.nuget.org/>`_ 套件。許多 IDE 都支援直接新增套件，這些套件也可以通過在專案根目錄的 ``.csproj`` 檔內加上套件參照來手動新增：

source: As of Godot 3.2.3, Godot automatically downloads and sets up newly added NuGet packages the next time it builds the project.
de: Ab Godot 3.2.3 lädt Godot automatisch neu hinzugefügte NuGet-Pakete herunter und richtet sie ein, wenn das Projekt das nächste Mal kompiliert wird.
zh_cn: 从 Godot 3.2.3 开始，Godot 在下次构建项目时自动下载并设置新添加的 NuGet 包。
zh_tw: 從 Godot 3.2.3 開始，Godot 在下次建構專案時自動下載並設定新新增的 NuGet 包。

source: Profiling your C# code
de: Profilieren Ihres C#-Codes
zh_cn: 分析 C# 代码
zh_tw: 對 C# 程式進行程式碼剖析

source: The following tools may be used for performance and memory profiling of your managed code:
de: Die folgenden Tools können für die Leistungs- und Speicherprofilierung Ihres verwalteten Codes verwendet werden:
zh_cn: 以下工具可用于对托管代码进行性能和内存分析：
zh_tw: 以下工具可用於對託管程式碼進行性能和記憶體分析：

source: JetBrains Rider with dotTrace/dotMemory plugin.
de: JetBrains Rider mit dotTrace/DotMemory-Plugin.
zh_cn: JetBrains Rider 配合 dotTrace/dotMemory 插件。
zh_tw: JetBrains Rider 配合 dotTrace/dotMemory 外掛程式。

source: Standalone JetBrains dotTrace/dotMemory.
de: Das eigenständige JetBrains dotTrace/dotMemory.
zh_cn: 独立版的 JetBrains dotTrace/dotMemory。
zh_tw: 獨立版的 JetBrains dotTrace/dotMemory。

source: Profiling managed and unmanaged code at once is possible with both JetBrains tools and Visual Studio, but limited to Windows.
de: Das gleichzeitige Profiling von managed und unmanaged Code ist sowohl mit JetBrains-Tools als auch mit Visual Studio möglich, jedoch auf Windows beschränkt.
zh_cn: 使用 JetBrains tools 和 Visual Studio 可以同时对托管和非托管代码进行分析，但仅限于 Windows。
zh_tw: 使用 JetBrains tools 和 Visual Studio 可以同時對託管和非託管程式碼進行分析，但僅限於 Windows。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: Projects written in C# using Godot 4 currently cannot be exported to the web platform. To use C# on the web platform, consider Godot 3 instead. Android and iOS platform support is available as of Godot 4.2, but is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
de: Projekte, die in C# mit Godot 4 geschrieben wurden, können derzeit nicht auf die Web-Plattform exportiert werden. Um C# auf der Webplattform zu verwenden, sollten Sie stattdessen Godot 3 verwenden. Unterstützung für die Plattformen Android und iOS ist ab Godot 4.2 verfügbar, aber experimentell und :ref:`Es gelten einige Einschränkungen <doc_c_sharp_platforms>`.
zh_cn: 在 Godot 4 中用 C# 编写的项目目前无法导出到 Web 平台。如果要在 Web 平台上使用 C#，请考虑使用 Godot 3。 （C# 的）Android 和 iOS 平台支持从 Godot 4.2 开始提供，但仍处于实验阶段，并且 :ref:`存在一些限制 <doc_c_sharp_platforms>` 。

source: You need to (re)build the project assemblies whenever you want to see new exported variables or signals in the editor. This build can be manually triggered by clicking the **Build** button in the top right corner of the editor.
de: Sie müssen die Projekt-Assemblys (neu) erstellen, wenn Sie neue exportierte Variablen oder Signale im Editor sehen möchten. Dieser Build kann manuell ausgelöst werden, indem Sie auf die Schaltfläche **Build** in der oberen rechten Ecke des Editors klicken.
