Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_exports.po
Languages: de, zh_tw

source: C# exported properties
de: Exportierte Propertys in C#

source: In Godot, class members can be exported. This means their value gets saved along with the resource (such as the :ref:`scene <class_PackedScene>`) they're attached to. They will also be available for editing in the property editor. Exporting is done by using the ``[Export]`` attribute.
de: In Godot können Klassenmember exportiert werden. Das bedeutet, dass ihr Wert zusammen mit der Ressource (z. B. der :ref:`Szene <class_PackedScene>`) gespeichert wird, der sie zugeordnet sind. Sie sind dann auch für die Bearbeitung im Property-Editor verfügbar. Das Exportieren wird mit dem ``[Export]``-Attribut durchgeführt.
zh_tw: 在 Godot 中可以匯出類別成員。也就是說匯出成員的數值可以與附加的資源一起保存 (如 :ref:`場景 <class_PackedScene>`) 。匯出成員也能在屬性面板編輯器中編輯。使用 ``export`` 關鍵字來匯出：

source: In that example the value ``5`` will be saved, and after building the current project it will be visible in the property editor.
de: In diesem Beispiel wird der Wert ``5`` gespeichert und nach dem Erstellen des aktuellen Projekts im Property-Editor angezeigt.
zh_tw: 在該範例中，值「5」將被儲存，建置目前專案後，它將在屬性編輯器中可見。

source: One of the fundamental benefits of exporting member variables is to have them visible and editable in the editor. This way, artists and game designers can modify values that later influence how the program runs. For this, a special export syntax is provided.
de: Einer der größten Vorteile exportierter Variablen ist, dass diese im Editor sichtbar und veränderbar sind. Auf diese Weise können Grafiker, Spiele-Designer, etc. diese Werte verändert, die dann das Spielgeschehen beeinflussen. Hierfür gibt es eine spezielle Export-Syntax.
zh_tw: 匯出成員變數的其中一個基本的好處就是能在編輯器中瀏覽並編輯。這樣一來，如美術或遊戲設計師之後就能通過修改數值來更改程式的執行方式。為此有一個特殊的匯出語法。

source: Exporting can only be done with :ref:`Variant-compatible <doc_c_sharp_variant>` types.
de: Exportieren kann nur mit :ref:`Variant-kompatiblen <doc_c_sharp_variant>`-Typen durchgeführt werden.
zh_tw: 匯出只適用於:ref:`與 Variant 相容 <doc_c_sharp_variant>`的型別。

source: Exporting properties can also be done in GDScript, for information on that see :ref:`doc_gdscript_exports`.
de: Der Export von Propertys kann auch in GDScript erfolgen, Informationen dazu finden Sie unter :ref:`doc_gdscript_exports`.
zh_tw: GDScript 中也能夠匯出屬性，相關資訊見 :ref:`doc_gdscript_exports`。

source: Basic use
de: Grundlegende Verwendung

source: Exporting can work with fields and properties.
de: Exportieren funktioniert mit Feldern und Propertys.
zh_tw: 匯出套件、修正檔與 Mod

source: Exported members can specify a default value; otherwise, the `default value of the type <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_ is used instead.
de: Exportierte Member können einen Defaultwert angeben; andernfalls wird stattdessen der `Defaultwert des Typs <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_ verwendet.
zh_tw: 匯出的成員可以指定預設值；否則，將使用「型別的預設值 <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>」。

source: Resources and nodes can be exported.
de: Ressourcen und Nodes können exportiert werden.
zh_tw: 可以匯出資源和節點。

source: Grouping exports
de: Gruppieren der Exporte
zh_tw: 建立屬性群組

source: It is possible to group your exported properties inside the Inspector with the ``[ExportGroup]`` attribute. Every exported property after this attribute will be added to the group. Start a new group or use ``[ExportGroup("")]`` to break out.
de: Es ist möglich, die exportierten Propertys innerhalb des Inspektors mit dem Attribut ``[ExportGroup]`` zu gruppieren. Jede exportierte Property nach diesem Attribut wird zu dieser Gruppe hinzugefügt. Beginnen Sie eine neue Gruppe oder verwenden Sie ``[ExportGroup("")]``, um sie abzubrechen.
zh_tw: 可以使用“[ExportGroup]”屬性在屬性面板中對匯出的屬性進行群組。此屬性之後的每個匯出屬性都會新增到群組中。開始一個新群組或使用``[ExportGroup("")]`` 進行群組。

source: The second argument of the attribute can be used to only group properties with the specified prefix.
de: Das zweite Argument des Attributs kann verwendet werden, um nur Propertys mit dem angegebenen Präfix zu gruppieren.
zh_tw: 此屬性的第二個參數可用於僅對具有指定前綴的屬性進行群組。

source: Groups cannot be nested, use ``[ExportSubgroup]`` to create subgroups within a group.
de: Gruppen können nicht verschachtelt werden, verwenden Sie ``[ExportSubgroup]`` um Untergruppen innerhalb einer Gruppe zu erstellen.
zh_tw: 群組可以巢狀，請使用 ``[ExportSubgroup]`` 在群組中建立子群組。

source: You can also change the name of your main category, or create additional categories in the property list with the ``[ExportCategory]`` attribute.
de: Sie können auch den Namen Ihrer Hauptkategorie ändern oder zusätzliche Kategorien in der Property-Liste mit dem Attribut ``[ExportCategory]`` erstellen.
zh_tw: 您也可以變更主類別的名稱，或使用「[ExportCategory]」屬性在屬性列表中建立其他類別。

source: The list of properties is organized based on the class inheritance, and new categories break that expectation. Use them carefully, especially when creating projects for public use.
de: Die Liste der Propertys ist auf der Grundlage der Klassenvererbung organisiert, und neue Kategorien brechen mit dieser Erwartung. Verwenden Sie sie sorgfältig, insbesondere bei der Erstellung von Projekten für die öffentliche Nutzung.
zh_tw: 屬性列表是根據類別繼承來組織的，而新類別打破了這種期望。謹慎使用它們，尤其是在建立供公共使用的專案時。

source: Strings as paths
de: Strings als Pfade
zh_tw: 每行字數限制

source: Property hints can be used to export strings as paths
de: Property-Hints können verwendet werden, um Strings als Pfade zu exportieren
zh_tw: 屬性提示可用於將字串匯出為路徑

source: String as a path to a file.
de: String als Pfad zu einer Datei.
zh_tw: 使用檔案

source: String as a path to a directory.
de: String als Pfad zu einem Verzeichnis.
zh_tw: 字串是目錄的路徑。

source: String as a path to a file, custom filter provided as hint.
de: String als Pfad zu einer Datei, benutzerdefinierter Filter wird als Hint angegeben.
zh_tw: 字串是檔的路徑，在提示中提供自訂篩檢程式。

source: Using paths in the global filesystem is also possible, but only in scripts in tool mode.
de: Die Verwendung von Pfaden im globalen Dateisystem ist ebenfalls möglich, allerdings nur in Skripten im Tool-Modus.
zh_tw: 也可以使用全域檔案系統中的路徑，但是僅支援工具模式的腳本。

source: String as a path to a PNG file in the global filesystem.
de: String als Pfad zu einer PNG-Datei im globalen Dateisystem.
zh_tw: 字串是全域檔案系統中某個 PNG 檔的路徑。

source: String as a path to a directory in the global filesystem.
de: String als Pfad zu einem Verzeichnis im globalen Dateisystem.
zh_tw: 字串是全域檔案系統中某個目錄的路徑。

source: The multiline annotation tells the editor to show a large input field for editing over multiple lines.
de: Die mehrzeilige Annotation weist den Editor an, ein großes Eingabefeld zur Bearbeitung über mehrere Zeilen anzuzeigen.
zh_tw: 多行註解告訴編輯器顯示一個大的輸入欄位以進行多行編輯。

source: Limiting editor input ranges
de: Begrenzung der Eingabebereiche des Editors
zh_tw: 翻譯現有頁面

source: Using the range property hint allows you to limit what can be input as a value using the editor.
de: Mit Hilfe des Range Property-Hints können Sie einschränken, was mit dem Editor als Wert eingegeben werden kann.
zh_tw: 使用 range 屬性提示可以限制使用編輯器輸入的值。

source: Allow integer values from 0 to 20.
de: Erlauben von Integer-Werten zwischen 0 und 20.
zh_tw: 允許 0 到 20 之間的整數。

source: Allow integer values from -10 to 20.
de: Erlauben von Integer-Werten zwischen -10 und 20.
zh_tw: 允許 -10 到 20 之間的整數。

source: Allow floats from -10 to 20 and snap the value to multiples of 0.2.
de: Erlauben von Floats zwischen -10 und 20 und Einrasten des Wertes auf Vielfache von 0.2.
zh_tw: 允許 -10 到 20 之間的數，對齊到 0.2 的倍數。

source: If you add the hints "or_greater" and/or "or_less" you can go above or below the limits when adjusting the value by typing it instead of using the slider.
de: Wenn Sie die Hints "or_greater" und/oder "or_less" hinzufügen, können Sie beim Einstellen des Wertes über oder unter die Grenzen gehen, indem Sie ihn eingeben, anstatt den Schieberegler zu verwenden.
zh_tw: 如果新增提示“or_greater”和/或“or_less”，則在調整值時可以透過鍵入而不是使用滑桿來高於或低於限制。

source: Floats with easing hint
de: Floats mit Easing-Hint
zh_tw: 帶緩動提示的浮點數

source: Display a visual representation of the 'ease()' function when editing.
de: Zeigt eine visuelle Darstellung der Funktion 'ease()' bei der Bearbeitung an.
zh_tw: 編輯時顯示“ease()”函式的可視化表示。

source: Colors
de: Farben
zh_tw: 顏色

source: Regular color given as red-green-blue-alpha value.
de: Normale Farbe, die als Rot-Grün-Blau-Alpha-Wert angegeben wird.
zh_tw: 使用紅、綠、藍、Alpha 值指定的普通顏色。

source: Color given as red-green-blue value (alpha will always be 1).
de: Die Farbe wird als Rot-Grün-Blau-Wert angegeben (Alpha ist immer 1).
zh_tw: 使用紅、綠、藍值指定的顏色（Alpha 始終為 1）。

source: Since Godot 4.0, nodes can be directly exported without having to use NodePaths.
de: Seit Godot 4.0 können Nodes direkt exportiert werden, ohne NodePaths verwenden zu müssen.
zh_tw: 從Godot 4.0開始，可以直接匯出節點，而無需使用NodePaths。

source: Custom node classes can also be used, see :ref:`doc_c_sharp_global_classes`.
de: Es können auch eigene Node-Klassen verwendet werden, siehe :ref:`doc_c_sharp_global_classes`.
zh_tw: 也可以使用自訂節點類，請參閱 doc_c_sharp_global_classes`。

source: Exporting NodePaths like in Godot 3.x is still possible, in case you need it:
de: Das Exportieren von NodePaths wie in Godot 3.x ist immer noch möglich, falls Sie es benötigen:
zh_tw: 如果需要，仍然可以和 Godot 3.x 中一樣匯出 NodePath：

source: Resources
de: Ressourcen
zh_tw: 資源

source: In the Inspector, you can then drag and drop a resource file from the FileSystem dock into the variable slot.
de: Im Inspektor können Sie dann eine Ressourcendatei aus dem Dateisystem-Dock per Drag&Drop in den Variablenslot ziehen.
zh_tw: 在屬性面板中，您可以將資源檔案從檔案系統停靠欄拖曳到變數槽中。

source: Opening the inspector dropdown may result in an extremely long list of possible classes to create, however. Therefore, if you specify a type derived from Resource such as:
de: Das Öffnen des Inspektor-Dropdowns kann jedoch zu einer extrem langen Liste möglicher zu erstellender Klassen führen. Wenn Sie daher einen von Resource abgeleiteten Typ angeben, z.B.:
zh_tw: 然而，開啟屬性面板下拉列表可能會導致要建立的可能類別的列表非常長。因此，如果您指定從 Resource 衍生的型別，例如：

source: The drop-down menu will be limited to AnimationNode and all its inherited classes. Custom resource classes can also be used, see :ref:`doc_c_sharp_global_classes`.
de: Das Dropdown-Menü wird auf AnimationNode und alle seine geerbten Klassen beschränkt. Benutzerdefinierte Ressourcenklassen können ebenfalls verwendet werden, siehe :ref:`doc_c_sharp_global_classes`.
zh_tw: 下拉式選單將僅限於 AnimationNode 及其所有繼承類別。也可以使用自訂資源類，請參閱 doc_c_sharp_global_classes。

source: It must be noted that even if the script is not being run while in the editor, the exported properties are still editable. This can be used in conjunction with a :ref:`script in "tool" mode <doc_gdscript_tool_mode>`.
de: Es ist zu beachten, dass die exportierten Propertys auch dann editierbar sind, wenn das Skript im Editor nicht ausgeführt wird. Dies kann in Verbindung mit einem :ref:`Skript im "Tool"-Modus <doc_gdscript_tool_mode>` verwendet werden.
zh_tw: 請特別注意，即使腳本不是在編輯器中執行，匯出屬性依然可以被編輯。這個功能可以與 :ref:`「工具」模式的腳本 <doc_gdscript_tool_mode>` 一起使用。

source: Exporting bit flags
de: Exportieren von Bit-Flags
zh_tw: 匯出位元旗標

source: Members whose type is an enum with the ``[Flags]`` attribute can be exported and their values are limited to the members of the enum type. The editor will create a widget in the Inspector, allowing to select none, one, or multiple of the enum members. The value will be stored as an integer.
de: Member, deren Typ ein Enum mit dem Attribut ``[Flags]`` ist, können exportiert werden und ihre Werte sind auf die Member des Enum-Typs beschränkt. Der Editor erzeugt ein Widget im Inspektor, das es erlaubt, keines, eines oder mehrere der Enum-Mitglieder auszuwählen. Der Wert wird als Integer gespeichert.
zh_tw: 可以匯出型別為具有「[Flags]」屬性的列舉的成員，並且它們的值僅限於列舉型別的成員。編輯器將在屬性面板中建立一個小元件，允許選擇不選擇、選擇一個或多個列舉成員。該值將儲存為整數。

source: Integers used as bit flags can store multiple ``true``/``false`` (boolean) values in one property. By using the ``Flags`` property hint, they can be set from the editor.
de: Integer, die als Bit-Flags verwendet werden, können mehrere ``true``/``false`` (boolesche)-Werte in einer Property speichern. Mit dem Property-Hinweis ``Flags`` können sie im Editor gesetzt werden.
zh_tw: 作為位元旗標的整數可以在單一屬性內儲存多個 ``true``/``false`` (布林) 值。只需要使用匯出提示 ``int, FLAGS, …`` 就可以在編輯器中設定：

source: You must provide a string description for each flag. In this example, ``Fire`` has value 1, ``Water`` has value 2, ``Earth`` has value 4 and ``Wind`` corresponds to value 8. Usually, constants should be defined accordingly (e.g. ``private const int ElementWind = 8`` and so on).
de: Sie müssen für jedes Flag eine Beschreibung angeben. In diesem Beispiel hat ``Fire`` den Wert 1, ``Water`` den Wert 2, ``Earth`` den Wert 4 und ``Wind`` entspricht dem Wert 8. Normalerweise sollten Konstanten entsprechend definiert werden (z.B. ``private const int ElementWind = 8`` und so weiter).
zh_tw: 必須為每個旗標提供說明字串。在這個例子中， ``Fire`` 的值為 1， ``Water`` 為 2， ``Earth`` 為 4 而 ``Wind`` 則為 8。通常必須定義對應的常數 (如： ``const ELEMENT_WIND = 8`` 等)。

source: You can add explicit values using a colon:
de: Sie können explizite Werte mit einem Doppelpunkt hinzufügen:
zh_tw: 您可以使用冒號新增明確的值：

source: Only power of 2 values are valid as bit flags options. The lowest allowed value is 1, as 0 means that nothing is selected. You can also add options that are a combination of other flags:
de: Als Bit-Flag-Optionen sind nur Werte in 2er-Potenzen zulässig. Der niedrigste zulässige Wert ist 1, da 0 bedeutet, dass nichts ausgewählt ist. Sie können auch Optionen hinzufügen, die eine Kombination aus anderen Flags sind:
zh_tw: 只有 2 的冪值作為位元旗標選項才有效。允許的最低值為 1，因為 0 表示未選擇任何內容。您也可以新增其他旗標組合的選項：

source: Export annotations are also provided for the physics and render layers defined in the project settings.
de: Für die in den Projekteinstellungen definierten Physik- und Renderebenen werden ebenfalls Exportkommentare bereitgestellt.
zh_tw: 匯出提示在專案設定中也定義了物理與算繪層：

source: Using bit flags requires some understanding of bitwise operations. If in doubt, use boolean variables instead.
de: Die Verwendung von Bit-Flags erfordert ein gewisses Verständnis der bitweisen Operationen. Verwenden Sie im Zweifelsfall stattdessen boolesche Variablen.
zh_tw: 使用位元旗標會需要理解位元運算子。若不確定的話，則應該使用布林變數。

source: Exporting enums
de: Exportieren von Enums
zh_tw: 匯出選單

source: Members whose type is an enum can be exported and their values are limited to the members of the enum type. The editor will create a widget in the Inspector, enumerating the following as "Thing 1", "Thing 2", "Another Thing". The value will be stored as an integer.
de: Member, deren Typ ein Enum ist, können exportiert werden und ihre Werte sind auf die Member des Enum-Typs beschränkt. Der Editor erstellt ein Widget im Inspector, das die folgenden Elemente aufzählt: "Ding 1", "Ding 2", "Noch ein Ding". Der Wert wird als Integer gespeichert.
zh_tw: 可以匯出列舉型別的成員，且其值僅限於列舉型別的成員。編輯器將在屬性面板中建立一個小元件，將以下內容列舉為「Thing 1」、「Thing 2」、「Another Thing」。該值將儲存為整數。

source: Integer and string members can also be limited to a specific list of values using the ``[Export]`` annotation with the ``PropertyHint.Enum`` hint. The editor will create a widget in the Inspector, enumerating the following as Warrior, Magician, Thief. The value will be stored as an integer, corresponding to the index of the selected option (i.e. ``0``, ``1``, or ``2``).
de: Integer- und String-Members können auch auf eine bestimmte Liste von Werten beschränkt werden, indem die ``[Export]``-Annotation mit dem ``PropertyHint.Enum``-Hinweis verwendet wird. Der Editor erstellt ein Widget im Inspektor, das die folgenden Werte aufzählt: Warrior, Magician, Thief. Der Wert wird als Integer gespeichert, wobei der Index der ausgewählten Option entspricht (d.h. ``0``, ``1`` oder ``2``).
zh_tw: 也可以使用帶有“PropertyHint.Enum”提示的“[Export]”註釋將整數和字串成員限制為特定的值列表。編輯器將在 Inspector 中建立一個小元件，列舉以下角色：戰士、魔術師、小偷。該值將儲存為整數，對應於所選選項的索引（即“0”、“1”或“2”）。

source: If the type is ``string``, the value will be stored as a string.
de: Wenn der Typ ``String`` ist, wird der Wert als String gespeichert.
zh_tw: 如果是 ``string`` , 檔將從該路徑載入.

source: If you want to set an initial value, you must specify it explicitly:
de: Wenn Sie einen Initialwert setzen wollen, müssen Sie diesen explizit angeben:
zh_tw: 如果要設定初始值，則必須明確指定：

source: Exporting collections
de: Exportieren von Collections
zh_tw: 其他建議

source: As explained in the :ref:`C# Variant <doc_c_sharp_variant>` documentation, only certain C# arrays and the collection types defined in the ``Godot.Collections`` namespace are Variant-compatible, therefore, only those types can be exported.
de: Wie in der :ref:`C# Variant <doc_c_sharp_variant>`-Dokumentation erläutert, sind nur bestimmte C#-Arrays und die im ``Godot.Collections``-Namespace definierten Collection-Typen Variant-kompatibel, daher können nur diese Typen exportiert werden.
zh_tw: 如 C# Variant <doc_c_sharp_variant> 檔案中所述，只有某些 C# 陣列和「Godot.Collections」命名空間中定義的集合型別是 Variant 相容的，因此，只能匯出這些型別。

source: Exporting Godot arrays
de: Exportieren von Godot-Arrays
zh_tw: 匯出陣列

source: Using the generic ``Godot.Collections.Array<T>`` allows to specify the type of the array elements which will be used as a hint for the editor. The Inspector will restrict the elements to the specified type.
de: Die Verwendung des generischen ``Godot.Collections.Array<T>`` erlaubt die Angabe des Typs der Array-Elemente, die als Hint für den Editor verwendet werden. Der Inspektor beschränkt die Elemente auf den angegebenen Typ.
zh_tw: 使用通用的「Godot.Collections.Array<T>」允許指定將用作編輯器提示的陣列元素的型別。屬性面板會將元素限制為指定型別。

source: The default value of Godot arrays is null, a different default can be specified:
de: Der Defaultwert von Godot-Arrays ist null, ein anderer Defaultwert kann angegeben werden:
zh_tw: Godot 陣列的預設值為 null，可以指定不同的預設值：

source: Arrays with specified types which inherit from resource can be set by drag-and-dropping multiple files from the FileSystem dock.
de: Arrays mit bestimmten Typen, die von Resource erben, können durch Drag&Drop mehrerer Dateien aus dem Dateisystem-Dock gesetzt werden.
zh_tw: 若匯出的陣列指定了從 Resource 繼承來的型別，則陣列值在屬性面板中就可以從檔案系統中一次拖放多個檔案過來。

source: Exporting Godot dictionaries
de: Exportieren von Godot-Dictionarys
zh_tw: 其他建議

source: Using the generic ``Godot.Collections.Dictionary<TKey, TValue>`` allows to specify the type of the key and value elements of the dictionary.
de: Die Verwendung des generischen ``Godot.Collections.Dictionary<TKey, TValue>`` erlaubt es, den Typ der Key- und Value-Elemente des Dictionarys zu spezifizieren.
zh_tw: 使用通用的「Godot.Collections.Dictionary<TKey, TValue>」允許指定字典的鍵和值元素的型別。

source: Typed dictionaries are currently unsupported in the Godot editor, so the Inspector will not restrict the types that can be assigned, potentially resulting in runtime exceptions.
de: Typisierte Dictionarys werden derzeit im Godot-Editor nicht unterstützt, so dass der Inspektor die Typen, die zugewiesen werden können, nicht einschränkt, was zu Laufzeit-Exceptions führen kann.
zh_tw: 目前 Godot 編輯器不支援型別化字典，因此 Inspector 不會限制可以指派的型別，這可能會導致執行時期異常。

source: The default value of Godot dictionaries is null, a different default can be specified:
de: Der Defaultwert von Godot-Dictionarys ist null, ein anderer Defaultwert kann angegeben werden:
zh_tw: Godot 字典的預設值為 null，可以指定不同的預設值：

source: Exporting C# arrays
de: Exportieren von C#-Arrays
zh_tw: 匯出陣列

source: C# arrays can exported as long as the element type is a :ref:`Variant-compatible <doc_c_sharp_variant>` type.
de: C#-Arrays können exportiert werden, solange der Elementtyp ein :ref:`Variant-kompatibler <doc_c_sharp_variant>`-Typ ist.
zh_tw: 只要元素型別是 Variant 相容的 <doc_c_sharp_variant> 型別，就可以匯出 C# 陣列。

source: The default value of C# arrays is null, a different default can be specified:
de: Der Defaultwert von C#-Arrays ist null, ein anderer Default kann angegeben werden:
zh_tw: C# 陣列的預設值為 null，可以指定不同的預設值：

source: Setting exported variables from a tool script
de: Festlegen exportierter Variablen aus einem Tool-Skript
zh_tw: 從工具腳本中設定匯出變數

source: When changing an exported variable's value from a script in :ref:`doc_gdscript_tool_mode`, the value in the inspector won't be updated automatically. To update it, call :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` after setting the exported variable's value.
de: Wenn Sie den Wert einer exportierten Variablen aus einem Skript im :ref:`doc_gdscript_tool_mode` ändern, wird der Wert im Inspektor nicht automatisch aktualisiert. Um ihn zu aktualisieren, rufen Sie :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` auf, nachdem Sie den Wert der exportierten Variable gesetzt haben.
zh_tw: 從 :ref:`doc_gdscript_tool_mode` 腳本中更改匯出變數值是，顯示在屬性面板上的值不會自動更新。要更新屬性面板上的值，則需要在設定匯出變數值後呼叫 :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` 。

source: Advanced exports
de: Fortgeschrittene Exporte
zh_tw: 進階匯出

source: Not every type of export can be provided on the level of the language itself to avoid unnecessary design complexity. The following describes some more or less common exporting features which can be implemented with a low-level API.
de: Nicht jede Art von Export kann auf der Sprachebene selbst bereitgestellt werden, um unnötige Designkomplexität zu vermeiden. Im Folgenden werden einige mehr oder weniger häufig verwendete Exportfunktionen beschrieben, die mit einer Low-Level-API implementiert werden können.
zh_tw: 為了避免不必要的複雜設計，並非所有匯出型別都有在語言層面上提供。下面說明了一些能使用低階 API 實作的常見匯出功能。

source: Before reading further, you should get familiar with the way properties are handled and how they can be customized with :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Get() <class_Object_private_method__get>`, and :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>` methods as described in :ref:`doc_accessing_data_or_logic_from_object`.
de: Bevor Sie weiter lesen, sollten Sie sich mit der Art und Weise vertraut machen, wie Propertys behandelt werden und wie sie mit :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Get() <class_Object_private_method__get>`, und :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>`-Methoden angepasst werden können, wie in :ref:`doc_accessing_data_or_logic_from_object` beschrieben.

source: For binding properties using the above methods in C++, see :ref:`doc_binding_properties_using_set_get_property_list`.
de: Informationen zum Binden von Propertys mit den oben genannten Methoden in C++ finden Sie unter :ref:`doc_binding_properties_using_set_get_property_list`.
zh_tw: 若要在 C++ 中以上述方法繫結屬性，請參考 :ref:`doc_binding_properties_using_set_get_property_list` 。

source: The script must operate in the ``tool`` mode so the above methods can work from within the editor.
de: Das Skript muss im ``Tool`` -Modus arbeiten, damit die oben genannten Methoden im Editor ausgeführt werden können.
zh_tw: 腳本必須為 ``tool`` 模式，才可在編輯器中使用上述方法。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Nodes
zh_tw: 節點
