Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_style_guide.po
Languages: de

source: Having well-defined and consistent coding conventions is important for every project, and Godot is no exception to this rule.
de: Für jedes Projekt ist es wichtig, klar definierte und konsistente Coding-Konventionen zu haben und Godot ist keine Ausnahme von dieser Regel.

source: This page contains a coding style guide, which is followed by developers of and contributors to Godot itself. As such, it is mainly intended for those who want to contribute to the project, but since the conventions and guidelines mentioned in this article are those most widely adopted by the users of the language, we encourage you to do the same, especially if you do not have such a guide yet.
de: Diese Seite enthält eine Code-Styleguide, der von den Entwicklern von Godot und denjenigen, die zu Godot selbst beitragen, befolgt wird. Als solches ist es hauptsächlich für diejenigen gedacht, die zu dem Projekt beitragen möchten. Da die in diesem Artikel erwähnten Konventionen und Richtlinien jedoch von den meisten Benutzern der Sprache übernommen wurden, möchten wir Sie ermutigen, dasselbe zu tun, insbesondere wenn Sie noch keinen solchen Leitfaden haben.

source: This article is by no means an exhaustive guide on how to follow the standard coding conventions or best practices. If you feel unsure of an aspect which is not covered here, please refer to more comprehensive documentation, such as `C# Coding Conventions <https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/inside-a-program/coding-conventions>`_ or `Framework Design Guidelines <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/naming-guidelines>`_.
de: Dieser Artikel ist keineswegs eine vollständige Anleitung zur Befolgung der Standard-Codekonventionen oder Best Practices. Wenn Sie sich bei einem der hier behandelten Aspekte nicht sicher sind, lesen Sie bitte eine umfassendere Dokumentation, z.B. `C# Coding-Konventionen <https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/inside-a-program/coding-conventions>`_ oder `Framework Designrichtlinien <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/naming-guidelines>`_.

source: Language specification
de: Sprachspezifikation

source: Godot currently uses **C# version 7.0** in its engine and example source code. So, before we move to a newer version, care must be taken to avoid mixing language features only available in C# 7.1 or later.
de: Godot verwendet derzeit **C# Version 7.0** in seiner Engine und im Beispielquellcode. Bevor wir zu einer neueren Version wechseln, muss darauf geachtet werden, dass keine Sprachfeatures gemischt werden, die nur in C# 7.1 oder höher verfügbar sind.

source: For detailed information on C# features in different versions, please see `What's New in C# <https://docs.microsoft.com/en-us/dotnet/csharp/whats-new/>`_.
de: Ausführliche Informationen zu C#-Funktionen in verschiedenen Versionen finden Sie unter `Was ist neu in C# <https://docs.microsoft.com/en-us/dotnet/csharp/whats-new/>`_.

source: Formatting
de: Formatierung

source: General guidelines
de: Generelle Richtlinien

source: Use line feed (**LF**) characters to break lines, not CRLF or CR.
de: Verwenden Sie Line Feed (**LF**) für Zeilenumbrüche, nicht CRLF oder CR.

source: Use one line feed character at the end of each file, except for `csproj` files.
de: Verwenden Sie einen Zeilenumbruch am Ende jeder Datei, mit Ausnahme der `csproj` Datei.

source: Use **UTF-8** encoding without a `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_.
de: Verwenden Sie die **UTF-8**-Codierung ohne eine `Byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_.

source: Use **4 spaces** instead of tabs for indentation (which is referred to as "soft tabs").
de: Verwenden Sie **4 Leerzeichen** statt Tabulatoren zum Einrücken (dies wird als "weiche Tabulatoren" bezeichnet).

source: Consider breaking a line into several if it's longer than 100 characters.
de: Erwägen Sie, eine Zeile in mehrere Zeilen aufzuteilen, wenn sie länger als 100 Zeichen ist.

source: Line breaks and blank lines
de: Zeilenumbrüche und Leerzeilen

source: For a general indentation rule, follow `the "Allman Style" <https://en.wikipedia.org/wiki/Indentation_style#Allman_style>`_ which recommends placing the brace associated with a control statement on the next line, indented to the same level:
de: Als allgemeine Einrückungsregel gilt `der "Allman-Stil" <https://en.wikipedia.org/wiki/Indentation_style#Allman_style>`_, der empfiehlt, die zu einer Steueranweisung gehörende geschweifte Klammer in die nächste Zeile zu setzen, und zwar auf der gleichen Ebene eingerückt:

source: However, you may choose to omit line breaks inside brackets:
de: Sie können jedoch auch Zeilenumbrüche innerhalb von Klammern weglassen:

source: For simple property accessors.
de: Für einfache Property-Zugriffsfunktionen.

source: For simple object, array, or collection initializers.
de: Für einfache Objekt-, Array- oder Collection Initializer.

source: For abstract auto property, indexer, or event declarations.
de: Für abstrakte Auto-Property-, Indexer- oder Event-Deklarationen.

source: Insert a blank line:
de: Fügen Sie eine Leerzeile ein:

source: After a list of ``using`` statements.
de: Nach einer Liste von ``using``-Anweisungen.

source: Between method, properties, and inner type declarations.
de: Zwischen Methoden, Propertys und inneren Typ-Deklarationen.

source: At the end of each file.
de: Am Ende jeder Datei.

source: Field and constant declarations can be grouped together according to relevance. In that case, consider inserting a blank line between the groups for easier reading.
de: Feld- und Konstantendeklarationen können nach Relevanz gruppiert werden. In diesem Fall sollten Sie eine Leerzeile zwischen den Gruppen einfügen, um das Lesen zu erleichtern.

source: Avoid inserting a blank line:
de: Vermeiden Sie, Leerzeilen einzufügen:

source: After ``{``, the opening brace.
de: Nach ``{``, der öffnenden Klammer.

source: Before ``}``, the closing brace.
de: Vor ``}``, der schließenden Klammer.

source: After a comment block or a single-line comment.
de: Nach einem Kommentar-Block oder einem einzeiligem Kommentar.

source: Adjacent to another blank line.
de: Angrenzend an eine weitere Leerzeile.

source: Using spaces
de: Verwendung von Leerzeichen

source: Insert a space:
de: Fügen Sie ein Leerzeichen ein:

source: Around a binary and ternary operator.
de: Um einen binären und tertiären Operator.

source: Between an opening parenthesis and ``if``, ``for``, ``foreach``, ``catch``, ``while``, ``lock`` or ``using`` keywords.
de: Zwischen einer öffnenden Klammer und ``if``, ``for``, ``foreach``, ``catch``, ``while``, ``lock`` oder ``using``-Schlüsselwörtern.

source: Before and within a single line accessor block.
de: Vor und innerhalb eines einzeiligen Zugriffsblocks.

source: Between accessors in a single line accessor block.
de: Zwischen Zugriffsfunktionen in einem einzeiligen Zugriffsblock.

source: After a comma which is not at the end of a line.
de: Nach einem Komma, das nicht am Ende der Zeile steht.

source: After a semicolon in a ``for`` statement.
de: Nach einem Semikolon in einer ``for``-Anweisung.

source: After a colon in a single line ``case`` statement.
de: Nach einem Doppelpunkt in einer einzeiligen ``case``-Anweisung.

source: Around a colon in a type declaration.
de: Um einen Doppelpunkt in einer Typ-Deklaration.

source: Around a lambda arrow.
de: Um einen Lambda-Pfeil.

source: After a single-line comment symbol (``//``), and before it if used at the end of a line.
de: Nach einem einzeiligen Kommentar-Symbol (``//``) und davor, wenn es am Ende einer Zeile genutzt wird.

source: Do not use a space:
de: Verwenden Sie kein Leerzeichen:

source: After type cast parentheses.
de: Nach Typ-Cast-Klammern.

source: Within single line initializer braces.
de: Innerhalb einzeiliger Initialisierer-Klammern.

source: The following example shows a proper use of spaces, according to some of the above mentioned conventions:
de: Das folgende Beispiel zeigt die korrekte Verwendung von Leerzeichen gemäß einigen der oben genannten Konventionen:

source: Naming conventions
de: Namenskonventionen

source: Use **PascalCase** for all namespaces, type names and member level identifiers (i.e. methods, properties, constants, events), except for private fields:
de: Verwenden Sie **PascalCase** für alle Namespaces, Typnamen und Bezeichner auf Member-Ebene (d.h. Methoden, Propertys, Konstanten, Events), außer für private Felder:

source: Use **camelCase** for all other identifiers (i.e. local variables, method arguments), and use an underscore (``_``) as a prefix for private fields (but not for methods or properties, as explained above):
de: Verwenden Sie **camelCase** für alle anderen Bezeichner (d.h. lokale Variablen, Methodenargumente), verwenden Sie einen Unterstrich (``_``) als Präfix für private Felder (jedoch nicht für Methoden oder Propertys, wie oben erläutert):

source: There's an exception with acronyms which consist of two letters, like ``UI``, which should be written in uppercase letters where PascalCase would be expected, and in lowercase letters otherwise.
de: Eine Ausnahme bilden Akronyme, die aus zwei Buchstaben bestehen, wie z.B. ``UI``, die dort, wo PascalCase erwartet wird, in Großbuchstaben und ansonsten in Kleinbuchstaben geschrieben werden sollten.

source: Note that ``id`` is **not** an acronym, so it should be treated as a normal identifier:
de: Beachten Sie, dass ``id`` **kein** Akronym ist, daher sollte es wie ein normaler Bezeichner behandelt werden:

source: It is generally discouraged to use a type name as a prefix of an identifier, like ``string strText`` or ``float fPower``, for example. An exception is made, however, for interfaces, which **should**, in fact, have an uppercase letter ``I`` prefixed to their names, like ``IInventoryHolder`` or ``IDamageable``.
de: Es wird allgemein davon abgeraten, einen Typnamen als Präfix eines Bezeichners zu verwenden, wie z. B. ``string strText`` oder ``float fPower``. Eine Ausnahme wird jedoch für Interfaces gemacht, denen tatsächlich der Großbuchstabe ``I`` vor ihren Namen vorangestellt werden **sollte**, z.B. ``IInventoryHolder`` oder ``IDamageable``.

source: Lastly, consider choosing descriptive names and do not try to shorten them too much if it affects readability.
de: Schließlich sollten Sie beschreibende Namen wählen und nicht versuchen, sie zu sehr zu kürzen, wenn dies die Lesbarkeit beeinträchtigt.

source: For instance, if you want to write code to find a nearby enemy and hit it with a weapon, prefer:
de: Wenn Sie beispielsweise Code schreiben möchten, um einen nahe gelegenen Gegner zu finden und ihn mit einer Waffe zu treffen, bevorzugen Sie:

source: Rather than:
de: Besser als:

source: Member variables
de: Membervariablen

source: Don't declare member variables if they are only used locally in a method, as it makes the code more difficult to follow. Instead, declare them as local variables in the method's body.
de: Deklarieren Sie keine Membervariablen, wenn sie nur lokal in einer Methode verwendet werden, da dies das Lesen des Codes erschwert. Deklarieren Sie sie stattdessen als lokale Variablen in der Methode.

source: Local variables
de: Lokale Variablen

source: Declare local variables as close as possible to their first use. This makes it easier to follow the code, without having to scroll too much to find where the variable was declared.
de: Deklarieren Sie lokale Variablen so nah wie möglich am Ort ihrer ersten Verwendung. Dies erleichtert das Lesen des Codes, ohne zu viel scrollen zu müssen, um herauszufinden, wo die Variable deklariert wurde.

source: Implicitly typed local variables
de: Implizit typisierte lokale Variablen

source: Consider using implicitly typing (``var``) for declaration of a local variable, but do so **only when the type is evident** from the right side of the assignment:
de: Erwägen Sie die implizite Typisierung (``var``) für die Deklaration einer lokalen Variablen, aber tun Sie dies **nur, wenn der Typ offensichtlich ist** (auf der rechten Seite der Zuweisung ):

source: Other considerations
de: Weitere Überlegungen

source: Use explicit access modifiers.
de: Verwenden Sie explizite Zugriffsmodifikatoren.

source: Use properties instead of non-private fields.
de: Verwenden Sie Propertys anstelle von nicht privaten Feldern.

source: Use modifiers in this order: ``public``/``protected``/``private``/``internal``/``virtual``/``override``/``abstract``/``new``/``static``/``readonly``.
de: Verwenden Sie Modifikatoren in dieser Reihenfolge: ``public``/``protected``/``private``/``internal``/``virtual``/``override``/``abstract``/``new``/``static``/``readonly``.

source: Avoid using fully-qualified names or ``this.`` prefix for members when it's not necessary.
de: Vermeiden Sie die Verwendung vollständig qualifizierter Namen oder des Präfixes ``this.`` für Member, wenn dies nicht erforderlich ist.

source: Remove unused ``using`` statements and unnecessary parentheses.
de: Entfernen Sie nicht verwendete ``using``-Anweisungen und unnötige Klammern.

source: Consider omitting the default initial value for a type.
de: Lassen Sie den Default-Initialwert für einen Typ weg.

source: Consider using null-conditional operators or type initializers to make the code more compact.
de: Erwägen Sie die Verwendung von Null-Bedingungsoperatoren oder Typinitialisierern, um den Code kompakter zu gestalten.

source: Use safe cast when there is a possibility of the value being a different type, and use direct cast otherwise.
de: Verwenden Sie einen sicheren Cast, wenn die Möglichkeit besteht, dass der Wert ein anderer Typ ist und verwenden Sie andernfalls einen direkten Cast.

source: Translation status
de: Übersetzungsstatus
