Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: de, zh_cn, zh_tw

source: C# basics
de: C#-Grundlagen
zh_cn: C# 基础
zh_tw: C# 基礎

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: This page provides a brief introduction to C#, both what it is and how to use it in Godot. Afterwards, you may want to look at :ref:`how to use specific features <doc_c_sharp_features>`, read about the :ref:`differences between the C# and the GDScript API <doc_c_sharp_differences>`, and (re)visit the :ref:`Scripting section <doc_scripting>` of the step-by-step tutorial.
de: Diese Seite bietet eine kurze Einführung in C#, sowohl was es ist, als auch wie man es in Godot verwendet. Danach sollten Sie sich :ref:`Wie man bestimmte Features verwendet <doc_c_sharp_features>` ansehen, etwas über die :ref:`Unterschiede zwischen der C#- und der GDScript-API <doc_c_sharp_differences>` lesen und den :ref:`Skripting-Abschnitt <doc_scripting>` des Schritt-für-Schritt-Tutorials (erneut) besuchen.
zh_cn: 这个页面简单介绍了 C# 是什么，以及如何在 Godot 中使用 C#。然后，你可能想看看 :ref:`如何使用特定功能 <doc_c_sharp_features>` ，阅读有关 :ref:`C# 和 GDScript API 之间的差异 <doc_c_sharp_differences>` 并（重新）访问逐步教程的 :ref:`编写脚本部分 <doc_scripting>` 。
zh_tw: 本頁提供了 C# 的簡介，包含 C# 為何以及如何在 Godot 中使用。之後，建議您也閱讀 :ref:`如何使用特定功能 <doc_c_sharp_features>` 、:ref:`C# 與 GDScript API 的比較 <doc_c_sharp_differences>` 以及 (再次) 閱讀按部就班教學中的 :ref:`腳本段落 <doc_scripting>` 。

source: C# is a high-level programming language developed by Microsoft. In Godot, it is implemented with .NET 6.0.
de: C# ist eine von Microsoft entwickelte High-Level-Programmiersprache. In Godot wird sie mit .NET 6.0 implementiert.
zh_cn: C# 是由 Microsoft 开发的高级编程语言。在 Godot 中，它是使用 .NET 6.0 实现的。
zh_tw: C# 是由 Microsoft 開發的高級程式設計語言。在 Godot 中，它是使用 .NET 6.0 實作的。

source: This is **not** a full-scale tutorial on the C# language as a whole. If you aren't already familiar with its syntax or features, see the `Microsoft C# guide <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ or look for a suitable introduction elsewhere.
de: Dies ist **keine** umfassende Anleitung zur Sprache C# im Ganzen. Wenn Sie mit der Syntax oder den Funktionen von C# noch nicht vertraut sind, lesen Sie das `Microsoft C#-Handbuch <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ oder suchen Sie an anderer Stelle nach einer geeigneten Einführung.
zh_cn: 这 **不是** 一个关于 C# 语言整体的全面教程。如果你还不熟悉其语法或功能，请参阅 `Microsoft C# 指南 <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ 或在其他地方寻找合适的介绍。
zh_tw: 本教學 **不是** 完整的 C# 語言教學。若您不熟悉 C# 的語法與功能，請參考 `Microsoft C# 指南 <https://docs.microsoft.com/zh-tw/dotnet/csharp/index>`_ 或尋找其它合適的介紹。

source: Prerequisites
de: Voraussetzungen
zh_cn: 先决条件
zh_tw: 先決條件

source: Godot bundles the parts of .NET needed to run already compiled games. However, Godot does not bundle the tools required to build and compile games, such as MSBuild and the C# compiler. These are included in the .NET SDK, and need to be installed separately.
de: Godot bringt die Teile von .NET, die zum Ausführen bereits kompilierter Spiele benötigt werden mit. Allerdings bringt Godot nicht die Tools mit, die zum Erstellen und Kompilieren von Spielen erforderlich sind, wie MSBuild und den C#-Compiler. Diese sind im .NET SDK enthalten und müssen separat installiert werden.
zh_cn: Godot 捆绑了运行已经编译好的游戏所需的 .NET 部分，但 Godot 不包括构建和编译游戏所需的 MSBuild 和 C# 编译器等工具。这些工具包含在 .NET SDK 中，需要单独安装。
zh_tw: Godot 捆綁了運作已經編譯好的遊戲所需的 .NET 部分，但 Godot 不包括建構和編譯遊戲所需的 MSBuild 和 C# 編譯器等工具。這些工具包含在 .NET SDK 中，需要單獨安裝。

source: In summary, you must have installed the .NET SDK **and** the .NET-enabled version of Godot.
de: Zusammenfassend lässt sich sagen, dass Sie das .NET SDK **und** die .NET-fähige Version von Godot installiert haben müssen.
zh_cn: 综上所述，你必须安装了 .NET SDK **和**\ 支持 .NET 的 Godot 版本。
zh_tw: 總之就是必須安裝 Visual Studio 或 Mono (依據作業系統而異) **並且** 安裝有啟用 Mono 版本的 Godot。

source: Download and install the latest stable version of the SDK from the `.NET download page <https://dotnet.microsoft.com/download>`__.
de: Laden Sie die neueste stabile Version des SDK von der `.NET Download-Seite <https://dotnet.microsoft.com/download>`__ herunter und installieren Sie sie.
zh_cn: 从 `.NET 下载页面 <https://dotnet.microsoft.com/download>`__ 下载并安装SDK的最新稳定版本。
zh_tw: 從 `.NET 下載頁面 <https://dotnet.microsoft.com/download>`__ 下載並安裝SDK的最新穩定版本。

source: Be sure to install the 64-bit version of the SDK(s) if you are using the 64-bit version of Godot.
de: Stellen Sie sicher, dass Sie die 64-Bit-Version des SDK(s) installieren, wenn Sie die 64-Bit-Version von Godot verwenden.
zh_cn: 如果你使用 64 位版本的 Godot，请务必安装 64 位版本的 SDK。
zh_tw: 如果您使用 64 位版本的 Godot，請務必安裝 64 位版本的 SDK。

source: If you are building Godot from source, make sure to follow the steps to enable .NET support in your build as outlined in the :ref:`doc_compiling_with_dotnet` page.
de: Wenn Sie Godot aus dem Quellcode bauen, stellen Sie sicher, dass Sie die Schritte zur Aktivierung der .NET-Unterstützung in Ihrem Build befolgen, wie auf der Seite :ref:`doc_compiling_with_dotnet` beschrieben wird.
zh_cn: 如果你正在从源代码构建 Godot，请确保按照 :ref:`doc_compiling_with_dotnet` 页面中概述的步骤来启用 .NET 支持。
zh_tw: 必須使用有啟用 Mono 支援的 Godot 版本，請確保下載 **Mono 版** 的 Godot。若是從原始碼建置 Godot，請確保遵守 :ref:`doc_compiling_with_mono` 頁面中的步驟來啟用 Mono 支援。

source: Configuring an external editor
de: Einen externen Editor konfigurieren
zh_cn: 配置外部编辑器
zh_tw: 設定外部編輯器

source: C# support in Godot's built-in script editor is minimal. Consider using an external IDE or editor, such as `Visual Studio Code <https://code.visualstudio.com/>`__ or MonoDevelop. These provide autocompletion, debugging, and other useful features for C#. To select an external editor in Godot, click on **Editor → Editor Settings** and scroll down to **Dotnet**. Under **Dotnet**, click on **Editor**, and select your external editor of choice. Godot currently supports the following external editors:
de: Die C#-Unterstützung im integrierten Skript-Editor von Godot ist minimal. Ziehen Sie die Verwendung einer externen IDE oder eines Editors in Betracht, z.B. `Visual Studio Code <https://code.visualstudio.com/>`__ oder MonoDevelop. Diese bieten Autovervollständigung, Debugging und andere nützliche Funktionen für C#. Um einen externen Editor in Godot auszuwählen, klicken Sie auf **Editor → Editoreinstellungen** und scrollen Sie nach unten zu **Dotnet**. Klicken Sie unter **Dotnet** auf **Editor**, und wählen Sie den externen Editor Ihrer Wahl aus. Godot unterstützt derzeit die folgenden externen Editoren:
zh_cn: Godot 内置的脚本编辑器对 C# 的支持是最小的。考虑使用外部 IDE 或编辑器，如 `Visual Studio Code <https://code.visualstudio.com/>`__ 或 MonoDevelop。这些都为 C# 提供了自动完成、调试和其他有用的功能。要在 Godot 中选择一个外部编辑器，点击 **Editor(编辑器) → Editor Settings(编辑器设置)** ，向下滚动到 **Dotnet(.NET)** 。在 **Dotnet(.NET)** 下，点击 **Editor(编辑器)** ，然后选择你的外部编辑器。Godot 目前支持以下外部编辑器：
zh_tw: Godot 中的腳本編輯器僅對 C# 有最小限度的支援。建議使用外部 IDE 或編輯器，如 `Visual Studio Code <https://code.visualstudio.com/>`_ 或 MonoDevelop。這些編輯器有提供自動補全、除錯以及其他對 C# 實用的功能。要在 Godot 中選擇外部編輯器，請點擊 **[編輯器] → [編輯器設定]** 並向下滾動到 **Mono** 。在 **Mono** 中點擊 **Editor** 並選擇要使用的外部編輯器。Godot 目前支援下列外部編輯器：

source: Visual Studio 2022
zh_tw: Visual Studio 2019

source: Visual Studio for Mac
de: Visual Studio für Mac
zh_tw: Mac 版 Visual Studio

source: See the following sections for how to configure an external editor:
de: In den folgenden Abschnitten erfahren Sie, wie Sie einen externen Editor konfigurieren:
zh_cn: 关于如何配置外部编辑器，请参见以下章节：
zh_tw: 關於如何配置外部編輯器，請參見以下章節：

source: After reading the "Prerequisites" section, you can download and install `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
de: Nachdem Sie den Abschnitt "Voraussetzungen" gelesen haben, können Sie `JetBrains Rider <https://www.jetbrains.com/rider/download>`__ herunterladen und installieren.
zh_cn: 阅读完 "预备知识" 部分，就可以下载安装 `JetBrains Rider <https://www.jetbrains.com/rider/download>`__ 。
zh_tw: 閱讀完 "預備知識" 部分，就可以下載安裝 `JetBrains Rider <https://www.jetbrains.com/rider/download>`__ 。

source: In Godot's **Editor → Editor Settings** menu:
de: In Godots **Editor → Editoreinstellungen** Menü:
zh_cn: 在 Godot 的 **Editor(编辑器) → Editor Settings(编辑器设置)** 菜单中：
zh_tw: 在 Godot 的編輯器設定中：

source: Set **Dotnet** -> **Editor** -> **External Editor** to **JetBrains Rider**.
de: Setzen Sie **Dotnet** -> **Editor** -> **Externer Editor** auf **JetBrains Rider**.
zh_cn: 设置 **Dotnet(.NET)** -> **Editor(编辑器)** -> **External Editor(外部编辑器)** 为 **JetBrains Rider** 。
zh_tw: 將 **Mono External Editor** 設為 **JetBrains Rider** 。

source: In Rider:
zh_cn: 在 Rider 中：
zh_tw: Rider 中：

source: Set **MSBuild version** to **.NET Core**.
de: Setzen Sie **MSBuild-Version** auf **.NET Core**.
zh_cn: 设置 **MSBuild version** 为 **.NET Core** 。
zh_tw: 設定 **MSBuild version** 為 **.NET Core** 。

source: Install the **Godot support** plugin.
de: Installieren Sie das **Godot-Support** Plugin.
zh_cn: 安装 **Godot support** 插件。
zh_tw: 安裝 **Godot support** 外掛。

source: After reading the "Prerequisites" section, you can download and install `Visual Studio Code <https://code.visualstudio.com/download>`__ (aka VS Code).
de: Nachdem Sie den Abschnitt "Voraussetzungen" gelesen haben, können Sie `Visual Studio Code <https://code.visualstudio.com/download>`__ (auch bekannt als VS Code) herunterladen und installieren.
zh_cn: 看完 "预备知识" 部分，就可以下载安装 `Visual Studio Code <https://code.visualstudio.com/download>`__ （又名 VS Code）。
zh_tw: 看完 "預備知識" 部分，就可以下載安裝 `Visual Studio Code <https://code.visualstudio.com/download>`__ （又名 VS Code）。

source: Set **Dotnet** -> **Editor** -> **External Editor** to **Visual Studio Code**.
de: Stellen Sie **Dotnet** -> **Editor** -> **Externer Editor** auf **Visual Studio Code**.
zh_cn: 设置 **Dotnet(.NET)** -> **Editor(编辑器)** -> **External Editor(外部编辑器)** 为 **Visual Studio Code** 。
zh_tw: 將 **Mono External Editor** 設為 **JetBrains Rider** 。

source: In Visual Studio Code:
zh_cn: 在 Visual Studio Code 中：
zh_tw: Visual Studio Code

source: Install the `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ extension.
de: Installieren Sie die `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__-Erweiterung.
zh_cn: 安装 `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ 扩展。
zh_tw: 安裝 `VSMonoDebugger 擴充套件 <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_ 。

source: If you are using Linux you need to install the `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__ for the C# tools plugin to work.
de: Wenn Sie Linux benutzen, müssen Sie das `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__ installieren, damit die C# Tools funktionieren.
zh_cn: 如果你使用的是 Linux，需要安装 `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__ 才能使用 C# 工具插件。
zh_tw: 如果你使用的是 Linux，需要安裝 `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__ 才能使用 C# 工具外掛程式。

source: To configure a project for debugging, you need a ``tasks.json`` and ``launch.json`` file in the ``.vscode`` folder with the necessary configuration. An example configuration can be found `here <https://github.com/godotengine/godot-csharp-vscode/issues/43#issuecomment-1258321229>`__ . In the ``launch.json`` file, make sure the ``program`` parameter in the relevant configuration points to your Godot executable, either by changing it to the path of the executable or by defining a ``GODOT4`` environment variable that points to the executable. Now, when you start the debugger in Visual Studio Code, your Godot project will run.
de: Um ein Projekt für Debugging zu konfigurieren, benötigen Sie eine ``tasks.json`` und ``launch.json``-Datei im ``.vscode``-Ordner mit der notwendigen Konfiguration. Eine Beispielkonfiguration kann `hier <https://github.com/godotengine/godot-csharp-vscode/issues/43#issuecomment-1258321229>`__ gefunden werden. Stellen Sie in der Datei ``launch.json`` sicher, dass der Parameter ``program`` in der entsprechenden Konfiguration auf Ihre ausführbare Godot-Datei zeigt, indem Sie ihn entweder auf den Pfad der ausführbaren Datei ändern oder eine ``GODOT4``-Umgebungsvariable definieren, die auf die ausführbare Datei zeigt. Wenn Sie nun den Debugger in Visual Studio Code starten, wird Ihr Godot-Projekt ausgeführt.
zh_cn: 为了配置一个用于调试的项目，你需要在 ``.vscode`` 文件夹中拥有一个 ``tasks.json`` 和 ``launch.json`` 文件，并进行必要的配置。一个示例配置可以在 `这里 <https://github.com/godotengine/godot-csharp-vscode/issues/43#issuecomment-1258321229>`__ 找到。在 ``launch.json`` 文件中，请确保相关配置中的 ``program`` 参数指向你的 Godot 可执行文件，你可以通过将它更改为可执行文件的路径或定义一个指向可执行文件的 ``GODOT4`` 环境变量来实现。现在，当你在 Visual Studio Code 中启动调试器时，你的 Godot 项目将会运行。
zh_tw: 為了配置一個用於除錯的專案，你需要在 ``.vscode`` 資料夾中擁有一個 ``tasks.json`` 和 ``launch.json`` 檔，並進行必要的配置。一個範例配置可以在 `這裡 <https://github.com/godotengine/godot-csharp-vscode/issues/43#issuecomment-1258321229>`__ 找到。在 ``launch.json`` 檔中，請確保相關配置中的 ``program`` 參數指向你的 Godot 可執行檔，你可以通過將它更改為可執行檔的路徑或定義一個指向可執行檔的 ``GODOT4`` 環境變數來實作。現在，當你在 Visual Studio Code 中啟動除錯器時，你的 Godot 專案將會運作。

source: Visual Studio (Windows only)
de: Visual Studio (nur Windows)
zh_cn: Visual Studio（仅限 Windows）
zh_tw: Visual Studio 或 VS Code

source: Download and install the latest version of `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio will include the required SDKs if you have the correct workloads selected, so you don't need to manually install the things listed in the "Prerequisites" section.
de: Laden Sie die neueste Version von `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__ herunter und installieren Sie sie. Visual Studio enthält die erforderlichen SDKs, wenn Sie die richtigen Workloads ausgewählt haben, sodass Sie die im Abschnitt "Voraussetzungen" aufgeführten Dinge nicht manuell installieren müssen.
zh_cn: 下载并安装最新版本的 `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__ 。如果你选择了正确的工作负载，Visual Studio 将包含所需的 SDK，所以你不需要手动安装 "预先告知" 部分列出的内容。
zh_tw: 下載並安裝最新版本的 `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__ 。如果你選擇了正確的工作負載，Visual Studio 將包含所需的 SDK，所以你不需要手動安裝 "預先告知" 部分列出的內容。

source: While installing Visual Studio, select this workload:
de: Wählen Sie bei der Installation von Visual Studio diesen Workload aus:
zh_cn: 在安装 Visual Studio 时，请选择以下工作负载：
zh_tw: Visual Studio 安裝須知

source: .NET desktop development
de: .NET-Desktop-Entwicklung
zh_cn: .NET 桌面开发
zh_tw: 編輯器開發

source: Set **Dotnet** -> **Editor** -> **External Editor** to **Visual Studio**.
de: Setzen Sie **Dotnet** -> **Editor** -> **Externer Editor** auf **Visual Studio**.
zh_cn: 设置 **Dotnet(.NET)** -> **Editor(编辑器)** -> **External Editor(外部编辑器)** 为 **Visual Studio** 。
zh_tw: 將 **Mono External Editor** 設為 **JetBrains Rider** 。

source: If you see an error like "Unable to find package Godot.NET.Sdk", your NuGet configuration may be incorrect and need to be fixed.
de: Wenn Sie eine Fehlermeldung wie "Unable to find package Godot.NET.Sdk" sehen, ist Ihre NuGet-Konfiguration möglicherweise falsch und muss korrigiert werden.
zh_cn: 如果你看到了类似“Unable to find package Godot.NET.Sdk”的错误，你的 NuGet 配置可能有问题，需要进行修复。
zh_tw: 如果你看到了類似“Unable to find package Godot.NET.Sdk”的錯誤，你的 NuGet 配置可能有問題，需要進行修復。

source: A simple way to fix the NuGet configuration file is to regenerate it. In a file explorer window, go to ``%AppData%\NuGet``. Rename or delete the ``NuGet.Config`` file. When you build your Godot project again, the file will be automatically created with default values.
de: Eine einfache Möglichkeit, die NuGet-Konfigurationsdatei zu reparieren, besteht darin, sie neu zu generieren. Gehen Sie in einem Datei-Explorer-Fenster zu ``%AppData%\NuGet``. Benennen Sie die Datei ``NuGet.Config`` um oder löschen Sie sie. Wenn Sie Ihr Godot-Projekt erneut erstellen, wird die Datei automatisch mit Defaultwerten erstellt.
zh_cn: 修复 NuGet 配置文件的简单方法就是重新生成一个。在文件浏览器窗口中前往 ``%AppData%\NuGet``\ 。将 ``NuGet.Config`` 文件重命名或删除。重新构建 Godot 项目时，就会自动用默认值创建该文件。
zh_tw: 修復 NuGet 設定檔的簡單方法就是重新生成一個。在檔案瀏覽器視窗中前往 ''%AppData%\NuGet''\ 。將 ''NuGet.Config'' 檔案重命名或刪除。重新建立 Godot 專案時，就會自動用預設值建立該檔。

source: Creating a C# script
de: Erstellen eines C# Skripts
zh_cn: 创建 C# 脚本
zh_tw: 建立 C# 腳本

source: After you successfully set up C# for Godot, you should see the following option when selecting **Attach Script** in the context menu of a node in your scene:
de: Nachdem Sie C# für Godot erfolgreich eingerichtet haben, sollte die folgende Option angezeigt werden, wenn Sie im Kontextmenü eines Nodes in Ihrer Szene **Skript anhängen** auswählen:
zh_cn: 成功为 Godot 设置 C# 之后，在场景的节点的上下文菜单中选择 **Attach Script (添加脚本)** 时，应该看到以下选项：
zh_tw: 成功為 Godot 設定好 C# 後，應該可以在從場景中節點右鍵選單中選擇 **[附加腳本]** 時看到下列選項：

source: Note that while some specifics change, most concepts work the same when using C# for scripting. If you're new to Godot, you may want to follow the tutorials on :ref:`doc_scripting` at this point. While some documentation pages still lack C# examples, most notions can be transferred from GDScript.
de: Beachten Sie, dass sich zwar einige Besonderheiten ändern, die meisten Konzepte aber gleich funktionieren, wenn Sie C# für die Skripterstellung verwenden. Wenn Sie neu in Godot sind, sollten Sie an dieser Stelle die Tutorials unter :ref:`doc_scripting` verfolgen. Auf einigen Dokumentationsseiten fehlen zwar noch C#-Beispiele, aber die meisten Begriffe können von GDScript übernommen werden.
zh_cn: 请注意，虽然在某些细节上有所差别，但在使用C#进行脚本编写时，大多数概念都是相通的。如果你是 Godot 的新手，你可能希望在这个时候查看 :ref:`doc_scripting` 上的教程。虽然在文档中缺乏详细的 C# 示例，但大多数概念可以从 GDScript 中转移过来。
zh_tw: 請注意，雖然某些功能不同，但使用 C# 撰寫腳本時大部分概念都一樣。若還不熟悉 Godot，則建議您先閱讀 :ref:`doc_scripting` 中的教學。雖然文件中的某些部分還沒有 C# 範例，但大部分概念都很容易從 GDScript 轉過來。

source: Project setup and workflow
de: Projekteinrichtung und Workflow
zh_cn: 项目设置和工作流程
zh_tw: 專案設定與工作流程

source: When you create the first C# script, Godot initializes the C# project files for your Godot project. This includes generating a C# solution (``.sln``) and a project file (``.csproj``), as well as some utility files and folders (``.godot/mono``). All of these but ``.godot/mono`` are important and should be committed to your version control system. Everything under ``.godot`` can be safely added to the ignore list of your VCS. When troubleshooting, it can sometimes help to delete the ``.godot/mono`` folder and let it regenerate.
de: Wenn Sie das erste C#-Skript erstellen, initialisiert Godot die C#-Projektdateien für Ihr Godot-Projekt. Dazu gehört die Erzeugung einer C#-Solution (``.sln``) und einer Projektdatei (``.csproj``) sowie einiger Dienstprogrammdateien und -ordner (``.godot/mono``). Alle diese Dateien außer ``.godot/mono`` sind wichtig und sollten in Ihr Versionsverwaltungssystem übertragen werden. Alles unter ``.godot`` kann getrost in die ignore-Liste Ihres VCS aufgenommen werden. Bei der Fehlersuche kann es manchmal helfen, den ``.godot/mono``-Ordner zu löschen und ihn neu generieren zu lassen.
zh_cn: 当你创建第一个 C# 脚本时，Godot 会为你的 Godot 项目初始化 C# 项目文件。这包括生成 C# 解决方案（ ``.sln`` ）和项目文件（ ``.csproj`` ），以及一些实用文件和文件夹（ ``.godot/mono`` ） 。除了 ``.godot/mono`` 之外，所有这些文件都很重要，应该提交到你的版本控制系统中。 ``.godot`` 文件夹下的所有内容都可以安全地添加到你的版本控制系统的忽略列表中。在排除故障时, 有时删除 ``.godot/mono`` 文件夹并让它重新生成可能有所帮助。
zh_tw: 建立第一個 C# 腳本後，Godot 會為目前的 Godot 專案初始化 C# 專案檔。包含產生 C# 解決方案 (``.sln``) 與專案檔 (``.csproj``)、以及一些公用檔案與資料夾 (``.mono`` 與 ``Properties/AssemblyInfo.cs``)。這些檔案除了 ``.mono`` 之外都很重要，且應該被認可 (Commit) 至版本控制系統中。``.mono`` 可以安全地新增到 VCS 中的忽略列表內，有時候可能會需要刪除 ``.mono`` 資料夾並讓 Godot 重新產生。

source: Example
de: Beispiel
zh_cn: 示例
zh_tw: 範例

source: Here's a blank C# script with some comments to demonstrate how it works.
de: Hier ist ein leeres C# Skript mit einigen Kommentaren, um zu zeigen, wie es funktioniert.
zh_cn: 这是一个空白的 C# 脚本，带有一些注释，以演示其工作方式。
zh_tw: 下列為一個空白的 C# 腳本，包含了一些說明如何運作的註解。

source: As you can see, functions normally in global scope in GDScript like Godot's ``print`` function are available in the ``GD`` static class which is part of the ``Godot`` namespace. For a full list of methods in the ``GD`` class, see the class reference pages for :ref:`@GDScript <class_@gdscript>` and :ref:`@GlobalScope <class_@globalscope>`.
de: Wie Sie sehen können, sind Funktionen, die in GDScript normalerweise global sind, wie z.B. Godots ``print``-Funktion, in der statischen Klasse ``GD`` verfügbar, die Teil des ``Godot``-Namespace ist. Eine vollständige Liste der Methoden in der Klasse ``GD`` finden Sie auf den Klassenreferenzseiten für :ref:`@GDScript <class_@gdscript>` und :ref:`@GlobalScope <class_@globalscope>`.
zh_cn: 如你所见，在 GDScript 中的全局作用域中，像 Godot 的 ``print`` 这样的函数可以在 ``GD`` 静态类中使用，该类是 ``Godot`` 命名空间的一部分。要查看 ``GD`` 类中所有方法的完整列表，请参阅： :ref:`@GDScript <class_@gdscript>` 和 :ref:`@GlobalScope <class_@globalscope>` 的类参考页面。
zh_tw: 就像這樣，在 GDScript 中通常在全域的函式，如 Godot 的 ``print`` 函式，都在 ``Godot`` 命名空間中的 ``GD`` 類別內。要取得 ``GD`` 類別中所有方法的列表，請參考類別參照頁面中的 :ref:`@GDScript <class_@gdscript>` 與 :ref:`@GlobalScope <class_@globalscope>` 。

source: Keep in mind that the class you wish to attach to your node should have the same name as the ``.cs`` file. Otherwise, you will get the following error:
de: Beachten Sie, dass die Klasse, die Sie an Ihren Node anhängen möchten, den gleichen Namen wie die ``.cs``-Datei haben sollte. Andernfalls erhalten Sie die folgende Fehlermeldung:
zh_cn: 请记住，你希望附加到节点上的类应与 ``.cs`` 文件的名称相同。否则，你将会遇到以下错误：
zh_tw: 請記得，要附加到節點上的類別必須與 ``.cs`` 檔案的檔名相同。否則會得到下列錯誤且無法執行場景： **「Cannot find class XXX for script res://XXX.cs」**

source: General differences between C# and GDScript
de: Allgemeine Unterschiede zwischen C# und GDScript
zh_cn: C# 和 GDScript 之间的一般差异
zh_tw: C# 與 GDScript 間的一般差異

source: The C# API uses ``PascalCase`` instead of ``snake_case`` in GDScript/C++. Where possible, fields and getters/setters have been converted to properties. In general, the C# Godot API strives to be as idiomatic as is reasonably possible.
de: Die C#-API verwendet in GDScript und C++ ``PascalCase`` anstelle von ``snake_case``. Nach Möglichkeit wurden Felder und Getter/Setter in Propertys konvertiert. Im Allgemeinen ist die C#-Godot API bestrebt, so idiomatisch wie möglich zu sein.
zh_cn: C# API 使用 ``PascalCase`` 而不是 GDScript/C++ 中使用的 ``snake_case`` 。 在可能的情况下，字段和 getters/setters 已转换为属性。一般来说，C# Godot API 一贯力求尽可能合理。
zh_tw: C# API 使用 ``PascalCase`` 而不是 GDScript/C++ 的 ``snake_case`` 。欄位、Getter、Setter 都儘量轉換成屬性。一般來說，C# Godot API 都在合理情況下儘量保持其習慣。

source: For more information, see the :ref:`doc_c_sharp_differences` page.
de: Für mehr Informationen siehe die Seite :ref:`doc_c_sharp_differences`.
zh_cn: 有关更多信息，请参见 :ref:`doc_c_sharp_differences` 页面。
zh_tw: 更多資訊請參考 :ref:`doc_c_sharp_differences` 一頁。

source: You will also need to rebuild the project assemblies to apply changes in "tool" scripts.
de: Sie müssen auch die Projekt-Assemblys neu erstellen, um Änderungen in "Tool" -Skripten anzuwenden.
zh_cn: 你还需要重新构建项目集，以应用 "工具" 脚本中的更改。
zh_tw: 接著還需要重新建置專案組建，以套用「工具」腳本中的改動。

source: Current gotchas and known issues
de: Aktuelle Fallstricke und bekannte Probleme
zh_cn: 目前的陷阱和已知问题
zh_tw: 目前狀況與已知問題
