Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_features.po
Languages: de

source: C# language features
de: C#-Sprachfeatures

source: This page provides an overview of the commonly used features of both C# and Godot and how they are used together.
de: Diese Seite bietet einen Überblick über die häufig verwendeten Features von C# und Godot und wie sie zusammen verwendet werden.

source: Type conversion and casting
de: Typumwandlung und Casting

source: C# is a statically typed language. Therefore, you can't do the following:
de: C# ist eine statisch typisierte Programmiersprache, daher ist dies hier nicht möglich:

source: The method ``GetNode()`` returns a ``Node`` instance. You must explicitly convert it to the desired derived type, ``Sprite2D`` in this case.
de: Die Methode ``GetNode()`` gibt eine ``Node``-Instanz zurück. Sie müssen sie explizit in den gewünschten abgeleiteten Typ konvertieren, in diesem Fall ``Sprite2D``.

source: For this, you have various options in C#.
de: Hierfür gibt es verschiedene Möglichkeiten in C#.

source: **Casting and Type Checking**
de: **Casting und Typprüfung**

source: Throws ``InvalidCastException`` if the returned node cannot be cast to Sprite2D. You would use it instead of the ``as`` operator if you are pretty sure it won't fail.
de: Wirft ``InvalidCastException``, wenn der zurückgegebene Node nicht in Sprite2D gecastet werden kann. Sie sollten ihn anstelle des ``as``-Operators verwenden, wenn Sie ziemlich sicher sind, dass er nicht fehlschlagen wird.

source: **Using the AS operator**
de: **Nutzen des AS-Operators**

source: The ``as`` operator returns ``null`` if the node cannot be cast to Sprite2D, and for that reason, it cannot be used with value types.
de: Der ``as``-Operator gibt ``null`` zurück, wenn der Node nicht in Sprite2D gecastet werden kann, und aus diesem Grund kann er nicht mit Wertetypen verwendet werden.

source: **Using the generic methods**
de: **Nutzen der generischen Methoden**

source: Generic methods are also provided to make this type conversion transparent.
de: Es werden auch generische Methoden bereitgestellt, um diese Typkonvertierung transparent zu machen.

source: ``GetNode<T>()`` casts the node before returning it. It will throw an ``InvalidCastException`` if the node cannot be cast to the desired type.
de: ``GetNode<T>()`` castet den Node, bevor er zurückgegeben wird. Es wird eine ``InvalidCastException`` ausgelöst, wenn der Node nicht in den gewünschten Typ gecastet werden kann.

source: ``GetNodeOrNull<T>()`` uses the ``as`` operator and will return ``null`` if the node cannot be cast to the desired type.
de: ``GetNodeOrNull<T>()`` verwendet den Operator ``as`` und gibt ``null`` zurück, wenn der Node nicht in den gewünschten Typ gecastet werden kann.

source: **Type checking using the IS operator**
de: **Typprüfung mit dem IS-Operator**

source: To check if the node can be cast to Sprite2D, you can use the ``is`` operator. The ``is`` operator returns false if the node cannot be cast to Sprite2D, otherwise it returns true. Note that when the ``is`` operator is used against ``null`` the result is always going to be ``false``.
de: Um zu prüfen, ob der Node in Sprite2D umgewandelt werden kann, können Sie den Operator ``is`` verwenden. Der ``is``-Operator gibt false zurück, wenn der Node nicht in Sprite2D gecastet werden kann, andernfalls gibt er true zurück. Beachten Sie, dass das Ergebnis des Operators ``is`` immer ``false`` ist, wenn er gegen ``null`` verwendet wird.

source: You can also declare a new variable to conditionally store the result of the cast if the ``is`` operator returns ``true``.
de: Sie können auch eine neue Variable deklarieren, um das Ergebnis des Casts bedingt zu speichern, wenn der Operator ``is`` den Wert ``true`` liefert.

source: For more advanced type checking, you can look into `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
de: Weitere Informationen zur Typprüfung finden Sie unter `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.

source: Preprocessor defines
de: Präprozessor-Defines

source: Godot has a set of defines that allow you to change your C# code depending on the environment you are compiling to.
de: Godot verfügt über eine Reihe von Defines, mit denen Sie Ihren C#-Code ändern können, je nach Umgebung, in die Sie kompilieren.

source: If you created your project before Godot 3.2, you have to modify or regenerate your `csproj` file to use this feature (compare ``<DefineConstants>`` with a new 3.2+ project).
de: Wenn Sie Ihr Projekt vor Godot 3.2 erstellt haben, müssen Sie Ihre `csproj`-Datei ändern oder neu generieren, um dieses Feature zu verwenden (vergleichen Sie ``<DefineConstants>`` mit einem neuen 3.2+ -Projekt).

source: Examples
de: Beispiele

source: For example, you can change code based on the platform:
de: Sie können beispielsweise den Code basierend auf der Plattform ändern:

source: Or you can detect which engine your code is in, useful for making cross-engine libraries:
de: Oder Sie können detektieren, in welcher Engine sich Ihr Code befindet, was für die Erstellung von Cross-Engine-Bibliotheken hilfreich ist:

source: Or you can write scripts that target multiple Godot versions and take advantage of features that are only available on some of those versions:
de: Oder Sie können Skripte schreiben, die auf mehrere Godot-Versionen abzielen und die Vorteile von Funktionen nutzen, die nur in einigen dieser Versionen verfügbar sind:

source: Full list of defines
de: Vollständige Liste von Definitionen

source: ``GODOT`` is always defined for Godot projects.
de: ``GODOT`` ist immer für Godot-Projekte definiert.

source: ``TOOLS`` is defined when building with the Debug configuration (editor and editor player).
de: ``TOOLS`` ist beim Build mit der Debug-Konfiguration (Editor und Editor-Player) definiert.

source: ``GODOT_REAL_T_IS_DOUBLE`` is defined when the ``GodotFloat64`` property is set to ``true``.
de: ``GODOT_REAL_T_IS_DOUBLE`` ist definiert, wenn die Property ``GodotFloat64`` auf ``true`` gesetzt ist.

source: One of ``GODOT_64`` or ``GODOT_32`` is defined depending on if the architecture is 64-bit or 32-bit.
de: Eine von ``GODOT_64`` oder ``GODOT_32`` ist definiert, je nachdem ob die Architektur 64-bit oder 32-bit ist.

source: One of ``GODOT_LINUXBSD``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5``, or ``GODOT_SERVER`` depending on the OS. These names may change in the future. These are created from the ``get_name()`` method of the :ref:`OS <class_OS>` singleton, but not every possible OS the method returns is an OS that Godot with .NET runs on.
de: Eine von ``GODOT_LINUXBSD``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5`` oder ``GODOT_SERVER``, abhängig vom Betriebssystem. Diese Namen können sich in Zukunft ändern. Sie werden von der Methode ``get_name()`` des Singletons :ref:`OS <class_OS>` erzeugt, aber nicht jedes mögliche Betriebssystem, das die Methode zurückgibt, ist ein Betriebssystem, auf dem Godot mit .NET läuft.

source: ``GODOTX``, ``GODOTX_Y``, ``GODOTX_Y_Z``, ``GODOTx_OR_GREATER``, ``GODOTX_y_OR_GREATER``, and ``GODOTX_Y_z_OR_GREATER``, where ``X``, ``Y``, and ``Z`` are replaced by the current major, minor and patch version of Godot. ``x``, ``y``, and ``z`` are replaced by all values from 0 to the current version number for that component.
de: ``GODOTX``, ``GODOTX_Y``, ``GODOTX_Y_Z``, ``GODOTx_OR_GREATER``, ``GODOTX_y_OR_GREATER`` und ``GODOTX_Y_z_OR_GREATER``, wobei ``X``, ``Y`` und ``Z`` durch die aktuelle Major-, Minor- und Patch-Version von Godot ersetzt werden. ``x``, ``y`` und ``z`` werden durch alle Werte von 0 bis zur aktuellen Versionsnummer für diese Komponente ersetzt.

source: These defines were first added in Godot 4.0.4 and 4.1. Version defines for prior versions do not exist, regardless of the current Godot version.
de: Diese Defines wurden erstmals in Godot 4.0.4 und 4.1 hinzugefügt. Versions-Defines für frühere Versionen gibt es nicht, unabhängig von der aktuellen Godot-Version.

source: For example: Godot 4.0.5 defines ``GODOT4``, ``GODOT4_OR_GREATER``, ``GODOT4_0``, ``GODOT4_0_OR_GREATER``, ``GODOT4_0_5``, ``GODOT4_0_4_OR_GREATER``, and ``GODOT4_0_5_OR_GREATER``. Godot 4.3.2 defines ``GODOT4``, ``GODOT4_OR_GREATER``, ``GODOT4_3``, ``GODOT4_0_OR_GREATER``, ``GODOT4_1_OR_GREATER``, ``GODOT4_2_OR_GREATER``, ``GODOT4_3_OR_GREATER``, ``GODOT4_3_2``, ``GODOT4_3_0_OR_GREATER``, ``GODOT4_3_1_OR_GREATER``, and ``GODOT4_3_2_OR_GREATER``.
de: Zum Beispiel: Godot 4.0.5 definiert ``GODOT4``, ``GODOT4_OR_GREATER``, ``GODOT4_0``, ``GODOT4_0_OR_GREATER``, ``GODOT4_0_5``, ``GODOT4_0_4_OR_GREATER``, und ``GODOT4_0_5_OR_GREATER``. Godot 4.3. 2 definiert ``GODOT4``, ``GODOT4_OR_GREATER``, ``GODOT4_3``, ``GODOT4_0_OR_GREATER``, ``GODOT4_1_OR_GREATER``, ``GODOT4_2_OR_GREATER``, ``GODOT4_3_OR_GREATER``, ``GODOT4_3_2``, ``GODOT4_3_0_OR_GREATER``, ``GODOT4_3_1_OR_GREATER``, und ``GODOT4_3_2_OR_GREATER``.

source: When **exporting**, the following may also be defined depending on the export features:
de: Beim **Exportieren** kann Folgendes auch abhängig von den Exportfunktionen definiert werden:

source: One of ``GODOT_PC``, ``GODOT_MOBILE``, or ``GODOT_WEB`` depending on the platform type.
de: Eine von ``GODOT_PC``, ``GODOT_MOBILE`` oder ``GODOT_WEB``, abhängig vom Plattformtyp.

source: One of ``GODOT_WINDOWS``, ``GODOT_LINUXBSD``, ``GODOT_MACOS``, ``GODOT_ANDROID``, ``GODOT_IOS``, or ``GODOT_WEB`` depending on the platform.
de: Eine von ``GODOT_WINDOWS``, ``GODOT_LINUXBSD``, ``GODOT_MACOS``, ``GODOT_ANDROID``, ``GODOT_IOS``, oder ``GODOT_WEB``, abhängig von der Plattform.

source: To see an example project, see the OS testing demo: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
de: Ein Beispielprojekt finden Sie in der Betriebssystem-Testdemo: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test

source: Translation status
de: Übersetzungsstatus
