Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/index.po
Languages: de, zh_cn

source: C# is a high-level programming language developed by Microsoft. Godot supports C# as an option for a scripting language, alongside Godot's own :ref:`GDScript<toc-learn-scripting-gdscript>`.
de: C# ist eine von Microsoft entwickelte High-Level-Programmiersprache. Godot unterstützt C# als eine Option zu einer Skriptsprache, neben Godots eigenem :ref:`GDScript<toc-learn-scripting-gdscript>`.
zh_cn: C# 是由微软开发的高级编程语言。Godot 支持将 C# 作为一种脚本语言的选择，与 Godot 自有的 :ref:`GDScript<toc-learn-scripting-gdscript>` 并列。

source: The standard Godot executable does not contain C# support out of the box. Instead, to enable C# support for your project you need to `download a .NET version <https://godotengine.org/download/>`_ of the editor from the Godot website.
de: Das Standard Godot-Executable enthält von Haus aus keine C#-Unterstützung. Um die C#-Unterstützung für Ihr Projekt zu aktivieren, müssen Sie stattdessen `eine .NET-Version <https://godotengine.org/download/>`_ des Editors von der Godot-Website herunterladen.
zh_cn: 标准的 Godot 可执行文件并不自带 C# 支持。要为你的项目启用 C# 支持，你需要从 Godot 网站 `下载 .NET 版本 <https://godotengine.org/download/>`_ 的编辑器。

source: Godot API for C#
de: Godot-API für C#
zh_cn: C# 的 Godot API

source: As a general purpose game engine Godot offers some high-level features as a part of its API. Articles below explain how these features integrate into C# and how C# API may be different from GDScript.
de: Als Allzweck-Spiel-Engine bietet Godot einige High-Level-Funktionen als Teil seiner API. In den folgenden Artikeln wird erläutert, wie diese Funktionen in C# integriert werden und wie sich die C#-API von GDScript unterscheiden kann.
zh_cn: Godot 是一个通用的游戏引擎，它提供了一些高级功能作为它的 API 的一部分。下面的文章介绍了这些功能如何与 C# 集成，以及 C# API 和 GDScript 之间可能存在的差异。

source: C# platform support
de: C#-Plattform-Support
zh_cn: C# 平台支持

source: As of Godot 4.2 projects written in C# support all desktop platforms (Windows, Linux, and macOS), as well as Android and iOS.
de: Ab Godot 4.2 unterstützen in C# geschriebene Projekte alle Desktop-Plattformen (Windows, Linux und macOS), sowie Android und iOS.
zh_cn: 从 Godot 4.2 开始，用 C# 编写的项目支持所有桌面平台（Windows、Linux 和 macOS），以及 Android 和 iOS。

source: Android support is currently experimental and has a few limitations.
de: Die Android-Unterstützung ist derzeit experimentell und hat einige Einschränkungen.
zh_cn: Android 支持目前是实验性的，存在部分限制。

source: Projects targeting Android need to target .NET 7.0 or higher. This requires modifying the `.csproj` file generated by Godot for existing projects. The following property is added to new projects created with 4.2 and can be added to existing projects:
de: Projekte, die auf Android ausgerichtet sind, müssen auf .NET 7.0 oder höher ausgerichtet sein. Dazu muss die von Godot für bestehende Projekte generierte `.csproj`-Datei geändert werden. Die folgende Property wird zu neuen, mit 4.2 erstellten Projekten hinzugefügt und kann zu bestehenden Projekten hinzugefügt werden:
zh_cn: 针对 Android 的项目需要指定 .NET 7.0 或更高版本。这需要修改 Godot 为现有项目生成的 `.csproj` 文件。以下属性会添加到用 4.2 创建的新项目中，也可以添加到现有项目中：

source: Only some Android architectures are supported: ``arm64`` and ``x64``.
de: Es werden nur einige Android-Architekturen unterstützt: ``arm64`` und ``x64``.
zh_cn: 只支持部分 Android 架构： ``arm64`` 和 ``x64`` 。

source: iOS support is currently experimental and has a few limitations.
de: Die iOS-Unterstützung ist derzeit experimentell und hat einige Einschränkungen.
zh_cn: iOS 支持目前是实验性的，存在部分限制。

source: Projects targeting iOS need to target .NET 8.0 or higher. This requires modifying the `.csproj` file generated by Godot for existing projects. The following property is added to new projects created with 4.2 and can be added to existing projects:
de: Projekte, die auf iOS ausgerichtet sind, müssen auf .NET 8.0 oder höher ausgerichtet sein. Dazu muss die von Godot für bestehende Projekte erzeugte `.csproj`-Datei geändert werden. Die folgende Property wird zu neuen, mit 4.2 erstellten Projekten hinzugefügt und kann zu bestehenden Projekten hinzugefügt werden:
zh_cn: 针对 iOS 的项目需要指定 .NET 8.0 或更高版本。这需要修改 Godot 为现有项目生成的 `.csproj` 文件。以下属性会添加到用 4.2 创建的新项目中，也可以添加到现有项目中：

source: The official export templates for the iOS simulator only supports the ``x64`` architecture.
de: Die offiziellen Exportvorlagen für den iOS-Simulator unterstützen nur die ``x64``-Architektur.
zh_cn: 用于 iOS 模拟器的官方导出模板仅支持 ``x64`` 架构。

source: Exporting to iOS can only be done from a MacOS device.
de: Der Export zu iOS kann nur von einem MacOS-Gerät aus erfolgen.
zh_cn: 导出到 iOS 只能从 MacOS 设备上完成。

source: Currently, projects written in C# cannot be exported to the web platform. To use C# on that platform, consider Godot 3 instead.
de: Derzeit können in C# geschriebene Projekte nicht auf die Web-Plattform exportiert werden. Wenn Sie C# auf dieser Plattform verwenden möchten, sollten Sie stattdessen Godot 3 in Betracht ziehen.
zh_cn: 目前，用 C# 编写的项目无法导出到 Web 平台。要在该平台上使用 C#，请考虑 Godot 3。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
