Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdextension/gdextension_cpp_example.po
Languages: de, zh_tw

source: GDExtension C++ example
de: GDExtension C++-Beispiel
zh_tw: GDExtension C++ 範例

source: Introduction
de: Einführung
zh_tw: 前言

source: The C++ bindings for GDExtension are built on top of the C GDExtension API and provide a nicer way to "extend" nodes and other built-in classes in Godot using C++. This new system allows the extension of Godot to nearly the same level as statically linked C++ modules.
de: Die C++-Bindings für GDExtension bauen auf der C GDExtension-API auf und bieten eine bessere Möglichkeit, Nodes und andere Built-in-Klassen in Godot mit C++ zu "erweitern". Dieses neue System ermöglicht die Erweiterung von Godot auf nahezu dem gleichen Niveau wie statisch gelinkte C++-Module.
zh_tw: GDNative的C++綁定建構在NativeScript GDNative API之上, 並提供了一種使用C++在Godot中 "擴充" 節點的更好方法. 這相當於在GDScript中編寫腳本, 而是在C++中編寫腳本.

source: You can download the included example in the test folder of the godot-cpp repository `on GitHub <https://github.com/godotengine/godot-cpp>`__.
de: Sie können das enthaltene Beispiel im Test-Ordner des godot-cpp-Repository `auf GitHub <https://github.com/godotengine/godot-cpp>`__ herunterladen.
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: Setting up the project
de: Einrichten des Projekts
zh_tw: 設定專案

source: There are a few prerequisites you'll need:
de: Es gibt ein paar Voraussetzungen, die Sie benötigen:
zh_tw: 您需要一些先決條件：

source: a Godot 4 executable,
de: eine ausführbare Godot 4-Datei,
zh_tw: Godot 4 可執行檔，

source: a C++ compiler,
de: einen C++-Compiler,
zh_tw: C++ 編譯器，

source: SCons as a build tool,
de: SCons als Build-Tool,
zh_tw: SCons 作為建構工具，

source: a copy of the `godot-cpp repository <https://github.com/godotengine/godot-cpp>`__.
de: eine Kopie des `godot-cpp Repository <https://github.com/godotengine/godot-cpp>`__.
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: See also :ref:`Compiling <toc-devel-compiling>` as the build tools are identical to the ones you need to compile Godot from source.
de: Siehe auch :ref:`Kompilieren <toc-devel-compiling>`, da die Build-Tools identisch mit denen sind, die Sie benötigen, um Godot aus dem Quellcode zu kompilieren.
zh_tw: 另請參閱:ref:`《編譯》 <toc-devel-compiling>`，因為建構工具與從原始程式碼編譯 Godot 所需的建構工具相同。

source: You can download the `godot-cpp repository <https://github.com/godotengine/godot-cpp>`__ from GitHub or let Git do the work for you. Note that this repository has different branches for different versions of Godot. GDExtensions will not work in older versions of Godot (only Godot 4 and up) and vice versa, so make sure you download the correct branch.
de: Sie können das `godot-cpp-Repository <https://github.com/godotengine/godot-cpp>`__ von GitHub herunterladen oder Git die Arbeit für Sie erledigen lassen. Beachten Sie, dass dieses Repository verschiedene Branches für verschiedene Versionen von Godot hat. GDExtensions funktionieren nicht in älteren Versionen von Godot (nur Godot 4 und höher) und umgekehrt, also stellen Sie sicher, dass Sie den richtigen Branch herunterladen.
zh_tw: 您可以從 GitHub 下載這些倉庫，或讓 Git 為您完成這些工作。請注意，這些倉庫現在對於不同版本的 Godot 具有不同的分支。為早期版本的 Godot 編寫的 GDNative 模組可以在較新版本中運作（除了 3.0 和 3.1 之間的 ARVR 介面的一次重大更改），但反之則不行，因此請確保下載正確的分支。還要注意，您用於生成 ``api.json`` 的 Godot 版本將成為最低版本。

source: To use `GDExtension <https://godotengine.org/article/introducing-gd-extensions>`__ you need to use the godot-cpp branch that matches the version of Godot that you are targeting. For example, if you're targeting Godot 4.1, use the ``4.1`` branch, which is what is shown through out this tutorial.
de: Um `GDExtension <https://godotengine.org/article/introducing-gd-extensions>`__ zu verwenden, müssen Sie den godot-cpp-Branch verwenden, der zu der Version von Godot passt, für die Sie entwickeln. Wenn Sie zum Beispiel Godot 4.1 verwenden, benutzen Sie den Branch ``4.1``, der in diesem Tutorial gezeigt wird.
zh_tw: `GDExtension <https://godotengine.org/article/introducing-gd-extensions>`__ 已經被合併到 godot-cpp 的 ``master`` 分支中，但它只與即將推出的 Godot 4.0 相容。因此，您需要使用 GDNative ，需使用 godot-cpp 的 ``3.x`` 分支，並按照此範例進行操作。

source: The ``master`` branch is the development branch which is updated regularly to work with Godot's ``master`` branch.
de: Der ``master``-Branch ist der Entwicklungsbranch, der regelmäßig aktualisiert wird, um mit dem ``master``-Branch von Godot zusammenzuarbeiten.
zh_tw: 「master」分支是開發分支，它會定期更新以與 Godot 的「master」分支配合使用。

source: Our long-term goal is that GDExtensions targeting an earlier version of Godot will work in later minor versions, but not vice-versa. For example, a GDExtension targeting Godot 4.2 should work just fine in Godot 4.3, but one targeting Godot 4.3 won't work in Godot 4.2.
de: Unser langfristiges Ziel ist es, dass GDExtensions, die auf eine frühere Version von Godot geschrieben sind, in späteren Minor-Versionen funktionieren, aber nicht umgekehrt. Zum Beispiel sollte eine GDExtension, die für Godot 4.2 geschrieben ist, problemlos in Godot 4.3 funktionieren, aber eine, die für Godot 4.3 geschrieben ist, wird nicht in Godot 4.2 funktionieren.
zh_tw: 我們的長期目標是針對早期版本 Godot 的 GDExtensions 將在以後的次要版本中工作，但反之則不然。例如，針對 Godot 4.2 的 GDExtension 在 Godot 4.3 中應該可以正常運作，但針對 Godot 4.3 的 GDExtension 在 Godot 4.2 中則無法運作。

source: However, GDExtension is currently *experimental*, which means that we may break compatibility in order to fix major bugs or include critical features. For example, GDExtensions created for Godot 4.0 aren't compatible with Godot 4.1 (see :ref:`updating_your_gdextension_for_godot_4_1`).
de: Allerdings ist GDExtension derzeit *experimentell*, was bedeutet, dass wir Kompatibilitätsbrüche vornehmen können, um größere Bugs zu beheben oder kritische Funktionen aufzunehmen. Zum Beispiel sind GDExtensions, die für Godot 4.0 erstellt wurden, nicht mit Godot 4.1 kompatibel (siehe :ref:`updating_your_gdextension_for_godot_4_1`).
zh_tw: 然而，GDExtension 目前處於*實驗階段*，這意味著我們可能會破壞相容性以修復主要錯誤或包含關鍵功能。例如，為 Godot 4.0 建立的 GDExtension 與 Godot 4.1 不相容（請參閱:ref:`updating_your_gdextension_for_godot_4_1`）。

source: If you are versioning your project using Git, it is recommended to add it as a Git submodule:
de: Wenn Sie Ihr Projekt mit Git versionieren, empfiehlt es sich, es als Git-Submodul hinzuzufügen:
zh_tw: 如果您使用 Git 對專案進行版本控制，最好將它們新增為 Git 子模組：

source: Alternatively, you can also clone it to the project folder:
de: Alternativ dazu können Sie es auch in den Projektordner klonen:
zh_tw: 或者，您也可以將其克隆到專案資料夾：

source: If you decide to download the repository or clone it into your folder, make sure to keep the folder layout the same as we've setup here. Much of the code we'll be showcasing here assumes the project has this layout.
de: Wenn Sie sich entscheiden, das Repository herunterzuladen oder es in Ihren Ordner zu klonen, achten Sie darauf, dass Sie das Layout des Ordners so beibehalten, wie wir es hier eingerichtet haben. Ein Großteil des Codes, den wir hier zeigen werden, setzt voraus, dass das Projekt dieses Layout hat.
zh_tw: 如果您決定只下載倉庫或將它們克隆到專案檔案夾中，請確保資料夾佈局與此處描述的相同，因為我們將在此處展示的程式碼假定專案遵循此佈局。

source: If you cloned the example from the link specified in the introduction, the submodules are not automatically initialized. You will need to execute the following commands:
de: Wenn Sie das Beispiel über den in der Einleitung angegebenen Link geklont haben, werden die Untermodule nicht automatisch initialisiert. Sie müssen die folgenden Befehle ausführen:
zh_tw: 如果從介紹中指定的連結克隆範例, 子模組不會自動初始化. 您需要執行以下命令:

source: This will initialize the repository in your project folder.
de: Dadurch wird das Repository in Ihrem Projektordner initialisiert.
zh_tw: 這會將這兩個倉庫克隆到您的專案檔案夾中。

source: Building the C++ bindings
de: Bauen der C++-Bindings
zh_tw: 建構 C++ 綁定

source: Now that we've downloaded our prerequisites, it is time to build the C++ bindings.
de: Nachdem wir nun unsere Anforderungen heruntergeladen haben, ist es an der Zeit, die C++ Bindings zu erstellen.
zh_tw: 現在我們已經下載了我們的先決條件, 現在是建構C++綁定的時候了.

source: The repository contains a copy of the metadata for the current Godot release, but if you need to build these bindings for a newer version of Godot, simply call the Godot executable:
de: Das Repository enthält eine Kopie der Metadaten für die aktuelle Godot-Version, aber wenn Sie diese Bindings für eine neuere Version von Godot erstellen müssen, rufen Sie einfach die ausführbare Godot-Datei auf:
zh_tw: 倉庫包含目前 Godot 版本的中繼資料副本，但如果您需要為較新版本的 Godot 建構這些綁定，只需呼叫 Godot 可執行檔：

source: The resulting ``extension_api.json`` file will be created in the executable's directory. Copy it to the project folder and add ``custom_api_file=<PATH_TO_FILE>`` to the scons command below.
de: Die resultierende Datei ``extension_api.json`` wird im Verzeichnis der ausführbaren Datei erstellt. Kopieren Sie sie in den Projektordner und fügen Sie ``custom_api_file=<PATH_TO_FILE>`` zu dem unten stehenden scons-Befehl hinzu.

source: To generate and compile the bindings, use this command (replacing ``<platform>`` with ``windows``, ``linux`` or ``macos`` depending on your OS):
de: Um die Bindings zu erzeugen und zu kompilieren, verwenden Sie diesen Befehl (ersetzen Sie ``<Plattform>`` durch ``Windows``, ``Linux`` oder ``Macos``, abhängig von Ihrem Betriebssystem):
zh_tw: 要生成和編譯綁定, 使用這個命令(根據你的作業系統, 用 ``windows`` , ``linux`` 或 ``osx`` 代替 ``<platform>`` ):

source: The build process automatically detects the number of CPU threads to use for parallel builds. To specify a number of CPU threads to use, add ``-jN`` at the end of the SCons command line where ``N`` is the number of CPU threads to use.
de: Der Buildprozess erkennt automatisch die Anzahl der zu verwendenden CPU-Threads für parallele Builds. Um die Anzahl der zu verwendenden CPU-Threads anzugeben, fügen Sie ``-jN`` am Ende der SCons-Kommandozeile hinzu, wobei ``N`` die Anzahl der zu verwendenden CPU-Threads ist.

source: This step will take a while. When it is completed, you should have static libraries that can be compiled into your project stored in ``godot-cpp/bin/``.
de: Dieser Schritt wird eine Weile dauern. Wenn er abgeschlossen ist, sollten Sie statische Bibliotheken haben, die in Ihr Projekt kompiliert werden können und in ``godot-cpp/bin/`` gespeichert sind.
zh_tw: 這一步將需要一段時間. 完成後, 您應該有一個靜態程式庫, 可以編譯到您的專案中, 儲存在 ``godot-cpp / bin /`` 中.

source: You may need to add ``bits=64`` to the command on Windows or Linux.
de: Unter Windows oder Linux müssen Sie eventuell ``bits=64`` zu dem Befehl hinzufügen.
zh_tw: 您可能需要在 Windows 或 Linux 的命令列中新增 ``bits=64``。

source: Creating a simple plugin
de: Erstellen eines einfachen Plugins
zh_tw: 建立一個簡單的外掛程式

source: Now it's time to build an actual plugin. We'll start by creating an empty Godot project in which we'll place a few files.
de: Jetzt ist es an der Zeit, ein echtes Plugin zu erstellen. Wir beginnen mit der Erstellung eines leeren Godot-Projekts, in das wir ein paar Dateien einfügen werden.
zh_tw: 現在是建構實際外掛程式的時候了. 我們首先建立一個空的Godot專案, 我們將在其中放置一些檔.

source: Open Godot and create a new project. For this example, we will place it in a folder called ``demo`` inside our GDExtension's folder structure.
de: Öffnen Sie Godot und erstellen Sie ein neues Projekt. Für dieses Beispiel werden wir es in einem Ordner namens ``demo`` innerhalb der Ordnerstruktur unserer GDExtension ablegen.
zh_tw: 打開Godot並建立一個新專案. 對於這個範例, 我們將它放在我們的GDNative模組的資料夾結構中名為 ``demo`` 的資料夾中.

source: In our demo project, we'll create a scene containing a Node called "Main" and we'll save it as ``main.tscn``. We'll come back to that later.
de: In unserem Demoprojekt erstellen wir eine Szene, die einen Node mit dem Namen "Main" enthält, und speichern sie als ``main.tscn`` ab. Wir werden später darauf zurückkommen.
zh_tw: 在我們的演示專案中, 我們將建立一個包含名為 "Main" 的節點的場景, 我們將其保存為 ``main.tscn`` . 我們稍後再回過頭來看看.

source: Back in the top-level GDExtension module folder, we're also going to create a subfolder called ``src`` in which we'll place our source files.
de: Im obersten GDExtension-Modulordner erstellen wir einen Unterordner mit dem Namen ``src``, in dem wir unsere Quelldateien ablegen.
zh_tw: 回到頂級GDNative模組資料夾, 我們還將建立一個名為 ``src`` 的子資料夾, 我們將在其中放置原始檔案.

source: You should now have ``demo``, ``godot-cpp``, and ``src`` directories in your GDExtension module.
de: Sie sollten nun die Verzeichnisse ``demo``, ``godot-cpp`` und ``src`` in Ihrem GDExtension Modul haben.
zh_tw: 您現在應該在您的GDNative模組中有 ``demo`` , ``godot-cpp``, ``godot_headers`` 和 ``src`` 目錄.

source: Your folder structure should now look like this:
de: Ihre Ordnerstruktur sollte nun folgendermaßen aussehen:
zh_tw: 現在場景看起來會這樣：

source: In the ``src`` folder, we'll start with creating our header file for the GDExtension node we'll be creating. We will name it ``gdexample.h``:
de: Im Ordner ``src`` beginnen wir mit der Erstellung unserer Header-Datei für den GDExtension-Node, den wir erstellen werden. Wir werden sie ``gdexample.h`` nennen:
zh_tw: 在 ``src`` 資料夾中, 我們將首先為我們將要建立的GDNative節點建立標頭檔. 我們將它命名為 ``gdexample.h`` :

source: There are a few things of note to the above. We include ``sprite2d.hpp`` which contains bindings to the Sprite2D class. We'll be extending this class in our module.
de: Es gibt ein paar Dinge, die zu beachten sind. Wir fügen ``sprite2d.hpp`` ein, die Bindings zur Sprite2D-Klasse enthält. Wir werden diese Klasse in unserem Modul erweitern.
zh_tw: 以上有一些注意事項. 我們包括 ``Godot.hpp`` , 其中包含我們所有的基本定義. 之後, 我們包含 ``Sprite.hpp`` , 它包含對Sprite類的綁定. 我們將在我們的模組中擴充這個類.

source: We're using the namespace ``godot``, since everything in GDExtension is defined within this namespace.
de: Wir verwenden den Namespace ``godot``, da alles in GDExtension in diesem Namespace definiert ist.
zh_tw: 我們使用命名空間 ``godot`` , 因為GDNative中的所有內容都在此命名空間中定義.

source: Then we have our class definition, which inherits from our Sprite2D through a container class. We'll see a few side effects of this later on. The ``GDCLASS`` macro sets up a few internal things for us.
de: Dann haben wir unsere Klassendefinition, die von unserem Sprite2D über eine Containerklasse erbt. Wir werden später noch ein paar Nebeneffekte davon sehen. Das ``GDCLASS``-Makro richtet ein paar interne Dinge für uns ein.
zh_tw: 然後我們有了我們的類定義, 它通過容器類從我們的Sprite繼承. 我們稍後會看到一些副作用. 這也是NativeScript 1.1中將要改進的主要部分. ``GODOT_CLASS`` 宏為我們設定了一些內部事物.

source: After that, we declare a single member variable called ``time_passed``.
de: Danach deklarieren wir eine einzelne Membervariable namens ``time_passed``.
zh_tw: 之後, 我們宣告一個名為 ``time_passed`` 的成員變數.

source: In the next block we're defining our methods, we have our constructor and destructor defined, but there are two other functions that will likely look familiar to some, and one new method.
de: Im nächsten Block definieren wir unsere Methoden. Wir haben unseren Konstruktor und Destruktor definiert, aber es gibt zwei weitere Funktionen, die einigen wahrscheinlich bekannt vorkommen werden, und eine neue Methode.
zh_tw: 在下一個塊中我們定義了我們的方法, 我們顯然已經定義了建構子和解構函式, 但是還有其他兩個函式可能看起來很熟悉.

source: The first is ``_bind_methods``, which is a static function that Godot will call to find out which methods can be called and which properties it exposes. The second is our ``_process`` function, which will work exactly the same as the ``_process`` function you're used to in GDScript.
de: Die erste ist ``_bind_methods``, eine statische Funktion, die Godot aufruft, um herauszufinden, welche Methoden aufgerufen werden können und welche Propertys sie freigeben. Die zweite ist unsere Funktion ``_process``, die genau so funktioniert wie die Funktion ``_process``, die Sie aus GDScript kennen.
zh_tw: 第一個是 ``_register_methods`` , 這是一個靜態函式,Godot將呼叫它來找出可以在我們的NativeScript上呼叫哪些方法以及它暴露的屬性. 第二個是我們的 ``_process`` 函式, 它與您在GDScript中習慣的 ``_process`` 函式完全相同. 第三個是我們的 ``_init`` 函式, 它是在Godot正確設定我們的物件之後呼叫的. 即使您沒有在其中放置任何程式碼, 它也必須存在.

source: Let's implement our functions by creating our ``gdexample.cpp`` file:
de: Lassen Sie uns unsere Funktionen implementieren, indem wir unsere Datei ``gdexample.cpp`` erstellen:
zh_tw: 所以, 讓我們通過建立 ``gdexample.cpp`` 檔來實作我們的函式:

source: This one should be straightforward. We're implementing each method of our class that we defined in our header file.
de: Dies sollte ganz einfach sein. Wir implementieren jede Methode unserer Klasse, die wir in unserer Header-Datei definiert haben.
zh_tw: 這一點應該很簡單。我們正在實作我們在頭檔案中定義的類別的每個方法。

source: Note our ``_process`` function, which keeps track of how much time has passed and calculates a new position for our sprite using a sine and cosine function.
de: Beachten Sie unsere Funktion ``_process``, die verfolgt, wie viel Zeit vergangen ist und eine neue Position für unser Sprite mit Hilfe einer Sinus- und Cosinusfunktion berechnet.
zh_tw: 注意我們的“_process”函式，它追蹤已經過去了多少時間，並使用正弦和餘弦函式計算精靈的新位置。

source: There is one more C++ file we need; we'll name it ``register_types.cpp``. Our GDExtension plugin can contain multiple classes, each with their own header and source file like we've implemented ``GDExample`` up above. What we need now is a small bit of code that tells Godot about all the classes in our GDExtension plugin.
de: Es gibt noch eine C++-Datei, die wir brauchen; wir nennen sie ``register_types.cpp``. Unser GDExtension-Plugin kann mehrere Klassen enthalten, jede mit ihrer eigenen Header- und Quelldatei, wie wir sie oben in ``GDExample`` implementiert haben. Was wir jetzt brauchen, ist ein kleines Stück Code, das Godot über alle Klassen in unserem GDExtension-Plugin informiert.
zh_tw: 還有一個我們需要的C++檔; 我們將它命名為 ``gdlibrary.cpp`` . 我們的GDNative外掛程式可以包含多個NativeScripts, 每個都有自己的標頭檔和原始檔案, 就像我們在上面實作了 ``GDExample`` 一樣. 我們現在需要的是一小段程式碼, 告訴Godot我們的GDNative外掛程式中的所有NativeScripts.

source: The ``initialize_example_module`` and ``uninitialize_example_module`` functions get called respectively when Godot loads our plugin and when it unloads it. All we're doing here is parse through the functions in our bindings module to initialize them, but you might have to set up more things depending on your needs. We call the function ``register_class`` for each of our classes in our library.
de: Die Funktionen ``initialize_example_module`` und ``uninitialize_example_module`` werden jeweils aufgerufen, wenn Godot unser Plugin lädt und wenn es das Plugin entlädt. Alles, was wir hier tun, ist, die Funktionen in unserem Binding-Modul zu parsen, um sie zu initialisieren, aber Sie müssen vielleicht noch mehr einrichten, je nach Ihren Bedürfnissen. Wir rufen die Funktion ``register_class`` für jede unserer Klassen in unserer Bibliothek auf.
zh_tw: 當Godot載入我們的外掛程式並解除安裝它時, 分別呼叫 ``godot_gdnative_init`` 和 ``godot_gdnative_terminate`` 函式. 我們在這裡所做的只是解析我們的綁定模組中的函式來初始化它們, 但您可能需要根據需要設定更多內容.

source: The important function is the third function called ``example_library_init``. We first call a function in our bindings library that creates an initialization object. This object registers the initialization and termination functions of the GDExtension. Furthermore, it sets the level of initialization (core, servers, scene, editor, level).
de: Die wichtigste Funktion ist die dritte Funktion namens ``example_library_init``. Wir rufen zunächst eine Funktion in unserer Binding-Bibliothek auf, die ein Initialisierungsobjekt erzeugt. Dieses Objekt registriert die Initialisierungs- und Beendigungsfunktionen der GDExtension. Außerdem legt es die Ebene der Initialisierung fest (core, servers, scene, editor, level).

source: At last, we need the header file for the ``register_types.cpp`` named ``register_types.h``.
de: Zuletzt brauchen wir noch die Header-Datei für die ``register_types.cpp`` namens ``register_types.h``.
zh_tw: 最後，我們需要名為「register_types.h」的「register_types.cpp」頭檔。

source: Compiling the plugin
de: Kompilieren des Plugins
zh_tw: 編譯外掛程式

source: We cannot easily write by hand a ``SConstruct`` file that SCons would use for building. For the purpose of this example, just use :download:`this hardcoded SConstruct file <files/cpp_example/SConstruct>` we've prepared. We'll cover a more customizable, detailed example on how to use these build files in a subsequent tutorial.
de: Wir können nicht einfach von Hand eine ``SConstruct``-Datei schreiben, die SCons zum Bauen verwenden würde. Für den Zweck dieses Beispiels verwenden wir einfach :download:`diese hartcodierte SConstruct-Datei <files/cpp_example/SConstruct>`, die wir vorbereitet haben. Wir werden in einem späteren Tutorial ein detaillierteres Beispiel für die Verwendung dieser Build-Dateien behandeln.
zh_tw: 手工編寫 SCons 用於建構的 ``SConstruct`` 檔案並不容易。出於這個範例的目的，只需使用我們已經準備好的:download:`這個硬編碼的 SConstruct 檔 <files/cpp_example/SConstruct>`。我們將在後續教學中介紹如何使用這些建構檔的更可定制的詳細範例。

source: This ``SConstruct`` file was written to be used with the latest ``godot-cpp`` master, you may need to make small changes using it with older versions or refer to the ``SConstruct`` file in the Godot 4.0 documentation.
de: Diese ``SConstruct``-Datei wurde geschrieben, um mit dem neuesten ``godot-cpp``-Master verwendet zu werden. Möglicherweise müssen Sie kleine Änderungen vornehmen, wenn Sie sie mit älteren Versionen verwenden oder die ``SConstruct``-Datei in der Godot 4.0-Dokumentation nachschlagen.
zh_tw: 這個 ``SConstruct`` 檔被編寫為與最新的godot-cpp master分支一起使用, 您可能需要使用舊版本進行小的更改, 或者參考Godot 3.0文件中的 ``SConstruct`` 檔.

source: Once you've downloaded the ``SConstruct`` file, place it in your GDExtension folder structure alongside ``godot-cpp``, ``src`` and ``demo``, then run:
de: Nachdem Sie die ``SConstruct``-Datei heruntergeladen haben, legen Sie sie in Ihre GDExtension-Ordnerstruktur neben ``godot-cpp``, ``src`` und ``demo``, und führen Sie folgendes aus:
zh_tw: 一旦你下載了 ``SConstruct`` 檔案，把它放在你的GDNative模組資料夾中，除了 ``godot-cpp`` 、 ``godot-headers`` 和 ``demo`` 之外，然後運作:

source: You should now be able to find the module in ``demo/bin/<platform>``.
de: Sie sollten das Modul jetzt unter ``demo/bin/<Plattform>`` finden können.
zh_tw: 您現在應該能夠在 ``demo / bin / <platform>`` 中找到該模組.

source: Here, we've compiled both godot-cpp and our gdexample library as debug builds. For optimized builds, you should compile them using the ``target=template_release`` switch.
de: Hier haben wir sowohl godot-cpp als auch unsere gdexample-Bibliothek als Debug-Builds kompiliert. Für optimierte Builds sollten Sie sie mit dem Schalter ``target=template_release`` kompilieren.
zh_tw: 在這裡, 我們編譯了godot-cpp和我們的gdexample庫作為除錯版本. 對於優化的建構, 您應該使用 ``target = release`` 開關編譯它們.

source: Using the GDExtension module
de: Verwendung des GDExtension-Moduls
zh_tw: 使用模組

source: Before we jump back into Godot, we need to create one more file in ``demo/bin/``.
de: Bevor wir wieder nach Godot zurückkehren, müssen wir noch eine Datei in ``demo/bin/`` erstellen.
zh_tw: 在我們跳回Godot之前, 我們需要在 ``demo / bin /`` 中再建立兩個檔. 兩者都可以使用Godot編輯器建立, 但直接建立它們可能會更快.

source: This file lets Godot know what dynamic libraries should be loaded for each platform and the entry function for the module. It is called ``gdexample.gdextension``.
de: Diese Datei teilt Godot mit, welche dynamischen Bibliotheken für die einzelnen Plattformen geladen werden sollen und wie die Eingabefunktion für das Modul lautet. Sie heißt ``gdexample.gdextension``.
zh_tw: 第一個是一個檔, 讓Godot知道應該為每個平臺載入什麼動態庫, 並稱為 ``gdexample.gdnlib`` .

source: This file contains a ``configuration`` section that controls the entry function of the module. You should also set the minimum compatible Godot version with ``compatability_minimum``, which prevents older version of Godot from trying to load your extension.
de: Diese Datei enthält einen Abschnitt ``configuration``, der die Eingabefunktion des Moduls steuert. Sie sollten auch die minimale kompatible Godot-Version mit ``compatability_minimum`` festlegen, die verhindert, dass ältere Godot-Versionen versuchen, Ihre Erweiterung zu laden.
zh_tw: 該檔案包含一個「configuration」部分，用於控制模組的入口函式。您還應該使用“compatability_minimum”設定最低相容的 Godot 版本，這可以防止舊版本的 Godot 嘗試載入您的擴充功能。
