Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdextension/gdextension_cpp_example.po
Languages: de, zh_tw

source: The ``libraries`` section is the important bit: it tells Godot the location of the dynamic library in the project's filesystem for each supported platform. It will also result in *just* that file being exported when you export the project, which means the data pack won't contain libraries that are incompatible with the target platform.
de: Der Abschnitt ``libraries`` ist der wichtige Teil: er teilt Godot den Ort der dynamischen Bibliothek im Dateisystem des Projekts für jede unterstützte Plattform mit. Es wird auch dazu führen, dass *nur* diese Datei exportiert wird, wenn Sie das Projekt exportieren, was bedeutet, dass das Datenpaket keine Bibliotheken enthält, die mit der Target-Plattform inkompatibel sind.
zh_tw: ``entry`` 部分是重要的一點: 它告訴Godot每個支援平臺的專案檔案系統中動態庫的位置. 匯出專案時, 這也將導致 *僅* 匯出該檔, 這意味著封包不會包含與目標平臺不相容的庫.

source: Finally, the ``dependencies`` section allows you to name additional dynamic libraries that should be included as well. This is important when your GDExtension plugin implements someone else's library and requires you to supply a third-party dynamic library with your project.
de: Schließlich können Sie im Abschnitt ``dependencies`` zusätzliche dynamische Bibliotheken angeben, die ebenfalls eingebunden werden sollen. Dies ist wichtig, wenn Ihr GDExtension-Plugin die Bibliothek eines anderen Herstellers implementiert und Sie eine dynamische Bibliothek eines Drittanbieters mit Ihrem Projekt bereitstellen müssen.
zh_tw: 最後, ``dependencies`` 部分允許您命名應包含的其他動態庫. 當您的GDNative外掛程式實作其他人的庫並要求您為專案提供協力廠商動態庫時, 這一點非常重要.

source: Here is another overview to check the correct file structure:
de: Hier ist eine weitere Übersicht zur Überprüfung der korrekten Dateistruktur:
zh_tw: 這是檢查正確檔案結構的另一個概述：

source: Time to jump back into Godot. We load up the main scene we created way back in the beginning and now add a newly available GDExample node to the scene:
de: Zeit, wieder zu Godot zurückzukehren. Wir laden die Hauptszene, die wir zu Beginn erstellt haben, und fügen nun einen neu verfügbaren GDExample-Node zur Szene hinzu:
zh_tw: 是時候跳回Godot了. 我們在開始時載入我們建立的主場景, 現在為場景新增一個Sprite:

source: We're going to assign the Godot logo to this node as our texture, disable the ``centered`` property:
de: Wir werden diesem Node das Godot-Logo als Textur zuweisen und die Property ``centered`` deaktivieren:
zh_tw: 我們要將Godot徽標指定給這個精靈作為我們的紋理, 禁用 ``centered`` 屬性並將我們的 ``gdexample.gdns`` 檔拖到精靈的 ``script`` 屬性中:

source: We're finally ready to run the project:
de: Wir sind endlich bereit, das Projekt auszuführen:
zh_tw: 我們終於準備好運作這個專案了:

source: Custom editor icon
de: Benutzerdefiniertes Editor-Icon
zh_tw: 新增自定編輯器圖示

source: By default, Godot uses the node icon in the scene dock for GDExtension nodes. The custom icon can be added via the ``gdextension`` file. The node's icon is set by reference to its name and resource path of an SVG file.
de: Standardmäßig verwendet Godot das Node-Icon im Szenendock für GDExtension-Nodes. Das eigene Icon kann über die Datei ``gdextension`` hinzugefügt werden. Das Icon des Nodes wird durch Bezugnahme auf seinen Namen und den Ressourcenpfad einer SVG-Datei festgelegt.
zh_tw: 預設情況下，Godot 使用場景停靠列中的節點圖示作為 GDExtension 節點。自訂圖示可以透過「gdextension」檔案新增。節點的圖示是透過引用其名稱和 SVG 檔案的資源路徑來設定的。

source: For example:
de: Zum Beispiel:
zh_tw: 如：

source: The path should point to a 16 by 16 pixel SVG image. Read the guide for :ref:`creating icons <doc_editor_icons>` for more information.
de: Der Pfad sollte auf ein 16 x 16 Pixel großes SVG-Bild verweisen. Lesen Sie die Anleitung für :ref:`Erstellung von Icons <doc_editor_icons>` für weitere Informationen.
zh_tw: 該路徑應指向 16 x 16 像素的 SVG 影像。閱讀建立圖示 <doc_editor_icons> 指南以取得更多資訊。

source: Adding properties
de: Propertys hinzufügen
zh_tw: 新增屬性

source: GDScript allows you to add properties to your script using the ``export`` keyword. In GDExtension you have to register the properties with a getter and setter function or directly implement the ``_get_property_list``, ``_get`` and ``_set`` methods of an object (but that goes far beyond the scope of this tutorial).
de: GDScript erlaubt es Ihnen, Ihrem Skript mit dem Schlüsselwort ``export`` Propertys hinzuzufügen. In GDExtension müssen Sie die Propertys mit einer Getter- und Setter-Funktion registrieren oder direkt die Methoden ``_get_property_list``, ``_get`` und ``_set`` eines Objekts implementieren (aber das würde den Rahmen dieses Tutorials sprengen).
zh_tw: 還有第三種選擇, 就像在GDScript中一樣, 您可以直接實作一個物件的 ``_get_property_list`` , ``_get`` 和 ``_set`` 方法, 但這遠遠超出了本教學的範圍.

source: Lets add a property that allows us to control the amplitude of our wave.
de: Fügen wir eine Property hinzu, mit der wir die Amplitude unserer Welle steuern können.
zh_tw: 我們將從直接綁定開始檢查兩者. 讓我們新增一個允許我們控制波浪幅度的屬性.

source: In our ``gdexample.h`` file we need to add a member variable and getter and setter functions:
de: In unserer Datei ``gdexample.h`` müssen wir eine Membervariable sowie Getter- und Setter-Funktionen hinzufügen:
zh_tw: 在我們的 ``gdexample.h`` 檔中, 我們只需新增一個成員變數, 如下所示:

source: In our ``gdexample.cpp`` file we need to make a number of changes, we will only show the methods we end up changing, don't remove the lines we're omitting:
de: In unserer Datei ``gdexample.cpp`` müssen wir eine Reihe von Änderungen vornehmen. Wir zeigen nur die Methoden, die wir am Ende ändern, entfernen Sie nicht die Zeilen, die wir weglassen:
zh_tw: 在我們的 ``gdexample.cpp`` 檔中, 我們需要進行一些更改, 我們只會顯示我們最終更改的方法, 不要刪除我們省略的行:

source: Once you compile the module with these changes in place, you will see that a property has been added to our interface. You can now change this property and when you run your project, you will see that our Godot icon travels along a larger figure.
de: Sobald Sie das Modul mit diesen Änderungen kompiliert haben, werden Sie sehen, dass eine Property zu unserer Schnittstelle hinzugefügt wurde. Sie können diese Property nun ändern, und wenn Sie Ihr Projekt ausführen, werden Sie sehen, dass unser Godot-Icon entlang einer größeren Figur wandert.
zh_tw: 使用這些更改編譯模組後，就會看到介面上加入了一個屬性。您現在可以更改此屬性，當您運作專案時，您將看到我們的 Godot 圖示沿著更大的數位移動。

source: Let's do the same but for the speed of our animation and use a setter and getter function. Our ``gdexample.h`` header file again only needs a few more lines of code:
de: Machen wir dasselbe, aber für die Geschwindigkeit unserer Animation, und verwenden wir eine Setter- und Getter-Funktion. Unsere Header-Datei ``gdexample.h`` benötigt wiederum nur ein paar Zeilen mehr Code:
zh_tw: 讓我們做同樣的事情但是為了我們動畫的速度並使用 setter 和 getter 函式。我們的 ``gdexample.h`` 標頭檔再次只需要幾行程式碼：

source: This requires a few more changes to our ``gdexample.cpp`` file, again we're only showing the methods that have changed so don't remove anything we're omitting:
de: Dies erfordert ein paar weitere Änderungen in der Datei ``gdexample.cpp``. Auch hier zeigen wir nur die Methoden, die sich geändert haben, also entfernen Sie nichts, was wir weglassen:
zh_tw: 這需要對我們的 ``gdexample.cpp`` 檔進行一些更改, 同樣我們只顯示已更改的方法, 所以不要刪除我們忽略的任何內容:

source: Now when the project is compiled, we'll see another property called speed. Changing its value will make the animation go faster or slower. Furthermore, we added a property range which describes in which range the value can be. The first two arguments are the minimum and maximum value and the third is the step size.
de: Wenn das Projekt nun kompiliert wird, sehen wir eine weitere Property namens "speed". Wenn man ihren Wert ändert, wird die Animation schneller oder langsamer. Außerdem haben wir eine Property "range" hinzugefügt, die beschreibt, in welchem Bereich der Wert liegen kann. Die ersten beiden Argumente sind der Minimal- und der Maximalwert und das dritte Argument ist die Schrittweite.
zh_tw: 編譯完專案後，我們就會看到另一個名為 speed 的屬性。更改其值將使動畫更快或更慢。

source: For simplicity, we've only used the hint_range of the property method. There are a lot more options to choose from. These can be used to further configure how properties are displayed and set on the Godot side.
de: Der Einfachheit halber haben wir nur den "hint_range" der Property-Methode verwendet. Es gibt noch viele weitere Optionen, aus denen Sie wählen können. Diese können verwendet werden, um weiter zu konfigurieren, wie Propertys auf der Godot-Seite angezeigt und eingestellt werden.
zh_tw: 為簡單起見，我們在 register_property<class, type> 方法呼叫中省略了可選的參數。這些參數有 ``rpc_mode``、``usage``、``hint``、``hint_string``。這些可用於進一步配置屬性在 Godot 方面的顯示和設定方式。

source: Signals
de: Signale
zh_tw: 訊號

source: Last but not least, signals fully work in GDExtension as well. Having your extension react to a signal given out by another object requires you to call ``connect`` on that object. We can't think of a good example for our wobbling Godot icon, we would need to showcase a far more complete example.
de: Zu guter Letzt funktionieren Signale auch in GDExtension vollständig. Damit Ihre Extension auf ein Signal reagiert, das von einem anderen Objekt ausgegeben wird, müssen Sie ``connect`` auf diesem Objekt aufrufen. Uns fällt kein gutes Beispiel für unser wackelndes Godot-Icon ein, wir müssten ein viel umfassenderes Beispiel zeigen.
zh_tw: 最後但同樣重要的是, 訊號也完全適用於GDNative. 讓模組對另一個物件發出的訊號作出反應, 需要在該物件上呼叫 ``connect`` . 我們想不出一個擺動Godot圖示的好範例, 我們需要展示一個更完整的範例.

source: This is the required syntax:
de: Dies ist die erforderliche Syntax:
zh_tw: 這是必需的語法：

source: To connect our signal ``the_signal`` from some other node with our method ``my_method``, we need to provide the ``connect`` method with the name of the signal and a ``Callable``. The ``Callable`` holds information about an object on which a method can be called. In our case, it associates our current object instance ``this`` with the method ``my_method`` of the object. Then the ``connect`` method will add this to the observers of ``the_signal``. Whenever ``the_signal`` is now emitted, Godot knows which method of which object it needs to call.
de: Um unser Signal ``the_signal`` von einem anderen Node mit unserer Methode ``my_method`` zu verbinden, müssen wir der Methode ``connect`` den Namen des Signals und ein ``Callable`` übergeben. Das ``Callable`` enthält Informationen über ein Objekt, auf dem eine Methode aufgerufen werden kann. In unserem Fall assoziiert es unsere aktuelle Objektinstanz ``this`` mit der Methode ``my_method`` des Objekts. Dann fügt die Methode ``connect`` dies zu den Beobachtern von ``the_signal`` hinzu. Wann immer ``the_signal`` nun ausgesendet wird, weiß Godot, welche Methode welchen Objekts es aufrufen muss.

source: Note that you can only call ``my_method`` if you've previously registered it in your ``_bind_methods`` method. Otherwise Godot will not know about the existence of ``my_method``.
de: Beachten Sie, dass Sie ``my_method`` nur aufrufen können, wenn Sie sie zuvor in Ihrer Methode ``_bind_methods`` registriert haben. Andernfalls wird Godot nichts von der Existenz von ``my_method`` wissen.

source: To learn more about ``Callable``, check out the class reference here: :ref:`Callable <class_Callable>`.
de: Um mehr über ``Callable`` zu erfahren, lesen Sie die Klassenreferenz hier: :ref:`Callable <class_Callable>`.

source: Having your object sending out signals is more common. For our wobbling Godot icon, we'll do something silly just to show how it works. We're going to emit a signal every time a second has passed and pass the new location along.
de: Üblicher ist es, dass Ihr Objekt Signale aussendet. Für unser wackelndes Godot-Icon werden wir etwas Albernes machen, um zu zeigen, wie es funktioniert. Wir werden jedes Mal, wenn eine Sekunde vergangen ist, ein Signal aussenden und die neue Position weitergeben.
zh_tw: 讓物件發出訊號更為常見。對於我們搖擺不定的 Godot 圖示，我們會做一些愚蠢的事情來展示它是如何工作的。每過一秒鐘我們就會發出一個訊號並傳遞新的位置。

source: In our ``gdexample.h`` header file, we need to define a new member ``time_emit``:
de: In unserer Header-Datei ``gdexample.h`` müssen wir einen neues Member ``time_emit`` definieren:
zh_tw: 在我們的 ``gdexample.h`` 標頭檔中，我們需要定義一個新成員 ``time_emit``：

source: This time, the changes in ``gdexample.cpp`` are more elaborate. First, you'll need to set ``time_emit = 0.0;`` in either our ``_init`` method or in our constructor. We'll look at the other 2 needed changes one by one.
de: Dieses Mal sind die Änderungen in ``gdexample.cpp`` etwas aufwändiger. Zuerst müssen Sie ``time_emit = 0.0;`` entweder in unserer ``_init`` Methode oder in unserem Konstruktor setzen. Wir werden uns die anderen zwei notwendigen Änderungen nacheinander ansehen.
zh_tw: ``gdexample.cpp`` 這次的修改有點複雜。首先，你需要在我們的 ``_init`` 方法或建構子中設定 ``time_emit = 0.0``。另外兩個修改我們將逐一查看。

source: In our ``_bind_methods`` method, we need to declare our signal. This is done as follows:
de: In unserer Methode ``_bind_methods`` müssen wir unser Signal deklarieren. Dies wird wie folgt gemacht:
zh_tw: 在我們的 ``_register_methods`` 方法中，我們需要宣告我們的訊號。按如下方式實作：

source: Here, our ``ADD_SIGNAL`` macro can be a single call with a ``MethodInfo`` argument. ``MethodInfo``'s first parameter will be the signal's name, and its remaining parameters are ``PropertyInfo`` types which describe the essentials of each of the method's parameters. ``PropertyInfo`` parameters are defined with the data type of the parameter, and then the name that the parameter will have by default.
de: Hier kann unser Makro ``ADD_SIGNAL`` ein einzelner Aufruf mit einem ``MethodInfo``-Argument sein. Der erste Parameter von ``MethodInfo`` ist der Name des Signals, und die restlichen Parameter sind ``PropertyInfo``-Typen, die das Wesentliche der einzelnen Parameter der Methode beschreiben. ``PropertyInfo``-Parameter werden mit dem Datentyp des Parameters und dem Namen, den der Parameter standardmäßig hat, definiert.
zh_tw: 在這裡，我們的“ADD_SIGNAL”巨集可以是帶有“MethodInfo”參數的單一呼叫。 「MethodInfo」的第一個參數將是訊號的名稱，其其餘參數是「PropertyInfo」型別，描述每個方法參數的要點。 「PropertyInfo」 參數是使用參數的資料型別以及預設參數的名稱來定義的。

source: So here, we add a signal, with a ``MethodInfo`` which names the signal "position_changed". The ``PropertyInfo`` parameters describe two essential arguments, one of type ``Object``, the other of type ``Vector2``, respectively named "node" and "new_pos".
de: Hier fügen wir also ein Signal hinzu, mit einer ``MethodInfo``, die das Signal "position_changed" nennt. Die ``PropertyInfo``-Parameter beschreiben zwei wesentliche Argumente, eines vom Typ ``Object``, das andere vom Typ ``Vector2``, jeweils mit den Namen "node" und "new_pos".

source: Next, we'll need to change our ``_process`` method:
de: Als nächstes müssen wir unsere Methode ``_process`` ändern:
zh_tw: 接下來我們需要修改我們的 ``_process`` 方法：

source: After a second has passed, we emit our signal and reset our counter. We can add our parameter values directly to ``emit_signal``.
de: Nachdem eine Sekunde vergangen ist, senden wir unser Signal aus und setzen unseren Zähler zurück. Wir können unsere Parameterwerte direkt zu ``emit_signal`` hinzufügen.
zh_tw: 經過一秒鐘後， 我們發出訊號並重設我們的計數器。我們可以將參數值直接新增給 ``emit_signal``。

source: Once the GDExtension library is compiled, we can go into Godot and select our sprite node. In the **Node** dock, we can find our new signal and link it up by pressing the **Connect** button or double-clicking the signal. We've added a script on our main node and implemented our signal like this:
de: Sobald die GDExtension-Bibliothek kompiliert ist, können wir zu Godot gehen und unseren Sprite-Node auswählen. Im **Node**-Dock finden wir unser neues Signal und verknüpfen es durch Drücken des **Connect**-Buttons oder durch Doppelklick auf das Signal. Wir haben ein Skript zu unserem Haupt-Node hinzugefügt und unser Signal wie folgt implementiert:
zh_tw: 完成 GDNative 庫的編譯後，我們可以進入 Godot 並選擇我們的精靈節點。在**節點**面板上，我們可以找到我們新建的訊號，並通過點按**連接**按鈕或按兩下訊號將其連結起來。我們在主節點上新增了一個腳本並實作了這樣的訊號：

source: Every second, we output our position to the console.
de: Jede Sekunde geben wir unsere Position auf der Konsole aus.
zh_tw: 每一秒，我們都會將我們的位置輸出到控制台。

source: Next steps
de: Nächste Schritte
zh_tw: 下一步

source: We hope the above example showed you the basics. You can build upon this example to create full-fledged scripts to control nodes in Godot using C++.
de: Wir hoffen, das obige Beispiel hat Ihnen die Grundlagen gezeigt. Sie können auf diesem Beispiel aufbauen, um vollwertige Skripte zur Steuerung von Nodes in Godot mit C++ zu erstellen.
zh_tw: 以上只是一個簡單的範例, 但我們希望它向您展示基礎知識. 您可以在此範例的基礎上建構完整的腳本, 以使用C++控制Godot中的節點.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
