Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdextension/what_*_gdextension.po
Languages: de, zh_cn, zh_tw

source: What is GDExtension?
de: Was ist GDExtension?
zh_cn: GDExtension 是什么？
zh_tw: 什麼是GDExtension？

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: **GDExtension** is a Godot-specific technology that lets the engine interact with native `shared libraries <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ at run-time. You can use it to run native code without compiling it with the engine.
de: **GDExtension** ist eine Godot-spezifische Technologie, die es der Engine ermöglicht, zur Laufzeit mit nativen `Shared Libraries <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ zu interagieren. Sie können sie verwenden, um nativen Code auszuführen, ohne ihn mit der Engine zu kompilieren.
zh_cn: **GDExtension** 是 Godot 专有的技术，可以让引擎在运行时与原生\ `共享库 <https://zh.wikipedia.org/zh-cn/%E5%87%BD%E5%BC%8F%E5%BA%AB#%E5%85%B1%E4%BA%AB%E5%BA%93>`__\ 交互。你可以通过它来执行原生代码，无需和引擎一同编译。
zh_tw: **GDExtension** 是 Godot 專有的技術，可以讓引擎在運作時與原生`共用庫 <https://zh.wikipedia.org/zh-cn/%E5%87%BD%E5%BC%8F%E5%BA%AB#%E5%85%B1%E4%BA%AB%E5%BA%93>`__互動。你可以通過它來執行原生程式碼，無需和引擎一同編譯。

source: GDExtension is *not* a scripting language and has no relation to :ref:`GDScript <doc_gdscript>`.
de: GDExtension ist *keine* Skriptsprache und hat keine Beziehung zu :ref:`GDScript <doc_gdscript>`.
zh_cn: GDExtension *不是*\ 脚本语言，与 :ref:`GDScript <doc_gdscript>` 无关。
zh_tw: GDExtension *不是*指令碼語言，與 :ref:`GDScript <doc_gdscript>` 無關。

source: Differences between GDExtension and C++ modules
de: Unterschiede zwischen GDExtension und C++-Modulen
zh_cn: GDExtension 与 C++ 模块的区别
zh_tw: GDExtension 與 C++ 模組的區別

source: You can use both GDExtension and :ref:`C++ modules <doc_custom_modules_in_cpp>` to run C or C++ code in a Godot project.
de: Sie können sowohl GDExtension als auch :ref:`C++-Module <doc_custom_modules_in_cpp>` verwenden, um C- oder C++-Code in einem Godot-Projekt auszuführen.
zh_cn: GDExtension 和 :ref:`C++ 模块 <doc_custom_modules_in_cpp>`\ 都可以用于在 Godot 项目中执行 C 或 C++ 代码。
zh_tw: 支援將 :ref:`C++ 模組 <doc_custom_modules_in_c++>` 靜態連結到引擎二進位檔中。

source: They also both allow you to integrate third-party libraries into Godot. The one you should choose depends on your needs.
de: Beide ermöglichen es Ihnen auch, Bibliotheken von Drittanbietern in Godot zu integrieren. Welche Sie wählen sollten, hängt von Ihren Bedürfnissen ab.
zh_cn: 它们都可以用来将第三方库集成进 Godot。选用哪一个取决于你的需求。
zh_tw: 它們都可以用來將協力廠商庫集成進 Godot。選用哪一個取決於你的需求。

source: Our long-term goal is that GDExtensions targeting an earlier version of Godot will work in later minor versions, but not vice-versa. For example, a GDExtension targeting Godot 4.2 should work just fine in Godot 4.3, but one targeting Godot 4.3 won't work in Godot 4.2.
de: Unser langfristiges Ziel ist es, dass GDExtensions, die auf eine frühere Version von Godot geschrieben sind, in späteren Minor-Versionen funktionieren, aber nicht umgekehrt. Zum Beispiel sollte eine GDExtension, die für Godot 4.2 geschrieben ist, problemlos in Godot 4.3 funktionieren, aber eine, die für Godot 4.3 geschrieben ist, wird nicht in Godot 4.2 funktionieren.
zh_cn: 我们的长期目标是，面向早先版本的 GDExtension 在后续的小版本中依然能够运作，但反之则不然。例如，一个面向 Godot 4.2 的 GDExtension 应当在 Godot 4.3 中正常运作，但面向 Godot 4.3 的则不能在 Godot 4.2 中运作。
zh_tw: 我們的長期目標是針對早期版本 Godot 的 GDExtensions 將在以後的次要版本中工作，但反之則不然。例如，針對 Godot 4.2 的 GDExtension 在 Godot 4.3 中應該可以正常運作，但針對 Godot 4.3 的 GDExtension 在 Godot 4.2 中則無法運作。

source: However, GDExtension is currently *experimental*, which means that we may break compatibility in order to fix major bugs or include critical features. For example, GDExtensions created for Godot 4.0 aren't compatible with Godot 4.1 (see :ref:`updating_your_gdextension_for_godot_4_1`).
de: Allerdings ist GDExtension derzeit *experimentell*, was bedeutet, dass wir Kompatibilitätsbrüche vornehmen können, um größere Bugs zu beheben oder kritische Funktionen aufzunehmen. Zum Beispiel sind GDExtensions, die für Godot 4.0 erstellt wurden, nicht mit Godot 4.1 kompatibel (siehe :ref:`updating_your_gdextension_for_godot_4_1`).
zh_cn: 不过，GDExtension 目前仍是 *实验性的*，这就意味着我们为了修复严重的 bug 或引入重大的特性，可能会牺牲兼容性。例如，为 Godot 4.0 创建的 GDExtension 与 Godot 4.1 并不兼容（参见 :ref:`updating_your_gdextension_for_godot_4_1` ）。
zh_tw: 然而，GDExtension 目前處於*實驗階段*，這意味著我們可能會破壞相容性以修復主要錯誤或包含關鍵功能。例如，為 Godot 4.0 建立的 GDExtension 與 Godot 4.1 不相容（請參閱:ref:`updating_your_gdextension_for_godot_4_1`）。

source: Advantages of GDExtension
de: Vorteile von GDExtension
zh_cn: GDExtension 的优点
zh_tw: GDExtension 的優點

source: Unlike modules, GDExtension doesn't require compiling the engine's source code, making it easier to distribute your work. It gives you access to most of the API available to GDScript and C#, allowing you to code game logic with full control regarding performance. It's ideal if you need high-performance code you'd like to distribute as an add-on in the :ref:`asset library <doc_what_is_assetlib>`.
de: Im Gegensatz zu Modulen muss bei GDExtension der Quellcode der Engine nicht kompiliert werden, was die Weitergabe Ihrer Arbeit erleichtert. Sie gibt Ihnen Zugang zu den meisten APIs, die GDScript und C# zur Verfügung stehen, und erlaubt Ihnen, Spiellogik mit voller Kontrolle über die Performance zu programmieren. Es ist ideal, wenn Sie leistungsstarken Code benötigen, den Sie als Add-on in der :ref:`Asset-Bibliothek <doc_what_is_assetlib>` verteilen möchten.
zh_tw: 與模組不同，GDNative 不需要編譯引擎的源碼，可以使你的作品更易於分發。它可以讓你存取 GDScript、C# 使用的大多數 API，讓你在編寫遊戲邏輯時能夠完全控制性能。這是你在:ref:`素材庫 <doc_what_is_assetlib>`中以外掛程式形式分發高性能程式碼的理想選擇。

source: Also:
de: Außerdem:
zh_cn: 并且：
zh_tw: 並且：

source: GDExtension is not limited to C and C++. Thanks to :ref:`third-party bindings <doc_what_is_gdnative_third_party_bindings>`, you can use it with many other languages.
de: Die GDExtension ist nicht auf C und C++ beschränkt. Dank :ref:`Drittanbieter-Bindings <doc_what_is_gdnative_third_party_bindings>` können Sie sie mit vielen anderen Sprachen verwenden.
zh_cn: GDExtension 并不仅限于 C 和 C++。得益于\ :ref:`第三方绑定 <doc_what_is_gdnative_third_party_bindings>`\ ，你也可以在很多其他语言中使用。
zh_tw: GDExtension 並不僅限於 C 和 C++。得益於:ref:`協力廠商綁定 <doc_what_is_gdnative_third_party_bindings>`，你也可以在很多其他語言中使用。

source: You can use the same compiled GDExtension library in the editor and exported project. With C++ modules, you have to recompile all the export templates you plan to use if you require its functionality at run-time.
de: Sie können die gleiche kompilierte GDExtension-Bibliothek im Editor und im exportierten Projekt verwenden. Bei C++-Modulen müssen Sie alle Exportvorlagen, die Sie verwenden möchten, neu kompilieren, wenn Sie deren Funktionalität zur Laufzeit benötigen.
zh_tw: 你可以在編輯器和匯出專案中使用相同的編譯後的 GDNative 庫。而對於 C++ 模組，如果你想在運作時使用相關功能，就必須重新編譯所有想要使用的匯出範本。

source: GDExtension only requires you to compile your library, not the whole engine. That's unlike C++ modules, which are statically compiled into the engine. Every time you change a module, you need to recompile the engine. Even with incremental builds, this process is slower than using GDExtension.
de: Bei GDExtension müssen Sie nur Ihre Bibliothek kompilieren, nicht die gesamte Engine. Das ist anders als bei C++-Modulen, die statisch in die Engine kompiliert werden. Jedes Mal, wenn Sie ein Modul ändern, müssen Sie die Engine neu kompilieren. Selbst bei inkrementellen Builds ist dieser Prozess langsamer als bei der Verwendung von GDExtension.
zh_tw: GDNative 只需編譯你自己的庫，而不是整個引擎。C++ 模組則與此不同，是會靜態編譯進引擎的。每修改一次模組，你就需要重新編譯一次引擎。即使使用差異量建構，這一過程也比 GDNative 要慢。

source: Advantages of C++ modules
de: Vorteile von C++-Modulen
zh_cn: C++ 模块的优点
zh_tw: C++ 模組的優點

source: We recommend :ref:`C++ modules <doc_custom_modules_in_cpp>` in cases where GDExtension isn't enough:
de: Wir empfehlen :ref:`C++-Module <doc_custom_modules_in_cpp>` in Fällen, in denen GDExtension nicht ausreichend ist:
zh_cn: 如果 GDExtension 无法满足要求，我们推荐使用 :ref:`C++ 模块 <doc_custom_modules_in_cpp>`\ ：
zh_tw: 支援將 :ref:`C++ 模組 <doc_custom_modules_in_c++>` 靜態連結到引擎二進位檔中。

source: C++ modules provide deeper integration into the engine. GDExtension's access is not as deep as static modules.
de: C++-Module bieten eine tiefere Integration in die Engine. Der Zugriff von GDExtension ist nicht so tief wie bei statischen Modulen.
zh_cn: C++ 模块提供了与引擎更深层次的集成。GDExtension 的访问能力不如静态模块那般深入。

source: You can use C++ modules to provide additional features in a project without carrying native library files around. This extends to exported projects.
de: Sie können C++-Module verwenden, um zusätzliche Funktionen in einem Projekt bereitzustellen, ohne native Bibliotheksdateien mit sich herumtragen zu müssen. Dies gilt auch für exportierte Projekte.
zh_cn: 使用 C++ 模块为项目提供额外功能，就可以免去携带原生库文件的麻烦。同样也适用于导出的项目。
zh_tw: 使用 C++ 模組為專案提供額外功能，就可以免去攜帶原生庫檔的麻煩。同樣也適用於匯出的專案。

source: If you notice that specific systems are not accessible via GDExtension but are via custom modules, feel free to open an issue on the `godot-cpp repository <https://github.com/godotengine/godot-cpp>`__ to discuss implementation options for exposing the missing functionality.
de: Wenn Sie feststellen, dass bestimmte Systeme nicht über die GDExtension, sondern über benutzerdefinierte Module zugänglich sind, können Sie gerne eine Issue im `godot-cpp-Repository <https://github.com/godotengine/godot-cpp>`__ erstellen, um Implementierungsmöglichkeiten für die fehlende Funktionalität zu diskutieren.

source: Supported languages
de: Unterstützte Sprachen
zh_cn: 支持的语言
zh_tw: 支援的圖片格式

source: The Godot developers officially support the following language bindings for GDExtension:
de: Die Godot-Entwickler unterstützen offiziell die folgenden Sprach-Bindings für GDExtension:
zh_cn: Godot 开发者官方支持以下 GDExtension 语言绑定：
zh_tw: Godot 開發者官方支援以下 GDExtension 語言綁定：

source: There are no plans to support additional languages with GDExtension officially. That said, the community offers several bindings for other languages (see below).
de: Es gibt keine Pläne, weitere Sprachen mit GDExtension offiziell zu unterstützen. Die Community bietet jedoch mehrere Bindings für andere Sprachen an (siehe unten).
zh_tw: 沒有官方支援更多 GDNative 語言的計畫。不過社區提供了不少其他語言的綁定（見下文）。

source: The bindings below are developed and maintained by the community:
de: Die folgenden Bindings werden von der Community entwickelt und gepflegt:
zh_cn: 以下绑定是由社区开发并维护的：
zh_tw: 以下綁定是由社區開發並維護的：

source: Not all bindings mentioned here may be production-ready. Make sure to research options thoroughly before starting a project with one of those. Also, double-check whether the binding is compatible with the Godot version you're using.
de: Nicht alle hier erwähnten Bindings sind für den produktiven Einsatz geeignet. Informieren Sie sich gründlich über die Optionen, bevor Sie ein Projekt mit einer dieser Bindings beginnen. Prüfen Sie auch, ob das Binding mit der von Ihnen verwendeten Godot-Version kompatibel ist.
zh_cn: 这里列出的绑定并不都能用于生产。请在新项目中使用前先做足调查。同时，请确定该绑定与你所使用的 Godot 版本兼容。
zh_tw: 這裡列出的綁定並不都能用於生產。請在新專案中使用前先做足調查。同時，請確定該綁定與你所使用的 Godot 版本相容。

source: Version compatibility
de: Versionskompatibilität
zh_cn: 版本兼容性
zh_tw: 版本相容性

source: GDExtension add-ons compiled for a given Godot version are only guaranteed to work with the same minor release series. For example, a GDExtension add-on compiled for Godot 4.0 will only work with Godot 4.0, 4.0.1, 4.0.2. In addition, GDExtension is not compatible with Godot 3.x.
de: GDExtension-Add-ons, die für eine bestimmte Godot-Version kompiliert wurden, funktionieren garantiert nur mit der gleichen Minor-Release-Serie. Ein für Godot 4.0 kompiliertes GDExtension-Add-on funktioniert zum Beispiel nur mit Godot 4.0, 4.0.1, 4.0.2. Darüber hinaus ist GDExtension nicht mit Godot 3.x kompatibel.
zh_cn: 为特定版本 Godot 编译的 GDExtension 插件只保证能够在相同次要版本上可用。例如，为 Godot 4.0 版本编译的 GDExtension 插件只能用于 Godot 4.0、4.0.1、4.0.2……另外 GDExtension 与 Godot 3.x 不兼容。
zh_tw: 為特定版本 Godot 編譯的 GDExtension 外掛程式只保證能夠在相同次要版本上可用。例如，為 Godot 4.0 版本編譯的 GDExtension 外掛程式只能用於 Godot 4.0、4.0.1、4.0.2……另外 GDExtension 與 Godot 3.x 不相容。

source: GDExtension add-ons are also only compatible with engine builds that use the level of floating-point precision the extension was compiled for. This means that if you use a engine build with double-precision floats, the extension must also be compiled for double-precision floats. See :ref:`doc_large_world_coordinates` for details.
de: GDExtension-Add-ons sind außerdem nur mit Engine-Builds kompatibel, die den Grad der Float-Genauigkeit verwenden, für den die Erweiterung kompiliert wurde. Das bedeutet, dass, wenn Sie einen Engine-Build mit Double Precision Floats verwenden, die Erweiterung auch für Double Precision Floats kompiliert sein muss. Siehe :ref:`doc_large_world_coordinates` für Details.

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: C++ :ref:`(tutorial) <doc_gdextension_cpp_example>`
zh_cn: C++ :ref:`（教程） <doc_gdextension_cpp_example>`
zh_tw: :ref:`doc_input_examples`
