Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/01.game_setup.po
Languages: de, ru, zh_cn, zh_tw

source: Setting up the game area
de: Einrichten des Spielbereichs
ru: Настройка игровой зоны
zh_cn: 设置游戏区域
zh_tw: 設定遊戲區域

source: In this first part, we're going to set up the game area. Let's get started by importing the start assets and setting up the game scene.
de: In diesem ersten Teil werden wir den Spielbereich einrichten. Beginnen wir mit dem Importieren der Start-Assets und dem Einrichten der Spielszene.
ru: Для начала мы настроим игровую область. Давайте начнем с импорта стартовых ресурсов и настройки игровой сцены.
zh_cn: 在第一部分中，我们将设置游戏区域。让我们从导入初始资产、设置游戏场景入手。
zh_tw: 在第一部分中，我們將設定遊戲區域。讓我們從匯入初始素材、設定遊戲場景入手。

source: We've prepared a Godot project with the 3D models and sounds we'll use for this tutorial, linked in the index page. If you haven't done so yet, you can download the archive here: `Squash the Creeps assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
de: Wir haben ein Godot-Projekt mit den 3D-Modellen und Sounds vorbereitet, die wir für dieses Tutorial verwenden werden, und das auf der Index-Seite verlinkt ist. Wenn Sie es noch nicht getan haben, können Sie das Archiv hier herunterladen: `Squash the Creeps Assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
ru: Мы подготовили проект Godot с 3D-моделями и звуками, которые мы будем использовать в этом уроке, ссылка на который находится на странице с содержанием. Если вы ещё не сделали этого, вы можете скачать архив здесь: `Ресурсы Squash the Creeps <https://github.com/GDQuest/godot-3d-dodge-the-creeps/releases/tag/1.0.0>`__.
zh_cn: 我们为这个教程准备了一个带有 3D 模型和音效的 Godot 项目，链接在索引页。如果你还没有下载，可以下载这个压缩包：\ `Squash the Creeps 资产 <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__\ 。
zh_tw: 我們準備了一些遊戲素材，以便我們可以直接跳到程式碼。你可以在這裡下載它們： `Squash the Creeps assets <https://github.com/GDQuest/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__ 。

source: Once you downloaded it, extract the .zip archive on your computer. Open the Godot Project Manager and click the *Import* button.
de: Sobald Sie es heruntergeladen haben, extrahieren Sie das .zip-Archiv auf Ihrem Computer. Öffnen Sie den Godot Projektmanager und klicken Sie auf den *Importieren*-Button.
ru: После загрузки распакуйте .zip архив на своем компьютере. Откройте менеджер проектов Godot и нажмите кнопку *Импорт*.
zh_cn: 下载完成之后，请将 .zip 压缩包解压到你的电脑上。打开 Godot 项目管理器，然后点击\ *导入*\ 按钮。
zh_tw: 一旦下在完成，解壓縮到任意處，然後打開 Godot 並在專案管理員裡點擊 [匯入] 按鈕來新增該專案。

source: In the import popup, enter the full path to the freshly created directory ``squash_the_creeps_start/``. You can click the *Browse* button on the right to open a file browser and navigate to the ``project.godot`` file the folder contains.
de: Geben Sie im Popup-Fenster "Import" den vollständigen Pfad zu dem neu erstellten Verzeichnis ``squash_the_creeps_start/`` ein. Sie können auf den *Durchsuchen*-Button auf der rechten Seite klicken, um einen Dateibrowser zu öffnen und zu der Datei ``project.godot`` zu navigieren, die der Ordner enthält.
ru: В окне импорта введите полный путь к только что созданному каталогу ``squash_the_creeps_start/``. Вы можете нажать кнопку *Обзор* справа, чтобы открыть браузер файлов и перейти к папке, содержащей файл ``project.godot``.
zh_cn: 请在导入弹出框中输入刚才新建的目录 ``squash_the_creeps_start/`` 的完整路径。你也可以点击右侧的\ *浏览*\ 按钮，打开文件浏览器并找到该文件夹所包含的 ``project.godot`` 文件。
zh_tw: 請在匯入彈出框中輸入剛才新建的目錄 ``squash_the_creeps_start/`` 的完整路徑。你也可以點擊右側的*瀏覽*按鈕，打開檔瀏覽器並找到該資料夾所包含的 ``project.godot`` 檔案。

source: Click *Import & Edit* to open the project in the editor.
de: Klicken Sie auf *Importieren & Bearbeiten*, um das Projekt im Editor zu öffnen.
ru: Нажмите **Импортировать и редактировать**, и проект откроется в редакторе.
zh_cn: 点击\ *导入并编辑*\ 在编辑器中打开该项目。
zh_tw: 點擊*匯入並編輯*在編輯器中打開該專案。

source: The start project contains an icon and two folders: ``art/`` and ``fonts/``. There, you will find the art assets and music we'll use in the game.
de: Das Startprojekt enthält ein Icon und zwei Ordner: ``art/`` und ``fonts/``. Dort finden Sie die Grafik- und Musik-Assets, die wir im Spiel verwenden werden.
ru: Начальный проект содержит иконку и две папки: ``art/`` и ``fonts/``. В них вы найдёте ресурсы, которые мы будем использовать в игре.
zh_cn: 起始项目中包含一个图标和两个文件夹：\ ``art/`` 和 ``fonts/``\ 。你可以在里面找到游戏中我们会用到的艺术资产和音乐。
zh_tw: 起始專案中包含一個圖示和兩個資料夾：``art/`` 和 ``fonts/``。你可以在裡面找到遊戲中我們會用到的藝術素材和音樂。

source: There are two 3D models, ``player.glb`` and ``mob.glb``, some materials that belong to these models, and a music track.
de: Es gibt zwei 3D-Modelle, ``player.glb`` und ``mob.glb``, einige zu diesen Modellen gehörende Materialien, und einen Musik-Track.
ru: Здесь имеются две 3D-модели ``player.glb`` и ``mob.glb``, материалы для этих моделей и музыкальный трек.
zh_cn: 里面有两个 3D 模型，\ ``player.glb`` 和 ``mob.glb``\ ，一些模型使用的材质，以及一首音乐。
zh_tw: 裡面有兩個 3D 模型，``player.glb`` 和 ``mob.glb``，一些模型使用的材質，以及一首音樂。

source: Setting up the playable area
de: Einrichten des spielbaren Bereichs
ru: Настройка игровой зоны
zh_cn: 设置游玩区域
zh_tw: 設定建置系統

source: We're going to create our main scene with a plain :ref:`Node <class_Node>` as its root. In the *Scene* dock, click the *Add Child Node* button represented by a "+" icon in the top-left and double-click on *Node*. Name the node ``Main``. An alternate method to rename the node is to right-click on *Node* and choose *Rename* (or :kbd:`F2`). Alternatively, to add a node to the scene, you can press :kbd:`Ctrl + a` (or :kbd:`Cmd + a` on macOS).
de: Wir werden unsere Hauptszene mit einem einfachen :ref:`Node <class_Node>` als Root erstellen. Im *Szenen*-Dock klicken Sie auf den Button *Child-Node hinzufügen*, der durch ein "+"-Icon oben links dargestellt wird, und doppelklicken Sie auf *Node*. Benennen Sie den Node ``Main``. Eine alternative Methode zum Umbenennen des Nodes ist, mit der rechten Maustaste auf *Node* zu klicken und *Umbenennen* zu wählen (oder :kbd:`F2`). Alternativ können Sie auch :kbd:`Strg + a` (oder :kbd:`Cmd + a` unter macOS) drücken, um einen Node zur Szene hinzuzufügen.
ru: Создадим нашу главную сцену с помощью простого узла *Node* в корне. В панели *Сцена* нажмите на кнопку *Добавить Узел*, представленную в виде иконки "+" в верхнем левом углу и дважды нажмите на *Node*. Назовите узел "Main". Либо же добавьте узел к сцене, Вы можете нажать :kbd:`Ctrl + a` (или :kbd:`Cmd + a` на macOS).
zh_cn: 我们将以普通的 :ref:`Node <class_Node>` 作为其根创建主场景。在\ *场景*\ 面板中，单击左上角由“+”图标表示的\ *添加子节点*\ 按钮，然后双击 *Node*\ 。将节点命名为 ``Main``\ 。另一种重命名节点的方法是在\ *节点*\ 上单击右键，然后选择\ *重命名*\ （或者按 :kbd:`F2`\ ）。另一种将节点添加到场景中的方法是按 :kbd:`Ctrl + a` （macOS 上则是按 :kbd:`Cmd + a`\ ）。
zh_tw: 我們將以普通的 :ref:`Node <class_Node>` 作為其根建立主場景。在*場景*面板中，按一下左上角由“+”圖示表示的*新增子節點*按鈕，然後按兩下 *Node*。將節點命名為 ``Main``。另一種重命名節點的方法是在*節點*上按一下右鍵，然後選擇*重命名*（或者按 :kbd:`F2`）。另一種將節點新增到場景中的方法是按 :kbd:`Ctrl + a` （macOS 上則是按 :kbd:`Cmd + a`）。

source: Save the scene as ``main.tscn`` by pressing :kbd:`Ctrl + s` (:kbd:`Cmd + s` on macOS).
de: Speichern Sie die Szene als ``main.tscn`` durch Drücken von :kbd:`Strg + s` (:kbd:`Cmd + s` unter macOS).
ru: Сохраните сцену как ``main.tscn``, нажав :kbd:`Ctrl + s` (:kbd:`Cmd + s` на macOS).
zh_cn: 按 :kbd:`Ctrl + s` 将场景保存为 ``main.tscn``\ （macOS 上则是按 :kbd:`Cmd + s`\ ）。
zh_tw: 接著保存場景。選擇 [場景] -> [保存]，或是在 Windows/Linux 上按鍵盤 :kbd:`Ctrl + S` ，在 macOS 上則是 :kbd:`Cmd + S` 。

source: We'll start by adding a floor that'll prevent the characters from falling. To create static colliders like the floor, walls, or ceilings, you can use :ref:`StaticBody3D <class_StaticBody3D>` nodes. They require :ref:`CollisionShape3D <class_CollisionShape3D>` child nodes to define the collision area. With the ``Main`` node selected, add a :ref:`StaticBody3D <class_StaticBody3D>` node, then a :ref:`CollisionShape3D <class_CollisionShape3D>`. Rename the :ref:`StaticBody3D <class_StaticBody3D>` to ``Ground``.
de: Wir beginnen mit dem Hinzufügen eines Bodens, der die Charaktere am Fallen hindert. Um statische Collider wie den Boden, Wände oder Decken zu erstellen, können Sie :ref:`StaticBody3D <class_StaticBody3D>`-Nodes verwenden. Sie benötigen :ref:`CollisionShape3D <class_CollisionShape3D>` Child-Nodes, um den Kollisionsbereich zu definieren. Fügen Sie bei ausgewähltem ``Main-Node`` einen :ref:`StaticBody3D <class_StaticBody3D>`-Node hinzu, dann einen :ref:`CollisionShape3D <class_CollisionShape3D>`. Benennen Sie den :ref:`StaticBody3D <class_StaticBody3D>` in ``Floor`` um.
ru: Мы начнём с добавления пола, который предотвратит игроков от падения. Чтобы создать такие статические коллайдеры, как пол, стены или потолок, вы можете использовать узел :ref:`StaticBody3D <class_StaticBody3D>`. Ему необходим дочерний узел :ref:`CollisionShape3D <class_CollisionShape3D>`, чтобы определить область столкновения. Выбрав узел ``Main``, добавьте узел :ref:`StaticBody3D <class_StaticBody3D>`, затем :ref:`CollisionShape3D <class_CollisionShape3D>`. Переименуйте :ref:`StaticBody3D <class_StaticBody3D>` в ``Ground``.
zh_cn: 我们先添加一个地板，以防止角色掉落。要创建地板、墙壁或天花板等静态碰撞器，可以使用 :ref:`StaticBody3D <class_StaticBody3D>` 节点。它们需要 :ref:`CollisionShape3D <class_CollisionShape3D>` 子节点来定义碰撞区域。选择 *Main* 节点后，添加 :ref:`StaticBody3D <class_StaticBody3D>` 节点，然后添加 :ref:`CollisionShape3D <class_CollisionShape3D>`。将 :ref:`StaticBody3D <class_StaticBody3D>` 重命名为 ``Ground`` 。
zh_tw: 我們先新增一個地板，以防止角色掉落。要建立地板、牆壁或天花板等靜態碰撞器，可以使用 :ref:`StaticBody3D <class_StaticBody3D>` 節點。它們需要 :ref:`CollisionShape3D <class_CollisionShape3D>` 子節點來定義碰撞區域。選擇 *Main* 節點後，新增 :ref:`StaticBody3D <class_StaticBody3D>` 節點，然後新增 :ref:`CollisionShape3D <class_CollisionShape3D>`。將 :ref:`StaticBody3D <class_StaticBody3D>` 重命名為 ``Ground`` 。

source: Your scene tree should look like this
de: Ihr Szenenbaum sollte wie folgt aussehen
ru: Ваше дерево сцены должно выглядеть так
zh_cn: 你的场景树应该看上去像这样
zh_tw: 現在場景看起來會這樣：

source: A warning sign next to the :ref:`CollisionShape3D <class_CollisionShape3D>` appears because we haven't defined its shape. If you click the icon, a popup appears to give you more information.
de: Ein Warnzeichen neben dem :ref:`CollisionShape3D <class_CollisionShape3D>` erscheint, weil wir seine Shape nicht definiert haben. Wenn Sie auf das Icon klicken, erscheint ein Popup-Fenster, das weitere Informationen enthält.
ru: Предупреждающая знак рядом с :ref:`CollisionShape3D <class_CollisionShape3D>` появляется, потому что мы не определились с формой. Если Вы нажмёте на иконку, появится всплывающее окно, которое предоставит вам больше информации.
zh_cn: 在 :ref:`CollisionShape3D <class_CollisionShape3D>` 旁边会出现一个警告标志，因为我们还没有定义它的形状。如果你点击这个图标，就会弹出一个窗口，为你提供更多信息。
zh_tw: 在 :ref:`CollisionShape3D <class_CollisionShape3D>` 旁邊會出現一個警告旗標，因為我們還沒有定義它的形狀。如果你點擊這個圖示，就會彈出一個視窗，為你提供更多資訊。

source: To create a shape, select the :ref:`CollisionShape3D <class_CollisionShape3D>` node, head to the *Inspector* and click the *<empty>* field next to the *Shape* property. Create a new *BoxShape3D*.
de: Um eine Shape zu erstellen, wählen Sie den :ref:`CollisionShape3D <class_CollisionShape3D>`-Node, gehen zum *Inspektor* und klicken auf das Feld *<leer>* neben der Eigenschaft *Shape*. Erstellen Sie eine neue *BoxShape3D*.
ru: Чтобы создать форму, выберите узел :ref:`CollisionShape3D <class_CollisionShape3D>`, перейдите в *Инспектор* и щелкните по полю <пусто> рядом со свойством *Shape*. Создайте новый *BoxShape3D*.
zh_cn: 要创建形状，请选中 :ref:`CollisionShape3D <class_CollisionShape3D>`\ ，转到\ *检查器*\ ，然后单击 *Shape*\ （形状）属性旁边的 *<空>* 字段。创建一个新的 *BoxShape3D*\ 。
zh_tw: 要建立形狀，請選中 :ref:`CollisionShape3D <class_CollisionShape3D>`，轉到*屬性面板*，然後按一下 *Shape*（形狀）屬性旁邊的 *<空>* 欄位。建立一個新的 *BoxShape3D*。

source: The box shape is perfect for flat ground and walls. Its thickness makes it reliable to block even fast-moving objects.
de: Die Box-Shape ist perfekt für flache Böden und Wände. Dank ihrer Dicke blockiert sie sogar sich schnell bewegende Objekte zuverlässig.
ru: Форма куба идеальна для плоской поверхности и стен. Её толщина делает её надёжной в качестве преграды для быстро двигающихся объектов.
zh_cn: 盒子形状非常适合平坦的地面和墙壁。它的厚度使它能够可靠地阻挡甚至快速移动的物体。
zh_tw: 盒子形狀非常適合平坦的地面和牆壁。它的厚度使它能夠可靠地阻擋甚至快速移動的物體。

source: A box's wireframe appears in the viewport with three orange dots. You can click and drag these to edit the shape's extents interactively. We can also precisely set the size in the inspector. Click on the :ref:`BoxShape3D <class_BoxShape3D>` to expand the resource. Set its *Size* to ``60`` on the X axis, ``2`` for the Y axis, and ``60`` for the Z axis.
de: Das Drahtgitter einer Box wird im Viewport mit drei orangefarbenen Punkten angezeigt. Sie können diese anklicken und ziehen, um die Ausmaße der Shape interaktiv zu bearbeiten. Wir können auch die Größe im Inspektor präzise einstellen. Klicken Sie auf die :ref:`BoxShape3D <class_BoxShape3D>`, um die Ressource zu erweitern. Setzen Sie die *Größe* auf ``60`` für die X-Achse, ``2`` für die Y-Achse und ``60`` für die Z-Achse.
ru: В окне просмотра появится каркас прямоугольника с тремя оранжевыми точками. Вы можете нажать на них и перетащить для того, чтобы отредактировать размеры фигуры в интерактивном режиме. Мы также можем с точностью настроить размер в инспекторе. Нажмите на :ref:`BoxShape3D <class_BoxShape3D>`, чтобы расширить источник. Установите его *размер* равным ``60`` по оси X, ``2`` по оси Y и ``60`` по оси Z.
zh_cn: 盒子的线框会在视口中出现三个橙色的小点。你可以点击并拖动这些点来交互地编辑形状的范围。我们也可以在检查器中精确设置尺寸。点击 :ref:`BoxShape3D <class_BoxShape3D>` 来展开资源。将它的 *Size* 设置为 X 轴上的 ``60``\ ，Y 轴的 ``2`` 和 Z 轴上的 ``60``\ 。
zh_tw: 盒子的線框會在視口中出現三個橙色的小點。你可以點擊並拖動這些點來互動地編輯形狀的範圍。我們也可以在屬性面板中精確設定尺寸。點擊 :ref:`BoxShape3D <class_BoxShape3D>` 來展開資源。將它的 *Size* 設定為 X 軸上的 ``60``，Y 軸的 ``2`` 和 Z 軸上的 ``60``。

source: Collision shapes are invisible. We need to add a visual floor that goes along with it. Select the ``Ground`` node and add a :ref:`MeshInstance3D <class_MeshInstance3D>` as its child.
de: Kollisions-Shapes sind unsichtbar. Wir müssen einen passenden sichtbaren Boden hinzufügen. Wählen Sie den ``Floor``-Node und fügen Sie ein :ref:`MeshInstance3D <class_MeshInstance3D>` als dessen Child hinzu.
ru: Collision shapes(то есть формы столкновения, или коллизии) являются невидимыми. Нам необходимо добавить видимый пол. Выберите узел ``Ground`` и добавьте :ref:`MeshInstance3D <class_MeshInstance3D>`, как его дочерний узел.
zh_cn: 碰撞形状是不可见的。我们需要添加一个与之配套的视觉层。选择 ``Ground`` 节点并添加一个 :ref:`MeshInstance3D <class_MeshInstance3D>` 作为其子节点。
zh_tw: 碰撞形狀是不可見的。我們需要新增一個與之配套的視覺層。選擇 ``Ground`` 節點並新增一個 :ref:`MeshInstance3D <class_MeshInstance3D>` 作為其子節點。

source: In the *Inspector*, click on the field next to *Mesh* and create a :ref:`BoxMesh <class_BoxMesh>` resource to create a visible box.
de: Klicken Sie im *Inspektor* auf das Feld neben *Mesh* und erstellen Sie eine :ref:`BoxMesh <class_BoxMesh>`-Ressource, um eine sichtbare Box zu erstellen.
ru: В *инспекторе*, щелкните на поле рядом с Mesh и создайте :ref:`BoxMesh <class_BoxMesh>`, чтобы создать видимый куб.
zh_cn: 在\ *检查器*\ 中，点击 *Mesh* 旁边的字段，创建一个 :ref:`BoxMesh <class_BoxMesh>` 资源，创建一个可见的立方体。
zh_tw: 在*屬性面板*中，點擊 *Mesh* 旁邊的欄位，建立一個 *BoxMesh* 資源，建立一個可見的立方體。

source: Once again, it's too small by default. Click the box icon to expand the resource and set its *Size* to ``60``, ``2``, and ``60``.
de: Auch hier ist die Default-Größe zu klein. Klicken Sie auf das Kästchen-Icon, um die Ressource zu erweitern und ihre *Größe* auf ``60``, ``2`` und ``60`` zu setzen.
ru: Опять же, по умолчанию он слишком мал. Нажмите на иконку куба, чтобы открыть его свойства и установите его *Размер* на ``60``, ``2``, и ``60``. Так как ресурс (resource) "куб" работает с размером, а не с объемом, нам необходимо установить эти значения так, чтобы они совпали с коллизиями.
zh_cn: 再次设置大小，对于默认值来说它有点太小了。点击立方体图标展开资源，并将其 *Size* 设置为 ``60``\ 、\ ``2``\ 、\ ``60``\ 。由于立方体资源使用的是大小（size）而不是范围（extents），我们需要使用这些值，以便它与我们的碰撞形状相匹配。
zh_tw: 再次設定大小，對於預設值來說它有點太小了。點擊立方體圖示展開資源，並將其 *Size* 設定為 ``60``、``2``、``60``。由於立方體資源使用的是大小（size）而不是範圍（extents），我們需要使用這些值，以便它與我們的碰撞形狀相配對。

source: You should see a wide grey slab that covers the grid and blue and red axes in the viewport.
de: Sie sollten eine breite graue Platte sehen, die das Gitter und die blauen und roten Achsen im Viewport verdeckt.
ru: Вы должны видеть широкую серую панель, которая покрывает сетку, и синие с красными оси в окне просмотра.
zh_cn: 你应该会在视口中看到一个覆盖网格以及蓝色和红色轴的宽灰色平板。
zh_tw: 您應該會在視口中看到一個覆蓋網格以及藍色和紅色軸的寬灰色平板。

source: We're going to move the ground down so we can see the floor grid. Select the ``Ground`` node, hold the :kbd:`Ctrl` key down to turn on grid snapping, and click and drag down on the Y axis. It's the green arrow in the move gizmo.
de: Wir werden den Boden nach unten verschieben, damit wir das Bodengitter sehen können. Wählen Sie den Node ``Floor``, halten Sie die :kbd:`Strg`-Taste gedrückt, um das Einrasten des Gitters zu aktivieren, und klicken und ziehen Sie auf der Y-Achse nach unten. Das ist der grüne Pfeil im Verschiebe-Gizmo.
ru: Переместим поверхность вниз, чтобы мы могли видеть сетку пола. Выберите узел ``Ground``, зажмите клавишу :kbd:`Ctrl`, чтобы включить привязку к сетке (:kbd:`Cmd` на macOS), а затем нажмите и перетащите вниз по оси Y. Это зелёная стрелка в осях.
zh_cn: 我们要把地面往下移一点，这样才能看到地板网格。选中 *Ground* 节点，按住 :kbd:`Ctrl`\ 键启用网格吸附（macOS 上则是 :kbd:`Cmd`\ ），然后单击并在 Y 轴上向下拖动。也就是移动小工具里的绿色箭头。
zh_tw: 我們要把地面往下移一點，這樣才能看到地板網格。選中 *Ground* 節點，按住 :kbd:`Ctrl`鍵啟用網格吸附（macOS 上則是 :kbd:`Cmd`），然後按一下並在 Y 軸上向下拖動。也就是移動小工具裡的綠色箭頭。

source: If you can't see the 3D object manipulator like on the image above, ensure the *Select Mode* is active in the toolbar above the view.
de: Wenn Sie den 3D-Objektmanipulator nicht wie auf dem obrigen Bild sehen können, stellen Sie sicher dass der *Auswahlmodus* in der Toolbar über der Ansicht aktiv ist.
ru: Если Вы не видите манипулятор 3D-объектов, как на картинке сверху, убедитесь в том, что *Select Mode* находится в активном состоянии на панели инструментов сверху.
zh_cn: 如果你没有看到如上图所示的 3D 对象操作器，请确保已激活视图上方工具栏中的\ *选择模式*\ 。
zh_tw: 如果你沒有看到如上圖所示的 3D 物件操作器，請確保已啟動視圖上方工具列中的*選擇模式*。

source: Move the ground down ``1`` meter, in order to have a visible editor grid. A label in the bottom-left corner of the viewport tells you how much you're translating the node.
de: Bewegen Sie den Boden ``1`` Meter nach unten, um ein sichtbares Editorgitter zu haben. Ein Label in der unteren linken Ecke des Viewports zeigt an, wie weit Sie den Node verschieben.
ru: Переместите поверхность вниз на ``1`` метр. Ярлык в нижнем левом углу окна просмотра показывает, насколько вы перетащили узел.
zh_cn: 为了有一个可见的编辑器栅格，可以将地面往下移动 ``1`` 米。视口左下角的标签会显示你将该节点平移了多远。
zh_tw: 為了有一個可見的編輯器柵格，可以將地面往下移動 ``1`` 米。視口左下角的標籤會顯示你將該節點平移了多遠。

source: Moving the *Ground* node down moves both children along with it. Ensure you move the *Ground* node, **not** the *MeshInstance3D* or the *CollisionShape3D*.
de: Wenn Sie den *Floor*-Node nach unten verschieben, werden beide Child-Nodes mit verschoben. Stellen Sie sicher, dass Sie den *Floor*-Node verschieben, **nicht** den *MeshInstance3D* oder den *CollisionShape3D*.
zh_cn: 子节点会跟随 *Ground* 节点一起往下移动。请确保你移动的是 *Ground* 节点，而不是 *MeshInstance3D* 和 *CollisionShape3D*\ 。
zh_tw: 子節點會跟隨 *Ground* 節點一起往下移動。請確保你移動的是 *Ground* 節點，而不是 *MeshInstance3D* 和 *CollisionShape3D*。

source: Ultimately, ``Ground``'s transform.position.y should be -1
de: Letztendlich sollte die transform.position.y von ``Floor`` -1 sein
ru: В конечном итоге, Transform.position.y у ``Ground`` должен быть -1
zh_cn: 最终，``Ground`` 的 transform.position.y 应当是 -1
zh_tw: 最終，``Ground`` 的 transform.position.y 應當是 -1

source: Let's add a directional light so our scene isn't all grey. Select the ``Main`` node and add a child node :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
de: Fügen wir nun ein gerichtetes Licht hinzu, damit unsere Szene nicht komplett grau ist. Wählen Sie den Node ``Main`` und fügen Sie einen Child-Node :ref:`DirectionalLight3D <class_DirectionalLight3D>` hinzu.
ru: Давайте добавим directional light(направленный свет), чтобы наша сцена не была серой. Выберите узел ``Main`` и добавьте дочерний узел :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
zh_cn: 现在来添加一个平行光，从而让我们的整个场景不全都是灰色的。选择 ``Main`` 节点，然后添加一个子节点 :ref:`DirectionalLight3D <class_DirectionalLight3D>`。
zh_tw: 現在來新增一個平行光，從而讓我們的整個場景不全都是灰色的。選擇 ``Main`` 節點，然後新增一個子節點 :ref:`DirectionalLight3D <class_DirectionalLight3D>`。

source: We need to move and rotate the :ref:`DirectionalLight3D <class_DirectionalLight3D>` node. Move it up by clicking and dragging on the manipulator's green arrow and click and drag on the red arc to rotate it around the X axis, until the ground is lit.
de: Wir müssen den Node :ref:`DirectionalLight3D <class_DirectionalLight3D>` verschieben und rotieren. Verschieben Sie ihn nach oben, indem Sie auf den grünen Pfeil des Manipulators klicken und ziehen, und klicken und ziehen Sie auf den roten Bogen, um ihn um die X-Achse zu drehen, bis der Boden beleuchtet ist.
ru: Нам нужно переместить и повернуть узел :ref:`DirectionalLight3D <class_DirectionalLight3D>`. Переместите его вверх, щелкнув и перетащив зеленую стрелку, а затем щелкните и перетащите красную дугу, чтобы повернуть ее вокруг оси X, пока земля не будет освещена.
zh_cn: 我们需要移动并旋转 :ref:`DirectionalLight3D <class_DirectionalLight3D>` 节点。通过单击并拖动操纵器的绿色箭头将其向上移动，然后单击并拖动红色弧线以围绕 X 轴旋转它，直到地面被照亮。
zh_tw: 我們需要移動並旋轉 :ref:`DirectionalLight3D <class_DirectionalLight3D>` 節點。通過按一下並拖動操縱器的綠色箭頭將其向上移動，然後按一下並拖動紅色弧線以圍繞 X 軸旋轉它，直到地面被照亮。

source: In the *Inspector*, turn on *Shadow -> Enabled* by clicking the checkbox.
de: Schalten Sie *Schatten-> An* im *Inspektor* ein, indem sie das Kontrollkästchen anklicken.
ru: В *Inspector* включите *Shadow -> Enabled*, нажав на переключатель.
zh_cn: 在\ *检查器*\ 中，勾选复选框打开\ *Shadow -> Enabled*\ 。
zh_tw: 在*屬性面板*中，勾選核取方塊打開*Shadow -> Enabled*。

source: At this point, your project should look like this.
de: Zu diesem Zeitpunkt sollte Ihr Projekt wie folgt aussehen.
ru: На данном этапе ваш проект должен выглядеть следующим образом.
zh_cn: 项目此时看起来是这个样子。
zh_tw: 腳本最終看起來應該長這樣：

source: That's our starting point. In the next part, we will work on the player scene and base movement.
de: Das ist unser Ausgangspunkt. Im nächsten Teil werden wir an unserer Spielerszene und grundsätzlicher Bewegung arbeiten.
ru: Это наш отправной пункт. В следующей части мы будем работать с сценой игрока и основами передвижений.
zh_cn: 这就是我们的起点了。在下一部分中，我们将处理玩家场景与基础移动。
zh_tw: 這就是我們的起點了。在下一部分中，我們將處理玩家場景與基礎移動。

source: Translation status
de: Übersetzungsstatus
ru: Статус перевода
zh_cn: 翻译状态
zh_tw: 翻譯狀態
