Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/06.jump_and_squash.po
Languages: de, zh_tw

source: Jumping and squashing monsters
de: Springen und Zerstampfen von Monstern
zh_tw: 跳躍與壓扁怪物

source: In this part, we'll add the ability to jump and squash the monsters. In the next lesson, we'll make the player die when a monster hits them on the ground.
de: In diesem Teil werden wir die Fähigkeit hinzufügen, zu springen und die Monster zu zerstampfen. In der nächsten Lektion werden wir dafür sorgen, dass der Spieler stirbt, wenn ein Monster ihn am Boden trifft.
zh_tw: 在這一部分中，我們將新增跳躍、踩扁怪物的能力。在下一節課中，我們會讓怪物在地面上擊中玩家時讓玩家死亡。

source: First, we have to change a few settings related to physics interactions. Enter the world of :ref:`physics layers <doc_physics_introduction_collision_layers_and_masks>`.
de: Zuerst müssen wir einige Einstellungen in Bezug auf Physik-Interaktionen ändern. Wir betreten die Welt der :ref:`Physik-Layer<doc_physics_introduction_collision_layers_and_masks>`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: Controlling physics interactions
de: Steuerung der Physik-Interaktionen
zh_tw: 建立內容

source: Physics bodies have access to two complementary properties: layers and masks. Layers define on which physics layer(s) an object is.
de: Physics-Bodies haben Zugriff auf zwei komplementäre Eigenschaften: Ebenen und Masken. Ebenen definieren auf welcher/-n Physik-Ebene(n) sich ein Objekt befindet.
zh_tw: 物理實體可以存取兩個互補的屬性：層和遮罩。層（Layer）定義的是該物件位於哪些實體層上。

source: Masks control the layers that a body will listen to and detect. This affects collision detection. When you want two bodies to interact, you need at least one to have a mask corresponding to the other.
de: Masken steuern die Ebenen, auf die ein Body hört und die er erkennt. Dies wirkt sich auf die Kollisionserkennung aus. Wenn zwei Bodies miteinander interagieren sollen, muss mindestens einer eine Maske haben, die dem anderen entspricht.
zh_tw: 遮罩（Mask）控制的是該實體會監聽並偵測的層，會影響碰撞偵測。希望兩個實體能夠發生互動時，你需要讓其中至少一個的遮罩與另一個（的層）相對應。

source: If that's confusing, don't worry, we'll see three examples in a second.
de: Wenn das verwirrend ist, keine Sorge, wir werden gleich drei Beispiele sehen.
zh_tw: 可能有點繞，但請別擔心，我們馬上就會看到三個例子。

source: The important point is that you can use layers and masks to filter physics interactions, control performance, and remove the need for extra conditions in your code.
de: Wichtig ist, dass Sie Ebenen und Masken verwenden können, um Physik-Interaktionen zu filtern, die Performance zu steuern und um zusätzliche Bedingungen in Ihrem Code überflüssig zu machen.
zh_tw: 重要的知識點是，你能夠使用層和遮罩來篩選物理互動、控制性能、讓程式碼中不需要再做額外的條件偵測。

source: By default, all physics bodies and areas are set to both layer and mask ``1``. This means they all collide with each other.
de: Standardmäßig sind alle Physics-Bodies und Flächen sowohl auf die Ebene als auch auf die Maske ``1`` eingestellt. Das bedeutet, dass sie alle miteinander kollidieren.
zh_tw: 預設情況下，所有物理體和區域的層和遮罩都被設成了 ``1``。也就是說它們會互相碰撞。

source: Physics layers are represented by numbers, but we can give them names to keep track of what's what.
de: Physik-Ebenen werden durch Zahlen dargestellt, aber wir können ihnen Namen geben, um den Überblick darüber zu behalten, welche es sind.
zh_tw: 實體層由數字表示，但我們也可以為它們命名，記錄什麼是什麼。

source: Setting layer names
de: Ebenen-Namen festlegen
zh_tw: 設定 SCons

source: Let's give our physics layers a name. Go to *Project -> Project Settings*.
de: Geben wir unseren Physikebenen einen Namen. Gehen Sie zu *Projekt -> Projekteinstellungen*.
zh_tw: 讓我們來為實體層命名。打開*專案 -> 專案設定*。

source: In the left menu, navigate down to *Layer Names -> 3D Physics*. You can see a list of layers with a field next to each of them on the right. You can set their names there. Name the first three layers *player*, *enemies*, and *world*, respectively.
de: Navigieren Sie im linken Menü nach unten zu *Ebenen-Namen -> 3D-Physik*. Auf der rechten Seite sehen Sie eine Liste von Ebenen mit einem Feld neben jeder von ihnen. Dort können Sie ihre Namen festlegen. Nennen Sie die ersten drei Ebenen *player*, *enemies* und *world*.
zh_tw: 在左側的選單中，找到 *Layer Names -> 3D Physics*（層名稱 -> 3D 物理）。你可以在右側看到層的列表，每一層右側都有一個欄位，可以用來設定名稱。將前三層分別命名為“player”“enemies”“world”（玩家、敵人、世界）。

source: Now, we can assign them to our physics nodes.
de: Jetzt können wir sie unseren Physik-Nodes zuweisen.
zh_tw: 現在，我們就可以將它們分配給我們的物理節點了。

source: Assigning layers and masks
de: Ebenen und Masken zuweisen
zh_tw: 層和遮罩的分配

source: In the *Main* scene, select the ``Ground`` node. In the *Inspector*, expand the *Collision* section. There, you can see the node's layers and masks as a grid of buttons.
de: Wählen Sie in der *Main* Szene den ``Ground``-Node. Erweitern Sie im *Inspektor* den Abschnitt *Kollision*. Dort sehen Sie die Ebenen und Masken des Nodes als ein Raster von Buttons.
zh_tw: 在 *Main* 場景中選中 ``Ground`` 節點。在*屬性面板*中展開 *Collision*（碰撞）部分。你可以看到，該節點的層和遮罩在這裡以按鈕網格的形式排列。

source: The ground is part of the world, so we want it to be part of the third layer. Click the lit button to toggle **off** the first *Layer* and toggle **on** the third one. Then, toggle **off** the *Mask* by clicking on it.
de: Der Boden ist Teil der Welt, also soll er Teil der dritten Ebene sein. Klicken Sie auf den beleuchteten Button, um die erste *Ebene* **auszuschalten**, und schalten Sie die dritte Ebene **ein**. Schalten Sie dann die *Maske* aus, indem Sie sie anklicken.
zh_tw: 地面是世界的一部分，所以我們希望它屬於第三層。點擊 *Layer* 中的第一個點亮的按鈕將其**關閉**，**打開**第三層。然後點擊**關閉** *Mask*。

source: As mentioned before, the *Mask* property allows a node to listen to interaction with other physics objects, but we don't need it to have collisions. ``Ground`` doesn't need to listen to anything; it's just there to prevent creatures from falling.
de: Wie bereits erwähnt, erlaubt die Eigenschaft *Maske* einem Node, auf die Interaktion mit anderen Physik-Objekten zu hören, aber wir brauchen ihn nicht, um Kollisionen zu bekommen. ``Ground`` muss auf nichts hören; er ist nur dazu da, um zu verhindern, dass Kreaturen herunterfallen.
zh_tw: 上面說到過，*Mask* 屬性可以讓節點監聽與其他物理物件的互動，但它不是實作碰撞所必須的。``Ground`` 不需要監聽任何東西；它存在的意義是防止生物下落。

source: Note that you can click the "..." button on the right side of the properties to see a list of named checkboxes.
de: Beachten Sie, dass Sie auf den "..."-Button auf der rechten Seite der Eigenschaften klicken können, um eine Liste der benannten Kontrollkästchen anzuzeigen.
zh_tw: 請注意，點擊右側的“...”按鈕會將該屬性以帶名稱的核取方塊的形式展示。

source: Next up are the ``Player`` and the ``Mob``. Open ``player.tscn`` by double-clicking the file in the *FileSystem* dock.
de: Als nächstes sind der ``Player`` und der ``Mob`` dran. Öffnen Sie ``player.tscn`` durch einen Doppelklick auf die Datei im *Dateisystem*-Dock.
zh_tw: 接下來就是 ``Player`` 和 ``Mob``。在*檔案系統*面板中按兩下打開 ``player.tscn`` 檔案。

source: Select the *Player* node and set its *Collision -> Mask* to both "enemies" and "world". You can leave the default *Layer* property as it is, because the first layer is the "player" layer.
de: Wählen Sie den *Player*-Node aus und setzen Sie seine *Kollision -> Maske* sowohl auf "enemies" als auch auf "world". Sie können die Default-Eigenschaft *Ebene* so lassen, wie sie ist, da die erste Ebene die Ebene "player" ist.
zh_tw: 選中 *Player* 節點，將其 *Collision -> Mask* 設為“enemies”和“world”。*Layer* 屬性可以保持預設，因為第一個層就是“player”層。

source: Then, open the *Mob* scene by double-clicking on ``mob.tscn`` and select the ``Mob`` node.
de: Öffnen Sie dann die *Mob*-Szene durch Doppelklick auf ``mob.tscn`` und wählen Sie den ``Mob``-Node aus.
zh_tw: 然後按兩下 ``mob.tscn`` 打開 *Mob* 場景，選中 ``Mob`` 節點。

source: Set its *Collision -> Layer* to "enemies" and unset its *Collision -> Mask*, leaving the mask empty.
de: Setzen Sie *Collision -> Layer* auf "enemies" und entfernen sie alle Auswahlfelder in der *Collision -> Mask*. So dass die Masken leer bleiben.
zh_tw: 將其 *Collision -> Layer* 設為“enemies”，然後取消 *Collision -> Mask* 的設定，讓遮罩為空。

source: These settings mean the monsters will move through one another. If you want the monsters to collide with and slide against each other, turn **on** the "enemies" mask.
de: Diese Einstellungen bedeuten, dass die Monster einander durchdringen. Wenn Sie möchten, dass die Monster miteinander kollidieren und aneinander entlanggleiten, schalten Sie die Maske "enemies" ein.
zh_tw: 這些設定意味著怪物可以互相穿越。如果你希望怪物之間會發生碰撞和滑動，請**打開**“enemies”遮罩。

source: The mobs don't need to mask the "world" layer because they only move on the XZ plane. We don't apply any gravity to them by design.
de: Die Mobs brauchen die "world"-Ebene nicht zu maskieren, da sie sich nur auf der XZ-Ebene bewegen. Wir wenden keine Schwerkraft auf sie an.
zh_tw: 小怪並不需要遮罩“world”層，因為它們只會沿著 XZ 平面移動。我們是故意不去為它們新增重力影響的。

source: Jumping
de: Springen
zh_tw: 跳躍

source: The jumping mechanic itself requires only two lines of code. Open the *Player* script. We need a value to control the jump's strength and update ``_physics_process()`` to code the jump.
de: Die Sprungmechanik selbst erfordert nur zwei Codezeilen. Öffnen Sie das Skript *Player*. Wir brauchen einen Wert, um die Stärke des Sprungs zu kontrollieren, und aktualisieren ``_physics_process()``, um den Sprung zu erstellen.
zh_tw: 跳躍機制本身只需要兩行程式碼。打開 *Player* 腳本。我們需要一個值來控制跳躍的強度，並更新 ``_physics_process()`` 來對跳躍進行編碼。

source: After the line that defines ``fall_acceleration``, at the top of the script, add the ``jump_impulse``.
de: Fügen sie am Anfang des Skripts nach der Zeile, die ``fall_acceleration`` definiert, ``jump_impulse`` ein.
zh_tw: 在定義 ``fall_acceleration`` 這一行之後，在腳本的頂部，新增 ``jump_impulse``。

source: Inside ``_physics_process()``, add the following code before the ``move_and_slide()`` codeblock.
de: Innerhalb von ``_physics_process()`` fügen Sie den folgenden Code vor dem Codeblock ``move_and_slide()`` ein.
zh_tw: 在 ``_physics_process()`` 內，請在呼叫 ``move_and_slide()`` 那塊程式碼之前新增以下程式碼。

source: That's all you need to jump!
de: Das ist alles, was man zum Springen braucht!
zh_tw: 這就是跳躍所需的所有東西！

source: The ``is_on_floor()`` method is a tool from the ``CharacterBody3D`` class. It returns ``true`` if the body collided with the floor in this frame. That's why we apply gravity to the *Player*: so we collide with the floor instead of floating over it like the monsters.
de: Die Methode ``is_on_floor()`` ist eine Hilfsfunktion der Klasse ``CharacterBody3D``. Sie gibt ``true`` zurück, wenn der Body in diesem Frame mit dem Boden kollidiert ist. Das ist der Grund, warum wir die Schwerkraft auf den *Player* anwenden: damit wir mit dem Boden kollidieren, anstatt über ihm zu schweben wie die Monster.
zh_tw: ``is_on_floor()`` 方法是來自 ``CharacterBody3D`` 類的工具。如果物體在這一影格中與地板發生碰撞返回 ``true``。這就是為什麼我們要對 *Player* 施加重力的原因：這樣我們就會與地板相撞，而不是像怪物一樣漂浮在地板上。

source: If the character is on the floor and the player presses "jump", we instantly give them a lot of vertical speed. In games, you really want controls to be responsive and giving instant speed boosts like these, while unrealistic, feels great.
de: Wenn der Charakter auf dem Boden steht und der Spieler auf "springen" drückt, geben wir ihm sofort eine Menge vertikaler Geschwindigkeit. In Spielen muss die Steuerung wirklich reaktionsschnell sein, und solche sofortigen Geschwindigkeitsschübe sind zwar unrealistisch, fühlen sich aber toll an.
zh_tw: 如果角色在地板上並且玩家按下跳躍，立即給予角色較大的垂直速度，因為在遊戲中，玩家通常希望控制能得到回應，就像這樣提供的即時速度提升，雖然不切實際，但會令玩家感覺很好。

source: Notice that the Y axis is positive upwards. That's unlike 2D, where the Y axis is positive downwards.
de: Beachten Sie, dass die Y-Achse positiv nach oben verläuft. Das ist anders als in 2D, wo die Y-Achse positiv nach unten verläuft.
zh_tw: 請注意，Y 軸的正方向是朝上的。這與 2D 有所不同， 2D的Y 軸的正方向是朝下的。

source: Squashing monsters
de: Monster zerstampfen
zh_tw: 建立內容

source: Let's add the squash mechanic next. We're going to make the character bounce over monsters and kill them at the same time.
de: Fügen wir als Nächstes die Stampf-Mechanik hinzu. Wir werden den Charakter über Monster springen lassen und sie gleichzeitig töten.
zh_tw: 接下來讓我們來新增踩扁機制。我們會讓玩家在怪物身上彈起，並同時消滅它們。

source: We need to detect collisions with a monster and to differentiate them from collisions with the floor. To do so, we can use Godot's :ref:`group <doc_groups>` tagging feature.
de: Wir müssen Kollisionen mit einem Monster erkennen und sie von Kollisionen mit dem Boden unterscheiden. Dazu können wir Godots :ref:`group <doc_groups>`-Tagging-Feature verwenden.
zh_tw: 我們需要偵測與怪物的碰撞，並和與地板的碰撞相區分。要這麼做，我們可以使用 Godot 的:ref:`群組 <doc_groups>`標籤功能。

source: Open the scene ``mob.tscn`` again and select the *Mob* node. Go to the *Node* dock on the right to see a list of signals. The *Node* dock has two tabs: *Signals*, which you've already used, and *Groups*, which allows you to assign tags to nodes.
de: Öffnen Sie die Szene ``mob.tscn`` erneut und wählen Sie den *Mob*-Node. Gehen Sie zum *Node*-Dock auf der rechten Seite, um eine Liste der Signale zu sehen. Das *Node*-Dock hat zwei Tabs: *Signale*, die Sie bereits verwendet haben, und *Gruppen*, mit denen Sie den Nodes Tags zuweisen können.
zh_tw: 再次打開 ``mob.tscn`` 場景，選中 *Mob* 節點，就能在右側的*Node*面板中看到訊號的列表。*Node*面板有兩個分頁：你已經使用過的*Signals*，以及*Groups*它允許您為節點新增標籤。

source: Click on it to reveal a field where you can write a tag name. Enter "mob" in the field and click the *Add* button.
de: Klicken Sie darauf, um ein Feld zu öffnen, in das Sie einen Tag-Namen eingeben können. Geben Sie "mob" in das Feld ein und klicken Sie auf den *Hinzufügen*-Button.
zh_tw: 按一下這個分頁就會出現一個輸入框，可以填寫標籤的名稱。在這個輸入框中輸入“mob”（小怪）並按一下*新增*按鈕。

source: An icon appears in the *Scene* dock to indicate the node is part of at least one group.
de: Ein Icon erscheint im *Szenen*-Dock, um anzuzeigen, dass der Node Teil mindestens einer Gruppe ist.
zh_tw: *場景*面板中會出現一個圖示，表示該節點至少處在一個群組之中。

source: We can now use the group from the code to distinguish collisions with monsters from collisions with the floor.
de: Wir können nun die Gruppe aus dem Code heraus verwenden, um Kollisionen mit Monstern von Kollisionen mit dem Boden zu unterscheiden.
zh_tw: 我們現在就可以在程式碼中使用群組來區分與怪物的碰撞和與地板的碰撞了。

source: Coding the squash mechanic
de: Die Stampf-Mechanik programmieren
zh_tw: 編寫踩扁機制

source: Head back to the *Player* script to code the squash and bounce.
de: Gehen Sie zurück zum Skript *Player*, um den Stampf und den Sprung zu programmieren.
zh_tw: 回到 *Player* 腳本來編寫踩扁和彈跳。

source: At the top of the script, we need another property, ``bounce_impulse``. When squashing an enemy, we don't necessarily want the character to go as high up as when jumping.
de: Am Anfang des Skripts brauchen wir eine weitere Variable, ``bounce_impulse``. Wenn wir einen Gegner zerstampfen, wollen wir nicht unbedingt, dass der Charakter so hoch fliegt wie beim Springen.
zh_tw: 在腳本頂部，我們需要新增一個屬性 ``bounce_impulse``。踩扁敵人時，我們不必讓角色彈得比跳躍一樣高。

source: Then, after the **Jumping** codeblock we added above in ``_physics_process()``, add the following loop. With ``move_and_slide()``, Godot makes the body move sometimes multiple times in a row to smooth out the character's motion. So we have to loop over all collisions that may have happened.
de: Dann, nach dem **Springen** Codeblock, den wir oben in ``_physics_process()`` hinzugefügt haben, fügen Sie die folgende Schleife ein. Mit ``move_and_slide()`` bewegt Godot den Body manchmal mehrmals hintereinander, um die Bewegung des Charakters zu glätten. Wir müssen also eine Schleife über alle Kollisionen ausführen, die passiert sein könnten.
zh_tw: 在**Jumping**程式碼塊之後,我們在``_physics_process()`` 之中新增以下迴圈。使用 ``move_and_slide()``時，Godot 會讓實體連續進行多次移動，以平滑角色的運動。所以我們要迴圈走訪所有可能發生的碰撞。

source: In every iteration of the loop, we check if we landed on a mob. If so, we kill it and bounce.
de: In jeder Iteration der Schleife prüfen wir, ob wir auf einem Mob gelandet sind. Wenn ja, töten wir ihn und hüpfen weiter.
zh_tw: 在迴圈的每次反覆運算中，我們會檢查是否落在了小怪身上。如果是的話，我們就消滅它並進行彈跳。

source: With this code, if no collisions occurred on a given frame, the loop won't run.
de: Mit diesem Code wird die Schleife nicht durchlaufen, wenn in einem bestimmten Frame keine Kollisionen aufgetreten sind.
zh_tw: 如果某一影格沒有發生碰撞，那麼這段程式碼中的迴圈就不會執行。

source: That's a lot of new functions. Here's some more information about them.
de: Das sind eine Menge neuer Funktionen. Hier finden Sie weitere Informationen über sie.
zh_tw: 新函式很多。下面我們來進一步介紹一下。

source: The functions ``get_slide_collision_count()`` and ``get_slide_collision()`` both come from the :ref:`CharacterBody3D <class_CharacterBody3D>` class and are related to ``move_and_slide()``.
de: Die Funktionen ``get_slide_collision_count()`` und ``get_slide_collision()`` kommen beide von der Klasse :ref:`CharacterBody3D <class_CharacterBody3D>` und sind mit ``move_and_slide()`` verbunden.
zh_tw: 函式``get_slide_count()`` 和 ``get_slide_collision()`` 都來自於 :ref:`KinematicBody<class_KinematicBody>` 類，且都與 ``move_and_slide()`` 有關。

source: ``get_slide_collision()`` returns a :ref:`KinematicCollision3D<class_KinematicCollision3D>` object that holds information about where and how the collision occurred. For example, we use its ``get_collider`` property to check if we collided with a "mob" by calling ``is_in_group()`` on it: ``collision.get_collider().is_in_group("mob")``.
de: ``get_slide_collision()`` gibt ein :ref:`KinematicCollision3D<class_KinematicCollision3D>` Objekt zurück, das Informationen darüber enthält, wo und wie die Kollision stattfand. Zum Beispiel benutzen wir die Eigenschaft ``get_collider``, um zu überprüfen, ob wir mit einem "Mob" kollidiert sind, indem wir ``is_in_group()`` auf ihn anwenden: ``collision.get_collider().is_in_group("mob")``.
zh_tw: ``get_slide_collision()`` 返回的是 :ref:`KinematicCollision3D<class_KinematicCollision3D>` 物件，包含碰撞在哪裡發生、如何發生等資訊。例如，我們對它的 ``get_collider`` 屬性呼叫 ``is_in_group()`` 來檢查我們是否是和“mob”發生了碰撞：``collision.collider.is_in_group("mob")``。

source: The method ``is_in_group()`` is available on every :ref:`Node<class_Node>`.
de: Die Methode ``is_in_group()`` ist auf jedem :ref:`Node<class_Node>` verfügbar.
zh_tw: 每一個 :ref:`Node<class_Node>` 都可以使用 ``is_in_group()`` 方法。

source: To check that we are landing on the monster, we use the vector dot product: ``Vector3.UP.dot(collision.get_normal()) > 0.1``. The collision normal is a 3D vector that is perpendicular to the plane where the collision occurred. The dot product allows us to compare it to the up direction.
de: Um zu überprüfen, ob wir auf dem Monster landen, verwenden wir das Vektor-Skalarprodukt: ``Vector3.UP.dot(collision.get_normal()) > 0.1``. Die Kollisionsnormale ist ein 3D-Vektor, der senkrecht zu der Ebene steht, in der die Kollision stattgefunden hat. Mit Hilfe des Skalarprodukts können wir ihn mit der Aufwärtsrichtung vergleichen.
zh_tw: 我們使用向量點積 ``Vector3.UP.dot(collision.get_normal()) > 0.1`` 來檢查我們是不是降落在怪物身上。碰撞法線（normal）是垂直於碰撞平面的 3D 向量。可以通過點積與上方向進行比較。

source: With dot products, when the result is greater than ``0``, the two vectors are at an angle of fewer than 90 degrees. A value higher than ``0.1`` tells us that we are roughly above the monster.
de: Wenn das Ergebnis des Skalarprodukts größer ist als ``0``, befinden sich die beiden Vektoren in einem Winkel von weniger als 90 Grad. Ein Wert, der größer als ``0.1`` ist, bedeutet, dass wir uns ungefähr über dem Monster befinden.
zh_tw: 點積結果大於 ``0`` 時，兩個向量的夾角小於 90 度。大於 ``0.1`` 表示我們大概位於怪物上方。

source: After handling the squash and bounce logic, we terminate the loop early via the ``break`` statement to prevent further duplicate calls to ``mob.squash()``, which may otherwise result in unintended bugs such as counting the score multiple times for one kill.
de: Nachdem wir die Squash- und Bounce-Logik abgearbeitet haben, beenden wir die Schleife vorzeitig mit der ``break``-Anweisung, um weitere doppelte Aufrufe von ``mob.squash()`` zu verhindern, die sonst zu unbeabsichtigten Fehlern führen könnten, wie z.B. das mehrfache Zählen der Punkte für einen Kill.

source: We are calling one undefined function, ``mob.squash()``, so we have to add it to the Mob class.
de: Wir rufen eine undefinierte Funktion, ``mob.squash()``, auf, also müssen wir sie der Mob-Klasse hinzufügen.
zh_tw: 我們呼叫了一個尚未定義的函式 ``mob.squash()``。所以我們需要把它加入到 Mob 類中。

source: Open the script ``Mob.gd`` by double-clicking on it in the *FileSystem* dock. At the top of the script, we want to define a new signal named ``squashed``. And at the bottom, you can add the squash function, where we emit the signal and destroy the mob.
de: Öffnen Sie das Skript ``Mob.gd`` durch Doppelklick im *Dateisystem*-Dock. Am Anfang des Skripts wollen wir ein neues Signal namens ``squashed`` definieren. Unten können Sie die Squash-Funktion hinzufügen, mit der wir das Signal aussenden und den Mob zerstören.
zh_tw: 在*檔案系統*面板中按兩下打開 ``Mob.gd`` 腳本。在腳本頂部，我們要定義一個新的訊號叫作 ``squashed``（被踩扁）。你可以在底部新增 squash 函式，在裡面發出這個訊號並銷毀這個小怪。

source: When using C#, Godot will create the appropriate events automatically for all Signals ending with `EventHandler`, see :ref:`C# Signals <doc_c_sharp_signals>`.
de: Wenn Sie C# verwenden, erstellt Godot automatisch die entsprechenden Ereignisse für alle Signale, die auf `EventHandler` enden, siehe :ref:`C#-Signale <doc_c_sharp_signals>`.

source: We will use the signal to add points to the score in the next lesson.
de: In der nächsten Lektion werden wir das Signal verwenden, um Punkte zum Punktestand zu addieren.
zh_tw: 下一節課中，我們會使用這個訊號來加分數。

source: With that, you should be able to kill monsters by jumping on them. You can press :kbd:`F5` to try the game and set ``main.tscn`` as your project's main scene.
de: Damit sollten Sie in der Lage sein, Monster zu töten, indem Sie auf sie springen. Sie können :kbd:`F5` drücken, um das Spiel auszuprobieren und ``main.tscn`` als Hauptszene für Ihr Projekt festzulegen.
zh_tw: 好了，你應該可以跳在怪物身上把它們消滅了。你可以按 :kbd:`F5` 試玩遊戲，並把 ``main.tscn`` 設成專案的主場景。

source: However, the player won't die yet. We'll work on that in the next part.
de: Allerdings wird der Spieler noch nicht sterben. Daran werden wir im nächsten Teil arbeiten.
zh_tw: 不過玩家現在還不會死。我們會在下一部分實作。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
