Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/07.killing_player.po
Languages: de, zh_tw

source: Killing the player
de: Den Spieler töten
zh_tw: 殺死玩家

source: We can kill enemies by jumping on them, but the player still can't die. Let's fix this.
de: Wir können Gegner töten, indem wir auf sie springen, aber der Spieler kann trotzdem nicht sterben. Lassen Sie uns das beheben.
zh_tw: 我們可以通過跳到敵人身上來殺死他們，但玩家仍然不能死亡。讓我們來解決這個問題。

source: We want to detect being hit by an enemy differently from squashing them. We want the player to die when they're moving on the floor, but not if they're in the air. We could use vector math to distinguish the two kinds of collisions. Instead, though, we will use an :ref:`Area3D <class_Area3D>` node, which works well for hitboxes.
de: Wir wollen, dass ein Treffer von einem Gegner anders erkannt wird, als wenn er zerstampft wird. Wir wollen, dass der Spieler stirbt, wenn er sich auf dem Boden bewegt, aber nicht, wenn er in der Luft ist. Wir könnten Vektormathematik verwenden, um die beiden Arten von Kollisionen zu unterscheiden. Stattdessen werden wir jedoch einen :ref:`Area3D <class_Area3D>`-Node verwenden, der gut für Hitboxen funktioniert.
zh_tw: 我們希望偵測到被敵人擊中與壓扁敵人時的不同。我們希望玩家在地板上移動時死亡，但如果他們在空中，則不會死亡。我們可以使用向量數學來區分這兩種碰撞。但是，我們將使用 :ref:`Area3D <class_Area3D>` 節點，該節點適用於命中框。

source: Hitbox with the Area node
de: Hitbox mit dem Area-Node
zh_tw: 使用 Area 節點製作攻擊框

source: Head back to the ``player.tscn`` scene and add a new child node :ref:`Area3D <class_Area3D>`. Name it ``MobDetector`` Add a :ref:`CollisionShape3D <class_CollisionShape3D>` node as a child of it.
de: Gehen Sie zurück zur Szene ``player.tscn`` und fügen Sie einen neuen Child-Node :ref:`Area3D <class_Area3D>` hinzu. Nennen Sie ihn ``MobDetector``. Fügen Sie einen :ref:`CollisionShape3D <class_CollisionShape3D>`-Node als Child davon hinzu.
zh_tw: 回到 ``player.tscn`` 場景，新增一個新的 :ref:`Area3D <class_Area3D>`子節點。把它命名為 ``MobDetector``（小怪偵測器）。新增一個 :ref:`CollisionShape3D <class_CollisionShape3D>` 節點作為它的一個子節點。

source: In the *Inspector*, assign a cylinder shape to it.
de: Weisen Sie ihm im *Inspektor* eine Cylinder-Shape zu.
zh_tw: 在*屬性面板*中，給它指定一個圓柱體形狀。

source: Here is a trick you can use to make the collisions only happen when the player is on the ground or close to it. You can reduce the cylinder's height and move it up to the top of the character. This way, when the player jumps, the shape will be too high up for the enemies to collide with it.
de: Es gibt einen Trick, mit dem die Kollisionen nur dann stattfinden, wenn sich der Spieler auf dem Boden oder in Bodennähe befindet. Sie können die Höhe des Zylinders verringern und ihn bis zum oberen Rand des Charakters verschieben. Wenn der Spieler dann springt, ist die Shape zu hoch, als dass die Gegner mit ihr kollidieren könnten.
zh_tw: 這裡有一個技巧，你可以用它來使碰撞只發生在玩家在地面上或靠近地面時。您可以降低圓柱體的高度並將其向上移動到角色的頂部。這樣，當玩家跳躍時，形狀會太高，敵人無法與之碰撞。

source: You also want the cylinder to be wider than the sphere. This way, the player gets hit before colliding and being pushed on top of the monster's collision box.
de: Außerdem soll der Zylinder breiter sein als die Kugel. Auf diese Weise wird der Spieler getroffen, bevor er kollidiert und auf das Kollisionsfeld des Monsters geschoben wird.
zh_tw: 你還希望圓柱體比球體更寬。這樣一來，玩家在碰撞之前就會被擊中，並被推到怪物的碰撞盒之上。

source: The wider the cylinder, the more easily the player will get killed.
de: Je breiter der Zylinder, desto eher wird der Spieler getötet.
zh_tw: 圓柱體越寬，玩家就越容易被殺死。

source: Next, select the ``MobDetector`` node again, and in the *Inspector*, turn **off** its *Monitorable* property. This makes it so other physics nodes cannot detect the area. The complementary *Monitoring* property allows it to detect collisions. Then, remove the *Collision -> Layer* and set the mask to the "enemies" layer.
de: Als nächstes wählen Sie erneut den ``MobDetector``-Node aus und schalten im *Inspektor* die Eigenschaft *Überwachbar* aus. Dadurch können andere Physik-Nodes den Bereich nicht erkennen. Die ergänzende Eigenschaft *Wird überwacht* ermöglicht es ihm, Kollisionen zu erkennen. Entfernen Sie dann die Eigenschaft *Kollision -> Ebene* und setzen Sie die Maske auf die Ebene "enemies".
zh_tw: 接下來，再次選擇 ``MobDetector`` 節點，並在*屬性面板*中， **關閉** 其 *Monitorable* 屬性。這使得其他物理節點無法偵測到這個區域。補充的 *Monitoring* 屬性允許它偵測碰撞。然後，清除 *Collision -> Layer*，並將遮罩設定為“enemies”層。

source: When areas detect a collision, they emit signals. We're going to connect one to the ``Player`` node. Select ``MobDetector`` and go to *Inspector*'s *Node* tab, double-click the ``body_entered`` signal and connect it to the ``Player``
de: Wenn Areas eine Kollision erkennen, senden sie Signale aus. Wir werden eines mit dem ``Player``-Node verbinden. Wählen Sie ``MobDetector`` und gehen Sie zum *Node*-Tab des *Inspektors* Tab, doppelklicken Sie das ``body_entered`` Signal und verbinden Sie es mit dem ``Player``
zh_tw: 當區域偵測到碰撞時，它們會發出訊號。我們要將一個訊號連接到 *Player* 節點。在*節點*分頁中，按兩下 ``body_entered`` 訊號並將其連接到 *Player*\\\\

source: The *MobDetector* will emit ``body_entered`` when a :ref:`CharacterBody3D <class_CharacterBody3D>` or a :ref:`RigidBody3D <class_RigidBody3D>` node enters it. As it only masks the "enemies" physics layers, it will only detect the ``Mob`` nodes.
de: Der *MobDetector* sendet ``body_entered`` aus, wenn ein :ref:`CharacterBody3D <class_CharacterBody3D>` oder ein :ref:`RigidBody3D <class_RigidBody3D>`-Node ihn betritt. Da es nur die "enemies"-Physikebenen maskiert, wird es nur die ``Mob``-Nodes erkennen.
zh_tw: 當一個 :ref:`CharacterBody3D <class_CharacterBody3D>` 或 :ref:`RigidBody3D <class_RigidBody3D>` 節點進入它時，*MobDetector* 將發出 ``body_entered`` 訊號。由於它只遮罩了“enemies”實體層，它將只偵測 *Mob* 節點。

source: Code-wise, we're going to do two things: emit a signal we'll later use to end the game and destroy the player. We can wrap these operations in a ``die()`` function that helps us put a descriptive label on the code.
de: Auf Code-Ebene werden wir zwei Dinge tun: Ein Signal aussenden, welches wir später verwenden werden, um das Spiel zu beenden und den Spieler zu zerstören. Wir können diese Vorgänge in eine ``die()`` Funktion verpacken um dem Code eine aussagekräftige Beschriftung zu geben.
zh_tw: 從程式碼上看，我們要做兩件事：發出一個訊號，我們以後會用來結束遊戲，並銷毀玩家。我們可以用 ``die()`` 函式來包裝這些操作，幫助我們給程式碼貼上描述性標籤。

source: Try the game again by pressing :kbd:`F5`. If everything is set up correctly, the character should die when an enemy runs into the collider. Note that without a ``Player``, the following line
de: Versuchen Sie, das Spiel erneut zu starten, indem Sie :kbd:`F5` drücken. Wenn alles richtig eingestellt ist, sollte der Charakter sterben, wenn ein Gegner in den Collider läuft. Beachten Sie, dass ohne einen ``Player`` die folgende Zeile
zh_tw: 按 :kbd:`F5` 再試一下遊戲。如果一切設定正確，角色在被敵人碰到時應該會死亡

source: gives error because there is no $Player!
de: einen Fehler liefert, weil es keinen $Player gibt!
zh_tw: 由於此處沒有 $Player 導致的報告有錯！

source: Also note that the enemy colliding with the player and dying depends on the size and position of the ``Player`` and the ``Mob``\ 's collision shapes. You may need to move them and resize them to achieve a tight game feel.
de: Beachten Sie auch, dass der Gegner, der mit dem Player kollidiert und stirbt, von der Größe und Position der Kollisions-Shapes des ``Player`` und des ``Mob`` abhängt. Es kann sein, daß Sie sie verschieben und in der Größe verändern müssen, um ein gutes Spielgefühl zu erreichen.
zh_tw: 另外請注意，敵人與玩家碰撞並死亡取決於 ''Player'' 和 ''Mob'' 的碰撞形狀的大小和位置。你可能需要移動它們，調整它們的大小，以達到緊湊的遊戲感覺。

source: Ending the game
de: Das Spiel beenden
zh_tw: 執行遊戲

source: We can use the ``Player``\ 's ``hit`` signal to end the game. All we need to do is connect it to the ``Main`` node and stop the ``MobTimer`` in reaction.
de: Wir können das Signal ``Hit`` von ``Player`` benutzen, um das Spiel zu beenden. Alles, was wir tun müssen, ist, es mit dem ``Main``-Node zu verbinden und den ``MobTimer`` als Folge zu stoppen.
zh_tw: 我們可以利用 ''Player'' 的 ''hit'' 信號來結束遊戲。我們所要做的就是將它連接到 ''Main'' 節點上，在處理時停止 ''MobTimer''\ 。

source: Open ``main.tscn``, select the ``Player`` node, and in the *Node* dock, connect its ``hit`` signal to the ``Main`` node.
de: Öffnen Sie die Datei ``main.tscn``, markieren Sie den ``Player``-Node, und verbinden Sie im *Node*-Dock sein ``hit``-Signal mit dem ``Main``-Node.
zh_tw: 打開 ``main.tscn`` 場景，選中 ``Player`` 節點，然後在*節點*面板中把 ``hit`` 訊號連接到 ``Main`` 節點。

source: Get the timer, and stop it, in the ``_on_player_hit()`` function.
de: Holen Sie sich den Timer und stoppen Sie ihn mit der Funktion ``_on_player_hit()``.
zh_tw: 在 ``_on_player_hit()`` 函式中獲取並停止計時器。

source: If you try the game now, the monsters will stop spawning when you die, and the remaining ones will leave the screen.
de: Wenn Sie das Spiel jetzt testen, hören die Monster auf zu spawnen, sobald Sie sterben und die verbleibenden Monster werden den Bildschirmbereich verlassen.
zh_tw: 如果你現在試玩遊戲，你死亡後就會停止刷怪，現有的怪物會離開螢幕。

source: You can pat yourself in the back: you prototyped a complete 3D game, even if it's still a bit rough.
de: Sie können sich selbst auf die Schulter klopfen: Sie haben einen vollständigen Prototypen für ein 3D Spiel erstellt, auch wenn er noch etwas unfertig ist.
zh_tw: 你可以鼓勵鼓勵自己了：你做出了完整 3D 遊戲的原型，雖說還有點粗糙。

source: From there, we'll add a score, the option to retry the game, and you'll see how you can make the game feel much more alive with minimalistic animations.
de: Als nächstes fügen wir einen Punkestand und die Option, das Spiel zu wiederholen hinzu, und Sie werden sehen, wie Sie mit ein paar einfachen Animationen das Spiel lebendiger gestalten können.
zh_tw: 在此基礎上，我們將會新增計分、重啟遊戲的選項，你還會看到如何使用簡單的動畫讓遊戲變得更加活靈活現。

source: Code checkpoint
zh_tw: 設定／移除中斷點

source: Here are the complete scripts for the ``Main``, ``Mob``, and ``Player`` nodes, for reference. You can use them to compare and check your code.
de: Hier sind die kompletten Skripte für die ``Main``-, ``Mob``- und ``Player``-Nodes, als Referenz. Sie können sie verwenden, um Ihren Code zu vergleichen und zu überprüfen.
zh_tw: 這些是 ``Main``、``Mob``、``Player`` 節點的完整腳本，僅供參考。你可以把它們和你的程式碼進行對比檢查。

source: Starting with ``main.gd``.
de: Wir beginnen mit ``main.gd``.
zh_tw: 首先是 ``main.gd``。

source: Next is ``Mob.gd``.
de: Als nächstes ``Mob.gd``.
zh_tw: 然後是 ``Mob.gd``。

source: Finally, the longest script, ``Player.gd``:
de: Schließlich das längste Skript, ``Player.gd``:
zh_tw: 最後是最長的腳本 ``Player.gd``：

source: See you in the next lesson to add the score and the retry option.
de: Wir sehen uns in der nächsten Lektion, um den Punktestand und die Option das Spiel zu wiederholen, hinzuzufügen.
zh_tw: 在下一節課中我們會新增計分和重試選項，再見。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
