Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/08.score_and_replay.po
Languages: de, es, zh_tw

source: Score and replay
de: Punktestand und Neustart
es: Puntaje y repetición
zh_tw: 分數與重玩

source: In this part, we'll add the score, music playback, and the ability to restart the game.
de: In diesem Teil werden wir einen Punktestand, Hintergrundmusik und die Möglichkeit, das Spiel neu zu starten, hinzufügen.
es: En esta parte, agregaremos la puntuación, la reproducción de música y la capacidad de reiniciar el juego.
zh_tw: 在這一部分中，我們會新增計分、播放音樂、重啟遊戲的能力。

source: We have to keep track of the current score in a variable and display it on screen using a minimal interface. We will use a text label to do that.
de: Wir müssen den aktuellen Punktestand in einer Variablen speichern und ihn mit einer minimalen Benutzeroberfläche auf dem Bilschirm anzeigen. Wir werden ein Text-Label dafür benutzen.
es: Tenemos que llevar un registro de la puntuación actual en una variable y mostrarla en pantalla utilizando una interfaz mínima. Utilizaremos una etiqueta de texto para hacerlo.
zh_tw: 我們要用一個變數來記錄目前的分數，使用最簡的介面在螢幕上顯示。我們會用文字標籤來實作。

source: In the main scene, add a new child node :ref:`Control <class_Control>` to ``Main`` and name it ``UserInterface``. You will automatically be taken to the 2D screen, where you can edit your User Interface (UI).
de: Fügen Sie in der Main-Szene einen neuen Child-Node :ref:`Control <class_Control>` zu ``Main`` hinzu und nennen Sie ihn ``UserInterface``. Sie werden automatisch zum 2D-Bildschirm weitergeleitet, wo Sie Ihre Benutzeroberfläche (User Interface oder UI) bearbeiten können.
es: En la escena principal, agrega un nuevo nodo :ref:`Control <class_Control>` como hijo de ``Main`` y nómbralo ``UserInterface``. Serás llevado automáticamente a la pantalla 2D, donde podrás editar tu Interfaz de Usuario (UI).
zh_tw: 在主場景中，新增一個新的 :ref:`Control <class_Control>` 節點作為 ``Main`` 的子項，命名為 ``UserInterface``。你會被自動切換到 2D 螢幕，可以在這裡編輯你的使用者介面 User Interface（UI）。

source: Add a :ref:`Label <class_Label>` node and name it ``ScoreLabel``
de: Fügen Sie einen :ref:`Label <class_Label>`-Node hinzu und nenne ihn ``ScoreLabel``
es: Agrega un nodo :ref:`Label <class_Label>` y nómbralo ``ScoreLabel``
zh_tw: :ref:`Label <class_Label>` ，命名為 ``ScoreLabel`` 。

source: In the *Inspector*, set the *Label*'s *Text* to a placeholder like "Score: 0".
de: Legen Sie im *Inspektor* den Text des *Label*\s auf einen Platzhalter fest, wie "Score: 0".
es: En el *Inspector*, establece el *Texto* del *Label* como un marcador de posición como "Puntuación: 0".
zh_tw: 在*屬性面板*中將該 *Label* 的 *Text* 設為類似“Score: 0”的占位元內容。

source: Also, the text is white by default, like our game's background. We need to change its color to see it at runtime.
de: Außerdem ist der Text standardmäßig weiß, so wie der Hintergrund unseres Spiels. Wir müssen seine Farbe ändern, um ihn im Spiel sehen zu können.
es: Además, el texto es blanco por defecto, al igual que el fondo de nuestro juego. Necesitamos cambiar su color para poder verlo durante la ejecución.
zh_tw: 並且，文字預設是白色的，和我們的遊戲背景一樣。我們需要修改它的顏色，才能在運作時看到。

source: Scroll down to *Theme Overrides*, and expand *Colors* and enable *Font Color* in order to tint the text to black (which contrasts well with the white 3D scene)
de: Scrollen Sie nach unten zu *Theme-Überschreibungen*, erweitern Sie *Colors* und aktivieren Sie *Font Color*, um den Text schwarz zu färben (was gut mit der weißen 3D-Szene kontrastiert)
es: Desplázate hacia abajo hasta *Theme Overrides*, expande *Colors* y activa *Font Color* para cambiar el tinte del texto a negro (el cual contrasta bien con la escena 3D blanca)
zh_tw: 向下滾動到 *Theme Overrides*（主題覆蓋）然後展開 *Colors*（顏色）並點擊 *Font Color*（字形顏色）旁邊的黑框來為文字著色

source: Finally, click and drag on the text in the viewport to move it away from the top-left corner.
de: Klicken Sie schließlich auf den Text im Viewport und ziehen Sie ihn, um ihn von der linken oberen Ecke zu entfernen.
es: Finalmente, haz clic y arrastra el texto en el viewport para moverlo lejos de la esquina superior izquierda.
zh_tw: 最後按一下視口中的文字，將其拖離左上角。

source: The ``UserInterface`` node allows us to group our UI in a branch of the scene tree and use a theme resource that will propagate to all its children. We'll use it to set our game's font.
de: Der ``UserInterface``-Node erlaubt es uns, unsere Benutzeroberfläche in einem Zweig des Szenenbaums zu gruppieren und eine Theme-Ressource zu verwenden, die sich auf alle seine Child-Elemente überträgt. Wir werden ihn benutzen, um die Schriftart unseres Spiels festzulegen.
es: El nodo ``UserInterface`` nos permite agrupar nuestra UI en una rama del árbol de escenas y utilizar un recurso de tema que se propagará a todos sus hijos. Lo utilizaremos para establecer la fuente de nuestro juego.
zh_tw: ``UserInterface`` 節點讓我們可以將 UI 組合到場景樹的一個分支上，並且也讓主題資源能夠傳播到它的所有子節點上。我們將會用它來設定遊戲的字形。

source: Creating a UI theme
de: Ein UI-Theme erstellen
es: Creando un tema de interfaz de usuario
zh_tw: 建立內容

source: Once again, select the ``UserInterface`` node. In the *Inspector*, create a new theme resource in *Theme -> Theme*.
de: Wählen Sie erneut den ``UserInterface``-Node. Im *Inspektor* erstellen Sie eine neue Theme-Ressource unter *Theme -> Theme*.
es: Una vez más, selecciona el nodo ``UserInterface``. En el *Inspector*, crea un nuevo recurso de tema en *Theme -> Theme*.
zh_tw: 再次選中 ``UserInterface`` 節點。在*屬性面板*中為 *Theme -> Theme* 建立一個新的主題資源。

source: Click on it to open the theme editor In the bottom panel. It gives you a preview of how all the built-in UI widgets will look with your theme resource.
de: Klicken Sie auf die neu erstellte Ressource, um den Theme-Editor im Unteren Bedienfeld zu öffnen. Er gibt Ihnen eine Vorschau, wie alle Built-in-UI-Widgets mit Ihrer Theme-Ressource aussehen werden.
es: Haz clic en él para abrir el editor de temas en el panel inferior. Te brinda una vista previa de cómo se verán todos los widgets de la UI incorporados con tu recurso de tema.
zh_tw: 按一下這個資源就會在底部面板中打開主題編輯器。會展示使用你的主題資源時內建 UI 控制項的外觀。

source: By default, a theme only has one property, the *Default Font*.
de: Standardmäßig hat ein Theme nur eine Eigenschaft, die *Default-Schriftart*.
es: Por defecto, un tema solo tiene una propiedad, la *Default Font*.
zh_tw: 預設情況下，主題只有一個屬性，*Default Font*（預設字形）。

source: You can add more properties to the theme resource to design complex user interfaces, but that is beyond the scope of this series. To learn more about creating and editing themes, see :ref:`doc_gui_skinning`.
de: Sie können in der Theme-Ressource mehr Eigenschaften hinzufügen, um komplexe Benutzeroberflächen zu gestalten, aber das würde den Rahmen dieser Artikelreihe sprengen. Um mehr über das Erstellen und Bearbeiten von Themes zu erfahren, siehe :ref:`doc_gui_skinning`.
es: Puedes agregar más propiedades al recurso de tema para diseñar interfaces de usuario más complejas, pero eso está fuera del alcance de esta serie. Para obtener más información sobre cómo crear y editar temas, consulta :ref:`doc_gui_skinning`.
zh_tw: 你可以為主題資源新增更多屬性，從而設計更複雜的使用者介面，不過這就超出本系列的範疇了。要學習主題的建立和編輯，請參閱 :ref:`doc_gui_skinning`。

source: This one expects a font file like the ones you have on your computer. Two common font file formats are TrueType Font (TTF) and OpenType Font (OTF).
de: Diese erwartet eine Schriftartdatei, wie solche, die Sie auf Ihrem Computer haben. Zwei gängige Schriftdateiformate sind TrueType Font (TTF) und OpenType Font (OTF).
es: Este campo espera un archivo de fuente como los que tienes en tu computadora. Los archivos de fuente comunes son TrueType Font (TTF) y OpenType Font (OTF).
zh_tw: 這裡需要的是一個字形檔，就是你電腦上用的那種。常見的字形檔案格式有兩種：TrueType 字形（TTF）和 OpenType 字形（OTF）。

source: In the *FileSystem* dock, expand the ``fonts`` directory and click and drag the ``Montserrat-Medium.ttf`` file we included in the project onto the *Default Font*. The text will reappear in the theme preview.
de: Erweitern Sie im *Dateisystem*-Dock das ``fonts``-Verzeichnis und ziehen Sie die Datei ``Montserrat-Medium.ttf``, die wir in das Projekt aufgenommen haben, auf die *Default-Schriftart*. Der Text wird in der Vorschau des Themes wieder erscheinen.
es: En el panel *Sistema de Archivos*, expande el directorio ``fonts`` y arrastra el archivo ``Montserrat-Medium.ttf`` que incluimos en el proyecto hacia *Default Font*. El texto volverá a aparecer en la vista previa del tema.
zh_tw: 在*檔案系統*面板中，展開 ``fonts`` 目錄，按一下我們包含在專案裡的 ``Montserrat-Medium.ttf`` 檔案並將其拖放到*Default Font*（預設字形）上。文字就又會出現在主題預覽中了。

source: The text is a bit small. Set the *Default Font Size* to ``22`` pixels to increase the text's size.
de: Der Text ist ein wenig klein. Setzen Sie die *Default-Schriftgröße* auf ``22`` Pixel, um den Text zu vergrößern.
es: El texto es un poco pequeño. Cambia el *Default Font Size* a ``22`` pixeles para incrementar el tamaño del texto.
zh_tw: 文字有一點小。將*Default Font Size*（預設字形大小）設定為 ``22`` 像素即可增大文字的大小。

source: Keeping track of the score
de: Den Spielstand im Auge behalten
es: Manteniendo el rastro del puntaje
zh_tw: 追蹤得分

source: Let's work on the score next. Attach a new script to the ``ScoreLabel`` and define the ``score`` variable.
de: Lassen Sie uns als nächstes mit dem Punktestand arbeiten. Hängen Sie ein neues Skript an das ``ScoreLabel`` und definieren Sie die Variable ``score``.
es: A continuación, trabajemos en la puntuación. Adjunta un nuevo script a ``ScoreLabel`` y define la variable ``score``.
zh_tw: 我們下一步是進行計分。為 ``ScoreLabel`` 附加一個新的腳本，並在其中定義 ``score``（分數）變數。

source: The score should increase by ``1`` every time we squash a monster. We can use their ``squashed`` signal to know when that happens. However, because we instantiate monsters from the code, we cannot connect the mob signal to the ``ScoreLabel`` via the editor.
de: Die Punktzahl sollte sich jedes Mal um ``1`` erhöhen, wenn wir ein Monster zerstampfen. Wir können das Signal ``squashed`` benutzen, um mitzubekommen, wann das passiert. Da wir jedoch Monster im Code instanziieren, können wir das Mob-Signal nicht über den Editor mit dem ``ScoreLabel`` verbinden.
es: La puntuación debería aumentar en ``1`` cada vez que aplastemos a un monstruo. Podemos utilizar su señal ``squashed`` para saber cuándo ocurre eso. Sin embargo, como instanciamos los monstruos desde el código, no podemos hacer la conexión a ``ScoreLabel`` en el editor.
zh_tw: 每踩扁一隻怪物，這個分數就應該加 ``1``。我們可以使用它們的 ``squashed`` 訊號來得知發生的時間。不過，因為我們是用程式碼產生實體的怪物，我們無法在編輯器中將怪物的訊號連接到 ``ScoreLabel``。

source: Instead, we have to make the connection from the code every time we spawn a monster.
de: Stattdessen müssen wir jedes Mal, wenn ein Monster gespawnt wird, eine neue Verbindung über Code erstellen.
es: En cambio, tenemos que hacer la conexión desde el código cada vez que generamos un monstruo.
zh_tw: 不過，我們可以在每次生成一隻怪物時通過程式碼來進行連接。

source: Open the script ``main.gd``. If it's still open, you can click on its name in the script editor's left column.
de: Öffnen Sie das Skript ``main.gd``. Wenn es noch geöffnet ist, können Sie auf seinen Namen in der linken Spalte des Skripteditors klicken.
es: Abre el script ``main.gd``. Si aún está abierto, puedes hacer clic en su nombre en la columna izquierda del editor de scripts.
zh_tw: 打開 ``main.gd`` 腳本。如果它還開著，你可以在腳本編輯器左欄中點擊它的名字。

source: Alternatively, you can double-click the ``main.gd`` file in the *FileSystem* dock.
de: Alternativ können Sie auf die Datei ``main.gd`` im *Dateisystem*-Dock doppelklicken.
es: Alternativamente, puedes hacer doble clic en el archivo ``main.gd`` en el panel *Sistema de Archivos*.
zh_tw: 另一種方法是在*檔案系統*面板中按兩下 ``main.gd`` 檔案。

source: At the bottom of the ``_on_mob_timer_timeout()`` function, add the following line:
de: Fügen Sie am Ende der Funktion ``_on_mob_timer_timeout()`` die folgende Zeile hinzu:
es: En la parte inferior de la función ``_on_mob_timer_timeout()``, agrega la siguiente línea:
zh_tw: 在 ``_on_mob_timer_timeout()`` 函式的最後新增下面這行程式碼:

source: This line means that when the mob emits the ``squashed`` signal, the ``ScoreLabel`` node will receive it and call the function ``_on_mob_squashed()``.
de: Diese Zeile bedeutet, dass wenn der Mob das ``squashed``-Signal sendet, der ``ScoreLabel``-Node es empfängt und die Funktion ``_on_mob_squashed()`` aufruft.
es: Esta línea significa que cuando el enemigo emite la señal ``squashed``, el nodo ``ScoreLabel`` la recibirá y llamará a la función ``_on_mob_squashed()``.
zh_tw: 這一行的意思是，當小怪發出 ``squashed`` 訊號時，``ScoreLabel`` 節點就會接收到並呼叫 ``_on_mob_squashed()`` 函式。

source: Head back to the ``ScoreLabel.gd`` script to define the ``_on_mob_squashed()`` callback function.
de: Gehen Sie zurück zum Skript ``ScoreLabel.gd``, um die Callback-Funktion ``_on_mob_squashed()`` zu definieren.
es: Regresa al script ``ScoreLabel.gd`` para definir la función de callback ``_on_mob_squashed()``.
zh_tw: 回到 ``ScoreLabel.gd`` 腳本，定義回呼函式 ``_on_mob_squashed()``。

source: There, we increment the score and update the displayed text.
de: Dort wird die Punktzahl erhöht und der angezeigte Text aktualisiert.
es: Allí, incrementamos la puntuación y actualizamos el texto mostrado.
zh_tw: 這裡我們將進行加分並更新顯示的文字。

source: The second line uses the value of the ``score`` variable to replace the placeholder ``%s``. When using this feature, Godot automatically converts values to string text, which is convenient when outputting text in labels or when using the ``print()`` function.
de: Die zweite Zeile verwendet den Wert der Variable ``score``, um den Platzhalter ``%s`` zu ersetzen. Wenn Sie dieses Feature verwenden, wandelt Godot die Werte automatisch in String-Text um, was bei der Ausgabe von Text in Labels oder bei der Verwendung der Funktion ``print()`` praktisch ist.
es: La segunda línea utiliza el valor de la variable ``score`` para reemplazar el símbolo ``%s``. Al utilizar esta función, Godot convierte automáticamente los valores a texto, lo cual es conveniente para mostrar texto en etiquetas o utilizando la función ``print()``.
zh_tw: 第二行用 ``score`` 變數的值替換預留位置 ``%s``。使用此功能時，Godot 會自動將值轉換為字串文字，這在向標籤中輸出文字或者使用 ``print()`` 函式時非常方便。

source: You can learn more about string formatting here: :ref:`doc_gdscript_printf`. In C#, consider using `string interpolation with "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_.
de: Mehr über die String-Formatierung erfahren Sie hier: :ref:`doc_gdscript_printf`. In C# können Sie die `String-Interpolation mit "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_ verwenden.
es: Puedes aprender más sobre formateo de cadenas aquí :ref:`doc_gdscript_printf`. En C#, considera usar `interpolación de cadenas con "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_.
zh_tw: 可以在 :ref:`doc_gdscript_printf` 學習字串格式化相關的更多資訊。在 C# 中請考慮`使用“$”進行字串插值 <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_。

source: You can now play the game and squash a few enemies to see the score increase.
de: Sie können nun das Spiel testen und ein paar Gegner zerstampfen, um zu sehen wie die Punktzahl ansteigt.
es: Ahora puedes jugar el juego y aplastar algunos enemigos para ver cómo aumenta la puntuación.
zh_tw: 你現在可以玩遊戲，壓死幾個敵人，看看分數的增長。

source: In a complex game, you may want to completely separate your user interface from the game world. In that case, you would not keep track of the score on the label. Instead, you may want to store it in a separate, dedicated object. But when prototyping or when your project is simple, it is fine to keep your code simple. Programming is always a balancing act.
de: In einem komplexen Spiel möchten Sie vielleicht die Benutzeroberfläche vollständig von der Spielwelt trennen. In diesem Fall würden Sie die Punktzahl nicht im Label aufbewahren. Stattdessen sollten Sie sie in einem seperaten dedizierten Objekt speichern. Beim Prototyping oder wenn ihr Projekt simpel ist, ist es in Ordnung, den Code auch simpel zu halten. Programmieren ist immer ein Balanceakt.
es: En un juego complejo, es posible que desees separar por completo la interfaz de usuario del mundo del juego. En ese caso, no llevarías un seguimiento de la puntuación en la etiqueta. En su lugar, podrías almacenarla en un objeto separado y dedicado. Sin embargo, al prototipar o cuando tu proyecto es simple, está bien mantener tu código simple. La programación siempre es un acto de equilibrio.
zh_tw: 在一個複雜的遊戲中，你可能想把你的使用者介面與遊戲世界完全分開。在這種情況下，你就不會在標籤上記錄分數了。相反，你可能想把它儲存在一個單獨的、專門的物件中。但當原型設計或你的專案很簡單時，保持你的程式碼簡單就可以了。程式設計總是一種平衡的行為。

source: Retrying the game
de: Einen neuen Versuch wagen
es: Reintentando el juego
zh_tw: 執行遊戲

source: We'll now add the ability to play again after dying. When the player dies, we'll display a message on the screen and wait for input.
de: Wir werden nun die Möglichkeit hinzufügen, nach dem Tod das Spiel neu zu starten. Wenn der Spieler stirbt, werden wir eine Nachricht auf dem Bildschirm anzeigen und auf eine Eingabe warten.
es: Ahora agregaremos la capacidad de jugar nuevamente después de morir. Cuando el jugador muera, mostraremos un mensaje en la pantalla y esperaremos una entrada.
zh_tw: 我們現在就要新增死亡後重玩的能力。玩家死亡後，我們會在螢幕上現實一條消息並等待輸入。

source: Head back to the ``main.tscn`` scene, select the ``UserInterface`` node, add a child node :ref:`ColorRect <class_ColorRect>`, and name it ``Retry``. This node fills a rectangle with a uniform color and will serve as an overlay to darken the screen.
de: Gehen Sie zurück zur Szene ``main.tscn``, wählen Sie den ``UserInterface``-Node, fügen einen Child-Node :ref:`ColorRect <class_ColorRect>` hinzu und nennen ihn ``Retry``. Dieser Node füllt ein Rechteck mit einer einheitlichen Farbe und dient als Overlay, um den Bildschirm zu verdunkeln.
es: Regresa a la escena ``main.tscn``, selecciona el nodo ``UserInterface``, agrega un nodo :ref:`ColorRect <class_ColorRect>` como hijo de este y nómbralo ``Retry``. Este nodo llenará un rectángulo con un color uniforme y servirá como una superposición para oscurecer la pantalla.
zh_tw: 回到 ``main.tscn`` 場景，選中 ``UserInterface`` 節點，新增 :ref:`ColorRect <class_ColorRect>` 節點作為其子項並命名為 ``Retry``（重試）。該節點會使用單一色彩填充矩形，我們用它來覆蓋畫面，達到變暗的效果。

source: To make it span over the whole viewport, you can use the *Anchor Preset* menu in the toolbar.
de: Um ihn über das gesamte Ansichtsfenster zu legen, können Sie das Menü *Anker-Vorgaben* in der Toolbar verwenden.
es: Para hacer que abarque toda la ventana de visualización, puedes utilizar el menú *Anchor Preset* en la barra de herramientas.
zh_tw: 要使其覆蓋整個視口，可以使用工具列中 *錨點預設* 功能表。

source: Open it and apply the *Full Rect* command.
de: Öffnen Sie es und wenden den Befehl *Vollständiges Rechteck* an.
es: Ábrelo y aplica el comando *Full Rect*.
zh_tw: 點擊打開，並應用*整個矩形*命令。

source: Nothing happens. Well, almost nothing; only the four green pins move to the corners of the selection box.
de: Es passiert nichts. Nun, fast nichts; nur die vier grünen Stifte bewegen sich zu den Ecken des Auswahlfeldes.
es: No sucede nada. Bueno, casi nada; solo los cuatro pines verdes se mueven a las esquinas del cuadro de selección.
zh_tw: 什麼都沒發生。好吧，是幾乎什麼都沒有；只有四個綠色的大頭針移動到了選擇框的四個角落。

source: This is because UI nodes (all the ones with a green icon) work with anchors and margins relative to their parent's bounding box. Here, the ``UserInterface`` node has a small size and the ``Retry`` one is limited by it.
de: Das liegt daran, dass UI-Nodes (alle mit einem grünen Icon) mit Ankern und Rändern relativ zur Bounding Box ihres Parents arbeiten. Hier hat der ``UserInterface``-Node eine kleine Größe und der ``Retry``-Node ist dadurch begrenzt.
es: Esto se debe a que los nodos de UI (todos los que tienen un ícono verde) funcionan con anclajes y márgenes relativos al cuadro delimitador de su padre. Aquí, el nodo ``UserInterface`` tiene un tamaño pequeño y el nodo ``Retry`` está limitado por él.
zh_tw: 這是因為 UI 節點（圖示都是綠色）使用的是錨點和邊距，它們都相對於它們父節點包圍框。這裡的 ``UserInterface`` 節點比較小，所以 ``Retry`` 會受限於它。

source: Select the ``UserInterface`` and apply *Anchor Preset -> Full Rect* to it as well. The ``Retry`` node should now span the whole viewport.
de: Wählen Sie das ``UserInterface`` und wenden Sie *Anker-Vorgaben -> Vollständiges Rechteck* darauf an. Der ``Retry``-Node sollte sich nun über den gesamten Viewport erstrecken.
es: Selecciona el nodo ``UserInterface`` y también aplica *Anchor Presets -> Completo* en él. Ahora, el nodo ``Retry`` debería abarcar toda la ventana gráfica.
zh_tw: 選中 ``UserInterface`` 然後也對其使用*錨點預設 -> 整個矩形*。``Retry`` 節點就應該覆蓋整個視口了。

source: Let's change its color so it darkens the game area. Select ``Retry`` and in the *Inspector*, set its *Color* to something both dark and transparent. To do so, in the color picker, drag the *A* slider to the left. It controls the color's Alpha channel, that is to say, its opacity/transparency.
de: Ändern wir seine Farbe so, dass er den Spielbereich verdunkelt. Wählen Sie ``Retry`` und setzen Sie im *Inspektor* seine *Farbe* auf etwas Dunkles und Transparentes. Ziehen Sie dazu in der Farbauswahl den Schieberegler *A* nach links. Er steuert den Alphakanal der Farbe, d.h. ihre Deckkraft/Transparenz.
es: Cambiemos su color para que oscurezca el área del juego. Selecciona ``Retry`` y en el *Inspector*, establece su *Color* en algo oscuro y transparente. Para hacerlo, en el selector de color, arrastra el deslizador *A* hacia la izquierda. Este controla el canal alfa del color, es decir, su opacidad/transparencia.
zh_tw: 讓我們修改它的顏色，把遊戲區域變暗。選中 ``Retry``，在*屬性面板*中將 *Color*（顏色）設定為透明的暗色。要實作整個效果，可以在取色器中將 *A* 滑動條拖到左邊。它控制的是顏色的 Alpha 通道，也就是不透明度。

source: Next, add a :ref:`Label <class_Label>` as a child of ``Retry`` and give it the *Text* "Press Enter to retry." To move it and anchor it in the center of the screen, apply *Anchor Preset -> Center* to it.
de: Als nächstes fügen Sie ein :ref:`Label <class_Label>` als Child von ``Retry`` hinzu und geben ihm den *Text* "Press Enter to retry.". Um es zu verschieben und in der Mitte des Bildschirms zu verankern, wenden Sie *Anker-Vorgaben -> Mitte* auf es an.
es: Ahora, agrega un :ref:`Label <class_Label>` como hijo de ``Retry`` y en el *Text* escribe "Press Enter to retry." Para moverlo y anclarlo en el centro de la pantalla, aplica *Anchor Preset -> Center* a este.
zh_tw: 接下來，新增一個 :ref:`Label <class_Label>` 的節點作為 ``Retry`` 的子節點並且設定他的 *Text* 為“Press Enter to retry”。將其移動至螢幕中央，並且選擇 *Anchor Preset -> Center*（錨點預設 > 居中）。

source: Coding the retry option
de: Die Neustart-Option programmieren
es: Codificando la opcion retry
zh_tw: 複寫建置選項

source: We can now head to the code to show and hide the ``Retry`` node when the player dies and plays again.
de: Wir können nun den Code zum Ein- und Ausblenden des ``Retry``-Nodes verwenden, wenn der Spieler stirbt und neu beginnt.
es: Ahora podemos dirigirnos al código para mostrar y ocultar el nodo ``Retry`` cuando el jugador muere y vuelve a jugar.
zh_tw: 我們現在就可以去編寫程式碼，在玩家死亡時顯示 ``Retry`` 節點，重玩時隱藏。

source: Open the script ``main.gd``. First, we want to hide the overlay at the start of the game. Add this line to the ``_ready()`` function.
de: Öffnen Sie das Skript ``main.gd``. Zuerst wollen wir das Overlay zu Beginn des Spiels ausblenden. Fügen Sie diese Zeile in die Funktion ``_ready()`` ein.
es: Abre el script ``main.gd``. Primero, queremos ocultar la superposición al inicio del juego. Agrega esta línea a la función ``_ready()``.
zh_tw: 打開 ``main.gd`` 腳本。首先，我們想要在遊戲開始時隱藏覆蓋層。將這一行加到 ``_ready()`` 函式中。

source: Then, when the player gets hit, we show the overlay.
de: Wenn der Spieler getroffen wird, zeigen wir das Overlay.
es: Luego, cuando el jugador recibe un golpe, mostramos la superposición.
zh_tw: 然後在玩家受到攻擊時，我們就顯示這個覆蓋層。
