Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/08.score_and_replay.po
Languages: de, es, zh_tw

source: Finally, when the ``Retry`` node is visible, we need to listen to the player's input and restart the game if they press enter. To do this, we use the built-in ``_unhandled_input()`` callback, which is triggered on any input.
de: Schließlich, wenn der ``Retry``-Node sichtbar ist, müssen wir auf die Eingaben des Spielers reagieren und das Spiel neu starten, wenn er Enter drückt. Um dies zu tun, benutzen wir den Built-in-``_unhandled_input()``-Callback, der bei jeder Eingabe ausgelöst wird.
es: Finalmente, cuando el nodo ``Retry`` es visible, necesitamos escuchar la entrada del jugador y reiniciar el juego si presionan Enter. Para hacer esto, utilizamos el callback incorporado ``_unhandled_input()`` que se dispara con cualquier entrada.
zh_tw: 最後，當 ``Retry`` 節點可見時，我們需要監聽玩家的輸入，按下確認鍵時讓遊戲重啟。可以使用內建的 ``_unhandled_input()`` 回呼函式來實作，任何輸入都會觸發這個回呼函式。

source: If the player pressed the predefined ``ui_accept`` input action and ``Retry`` is visible, we reload the current scene.
de: Wenn der Spieler die vordefinierte ``ui_accept``-Eingabeaktion gedrückt hat und ``Retry`` sichtbar ist, laden wir die aktuelle Szene neu.
es: Si el jugador presiona la acción de entrada predefinida "ui_accept" y ``Retry`` es visible, recargamos la escena actual.
zh_tw: 如果玩家按下了預設的 ``ui_accept`` 輸入動作並且 ``Retry`` 是可見狀態，我們就重新載入目前場景。

source: The function ``get_tree()`` gives us access to the global :ref:`SceneTree <class_SceneTree>` object, which allows us to reload and restart the current scene.
de: Die Funktion ``get_tree()`` ermöglicht uns den Zugriff auf das globale Object :ref:`SceneTree <class_SceneTree>`, mit dem wir die akuelle Szene neu laden und starten können.
es: La función ``get_tree()`` nos da acceso al objeto global :ref:`SceneTree <class_SceneTree>`, lo que nos permite recargar y reiniciar la escena actual.
zh_tw: 我們可以通過 ``get_tree()`` 函式存取全域 :ref:`SceneTree <class_SceneTree>` 物件，然後用它來重新載入並重啟目前場景。

source: Adding music
de: Musik hinzufügen
es: Añadiendo musica
zh_tw: 新增腳本

source: To add music that plays continuously in the background, we're going to use another feature in Godot: :ref:`autoloads <doc_singletons_autoload>`.
de: Um Musik hinzuzufügen, die kontinuirlich im Hintergrund spielt, werden wir ein weiteres Feature von Godot verwenden: :ref:`Autoloads<doc_singletons_autoload>`.
es: Para agregar música que se reproduzca continuamente en segundo plano, vamos a utilizar otra característica de Godot: los :ref:`autoloads <doc_singletons_autoload>`.
zh_tw: 要新增音樂，讓音樂在後臺連續播放，我們就要用到 Godot 的另一項功能：:ref:`自動載入 <doc_singletons_autoload>`。

source: To play audio, all you need to do is add an :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` node to your scene and attach an audio file to it. When you start the scene, it can play automatically. However, when you reload the scene, like we do to play again, the audio nodes are also reset, and the music starts back from the beginning.
de: Um Audio abzuspielen, müssen Sie lediglich einen :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`-Node zu Ihrer Szene hinzufügen und eine Audiodatei an diesen anhängen. Wenn Sie die Szene starten, kann sie automatisch abgespielt werden. Wenn Sie jedoch die Szene neu laden, wie wir es tun, um erneut zu spielen, werden auch die Audio-Nodes zurückgesetzt, und die Musik beginnt wieder von vorne.
es: Para reproducir audio, todo lo que necesitas hacer es agregar un nodo :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` a tu escena y adjuntarle un archivo de audio. Cuando inicias la escena, puede reproducirse automáticamente. Sin embargo, cuando vuelves a cargar la escena, como lo hacemos para jugar nuevamente, los nodos de audio también se reinician y la música vuelve a comenzar desde el principio.
zh_tw: 要播放音訊，只需往場景裡新增一個 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 節點，然後為它附加一個音訊檔。啟動場景時，就會自動播放。然而，如果重新載入了場景，比如我們在重玩的時候就這麼幹了，這些音訊節點也會被重設，音樂也就會從頭開始播放。

source: You can use the autoload feature to have Godot load a node or a scene automatically at the start of the game, outside the current scene. You can also use it to create globally accessible objects.
de: Sie können das Autoload-Feature verwenden, um Godot zu veranlassen, einen Node oder eine Szene automatisch zu Beginn des Spiels zu laden, und zwar außerhalb der aktuellen Szene. Sie können damit auch global zugängliche Objekte erstellen.
es: Puedes utilizar la función de autoload para que Godot cargue automáticamente un nodo o una escena al inicio del juego, fuera de la escena actual. También puedes utilizarla para crear objetos de acceso global.
zh_tw: 你可以使用自動載入功能來讓 Godot 在遊戲開始時自動載入節點或場景，不依賴於目前場景。你還可以用它來建立能夠全域存取的物件。

source: Create a new scene by going to the *Scene* menu and clicking *New Scene* or by using the *+* icon next to your currently opened scene.
de: Erstellen Sie eine neue Szene, indem Sie im Menü *Szene* auf *Neue Szene* klicken oder indem Sie das *+*-Icon neben der aktuell geöffneten Szene verwenden.
es: Crea una nueva escena yendo al menú *Escena* y haciendo clic en *Nueva Escena* o usando el icono *+* que está junto a la escena abierta.
zh_tw: 在*場景*功能表中按一下*新建場景*，或者使用目前打開的場景旁邊的 *+* 圖示來建立一個新場景。

source: |image15|
zh_tw: \ |image1|

source: Click the *Other Node* button to create an :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` and rename it to ``MusicPlayer``.
de: Klicken Sie auf die *Anderer Node*-Button, um einen :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` zu erstellen und ihn in ``MusicPlayer`` umzubenennen.
es: Haz clic en el botón *Otro Nodo* para crear un :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` y renómbralo como ``MusicPlayer``.
zh_tw: 按一下*其他節點*按鈕，建立一個 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 然後將其重命名為 ``MusicPlayer``（音樂播放機）。

source: |image16|
zh_tw: \ |image1|

source: We included a music soundtrack in the ``art/`` directory, ``House In a Forest Loop.ogg``. Click and drag it onto the *Stream* property in the *Inspector*. Also, turn on *Autoplay* so the music plays automatically at the start of the game.
de: Wir haben einen Musik-Soundtrack in dem Ordner ``art/`` beigefügt, namens ``House In a Forest Loop.ogg``. Klicken und ziehen sie diese Datei in die Eigenschaft *Stream* im *Inspektor*. Schalten Sie außerdem *Autoplay* ein, damit die Musik automatisch zu Beginn des Spiels abgespielt wird.
es: Incluimos una banda sonora en el directorio ``art/``, llamada ``House In a Forest Loop.ogg``. Haz clic y arrástrala hasta la propiedad *Stream* en el *Inspector*. Además, activa *Autoplay* para que la música se reproduzca automáticamente al inicio del juego.
zh_tw: 我們在 ``art/`` 目錄中包含了一條音樂音軌 ``House In a Forest Loop.ogg``。按一下並把它拖放到*屬性面板*中的 *Stream*（流）屬性上。同時要打開 *Autoplay*，這樣音樂就會在遊戲開始時自動播放了。

source: |image17|
zh_tw: \ |image1|

source: Save the scene as ``MusicPlayer.tscn``.
de: Anschließend speichern Sie die Szene unter dem Namen ``MusicPlayer.tscn``.
es: Guarda la escena como ``MusicPlayer.tscn``.
zh_tw: 最後，保存場景為 ``sayhello.tscn`` 之類的名稱。

source: We have to register it as an autoload. Head to the *Project -> Project Settings…* menu and click on the *Autoload* tab.
de: Sie müssen es für Autoload registrieren. Gehen Sie zu *Projekt -> Projekteinstellungen...* und klicken sie auf den *Autoload*-Tab.
es: Tenemos que registrarlo como una carga automática. Ve al menú *Proyecto -> Configuración del proyecto...* y haz clic en la pestaña *Carga automática*.
zh_tw: 要自動載入場景或腳本，請從選單中選擇 **[專案] -> [專案設定]** 然後切換到 **[AutoLoad]** 分頁。

source: In the *Path* field, you want to enter the path to your scene. Click the folder icon to open the file browser and double-click on ``MusicPlayer.tscn``. Then, click the *Add* button on the right to register the node.
de: Geben Sie in das Feld *Pfad* den Pfad zu Ihrer Szene ein. Klicken Sie das Order-Icon um die Dateiauswahl zu öffnen und doppelklicken Sie auf ``MusicPlayer.tscn``. Dann klicken Sie auf den *Hinzufügen*-Button auf der rechten Seite, um den Node zu registrieren.
es: En el campo *Path*, debes ingresar la ruta de tu escena. Haz clic en el ícono de la carpeta para abrir el explorador de archivos y haz doble clic en ``MusicPlayer.tscn``. Luego, haz clic en el botón *Add* a la derecha para registrar el nodo.
zh_tw: *路徑*輸入框中需要輸入場景的路徑。按一下資料夾圖示打開檔瀏覽器，然後按兩下 ``MusicPlayer.tscn``。接下來，按一下右側的*新增*按鈕，將該節點進行註冊。

source: |image18|
zh_tw: \ |image1|

source: ``MusicPlayer.tscn`` now loads into any scene you open or play. So if you run the game now, the music will play automatically in any scene.
de: ``MusicPlayer.tscn`` wird nun in jede Szene geladen, die Sie öffnen oder spielen. Wenn Sie also das Spiel jetzt starten, wird die Musik automatisch in jeder Szene gespielt.
es: ``MusicPlayer.tscn`` ahora carga con cualquier escena que abras o ejecutes. Así que si ejecutas el juego ahora, la música se reproducirá automáticamente en cualquier escena.
zh_tw: ``MusicPlayer.tscn`` 現在會被載入到任何您打開或播放的場景中。 因此，如果您現在運作遊戲，音樂將在任何場景中自動播放。

source: Before we wrap up this lesson, here's a quick look at how it works under the hood. When you run the game, your *Scene* dock changes to give you two tabs: *Remote* and *Local*.
de: Bevor wir diese Lektion abschließen, werfen wir noch einen kurzen Blick darauf was im inneren des Spiels vorgeht. Wenn Sie es starten, ändert sich ihr *Szene*-Dock und sie erhalten zwei Tabs: *Remote* und *Lokal*.
es: Antes de finalizar esta lección, aquí tienes un vistazo rápido de cómo funciona internamente. Cuando ejecutas el juego, tu panel *Escena* cambia para mostrarte dos pestañas: *Remote* y *Local*.
zh_tw: 在這一節課結束之前，我們來看一下在底層發生了什麼。運作遊戲時，你的*場景*面板會多出來兩個分頁：*遠端*和*本地*。

source: |image19|
zh_tw: \ |image1|

source: The *Remote* tab allows you to visualize the node tree of your running game. There, you will see the *Main* node and everything the scene contains and the instantiated mobs at the bottom.
de: Der *Remote*-Tab ermöglicht es Ihnen, den Szenenbaum Ihres laufenden Spiels zu visualisieren. Dort sehen Sie den *Main*-Node und alles, was die Szene enthält, sowie die instanziierten Mobs am unteren Ende.
es: La pestaña *Remote* te permite visualizar el árbol de nodos de tu juego en ejecución. Allí verás el nodo *Main* y todo lo que contiene la escena, así como los enemigos instanciados en la parte inferior.
zh_tw: 你可以在*遠端*分頁中查看運作中的遊戲的節點樹。你會看到 *Main* 節點以及場景中所包含的所有東西，最底部是產生實體的小怪。

source: |image20|
zh_tw: \ |image2|

source: At the top are the autoloaded ``MusicPlayer`` and a *root* node, which is your game's viewport.
de: Ganz oben befinden sich der automatisch geladene ``MusicPlayer`` und ein *Root*-Node, der den Viewport Ihres Spiels darstellt.
es: En la parte superior se encuentran el nodo autocargado ``MusicPlayer`` y un nodo *root*, que es el viewport del juego.
zh_tw: 頂部的是自動載入的 ``MusicPlayer`` 以及一個 *root* 節點，這是你的遊戲的視口。

source: And that does it for this lesson. In the next part, we'll add an animation to make the game both look and feel much nicer.
de: Und das war's für diese Lektion. Im nächsten Teil fügen wir eine Animation hinzu, damit sich das Spiel besser anfühlt und aussieht.
es: Y eso es todo para esta lección. En la próxima parte, agregaremos una animación para que el juego se vea y se sienta mucho mejor.
zh_tw: 這一節課就是這樣。在下一部分，我們會新增動畫，讓遊戲更美觀。

source: Here is the complete ``main.gd`` script for reference.
de: Hier ist das vollständige Skript ``main.gd`` als Referenz.
es: Aquí está el script completo ``main.gd`` como referencia.
zh_tw: 這是完整的 ``main.gd`` 腳本，僅供參考。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
zh_tw: 翻譯狀態
