Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/going_further.po
Languages: de, zh_tw

source: Going further
de: Nächste Schritte
zh_tw: 來日方長

source: You can pat yourself on the back for having completed your first 3D game with Godot.
de: Zuerst einmal können Sie sich selbst auf die Schulter klopfen, dafür dass sie ihr erstes 3D-Spiel mit Godot erfolgreich abgeschlossen haben.
zh_tw: 你完成了使用 Godot 開發的第一個 3D 遊戲，表揚一下自己吧。

source: In this series, we went over a wide range of techniques and editor features. Hopefully, you've witnessed how intuitive Godot's scene system can be and learned a few tricks you can apply in your projects.
de: In dieser Artikelreihe haben wir eine breite Palette von Techniken und Editor-Features vorgestellt. Hoffentlich haben Sie gesehen, wie intuitiv das Godot-Szenensystem sein kann, und ein paar Tricks gelernt, die Sie bei Ihren Projekten anwenden können.
zh_tw: 在本系列中，我們使用了各種不同的技巧和編輯器功能。希望你瞭解到了學習 Godot 場景系統的直觀性，並且學到了一些能夠在後續專案中使用的技巧。

source: But we just scratched the surface: Godot has a lot more in store for you to save time creating games. And you can learn all that by browsing the documentation.
de: Aber wir haben nur an der Oberfläche gekratzt: Godot hat noch viel mehr auf Lager, um Ihnen beim Erstellen von Spielen Zeit zu sparen. Und all das können Sie jederzeit in der Dokumentation lernen und nachlesen.
zh_tw: 不過我們所涉及的還只是皮毛：Godot 還有很多可以節省建立遊戲時間的東西，都可以通過瀏覽文件學到。

source: Where should you begin? Below, you'll find a few pages to start exploring and build upon what you've learned so far.
de: Wo sollten Sie beginnen? Im Folgenden finden Sie einige Seiten, auf denen Sie mit der Erkundung beginnen und auf dem bisher Gelernten aufbauen können.
zh_tw: 你應該從哪裡入手呢？下面列出的，是一些可以開始探索的頁面，可以拓展你目前所學到的知識。

source: But before that, here's a link to download a completed version of the project: `<https://github.com/godotengine/godot-3d-dodge-the-creeps>`_.
de: Aber vorher gibt es noch einen Link zum Herunterladen einer fertigen Version des Projekts: `<https://github.com/godotengine/godot-3d-dodge-the-creeps>`_.
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Exploring the manual
de: Das Handbuch erkunden
zh_tw: 從命令行進行匯出

source: The manual is your ally whenever you have a doubt or you're curious about a feature. It does not contain tutorials about specific game genres or mechanics. Instead, it explains how Godot works in general. In it, you will find information about 2D, 3D, physics, rendering and performance, and much more.
de: Das Handbuch ist Ihr Verbündeter, wenn Sie Zweifel haben oder sich für ein Feature interessieren. Es enthält keine Tutorials zu bestimmten Spielgenres oder Mechanismen. Stattdessen wird darin erklärt, wie Godot im Allgemeinen funktioniert. Darin finden Sie Informationen über 2D, 3D, Physik, Rendering und Performance, und vieles mehr.
zh_tw: 當你有疑問或對某個功能感到好奇時，手冊是你的導師。它不包含關於特定遊戲型別或機制的教學。相反，它解釋了 Godot 的一般運作方式。在手冊中，你會發現有關 2D、3D、物理、算繪和性能等方面的資訊。

source: Here are the sections we recommend you to explore next:
de: Hier sind die Abschnitte, die wir Ihnen empfehlen, als nächstes zu lesen:
zh_tw: 以下是我們建議你接下來探索的部分：

source: Read the :ref:`Scripting section <toc-scripting-core-features>` to learn essential programming features you'll use in every project.
de: Lesen Sie den :ref:`Skripting-Abschnitt <toc-scripting-core-features>`, um die wichtigsten Programmier-Features kennenzulernen, die Sie in jedem Projekt verwenden werden.
zh_tw: 閱讀:ref:`腳本章節 <toc-scripting-core-features>`可以學到每個專案中都會用到的必備程式設計功能。

source: The :ref:`3D <toc-learn-features-3d>` and :ref:`Physics <toc-learn-features-physics>` sections will teach you more about 3D game creation in the engine.
de: In den :ref:`3D <toc-learn-features-3d>` und :ref:`Physik <toc-learn-features-physics>`-Abschnitten erfahren sie mehr über die Entwicklung von 3D-Spielen mit der Engine.
zh_tw: :ref:`3D <toc-learn-features-3d>` 和:ref:`物理 <toc-learn-features-physics>`章節會講解更多關於使用引擎建立 3D 遊戲的知識。

source: :ref:`Inputs <toc-learn-features-inputs>` is another important one for any game project.
de: :ref:`Eingaben <toc-learn-features-inputs>` ist ein weiterer wichtiger Abschnitt für alle Arten von Spiel-Projekten.
zh_tw: :ref:`輸入 <toc-learn-features-inputs>`也是任何遊戲專案的重要功能。

source: You can start with these or, if you prefer, look at the sidebar menu on the left and pick your options.
de: Sie können mit diesen Ressourcen anfangen, oder wenn Sie es vorziehen, das Menü auf der linken Seite ansehen und sich etwas aussuchen.
zh_tw: 你可以從這些開始，或者，如果你願意，看看左邊的側欄功能表，挑選你的選項。

source: We hope you enjoyed this tutorial series, and we're looking forward to seeing what you achieve using Godot.
de: Wir hoffen, dass Ihnen diese Tutorial-Artikelreihe gefallen hat, und wir freuen uns darauf, zu sehen, was Sie mit Godot erreichen.
zh_tw: 我們希望你喜歡這個系列教學，並期待看到你使用 Godot 取得的成果。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
