Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/index.po
Languages: de, pl, tr

source: Your first 3D game
de: Ihr erstes 3D-Spiel
pl: Twoja pierwsza gra 3D
tr: İlk 3B oyununuz

source: In this step-by-step tutorial series, you will create your first complete 3D game with Godot. By the end of the series, you will have a simple yet finished project of your own like the animated gif below.
de: In dieser Schritt-für-Schritt-Tutorial-Artikelreihe werden Sie Ihr erstes vollständiges 3D-Spiel mit Godot erstellen. Am Ende dieser Reihe werden Sie dann ein einfaches, aber fertiges Projekt wie das folgende animierte GIF haben.
pl: W tej serii samouczków krok po kroku stworzysz swoją pierwszą w pełni trójwymiarową grę w Godocie. Po ukończeniu tych samouczków będziesz mieć swój prosty, ale skończony projekt - jak na zamieszonym poniżej animowanym gifie.
tr: Bu adım-adım öğretici serisinde, Godot ile ilk tamamlanmış 2B oyununuzu oluşturacaksınız. Serinin bitiminde, aşağıdaki hareketli resimdekine benzeyen, kendinize ait basit ama bitmiş bir projeniz olacak.

source: The game we'll code here is similar to :ref:`doc_your_first_2d_game`, with a twist: you can now jump and your goal is to squash the creeps. This way, you will both **recognize patterns** you learned in the previous tutorial and **build upon them** with new code and features.
de: Das Spiel, das wir hier programmieren werden, ist ähnlich wie :ref:`doc_your_first_2d_game`, mit einem Twist: Sie können jetzt springen und Ihr Ziel ist es, die Creeps zu zerstampfen. Auf diese Weise werden Sie sowohl **Techniken wiedererkennen**, die Sie im vorherigen Tutorial gelernt haben, als auch mit neuem Code und neuen Features **auf ihnen aufbauen**.
pl: Gra, którą tutaj kodujemy, jest podobna do :ref:`doc_your_first_2d_game`, z tą różnicą, że możesz teraz skakać, a twoim celem jest zmiażdżenie innych stworów. W ten sposób zarówno **rozpoznasz schematy i wzorce**, których nauczyłeś się w poprzednim samouczku, jak i **zbudujesz na nich** nowy kod i funkcje.
tr: Kodlayacağımız oyun, :ref:`doc_your_first_2d_game` serisinde yaptığımıza çok benziyor, ama ufak bir marifeti daha olacak: sıçrayabileceksiniz ve amacınız canavarları ezmek olacak. Bu şekilde, hem önceki öğreticiden öğrendiğiniz **kalıpları ayırt edecek** hem de yeni kodlar ve özelliklerle **bunların üzerine koyarak gelişeceksiniz**.

source: You will learn to:
de: Sie werden lernen:
pl: Nauczysz się jak:
tr: Şunları yapmayı öğreneceksiniz:

source: Work with 3D coordinates with a jumping mechanic.
de: mit 3D-Koordinaten mit einer Sprungmechanik zu arbeiten.
pl: Pracować ze współrzędnymi 3D tworząc mechanikę skoków.
tr: Sıçrama mekaniği ile 3B koordinatlarda çalışmak.

source: Use kinematic bodies to move 3D characters and detect when and how they collide.
de: kinematische Bodys zu verwenden, um 3D Charaktere zu bewegen und zu erkennen, wann und wie sie kollidieren.
pl: Używać ciał kinematycznych (kinematic bodies), aby poruszać postaciami 3D i wykrywać, kiedy i jak się zderzają.
tr: 3B karakterleri hareket ettirmek için kinematik cisimler kullanmak ve bunların ne zaman ve nasıl çarpıştıklarını algılamak.

source: Use physics layers and a group to detect interactions with specific entities.
de: Physikschichten und eine Gruppe verwenden, um Interaktionen mit bestimmten Objekten zu erkennen.
pl: Używać warstw fizycznych (physics layer) i grup (group), aby wykryć interakcje z określonymi bytami.
tr: Belirli varlıklar ile etkileşimleri algılamak için fizik katmanları ve bir grup kullanmak.

source: Code basic procedural gameplay by instancing monsters at regular time intervals.
de: prozedurales Gameplay durch regelmäßiges Instanziieren von Kreaturen zu programmieren.
pl: Kodować podstawową rozgrywkę proceduralnie, tworząc instancje potworów w regularnych odstępach czasu.
tr: Canavarları düzenli zaman aralıklarında örnekleyerek temel yöntemsel oynanış kodlamak.

source: Design a movement animation and change its speed at run-time.
de: eine Bewegungsanimation zu entwerfen und ihre Geschwindigkeit zur Laufzeit zu ändern.
pl: Projektować animację ruchu i zmieniać jej prędkość w czasie wykonywania.
tr: Hareket canlandırması tasarlamak ve bunun hızını çalışma-zamanında değiştirmek.

source: Draw a user interface on a 3D game.
de: eine Benutzeroberfläche für ein 3D-Spiel zu zeichnen.
pl: Rysować interfejs użytkownika dla gry 3D.
tr: 3B bir oyunda kullanıcı arayüzü çizmek.

source: And more.
de: Und mehr.
tr: Ve daha fazlası.

source: This tutorial is for beginners who followed the complete getting started series. We'll start slow with detailed instructions and shorten them as we do similar steps. If you're an experienced programmer, you can browse the complete demo's source code here: `Squash the Creep source code <https://github.com/godotengine/godot-3d-dodge-the-creeps>`__.
de: Dieses Tutorial ist für Anfänger gedacht, die aber die komplette Artikelreihe "Erste Schritte" durchlaufen haben. Wir fangen langsam mit detaillierten Anweisungen an und kürzen sie, wenn wir ähnliche Schritte durchführen. Wenn Sie ein erfahrener Programmierer sind, können Sie den kompletten Quellcode der Demo hier einsehen: `Squash the Creep Quellcode <https://github.com/godotengine/godot-3d-dodge-the-creeps>`__.
pl: Ten samouczek jest przeznaczony dla początkujących, którzy przeszli całą serię wprowadzającą. Zaczniemy powoli od dość dokładnych instrukcji i będziemy je powoli skracać, gdy powtórzymy podobne kroki, co poprzednio. Jeśli jesteś doświadczonym programistą, możesz przeglądać pełny kod źródłowy wersji demonstracyjnej tutaj: `Zmiażdż Creepsów - kod źródłowy <https://github.com/godotengine/godot-3d-dodge-the-creeps>`__.

source: You can follow this series without having done the 2D one. However, if you're new to game development, we recommend you to start with 2D. 3D game code is always more complex and the 2D series will give you foundations to follow along more comfortably.
de: Sie können dieser Artikelreihe folgen, ohne die 2D-Reihe gemacht zu haben. Aber wenn Sie Spielentwicklung gerade erst lernen, dann empfehlen wir Ihnen, mit 2D zu starten. Code für 3D Spiele ist komplexer und die 2D-Reihe wird Ihnen Grundlagen vermitteln, denen man einfacher folgen kann.
pl: Możesz śledzić tę serię bez konieczności robienia serii 2D. Jeśli jednak dopiero zaczynasz przygodę z tworzeniem gier, zalecamy rozpoczęcie od 2D. Kod gry 3D jest zawsze bardziej złożony, a seria 2D zapewni Ci podstawy do swobodniejszego poruszania się po silniku.
tr: Bu seriyi, önceki 2B olanı yapmadan da takip edebilirsiniz. Ancak, eğer oyun geliştirmeye yeni başlıyorsanız, 2B ile başlamanızı öneriyoruz. 3B oyunu kodlamak her zaman daha karmaşıktır ve 2B serisi size, daha rahat takip edebilmeniz için gereken temelleri verecektir.

source: We prepared some game assets so we can jump straight to the code. You can download them here: `Squash the Creeps assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
de: Wir haben einige Spiel-Assets vorbereitet, damit wir direkt mit dem Code beginnen können. Sie können sie hier herunterladen: `Squash the Creeps Assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
pl: Przygotowaliśmy kilka gotowych zasobów (assets) do gry, abyśmy mogli od razu przejść do kodu. Możesz je pobrać tutaj: `zasoby Zmiażdż Creepsów <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.

source: We will first work on a basic prototype for the player's movement. We will then add the monsters that we'll spawn randomly around the screen. After that, we'll implement the jump and squashing mechanic before refining the game with some nice animation. We'll wrap up with the score and the retry screen.
de: Wir werden zuerst an einem einfachen Prototyp für die Bewegung des Spielers arbeiten. Anschließend werden wir die Kreaturen hinzufügen, welche wir zufällig auf dem Bildschirm spawnen. Danach werden wir weitere Mechaniken wie Springen und Stampfen einbauen und erweitern das Ganze mit Animationen. Zuletzt werden wir einen Punktestand sowie einen Neustart-Bildschirm einbauen.
pl: Najpierw będziemy pracować nad podstawowym prototypem ruchu gracza. Następnie dodamy potwory, które będziemy losowo rozmieszczać na ekranie. Potem zaimplementujemy mechanikę skoku i zgniatania, a następnie udoskonalimy grę, dodając jakąś ładną animację. Zakończymy na wyświetlaniu punktów i ekranie ponowienia gry.
tr: İlk olarak oyuncunun hareketi için temel bir ön-örnek üzerinde çalışacağız. Sonra ekranda rastgele ortaya çıkartacağımız canavarları ekleyeceğiz. Bunun ardından, bazı güzel animasyonlar ile oyunu güzelleştirmeden önce, sıçrama ve ezme mekaniklerini yazacağız. En sonunda, puanlama ve tekrar deneme ekranları ile bitireceğiz.

source: Contents
de: Inhalt
pl: Zawartość
tr: İçerikler

source: Translation status
de: Übersetzungsstatus
pl: Status tłumaczenia
tr: Çeviri durumu
