Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/autoloads_versus_internal_nodes.po
Languages: de, zh_cn

source: Autoloads versus regular nodes
de: Autoloads im Vergleich zu regulären Nodes
zh_cn: 自动加载与常规节点

source: Godot offers a feature to automatically load nodes at the root of your project, allowing you to access them globally, that can fulfill the role of a Singleton: :ref:`doc_singletons_autoload`. These autoloaded nodes are not freed when you change the scene from code with :ref:`SceneTree.change_scene_to_file <class_SceneTree_method_change_scene_to_file>`.
de: Godot bietet ein Feature zum automatischen Laden von Nodes im Root Ihres Projekts, das es Ihnen ermöglicht, global auf sie zuzugreifen und das die Rolle eines Singletons : :ref:`doc_singletons_autoload` erfüllen kann. Diese automatisch geladenen Nodes werden nicht freigegeben, wenn Sie die Szene über den Code mit :ref:`SceneTree.change_scene_to_file <class_SceneTree_method_change_scene_to_file>` ändern.
zh_cn: Godot 提供了一个在项目根节点自动加载节点的功能，允许你在全局范围内访问它们，从而完成单例作用 :ref:`doc_singletons_autoload` 。当你在代码中使用 :ref:`SceneTree.change_scene_to_file <class_SceneTree_method_change_scene_to_file>` 更改场景时，这些自动加载的节点不会被释放。

source: In this guide, you will learn when to use the Autoload feature, and techniques you can use to avoid it.
de: In dieser Anleitung erfahren Sie, wann Sie das Autoload-Feature verwenden sollten und welche Techniken Sie verwenden können, um es zu umgehen.
zh_cn: 在本指南中, 你将学习到何时使用自动加载功能, 以及避免使用该功能的方法.

source: The cutting audio issue
de: Das Problem mit abgehackten Sounds
zh_cn: 切割音频问题

source: Other engines can encourage the use of creating manager classes, singletons that organize a lot of functionality into a globally accessible object. Godot offers many ways to avoid global state thanks to the node tree and signals.
de: Andere Engines können zur Verwendung von Manager-Klassen zum Erzeugen von Objekten ermutigen: Singletons, die viele Funktionen in einem global zugänglichen Objekt organisieren. Godot bietet dank des Node-Baums und der Signale viele Möglichkeiten, einen globalen Zustand zu vermeiden.
zh_cn: 其他引擎可能鼓励使用创建管理类, 单例将很多功能组织到一个全局可访问的对象中. 由于节点树和信号,Godot提供了许多避免全局状态的方法.

source: For example, let's say we are building a platformer and want to collect coins that play a sound effect. There's a node for that: the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. But if we call the ``AudioStreamPlayer`` while it is already playing a sound, the new sound interrupts the first.
de: Nehmen wir zum Beispiel an, wir bauen einen Plattformer und möchten Münzen sammeln, wobei ein Soundeffekt abgespielt wird. Dafür gibt es einen Node: den :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. Wenn wir jedoch den ``AudioStreamPlayer`` aufrufen, während bereits ein Sound abgespielt wird, unterbricht der neue Sound den vorherigen.
zh_cn: 例如, 假设我们正在构建一个平台游戏, 并希望收集能够播放声音效果的硬币, 那么就有一个节点 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. 如果在 ``AudioStreamPlayer`` 已经在播放声音时调用它, 新的声音就会打断第一个声音.

source: A solution is to code a global, autoloaded sound manager class. It generates a pool of ``AudioStreamPlayer`` nodes that cycle through as each new request for sound effects comes in. Say we call that class ``Sound``, you can use it from anywhere in your project by calling ``Sound.play("coin_pickup.ogg")``. This solves the problem in the short term but causes more problems:
de: Eine Lösung besteht darin, eine globale, automatisch geladene Soundmanager-Klasse zu programmieren. Sie erzeugt einen Pool von ``AudioStreamPlayer``-Nodes, die bei jeder neuen Anfrage für Soundeffekte durchlaufen werden. Sagen wir, wir nennen diese Klasse ``Sound``, dann können Sie sie von überall in Ihrem Projekt benutzen, indem Sie ``Sound.play("coin_pickup.ogg")`` aufrufen. Dies löst das Problem kurzfristig, führt aber zu weiteren Problemen:
zh_cn: 一种解决方案是写一个全局的、自动加载的音效管理器类。它会生成一个 ``AudioStreamPlayer`` 的节点池，每当一个新的音效请求出现时，它就会在这个节点池中找到可用的节点来播放。我们不妨就把该类命名为 ``Sound`` ，你可以通过 ``Sound.play("coin_pickup.ogg")`` 从你项目中的任何位置使用它。这在短期内解决了问题但是却造成了更多的麻烦：

source: **Global state**: one object is now responsible for all objects' data. If the ``Sound`` class has errors or doesn't have an AudioStreamPlayer available, all the nodes calling it can break.
de: **Globaler Status**: Ein Objekt ist jetzt für alle Objektdaten verantwortlich. Wenn die ``Sound``-Klasse Fehler aufweist oder kein AudioStreamPlayer verfügbar ist, können alle aufrufenden Nodes Probleme bekommen.
zh_cn: **全局状态** : 一个对象现在负责所有对象的数据. 如果音效有错误, 或没有一个可用的 ``AudioStreamPlayer`` , 一切都会崩溃.

source: **Global access**: now that any object can call ``Sound.play(sound_path)`` from anywhere, there's no longer an easy way to find the source of a bug.
de: **Globaler Zugriff**: Jetzt, da jedes Objekt ``Sound.play(sound_path)`` von überall aufrufen kann, gibt es keine einfache Möglichkeit mehr, die Ursache eines Fehlers zu finden.
zh_cn: **全局访问** : 意味着任何对象都可以从任何地方调用 ``Sound.play(sound_path)`` , 便不容易找到错误的来源了.

source: **Global resource allocation**: with a pool of ``AudioStreamPlayer`` nodes stored from the start, you can either have too few and face bugs, or too many and use more memory than you need.
de: **Globale Ressourcenallokation**: Mit einem Pool von ``AudioStreamPlayer``-Nodes, die von Anfang an gespeichert wurden, können Sie entweder zu wenige Nodes haben und damit Bugs erzeugen, oder zu viele und dadurch deutlich mehr Speicher verwenden als benötigt.
zh_cn: **全局资源分配** : 由于从一开始就存储了一个 ``AudioStreamPlayer`` 节点池, 如果数量太少会遇到bug, 而数量太多则会占用更多的内存.

source: About global access, the problem is that any code anywhere could pass wrong data to the ``Sound`` autoload in our example. As a result, the domain to explore to fix the bug spans the entire project.
de: Das Problem beim globalen Zugriff besteht darin, dass jede beliebige Codestelle von irgendwoher falsche Daten an den ``Sound``-Autoload unseres Beispiels übergeben könnte. Infolgedessen erstreckt sich der zu überprüfende Bereich zur Behebung des Bugs über das gesamte Projekt.
zh_cn: 全局访问的问题在于，任何地方的代码都可能将错误的数据传递给我们例子中的 ``Sound`` 自动加载。因此，为了修复这个 bug，你需要检索的区域涵盖了整个项目。

source: When you keep code inside a scene, only one or two scripts may be involved in audio.
de: Wenn Sie dagegen Code in einer Szene halten, sind möglicherweise nur ein oder zwei Skripte an der Audioausgabe beteiligt.
zh_cn: 当你将代码保存在场景中时, 音频可能仅涉及一个或两个脚本.

source: Contrast this with each scene keeping as many ``AudioStreamPlayer`` nodes as it needs within itself and all these problems go away:
de: Vergleichen Sie dies damit, dass jede Szene so viele ``AudioStreamPlayer``-Nodes enthält wie sie selbst benötigt, und all diese Probleme verschwinden:
zh_cn: 与之形成对比的是, 每个场景在其内部, 保留尽可能多的 ``AudioStreamPlayer`` 节点, 所有这些问题都会消失:

source: Each scene manages its own state information. If there is a problem with the data, it will only cause issues in that one scene.
de: Jede Szene verwaltet ihre eigenen Statusinformationen. Wenn es ein Problem mit den Daten gibt, taucht dies nur in dieser einen Szene auf.
zh_cn: 每个场景管理自己的状态信息. 如果数据有问题, 则只会在该场景中引起问题.

source: Each scene accesses only its own nodes. Now, if there is a bug, it's easy to find which node is at fault.
de: Jede Szene greift nur auf ihre eigenen Nodes zu. Wenn es nun einen Fehler gibt, ist es leicht, diesen fehlerhaften Node zu finden.
zh_cn: 每个场景只访问自己的节点. 那么如果有一个bug, 很容易找到哪个节点有问题.

source: Each scene allocates exactly the amount of resources it needs.
de: Jede Szene alloziert genau die Menge an Ressourcen, die sie benötigt.
zh_cn: 每个场景只分配所需数量的资源.

source: Managing shared functionality or data
de: Gemeinsame Funktionen oder Daten verwalten
zh_cn: 管理共享功能或数据

source: Another reason to use an Autoload can be that you want to reuse the same method or data across many scenes.
de: Ein weiterer Grund für die Verwendung eines Autoloads kann sein, dass Sie dieselbe Methode oder dieselben Daten für viele Szenen wiederverwenden möchten.
zh_cn: 使用自动加载的另一个原因可能是你希望在许多场景中重复使用相同的方法或数据.

source: In the case of functions, you can create a new type of ``Node`` that provides that feature for an individual scene using the :ref:`class_name <doc_gdscript_basics_class_name>` keyword in GDScript.
de: Im Fall von Funktionen können Sie einen neuen Typ von ``Node`` erstellen, der dieses Feature für eine einzelne Szene bereitstellt, indem Sie das Schlüsselwort :ref:`class_name <doc_gdscript_basics_class_name>` in GDScript verwenden.
zh_cn: 对于函数，可以使用 GDScript 中的 :ref:`class_name <doc_gdscript_basics_class_name>` 关键字创建一种新的 ``Node`` 类型，为单个场景提供该功能。

source: When it comes to data, you can either:
de: In Bezug auf Daten können Sie entweder:
zh_cn: 当涉及到数据时, 你可以:

source: Create a new type of :ref:`Resource <class_Resource>` to share the data.
de: Einen neuen Typ :ref:`Resource <class_Resource>` erstellen, um die Daten gemeinsam zu nutzen.
zh_cn: 创建一个新类型的 :ref:`Resource <class_Resource>` 来共享数据.

source: Store the data in an object to which each node has access, for example using the ``owner`` property to access the scene's root node.
de: Die Daten in einem Objekt speichern, auf das jeder Node Zugriff hat, z.B. mithilfe der ``owner``-Property, um auf den Root-Node der Szene zuzugreifen.
zh_cn: 将数据存储在每个节点可以访问的对象中, 例如使用 ``owner`` 属性来访问场景的根节点.

source: When you should use an Autoload
de: Wann Sie ein Autoload verwenden sollten
zh_cn: 何时应使用自动加载

source: GDScript supports the creation of ``static`` functions using ``static func``. When combined with ``class_name``, this makes it possible to create libraries of helper functions without having to create an instance to call them. The limitation of static functions is that they can't reference member variables, non-static functions or ``self``.
de: GDScript unterstützt die Nutzung von ``static``-Funktionen, über ``static func``. Kombiniert mit ``class_name`` ermöglicht dies, Bibliotheken von Helferfunktion zu kreieren, ohne diese Funktionen vorher instanziieren zu müssen, um sie aufzurufen. Diese statischen Funktionen können jedoch keine Member-Variablen, nicht-statische Funktionen oder ``self`` referenzieren.
zh_cn: GDScript 支持使用 ``static func`` 创建 ``static`` （静态） 函数。 当与 ``class_name`` 结合使用时，（静态函数）可以创建辅助函数库，而无需创建实例来调用它们。 静态函数也具有限制，它们不能引用成员变量、非静态（non-static）函数或 ``self`` 。

source: Since Godot 4.1, GDScript also supports ``static`` variables using ``static var``. This means you can now share a variables across instances of a class without having to create a separate autoload.
de: Seit Godot 4.1 unterstützt GDScript auch ``statische`` Variablen über ``static var``. So können Sie Variablen zwischen den Instanzen einer Klasse teilen ohne ein separates Autoload zu erstellen.
zh_cn: 从 Godot 4.1 开始，GDScript 还支持使用 ``static var`` 的 ``static`` （静态）变量。 这意味着你现在可以在类的实例之间共享变量，而无需创建单独的自动加载。

source: Still, autoloaded nodes can simplify your code for systems with a wide scope. If the autoload is managing its own information and not invading the data of other objects, then it's a great way to create systems that handle broad-scoped tasks. For example, a quest or a dialogue system.
de: Dennoch können Autoload-Nodes Ihren Code für Systeme mit einem großen Geltungsbereich vereinfachen. Wenn der Autoload seine eigenen Informationen verwaltet und nicht in die Daten anderer Objekte eindringt, dann ist dies eine großartige Möglichkeit, Systeme zu erstellen, die Aufgaben mit breitem Geltungsbereich erledigen. Zum Beispiel eine Suche oder ein Dialogsystem.
zh_cn: 尽管如此，对于那些涵盖范围广泛的系统来说，使用自动加载的节点仍然可以简化你的代码。如果自动加载的节点管理自己的信息并且不侵入其他对象的数据，那么这就是一个创建处理广泛任务的系统（例如，任务或对话系统）的好方法。

source: An autoload is *not* necessarily a singleton. Nothing prevents you from instantiating copies of an autoloaded node. An autoload is only a tool that makes a node load automatically as a child of the root of your scene tree, regardless of your game's node structure or which scene you run, e.g. by pressing the :kbd:`F6` key.
de: Ein Autoload ist *nicht* notwendigerweise ein Singleton. Nichts hindert Sie daran, Kopien eines Autoload-Nodes zu instanziieren. Ein Autoload ist nur ein Werkzeug, das einen Node automatisch als Child-Node des Roots Ihres Szenenbaums lädt, unabhängig von der Node-Struktur Ihres Spiels oder der Szene, die Sie ausführen, z.B. durch Drücken der Taste :kbd:`F6`.
zh_cn: 自动加载 *不* 完全是一个单例。没有什么可以阻止你实例化自动加载的节点的副本。它只是一个使节点作为场景树的根的子节点自动加载的工具，而与游戏的节点结构或运行哪个场景（比如通过按 :kbd:`F6` 键运行当前场景）无关。

source: As a result, you can get the autoloaded node, for example an autoload called ``Sound``, by calling ``get_node("/root/Sound")``.
de: Als Ergebnis können Sie den Autoload-Node, zum Beispiel einen Autoload namens ``Sound``, durch den Aufruf von ``get_node("/root/Sound")`` erhalten.
zh_cn: 因此，你可以像这样，通过调用 ``get_node("/root/Sound")`` 来获取名为 ``Sound`` 的自动加载节点。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
