Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/data_preferences.po
Languages: de

source: The primary issue with using integers comes up when one wants to *print* an enum value. As integers, attempting to print ``MY_ENUM`` will print ``5`` or what-have-you, rather than something like ``"MyEnum"``. To print an integer enum, one would have to write a Dictionary that maps the corresponding string value for each enum.
de: Das Hauptproblem mit Integer-Werten ist die *Ausgabe* eines Enum-Werts. Mit Integer-Werten würde beim Ausgeben von ``MY_ENUM`` der Wert ``5`` oder so etwas ausgegeben werden, anstatt ``"MyEnum"``. Um einen Integer-Enum auszugeben, müsste man ein Dictionary schreiben, das jedem Enum-Wert den entsprechenden String-Wert zuordnet.

source: If the primary purpose of using an enum is for printing values and one wishes to group them together as related concepts, then it makes sense to use them as strings. That way, a separate data structure to execute on the printing is unnecessary.
de: Wenn der Hauptzweck der Verwendung eines Enums die Ausgabe von Werten ist und man sie als verwandte Konzepte gruppieren möchte, dann ist es sinnvoll, sie als Strings zu verwenden. Auf diese Weise wird eine separate Datenstruktur für die Ausgabe überflüssig.

source: Under what circumstances should one use each of Godot's animation classes? The answer may not be immediately clear to new Godot users.
de: Unter welchen Umständen sollte man welche der Animationsklassen von Godot verwenden? Die Antwort ist für neue Godot-Benutzer möglicherweise nicht sofort klar.

source: :ref:`AnimatedTexture <class_AnimatedTexture>` is a texture that the engine draws as an animated loop rather than a static image. Users can manipulate...
de: :ref:`AnimatedTexture <class_AnimatedTexture>` ist eine Textur, die von der Engine als animierte Schleife und nicht als statisches Bild gezeichnet wird. Benutzer können Folgendes verändern:

source: the rate at which it moves across each section of the texture (FPS).
de: Die Rate, mit der sie sich über jeden Abschnitt der Textur bewegt (FPS).

source: the number of regions contained within the texture (frames).
de: Die Anzahl der in der Textur enthaltenen Regionen (Frames).

source: Godot's :ref:`RenderingServer <class_RenderingServer>` then draws the regions in sequence at the prescribed rate. The good news is that this involves no extra logic on the part of the engine. The bad news is that users have very little control.
de: Godots :ref:`RenderingServer <class_RenderingServer>` zeichnet dann die Regionen nacheinander mit der vorgeschriebenen Geschwindigkeit. Die gute Nachricht ist, dass dies keine zusätzliche Logik von Seiten der Engine erfordert. Die schlechte Nachricht ist, dass der Benutzer sehr wenig Kontrolle hat.

source: Also note that AnimatedTexture is a :ref:`Resource <class_Resource>` unlike the other :ref:`Node <class_Node>` objects discussed here. One might create a :ref:`Sprite2D <class_Sprite2D>` node that uses AnimatedTexture as its texture. Or (something the others can't do) one could add AnimatedTextures as tiles in a :ref:`TileSet <class_TileSet>` and integrate it with a :ref:`TileMap <class_TileMap>` for many auto-animating backgrounds that all render in a single batched draw call.
de: Beachten Sie auch, dass AnimatedTexture eine :ref:`Resource <class_Resource>` ist, im Gegensatz zu den anderen hier besprochenen :ref:`Node <class_Node>`-Objekten. Man könnte einen :ref:`Sprite2D <class_Sprite2D>`-Node erstellen, der AnimatedTexture als seine Textur verwendet. Oder man könnte (was die anderen nicht können) AnimatedTextures als Tiles in einem :ref:`TileSet <class_TileSet>` hinzufügen und es mit einer :ref:`TileMap <class_TileMap>` für viele autoanimierende Hintergründe integrieren, die alle in einem einzigen, gebündelten Zeichnen-Aufruf gerendert werden.

source: The AnimatedSprite2D node, in combination with the :ref:`SpriteFrames <class_SpriteFrames>` resource, allows one to create a variety of animation sequences through spritesheets, flip between animations, and control their speed, regional offset, and orientation. This makes them well-suited to controlling 2D frame-based animations.
de: Der AnimatedSprite2D-Node in Kombination mit der Ressource :ref:`SpriteFrames <class_SpriteFrames>` ermöglicht es, eine Vielzahl von Animationssequenzen durch Spritesheets zu erstellen, zwischen Animationen zu wechseln und deren Geschwindigkeit, regionalen Versatz und Ausrichtung zu steuern. Dadurch sind sie gut geeignet, um 2D-framebasierte Animationen zu steuern.

source: If one needs trigger other effects in relation to animation changes (for example, create particle effects, call functions, or manipulate other peripheral elements besides the frame-based animation), then will need to use an :ref:`AnimationPlayer <class_AnimationPlayer>` node in conjunction with the AnimatedSprite2D.
de: Wenn sie andere Effekte in Bezug auf Animationsänderungen auslösen müssen (z.B. Partikeleffekte erstellen, Funktionen aufrufen oder andere Peripherieelemente neben der framebasierten Animation bearbeiten), müssen Sie einen :ref:`AnimationPlayer <class_AnimationPlayer>`-Node in Verbindung mit dem AnimatedSprite verwenden.

source: AnimationPlayers are also the tool one will need to use if they wish to design more complex 2D animation systems, such as...
de: AnimationPlayers sind auch das Tool, das man verwenden muss, wenn man komplexere 2D-Animationssysteme entwerfen möchte, wie z. B....

source: **Cut-out animations:** editing sprites' transforms at runtime.
de: **Cut Out-Animationen:** Bearbeitung der Transformationen von Sprites zur Laufzeit.

source: **2D Mesh animations:** defining a region for the sprite's texture and rigging a skeleton to it. Then one animates the bones which stretch and bend the texture in proportion to the bones' relationships to each other.
de: **2D Mesh-Animationen:** Man definiert einen Bereich für die Textur des Sprites und riggt ein Skelett dazu. Dann animiert man die Knochen, welche die Textur im Verhältnis zum Verhältnis der Knochen zueinander dehnen und verbiegen.

source: A mix of the above.
de: Eine Mischung der beiden.

source: While one needs an AnimationPlayer to design each of the individual animation sequences for a game, it can also be useful to combine animations for blending, i.e. enabling smooth transitions between these animations. There may also be a hierarchical structure between animations that one plans out for their object. These are the cases where the :ref:`AnimationTree <class_AnimationTree>` shines. One can find an in-depth guide on using the AnimationTree :ref:`here <doc_animation_tree>`.
de: Während man einen AnimationPlayer benötigt, um die einzelnen Animationssequenzen für ein Spiel zu entwerfen, kann es auch sinnvoll sein, Animationen für Blending zu kombinieren, d. h. fließende Übergänge zwischen diesen Animationen zu ermöglichen. Es kann auch eine hierarchische Struktur zwischen den Animationen geben, die man für sein Objekt ausplant. Das sind die Fälle, in denen der :ref:`AnimationTree <class_AnimationTree>` glänzt. Eine ausführliche Anleitung zur Verwendung des AnimationTree findet man :ref:`hier <doc_animation_tree>`.

source: Translation status
de: Übersetzungsstatus
