Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/data_preferences.po
Languages: de

source: Data preferences
de: Daten-Präferenzen

source: Ever wondered whether one should approach problem X with data structure Y or Z? This article covers a variety of topics related to these dilemmas.
de: Haben Sie sich jemals gefragt, ob man Problem X mit Datenstruktur Y oder Z angehen sollte? Dieser Artikel behandelt eine Reihe von Themen, die mit diesen Dilemmas zusammenhängen.

source: This article makes references to "[something]-time" operations. This terminology comes from algorithm analysis' `Big O Notation <https://rob-bell.net/2009/06/a-beginners-guide-to-big-o-notation/>`_.
de: Dieser Artikel enthält Verweise auf "[irgendetwas]-Lauzeit" -Operationen. Diese Terminologie stammt aus der Algorithmusanalyse ' `O-Notation <https://rob-bell.net/2009/06/a-beginners-guide-to-big-o-notation/>`_.

source: Long-story short, it describes the worst-case scenario of runtime length. In laymen's terms:
de: Knapp zusammengefasst, beschreibt es das Worst-Case-Szenario der Laufzeit. In einfachen Worten:

source: "As the size of a problem domain increases, the runtime length of the algorithm..."
de: "Mit zunehmender Größe eines Problems bedeutet dies für die Laufzeit des Algorithmus:"

source: Constant-time, ``O(1)``: "...does not increase."
de: Bei konstanter Laufzeit, ``O(1)``: "Sie erhöht sich nicht."

source: Logarithmic-time, ``O(log n)``: "...increases at a slow rate."
de: Bei logarithmischer Laufzeit, ``O(log n)``: "Sie nimmt langsam zu."

source: Linear-time, ``O(n)``: "...increases at the same rate."
de: Bei linearer Laufzeit, ``O(n)``: "Sie erhöht sich mit derselben Rate."

source: Imagine if one had to process 3 million data points within a single frame. It would be impossible to craft the feature with a linear-time algorithm since the sheer size of the data would increase the runtime far beyond the time allotted. In comparison, using a constant-time algorithm could handle the operation without issue.
de: Stellen Sie sich vor, Sie müssten 3 Millionen Datenpunkte in einem einzigen Frame verarbeiten. Es wäre unmöglich, das Feature mit einem Algorithmus mit linearer Laufzeit zu erstellen, da die schiere Größe der Daten die Laufzeit weit über die zugewiesene Zeit hinaus erhöhen würde. Im Vergleich dazu könnte die Verwendung eines Algorithmus mit konstanter Laufzeit die Operation ohne Probleme handhaben.

source: By and large, developers want to avoid engaging in linear-time operations as much as possible. But, if one keeps the scale of a linear-time operation small, and if one does not need to perform the operation often, then it may be acceptable. Balancing these requirements and choosing the right algorithm / data structure for the job is part of what makes programmers' skills valuable.
de: Im Großen und Ganzen möchten Entwickler möglichst keine Operationen mit linearer Laufzeit durchführen. Wenn man jedoch den Maßstab einer Operation mit linearer Laufzeit klein hält und die Operation nicht oft ausführen muss, kann dies akzeptabel sein. Das Abwägen dieser Anforderungen und die Auswahl des richtigen Algorithmus / der richtigen Datenstruktur für die anstehende Aufgabe ist Teil dessen, was die Fähigkeiten von Programmierern wertvoll macht.

source: Godot stores all variables in the scripting API in the :ref:`Variant <doc_variant_class>` class. Variants can store Variant-compatible data structures such as :ref:`Array <class_Array>` and :ref:`Dictionary <class_Dictionary>` as well as :ref:`Objects <class_Object>`.
de: Godot speichert alle Variablen in der Skripting-API in der Klasse :ref:`Variant <doc_variant_class>`. Variants können Variant-kompatible Datenstrukturen wie :ref:`Array <class_Array>` und :ref:`Dictionary <class_Dictionary>`, sowie :ref:`Object <class_Object>` speichern.

source: Godot implements Array as a ``Vector<Variant>``. The engine stores the Array contents in a contiguous section of memory, i.e. they are in a row adjacent to each other.
de: Godot implementiert ein Array als ``Vector <Variant>``. Die Engine speichert die Array-Inhalte in einem zusammenhängenden Speicherabschnitt, d.h. sie befinden sich in einer Reihe nebeneinander.

source: For those unfamiliar with C++, a Vector is the name of the array object in traditional C++ libraries. It is a "templated" type, meaning that its records can only contain a particular type (denoted by angled brackets). So, for example, a :ref:`PackedStringArray <class_PackedStringArray>` would be something like a ``Vector<String>``.
de: Für diejenigen, die mit C++ nicht vertraut sind, ist ein Vector der Name des Array-Objekts in den traditionellen C++-Bibliotheken. Er ist ein "templatisierter" Typ, d.h. seine Datensätze können nur einen bestimmten Typ enthalten (durch spitze Klammern gekennzeichnet). So wäre zum Beispiel ein :ref:`PackedStringArray <class_PackedStringArray>` so etwas wie ein ``Vector<String>``.

source: Contiguous memory stores imply the following operation performance:
de: Zusammenhängende Speicherbereiche beinhalten die folgende Ausführungsperformance:

source: **Iterate:** Fastest. Great for loops.
de: **Iterieren:** Am schnellsten. Ideal für Schleifen.

source: Op: All it does is increment a counter to get to the next record.
de: Verfahren: Erhöht lediglich einen Zähler, um zum nächsten Eintrag zu gelangen.

source: **Insert, Erase, Move:** Position-dependent. Generally slow.
de: **Einfügen, Entfernen, Verschieben:** Positionsabhängig. Im Allgemeinen langsam.

source: Op: Adding/removing/moving content involves moving the adjacent records over (to make room / fill space).
de: Verfahren: Beim Einfügen/ Entfernen/Verschieben von Inhalten müssen die angrenzenden Datensätze verschoben werden (um Platz zu schaffen / freigewordenen Platz zu füllen).

source: Fast add/remove *from the end*.
de: Schnelles Hinzufügen/Entfernen *vom Ende*.

source: Slow add/remove *from an arbitrary position*.
de: Langsames Hinzufügen/Entfernen *von einer beliebigen Position*.

source: Slowest add/remove *from the front*.
de: Sehr langsames Hinzufügen/Entfernen *von vorne*.

source: If doing many inserts/removals *from the front*, then...
de: Wenn Sie viele Einfügungen/Entfernungen *von vorne* ausführen, dann ...

source: invert the array.
de: invertieren Sie das Array.

source: do a loop which executes the Array changes *at the end*.
de: Führen Sie eine Schleife aus, die Ihre Array-Änderungen *am Ende* ausführt.

source: re-invert the array.
de: Invertieren Sie das Array erneut.

source: This makes only 2 copies of the array (still constant time, but slow) versus copying roughly 1/2 of the array, on average, N times (linear time).
de: Dies erstellt nur 2 Kopien des Arrays (immer noch konstante Laufzeit, aber langsam), was besser ist als etwa die Hälfte des Arrays im Mittel N-mal zu kopieren (lineare Laufzeit).

source: **Get, Set:** Fastest *by position*. E.g. can request 0th, 2nd, 10th record, etc. but cannot specify which record you want.
de: **Get, Set:** Am schnellsten *nach Position*. Sie können z. B. den nullten, zweiten, zehnten Datensatz usw. anfordern, aber nicht angeben, welchen Eintrag Sie wünschen.

source: Op: 1 addition operation from array start position up to desired index.
de: Verfahren: 1 Additionsoperation um von der Startposition des Arrays zum gewünschten Index zu gelangen.

source: **Find:** Slowest. Identifies the index/position of a value.
de: **Suchen:** Am langsamsten. Identifiziert den Index/die Position eines Wertes.

source: Op: Must iterate through array and compare values until one finds a match.
de: Verfahren: Muss das Array durchlaufen und Werte vergleichen, bis eine Übereinstimmung gefunden wird.

source: Performance is also dependent on whether one needs an exhaustive search.
de: Die Performance hängt auch davon ab, ob eine vollständige Suche erforderlich ist.

source: If kept ordered, custom search operations can bring it to logarithmic time (relatively fast). Laymen users won't be comfortable with this though. Done by re-sorting the Array after every edit and writing an ordered-aware search algorithm.
de: Bei sortierten Datentypen können Suchvorgänge eine logarithmische Laufzeit erreichen (relativ schnell). Laien werden sich damit jedoch nicht wohl fühlen. Wird umgesetzt indem das Array nach jeder Bearbeitung neu sortiert und ein spezieller Suchalgorithmus für sortierte Datentypen geschrieben wird.

source: Godot implements Dictionary as an ``OrderedHashMap<Variant, Variant>``. The engine stores a small array (initialized to 2^3 or 8 records) of key-value pairs. When one attempts to access a value, they provide it a key. It then *hashes* the key, i.e. converts it into a number. The "hash" is used to calculate the index into the array. As an array, the OHM then has a quick lookup within the "table" of keys mapped to values. When the HashMap becomes too full, it increases to the next power of 2 (so, 16 records, then 32, etc.) and rebuilds the structure.
de: Godot implementiert Dictionary als ``OrderedHashMap<Variant, Variant>``. Die Engine speichert ein kleines Array (initialisiert mit 2^3, also 8 Datensätzen) von Key-Value-Paaren. Wenn man versucht, auf einen Value zuzugreifen, verwendet man einen Key. Das Dictionary *hasht* dann den Key, d. h. wandelt ihn in eine Zahl um. Der "Hash" wird verwendet, um den Index im Array zu berechnen. Als Array hat das OHM dann einen schnellen Zugriff auf die "Tabelle" der Keys, die den Values zugeordnet sind. Wenn die HashMap zu voll wird, vergrößert sie sich auf die nächste Zweierpotenz (also 16 Datensätze, dann 32 usw.) und baut die Struktur neu auf.

source: Hashes are to reduce the chance of a key collision. If one occurs, the table must recalculate another index for the value that takes the previous position into account. In all, this results in constant-time access to all records at the expense of memory and some minor operational efficiency.
de: Hashes sollen die Wahrscheinlichkeit einer Key-Kollision verringern. In diesem Fall muss die Tabelle einen anderen Index für den Value neu berechnen, der die vorherige Position berücksichtigt. Insgesamt führt dies zu einem zeitlich konstanten Zugriff auf alle Datensätze auf Kosten des Speichers und eines kleinen Teils der operativen Effizienz.

source: Hashing every key an arbitrary number of times.
de: Jeden Key beliebig oft hashen.

source: Hash operations are constant-time, so even if an algorithm must do more than one, as long as the number of hash calculations doesn't become too dependent on the density of the table, things will stay fast. Which leads to...
de: Hash-Operationen sind zeitlich konstant, d.h. selbst wenn ein Algorithmus mehr als eine Hash-Berechnung durchführen muss, bleibt alles schnell, solange die Anzahl der Hash-Berechnungen nicht zu stark von der Dichte der Tabelle abhängt. Das führt zu...

source: Maintaining an ever-growing size for the table.
de: Organisation einer ständig wachsenden Tabelle.

source: HashMaps maintain gaps of unused memory interspersed in the table on purpose to reduce hash collisions and maintain the speed of accesses. This is why it constantly increases in size quadratically by powers of 2.
de: HashMaps behalten absichtlich nicht genutzten Speicherlücken in der Tabelle bei, um Hash-Kollisionen zu reduzieren und die Zugriffsgeschwindigkeit niedrig zu halten. Deshalb vergrößert sie sich ständig quadratisch in Zweierpotenzen.

source: As one might be able to tell, Dictionaries specialize in tasks that Arrays do not. An overview of their operational details is as follows:
de: Wie man vielleicht erkennen kann, sind Dictionaries auf Aufgaben spezialisiert, für die sich Arrays nicht gut eignen. Nachfolgend sehen Sie eine Übersicht über ihre Details ihrer Vorgehensweisen:

source: **Iterate:** Fast.
de: **Iterieren:** Schnell.

source: Op: Iterate over the map's internal vector of hashes. Return each key. Afterwards, users then use the key to jump to and return the desired value.
de: Verfahren: Iteriert über den internen Hash-Vektor der Map. Gibt jeden Key zurück. Anschließend nutzen Anwender den Key, springen mit ihm zum gewünschten Value und geben ihn zurück.

source: **Insert, Erase, Move:** Fastest.
de: **Einfügen, Entfernen, Verschieben:** Am schnellsten.

source: Op: Hash the given key. Do 1 addition operation to look up the appropriate value (array start + offset). Move is two of these (one insert, one erase). The map must do some maintenance to preserve its capabilities:
de: Verfahren: Hasht den übergebenen Key. Führt eine Additionsoperation aus, um den entsprechenden Value zu ermitteln (Array-Start + Offset). Verschieben besteht aus zwei Operationen (einmal einfügen, einmal entfernen). Die Map muss einige Wartungsarbeiten durchführen, um ihre Funktionalität aufrechtzuerhalten:

source: update ordered List of records.
de: Aktualisieren der sortierten Liste von Einträgen.

source: determine if table density mandates a need to expand table capacity.
de: Bestimmen, ob die Tabellendichte eine Erweiterung der Tabellengröße erfordert.

source: The Dictionary remembers in what order users inserted its keys. This enables it to execute reliable iterations.
de: Das Dictionary merkt sich, in welcher Reihenfolge Benutzer ihre Keys eingegeben haben. Dies ermöglicht es, zuverlässige Iterationen auszuführen.

source: **Get, Set:** Fastest. Same as a lookup *by key*.
de: **Get, Set:** Am schnellsten. Dieselbe wie eine Suche *nach Key*.

source: Op: Same as insert/erase/move.
de: Op: Dieselbe wie einfügen/entfernen/verschieben.

source: **Find:** Slowest. Identifies the key of a value.
de: **Suchen:** Am langsamsten. Identifiziert den Key eines Values.

source: Op: Must iterate through records and compare the value until a match is found.
de: Verfahren: Muss Datensätze durchlaufen und den Value vergleichen, bis eine Übereinstimmung gefunden wird.

source: Note that Godot does not provide this feature out-of-the-box (because they aren't meant for this task).
de: Beachten Sie, dass Godot dieses Feature nicht standardmäßig bereitstellt (da sie nicht für diese Aufgabe vorgesehen sind).

source: Godot implements Objects as stupid, but dynamic containers of data content. Objects query data sources when posed questions. For example, to answer the question, "do you have a property called, 'position'?", it might ask its :ref:`script <class_Script>` or the :ref:`ClassDB <class_ClassDB>`. One can find more information about what objects are and how they work in the :ref:`doc_what_are_godot_classes` article.
de: Godot implementiert Objekte als dumme, aber dynamische Container mit Dateninhalten. Objekte fragen Datenquellen ab, wenn ihnen Fragen gestellt werden. Um beispielsweise die Frage "Hast Du eine Eigenschaft namens 'position'?" zu beantworten, frage es möglicherweise sein :ref:`Skript <class_Script>` oder die :ref:`ClassDB <class_ClassDB>`. Weitere Informationen darüber, was Objekte sind und wie sie funktionieren, finden Sie im Artikel :ref:`doc_what_are_godot_classes`.

source: The important detail here is the complexity of the Object's task. Every time it performs one of these multi-source queries, it runs through *several* iteration loops and HashMap lookups. What's more, the queries are linear-time operations dependent on the Object's inheritance hierarchy size. If the class the Object queries (its current class) doesn't find anything, the request defers to the next base class, all the way up until the original Object class. While these are each fast operations in isolation, the fact that it must make so many checks is what makes them slower than both of the alternatives for looking up data.
de: Das wichtige Detail hierbei ist die Komplexität der Aufgabe des Objekts. Jedes Mal, wenn es eine dieser Anfragen an mehrere Quellen ausführt, werden *mehrere* Iterationsschleifen und HashMap-Lookups durchlaufen. Darüber hinaus handelt es sich bei den Anfragen um Operationen mit linearer Laufzeit, die von der Größe der Vererbungshierarchie des Objekts abhängen. Wenn die Klasse, die das Objekt abfragt (seine aktuelle Klasse), nichts findet, wird die Anforderung zur nächsten Basisklasse verschoben, bis hin zur ursprünglichen Object-Klasse. Dies sind zwar für sich genommen schnelle Operationen, aber die Tatsache, dass es so viele Überprüfungen durchführen muss, macht sie langsamer als die beiden Alternativen zum Nachschlagen von Daten.

source: When developers mention how slow the scripting API is, it is this chain of queries they refer to. Compared to compiled C++ code where the application knows exactly where to go to find anything, it is inevitable that scripting API operations will take much longer. They must locate the source of any relevant data before they can attempt to access it.
de: Wenn Entwickler erwähnen, wie langsam die Skript-API ist, beziehen sie sich auf diese Kette von Abfragen. Im Vergleich zu kompiliertem C++ - Code, bei dem die Anwendung genau weiß, wo sie etwas finden muss, ist es unvermeidlich, dass Skript-API-Vorgänge viel länger dauern. Sie müssen die Quelle aller relevanten Daten lokalisieren, bevor sie versuchen können, darauf zuzugreifen.

source: The reason GDScript is slow is because every operation it performs passes through this system.
de: Der Grund warum GDScript langsam ist, liegt darin, dass jede von ihm ausgeführte Operation dieses System durchläuft.

source: C# can process some content at higher speeds via more optimized bytecode. But, if the C# script calls into an engine class' content or if the script tries to access something external to it, it will go through this pipeline.
de: C# kann einige Inhalte mit höherer Geschwindigkeit über einen optimierten Bytecode verarbeiten. Wenn das C#-Skript jedoch den Inhalt einer Engine-Klasse aufruft oder wenn das Skript versucht, auf etwas außerhalb zuzugreifen, durchläuft es diese Pipeline.

source: NativeScript C++ goes even further and keeps everything internal by default. Calls into external structures will go through the scripting API. In NativeScript C++, registering methods to expose them to the scripting API is a manual task. It is at this point that external, non-C++ classes will use the API to locate them.
de: NativeScript C++ geht noch weiter und hält standardmäßig alles intern. Aufrufe externer Strukturen werden über die Skript-API durchgeführt. In NativeScript C++ ist das Registrieren von Methoden, um sie für die Skript-API verfügbar zu machen, eine manuelle Aufgabe. Zu diesem Zeitpunkt verwenden externe Nicht-C++ - Klassen die API, um sie zu lokalisieren.

source: So, assuming one extends from Reference to create a data structure, like an Array or Dictionary, why choose an Object over the other two options?
de: Angenommen, man leitet von Reference ab, um eine Datenstruktur wie ein Array oder ein Dictionary zu erstellen, warum sollte man dann ein Objekt gegenüber den beiden anderen Optionen auswählen?

source: **Control:** With objects comes the ability to create more sophisticated structures. One can layer abstractions over the data to ensure the external API doesn't change in response to internal data structure changes. What's more, Objects can have signals, allowing for reactive behavior.
de: **Kontrolle:** Mit Objekten ist die Möglichkeit verbunden, komplexere Strukturen zu erstellen. Man kann Abstraktionen über die Daten legen, um sicherzustellen, dass sich die externe API nicht als Reaktion auf interne Datenstrukturänderungen ändert. Darüber hinaus können Objekte Signale haben, die reaktives Verhalten ermöglichen.

source: **Clarity:** Objects are a reliable data source when it comes to the data that scripts and engine classes define for them. Properties may not hold the values one expects, but one doesn't need to worry about whether the property exists in the first place.
de: **Klarheit:** Objekte sind eine zuverlässige Datenquelle, wenn es um die Daten geht, die Skripte und Engine-Klassen für sie definieren. Propertys enthalten möglicherweise nicht die erwarteten Werte, aber Sie müssen sich keine Gedanken darüber machen, ob die Property überhaupt vorhanden ist.

source: **Convenience:** If one already has a similar data structure in mind, then extending from an existing class makes the task of building the data structure much easier. In comparison, Arrays and Dictionaries don't fulfill all use cases one might have.
de: **Bequemlichkeit:** Wenn jemand bereits eine ähnliche Datenstruktur im Sinn hat, erleichtert das Erweitern einer vorhandenen Klasse das Erstellen der Datenstruktur erheblich. Im Vergleich dazu erfüllen Arrays und Dictionarys nicht alle Anwendungsfälle.

source: Objects also give users the opportunity to create even more specialized data structures. With it, one can design their own List, Binary Search Tree, Heap, Splay Tree, Graph, Disjoint Set, and any host of other options.
de: Objekte ermöglichen es Nutzern, spezialisierte Datenstrukturen zu erstellen. Damit können eigene Listen, Binäre Suchbäume, Heaps, Splay Trees, Graphen, Disjoint Sets und vieles mehr erstellt werden.

source: "Why not use Node for tree structures?" one might ask. Well, the Node class contains things that won't be relevant to one's custom data structure. As such, it can be helpful to construct one's own node type when building tree structures.
de: Man könnte fragen: "Warum nimmt man keine Nodes für Baumstrukturen?" - Nun, die Node-Klasse enthält Dinge, die für spezialisierte Datenstrukturen unnötig sind, und als solches könnte es nützlich sein, einen eigenen Node-Typ für Baumstrukturen zu definieren.

source: From here, one can then create their own structures with specific features, limited only by their imagination.
de: Daher kann nun jede erdenkliche Art von spezialisierten Strukturen erstellt werden.

source: Enumerations: int vs. string
de: Enumerationen: int vs. string

source: Most languages offer an enumeration type option. GDScript is no different, but unlike most other languages, it allows one to use either integers or strings for the enum values (the latter only when using the ``export`` keyword in GDScript). The question then arises, "which should one use?"
de: Die meisten Programmiersprachen bieten einen Enumerationstypen an. So auch GDScript, aber anders als die meisten anderen Sprachen erlaubt es, Integer-Zahlen oder Strings als Enum-Werte zu nutzen (letzteres nur, wenn das ``export`` Schlüsselwort in GDScript verwendet wird). Doch dann stellt sich die Frage: "Welches sollte man nehmen?"

source: The short answer is, "whichever you are more comfortable with." This is a feature specific to GDScript and not Godot scripting in general; The languages prioritizes usability over performance.
de: Die kurze Antwort wäre "was auch immer Ihnen mehr liegt". Das ist ein spezielles Merkmal, das nur GDScript hat, und nicht Godot-Skripte im Allgemeinen; GDScript gewichtet Nutzbarkeit höher als Geschwindigkeit.

source: On a technical level, integer comparisons (constant-time) will happen faster than string comparisons (linear-time). If one wants to keep up other languages' conventions though, then one should use integers.
de: Auf technischer Ebene sind Integer-Vergleiche (konstante Laufzeit) schneller als Stringvergleiche (lineare Laufzeit). Wenn man jedoch die Konventionen anderer Programmiersprachen einhalten will, sollte man Integer verwenden.
