Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/logic_preferences.po
Languages: de

source: Logic preferences
de: Logik-Präferenzen

source: Ever wondered whether one should approach problem X with strategy Y or Z? This article covers a variety of topics related to these dilemmas.
de: Haben Sie sich jemals gefragt, ob man sich Problem X mit Strategie Y oder Z nähern sollte? Dieser Artikel behandelt eine Vielzahl von Themen im Zusammenhang mit diesen Dilemmas.

source: Adding nodes and changing properties: which first?
de: Nodes hinzufügen und Propertys bearbeiten: Welches zuerst?

source: When initializing nodes from a script at runtime, you may need to change properties such as the node's name or position. A common dilemma is, when should you change those values?
de: Wenn Sie Nodes zur Laufzeit aus einem Skript initialisieren, müssen Sie möglicherweise Propertys wie den Namen oder die Position des Nodes ändern. Ein häufiges Dilemma ist die Frage, wann Sie diese Werte ändern sollten.

source: It is the best practice to change values on a node before adding it to the scene tree. Some property's setters have code to update other corresponding values, and that code can be slow! For most cases, this code has no impact on your game's performance, but in heavy use cases such as procedural generation, it can bring your game to a crawl.
de: Es ist bewährte Praxis, Werte an einem Node zu ändern, bevor man ihn zum Szenenbaum hinzufügt. Die Setter einiger Propertys enthalten Code, um andere entsprechende Werte zu aktualisieren, und dieser Code kann langsam sein! In den meisten Fällen hat dieser Code keinen Einfluss auf die Performance Ihres Spiels, aber in schweren Anwendungsfällen wie der prozeduralen Generierung kann er Ihr Spiel zum Stillstand bringen.

source: For these reasons, it is always a best practice to set the initial values of a node before adding it to the scene tree.
de: Aus diesen Gründen ist es immer bewährte Praxis, die Anfangswerte eines Nodes festzulegen, bevor er dem Szenenbaum hinzugefügt wird.

source: Loading vs. preloading
de: Load vs. Preload

source: In GDScript, there exists the global :ref:`preload <class_@GDScript_method_preload>` method. It loads resources as early as possible to front-load the "loading" operations and avoid loading resources while in the middle of performance-sensitive code.
de: In GDScript gibt es die globale Methode :ref:`preload <class_@GDScript_method_preload>`. Sie lädt Ressourcen so früh wie möglich um die "Lade"-Operationen im Voraus zu auszuführen und somit das Laden von Ressourcen inmitten von leistungsintensivem Code zu vermeiden.

source: Its counterpart, the :ref:`load <class_@GDScript_method_load>` method, loads a resource only when it reaches the load statement. That is, it will load a resource in-place which can cause slowdowns when it occurs in the middle of sensitive processes. The ``load()`` function is also an alias for :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>` which is accessible to *all* scripting languages.
de: Ihr Gegenstück, die Methode :ref:`load <class_@GDScript_method_load>`, lädt eine Ressource erst, wenn sie die Ladeanweisung erreicht. Das heißt, sie lädt eine Ressource "in-place", was zu Verlangsamungen führen kann, wenn dies mitten in empfindlichen Prozessen geschieht. Die Funktion ``load()`` ist auch ein Alias für :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>`, der für *alle* Skriptsprachen zugänglich ist.

source: So, when exactly does preloading occur versus loading, and when should one use either? Let's see an example:
de: Wann genau erfolgt das Preloading im Vergleich zum Loading und wann sollte man welches davon verwenden? Sehen wir uns ein Beispiel an:

source: Preloading allows the script to handle all the loading the moment one loads the script. Preloading is useful, but there are also times when one doesn't wish for it. To distinguish these situations, there are a few things one can consider:
de: Durch das Preloading kann das Skript den gesamten Ladevorgang in dem Moment ausführen, in dem das Skript selbst geladen wird. Das Preloading ist nützlich, aber es gibt auch Zeiten, in denen man es nicht wünscht. Um diese Situationen zu unterscheiden, gibt es einige Dinge, die man berücksichtigen kann:

source: If one cannot determine when the script might load, then preloading a resource, especially a scene or script, could result in further loads one does not expect. This could lead to unintentional, variable-length load times on top of the original script's load operations.
de: Wenn man nicht bestimmen kann, wann das Skript geladen wird, so wird das Preloading einer Ressource, insbesondere einer Szene oder eines Skripts, eventuell zu weiteren Ladevorgängen führen, die man nicht erwartet. Daraus können unbeabsichtigte Ladezeiten unterschiedlicher Länge zusätzlich zu den Ladevorgängen des ursprünglichen Skripts entstehen.

source: If something else could replace the value (like a scene's exported initialization), then preloading the value has no meaning. This point isn't a significant factor if one intends to always create the script on its own.
de: Wenn etwas anderes den Wert ersetzen könnte (wie die exportierte Initialisierung einer Szene), hat das Preloading des Werts keine Bedeutung. Dieser Punkt ist nicht von Bedeutung, wenn man beabsichtigt, das Skript immer selbst zu erstellen.

source: If one wishes only to 'import' another class resource (script or scene), then using a preloaded constant is often the best course of action. However, in exceptional cases, one may wish not to do this:
de: Wenn man nur eine andere Klassenressource (Skript oder Szene) "importieren" möchte, ist die Verwendung einer vorher geladenen Konstante oft die beste Vorgehensweise. In Ausnahmefällen sollte man dies jedoch nicht tun:

source: If the 'imported' class is liable to change, then it should be a property instead, initialized either using an ``export`` or a ``load()`` (and perhaps not even initialized until later).
de: Wenn sich die 'importierte' Klasse ändern kann, dann sollte sie stattdessen eine Property sein, die entweder mit ``export`` oder ``load()`` initialisiert wird (und vielleicht sogar erst später initialisiert wird).

source: If the script requires a great many dependencies, and one does not wish to consume so much memory, then one may wish to, load and unload various dependencies at runtime as circumstances change. If one preloads resources into constants, then the only way to unload these resources would be to unload the entire script. If they are instead loaded properties, then one can set them to ``null`` and remove all references to the resource entirely (which, as a :ref:`RefCounted <class_RefCounted>`-extending type, will cause the resources to delete themselves from memory).
de: Wenn das Skript sehr viele Abhängigkeiten erfordert und man nicht so viel Speicher verbrauchen möchte, kann man verschiedene Abhängigkeiten zur Laufzeit laden und entladen, wenn sich die Umstände ändern. Wenn man Ressourcen in Konstanten per Preloading lädt, wäre die einzige Möglichkeit, diese Ressourcen zu entladen, das Entladen des gesamten Skripts. Wenn es sich stattdessen um geladene Propertys handelt, kann man sie auf ``null`` setzen und alle Referenzen auf die Ressource vollständig entfernen (was bei Ressourcen als einem von :ref:`RefCounted <class_RefCounted>` abgeleiteten Typ dazu führt, dass sie sich selbst aus dem Speicher löschen).

source: Large levels: static vs. dynamic
de: Große Levels: statisch vs. dynamisch

source: If one is creating a large level, which circumstances are most appropriate? Should they create the level as one static space? Or should they load the level in pieces and shift the world's content as needed?
de: Welche Umstände sind am besten geeignet, wenn ein großes Level erstellt wird? Sollten sie das Level als einen statischen Raum erstellen? Oder sollten sie das Level in Stücken laden und den Inhalt der Welt nach Bedarf verschieben?

source: Well, the simple answer is, "when the performance requires it." The dilemma associated with the two options is one of the age-old programming choices: does one optimize memory over speed, or vice versa?
de: Nun, die einfache Antwort lautet: "wenn die Performance es erfordert". Das Dilemma, das mit den beiden Optionen verbunden ist, ist eine der uralten Programmierentscheidungen: Optimiert man den Speicher gegenüber der Laufzeit oder umgekehrt?

source: The naive answer is to use a static level that loads everything at once. But, depending on the project, this could consume a large amount of memory. Wasting users' RAM leads to programs running slow or outright crashing from everything else the computer tries to do at the same time.
de: Die naive Antwort besteht darin, eine statische Ebene zu verwenden, die alles auf einmal lädt. Dies kann jedoch je nach Projekt viel Speicherplatz beanspruchen. Die Vergeudung von Arbeitsspeicher führt dazu, dass Programme langsam laufen oder sogar abstürzen, weil sich der Computer gleichzeitig mit anderen Aufgaben beschäftigt.

source: No matter what, one should break larger scenes into smaller ones (to aid in reusability of assets). Developers can then design a node that manages the creation/loading and deletion/unloading of resources and nodes in real-time. Games with large and varied environments or procedurally generated elements often implement these strategies to avoid wasting memory.
de: Egal was passiert, man sollte größere Szenen in kleinere aufteilen (um die Wiederverwendbarkeit von Assets zu erleichtern). Entwickler können dann einen Node entwerfen, der das Erstellen/Laden und Löschen/Entladen von Ressourcen und Nodes in Echtzeit verwaltet. Spiele mit großen und unterschiedlichen Umgebungen oder prozedural generierten Elementen implementieren diese Strategien häufig, um Speicherverschwendung zu vermeiden.

source: On the flip side, coding a dynamic system is more complex, i.e. uses more programmed logic, which results in opportunities for errors and bugs. If one isn't careful, they can develop a system that bloats the technical debt of the application.
de: Auf der anderen Seite ist das entwickeln eines dynamischen Systems komplexer, d.h. es wird mehr programmierte Logik verwendet, was zu Fehlermöglichkeiten und Bugs führt. Wenn man nicht aufpasst, kann man ein System entwickeln, das die technischen Probleme der Anwendung weiter aufbläht.

source: As such, the best options would be...
de: Die besten Optionen wären demnach...

source: To use a static level for smaller games.
de: Statische Levels für kleinere Spiele zu verwenden.

source: If one has the time/resources on a medium/large game, create a library or plugin that can code the management of nodes and resources. If refined over time, so as to improve usability and stability, then it could evolve into a reliable tool across projects.
de: Wenn Sie die Zeit/Ressourcen für ein mittleres/großes Spiel haben, erstellen Sie eine Bibliothek oder ein Plugin, das die Verwaltung von Nodes und Ressourcen übernehmen kann. Wenn es im Laufe der Zeit verfeinert wird, um die Benutzerfreundlichkeit und Stabilität zu verbessern, könnte es sich projektübergreifend zu einem zuverlässigen Tool entwickeln.

source: Code the dynamic logic for a medium/large game because one has the coding skills, but not the time or resources to refine the code (game's gotta get done). Could potentially refactor later to outsource the code into a plugin.
de: Entwerfen Sie die dynamische Logik für ein mittleres/großes Spiel, wenn Sie über diese Programmierfähigkeiten verfügen, jedoch nicht über die Zeit oder die Ressourcen, um den Code zu verfeinern (das Spiel muss fertig werden). Dies könnte möglicherweise später umgestaltet werden, um den Code in ein Plugin auszulagern.

source: For an example of the various ways one can swap scenes around at runtime, please see the :ref:`"Change scenes manually" <doc_change_scenes_manually>` documentation.
de: Ein Beispiel für die verschiedenen Möglichkeiten, wie man Szenen zur Laufzeit austauschen kann, finden Sie in der Dokumentation :ref:`"Szenen manuell ändern" <doc_change_scenes_manually>`.

source: Translation status
de: Übersetzungsstatus
