Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scenes_versus_scripts.po
Languages: de

source: When to use scenes versus scripts
de: Wann Szenen, wann Skripte verwenden

source: We've already covered how scenes and scripts are different. Scripts define an engine class extension with imperative code, scenes with declarative code.
de: Wir haben bereits darüber gesprochen, was Szenen von Skripten unterscheidet. Skripte definieren eine Engine-Klassenerweiterung mit imperativem Code, Szenen mit deklarativem Code.

source: Each system's capabilities are different as a result. Scenes can define how an extended class initializes, but not what its behavior actually is. Scenes are often used in conjunction with a script, the scene declaring a composition of nodes, and the script adding behaviour with imperative code.
de: Die Fähigkeiten jedes Systems sind daher unterschiedlich. Szenen können definieren, wie eine erweiterte Klasse initialisiert wird, aber nicht, wie ihr Verhalten tatsächlich aussieht. Szenen werden oft in Verbindung mit einem Skript verwendet, wobei die Szene eine Komposition von Nodes deklariert und das Skript das Verhalten mit imperativem Code hinzufügt.

source: Anonymous types
de: Anonyme Typen

source: It *is* possible to completely define a scenes' contents using a script alone. This is, in essence, what the Godot Editor does, only in the C++ constructor of its objects.
de: Es ist tatsächlich möglich, den Inhalt einer Szene komplett in einem Skript zu definieren. Dies ist im Wesentlichen das, was der Godot-Editor tut, nur im C++-Konstruktor seiner Objekte.

source: But, choosing which one to use can be a dilemma. Creating script instances is identical to creating in-engine classes whereas handling scenes requires a change in API:
de: Aber die Wahl, welchen Inhalt davon man verwenden soll, kann ein Dilemma sein. Das Erstellen von Skript-Instanzen ist identisch mit dem Erstellen von In-Engine-Klassen, während die Handhabung von Szenen eine Änderung der API erfordert:

source: Also, scripts will operate a little slower than scenes due to the speed differences between engine and script code. The larger and more complex the node, the more reason there is to build it as a scene.
de: Außerdem werden Skripte aufgrund der Geschwindigkeitsunterschiede zwischen Engine- und Skriptcode etwas langsamer arbeiten als Szenen. Je größer und komplexer der Node ist, desto mehr Gründe gibt es, ihn als Szene zu bauen.

source: Named types
de: Benamnte Typen

source: Scripts can be registered as a new type within the editor itself. This displays it as a new type in the node or resource creation dialog with an optional icon. This way, the user's ability to use the script is much more streamlined. Rather than having to...
de: In einigen Fällen kann ein Benutzer ein Skript als neuen Typ im Editor selbst registrieren. Dadurch wird es als neuer Typ im Node- oder Ressourcenerstellungsdialog mit einem optionalen Icon angezeigt. Auf diese Weise wird die Verwendung des Skripts für den Benutzer wesentlich vereinfacht. Es ersetzt die folgenden Notwendigkeiten...

source: Know the base type of the script they would like to use.
de: Den Basistyp des Skript zu kennen, den man verwenden möchte.

source: Create an instance of that base type.
de: Eine Instanz dieses Basistyps zu erstellen.

source: Add the script to the node.
de: Das Skript dem Node hinzuzufügen.

source: With a registered script, the scripted type instead becomes a creation option like the other nodes and resources in the system. The creation dialog even has a search bar to look up the type by name.
de: Mit einem registrierten Skript wird der geskriptete Typ stattdessen zu einer Erstellungsoption wie die anderen Nodes und Ressourcen im System. Der Erstellungsdialog verfügt sogar über eine Suchleiste, über die der Typ anhand des Namens gesucht werden kann.

source: There are two systems for registering types:
de: Es gibt zwei Systeme für die Registrierung von Typen:

source: :ref:`Custom Types <doc_making_plugins>`
de: :ref:`Benutzerdefinierte Typen <doc_making_plugins>`

source: Editor-only. Typenames are not accessible at runtime.
de: Nur im Editor. Auf Typnamen kann zur Laufzeit nicht zugegriffen werden.

source: Does not support inherited custom types.
de: Unterstützt keine vererbten benutzerdefinierten Typen.

source: An initializer tool. Creates the node with the script. Nothing more.
de: Ein Initialisierungswerkzeug. Erstellt den Node mit dem Skript. Sonst nichts.

source: Editor has no type-awareness of the script or its relationship to other engine types or scripts.
de: Der Editor kennt weder den Typ des Skripts noch seine Beziehung zu anderen Enginetypen oder Skripten.

source: Allows users to define an icon.
de: Ermöglicht es Benutzern, ein Icon zu definieren.

source: Works for all scripting languages because it deals with Script resources in abstract.
de: Funktioniert für alle Skriptsprachen, da es sich um Skriptressourcen in abstrakter Sprache handelt.

source: Set up using :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
de: Einrichten mit :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.

source: :ref:`Script Classes <doc_gdscript_basics_class_name>`
de: :ref:`Skript-Klassen <doc_gdscript_basics_class_name>`

source: Editor and runtime accessible.
de: Zugreifbar im Editor und zur Laufzeit.

source: Displays inheritance relationships in full.
de: Zeigt Vererbungsbeziehungen komplett an.

source: Creates the node with the script, but can also change types or extend the type from the editor.
de: Erzeugt den Node mit dem Skript, kann aber auch Typen ändern oder den Typ vom Editor aus erweitern.

source: Editor is aware of inheritance relationships between scripts, script classes, and engine C++ classes.
de: Der Editor kennt die Vererbungsbeziehungen zwischen Skripten, Skriptklassen und Engine-C++ Klassen.

source: Engine developers must add support for languages manually (both name exposure and runtime accessibility).
de: Engine-Entwickler müssen die Unterstützung für Sprachen manuell hinzufügen (sowohl verfügbar machen von Namen als auch Zugriff zur Laufzeit).

source: Godot 3.1+ only.
de: Nur in Godot 3.1+ verfügbar.

source: The Editor scans project folders and registers any exposed names for all scripting languages. Each scripting language must implement its own support for exposing this information.
de: Der Editor scannt Projektordner und registriert alle offengelegten Namen für alle Skriptsprachen. Jede Skriptsprache muss ihre eigene Unterstützung für die Bereitstellung dieser Informationen implementieren.

source: Both methodologies add names to the creation dialog, but script classes, in particular, also allow for users to access the typename without loading the script resource. Creating instances and accessing constants or static methods is viable from anywhere.
de: Beide Methoden fügen dem Erstellungsdialog Namen hinzu, aber insbesondere Skriptklassen ermöglichen es dem Benutzer auch, auf den Typnamen zuzugreifen, ohne die Skriptressource zu laden. Das Erstellen von Instanzen und der Zugriff auf Konstanten oder statische Methoden ist von überall aus möglich.

source: With features like these, one may wish their type to be a script without a scene due to the ease of use it grants users. Those developing plugins or creating in-house tools for designers to use will find an easier time of things this way.
de: Mit Features wie diesen kann man sich wünschen, dass ihr Typ ein Skript ohne Szene ist, weil es den Benutzern eine einfache Bedienung ermöglicht. Diejenigen, die Plugins entwickeln oder eigene Tools für Designer erstellen, werden es auf diese Weise leichter haben.

source: On the downside, it also means having to use largely imperative programming.
de: Auf der anderen Seite bedeutet dies auch, dass eine weitgehend imperative Programmierung erforderlich ist.

source: Performance of Script vs PackedScene
de: Performance von Script vs PackedScene

source: One last aspect to consider when choosing scenes and scripts is execution speed.
de: Ein letzter Aspekt, der bei der Auswahl von Szenen und Skripten berücksichtigt werden muss, ist die Ausführungsgeschwindigkeit.

source: As the size of objects increases, the scripts' necessary size to create and initialize them grows much larger. Creating node hierarchies demonstrates this. Each Node's logic could be several hundred lines of code in length.
de: Mit zunehmender Größe der Objekte wird auch die notwendige Größe der Skripte zum Erstellen und Initialisieren der Objekte viel größer. Das Erstellen von Node-Hierarchien demonstriert dies. Die Logik eines jeden Nodes kann mehrere hundert Codezeilen lang sein.

source: The code example below creates a new ``Node``, changes its name, assigns a script to it, sets its future parent as its owner so it gets saved to disk along with it, and finally adds it as a child of the ``Main`` node:
de: Das folgende Codebeispiel erzeugt einen neuen ``Node``, ändert dessen Namen, weist ihm ein Skript zu, setzt seinen zukünftigen Parent als Eigentümer, so dass er zusammen mit diesem auf der Festplatte gespeichert wird, und fügt es schließlich als Child des ``Main``-Nodes hinzu:

source: Script code like this is much slower than engine-side C++ code. Each instruction makes a call to the scripting API which leads to many "lookups" on the back-end to find the logic to execute.
de: Skriptcode wie dieser ist viel langsamer als engineseitiger C++-Code. Jeder Befehl ruft die Skript-API auf, was zu vielen "Suchvorgängen" im Back-End führt, um die auszuführende Logik zu finden.

source: Scenes help to avoid this performance issue. :ref:`PackedScene <class_PackedScene>`, the base type that scenes inherit from, defines resources that use serialized data to create objects. The engine can process scenes in batches on the back-end and provide much better performance than scripts.
de: Szenen helfen, dieses Performance-Problem zu vermeiden. :ref:`PackedScene <class_PackedScene>`, der Basistyp, von dem Szenen erben, definiert Ressourcen, die serialisierte Daten zum Erstellen von Objekten verwenden. Die Engine kann Szenen als Bündel im Back-End verarbeiten und bietet eine viel bessere Performance als Skripte.

source: Conclusion
de: Fazit

source: In the end, the best approach is to consider the following:
de: Letztendlich ist es am besten, Folgendes zu berücksichtigen:

source: If one wishes to create a basic tool that is going to be re-used in several different projects and which people of all skill levels will likely use (including those who don't label themselves as "programmers"), then chances are that it should probably be a script, likely one with a custom name/icon.
de: Wenn man ein grundlegendes Werkzeug erstellen möchte, das in mehreren verschiedenen Projekten wiederverwendet wird und das wahrscheinlich von Menschen aller Fähigkeitsstufen verwendet wird (einschließlich derer, die sich nicht als "Programmierer" bezeichnen), dann sollte das wahrscheinlich ein Skript sein, am Besten eines mit einem benutzerdefinierten Namen/Symbol.

source: If one wishes to create a concept that is particular to their game, then it should always be a scene. Scenes are easier to track/edit and provide more security than scripts.
de: Wenn man ein Konzept erstellen möchte, das für sein Spiel spezifisch ist, sollte es immer eine Szene sein. Szenen sind einfacher zu verfolgen/zu bearbeiten und bieten mehr Sicherheit als Skripte.

source: If one would like to give a name to a scene, then they can still sort of do this by declaring a script class and giving it a scene as a constant. The script becomes, in effect, a namespace:
de: Wenn man einer Szene einen Namen geben möchte, kann man das immer noch tun, indem man eine Skriptklasse deklariert und ihr eine Szene als Konstante gibt. Das Skript wird sozusagen zu einem Namespace:

source: Translation status
de: Übersetzungsstatus
