Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scene_organization.po
Languages: de

source: The **imperative** solution: Use the ``top_level`` property for the :ref:`CanvasItem <class_CanvasItem_property_top_level>` or :ref:`Node3D <class_Node3D_property_top_level>` node. This will make the node ignore its inherited transform.
de: Die **imperative** Lösung: Verwenden Sie die Property ``top_level`` für den :ref:`CanvasItem <class_CanvasItem_property_top_level>`- oder :ref:`Node3D <class_Node3D_property_top_level>`-Node. Dies führt dazu, dass der Node seine geerbte Transformation ignoriert.

source: If building a networked game, keep in mind which nodes and gameplay systems are relevant to all players versus those just pertinent to the authoritative server. For example, users do not all need to have a copy of every players' "PlayerController" logic. Instead, they need only their own. As such, keeping these in a separate branch from the "world" can help simplify the management of game connections and the like.
de: Wenn Sie ein Netzwerkspiel erstellen, sollten Sie darauf achten, welche Nodes und Spielsysteme für alle Spieler relevant sind und welche nur für den steuernden Server. Zum Beispiel müssen nicht alle Benutzer eine Kopie der "PlayerController"-Logik jedes Spielers haben. Stattdessen benötigen sie nur ihre eigene. Wenn Sie diese in einem von "Welt" getrennten Zweig aufbewahren, können Sie die Verwaltung von Spielverbindungen und Ähnlichem vereinfachen.

source: The key to scene organization is to consider the SceneTree in relational terms rather than spatial terms. Are the nodes dependent on their parent's existence? If not, then they can thrive all by themselves somewhere else. If they are dependent, then it stands to reason that they should be children of that parent (and likely part of that parent's scene if they aren't already).
de: Der Schlüssel zur Organisation der Szene liegt darin, den Szenenbaum in relationalen Begriffen und nicht in räumlichen Begriffen zu betrachten. Sind die Nodes von der Existenz ihres Parent-Nodes abhängig? Wenn nicht, dann können sie ganz allein an anderer Stelle gedeihen. Wenn sie abhängig sind, dann ist es logisch, dass sie Child-Nodes dieses Parents sein sollten (und wahrscheinlich Teil der Szene dieses Parents, wenn sie es nicht schon sind).

source: Does this mean nodes themselves are components? Not at all. Godot's node trees form an aggregation relationship, not one of composition. But while one still has the flexibility to move nodes around, it is still best when such moves are unnecessary by default.
de: Bedeutet dies, dass die Nodes selbst Komponenten sind? Ganz und gar nicht. Die Node-Bäume von Godot bilden eine Aggregationsbeziehung, keine Kompositionsbeziehung. Man hat zwar immer noch die Flexibilität, Nodes zu verschieben, aber es ist immer noch am besten, wenn solche Verschiebungen im Normalfall unnötig sind.

source: Translation status
de: Übersetzungsstatus
