Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/version_control_systems.po
Languages: de

source: Version control systems
de: Versionsverwaltungssysteme

source: Introduction
de: Einführung

source: Godot aims to be VCS-friendly and generate mostly readable and mergeable files.
de: Godot strebt danach, VCS-freundlich zu sein und größtenteils lesbare und merge-bare Dateien zu generieren.

source: Version control plugins
de: Versionsverwaltungs-Plugins

source: Godot also supports the use of version control systems in the editor itself. However, version control in the editor requires a plugin for the specific VCS you're using.
de: Godot unterstützt auch die Verwendung von Versionsverwaltungssystemen im Editor selbst. Für die Versionsverwaltung im Editor ist jedoch ein Plugin für das von Ihnen verwendete VCS erforderlich.

source: As of July 2023, there is only a Git plugin available, but the community may create additional VCS plugins.
de: Stand Juli 2023 gibt es nur ein Git-Plugin, aber die Community könnte weitere VCS-Plugins erstellen.

source: Official Git plugin
de: Offizielles Git-Plugin

source: Using Git from inside the editor is supported with an official plugin. You can find the latest releases on `GitHub <https://github.com/godotengine/godot-git-plugin/releases>`__.
de: Die Verwendung von Git innerhalb des Editors wird von einem offiziellen Plugin unterstützt. Sie können die neuesten Versionen auf `GitHub <https://github.com/godotengine/godot-git-plugin/releases>`__ finden.

source: Documentation on how to use the Git plugin can be found on its `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
de: Die Dokumentation zur Verwendung des Git-Plugins finden Sie in seinem `Wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.

source: Files to exclude from VCS
de: Dateien, die von VCS ausgeschlossen werden sollen

source: This lists files and folders that should be ignored from version control in Godot 4.1 and later.
de: Seit Godot 4.1 sollten die hier aufgelisteten Dateien und Ordner von der Versionsverwaltung ausgeschlossen werden.

source: The list of files of folders that should be ignored from version control in Godot 3.x and Godot 4.0 is **entirely** different. This is important, as Godot 3.x and 4.0 may store sensitive credentials in ``export_presets.cfg`` (unlike Godot 4.1 and later).
de: Die Liste an Dateien und Ordnern, die von der Versionsverwaltung ausgeschlossen werden sollten, ist für Godot 3.x und Godot 4.0 **komplett** anders. Es ist wichtig, dies zu beachten, da Godot 3.x und 4.0 sensitive Zugangsdaten in ``export_presets.cfg`` speichern kann. (Seit Godot 4.1 ist das nicht mehr der Fall).

source: If you are using Godot 3, check the ``3.5`` version of this documentation page instead.
de: Wenn Sie Godot 3 verwenden, sehen Sie sich stattdessen die ``3.5``-Version dieser Dokumentationsseite an.

source: There are some files and folders Godot automatically creates when opening a project in the editor for the first time. To avoid bloating your version control repository with generated data, you should add them to your VCS ignore:
de: Godot generiert einige Ordner und Datein automatisch, wenn ein Projekt zum ersten Mal im Editor geöffnet wird. Um Ihr Versionsverwaltungs-Repository nicht mit diesen generierten Daten zu überfluten, sollten sie vom VCS ignoriert werden:

source: ``.godot/``: This folder stores various project cache data.
de: ``.godot/``: Dieser Ordner speichert unterschiedliche Projekt-Cache-Daten.

source: ``*.translation``: These files are binary imported :ref:`translations <doc_internationalizing_games>` generated from CSV files.
de: ``*.translation``: Diese Dateien sind binär importierte :ref:`Übersetzungen <doc_internationalizing_games>`, die aus CSV-Dateien erzeugt wurden.

source: You can make the Godot project manager generate version control metadata for you automatically when creating a project. When choosing the **Git** option, this creates ``.gitignore`` and ``.gitattributes`` files in the project root:
de: Der Godot-Projekmanager kann Versionsverwaltungs-Metadaten automatisch erstellen, wenn ein Projekt erstellt wird. Wird die Option **Git** gewählt, erstellt er ``.gitignore`` und ``.gitattributes``-Dateien im Stammverzeichnis des Projektes:

source: Creating version control metadata in the project manager's New Project dialog
de: Erstellen von Versionsverwaltungs-Metadaten im Neues Projekt-Dialog des Projektmanagers

source: Creating version control metadata in the project manager's **New Project** dialog
de: Erstellen von Versionsverwaltungs-Metadaten im **Neues Projekt**-Dialog des Projektmanagers

source: In existing projects, select the **Project** menu at the top of the editor, then choose **Version Control > Generate Version Control Metadata**. This creates the same files as if the operation was performed in the project manager.
de: Wählen Sie in bestehenden Projekten das Menü **Projekt** oben im Editor, und wählen Sie dann **Versionskontrolle > Versionsverwaltungs-Metadaten erstellen**. Dadurch werden die gleichen Dateien erstellt, wie wenn der Vorgang im Projektmanager durchgeführt worden wäre.

source: Working with Git on Windows
de: Mit Git unter Windows arbeiten

source: Most Git for Windows clients are configured with the ``core.autocrlf`` set to ``true``. This can lead to files unnecessarily being marked as modified by Git due to their line endings being converted from LF to CRLF automatically.
de: Die meisten Git-Clients für Windows sind mit der Einstellung ``core.autocrlf`` auf ``true`` konfiguriert. Dies kann dazu führen, dass Dateien unnötigerweise von Git als geändert markiert werden, da ihre Zeilenenden automatisch von LF in CRLF umgewandelt werden.

source: It is better to set this option as:
de: Es ist besser, diese Option einzustellen als:

source: Creating version control metadata using the project manager or editor will automatically enforce LF line endings using the ``.gitattributes`` file. In this case, you don't need to change your Git configuration.
de: Wenn Sie Metadaten für die Versionsverwaltung mit dem Projektmanager oder dem Editor erstellen, werden die LF-Zeilenenden automatisch in der Datei ``.gitattributes`` festgelegt. In diesem Fall brauchen Sie Ihre Git-Konfiguration nicht zu ändern.

source: Translation status
de: Übersetzungsstatus
