Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/what_are_godot_classes.po
Languages: de

source: Applying object-oriented principles in Godot
de: Anwendung objektorientierter Prinzipien in Godot

source: The engine offers two main ways to create reusable objects: scripts and scenes. Neither of these technically define classes under the hood.
de: Die Engine bietet im Wesentlichen zwei Wege zum Erstellen wiederverwendbarer Objekte: Skripte und Szenen. Streng genommen werden keine von beiden intern durch Klassen dargestellt.

source: Still, many best practices using Godot involve applying object-oriented programming principles to the scripts and scenes that compose your game. That is why it's useful to understand how we can think of them as classes.
de: Bei vielen bewährten Praktiken in Godot werden jedoch objektorientierte Programmierprinzipien auf die Skripte und Szenen angewendet, aus denen Ihr Spiel besteht. Deshalb ist es nützlich, zu verstehen, wie wir sie als Klassen betrachten können.

source: This guide briefly explains how scripts and scenes work in the engine's core to help you understand how they work under the hood.
de: In dieser Anleitung wird kurz erläutert, wie Skripte und Szenen im Kern der Engine funktionieren, damit Sie ein besseres Verständnis für ihre interne Funktionsweise erhalten.

source: How scripts work in the engine
de: Wie Skripte in der Engine funktionieren

source: The engine provides built-in classes like :ref:`Node <class_Node>`. You can extend those to create derived types using a script.
de: Die Engine bietet Built-in-Klassen wie :ref:`Node <class_Node>`. Sie können diese erweitern (englisch: extend), um mithilfe eines Skripts abgeleitete Typen zu erstellen.

source: These scripts are not technically classes. Instead, they are resources that tell the engine a sequence of initializations to perform on one of the engine's built-in classes.
de: Diese Skripte sind technisch gesehen keine Klassen. Stattdessen handelt es sich um Ressourcen, die der Engine eine Folge von Initialisierungen mitteilen, die dann auf einer der Built-in-Klassen ausgeführt werden sollen.

source: Godot's internal classes have methods that register a class's data with a :ref:`ClassDB <class_ClassDB>`. This database provides runtime access to class information. ``ClassDB`` contains information about classes like:
de: Die internen Klassen von Godot verfügen über Methoden, um die Daten einer Klasse in einer :ref:`ClassDB <class_ClassDB>` zu registrieren. Diese Datenbank bietet zur Laufzeit Zugriff auf Klasseninformationen. ``ClassDB`` enthält Informationen über Klassen, wie:

source: Properties.
de: Propertys.

source: Methods.
de: Methoden.

source: Constants.
de: Konstanten.

source: Signals.
de: Signale.

source: This ``ClassDB`` is what objects check against when performing an operation like accessing a property or calling a method. It checks the database's records and the object's base types' records to see if the object supports the operation.
de: In dieser ``ClassDB`` schauen Objekte nach, wenn sie eine Operation wie einen Zugriff auf eine Property oder den Aufruf einer Methode durchführen. Hier werden die Datensätze der Datenbank und die Datensätze der Basistypen des Objekts geprüft, um zu sehen, ob das Objekt die Operation unterstützt.

source: Attaching a :ref:`Script <class_Script>` to your object extends the methods, properties, and signals available from the ``ClassDB``.
de: Das Anhängen eines :ref:`Skripts <class_Script>` an Ihr Objekt erweitert die Methoden, Propertys und Signale, die über die ``ClassDB`` zur Verfügung stehen.

source: Even scripts that don't use the ``extends`` keyword implicitly inherit from the engine's base :ref:`RefCounted <class_RefCounted>` class. As a result, you can instantiate scripts without the ``extends`` keyword from code. Since they extend ``RefCounted`` though, you cannot attach them to a :ref:`Node <class_Node>`.
de: Auch Skripte, die das Schlüsselwort ``extends`` nicht verwenden, erben implizit von der Engine-Basisklasse :ref:`RefCounted <class_RefCounted>`. Deshalb können Sie Skripte ohne das Schlüsselwort ``extends`` im Code instanziieren. Da sie jedoch ``RefCounted`` erweitern, können Sie sie nicht an einen :ref:`Node <class_Node>` anhängen.

source: Scenes
de: Szenen

source: The behavior of scenes has many similarities to classes, so it can make sense to think of a scene as a class. Scenes are reusable, instantiable, and inheritable groups of nodes. Creating a scene is similar to having a script that creates nodes and adds them as children using ``add_child()``.
de: Das Verhalten von Szenen hat viele Ähnlichkeiten mit Klassen, so dass es sinnvoll sein kann, sich eine Szene als Klasse vorzustellen. Szenen sind wiederverwendbare, instanziierbare und vererbbare Gruppen von Nodes. Das Erzeugen einer Szene ist vergleichbar mit einem Skript, das Nodes erzeugt und sie mit ``add_child()`` als Child-Nodes hinzufügt.

source: We often pair a scene with a scripted root node that makes use of the scene's nodes. As such, the script extends the scene by adding behavior through imperative code.
de: Wir koppeln häufig eine Szene mit einem geskripteten Root-Node, der die Nodes der Szene verwendet. Somit erweitert das Skript die Szene, indem es neues Verhalten über imperativen Code hinzufügt.

source: The content of a scene helps to define:
de: Der Inhalt einer Szene hilft, zu definieren:

source: What nodes are available to the script.
de: Welche Nodes für das Skript verfügbar sind.

source: How they are organized.
de: Wie sie organisiert sind.

source: How they are initialized.
de: Wie sie initialisiert werden.

source: What signal connections they have with each other.
de: Welche Signalverbindungen sie miteinander haben.

source: Why is any of this important to scene organization? Because instances of scenes *are* objects. As a result, many object-oriented principles that apply to written code also apply to scenes: single responsibility, encapsulation, and others.
de: Warum ist irgendetwas davon für die Organisation der Szene wichtig? Weil Instanzen von Szenen *Objekte* sind. Infolgedessen gelten viele objektorientierte Prinzipien, die für geschriebenen Code gelten, auch für Szenen: Single Responsibility, Kapselung und andere.

source: The scene is *always an extension of the script attached to its root node*, so you can interpret it as part of a class.
de: Die Szene ist *immer eine Erweiterung des Skripts, das dem Root-Node angehängt ist*, also können Sie sie als Teil einer Klasse ansehen.

source: Most of the techniques explained in this best practices series build on this point.
de: Die meisten der Konzepte in dieser "bewährte Praktiken"-Artikelreihe bauen auf diesem Punkt auf.

source: Translation status
de: Übersetzungsstatus
