Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/building_the_manual.po
Languages: de, zh_cn, zh_tw

source: Building the manual with Sphinx
de: Erstellen des Handbuchs mit Sphinx
zh_cn: 使用 Sphinx 构建手册
zh_tw: 建置 Mono 執行環境

source: This page explains how to build a local copy of the Godot manual using the Sphinx docs engine. This allows you to have local HTML files and build the documentation as a PDF, EPUB, or LaTeX file, for example.
de: Auf dieser Seite wird erklärt, wie Sie eine lokale Kopie des Godot-Handbuchs mithilfe der Sphinx docs-Engine erstellen können. Dies ermöglicht Ihnen, lokale HTML-Dateien zu haben und die Dokumentation z.B. als PDF-, EPUB- oder LaTeX-Datei zu erstellen.
zh_cn: 本页面描述使用 Sphinx 文档引擎构建本地 Godot 手册的方法。你可以用它来获得本地的 HTML 文件以及诸如 PDF、EPUB、LaTeX 形式的文档。
zh_tw: 本頁面描述使用 Sphinx 文件引擎建構本地 Godot 手冊的方法。你可以用它來獲得本地的 HTML 檔以及諸如 PDF、EPUB、LaTeX 形式的文件。

source: Before you get started, make sure that you have:
de: Bevor Sie beginnen, vergewissern Sie sich, dass Sie diese Dinge haben:
zh_cn: 在开始之前，请确保你已完成以下步骤：
zh_tw: 在開始之前，請確保你已完成以下步驟：

source: `Git <https://git-scm.com/>`_
zh_tw: `GitHub <https://github.com/godotengine/>`_

source: `make <https://www.gnu.org/software/make/>`_ (unless you're using Windows)
de: `make <https://www.gnu.org/software/make/>`_ (sofern Sie nicht Windows verwenden)
zh_tw: `make <https://www.gnu.org/software/make/>`_ （除非你在使用Windows系統）

source: `Python <https://www.python.org/>`_ 3
zh_tw: `Python 3.5+ <https://www.python.org/>`__ 。

source: Python 3 should come with the ``pip3`` command. You may need to write ``python3 -m pip`` (Unix) or ``py -m pip`` (Windows) instead of ``pip3``. If both approaches fail, `make sure that you have pip3 installed <https://pip.pypa.io/en/stable/installation/>`__.
de: Python 3 sollte mit dem Befehl ``pip3`` ausgeliefert werden. Möglicherweise müssen Sie ``python3 -m pip`` (Unix) oder ``py -m pip`` (Windows) anstelle von ``pip3`` schreiben. Wenn beide Ansätze scheitern, `stellen Sie sicher, dass Sie pip3 installiert haben <https://pip.pypa.io/en/stable/installation/>`__.
zh_tw: Python 3 應該帶有 ``pip3`` 命令。 您可能需要輸入 ``python3 -m pip`` （Unix）或 ``py -m pip`` （Windows）而不是 ``pip3`` 。 如果兩種方法都失敗了，\\\\`請確保您已安裝 pip3 <https://pip.pypa.io/en/stable/installation/>`__\\\\。

source: *(Optional)* Set up a virtual environment. Virtual environments prevent potential conflicts between the Python packages in ``requirements.txt`` and other Python packages that are installed on your system.
de: *(Optional)* Richten Sie eine virtuelle Umgebung ein. Virtuelle Umgebungen verhindern mögliche Konflikte zwischen den Python-Paketen in ``requirements.txt`` und anderen Python-Paketen, die auf Ihrem System installiert sind.
zh_cn: *（可选）* 设置虚拟环境。 虚拟环境可防止 ``requirements.txt`` 中的 Python 包与系统上安装的其他 Python 包之间的潜在冲突。
zh_tw: *（可選）* 設定虛擬環境。 虛擬環境可防止 ``requirements.txt`` 中的 Python 包與系統上安裝的其他 Python 包之間的潛在衝突。

source: Create the virtual environment:
de: Erstellen Sie die virtuelle Umgebung:
zh_cn: 创建虚拟环境：
zh_tw: 設定自定建置環境

source: Other platforms
de: Andere Plattformen
zh_cn: 其他平台
zh_tw: 支援所有平台。

source: Activate the virtual environment:
de: Aktivieren Sie die virtuelle Umgebung:
zh_cn: 启动虚拟环境：
zh_tw: 設定自定建置環境

source: *(Optional)* Update pre-installed packages:
de: *(Optional)* Aktualisieren Sie vorinstallierte Pakete:
zh_cn: *（可选）* 更新预安装的软件包：
zh_tw: *（可選）* 更新預先安裝的套裝軟體：

source: Clone the docs repo:
de: Klonen Sie das Docs-Repository:
zh_cn: 克隆（clone）文档仓库：
zh_tw: 克隆（clone）文件倉庫：

source: Change directory into the docs repo:
de: Wechseln Sie in das Verzeichnis des Docs-Repository:
zh_cn: 将目录切换到文档仓库：
zh_tw: 將目錄切換到文件倉庫：

source: Install the required packages:
de: Installieren Sie die erforderlichen Pakete:
zh_tw: 安裝套件

source: Build the docs:
de: Erstellen Sie die Dokumente:
zh_cn: 构建文档：
zh_tw: 內建主題編輯器。

source: On Windows, that command will run ``make.bat`` instead of GNU Make (or an alternative).
de: Unter Windows wird dieser Befehl ``make.bat`` anstelle von GNU Make (oder einer Alternative) ausführen.
zh_cn: 在 Windows 上，该命令将运行 ``make.bat`` 而不是 GNU Make（或其他替代方案）。
zh_tw: 在 Windows 上，該命令將運作 ``make.bat`` 而不是 GNU Make（或其他替代方案）。

source: Alternatively, you can build the documentation by running the sphinx-build program manually:
de: Alternativ können Sie die Dokumentation auch erstellen, indem Sie das Programm sphinx-build manuell ausführen:
zh_cn: 或者你也可以手动调用 sphinx-build 程序来构建文档：
zh_tw: 或者你也可以手動呼叫 sphinx-build 程式來建構文件：

source: The compilation will take some time as the ``classes/`` folder contains hundreds of files. See :ref:`doc_building_the_manual:performance`.
de: Die Kompilierung wird einige Zeit dauern, da der Ordner ``classes/`` hunderte von Dateien enthält. Siehe :ref:`doc_building_the_manual:performance`.
zh_cn: 因为 ``classes/`` 文件夹里包含了上百个文件，所以编译的过程会花上一些时间。详见 :ref:`doc_building_the_manual:performance`。
zh_tw: 因為 ``classes/`` 資料夾裡包含了上百個檔，所以編譯的過程會花上一些時間。詳見 :ref:`doc_building_the_manual:performance`。

source: You can then browse the documentation by opening ``_build/html/index.html`` in your web browser.
de: Sie können dann die Dokumentation durchsuchen, indem Sie ``_build/html/index.html`` in Ihrem Webbrowser öffnen.
zh_cn: 完成后就可以在网页浏览器里打开 ``_build/html/index.html`` 查看文档了。
zh_tw: 完成後就可以在網頁瀏覽器裡打開 ``_build/html/index.html`` 查看文件了。

source: Dealing with errors
de: Umgang mit Fehlern
zh_cn: 处理错误
zh_tw: 設定為錯誤的警告

source: If you run into errors, you may try the following command:
de: Wenn Sie auf Fehler stoßen, können Sie den folgenden Befehl versuchen:
zh_cn: 如果你遇到了错误，可以试试以下命令：
zh_tw: 若要從 GitHub 上 Clone 你的 Fork，請使用下列指令：

source: If you get a ``MemoryError`` or ``EOFError``, you can remove the ``classes/`` folder and run ``make`` again. This will drop the class references from the final HTML documentation but will keep the rest intact.
de: Wenn Sie einen ``MemoryError`` oder ``EOFError`` erhalten, können Sie den Ordner ``classes/`` entfernen und ``make`` erneut starten. Dadurch werden die Klassenreferenzen aus der endgültigen HTML-Dokumentation entfernt, aber der Rest bleibt intakt.
zh_tw: 如果你遇到了 ``MemoryError`` 或者 ``EOFError``，可以把 ``classes/`` 資料夾刪除然後重新執行 ``make``。這樣會在最終的 HTML 文件中刪除類參考文件，其它內容還是一致的。

source: If you delete the ``classes/`` folder, do not use ``git add .`` when working on a pull request or the whole ``classes/`` folder will be removed when you commit. See `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ for more detail.
de: Wenn Sie den Ordner ``classes/`` löschen, verwenden Sie nicht ``git add``, wenn Sie an einem Pull Request arbeiten, sonst wird der gesamte Ordner ``classes/`` beim Commit entfernt. Siehe `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ für weitere Details.
zh_cn: 一旦删除 ``classes/`` 文件夹，在处理 Pull Request（拉取请求）时请勿使用 ``git add .``\ ，否则整个 ``classes/`` 文件夹的删除都会记录进你的提交之中。详情见 `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`\ 。
zh_tw: 一旦刪除 ``classes/`` 資料夾，在處理 Pull Request（拉取請求）時請勿使用 ``git add .``，否則整個 ``classes/`` 資料夾的刪除都會記錄進你的提交之中。詳情見 `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`。

source: Hints for performance
de: Hinweise zur Performance
zh_cn: 性能提示
zh_tw: 屬性目標中的效能提示

source: RAM usage
de: RAM-Verbrauch
zh_cn: 内存占用
zh_tw: 手動使用

source: Building the documentation requires at least 8 GB of RAM to run without disk swapping, which slows it down. If you have at least 16 GB of RAM, you can speed up compilation by running:
de: Das Erstellen der Dokumentation erfordert mindestens 8 GB RAM, um ohne Festplatten-Swapping zu laufen, was es verlangsamt. Wenn Sie mindestens 16 GB RAM haben, können Sie die Kompilierung beschleunigen, indem Sie folgendes ausführen:
zh_cn: 磁盘交换会拖慢文档构建的速度，关闭后需要至少 8 GB 的内存。如果你有至少 16 GB 的内存，可以这样加速编译：
zh_tw: 磁片交換會拖慢文件建構的速度，關閉後需要至少 8 GB 的記憶體。如果你有至少 16 GB 的記憶體，可以這樣加速編譯：

source: You can use ``-j auto`` to use all available CPU threads, but this can use a lot of RAM if you have a lot of CPU threads. For instance, on a system with 32 CPU threads, ``-j auto`` (which corresponds to ``-j 32`` here) can require 20+ GB of RAM for Sphinx alone.
de: Sie können ``-j auto`` verwenden, um alle verfügbaren CPU-Threads zu nutzen, aber dies kann eine Menge RAM verbrauchen, wenn Sie viele CPU-Threads haben. Auf einem System mit 32 CPU-Threads kann zum Beispiel ``-j auto`` (was hier ``-j 32`` entspricht) 20+ GB RAM allein für Sphinx benötigen.
zh_tw: 您可以使用 ``-j auto`` 來使用所有可用的 CPU 執行緒，但是如果您有很多 CPU 執行緒，這可能會使用大量 RAM。 例如，在具有 32 個 CPU 執行緒的系統上， ``-j auto`` （此處對應於 ``-j 32`` ）僅 Sphinx 就需要 20+ GB 的 RAM。

source: Specifying a list of files
de: Angeben einer Liste von Dateien
zh_cn: 指定文件列表
zh_tw: 提供檔案

source: You can specify a list of files to build, which can greatly speed up compilation:
de: Sie können eine Liste der zu erstellenden Dateien angeben, was die Kompilierung erheblich beschleunigen kann:
zh_tw: 你也可以指定需要建構的檔列表，大幅加速編譯：

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
