Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/contributing_to_the_documentation.po
Languages: de, zh_tw

source: Contributing to the documentation
de: Beitrag zur Dokumentation
zh_tw: 參與貢獻說明文件

source: This guide explains how to contribute to Godot's documentation, be it by writing or reviewing pages.
de: In dieser Anleitung wird erklärt, wie Sie zur Godot-Dokumentation beitragen können, sei es durch das Schreiben oder Überprüfen von Seiten.
zh_tw: 本指南介紹的是如何向 Godot 的文件做出貢獻，無論是編寫頁面還是審核頁面。

source: If you want to translate pages or the class reference from English to other languages, read :ref:`doc_editor_and_docs_localization`.
de: Wenn Sie Seiten oder die Klassenreferenz vom Englischen in andere Sprachen übersetzen wollen, lesen Sie :ref:`doc_editor_and_docs_localization`.
zh_tw: 如果你想要將頁面或類參考從英語翻譯為其他語言，請閱讀 :ref:`doc_editor_and_docs_localization`。

source: Getting started
de: Erste Schritte
zh_tw: 入門

source: To modify or create pages in the reference manual, you need to edit ``.rst`` files in the `godot-docs GitHub repository <https://github.com/godotengine/godot-docs>`_. Modifying those pages in a pull request triggers a rebuild of the online documentation upon merging.
de: Um Seiten im Referenzhandbuch zu ändern oder zu erstellen, müssen Sie die ``.rst``-Dateien im `godot-docs GitHub Repository <https://github.com/godotengine/godot-docs>`_ bearbeiten. Das Ändern dieser Seiten in einem Pull Request löst beim Mergen einen Rebuild der Online-Dokumentation aus.
zh_tw: 建立與編輯說明文件頁面通常是在 `godot-docs GitHub 儲存庫 <https://github.com/godotengine/godot-docs>`_ 中完成的。HTML (或 PDF 與 EPUB) 說明文件是由該儲存庫中的 .rst 檔 (reStructuredText 標記語言) 產生的。使用 PR (Pull Request) 修改這些頁面並合併後就會重建線上說明文件。

source: For details on Git usage and the pull request workflow, please refer to the :ref:`doc_pr_workflow` page. Most of what it describes regarding the main godotengine/godot repository is also valid for the docs repository.
de: Für Erläuterungen zum Umgang mit Git und dem Workflow beim Pull Request, sehen Sie sich die :ref:`doc_pr_workflow`-Seite an. Die meisten der dort für das godotengine/godot-Repository beschriebenen Schritte treffen ebenso auf das docs-Repository zu.
zh_tw: 有關詳細的 Git 使用方法與 PR 工作流程，請參考 :ref:`doc_pr_workflow` 一頁。該頁面中大部分關於 godotengine/godot 儲存庫的說明也適用於這個說明文件的儲存庫。

source: The class reference's source files are in the `Godot engine repository <https://github.com/godotengine/godot>`_. We generate the :ref:`Class Reference <doc_class_reference>` section of this documentation from them. If you want to update the description of a class, its methods, or properties, read :ref:`doc_updating_the_class_reference`.
de: Die Quelldateien der Klassenreferenz befinden sich im `Godot-Engine Repository <https://github.com/godotengine/godot>`_. Wir generieren den Abschnitt :ref:`Klassenreferenz <doc_class_reference>` dieser Dokumentation daraus. Wenn Sie die Beschreibung einer Klasse, ihrer Methoden oder Propertys aktualisieren wollen, lesen Sie :ref:`doc_updating_the_class_reference`.
zh_tw: 類參考的原始檔案位於 `Godot 引擎倉庫 <https://github.com/godotengine/godot>`_中。我們會用它來生成本文件的 :ref:`Godot API <toc-class-ref>` 章節。如果你想要更新類、方法、屬性等的描述資訊，請參閱 :ref:`doc_updating_the_class_reference`。

source: What is the Godot documentation
de: Was ist die Godot-Dokumentation
zh_tw: 什麼是Godot文檔

source: The Godot documentation is intended as a comprehensive reference manual for the Godot game engine. It is not meant to contain step-by-step tutorials, except for two game creation tutorials in the Getting Started section.
de: Die Godot-Dokumentation ist als umfassendes Referenzhandbuch für die Godot-Spielengine gedacht. Sie soll keine Schritt-für-Schritt-Tutorials enthalten, mit Ausnahme von zwei Tutorials zur Spielerstellung im Abschnitt "Erste Schritte".
zh_tw: Godot 文件旨在作為 Godot 遊戲引擎的完備參考手冊。除了“入門”章節的兩個遊戲製作教學之外，不包含漸進式教學。

source: We strive to write factual content in an accessible and well-written language. To contribute, you should also read:
de: Wir bemühen uns, sachliche Inhalte in einer verständlichen und gut geschriebenen Sprache zu verfassen. Um einen Beitrag zu leisten, lesen Sie bitte auch:
zh_tw: 我們致力於使用簡單通順的語言編寫實事求是的內容。投稿前請閱讀：

source: :ref:`doc_docs_writing_guidelines`. There, you will find rules and recommendations to write in a way that everyone understands.
de: :ref:`doc_docs_writing_guidelines`. Dort finden Sie Regeln und Empfehlungen, um so zu schreiben, dass es jeder versteht.
zh_tw: :ref:`doc_docs_writing_guidelines`。為了讓寫出的內容讓所有人都能夠理解，你可以在這裡找到相關的規定和建議。

source: :ref:`doc_content_guidelines`. They explain the principles we follow to write the documentation and the kind of content we accept.
de: :ref:`doc_content_guidelines`. Es erklärt die Grundsätze, die wir bei der Erstellung der Dokumentation befolgen, und die Art des Inhalts, die wir akzeptieren.
zh_tw: 內容規範。對我們在編寫文件時所遵循的原則進行了解釋，也解釋了我們接受哪些形式的內容。

source: Contributing changes
de: Änderungen beitragen
zh_tw: 參與貢獻程式碼

source: **Pull Requests should use the** ``master`` **branch by default.** Only make Pull Requests against other branches (e.g. ``2.1`` or ``3.0``) if your changes only apply to that specific version of Godot.
de: **Pull Requests sollten standardmäßig den** ``master``-**Branch verwenden.** Machen Sie nur Pull Requests gegen andere Branches (z.B. ``2.1`` oder ``3.0``), wenn Ihre Änderungen nur für diese spezielle Version von Godot gelten.
zh_tw: **拉取請求應該預設使用** ``master`` **分支。**請在修改只對特定版本的 Godot 有意義時，才針對其他分支（比如 ``2.1`` 或 ``3.0``）提交拉取請求。

source: Though less convenient to edit than a wiki, this Git repository is where we write the documentation. Having direct access to the source files in a revision control system is a plus to ensure our documentation quality.
de: Dieses Git-Repository ist zwar weniger bequem zu bearbeiten als ein Wiki, aber wir schreiben dort unsere Dokumentation. Der direkte Zugriff auf die Quelldateien in einem Revisionskontrollsystem ist ein Vorteil, um die Qualität unserer Dokumentation zu gewährleisten.
zh_tw: 雖然編輯器來不如百科方便，但是我們就是在這個 Git 倉庫中編寫文件的。可以在版本控制系統中直接存取原始檔案，對於保證我們文件的品質是有利的。

source: Editing existing pages
de: Vorhandene Seiten bearbeiten
zh_tw: 翻譯現有頁面

source: To edit an existing page, locate its ``.rst`` source file and open it in your favorite text editor. You can then commit the changes, push them to your fork, and make a pull request. **Note that the pages in** ``classes/`` **should not be edited here.** They are automatically generated from Godot's `XML class reference <https://github.com/godotengine/godot/tree/master/doc/classes>`__. See :ref:`doc_updating_the_class_reference` for details.
de: Um eine bestehende Seite zu bearbeiten, suchen Sie ihre ``.rst``-Quelldatei und öffnen Sie sie in Ihrem bevorzugten Texteditor. Sie können dann die Änderungen committen, sie auf Ihren Fork pushen und einen Pull Request stellen. **Beachten Sie, dass die Seiten in** ``classes/`` **hier nicht bearbeitet werden sollten.** Sie werden automatisch aus Godots `XML-Klassenreferenz <https://github.com/godotengine/godot/tree/master/doc/classes>`__ erzeugt. Siehe :ref:`doc_updating_the_class_reference` für Details.
zh_tw: 要編輯已有頁面，請先定位其 ``.rst`` 原始檔案並在你喜歡的文字編輯器中打開。然後你就可以將修改提交、推送到你的 Fork 中，然後建立拉取請求。**注意，請勿在此編輯** ``classes/`` **中的頁面。**它們是根據 Godot 的 `XML 類參考 <https://github.com/godotengine/godot/tree/master/doc/classes>`__自動生成的。詳情請參閱 :ref:`doc_updating_the_class_reference`。

source: To build the manual and test changes on your computer, see :ref:`doc_building_the_manual`.
de: Um das Handbuch zu erstellen und Änderungen auf Ihrem Computer zu testen, siehe :ref:`doc_building_the_manual`.
zh_tw: 要在你的電腦上建構手冊並測試修改，請參閱 :ref:`doc_building_the_manual`。

source: Editing pages online
de: Seiten online bearbeiten
zh_tw: 編輯動畫

source: You can edit the documentation online by clicking the **Edit on GitHub** link in the top-right of every page.
de: Sie können die Dokumentation online bearbeiten, indem Sie auf den Link **Edit on GitHub** in der oberen rechten Ecke jeder Seite klicken.
zh_tw: 點擊每一頁右上角的 **Edit on GitHub** 連結即可線上編輯該文件。

source: Doing so takes you to the GitHub text editor. You need to have a GitHub account and to log in to use it. Once logged in, you can propose change like so:
de: Auf diese Weise gelangen Sie zum GitHub-Texteditor. Sie müssen ein GitHub-Konto haben und sich anmelden, um ihn zu nutzen. Sobald Sie eingeloggt sind, können Sie Änderungen wie folgt vorschlagen:
zh_tw: 這樣你就會跳轉到 GitHub 文字編輯器，要擁有 GitHub 帳戶並登錄才能夠使用。登錄後，可以這樣提出修改方案：

source: Click the **Edit on GitHub** button.
de: Drücken Sie auf den **Edit on GitHub**-Button.
zh_tw: 點擊 **Edit on GitHub** 按鈕。

source: On the GitHub page you're taken to, click the pencil icon in the top-right corner near the **Raw**, **Blame**, and **Delete** buttons. It has the tooltip "Fork this project and edit the file".
de: Klicken Sie auf der GitHub-Seite, zu der Sie weitergeleitet werden, auf das Stift-Icon in der oberen rechten Ecke neben den Buttons **Raw**, **Blame** und **History**. Es hat den Quickinfo-Text "Fork this project and edit the file".
zh_tw: 在打開的 GitHub 頁面上，點擊右上角 **Raw**, **Blame** 與 **History** 按鈕附近的鉛筆圖示。這個圖示的工具提示顯示「Edit the file in a fork of this project」。

source: Edit the text in the text editor.
de: Bearbeiten Sie den Text mit dem Texteditor.
zh_tw: 在編輯器中執行腳本。

source: At the bottom of the web page, summarize the changes you made and click the button **Propose file change**. Make sure to replace the placeholder "Update file.rst" by a short but clear one-line description, as this is the commit title.
de: Fassen Sie unten auf der Webseite die von Ihnen vorgenommenen Änderungen zusammen und klicken Sie auf den Button **Propose file change**. Achten Sie darauf, den Platzhalter "Update file.rst" durch eine kurze, aber klare einzeilige Beschreibung zu ersetzen, da dies der Commit-Titel ist.
zh_tw: 請在網頁的底部總結你所作出的修改，然後按一下 **Propose file change**（提議修改檔）按鈕。請確保已經把占位的“Update file.rst”替換成了簡短的單行描述，因為這會成為提交的標題。

source: On the following screens, click the **Create pull request** button until you see a message like *Username wants to merge 1 commit into godotengine:master from Username:patch-1*.
de: Auf den folgenden Bildschirmen klicken Sie auf den **Create pull request**-Button, bis Sie eine Meldung wie *Username wants to merge 1 commit into godotengine:master from Username:patch-1* sehen.
zh_tw: 在下一個畫面中，點擊「Create pull request」按鈕，之後會看到類似 **Username wants to merge 1 commit into godotengine:master from Username:patch-6** 。

source: Another contributor will review your changes and merge them into the docs if they're good. They may also make changes or ask you to do so before merging.
de: Ein anderer Mitwirkender überprüft Ihre Änderungen und fügt sie in die Dokumente ein, wenn sie gut sind. Er kann auch Änderungen vornehmen oder Sie darum bitten, dies vor dem Mergen zu tun.
zh_tw: 接著會有審閱者確認你的更改，如果這些改動沒問題的話就會被合併回說明文件內。在修改被合併前，也有可能會被要求作出其他修改。

source: Adding new pages
de: Hinzufügen neuer Seiten
zh_tw: 新增新語言

source: Before adding a new page, please ensure that it fits in the documentation:
de: Bevor Sie eine neue Seite hinzufügen, vergewissern Sie sich bitte, dass sie in die Dokumentation passt:
zh_tw: 在新增新頁面之前，請確保它適合現有文件：

source: Look for `existing issues <https://github.com/godotengine/godot-docs/issues>`_ or open a new one to see if the page is necessary.
de: Suchen Sie nach `bestehenden Issues <https://github.com/godotengine/godot-docs/issues>`_ oder eröffnen Sie eine neue Issue, um zu sehen, ob die Seite notwendig ist.
zh_tw: 搜索`已有 Issue <https://github.com/godotengine/godot-docs/issues>`或者提交新 Issue，確認該頁面是必須的。

source: Ensure there isn't a page that already covers the topic.
de: Stellen Sie sicher, dass es keine Seite gibt, die das Thema bereits behandelt.
zh_tw: 確認目前不存在涉及該話題的頁面。

source: Read our :ref:`doc_content_guidelines`.
de: Lesen Sie :ref:`doc_content_guidelines`.
zh_tw: 閱讀我們的 :ref:`doc_content_guidelines`。

source: To add a new page, create a ``.rst`` file with a meaningful name in the section you want to add a file to, e.g. ``tutorials/3d/light_baking.rst``.
de: Um eine neue Seite hinzuzufügen, erstellen Sie eine ``.rst``-Datei mit einem aussagekräftigen Namen in dem Abschnitt, dem Sie eine Datei hinzufügen möchten, z.B. ``tutorials/3d/light_baking.rst``.
zh_tw: 要新增一個新頁面，請在想要的章節下建立一個 ``.rst`` 檔並起一個有意義的名字，例如 ``tutorials/3d/light_baking.rst``。

source: You should then add your page to the relevant "toctree" (table of contents, e.g. ``tutorials/3d/index.rst``). Add your new filename to the list on a new line, using a relative path and no extension, e.g. here ``light_baking``.
de: Sie sollten dann Ihre Seite in den entsprechenden "toctree" (Inhaltsverzeichnis, z.B. ``tutorials/3d/index.rst``) einfügen. Fügen Sie Ihren neuen Dateinamen in einer neuen Zeile in die Liste ein, wobei Sie einen relativen Pfad und keine Erweiterung verwenden, z.B. hier ``light_baking``.
zh_tw: 你應該將你的頁面加入相關的“toctree”（目錄，例如 ``tutorials/3d/index.rst``）。請將你的新檔案名加入目錄列表中，使用相對路徑，不要帶副檔名，例如 ``light_baking``。

source: Titles
de: Überschriften
zh_tw: 標題

source: Always begin pages with their title and a Sphinx reference name:
de: Fangen Sie jede Seite stets mit der Überschrift an und einer internen Bezeichnung für den Sphinx-Verweis:
zh_tw: 頁面應以頁面標題與 Sphinx 參照名稱開頭：

source: The reference ``_doc_insert_your_title_here`` and the title should match.
de: Die Referenz ``_doc_insert_your_title_here`` und der Titel sollten übereinstimmen.
zh_tw: 引用 ``_doc_insert_your_title_here`` 應該和標題相配對。

source: The reference allows linking to this page using the ``:ref:`` format, e.g. ``:ref:`doc_insert_your_title_here``` would link to the above example page (note the lack of leading underscore in the reference).
de: Die Referenz ermöglicht die Verknüpfung der Seite per ``:ref:``-Tag, so würde etwa ``:ref:`doc_insert_your_title_here``` auf die obige Beispielseite verlinken (man beachte den fehlenden Unterstrich im Verweis).
zh_tw: 可以使用 ``:ref:`` 格式來以參照名稱連結到該頁面，如 ``:ref:`doc_insert_your_title_here``` 會連結到上述範例頁面 (請注意參照中沒有最前面的底線)。

source: Write your titles like plain sentences, without capitalizing each word:
de: Schreiben Sie Ihre Titel wie einfache Sätze, ohne jedes Wort groß zu schreiben:
zh_tw: 請以普通句子的形式編寫標題，不要所有單詞都大寫：

source: **Good:** Understanding signals in Godot
de: **Gut:** Understanding signals in Godot
zh_tw: 使用程式碼來連接訊號

source: **Bad:** Understanding Signals In Godot
de: **Schlecht:** Understanding Signals In Godot
zh_tw: **欠佳：**Understanding Signals In Godot

source: Only propers nouns, projects, people, and node class names should have their first letter capitalized.
de: Nur bei Substantiven, Projekten, Personen und Node-Klassennamen sollte der erste Buchstabe groß geschrieben werden.
zh_tw: 只有專案、人名與節點類目名稱應首字母大寫。

source: Sphinx and reStructuredText syntax
de: Sphinx und reStructuredText-Syntax
zh_tw: Sphinx 與 reStructuredText 語法

source: Check Sphinx's `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ and the `official reference <https://docutils.sourceforge.net/rst.html>`__ for details on the syntax.
de: In der `reST-Einführung <https://www.sphinx-doc.org/en/stable/rest.html>`__ von Sphinx und der `offiziellen Referenz <https://docutils.sourceforge.net/rst.html>`__ finden Sie Details zur Syntax.
zh_tw: 語法詳情請查看 Sphinx 的 `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ 及其`官方參考手冊 <http://docutils.sourceforge.net/rst.html>`__。

source: Sphinx uses specific reST comments to do specific operations, like defining the table of contents (``.. toctree::``) or cross-referencing pages. Check the `official Sphinx documentation <https://www.sphinx-doc.org/en/stable/index.html>`__ for more details. To learn how to use Sphinx directives like ``.. note::`` or ``.. seealso::``, check out the `Sphinx directives documentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
de: Sphinx verwendet spezifische reST-Kommentare, um bestimmte Operationen auszuführen, wie die Definition des Inhaltsverzeichnisses (``.. toctree::``) oder Querverweise auf Seiten. Schauen Sie in die `offizielle Sphinx-Dokumentation <https://www.sphinx-doc.org/en/stable/index.html>`__ für weitere Details. Um zu lernen, wie man Sphinx-Direktiven wie ``.. note::`` oder ``.. seealso::`` benutzt, schauen Sie in die `Sphinx-Direktiven-Dokumentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
zh_tw: Sphinx 會利用特定的 reST 注釋來執行特定的操作，比如定義目錄（``.. toctree::``）或者進行頁面之間的交叉引用。詳情請查看 `Sphinx 官方文件 <https://www.sphinx-doc.org/en/stable/index.html>`__。要學習如何使用 ``.. note::``、``.. seealso::`` 等 Sphinx 指令，請查看 `Sphinx 指令文件 <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__。

source: Adding images and attachments
de: Hinzufügen von Bildern und Anhängen
zh_tw: 新增更多節點

source: To add images, please put them in an ``img/`` folder next to the ``.rst`` file with a meaningful name and include them in your page with:
de: Um Bilder hinzuzufügen, legen Sie sie bitte in einem ``img/``-Ordner neben der ``.rst``-Datei mit einem aussagekräftigen Namen ab und binden Sie sie mit in Ihre Seite ein:
zh_tw: 要新增圖片，請將它們放入 ``.rst`` 旁的 ``img/`` 目錄中，起一個有意義的名字，然後在頁面中加入：

source: Alternatively, you can use the `figure` directive, which gives the image a contrasting border and allows centering it on the page.
de: Alternativ können Sie die Direktive `figure` verwenden, die dem Bild einen kontrastierenden Rahmen verleiht und es auf der Seite zentriert.
zh_tw: 或者，你可以使用 `figure` 指令，該指令使圖像具有對比邊框並允許將其集中在頁面上。

source: You can also include attachments as support material for a tutorial, by placing them into a ``files/`` folder next to the ``.rst`` file, and using this inline markup:
de: Sie können auch Anhänge als Hilfsmaterial für ein Tutorial einfügen, indem Sie sie in einem ``files/``-Ordner neben der ``.rst``-Datei ablegen und dieses Inline-Markup verwenden:
zh_tw: 新增附件的操作也與之類似，比如新增作為教學支援材料的素材，就可以先將它們放入 ``.rst`` 檔旁的 ``files/`` 資料夾，然後使用這樣的行內標記：

source: Consider using the `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` repository for hosting support materials, such as project templates and asset packs. You can use a direct link to the generated archive from that repository with the regular link markup:
de: Ziehen Sie in Erwägung, das Repository `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` für die Bereitstellung von Support-Materialien wie Projektvorlagen und Asset Packs zu verwenden. Sie können einen direkten Link zu dem generierten Archiv aus diesem Repository mit dem regulären Link-Markup verwenden:
zh_tw: 考慮使用 `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` 來作為用於託管支援材料的儲存庫，例如專案範本和素材包。你可以使用常規連結標記使用直接連結到該倉庫中生成的存檔：

source: License
de: Lizenz
zh_tw: 授權條款

source: This documentation and every page it contains is published under the terms of the `Creative Commons Attribution 3.0 license (CC BY 3.0) <https://creativecommons.org/licenses/by/3.0/>`_, with attribution to "Juan Linietsky, Ariel Manzur and the Godot community".
de: Diese Dokumentation und alle darin enthaltenen Seiten werden unter den Bedingungen der `Creative Commons Attribution 3.0 license (CC BY 3.0) <https://creativecommons.org/licenses/by/3.0/>`_ veröffentlicht, mit Attribution an "Juan Linietsky, Ariel Manzur and the Godot community".
zh_tw: 這份文件以及其包含的所有頁面都是以創用 CC—姓名標示 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0>`_) 發表，作者請標示「Juan Linietsky, Ariel Manzur and the Godot community」。

source: By contributing to the documentation on the GitHub repository, you agree that your changes are distributed under this license.
de: Durch das Beitragen zu dieser Dokumentation im GitHub-Repository akzeptieren Sie die Veröffentlichung Ihrer Inhalte unter dieser Lizenz.
zh_tw: 一旦於該 GitHub 儲存庫中參與貢獻說明文件，你便同意以該授權條款發行你所做出的修改。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
