Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/content_guidelines.po
Languages: de, zh_tw

source: Content guidelines
de: Inhaltliche Leitlinien
zh_tw: 程式碼樣式方針

source: This document outlines what should be included in the official documentation. Below, you will find a couple of principles and recommendations for writing accessible content.
de: In diesem Dokument wird dargelegt, was in der offiziellen Dokumentation enthalten sein sollte. Im Folgenden finden Sie eine Reihe von Grundsätzen und Empfehlungen für die Erstellung barrierefreier Inhalte.
zh_tw: 本文件致力於説明大家評估哪些內容應該加入到官方文件中。你可以在下面找到一些關於如何編寫簡單易懂的內容的原則和建議。

source: We want to achieve two goals:
de: Wir wollen zwei Ziele erreichen:
zh_tw: 我們想實作兩個目標：

source: **Empathize with our users.** We should write in a way that makes it easy for them to learn from the docs.
de: **Sich in unsere Benutzer hineinversetzen**. Wir sollten so schreiben, dass es für die Benutzer einfach ist, aus den Dokumenten zu lernen.
zh_tw: **與使用者共情。**寫作時，應該讓通過文件來學習變得簡單。

source: **Write a complete reference manual**. Our goal here is not to teach programming fundamentals. Instead, our goal is to provide a reference for how Godot's features work.
de: **Ein vollständiges Referenzhandbuch schreiben**. Unser Ziel ist es nicht, Grundlagen des Programmierens zu vermitteln. Unser Ziel ist es vielmehr, eine Referenz für die Funktionsweise der Godot-Features zu erstellen.
zh_tw: **編寫完善的參考手冊**。我們這裡的目標不是教授程式設計的基礎知識。我們應該提供瞭解如何使用 Godot 功能的參考材料。

source: Guidelines and principles
de: Leitlinien und Grundsätze
zh_tw: 規範與原則

source: Below are the guidelines we should strive to follow. They are not hard rules, though: sometimes, a topic will require breaking one or more of them. Still, we should strive to achieve the two goals listed above.
de: Nachstehend finden Sie die Leitlinien, an die wir uns halten sollten. Sie sind jedoch keine festen Regeln: Manchmal erfordert ein Thema, dass man gegen eine oder mehrere von ihnen verstößt. Dennoch sollten wir uns bemühen, die beiden oben genannten Ziele zu erreichen.
zh_tw: 以下是我們應該努力遵守的規範。不過這些並不是硬性規定：特殊情況下，某個主題會需要打破這裡的若干規範。不過我們還是應該儘量完成上面所列出的兩個目標。

source: Writing complete and accessible documentation
de: Verfassen einer vollständigen und zugänglichen Dokumentation
zh_tw: 撰寫自定說明文件

source: **A feature doesn't exist unless it is documented**. If a user can't find information about a feature and how it works, it doesn't exist to them. We should ensure that we cover everything Godot does.
de: **Ein Feature existiert nicht, wenn es nicht dokumentiert ist**. Wenn ein Benutzer keine Informationen über ein Feature und seine Funktionsweise finden kann, ist es für ihn nicht existent. Wir sollten sicherstellen, dass wir alles abdecken, was Godot tut.
zh_tw: **功能在編寫文件前是不存在的**。如果使用者無法找到某個功能的資訊和用法，那麼這個功能對於他們就不存在。我們應該保證涉及到 Godot 的方方面面。

source: When adding or updating an engine feature, the documentation team needs to know about it. Contributors should open an issue on the `godot-docs` repository when their work gets merged and requires documentation.
de: Wenn ein Engine-Feature hinzugefügt oder aktualisiert wird, muss das Dokumentationsteam darüber informiert werden. Mitwirkende sollten eine Issue im `godot-docs`-Repository erstellen, wenn ihre Arbeit gemergt wird und Dokumentation benötigt.
zh_tw: 新增或更新引擎的功能時，文件團隊應該跟進。工作成果被合併後，如果需要文件，貢獻者應該在 `godot-docs` 倉庫建立 Issue。

source: Do your best to keep documents **under 1000 words in length**. If a page goes past that threshold, consider splitting it into two parts. Limiting page size forces us to write concisely and to break up large documents so that each page focuses on a particular problem.
de: Bemühen Sie sich, die Länge der Dokumente **unter 1000 Wörtern** zu halten. Wenn eine Seite diesen Umfang überschreitet, sollten Sie in Erwägung ziehen, sie in zwei Teile aufzuteilen. Die Begrenzung des Seitenumfangs zwingt uns dazu, prägnant zu schreiben und umfangreiche Dokumente so aufzuteilen, dass sich jede Seite auf ein bestimmtes Problem konzentriert.
zh_tw: 請竭盡所能將文件保持在**1000 個單詞以內**。如果頁面超過了這個閾值，如果可能，請考慮將它拆分成兩個部分。對頁面的大小作出限制，強制我們在寫作時保持簡潔，將大段的文件進行拆分可以讓每一部分都集中於某個特定的問題。

source: Each page or section of a page should clearly state what **problem** it tackles and what it will teach the user. Users need to know if they're reading the correct guide for solving the problems they're encountering. For example, instead of writing the heading "Signals", consider writing "Reacting to changes with signals". The second title makes it clear what the purpose of signals is.
de: Jede Seite oder jeder Abschnitt einer Seite sollte klar angeben, welches **Problem** sie behandelt und was sie dem Benutzer beibringen wird. Die Benutzer müssen wissen, ob sie die richtige Anleitung für die Lösung der Probleme lesen, auf die sie stoßen. Anstatt die Überschrift "Signale" zu schreiben, sollten Sie beispielsweise "Mit Signalen auf Veränderungen reagieren" schreiben. Der zweite Titel verdeutlicht den Zweck von Signalen.
zh_tw: 講清楚每個頁面或章節所針對的**問題**，以及使用者會學到什麼。使用者需要知道他們看的指南是否能夠正確解決他們所遇到的問題。例如，請不要在題目裡寫“Signals”（訊號），請考慮寫“Reacting to changes with signals”（使用訊號對變化作出回應）。後者標明了使用訊號的目的。

source: Long section titles lead to long entries in the side menu, which can make navigation cumbersome. Try to keep headings five words long or less.
de: Lange Abschnittsüberschriften führen zu langen Einträgen im Seitenmenü, was die Navigation umständlich machen kann. Versuchen Sie, die Überschriften auf maximal fünf Wörter zu beschränken.
zh_tw: 章節標題太長，側邊選單的專案就會變長，導覽也會變得冗長。請儘量讓題目保持在五個單詞以內。

source: If the page assumes specific knowledge of other Godot features, mention it and link to the corresponding documentation. For instance, a page about physics may use signals, in which case you could note that the signals tutorial is a prerequisite. You may also link to other websites for prerequisites beyond the documentation's scope. For example, you could link to an introduction to programming in the getting started guide, or a website that teaches math theory in the math section.
de: Wenn die Seite bestimmte Kenntnisse über andere Godot-Features voraussetzt, erwähnen Sie dies und verweisen Sie auf die entsprechende Dokumentation. Eine Seite über Physik könnte beispielsweise Signale verwenden. In diesem Fall könnten Sie darauf hinweisen, dass das Signaltutorial eine Voraussetzung ist. Sie können auch auf andere Websites verweisen, die über den Umfang der Dokumentation hinausgehen. Sie könnten zum Beispiel auf eine Einführung in die Programmierung in der „Erste Schritte“-Anleitung verweisen oder auf eine Website, die mathematische Theorien lehrt, im Abschnitt Mathematik.
zh_tw: 如果某個頁面假設讀者瞭解引擎的另一項功能，請在開頭給出介紹和能夠為使用者提供必要資訊的資源連結。如果先決條件不在文件的範疇內，你也可以連結到其他網站。例如在數學章節中，你可以連結到入門指南中的程式設計簡介章節，也可以連結到某個教授數學理論的網站。

source: Limiting cognitive load
de: Begrenzen der kognitiven Belastung
zh_tw: 減少認知負擔

source: Limit the cognitive load required to read the documentation. The simpler and more explicit language we use, the more efficient it becomes for people to learn. You can do so by:
de: Begrenzen Sie die kognitiven Belastung, die für das Lesen der Dokumentation erforderlich ist. Je einfacher und deutlicher die Sprache ist, die wir verwenden, desto effizienter können die Menschen lernen. Sie können dies tun, indem Sie:
zh_tw: 減少閱讀文件的認知負擔。我們使用的語言越簡單明瞭，大家學習起來效率就越高。你可以：

source: Introducing only one new concept at a time whenever possible.
de: Möglichst nur ein neues Konzept auf einmal einführen.
zh_tw: 盡可能一次只介紹一個新概念。

source: Using simple English, as we recommend in our writing guidelines.
de: Einfaches Englisch verwenden, wie in unseren Schreibrichtlinien empfohlen.
zh_tw: 就像在編寫規範中推薦的一樣，使用簡單的英語。

source: Including one or more **concrete usage examples**. Prefer a real-world example to one that uses names like ``foo``, ``bar``, or ``baz``.
de: Ein oder mehrere **konkreter Anwendungsbeispiele** hinzufügen. Ziehen Sie ein reales Beispiel einem Beispiel vor, das Namen wie ``foo``, ``bar`` oder ``baz`` verwendet.
zh_tw: 提供若干**實際使用範例**。現實世界的例子比像 ``foobar`` 一樣的抽象程式碼更好。

source: While many people may understand more complex language and abstract examples, you will lose others. Understandable writing and practical examples benefit everyone.
de: Während viele Menschen komplexere Sprache und abstrakte Beispiele verstehen mögen, werden Sie andere verlieren. Eine verständliche Sprache und praktische Beispiele kommen allen zugute.
zh_tw: 雖然很多人能夠理解複雜的語言和抽象的例子，你還是會失去其他人。而且，通俗易懂的寫作和實際的例子能讓所有人都受益。

source: Always make an effort to **put yourself in the user's shoes**. When we understand something thoroughly, it becomes obvious to us. We may fail to think about details relevant to a newcomer, but **good documentation meets users where they are**. We should explain each feature's capabilities or intended uses with the most straightforward language possible.
de: Versuchen Sie immer, **sich in die Lage des Nutzers zu versetzen**. Wenn wir etwas durch und durch verstehen, wird es für uns offensichtlich. Wir denken vielleicht nicht an Details, die für einen Neuling wichtig sind, aber **gute Dokumentation holt den Benutzer dort ab, wo er ist**. Wir sollten die Fähigkeiten oder den Verwendungszweck jedes Features in einer möglichst einfachen Sprache erklären.
zh_tw: 始終努力**設身處地為使用者著想**。某件事情如果我們完全理解，對於我們而言就會變得顯而易見。我們可能無法想像新手相關的細節，但**好的文件就是要為使用者雪中送炭**。我們應該用盡可能直白的語言，盡力去解釋每一個功能的用處或用法。

source: Try to remember what you first needed to know when learning about the feature or concept. What new terms did you need to learn? What confused you? What was the hardest to grasp? You will want users to review your work, and we recommend you practice explaining the feature before writing about it.
de: Versuchen Sie sich daran zu erinnern, was Sie zuerst wissen mussten, als Sie das Feature oder Konzept kennenlernten. Welche neuen Begriffe mussten Sie lernen? Was hat Sie verwirrt? Was war am schwierigsten zu begreifen? Sie möchten, dass Ihre Arbeit von den Benutzern gelesen wird, und wir empfehlen, dass Sie üben, das Feature zu erklären, bevor Sie darüber schreiben.
zh_tw: 回想一下學習某個功能或概念時，你首先需要瞭解的東西。你需要用到哪些新的術語？你困惑的點是什麼？最難掌握的是什麼？你會希望讓使用者對你的成果進行評審，我們建議你在著手寫作之前，先練習一下如何解釋這個功能。

source: Programming fundamentals are a prerequisite for using a complex engine like Godot. Talking about variables, functions, or classes is acceptable. But we should favor plain language over specific terminology like "metaprogramming". If you need to use precise terms, be sure to define them.
de: Die Grundlagen der Programmierung sind eine Voraussetzung für die Verwendung einer komplexen Engine wie Godot. Es ist akzeptabel, über Variablen, Funktionen oder Klassen zu sprechen. Wir sollten jedoch eine einfache Sprache gegenüber spezifischer Terminologie wie "Metaprogrammierung" bevorzugen. Wenn Sie präzise Begriffe verwenden müssen, sollten Sie diese auch definieren.
zh_tw: 擁有程式設計基礎是使用像 Godot 這樣複雜的引擎的先決條件。你可以用到變數、函式、類。不過相對於“元程式設計”之類的特定術語，我們應該更傾向於使用平實的語言。如果你需要使用精准的術語，請一定要給出定義。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
