Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/docs_writing_guidelines.po
Languages: de

source: Writing guidelines
de: Leitlinien zum Schreiben

source: The Godot community is rich and international. Users come from all around the world. Some of them are young, and many aren't native English speakers. That's why we must all write using a clear and a common language. For the class reference, the goal is to make it easy to read for everyone and precise.
de: Die Godot-Community ist international, Benutzer kommen aus der ganzen Welt. Einige von ihnen sind jung und viele sprechen Englisch nicht als Muttersprache. Deshalb müssen wir alles in einer klaren und allgemeinverständlichen Sprache schreiben. Für die Klassenreferenz ist es das Ziel, sie für alle leicht lesbar und präzise zu machen.

source: In summary, always try to:
de: Knapp zusammengefasst, versuchen Sie sich an folgendes zu halten:

source: Use the active voice
de: Den Aktiv verwenden

source: Use precise action verbs
de: Präzise Tätigkeitsverben verwenden

source: Avoid verbs that end in -ing
de: Verben vermeiden, die auf "-ing" enden

source: Remove unnecessary adverbs and adjectives.
de: Unnötige Adverbien und Adjektive entfernen.

source: Ban these 8 words: obvious, simple, basic, easy, actual, just, clear, and however
de: Diese 8 Wörter vermeiden: obvious, simple, basic, easy, actual, just, clear und however

source: Use explicit references
de: Explizite Verweise verwenden

source: Use 's to show possession
de: 's verwenden, um Besitz anzuzeigen

source: Use the Oxford comma
de: Das Oxford-Komma verwenden

source: There are 3 rules to describe classes:
de: Hier sind 3 Arten, um Klassen zu beschreiben:

source: Give an overview of the node in the brief description
de: Geben Sie in der Kurzbeschreibung einen Überblick über den Node

source: Mention what methods return if it's useful
de: Erwähnen Sie, welche Methoden zurückgegeben werden, wenn dies nützlich ist

source: Use "if true" to describe booleans
de: Verwenden Sie "if true", um Boolesche Werte zu beschreiben

source: A technical writer's job is to pack as much information as possible into the smallest and clearest sentences possible. These guidelines will help you work towards that goal.
de: Die Aufgabe eines technischen Redakteurs ist es, so viele Informationen wie möglich in möglichst kleine und klare Sätze zu packen. Diese Richtlinien helfen Ihnen dabei, auf dieses Ziel hinzuarbeiten.

source: See the :ref:`content guidelines <doc_content_guidelines>` for information on the types of documentation you can write in the official documentation.
de: Siehe die :ref:`Inhaltsrichtlinien <doc_content_guidelines>` für Informationen über die Arten von Dokumentation, die Sie in der offiziellen Dokumentation schreiben können.

source: 7 rules for clear English
de: 7 Regeln für klares Englisch

source: Use the active voice when possible. Take the classes, methods, and constants you describe as the subject. It's natural to write using the passive voice, but it's harder to read and produces longer sentences.
de: Verwenden Sie wenn möglich den Aktiv. Nehmen Sie die Klassen, Methoden und Konstanten, die Sie beschreiben, als Subjekt. Es mah natürlich sein, im Passiv zu schreiben, aber es ist schwieriger zu lesen und führt zu längeren Sätzen.

source: Passive:
de: Passiv:

source: Active:
de: Aktiv:

source: **Don't** use the passive voice:
de: **Schlecht:** Verwenden Sie nicht die passive Form:

source: **Do** use the node's name as a noun:
de: **Gut**: Verwenden Sie den Namen des Nodes als Substantiv:

source: Favor precise yet common verbs over generic ones like ``make``, ``set``, and any expression you can replace with a single word.
de: Bevorzugen Sie präzise, aber gebräuchliche Verben gegenüber generischen Verben wie ``make``, ``set`` und allen Ausdrücken, die Sie durch ein einziges Wort ersetzen können.

source: **Don't** repeat the method's name. It already states it sets the pivot value to a new one:
de: **Schlecht:** Wiederholen Sie nicht den Namen der Methode. Es wird bereits angegeben, dass der Pivot-Wert auf einen neuen Wert gesetzt wird:

source: **Do** explain what's the consequence of this "set": use precise verbs like ``place``, ``position``, ``rotate``, ``fade``, etc.
de: **Gut:** Erklären Sie was die Konsequenz dieses "set" ist: Verwenden Sie präzise Verben wie ``place``, ``position``, ``rotate``, ``fade``, usw.

source: The progressive forms describe continuous actions. E.g. "is calling", "is moving".
de: Die Verlaufsformen beschreiben kontinuierliche Aktionen. z.B. "is calling", "is moving".

source: **Don't** use the progressive form for instant changes.
de: **Schlecht:** Verwenden Sie nicht die Verlaufsform für sofortige Änderungen.

source: **Do** use simple present, past, or future.
de: **Gut:** Verwenden Sie das "Simple Present", "Past" oder "Future".

source: Exception: If the subject is not clear, replacing "ing" verbs is not an improvement. For example, in the previous sentence, "it replaces" would not make much sense where "replacing" currently is.
de: Ausnahme: Wenn das Thema nicht eindeutig ist, führt das Ersetzen von "ing"-Verben nicht zu einer Verbesserung. Zum Beispiel würde im vorherigen Satz "it replaces" nicht viel Sinn machen, wo jetzt "replacing" steht.

source: You may use the progressive tense to describe actions that are continuous in time. Anything like animation or coroutines.
de: Sie können im englischen die Verlaufsform verwenden, um zeitlich kontinuierliche Aktionen zu beschreiben. Alles wie Animationen oder Koroutinen.

source: Verbs can turn into adjectival nouns with -ing. This is not a conjugation, so you may use them: ``the remaining movement``, ``the missing file``, etc.
de: Verben können sich mit -ing in adjektivische Substantive verwandeln. Dies ist keine Konjugation, also können Sie sie verwenden: ``the remaining movement``, ``the missing file``, usw.

source: Remove unnecessary adverbs and adjectives
de: Entfernen Sie unnötige Adverbien und Adjektive

source: Write as few adjectives and adverbs as possible. Only use them if they add key information to the description.
de: Schreiben Sie so wenig Adjektive und Adverbien wie möglich. Verwenden Sie sie nur, wenn sie der Beschreibung wichtige Informationen hinzufügen.

source: **Don't** use redundant or meaningless adverbs. Words that lengthen the documentation but don't add any information:
de: **Schlecht:** Verwenden Sie keine überflüssigen oder bedeutungslosen Adverbien. Wörter, welche die Dokumentation verlängern, aber keine Informationen hinzufügen:

source: **Do** write short sentences in a simple, descriptive language:
de: **Gut:** Schreiben Sie kurze Sätze in einer einfachen, beschreibenden Sprache:

source: Ban these 8 words
de: Streichen Sie diese 8 Wörter

source: **Don't** ever use these 8 banned words:
de: **Schlecht:** Benutzen Sie niemals diese 8 gesperrten Wörter:

source: however (some uses)
de: however (manche Bedeutungen)

source: Game creation and programming aren't simple, and nothing's easy to someone learning to use the API for the first time. Other words in the list, like ``just`` or ``actual`` won't add any info to the sentence. Don't use corresponding adverbs either: obviously, simply, basically, easily, actually, clearly.
de: Das Erstellen und Programmieren von Spielen ist nicht einfach, und für jemanden, der zum ersten Mal die Verwendung der API lernt, ist nichts einfach. Andere Wörter in der Liste, wie ``just`` oder ``actual``, fügen dem Satz keine Informationen hinzu. Verwenden Sie auch keine entsprechenden Adverbien: obviously, simply, basically, easily, actually, clearly.

source: **Don't** example. The banned words lengthen the description and take attention away from the most important info:
de: **Schlecht:** Beispiel: Die gesperrten Wörter verlängern die Beschreibung und lenken die Aufmerksamkeit von den wichtigsten Informationen ab:

source: **Do** remove them:
de: **Gut:** entfernen Sie sie:

source: "Simple" never helps. Remember, for other users, anything could be complex or frustrate them. There's nothing like a good old *it's simple* to make you cringe. Here's the old brief description, the first sentence on the Timer node's page:
de: "Simple" hilft nie. Denken Sie daran, dass für andere Benutzer alles komplex sein oder sie frustrieren kann. Es gibt nichts Schöneres als ein gutes altes *it's simple* um jemanden erschaudern zu lassen. Hier ist die alte kurze Beschreibung, der erste Satz auf der Seite des Timer-Nodes:

source: **Do** explain what the node does instead:
de: **Gut:** Erklären Sie stattdessen, was der Node tut:

source: **Don't** use "basic", it is too vague:
de: **Schlecht:** Verwenden Sie nicht "basic", es ist zu vage:

source: **Do** use the brief description to offer an overview of the node:
de: **Gut:** Verwenden Sie die kurze Beschreibung, um einen Überblick über den Node zu erhalten:

source: Favor explicit references over implicit ones.
de: Bevorzugen Sie explizite Verweise gegenüber impliziten.

source: **Don't** use words like "the former", "the latter", etc. They're not the most common in English, and they require you to check the reference.
de: **Schlecht:** Verwenden Sie keine Wörter wie "the former", "the latter" usw. Sie sind im Englischen nicht die gebräuchlichsten und führen dazu, dass man den Bezug noch einmal nachlesen muss.

source: **Do** repeat words. They remove all ambiguity:
de: **Gut:** Wiederholen Sie Wörter. Sie beseitigen alle Unklarheiten:

source: If you need to repeat the same variable name 3 or 4 times, you probably need to rephrase your description.
de: Wenn Sie denselben Variablennamen drei- oder viermal wiederholen müssen, so sollten Sie Ihre Beschreibung wahrscheinlich neu formulieren.

source: Avoid "The milk **of** the cow". It feels unnatural in English. Write "The cow's milk" instead.
de: Vermeiden Sie "The milk **of** the cow". Es fühlt sich auf Englisch unnatürlich an. Schreiben Sie stattdessen "The cow's milk".

source: **Don't** write "of the X":
de: **Schlecht:** Schreiben Sie nicht "of the X":

source: **Do** use ``'s``. It lets you put the main subject at the start of the sentence, and keep it short:
de: **Gut:** Benutzen Sie ``'s``. Damit können Sie das Hauptthema an den Anfang des Satzes setzen und es kurz halten:

source: Use the Oxford comma to enumerate anything
de: Verwenden Sie das Oxford-Komma bei Aufzählungen

source: From the Oxford dictionary:
de: Aus dem Oxford-Wörterbuch:

source: The 'Oxford comma' is an optional comma before the word 'and' at the end of a list: *We sell books, videos, and magazines.*
de: Das 'Oxford-Komma' ist ein optionales Komma vor dem Wort 'und' am Ende einer Aufzählung: *We sell books, videos, and magazines.*

source: [...] Not all writers and publishers use it, but it can clarify the meaning of a sentence when the items in a list are not single words: *These items are available in black and white, red and yellow, and blue and green.*
de: [...] Nicht alle Autoren und Verleger verwenden es, aber es kann die Bedeutung eines Satzes verdeutlichen, wenn die Elemente in einer Liste keine einzelnen Wörter sind: *These items are available in black and white, red and yellow, and blue and green.*

source: **Don't** leave the last element of a list without a comma:
de: **Schlecht:** Lassen Sie das letzte Element einer Liste nicht ohne Komma:

source: **Do** add a comma before `and` or `or`, for the last element of a list with more than two elements.
de: **Gut:** Fügen Sie ein Komma vor `and` oder `or` für das letzte Element einer Liste mit mehr als zwei Elementen ein.

source: How to write methods and classes
de: Wie man Methoden und Klassen schreibt

source: Dynamic vs static typing
de: Dynamische und statische Typisierung

source: The code examples in the documentation should follow a consistent style not to confuse users. As static type hints are an optional feature of GDScript, we chose to stick to writing dynamic code. This leads to writing GDScript that is concise and accessible.
de: Die Codebeispiele in der Dokumentation sollten einem einheitlichen Stil folgen, um die Benutzer nicht zu verwirren. Da statische Typhinweise ein optionales Feature von GDScript sind, haben wir uns entschieden, beim Schreiben von dynamischem Code zu bleiben. Dies führt dazu, dass GDScript präzise und zugänglich geschrieben wird.

source: The exception is topics that explain static typing concepts to users.
de: Die Ausnahme bilden Themen, die Benutzern statische Typisierungskonzepte erläutern.

source: **Don't** add a type hint with a colon or by casting:
de: **Schlecht:** Fügen Sie keinen Typhinweis mit einem Doppelpunkt oder durch Casting hinzu:

source: **Do** write constants and variables with dynamic typing:
de: **Gut:** Schreiben Sie Konstanten und Variablen mit dynamischer Typisierung:

source: **Don't** write functions with inferred arguments or return types:
de: **Schlecht:** Schreiben Sie keine Funktionen mit abgeleiteten Argumenten oder Rückgabetypen:

source: **Do** write functions using dynamic typing:
de: **Gut:** Schreiben Sie Funktionen, die dynamische Typisierung verwenden:

source: Use real-world code examples where appropriate
de: Verwenden Sie, wo es angebracht ist, reale Codebeispiele

source: Real-world examples are more accessible to beginners than abstract ``foos`` and ``bars``. You can also copy them directly from your game projects, ensuring that any code snippet compiles without errors.
de: Beispiele aus der realen Welt sind für Anfänger leichter zugänglich als abstrakte ``foos`` und ``bars``. Sie können sie auch direkt aus Ihren Spieleprojekten kopieren und so sicherstellen, dass jeder Codeschnipsel ohne Fehler kompiliert wird.

source: Writing ``var speed = 10`` rather than ``var my_var = 10`` allows beginners to understand code better. It gives them a frame of reference as to where they could use the code snippets in a live project.
de: Wenn Sie ``var speed = 10`` statt ``var my_var = 10`` schreiben, können Anfänger den Code besser verstehen. Es gibt ihnen einen Bezugsrahmen, in dem sie die Codeschnipsel in einem Live-Projekt verwenden können.

source: **Don't** write made-up examples:
de: **Schlecht:** Schreiben Sie keine erfundenen Beispiele:

source: **Do** write concrete examples:
de: **Gut:** Schreiben Sie konkrete Beispiele:

source: Of course, there are times when using real-world examples is impractical. In those situations, you should still avoid using names such as ``my_var``, ``foo()`` or ``my_func()`` and consider more meaningful names for your examples.
de: Natürlich gibt es Situationen, in denen die Verwendung von Beispielen aus der realen Welt unpraktisch ist. In solchen Situationen sollten Sie trotzdem keine Namen wie ``my_var``, ``foo()`` oder ``my_func()`` verwenden und sich stattdessen sinnvollere Namen für Ihre Beispiele überlegen.

source: The brief description is the reference's most important sentence. It's the user's first contact with a node:
de: Die Kurzbeschreibung ist der wichtigste Satz der Referenz. Er ist der erste Kontakt des Benutzers mit einem Node:

source: It's the only description in the "Create New Node" dialog.
de: Sie ist die einzige Beschreibung im Dialogfeld "Neuen Node erstellen".

source: It's at the top of every page in the reference
de: Sie befindet sich oben auf jeder Seite in der Referenz

source: The brief description should explain the node's role and its functionality, in up to 200 characters.
de: Die Kurzbeschreibung sollte die Rolle des Nodes und seine Funktionalität in bis zu 200 Zeichen erklären.

source: **Don't** write tiny and vague summaries:
de: **Schlecht:** Schreiben Sie keine winzigen und vage Zusammenfassungen:

source: **Do** give an overview of the node's functionality:
de: **Gut:** Geben Sie einen Überblick über die Funktionalität des Nodes:

source: Use the node's full description to provide more information, and a code example, if possible.
de: Verwenden Sie die vollständige Beschreibung des Nodes, um weitere Informationen und, falls möglich, ein Codebeispiel bereitzustellen.

source: Some methods return important values. Describe them at the end of the description, ideally on a new line. No need to mention the return values for any method whose name starts with ``set`` or ``get``.
de: Einige Methoden geben wichtige Werte zurück. Beschreiben Sie diese am Ende der Beschreibung, am besten in einer neuen Zeile. Bei allen Methoden, deren Name mit ``set`` oder ``get`` beginnt, müssen Sie die Rückgabewerte nicht erwähnen.

source: **Do** always use "Returns".
de: **Gut:** Verwenden Sie immer "Returns".

source: Notice the exception to the "direct voice" rule: with the move method, an external collider can influence the method and the body that calls ``move``. In this case, you can use the passive voice.
de: Beachten Sie die Ausnahme von der Regel, den Aktiv zu verwenden: Bei der move-Methode kann ein externer Collider die Methode und den Body, der ``move`` aufruft, beeinflussen. In diesem Fall können Sie die den Passiv verwenden.

source: For boolean member variables, always use ``if true`` and/or ``if false``, to stay explicit. ``Controls whether or not`` may be ambiguous and won't work for every member variable.
de: Für boolesche Member-Variablen sollten Sie immer ``if true`` und/oder ``if false`` verwenden, um eindeutig zu bleiben. ``Controls whether or not`` kann mehrdeutig sein und wird nicht für jede Member-Variable funktionieren.

source: Also, surround boolean values, variable names and methods with ``[code][/code]``.
de: Umgeben Sie außerdem boolesche Werte, Variablennamen und Methoden mit ``[code][/code]``.

source: **Do** start with "if true":
de: **Gut:** Fangen Sie mit "if true" an:

source: Use ``[code]`` around arguments
de: Verwenden Sie ``[code]`` um Argumente herum

source: In the class reference, always surround arguments with ``[code][/code]``. In the documentation and in Godot, it will display like ``this``. When you edit XML files in the Godot repository, replace existing arguments written like 'this' or \`this\` with ``[code]this[/code]``.
de: In der Klassenreferenz umgeben Sie Argumente immer mit ``[code][/code]``. In der Dokumentation und in Godot wird es dann ``so`` angezeigt. Wenn Sie XML-Dateien im Godot-Repository bearbeiten, ersetzen Sie vorhandene Argumente, die 'so' oder \`so\` geschrieben sind, durch ``[code]so[/code]``.

source: Common vocabulary to use in Godot's documentation
de: Allgemeines Vokabular für die Godot-Dokumentation

source: The developers chose some specific words to refer to areas of the interface. They're used in the sources, in the documentation, and you should always use them instead of synonyms, so the users know what you're talking about.
de: Die Entwickler haben einige spezifische Wörter ausgewählt, um auf Bereiche der Benutzeroberfläche zu verweisen. Sie werden im Quellcode und in der Dokumentation verwendet, und Sie sollten sie immer anstelle von Synonymen verwenden, damit die Benutzer wissen, wovon Sie sprechen.

source: Overview of the interface and common vocabulary
de: Übersicht über die Benutzeroberfläche und das allgemeine Vokabular

source: In the top left corner of the editor lie the ``main menus``. In the center, the buttons change the ``workspace``. And together the buttons in the top right are the ``playtest buttons``. The area in the center, that displays the 2D or the 3D space, is the ``viewport``. At its top, you find a list of ``tools`` inside the ``toolbar``.
de: In der oberen linken Ecke des Editors befinden sich die ``main menus``. In der Mitte ändern die Buttons den ``workspace``. Und zusammen sind die Buttons oben rechts die ``playtest buttons``. Der Bereich in der Mitte, der den 2D- oder 3D-Space anzeigt, liegt der ``viewport``. Oben finden Sie eine Liste der ``tools`` innerhalb der ``toolbar``.

source: The tabs or dockable panels on either side of the viewport are ``docks``. You have the ``FileSystem dock``, the ``Scene dock`` that contains your scene tree, the ``Import dock``, the ``Node dock``, and the ``Inspector`` or ``Inspector dock``. With the default layout you may call the tabbed docks ``tabs``: the ``Scene tab``, the ``Node tab``...
de: Die Tabs oder andockbaren Bereiche auf beiden Seiten des Viewports sind ``docks``. Sie haben das ``FileSystem dock`` und das ``Scene dock``, welches Ihren Szenenbaum enthält, das ``Import dock``, das ``Node dock`` und den ``Inspector``, auch ``Inspector dock`` genannt. Im Default-Layout können Sie die Docks mit Tabs ``tabs`` nennen: das ``Scene tab``, das ``Node tab``...

source: The Animation, Debugger, etc. at the bottom of the viewport are ``panels``. Together they make up the ``bottom panels``.
de: Die Animation, der Debugger usw. am unteren Rand des Viewports sind ``panels``. Zusammen bilden sie die ``bottom panels``.

source: Foldable areas of the Inspector are ``sections``. The node's parent class names, which you can't fold, are ``Classes`` e.g. the ``CharacterBody2D class``. And individual lines with key-value pairs are ``properties``. E.g. ``position`` or ``modulate color`` are both ``properties``.
de: Ausklappbare Bereiche des Inspektors sind ``sections``. Die Klassennamen des Parent eines Nodes, die man nicht ausklappen kann, sind ``Classes``, z.B. die ``CharacterBody2D class``. Und einzelne Zeilen mit Key-Value-Paaren sind ``properties``. Beispielsweise ``position`` oder ``modulate color`` sind beides ``properties``.

source: Keyboard shortcut guidelines
de: Richtlinien für Tastenkürzel

source: Keyboard and mouse shortcuts should make use of the ``:kbd:`` tag, which allows shortcuts to stand out from the rest of the text and inline code. Use the compact form for modifier keys (:kbd:`Ctrl`/:kbd:`Cmd`) instead of their spelled out form (:kbd:`Control`/:kbd:`Command`). For combinations, use the ``+`` symbol with a space on either side of the symbol.
de: Tastatur- und Maus-Eingaben sollten das Tag ``:kbd:`` verwenden, mit dem sich Eingaben vom Rest des Textes und des Inline-Codes abheben können. Verwenden Sie das kompakte Formular für Modifikatortasten (:kbd:`Ctrl`/:kbd:`Cmd`) anstelle der ausgeschriebenen Form (:kbd:`Control`/:kbd:`Command`). Verwenden Sie für Kombinationen das Symbol ``+`` mit einem Leerzeichen auf beiden Seiten des Symbols.

source: Make sure to mention shortcuts that differ on macOS compared to other platforms. On macOS, ``Cmd`` often replaces ``Ctrl`` in keyboard shortcuts.
de: Stellen Sie sicher, dass Sie Verknüpfungen erwähnen, die sich unter MacOS von anderen Plattformen unterscheiden. Unter MacOS ersetzt ``Cmd`` häufig ``Ctrl`` in Tastaturkürzeln.

source: Try to integrate the shortcut into sentences the best you can. Here are some examples with the ``:kbd:`` tag left as-is for better visibility:
de: Versuchen Sie, das Kürzel so gut wie möglich in Sätze zu integrieren. Hier einige Beispiele, bei denen das Tag ``:kbd:`` zur besseren Sichtbarkeit unverändert bleibt:

source: Press ``:kbd:`Shift + Up Arrow``` to move the node upwards by 8 pixels.
de: Press ``:kbd:`Umschalt + Pfeil oben``` to move the node upwards by 8 pixels.

source: Translation status
de: Übersetzungsstatus
