Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/index.po
Languages: de, zh_tw

source: Writing documentation
de: Dokumentation schreiben
zh_tw: 撰寫自定說明文件

source: We always need help to improve the documentation, be it the class reference or the manual. Below, you can find our content and writing guidelines and concrete guides to make changes to the documentation.
de: Wir brauchen immer Hilfe, um die Dokumentation zu verbessern, sei es die Klassenreferenz oder das Handbuch. Im Folgenden finden Sie unsere Richtlinien für den Inhalt und das Schreiben sowie konkrete Anleitungen für Änderungen an der Dokumentation.
zh_tw: 我們始終需要大家來説明優化文件，無論是類參考還是手冊。你可以在下面找到我們的內容與編寫規範，以及實際的文件修改指南。

source: Be sure to also check the :ref:`workflow guidelines <doc_contributing_workflow>`, especially if you're new to using Git or GitHub.
de: Lesen Sie auch die :ref:`Workflow-Richtlinien <doc_contributing_workflow>`, insbesondere wenn Sie Git oder GitHub zum ersten Mal verwenden.
zh_tw: 請務必檢查 :ref:`工作流程指南 <doc_contributing_workflow>`，特別是如果您不熟悉使用 Git 或 GitHub。

source: Guidelines
de: Leitlinien
zh_tw: 參考線

source: Here are the principles and guidelines we strive to follow to write accessible documentation.
de: Im Folgenden finden Sie die Grundsätze und Leitlinien, die wir bei der Erstellung barrierefreier Dokumentation befolgen.
zh_tw: 這些是我們為了編寫簡單易懂的文件而努力遵循的原則和規範。

source: Writing the manual
de: Schreiben des Handbuchs
zh_tw: 編輯動畫

source: These articles explain how to contribute to this very documentation, and how to build the online version locally for testing.
de: In diesen Artikeln wird erklärt, wie man zu dieser Dokumentation beitragen kann und wie man die Online-Version zum Testen lokal erstellt.
zh_tw: 本指南介紹的是如何向 Godot 的文件做出貢獻，無論是編寫頁面還是審核頁面。

source: Class reference guides
de: Richtlinien für die Klassenreferenz
zh_tw: 類別參照手冊

source: The pages below focus on the class reference.
de: Die folgenden Seiten konzentrieren sich auf den Klassenreferenz.
zh_tw: 如何撰寫類別參照文件

source: As the reference is included in the Godot editor, its source files are part of the `godot repository <https://github.com/godotengine/godot>`_. We use XML files to write it, so the process to contribute to the class reference differs from writing the online manual.
de: Da die Referenz im Godot-Editor enthalten ist, sind ihre Quelldateien Teil des `Godot-Repository <https://github.com/godotengine/godot>`_. Wir verwenden XML-Dateien, um die Referenz zu schreiben, daher unterscheidet sich der Prozess, um zur Klassenreferenz beizutragen, vom Schreiben des Online-Handbuchs.
zh_tw: 因為參考是包含在 Godot 編輯器中的，它的原始檔案是 `Godot 倉庫 <https://github.com/godotengine/godot>`_的一部分。我們是用 XML 檔來編寫的，所以貢獻類參考的流程和編寫線上手冊的流程有所不同。

source: Translating the documentation
de: Übersetzen der Dokumentation
zh_tw: 說明文件架構

source: The community is always working hard on making Godot and its documentation available to more people. Localizing the documentation is a colossal and ongoing effort you can be part of.
de: Die Community arbeitet immer hart daran, Godot und seine Dokumentation für mehr Menschen zugänglich zu machen. Die Lokalisierung der Dokumentation ist eine kolossale und laufende Anstrengung, an der Sie sich beteiligen können.
zh_tw: 社區始終在努力讓 Godot 及其文件能夠被更多人使用。你可以參與文件的當地語系化，這是一個正在進行的龐大工程。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
