Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/updating_the_class_reference.po
Languages: de, zh_tw

source: Contributing to the class reference
de: Beitragen zur Klassenreferenz
zh_tw: 參與貢獻類別參照文件

source: The :ref:`Class reference <doc_class_reference>` is a set of articles describing the public API of the engine. This includes descriptions for various classes, methods, properties, and global objects, available for scripting. The class reference is available online, from the documentation sidebar, and in the Godot editor, from the help menu.
de: Die :ref:`Klassenreferenz <doc_class_reference>` ist eine Sammlung von Artikeln zur Beschreibung der public Engine-API. Dazu gehören Beschreibungen für verschiedene Klassen, Methoden, Propertys und globale Objekte, die für die Skripterstellung zur Verfügung stehen. Die Klassenreferenz ist online über die Seitenleiste der Dokumentation und im Godot-Editor über das Hilfemenü verfügbar.
zh_tw: :ref:`類參考 <doc_class_reference>`是一組描述引擎公開 API 的文章。 這些文章中包括了對各種類、方法、屬性和全域物件的描述，可用於腳本的編寫。類參考可以從文件的側邊欄進入，線上閱讀，也可以在 Godot 編輯器中從説明功能表進入。

source: As the engine grows and features are added or modified, some parts of the class reference become obsolete and new descriptions and examples need to be added. While developers are encouraged to document all of their work in the class reference when submitting a pull request, we can't expect everyone to be able to write high quality documentation, so there is always work for contributors like you to polish existing and create missing reference material.
de: Wenn die Engine wächst und Features hinzugefügt oder verändert werden, werden einige Teile der Klassenreferenz veraltet und neue Beschreibungen und Beispiele müssen hinzugefügt werden. Während Entwickler dazu angehalten sind, ihre gesamte Arbeit in der Klassenreferenz zu dokumentieren, wenn sie einen Pull Request einreichen, können wir nicht erwarten, dass jeder in der Lage ist, eine qualitativ hochwertige Dokumentation zu schreiben.
zh_tw: 隨著引擎的發展以及功能的新增或修改，類參考的某些部分會變得過時，為此需要新增新的描述和範例。 我們雖然鼓勵開發人員在提交拉取請求時，最好在類參考中記錄他們的所有工作，但我們不能期望每個人都能夠編寫高品質的文件，因此總是有需要像你這樣的貢獻者來完善現有的文件，建立缺失的參考資料。

source: The source of the class reference
de: Die Quelle der Klassenreferenz
zh_tw: 如何撰寫類別參照文件

source: As the class reference is available in two places, online and in the editor, we need to take care to keep things in sync. To achieve this the `main Godot repository <https://github.com/godotengine/godot/>`_ is picked as the source of truth, and the documentation for the class reference is tracked there.
de: Da die Klassenreferenz an zwei Stellen verfügbar ist, nämlich online und im Editor, müssen wir dafür sorgen, dass die Dinge synchron bleiben. Um dies zu erreichen, wird das `Godot-Hauptrepository <https://github.com/godotengine/godot/>`_ als Quelle der Wahrheit gewählt, und die Dokumentation für die Klassenreferenz wird dort nachverfolgt.
zh_tw: 因為參考是包含在 Godot 編輯器中的，它的原始檔案是 `Godot 倉庫 <https://github.com/godotengine/godot>`_的一部分。我們是用 XML 檔來編寫的，所以貢獻類參考的流程和編寫線上手冊的流程有所不同。

source: You should **not** edit ``.rst`` files in the ``classes/`` folder of the `documentation repository <https://github.com/godotengine/godot-docs/>`_. These files are generated automatically and are synced manually by project maintainers. Read further to learn how to correctly edit the class reference.
de: Sie sollten **nicht** die ``.rst``-Dateien im ``classes/``-Ordner des `Documentations-Repository <https://github.com/godotengine/godot-docs/>`_ bearbeiten. Diese Dateien werden automatisch generiert und werden von den Projekt-Maintainern manuell synchronisiert. Lesen Sie weiter, um zu erfahren, wie Sie die Klassenreferenz korrekt bearbeiten können.
zh_tw: 你 **不應該**\\\\直接編輯 `文件儲存庫 <https://github.com/godotengine/godot-docs/>_` 的 ``classes/`` 資料夾中的 ``.rst`` 檔案。 這些檔是自動生成的，並由專案維護人員手動同步。 進一步閱讀以瞭解如何正確編輯類參考。

source: In the main repository the class reference is stored in XML files, one for each exposed class or global object. The majority of these files is located in `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_, but some modules contain their own documentation as well. You will find it in the ``modules/<module_name>/doc_classes/`` directory. To learn more about editing XML files refer to :ref:`doc_class_reference_primer`.
de: Im Haupt-Repository wird die Klassenreferenz in XML-Dateien gespeichert, eine Datei für jede von außen zugreifbare Klasse oder jedes globale Objekt. Die meisten dieser Dateien befinden sich in `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_, aber einige Module enthalten auch ihre eigene Dokumentation. Sie finden sie im Verzeichnis ``modules/<module_name>/doc_classes/``. Um mehr über die Bearbeitung von XML-Dateien zu erfahren, lesen Sie :ref:`doc_class_reference_primer`.
zh_tw: 在主儲存庫中，類參考儲存在 XML 檔中，每個檔對應一個公開的類或全域物件。 這些檔大部分位於 `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_ 中，但某些模組也包含自己的文件。 你將在 ``modules/<module_name>/doc_classes/`` 目錄中找到它。 要瞭解有關編輯 XML 檔的更多資訊，請參閱 :ref:`doc_class_reference_primer`。

source: For details on Git usage and the pull request workflow, please refer to the :ref:`doc_pr_workflow` page.
de: Für Erläuterungen zum Umgang mit Git und dem Workflow beim Pull Request, sehen Sie sich die :ref:`doc_pr_workflow`-Seite an.
zh_tw: 有關詳細的 Git 使用方法與 PR 工作流程，請參考 :ref:`doc_pr_workflow` 一頁。該頁面中大部分關於 godotengine/godot 儲存庫的說明也適用於這個說明文件的儲存庫。

source: If you want to translate the class reference from English to another language, see :ref:`doc_editor_and_docs_localization`. This guide is also available as a `video tutorial on YouTube <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_.
de: Wenn Sie die Klassenreferenz vom Englischen in eine andere Sprache übersetzen wollen, lesen Sie :ref:`doc_editor_and_docs_localization`. Diese Anleitung ist auch als `Video-Tutorial auf YouTube <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_ verfügbar.
zh_tw: 本影片亦有 `在 YouTube 上以影片教學的形式 <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_ 提供。

source: **Important:** If you plan to make large changes, you should create an issue on the `godot-docs repository <https://github.com/godotengine/godot-docs/>`_ or comment on an existing issue. Doing so lets others know you're already taking care of a given class.
de: **Wichtig:** Wenn Sie vorhaben, größere Änderungen vorzunehmen, sollten Sie einen Eintrag im `godot-docs-Repository <https://github.com/godotengine/godot-docs/>`_ erstellen oder einen Kommentar zu einem bestehenden Eintrag abgeben. Auf diese Weise können andere erfahren, dass Sie sich bereits um eine bestimmte Klasse kümmern.
zh_tw: **重要：**如果你準備進行大量修改，就應該在 `godot-docs 倉庫 <https://github.com/godotengine/godot-docs/>`_中建立 Issue，或者在已有 Issue 上發表評論。這樣別人就會知道你準備處理某個類了。

source: What to contribute
de: Was Sie beitragen können
zh_tw: 參與貢獻的方法

source: The natural place to start contributing is the classes that you are most familiar with. This ensures that the added description will be based on experience and the necessary know-how, not just the name of a method or a property. We advise not to add low effort descriptions, no matter how appealing it may look. Such descriptions obscure the need for documentation and are hard to identify automatically.
de: Am besten beginnen Sie mit den Klassen, mit denen Sie am besten vertraut sind. Dadurch wird sichergestellt, dass die hinzugefügte Beschreibung auf Erfahrung und dem notwendigen Know-how beruht und nicht nur auf dem Namen einer Methode oder einer Property. Wir raten davon ab, Beschreibungen mit geringem Aufwand hinzuzufügen, egal wie ansprechend sie auch aussehen mögen. Solche Beschreibungen verschleiern den Dokumentationsbedarf und sind schwer automatisch zu erkennen.
zh_tw: 開始貢獻的自然位置應當是你最熟悉的類。這確保了新增的描述將基於（你的）經驗和必要的專業知識，而不僅僅是方法或屬性的名稱。 我們建議不要新增省事的描述，無論它看起來多麼有吸引力。 這種描述掩蓋了對文件的需求，並且很難自動識別。

source: Following this principle is important and allows us to create tools for contributors. Such as the class reference's `completion status tracker <https://godotengine.github.io/doc-status/>`_. You can use it to quickly find documentation pages missing descriptions.
de: Die Einhaltung dieses Grundsatzes ist wichtig und ermöglicht es uns, Werkzeuge für die Mitwirkenden zu schaffen. Wie zum Beispiel der `completion status tracker <https://godotengine.github.io/doc-status/>`_ der Klassenreferenz. Sie können ihn verwenden, um schnell Dokumentationsseiten zu finden, denen Beschreibungen fehlen.
zh_tw: 遵循這一原則非常重要，它使得我們能夠為貢獻者建立工具。 例如類參考的 `完成狀態追蹤器 <https://godotengine.github.io/doc-status/>`_ 。 您可以使用它快速搜尋缺少描述的文件頁面。

source: If you decide to document a class, but don't know what a particular method does, don't worry. Leave it for now, and list the methods you skipped when you open a pull request with your changes. Another writer will take care of it.
de: Wenn Sie sich entscheiden, eine Klasse zu dokumentieren, aber nicht wissen, was eine bestimmte Methode tut, machen Sie sich keine Sorgen. Lassen Sie es vorerst und listen Sie die Methoden auf, die Sie übersprungen haben, wenn Sie einen Pull Request mit Ihren Änderungen erstellen. Ein anderer Autor wird sich darum kümmern.
zh_tw: 沒關係，先跳過即可。並請在為更改開啟 PR 時列出所有跳過的方法。其他編寫者會處理這些方法。

source: You can still look at the methods' implementation in Godot's source code on GitHub. If you have doubts, feel free to ask on the `Q&A website <https://ask.godotengine.org/>`_ and `Godot Contributors Chat <https://chat.godotengine.org/>`_.
de: Sie können sich die Implementierung der Methoden im Quellcode von Godot auf GitHub ansehen. Wenn Sie Zweifel haben, können Sie auf der `Q&A Website <https://ask.godotengine.org/>`_ und im `Godot Mitwirkenden-Chat <https://chat.godotengine.org/>`_ fragen.

source: Unless you make minor changes, like fixing a typo, we do not recommend using the GitHub web editor to edit the class reference's XML files. It lacks features to edit XML well, like keeping indentations consistent, and it does not allow amending commits based on reviews.
de: Sofern Sie keine kleineren Änderungen vornehmen, wie z.B. das Korrigieren eines Tippfehlers, empfehlen wir nicht, den GitHub Webeditor zum Bearbeiten der XML-Dateien der Klassenreferenz zu verwenden. Ihm fehlen Features, um XML gut zu bearbeiten, wie z.B. Einrückungen konsistent zu halten, und er erlaubt es nicht, Commits auf der Grundlage von Reviews zu ändern.
zh_tw: 除非你只需要做一些微小的修改，比如修正一個拼寫錯誤，否則我們不建議你使用 GitHub 的網頁編輯器去編輯類參考文件的 XML。

source: It also doesn't allow you to test your changes in the engine or with validation scripts as described in :ref:`doc_class_reference_editing_xml`.
de: Es erlaubt Ihnen auch nicht, Ihre Änderungen in der Engine oder mit Validierungsskripten zu testen, wie in :ref:`doc_class_reference_editing_xml` beschrieben.
zh_tw: 而且，你也沒法在引擎中測試你的修改，也不能像 :ref:`doc_class_reference_writing_guidelines_editing_xml` 中描述的一樣使用校驗腳本。

source: Updating class reference when working on the engine
de: Aktualisierung der Klassenreferenz bei Arbeiten an der Engine
zh_tw: 修改引擎時更新類參考

source: When you create a new class or modify an existing engine's API, you need to re-generate the XML files in ``doc/classes/``.
de: Wenn Sie eine neue Klasse erstellen oder die API einer bestehenden Engine ändern, müssen Sie die XML-Dateien in ``doc/classes/`` neu generieren.
zh_tw: 當你建立了一個新的類或者修改了引擎原有的 API 時，就需要重新生成 ``doc/classes/`` 中的 XML 檔。

source: To do so, you first need to compile Godot. See the :ref:`doc_introduction_to_the_buildsystem` page to learn how. Then, execute the compiled Godot binary from the Godot root directory with the ``--doctool`` option. For example, if you're on 64-bit Linux, the command might be:
de: Dazu müssen Sie zunächst Godot kompilieren. Siehe die Seite :ref:`doc_introduction_to_the_buildsystem`, um zu erfahren, wie. Dann führen Sie die kompilierte Godot-Binärdatei aus dem Godot-Stammverzeichnis mit der Option ``--doctool`` aus. Wenn Sie zum Beispiel ein 64-Bit-Linux verwenden, könnte der Befehl lauten:
zh_tw: 為了達到這個目的，你首先需要編譯 Godot。方法請參閱 :ref:`doc_introduction_to_the_buildsystem` 頁面。然後，在 Godot 根目錄中使用 ``--doctool`` 選項運作編譯出的 Godot 二進位檔案。例如，在 64 位 Linux 下，命令為： ::

source: The exact set of suffixes may be different. Carefully read through the linked article to learn more about that.
de: Die exakte Menge von Suffixen kann unterschiedlich sein. Lesen Sie den verlinkten Artikel sorgfältig durch, um mehr darüber zu erfahren.
zh_tw: 具體的後綴集可能不同。 請仔細閱讀連結裡的文章以瞭解更多資訊。

source: The XML files in ``doc/classes/`` should then be up-to-date with current Godot Engine features. You can then check what changed using the ``git diff`` command.
de: Die XML-Dateien in ``doc/classes/`` sollten dann auf dem aktuellen Stand der Godot-Engine-Features sein. Sie können dann mit dem Befehl ``git diff`` überprüfen, was sich geändert hat.
zh_tw: 接著，doc/classes 內的 XML 應該會更新為目前 Godot Engine 功能的版本。可以使用 ``git diff`` 指令進行確認。如果改動包含了你目前計劃要編輯的說明文件以外的類別，則請先將這些改動 Commit，然後再開始編輯樣板：

source: Please only include changes that are relevant to your work on the API in your commits. You can discard changes in other XML files using ``git checkout``, but consider reporting if you notice unrelated files being updated. Ideally, running this command should only bring up the changes that you yourself have made.
de: Bitte nehmen Sie nur Änderungen in Ihre Commits auf, die für Ihre Arbeit an der API relevant sind. Sie können Änderungen in anderen XML-Dateien mit ``git checkout`` verwerfen, aber Sie sollten es melden, wenn Sie feststellen, dass nicht verwandte Dateien aktualisiert wurden. Idealerweise sollte dieser Befehl nur die Änderungen anzeigen, die Sie selbst vorgenommen haben.
zh_tw: 請僅提交包含與您在 API 上的工作相關的更改。您可以使用 ``git checkout`` 來放棄對其他 XML 檔中的更改，但如果注意到不相關的檔案正在更新，請考慮一下再報告。理想情況下，運作此命令應該只提交您自己所做的更改。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
