Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/first_look_at_the_editor.po
Languages: de, ru, tr, zh_tw

source: First look at Godot's editor
de: Ein erster Blick auf den Godot-Editor
ru: Первый взгляд на редактор Godot
tr: Godot'nun düzenleyicisine ilk bakış
zh_tw: 初步認識 Godot 編輯器

source: This page will give you a brief overview of Godot's interface. We're going to look at the different main screens and docks to help you situate yourself.
de: Diese Seite gibt Ihnen einen kurzen Überblick über die Benutzeroberfläche von Godot. Wir werden uns die verschiedenen Hauptbildschirme und Docks ansehen, um Ihnen zu helfen, sich zurechtzufinden.
ru: Эта страница даст краткий обзор интерфейса Godot. Мы рассмотрим различные основные экраны и панели, чтобы помочь вам сориентироваться.
tr: Bu sayfa size, Godot'nun arayüzü hakkında kısa bir genel bakış verecek. Gözünüzü alıştırmak için, farklı ana ekranlara ve yuvalara bir göz atacağız.
zh_tw: 本頁將向你簡要介紹 Godot 的介面。我們將看看不同的主螢幕和麵板，以説明你確定自己的位置。

source: For a comprehensive breakdown of the editor's interface and how to use it, see the :ref:`Editor manual <toc-learn-editor>`.
de: Eine ausführliche Beschreibung der Benutzeroberfläche des Editors und seiner Bedienung finden Sie im :ref:`Editor-Handbuch <toc-learn-editor>`.
ru: Для всестороннего разбора интерфейса редактора и того, как им пользоваться, смотрите :ref:`Editor manual <toc-learn-editor>`.
tr: Düzenleyicinin arayüzü, ve onu nasıl kullanacağınız hakkında kapsamlı bir analiz için, :ref:`Düzenleyici kılavuzu <toc-learn-editor>` 'na bakınız.
zh_tw: 關於編輯器的介面和使用方法的全面介紹，請參見 :ref:`編輯器手冊 <toc-learn-editor>`。

source: The Project Manager
de: Der Projektmanager
ru: Менеджер проектов
zh_tw: 專案管理員

source: When you launch Godot, the first window you see is the Project Manager. In the default tab **Local Projects**, you can manage existing projects, import or create new ones, and more.
de: Wenn Sie Godot starten, ist das erste Fenster, das Sie sehen, der Projektmanager. Im Default-Tab **Lokale Projekte** können Sie vorhandene Projekte verwalten, neue Projekte importieren oder erstellen, und vieles mehr.
ru: Когда вы запускаете Godot, первое окно, которое вы видите - это Менеджер проектов. На вкладке по умолчанию "Локальные проекты" вы можете управлять существующими проектами, импортировать или создавать новые и многое другое.
zh_tw: 啟動 Godot 後看到的第一個視窗就是專案管理員了。由於目前還沒有專案，所以會出現一個彈窗詢問是否開啟素材庫，這裡先點 [取消]，我們晚點再回來看。

source: At the top of the window, there is another tab named "Asset Library Projects". You can search for demo projects in the open source asset library, which includes many projects developed by the community.
de: Am oberen Rand des Fensters befindet sich ein weiterer Tab mit der Bezeichnung „Asset-Bibliotheks-Projekte“. Hier können Sie nach Demoprojekten in der Open-Source-Asset-Bibliothek suchen, die viele von der Community entwickelte Projekte enthält.
ru: В верхней части окна есть другая вкладка, именуемая "Проекты Библиотеки ассетов". Вы можете искать демо-проекты в библиотеке ресурсов с открытым исходным кодом, которая включает в себя множество проектов, разработанных сообществом.
zh_tw: 視窗頂部還有另一個名為“素材庫專案”的分頁。你可以在開源素材庫中搜索演示專案，其中包括了許多社區開發的專案。

source: To learn the Project Manager's ins and outs, read :ref:`doc_project_manager`.
de: Wenn Sie mehr über den Projektmanager erfahren möchten, lesen Sie :ref:`doc_project_manager`.
ru: Чтобы узнать все тонкости менеджера проекта, прочтите :ref:`doc_project_manager`.
zh_tw: 要進一步瞭解專案管理器，請閱讀 :ref:`doc_project_manager` 。

source: You can also change the editor's language using the drop-down menu to the right of the engine's version in the window's top-right corner. By default, it is in English (EN).
de: Sie können auch die Sprache des Editors ändern, indem Sie das Dropdown-Menü rechts neben der Version der Engine in der rechten oberen Ecke des Fensters verwenden. Standardmäßig ist er auf Englisch (EN) eingestellt.
ru: Вы также можете сменить язык редактора используя выпадающее меню справа от версии движка в правом верхнем углу окна. По умолчанию это английский (EN).
tr: Burada ayrıca düzenleyicinin dilini de değiştirebilirsiniz; pencerenin sağ-üst köşesinde, motor sürümünün sağındaki açılır seçim menüsünü kullanın. İlk başlatmada dil, varsayılan olarak İngilizce (EN) ayarlı gelir.
zh_tw: 你還可以使用視窗右上角的下拉式功能表更改編輯器的語言，就在引擎的版本號右邊。預設語言是英語（EN）。

source: When you open a new or an existing project, the editor's interface appears. Let's look at its main areas.
de: Wenn Sie ein neues oder ein bestehendes Projekt öffnen, erscheint die Benutzeroberfläche des Editors. Schauen wir uns die Hauptbereiche an.
ru: Когда вы открываете новый или существующий проект, появляется интерфейс редактора. Давайте взглянем на основные области.
tr: Yeni ya da var olan bir projeyi açtığınızda, düzenleyici arayüzü açılır. Bunun ana bölgelerine bir bakalım.
zh_tw: 打開新建專案或者已有專案，就會出現編輯器介面。我們來看看它的主要區域。

source: By default, it features **menus**, **main screens**, and playtest buttons along the window's top edge.
de: Standardmäßig verfügt der Editor über **Menüs**, **Hauptbildschirme** und Spieltest-Buttons am oberen Rand des Fensters.
ru: По умолчанию он имеет **меню**, **основные экраны** и кнопку тестового запуска на верхнем крае окна.
tr: Varsayılan olarak, ekranın üst kenarında **menüler**, **ana ekranlar**, ve oynatma düğmeleri yer alır.
zh_tw: 預設情況下，視窗頂部分佈著 **功能表** 、 **主螢幕** 、遊玩測試按鈕。

source: In the center is the **viewport** with its **toolbar** at the top, where you'll find tools to move, scale, or lock the scene's nodes.
de: In der Mitte befindet sich der **Viewport** mit der **Toolbar** am oberen Rand, in der Sie Tools zum Verschieben, Skalieren oder Sperren von Nodes der Szene finden.
ru: В центре находится **окно просмотра** с его **панелью инструментов** вверху, где вы сможете найти инструменты для перемещения, масштабирования или блокировки узлов сцены. Панель изменяется, когда вы переключаетесь между различными рабочими областями.
tr: Orta bölümde sahneyi gördüğümüz **çerçeve** bulunur, ve hemen üstünde ise kendi **araç çubuğu** vardır; burada sahnenizin düğümlerini hareket ettirecek, ölçeklendirecek veya kilitleyecek araçları bulacaksınız..
zh_tw: 畫面的中間上方有 **工具列**，其中有用來移動、縮放或是鎖定場景中物件的工具。這裡的工具會依據所在工作區的不同而改變。

source: On either side of the viewport sit the **docks**. And at the bottom of the window lies the **bottom panel**.
de: Auf beiden Seiten des Viewports befinden sich die **Docks**. Und am unteren Rand des Fensters befindet sich das **Untere Bedienfeld**.
ru: По обе стороны от окна просмотра расположены **доки**. А в нижней части окна лежит **нижняя панель**.
tr: Çerçevenin her iki tarafında **yuvalar** yer alır. Ve en altta ise **alt panel** uzanır.
zh_tw: 視口的兩邊是 **停靠面板** 。視窗底部則是 **底部面板** 。

source: The toolbar changes based on the context and selected node. Here is the 2D toolbar.
de: Die Toolbar ändert sich je nach Kontext und ausgewähltem Node. Hier ist die 2D-Toolbar.
ru: Изменения панели инструментов зависит от контекста и выбранного узла. Это панель инструментов для 2D.
tr: Araç çubuğu içeriğe ve seçili düğümlere bağlı olarak değişir. Burada 2B araç çubuğu görünüyor.
zh_tw: 工具列會隨著本文和所選節點改變。這裡展示的是 2D 工具列。

source: Below is the 3D one.
de: Hier ist die 3D-Version.
ru: Ниже — для 3D.
tr: Aşağıdaki ise 3B için olanı.
zh_tw: 下面這個是 3D 的。

source: Let's look at the docks. The **FileSystem** dock lists your project files, including scripts, images, audio samples, and more.
de: Schauen wir uns die Docks an. Das **Dateisystem**-Dock listet Ihre Projektdateien auf, darunter Skripte, Bilder, Audio-Samples und mehr.
ru: Давайте взглянем на панели. В панели «Файловая система» перечислены файлы вашего проекта, включая скрипты, изображения, аудио и многое другое.
zh_tw: 我們來看看停靠面板。 **檔案系統** 面板會列出專案中的檔，包括腳本、圖片、音訊取樣等。

source: The **Scene** dock lists the active scene's nodes.
de: Das **Szenen**-Dock listet die aktiven Nodes der Szene auf.
ru: Панель **Scene** (**Сцена**) отображает активные узлы сцены.
tr: **Sahne** yuvası, etkin durumda olan sahnenin düğümlerini gösterir.
zh_tw: **場景** 面板會列出活動場景中的節點。

source: The **Inspector** allows you to edit the properties of a selected node.
de: Mit dem **Inspektor** können Sie die Eigenschaften eines ausgewählten Nodes bearbeiten.
ru: **Inspector** (**Инспектор**) позволяет вам редактировать свойства выбранного узла.
tr: **Denetleyici**, seçili durumdaki düğümün özelliklerini düzenlemenizi sağlar. (Filtreleme kutusunun yanındaki simge yardımıyla özellik isimlerini görüntüleme tarzını "ham: betik içi ismi", "Büyük harfli: İngilizce ismi" ve "Yerelleştirilmiş: Türkçe İsmi" olarak değiştirebilirsiniz).
zh_tw: 你可以在 **屬性面板** 中編輯所選節點的屬性。

source: The **bottom panel**, situated below the viewport, is the host for the debug console, the animation editor, the audio mixer, and more. They can take precious space, that's why they're folded by default.
de: Das **Untere Bedienfeld**, das sich unterhalb des Viewports befindet, beherbergt die Debug-Konsole, den Animations-Editor, den Audiomixer und vieles mehr. Diese können wertvollen Platz einnehmen, deshalb sind sie standardmäßig eingeklappt.
ru: **Нижняя панель** под окном просмотра включает в себя консоль отладки, редактор анимации, аудиомикшер и многое другое. Они широкие и могут занимать много драгоценного пространства, поэтому по умолчанию они свернуты.
tr: Çerçevenin hemen altında bulunan **Alt Panel**, hata ayıklama uç-birimi, animasyon düzenleyicisi, ses karıştırıcısı, ve daha fazlasına ev sahipliği yapar. Bunlar ekranda çok yer kaplayabilirler, bu yüzden varsayılan olarak katlanmış olarak gelir.
zh_tw: **底部面板** 裡有除錯主控台、動畫編輯器、音效混合器…等。這些東西很多且佔用很多空間，所以預設會摺疊起來。

source: When you click on one, it expands vertically. Below, you can see the animation editor opened.
de: Wenn Sie auf eines klicken, wird es vertikal erweitert. Unten sehen Sie den geöffneten Animations-Editor.
ru: Когда вы нажимаете на один из них, он вертикально расширяется. Ниже вы можете увидеть открытый редактор анимации.
tr: Bunlardan birinin üzerine tıkladığınızda, dikey yönde genişler. Aşağıda, açılmış animasyon düzenleyiciyi görebilirsiniz.
zh_tw: 點擊某一個就會在垂直方向展開。下面展示的是打開的動畫編輯器。

source: The four main screens
de: Die vier Hauptbildschirme
ru: Четыре основных экрана
tr: Dört ana sahne
zh_tw: 四個主螢幕

source: There are four main screen buttons centered at the top of the editor: 2D, 3D, Script, and AssetLib.
de: Im oberen Bereich des Editors befinden sich vier Buttons: 2D, 3D, Skript und AssetLib.
ru: В верхней части редактора расположены четыре кнопки рабочего пространства: 2D, 3D, Script и AssetLib.
tr: Düzenleyicinin üst kısmına ortalanmış dört ana ekran düğmeleri yer alır: 2B, 3B, Betik ve VarlıkKütüphanesi.
zh_tw: 上方有四個工作區按鈕：[2D]、[3D]、[腳本]、[素材庫] 等。

source: You'll use the **2D screen** for all types of games. In addition to 2D games, the 2D screen is where you'll build your interfaces.
de: Sie werden den **2D-Bildschirm** für alle Arten von Spielen verwenden. Neben 2D-Spielen ist der 2D-Bildschirm der Ort, an dem Sie Ihre Benutzeroberflächen erstellen werden.
ru: Вы будете использовать **2D-пространство** для всех типов игр. Кроме непосредственно 2D-игр, там вы будете создавать свои интерфейсы. Нажмите :kbd:`Ctrl + F1` (или :kbd:`Alt + 1` на macOS) для доступа к нему.
tr: **2B ekran** 'ı her tür oyun için kullanacaksınız. 2B oyunlara ek olarak, 2B ekran arayüzleri oluşturacağınız yer burasıdır.
zh_tw: 所有型別的遊戲都會用到 **2D 工作區**。而 2D 工作區除了製作 2D 遊戲以外，也用來製作界面。按 :kbd:`F1` (或是 macOS 上 :kbd:`Alt + 1`) 來打開。

source: In the **3D screen**, you can work with meshes, lights, and design levels for 3D games.
de: Im **3D-Bildschirm** können Sie mit Meshes und Lichtern arbeiten und Level für 3D-Spiele entwerfen.
ru: В **3D-пространстве** вы можете работать с сетками (meshes), освещением и дизайном уровней для 3D-игр. Нажмите :kbd:`Ctrl + F2` (или :kbd:`Alt + 2` на macOS) для доступа к нему.
tr: **3B ekran** ile, 3B oyunlar için örgüler ve ışıklar ile çalışıp oyun seviyelerini tasarlayabilirsiniz.
zh_tw: **3D 工作區** 可以建立網格、光照以及設計 3D 遊戲的關卡。按 :kbd:`F2` (或 macOS 上 :kbd:`Alt + 2`) 來打開。

source: Notice the perspective button under the toolbar. Clicking on it opens a list of options related to the 3D view.
de: Beachten Sie den „Perspektivisch“-Button unter der Toolbar. Wenn Sie darauf klicken, wird eine Liste mit Optionen für die 3D-Ansicht geöffnet.
ru: Обратите внимание на кнопку *Perspective* (Перспектива) под панелью инструментов. Она открывает меню настроек 3D-обзора.
tr: Araç çubuğunun hemen altındaki bakış açısı düğmesine dikkat edin. Buna basarak 3B görüntü ile ilgili seçeneklerin olduğu bir listeyi açarsınız.
zh_tw: 另外請注意工具列下方的 [透視] 按鈕，可以打開與 3D 檢視區相關的選項列表。

source: Read :ref:`doc_introduction_to_3d` for more detail about the **3D main screen**.
de: Lesen Sie :ref:`doc_introduction_to_3d` für weitere Informationen zum **3D-Arbeitsbereich**.
ru: Прочитайте :ref:`doc_introduction_to_3d` для более подробной информации о **3D-пространстве**.
tr: **3B ana ekranı** hakkında daha fazla bilgi için :ref:`doc_introduction_to_3d`sayfasını okuyun.
zh_tw: 關於 **3D 工作區** 的詳細介紹請參考 :ref:`doc_introduction_to_3d`。

source: The **Script screen** is a complete code editor with a debugger, rich auto-completion, and built-in code reference.
de: Der **Skript-Bildschirm** ist ein vollständiger Code-Editor mit Debugger, umfassender Autovervollständigung und integrierten Code-Referenzen.
ru: Экран **Script** — это полноценный редактор кода с отладчиком, богатым автозаполнением и встроенной справкой по коду.
tr: **Betik ekranı** kendi hata ayıklayıcısı, zengin oto-tamamlaması, ve yerleşik kod başvurusu bulunan tam özellikli bir kod düzenleyicidir.
zh_tw: **Script 螢幕** 是一個完整的程式碼編輯器，包含除錯器、豐富的自動補全、內建程式碼參考手冊。

source: Finally, the **AssetLib** is a library of free and open source add-ons, scripts, and assets to use in your projects.
de: Die **AssetLib** schließlich ist eine Bibliothek mit freien und quelloffenen Add-ons, Skripten und Assets, die Sie in Ihren Projekten verwenden können.
ru: Наконец, **AssetLib** - это библиотека бесплатных дополнений, скриптов и ассетов для дальнейшего использования в ваших проектах.
zh_tw: 最後，**素材庫** 內提供自由開源的擴充套件、腳本與素材，可以在專案中使用。

source: You can learn more about the asset library in :ref:`doc_what_is_assetlib`.
de: Weitere Informationen über die Asset-Bibliothek finden Sie unter :ref:`doc_what_is_assetlib`.
ru: Вы можете узнать больше о библиотеке ресурсов в статье :ref:`doc_what_is_assetlib`.
tr: Varlık kütüphanesi hakkında daha fazlasını :ref:`doc_what_is_assetlib` sayfasında öğrenebilirsiniz.
zh_tw: 你可以在 :ref:`doc_what_is_assetlib` 中瞭解更多關於素材庫的內容。

source: Integrated class reference
de: Integrierte Klassenreferenz
ru: Справочник по интегрированным классам
tr: Bütünleşik sınıf başvurusu
zh_tw: 如何撰寫類別參照文件

source: Godot comes with a built-in class reference.
de: Godot verfügt über eine integrierte Klassenreferenz.
ru: Godot поставляется со встроенным справочником классов.
tr: Godot, yerleşik sınıf başvurusu ile gelir.
zh_tw: Godot 自帶內建類別參考手冊。

source: You can search for information about a class, method, property, constant, or signal by any one of the following methods:
de: Sie können nach Informationen über eine Klasse, Methode, Eigenschaft, Konstante oder ein Signal mit einer der folgenden Methoden suchen:
ru: Вы можете найти информацию о классе, методе, свойстве, константе или сигнале одним из следующих способов:
tr: Aşağıdaki yöntemlerin herhangi birini kullanarak bir sınıf, yöntem, özellik, sabit, veya sinyal hakkında bilgiyi, düzenleyiciden ayrılmadan arayabilirsiniz:
zh_tw: 你搜尋有關類別、方法、屬性、常數或訊號的資訊時，可用以下方法:

source: Pressing :kbd:`F1` (or :kbd:`Alt + Space` on macOS, or :kbd:`fn + F1` for laptops with a :kbd:`fn` key) anywhere in the editor.
de: Druck auf :kbd:`F1` (oder :kbd:`Alt + Leertaste` unter macOS, oder :kbd:`fn + F1` für Laptops mit einer :kbd:`fn` Taste) irgendwo im Editor.

source: Clicking the "Search Help" button in the top-right of the Script main screen.
de: Klick auf den „Hilfe durchsuchen“-Button oben rechts im Skript-Hauptbildschirm.
ru: Нажав кнопку "Search Help" ("Справка") в правом верхнем углу экрана написания скриптов.
tr: Betik ana ekranının üst sağ kısmındaki "Yardım Ara" düğmesine tıklamak.
zh_tw: 點擊 Script 主螢幕右上角的“搜索説明”按鈕。

source: Clicking on the Help menu and Search Help.
de: Klick auf das Hilfe-Menü und „Hilfe durchsuchen“.
ru: Нажатием на "Справка" в меню "Справка".
tr: Yardım menüsüne, oradan Yardım Ara'ya tıklamak.
zh_tw: 點擊“説明”功能表的“搜索説明”。

source: Clicking while pressing the :kbd:`Ctrl` key on a class name, function name, or built-in variable in the script editor.
de: Klick auf einen Klassennamen, Funktionsnamen oder eine Built-in-Variable im Skript-Editor bei gedrückter :kbd:`Strg`-Taste.
tr: Betik düzenleyici içinden, :kbd:`Ctrl` tuşu basılıyken, bir sınıf ismine, fonksiyon ismine, ya da yerleşik bir değişkene tıklamak.
zh_tw: 在腳本編輯器中，按住 :kbd:`Ctrl` 鍵點擊類別名稱、函式名、內建變數。

source: When you do any of these, a window pops up. Type to search for any item. You can also use it to browse available objects and methods.
de: Wenn Sie eine dieser Aktionen durchführen, öffnet sich ein Fenster. Beginnen Sie zu tippen, um nach einem beliebigen Element zu suchen. Sie können das Fenster auch nach verfügbaren Objekte und Methoden durchsuchen.
ru: Когда вы совершаете любое из этих действий, появляется окно. Введите текст для поиска любого элемента. Вы также можете использовать его для просмотра доступных объектов и методов.
tr: Bunlardan birini yaptığınızda, bir pencere açılır. Herhangi bir öğeyi aramak için ismini yazın. Ayrıca burayı, kullanabileceğiniz nesne ve yöntemleri taramak içinde kullanabilirsiniz.
zh_tw: 執行其中的任意操作都會彈出一個視窗。通過輸入進行搜索。你也可以用它來查看所有物件和方法。

source: Double-click on an item to open the corresponding page in the script main screen.
de: Doppelklicken Sie auf einen Eintrag, um die entsprechende Seite im Skript-Hauptfenster zu öffnen.
ru: Двойное нажатие по элементу откроет соответствующую страницу в экране написания скриптов.
tr: Öğenin üzerine çift tıklamak, bunun ilgili sayfasını betik ana ekranında açar.
zh_tw: 在條目上按兩下就會在腳本主螢幕中打開對應的頁面。

source: Translation status
de: Übersetzungsstatus
ru: Статус перевода
tr: Çeviri durumu
zh_tw: 翻譯狀態
