Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: de, tr

source: Godot's design philosophy
de: Godots Design-Philosophie
tr: Godot'un tasarım felsefesi

source: Now that you've gotten your feet wet, let's talk about Godot's design.
de: Nun, da Sie sich einen Überblick verschafft haben, lassen Sie uns über Godots Design sprechen.
tr: Artık ayaklarınızı ıslattığınıza göre, hadi birazda Godot'nun tasarımı hakkında konuşalım.

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, but the design of each engine is unique. This leads to different workflows and different ways to form your games' structures. This all stems from their respective design philosophies.
de: **Jede Spiele-Engine ist anders und erfüllt unterschiedliche Bedürfnisse.** Sie bieten nicht nur eine Reihe von Features, sondern auch ein jeweils einzigartiges Engine-Design. Dies führt zu unterschiedlichen Arbeitsabläufen und unterschiedlichen Möglichkeiten, die Strukturen Ihrer Spiele zu gestalten. Dies alles ergibt sich aus ihren jeweiligen Designphilosophien.
tr: **Her oyun motoru farklıdır ve farklı ihtiyaçları karşılar.** Sadece çok çeşitli özellikler sunmakla kalmazlar, ayrıca hepsinin tasarımı da farklıdır. Bu da farklı iş akışlarına, ve oyununuzun yapısını belirlemek için farklı yollara sebep olur. Bu ise kendilerine özgü tasarım felsefesinden kaynaklanır.

source: This page is here to help you understand how Godot works, starting with some of its core pillars. It is not a list of available features, nor is it an engine comparison. To know if any engine can be a good fit for your project, you need to try it out for yourself and understand its design and limitations.
de: Diese Seite soll Ihnen helfen, die Funktionsweise von Godot zu verstehen, angefangen bei einigen Grundpfeilern. Es ist keine Liste verfügbarer Features und auch kein Engine-Vergleich. Um herauszufinden, ob eine Engine für Ihr Projekt gut geeignet ist, müssen Sie sie selbst ausprobieren und deren Design und Einschränkungen verstehen.
tr: Bu sayfa, bazı temel yapıtaşlarından başlayarak, Godot'nun nasıl çalıştığını anlamanıza yardım etmek için burada. Bu, kullanılabilir özelliklerin bir listesi değildir, ya da motorların bir karşılaştırması değildir. Bir motorun projeniz için uygun olup olmadığını anlamak için, ilk önce onu kendiniz denemeli, ve tasarımını ve sınırlarını anlamalısınız.

source: Please watch `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ if you're looking for an overview of the engine's features.
de: Bitte schauen Sie sich `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ an, wenn Sie einen Überblick über die Features der Engine suchen.
tr: Eğer motorun özelliklerine genel bir bakış arıyorsanız, lütfen `5 dakikada Godot 'yu açıklamak (ingilizce) <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ videosunu izleyin.

source: Object-oriented design and composition
de: Objektorientiertes Design und Komposition
tr: Nesne-tabanlı tasarım ve bileşim

source: Godot embraces object-oriented design at its core with its flexible scene system and Node hierarchy. It tries to stay away from strict programming patterns to offer an intuitive way to structure your game.
de: Godot setzt auf objektorientiertes Design mit seinem flexiblen Szenensystem und der Node-Hierarchie. Die Engine versucht sich von strengen Programmier-Patterns fernzuhalten, um das Spiel intuitiv zu strukturieren.
tr: Godot, çekirdeğinde, esnek sahne sistemi ve düğüm hiyerarşisi ile nesne-yönelimli tasarımı benimser. Oyununuzu yapılandırmanız için sezgisel bir yol sunmak amacıyla, sıkı programlama kalıplarından uzak durmaya çalışır.

source: For one, Godot lets you **compose or aggregate** scenes. It's like nested prefabs: you can create a BlinkingLight scene and a BrokenLantern scene that uses the BlinkingLight. Then, create a city filled with BrokenLanterns. Change the BlinkingLight's color, save, and all the BrokenLanterns in the city will update instantly.
de: Sie können zum Beispiel mit Godot Szenen **zusammenstellen oder zusammenfassen**. Es ist wie verschachtelte Fertigteile: Sie können eine BlinkingLight-Szene und einer BrokenLantern-Szene erstellen, die BlinkingLight verwendet. Dann erstellen Sie eine Stadt mit BrokenLanterns. Ändern Sie die Farbe des BlinkingLight, speichern es und alle BrokenLanterns Objekte in der Stadt werden sofort aktualisiert.
tr: Godot, en başta, sahnelerinizi **birleştirmeye veya kümelemeye** izin verir. Bu, içiçe geçmiş önyapılar gibidir: bir YanıpSönenIşık sahnesi oluşturup, sonra bunu içinde kullanan bir KırıkFener sahnesi oluşturabilirsiniz. Daha sonra bu KırıkFener'ler ile dolu bir şehir oluşturabilirsiniz. YanıpSönenIşık'ın rengini değiştirip kaydettiğinizde, bütün şehirdeki KırıkFener'ler anında güncellenecektir.

source: On top of that, you can **inherit** from any scene.
de: Darüber hinaus können Sie von jeder Szene **erben**.
tr: Bunun ötesinde, herhangi bir sahneden **içe aktar* 'abilirsiniz.

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you'd like. It works like a class in pure code, except you're free to design it by using the editor, using only the code, or mixing and matching the two.
de: Eine Godot-Szene kann eine Waffe, ein Charakter, ein Gegenstand, eine Tür, ein Level, ein Teil eines Levels sein... Alles, was Sie möchten. Sie funktioniert wie eine Klasse in reinem Code, außer dass Sie sie frei gestalten können, indem Sie den Editor oder nur den Code verwenden oder beides kombinieren.
tr: Bir Godot sahnesi bir Silah, bir Karakter, bir Eşya, bir Kapı, bir Seviye, bir seviyenin bir parçası... istediğiniz her şey olabilir. Saf kodun içindeki bir sınıf gibi çalışır, tek farkı bunları düzenleyiciyi kullanarak, veya sadece kod kullanarak, ya da her ikisini karıştırarak ve eşleştirerek tasarlamakta özgür olmanız..

source: It's different from prefabs you find in several 3D engines, as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game's design.
de: Sie unterscheidet sich von den Prefabs, die Sie in verschiedenen 3D-Engines finden, da Sie von diesen Szenen erben und sie erweitern können. Sie können einen Magier erstellen, der Ihren Charakter erweitert. Wenn Sie den Charakter im Editor ändern, wird auch der Magier aktualisiert. Es hilft Ihnen, Ihre Projekte so aufzubauen, dass ihre Struktur mit dem Design des Spiels übereinstimmt.
tr: Bu, diğer pek çok 3B motorda bulacağınız önyapı'lardan farklıdır, çünkü daha sonra bu sahnelerden kalıtım alabilir ve bunları genişletebilirsiniz. Character sahnenizden (karakter) bir Magician (sihirbaz) oluşturabilirsiniz. Düzenleyicide karakter üzerinde değişiklik yaparsanız, sihirbaz da aynı şekilde güncellenecektir. Bu da, projenizi derlediğinizde, bunların yapılarının oyunun tasarımına uygun olmaları için yardımcı olur.

source: Also note that Godot offers many different types of objects called nodes, each with a specific purpose. Nodes are part of a tree and always inherit from their parents up to the Node class. Although the engine does feature some nodes like collision shapes that a parent physics body will use, most nodes work independently from one another.
de: Beachten Sie auch, dass Godot viele verschiedene Arten von Objekten anbietet, die als Nodes bezeichnet werden und jeweils einen bestimmten Zweck haben. Nodes sind Teil eines Baums und erben immer von ihren Parents bis hin zur Klasse Node. Obwohl die Engine über einige Nodes verfügt, wie z.B. Kollisions-Shapes, die von einem übergeordneten Physik-Bodies verwendet werden, arbeiten die meisten Nodes unabhängig voneinander.
tr: Ayrıca, Godot'nun düğüm olarak adlandırılan, herbiri kendine özgü amaçları olan, çok çeşitli tiplerde nesneler sunduğuna dikkat edin. Düğümler bir ağacın parçalarıdır, ve en üstte Node (düğüm) sınıfının yer aldığı üst-öğelerden miras alırlar. Motorun sunduğu çarpışma şekilleri gibi bazı düğümler bir üst-öğenin fizik cisimi tarafından kullanılsa da, düğümlerin çoğunluğu diğer düğümlerden bağımsız olarak çalışırlar.

source: In other words, Godot's nodes do not work like components in some other game engines.
de: Mit anderen Worten, Godots Nodes funktionieren nicht wie Komponenten in einigen anderen Spiele-Engines.
tr: Bir başka deyişle Godot'nun düğümleri, diğer bazı oyun motorlarındaki bileşenler gibi işlemezler.

source: Sprite2D is a Node2D, a CanvasItem and a Node. It has all the properties and features of its three parent classes, like transforms or the ability to draw custom shapes and render with a custom shader.
de: Sprite ist ein Node2D, ein CanvasItem und ein Node. Er verfügt über alle Eigenschaften und Features der drei Parent-Klassen, z.B. Transforms oder die Möglichkeit, benutzerdefinierte Shapes zu zeichnen und mit einem benutzerdefinierten Shader zu rendern.

source: All-inclusive package
de: Rundum-sorglos-Paket
tr: Her-şeyi-içeren paket

source: Godot tries to provide its own tools to answer most common needs. It has a dedicated scripting workspace, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, the ability to hot-reload locally and on remote devices, etc.
de: Godot versucht, seine eigenen Tools zur Verfügung zu stellen, um die häufigsten Bedürfnisse zu erfüllen. Es verfügt über einen dedizierten Skripting-Arbeitsbereich, einen Animations-Editor, einen Tilemap-Editor, einen Shader-Editor, einen Debugger, einen Profiler, die Fähigkeit, Hot-Reloads lokal und auf Remote-Geräten usw. durchzuführen.
tr: Godot, en genel ihtiyaçları karşılamak için kendi araçlarını sunmaya çalışır. Betik yazmaya adanmış bir çalışma alanı, bir animasyon düzenleyici, bir karoharitası düzenleyici, bir gölgelendirici düzenleyici, bir hata ayıklayıcı, bir profil çıkarıcı, yerelde yada uzak cihazlarda sıcak-yükleme yapabilme yeteneği, vb araçlara sahiptir.

source: The goal is to offer a full package to create games and a continuous user experience. You can still work with external programs as long as there is an import plugin available in Godot for it. Or you can create one, like the `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
de: Ziel ist es, ein komplettes Paket zum Erstellen von Spielen und ein durchgängiges Benutzererlebnis anzubieten. Sie können immer noch mit externen Programmen arbeiten, solange es ein Import-Plugin in Godot dafür gibt. Oder Sie können eines erstellen, wie den `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.

source: That is also partly why Godot offers its own programming language GDScript along with C#. GDScript is designed for the needs of game developers and game designers, and is tightly integrated in the engine and the editor.
de: Das ist auch teilweise der Grund, warum Godot neben C# seine eigene Programmiersprache GDScript anbietet. GDScript ist auf die Bedürfnisse von Spieleentwicklern und Spieledesignern zugeschnitten und ist eng in die Engine und den Editor integriert.

source: GDScript lets you write code using an indentation-based syntax, yet it detects types and offers a static language's quality of auto-completion. It is also optimized for gameplay code with built-in types like Vectors and Colors.
de: Mit GDScript können Sie einfachen Code mit Python-ähnlicher Syntax schreiben, jedoch erkennt es Typen und bietet die Vorzüge der Autovervollständigung einer statischen Sprache. Es ist auch für Gameplay-Code mit Built-in-Typen wie Vectors und Colors optimiert.
tr: GDScript size, kodlarınızı girinti-temelli söz dizimi ile yazmayı sağlar, ama ayrıca tipleri algılar ve statik bir dil kalitesinde oto-tamamlama özelliği de sunar. Bunun yanında, Vector (vektör) ve Color (renk) gibi yerleşik tiplerle oynanış kodlama için en iyileştirilmiştir.

source: Note that with GDExtension, you can write high-performance code using compiled languages like C, C++, Rust, D, Haxe, or Swift without recompiling the engine.
de: Beachten Sie, dass Sie mit der GDExtension leistungsstarken Code in kompilierten Sprachen wie C, C++, Rust, D, Haxe oder Swift schreiben können, ohne die Engine neu zu kompilieren.

source: Note that the 3D workspace doesn't feature as many tools as the 2D workspace. You'll need external programs or add-ons to edit terrains, animate complex characters, and so on. Godot provides a complete API to extend the editor's functionality using game code. See `The Godot editor is a Godot game`_ below.
de: Beachten Sie, dass der 3D-Arbeitsbereich nicht so viele Tools enthält wie der 2D-Arbeitsbereich. Sie benötigen externe Programme oder Add-ons um Gelände zu bearbeiten, komplexe Charaktere zu animieren und so weiter. Godot bietet eine komplette API, um die Funktionalität des Editors mit Hilfe von Spiele-Code zu erweitern. Siehe `Der Godot-Editor ist ein Godot-Spiel`_ unten.
tr: 3B çalışma alanının, 2B çalışma alanı kadar çok araç barındırmadığına dikkat edin. Arazi düzenlemeleri, karmaşık karakter canlandırmaları, ve diğer pek çok şey için harici programlar veya eklentilere ihtiyacınız olacak. Godot, oyun kodları kullanarak düzenleyicinin işlevselliğini genişletmeniz için tamamlanmış bir API sunar. Aşağıdaki `Godot düzenleyicisi bir Godot oyunudur`_ kısmına bakınız.

source: *A State Machine editor plugin in Godot 2 by kubecz3k. It lets you manage states and transitions visually.*
de: *Ein State Machine Editor Plugin in Godot 2 von kubecz3k. Mit ihm können Sie Zustände und Übergänge visuell verwalten.*
tr: *kubecz3k tarafından Godot 2 için yazılmış bir State Machine (durum makinesi) düzenleyici eklentisi. Durumları ve geçişleri görsel olarak yönetmenizi sağlar.*

source: Godot offers a fully open source codebase under the **MIT license**. This means all the technologies that ship with it have to be Free (as in freedom) as well. For the most part, they're developed from the ground up by contributors.
de: Godot bietet eine vollständig quelloffene Code-Basis unter der **MIT-Lizenz** an. Das bedeutet, dass alle Technologien, die mit ihm ausgeliefert werden, auch frei sein müssen ("frei" im Sinne von Freiheit). Sie werden größtenteils von Mitwirkenden von Grund auf entwickelt.
tr: Godot, **MIT lisansı** altında tamamen açık kaynaklı bir kod tabanı sunar. Bunun anlamı, onunla gelen bütün teknolojilerin de özgür (özgürlük anlamında) olması gerek demektir. Bunların pek çoğu, katkıda bulunanlar tarafından sıfırdan geliştirilmişlerdir.

source: Anyone can plug in proprietary tools for the needs of their projects — they just won't ship with the engine. This may include Google AdMob, or FMOD. Any of these can come as third-party plugins instead.
de: Jeder kann proprietäre Tools für die Bedürfnisse seiner Projekte einsetzen - sie werden aber nicht mit der Engine ausgeliefert. Dies kann NVIDIA PhysX, Google AdMob oder ein FBX-Modell-Importer sein. Jedes dieser Plugins kann stattdessen als Drittanbieter-Plugin mitgeliefert werden.
tr: Herkes, projelerinin ihtiyaçları doğrultusunda tescilli araçları ekleyebilirler - tek fark bunların motorun içinde gelmemeleri. Bunların arasında Google AdMob, ya da FMOD sayılabilir. Bunların her biri, üçüncü-taraf eklentiler olarak gelebilirler.

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart's content. You can also debug games easily, as Godot will print errors with a stack trace, even if they come from the engine itself.
de: Auf der anderen Seite bedeutet eine offene Codebasis, dass Sie **von der Engine lernen und sie erweitern** können. Sie können auch Spiele leicht debuggen, da Godot Fehler mit einem Stack Trace ausgibt, auch wenn sie von der Engine selbst stammen.
tr: Diğer taraftan, açık kodtabanı demek **motoru, kendisinden öğrenebilir** ve içinizden geldiği gibi **genişletebilirsiniz** demektir. Ayrıca, oyunların hatalarını kolayca ayıklayabilirsiniz çünkü Godot, motorun kendi içinden geliyor olsalar bile, hataları bir izleme yığını şeklinde yazdıracaktır.

source: This **does not affect the work you do with Godot** in any way: there's no strings attached to the engine or anything you make with it.
de: Dies **beeinflusst in keiner Weise die Arbeit, die Sie mit Godot machen**: Es gibt keine Bedingungen, die an die Engine geknüpft sind, oder irgendetwas, das Sie damit machen.
tr: Bu, hiç bir şekilde **Godot ile çalışma şeklinizi etkilemez**: motorun kendisiyle, ya da yaptığınız herhangi bir şey ile hiç bir bağı yoktur.

source: Community-driven
de: Community-gesteuert
tr: Topluluk-odaklı

source: **Godot is made by its community, for the community, and for all game creators out there.** It's the needs of the users and open discussions that drive the core updates. New features from the core developers often focus on what will benefit the most users first.
de: **Godot wird von seiner Community, für die Community, und für alle Spieleentwickler da draußen entwickelt.** Es sind die Bedürfnisse der Nutzer und offene Diskussionen, die Kern-Updates vorantreiben. Neue Features der Kernentwickler konzentrieren sich oft darauf, was den meisten Nutzern zuerst nützt.
tr: **Godot, topluluk tarafından, topluluk için, ve dışarıdaki bütün oyun yaratıcıları için yapıldı.** Çekirdek güncellemelerinde, kullanıcıların ihtiyaçları ve açık tartışmalar etkilidir. Çekirdek geliştiricilerin getirdiği yeni özellikler, en başta kullanıcıların en çok yararlanacağı şeylere odaklıdır.

source: That said, although a handful of core developers work on it full-time, the project has over 600 contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you'll see improvements in all corners of the engine at the same time in every major release.
de: Obwohl nur eine handvoll Kernentwickler in Vollzeit an der Engine arbeiten, hat das Projekt zum Zeitpunkt des Schreibens dieses Textes über 600 Mitwirkende. Programmierer arbeiten an Features, die sie möglicherweise selbst benötigen. Dadurch sieht man Verbesserungen in allen Teilen der Engine in jedem größeren Release.
tr: Bunu demişken, çekirdek geliştiriclerden sadece bir kaçı tam-zamanlı çalışmasına rağmen, bu yazının yazım tarihi itibariyle projenin 600 den fazla katkıda bulunanı bulunuyor. Hayırsever programcılar, kendilerinin de ihtiyaç duydukları özellikler üzerinde çalışıyor, yani her büyük güncellemeyle aynı anda motorun her köşesinden geliştirmeler görebilirsiniz.

source: The Godot editor is a Godot game
de: Der Godot-Editor ist ein Godot-Spiel
tr: Godot düzenleyicisi bir Godot oyunudur

source: The Godot editor runs on the game engine. It uses the engine's own UI system, it can hot-reload code and scenes when you test your projects, or run game code in the editor. This means you can **use the same code** and scenes for your games, or **build plugins and extend the editor.**
de: Der Godot-Editor läuft auf der Spielengine. Er verwendet das eigene UI-System der Engine und kann beim Testen von Projekten Code und Szenen per Hot-Reload laden oder Spielcode im Editor ausführen. Das bedeutet, dass Sie **denselben Code** und dieselben Szenen für Ihre Spiele verwenden oder **Plugins erstellen und den Editor erweitern können.**
tr: Godot düzenleyicinin kendisi de oyun motoru üzerinde çalışır. Motorun kendi arayüz sistemini kullanır, projenizi test ederken kodları ve sahneleri sıcak-tekrar-yükleyebilir, veya oyun kodunu düzenleyicide çalıştırabilir. Bunun anlamı, **aynı kodları kullanarak** oyunlarınızda sahneler oluşturabilir, veya **eklentiler yazıp düzenleyiciyi genişletebilirsiniz.**

source: This leads to a reliable and flexible UI system, as it powers the editor itself. With the ``@tool`` annotation, you can run any game code in the editor.
de: Dies führt zu einem zuverlässigen und flexiblen UI-System, da es den Editor selbst steuert. Mit der Annotation ``@tool`` können Sie beliebigen Spielcode im Editor ausführen.

source: *RPG in a Box is a voxel RPG editor made with Godot 2. It uses Godot's UI tools for its node-based programming system and for the rest of the interface.*
de: *RPG in a Box ist ein Voxel-RPG-Editor, der mit Godot 2 erstellt wurde. Er verwendet Godots UI-Tools für sein Node-basiertes Programmiersystem und für den Rest der Benutzeroberfläche.*
tr: *RPG in a Box, Godot 2 ile yapılmış bir voxel RPG düzenleyicisidir. Düğüm-tabanlı programlama sistemi ve arayüzünün geri kalanı için, Godot'nun arayüz araçlarını kullanır.*

source: Put the ``@tool`` annotation at the top of any GDScript file and it will run in the editor. This lets you import and export plugins, create plugins like custom level editors, or create scripts with the same nodes and API you use in your projects.
de: Setzen Sie das Schlüsselwort ``@tool`` an den Anfang einer beliebigen GDScript-Datei und sie wird im Editor ausgeführt. Auf diese Weise können Sie Plugins importieren und exportieren, Plugins wie z.B. benutzerdefinierte Level-Editoren erstellen oder Skripte mit denselben Nodes und APIs erstellen, die Sie in Ihren Projekten verwenden.

source: The editor is fully written in C++ and is statically compiled into the binary. This means you can't import it as a typical project that would have a ``project.godot`` file.
de: Der Editor ist vollständig in C++ geschrieben und wird statisch in die Binärdatei kompiliert. Das bedeutet, dass Sie ihn nicht wie ein typisches Projekt importieren können, das eine ``project.godot`` Datei hat.
tr: Düzenleyicinin tamamı C++ ile yazılmış, ve çalıştırılabilir dosyası statik olarak derlenmiştir. Bu nedenle onu, ``project.godot`` dosyası içeren tipik bir proje gibi içe aktaramazsınız.

source: Separate 2D and 3D engines
de: Separate 2D- und 3D-Engines
tr: Ayrı 2B ve 3B motorlar

source: Godot offers dedicated 2D and 3D rendering engines. As a result, **the base unit for 2D scenes is pixels.** Even though the engines are separate, you can render 2D in 3D, 3D in 2D, and overlay 2D sprites and interfaces over your 3D world.
de: Godot bietet dedizierte 2D- und 3D-Rendering-Engines an. Daher ist **die Basiseinheit für 2D-Szenen Pixel.** Obwohl die Engines getrennt sind, können Sie 2D in 3D und 3D in 2D rendern sowie 2D-Sprites und -Benutzeroberflächen über Ihre 3D-Welt platzieren.
tr: Godot, adanmış 2B ve 3B işleme motorları sunar. Sonuç olarak, **2B sahneler için temel birim piksellerdir**. Motorlar ayrı olsa bile, 3B içinden 2B, 2B içinden 3B, ve 3B dünyanızın üzerinde kaplama şeklinde 2B grafik öğeleri ve arayüzleri işleyebilirsiniz.

source: Translation status
de: Übersetzungsstatus
tr: Çeviri durumu

source: Open source
tr: Açık kaynaklı
