Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/introduction_to_godot.po
Languages: ja, ko, pl, zh_tw

source: Introduction to Godot
ja: Godot入門
ko: Godot 소개
zh_tw: 序言

source: This article is here to help you figure out whether Godot might be a good fit for you. We will introduce some broad features of the engine to give you a feel for what you can achieve with it and answer questions such as "what do I need to know to get started?".
ja: この記事はGodotがあなたに向いているかどうかをはっきりさせる助けになるために書いています。「始めるために何を知っておくべきか？」という質問に対する答えが得られるように、広範囲にわたる機能の紹介をします。
ko: 이 문서는 Godot이 여러분에게 적합한지 판단하는 데 도움을 드리기 위해 제작되었습니다. 엔진의 일반적인 특징을 소개하여 엔진을 통해 어떤 것을 달성할 수 있는지 감을 잡을 수 있도록 하고, "시작하기 위해 어떤 것을 알아야 할까요?"와 같은 질문에 답변할 것입니다.
pl: Ten artykuł ma pomóc Ci zrozumieć, czy Godot będzie dla Ciebie odpowiedni. Przedstawimy kilka ogólnych funkcji silnika. To da Ci wyobrażenie na temat tego, co możesz dzięki niemu osiągnąć. Otrzymasz też odpowiedź na pytanie - „co muszę wiedzieć, aby zacząć?”.
zh_tw: 本文可幫助你瞭解 Godot 是否適合你。我們將介紹該引擎的一些廣泛的功能，讓你感受到它能實作什麼，並回答“入門需要知道什麼？”等問題。

source: This is by no means an exhaustive overview. We will introduce many more features in this getting started series.
ja: すべての機能を網羅する、という意味ではありません。この「はじめに」のシリーズでシリーズでもっとたくさんの機能を紹介していきます。
ko: 이는 전체적인 개요를 다룬 것이며, 모든 기능을 상세히 다루지는 않았습니다. 이 시리즈에서는 더 많은 기능을 소개할 예정입니다.
pl: Nie jest to kompletny przegląd możliwości silnika. W serii dla początkujących przedstawimy znacznie więcej funkcji.
zh_tw: 這絕不是一個詳盡的概述。我們將在這個入門系列中介紹更多的功能。

source: What is Godot?
ja: Godotとは？
ko: Godot란?
zh_tw: 不能做什麼？

source: Godot is a general-purpose 2D and 3D game engine designed to support all sorts of projects. You can use it to create games or applications you can then release on desktop or mobile, as well as on the web.
ja: Godotは様々なプロジェクト向けにデザインされた、汎用の2D/3Dゲームエンジンです。ゲームやアプリケーションを作成し、デスクトップ用、モバイル、Webでリリースすることが出来ます。
ko: Godot는 모든 종류의 프로젝트를 지원하도록 설계된 범용 2D 및 3D 게임 엔진입니다. 이를 사용하여 게임이나 응용 프로그램을 만든 다음 데스크톱이나 모바일, 웹에서 출시할 수 있습니다.
pl: Godot to silnik gier 2D i 3D ogólnego przeznaczenia, zaprojektowany do obsługi wszelkiego rodzaju projektów. Możesz go używać do tworzenia gier lub aplikacji, które możesz następnie wydać na komputer stacjonarny bądź urządzenie mobilne, czy też umieścić w Internecie.
zh_tw: Godot 是一個通用的 2D 和 3D 遊戲引擎，旨在支援各種專案。你可以用它來建立遊戲或應用程式，然後在桌面、手機以及 Web 平臺上發行。

source: You can also create console games with it, although you either need strong programming skills or a developer to port the game for you.
ja: パワフルなプログラミングスキルやゲーム開発者がいなくても、コンソール機のゲームを作る事もできます。
ko: 강력한 프로그래밍 기술이나 게임을 포팅할 개발자가 필요하지만 콘솔 게임을 만들 수도 있습니다.
pl: Możesz także tworzyć za jego pomocą gry na konsole, chociaż - w tym przypadku - będziesz potrzebował doskonałych umiejętności programistycznych, lub pomocy programisty, który przeportuje grę za Ciebie.
zh_tw: 你也可以用它來建立主機平臺的遊戲，儘管你需要很強的程式設計技能，或者需要一個開發者為你移植遊戲。

source: The Godot team can't provide an open source console export due to the licensing terms imposed by console manufacturers. Regardless of the engine you use, though, releasing games on consoles is always a lot of work. You can read more on that here: :ref:`doc_consoles`.
ja: コンソールゲーム機製造元とのライセンス条項のため、コンソール向けにゲームをエクスポートする機能を提供することはGodotチームには出来ません。どのエンジンを使っていても、コンソール機でゲームをリリースするには常に多くの労力が必要です。そのことについては :ref:`doc_consoles` で詳しく解説しています。
zh_tw: 由於遊戲主機製造商施加的許可條款，Godot 團隊無法提供開源的主機匯出項。但是無論使用哪種引擎，在主機上發行遊戲始終是一項繁重的工作。更多相關內容： :ref:`doc_consoles` 。

source: What can the engine do?
ja: このエンジンで出来ることは？
ko: Godot 엔진으로 무엇을 할 수 있습니까?
pl: Co potrafi silnik?
zh_tw: 這個引擎能幹什麼？

source: Godot was initially developed in-house by an Argentinian game studio. Its development started in 2001, and the engine was rewritten and improved tremendously since its open source release in 2014.
ja: Godotは当初はアルゼンチンにあるゲームスタジオの内製プロダクトとして開発されました。開発は2001年からスタートし、2014年にオープンソースとしてリリースされて以来、大幅に改良されてきたエンジンです。
pl: Godot początkowo był tworzony na potrzeby własne, przez argentyńskie studio gier. Prace nad nim rozpoczęto w 2001 roku, a sam silnik został przepisany na nowo i doczekał się znaczących usprawnień, kiedy zmienił licencję - stając się wolnym oprogramowaniem - w 2014 roku.
zh_tw: Godot 最初是由一家阿根廷遊戲工作室內部開發的。開發始於 2001 年，2014 年開源發行後經過了重寫和大量的改進。

source: Some examples of games created with Godot include Ex-Zodiac and Helms of Fury.
ja: Godotで制作されたゲームの例として、Ex-Zodiac や Helms of Fury が挙げられます。
ko: Godot로 만든 게임의 예로는 Ex-Zodiac 및 Helms of Fury 가 있습니다.
pl: Przykładami gier napisanymi w Godot są Ex-Zodiac i Helms of Fury.
zh_tw: 使用 Godot 建立的遊戲的一些例子包括《Ex-Zodiac》和《Helms of Fury》。

source: As for applications, the open source pixel art drawing program Pixelorama is powered by Godot, and so is the voxel RPG creator RPG in a box.
ja: アプリケーションの制作例では、オープンソースのピクセルアート描画ソフトである Pixelorama や、ボクセルRPG制作ソフトの RPG in a box が挙げられます。
zh_tw: 應用程式方面，開源的像素藝術繪畫程式 Pixelorama 是由 Godot 驅動的，體素 RPG 製作器 RPG in a box 也是如此。

source: You can find many more examples in the `official showcase videos`_.
ja: `公式ショーケース動画` でもっと多くの作品のサンプルを見ることが出来ます。
ko: `공식 쇼케이스 비디오`_에서는 더 많은 예시를 찾아볼 수 있습니다.
pl: Możesz znaleźć wiele innych przykładów w filmach `official showcase videos`_.
zh_tw: 你可以在 `官方展示影片`_ 中找到更多範例。

source: How does it work and look?
ja: どのように、どんな見た目で機能しますか？
ko: 어떻게 보이고 작동하나요?
zh_tw: 如何擴充 Godot？

source: Godot comes with a fully-fledged game editor with integrated tools to answer the most common needs. It includes a code editor, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, and more.
ja: Godotは最も一般的なニーズに答えるために、オールインワンのゲームエディタと統合されたツールを提供しています。専用のコードエディタ、アニメーションエディタ、タイルマップエディタ、シェーダエディタ、デバッガ、プロファイラなどを備えています。
ko: Godot은 본격적인 통합 게임 에디터로써 대부분의 필요에 답할 수 있습니다. 코드 에디터, 애니메이션 에디터, 타일맵 에디터, 셰이더 에디터, 디버거, 프로파일러 등을 포함합니다.
zh_tw: Godot 竭力自主提供一般情況下會用到的工具。我們有專用的腳本工作區、有動畫編輯器、有圖塊編輯器、有著色器編輯器、有除錯工具、有分析工具、還有可以在本機與遠端裝置上熱重載 (Hot-Reload) 的功能…等。

source: The team strives to offer a feature-rich game editor with a consistent user experience. While there is always room for improvement, the user interface keeps getting refined.
ja: 開発チームは多機能で一貫性のあるユーザエクスペリエンスのゲームエディタを提供できるように努力しています。改良の余地があれば、ユーザインタフェースは日々改良されていきます。
ko: 팀은 기능이 풍부한 게임 에디터와 일관된 사용자 경험을 제공하기 위해 노력하고 있습니다. 항상 개선의 여지가 있지만, 유저 인터페이스는 계속해서 개선되고 있습니다.
pl: Zespół stara się zaoferować bogaty w funkcje edytor gier zapewniający spójne doświadczenia dla użytkownika. Jako, że zawsze można coś poprawić, interfejs użytkownika jest stale udoskonalany.
zh_tw: 開發團隊致力於提供功能豐富的遊戲編輯器，並提供一致的使用者體驗。雖然總是有改進的餘地，但使用者介面不斷得到完善。

source: Of course, if you prefer, you can work with external programs. We officially support importing 3D scenes designed in Blender_ and maintain plugins to code in VSCode_ and Emacs_ for GDScript and C#. We also support Visual Studio for C# on Windows.
ja: もちろん、あなたの好みに合わせて、外部のプログラムと組み合わせて動作も出来ます。私たちは公式に Blender_ の3Dシーンのインポートをサポートしていますし、 VSCode_ や Emacs_ 向けのGDScriptとC#のプラグインのメンテナンスも行っています。WindowsではVisual StudioでのC#もサポートしています。
ko: 물론 여러분이 원한다면 외부 프로그램으로 작업할 수도 있습니다. Blender_에서 설계된 3D 장면 가져오기를 공식적으로 지원하고 GDScript 및 C#용 VSCode_ 및 Emacs_의 코드에 대한 플러그인을 유지 관리하고 있습니다. 또한 Windows에서 C#용 Visual Studio를 공식적으로 지원하고 있습니다.
pl: Oczywiście, jeśli wolisz, możesz pracować z programami zewnętrznymi. Oficjalnie obsługujemy importowanie scen 3D zaprojektowanych w Blender_ i rozwijamy wtyczki do pisania kodu w VSCode_ i Emacs_ dla GDScript i C#. Obsługujemy także Visual Studio dla C# w systemie Windows.
zh_tw: 當然，如果你願意，你可以用外部程式工作。我們官方支援匯入在 Blender_ 中設計的3D場景，並維護在 VSCode_ 和 Emacs_ 中編寫 GDScript 和 C# 的外掛程式。我們還支援 Windows 上的 Visual Studio for C#。

source: Programming languages
ja: プログラミング言語
ko: 프로그래밍 언어
zh_tw: 設計語言

source: Let's talk about the available programming languages.
ja: まず利用可能なプログラミング言語を見てみましょう。
ko: 사용 가능한 프로그래밍 언어에 대해 이야기해 봅시다.
pl: Porozmawiajmy o dostępnych językach programowania.
zh_tw: 我們來看看現有的程式設計語言。

source: You can code your games using :ref:`GDScript <toc-learn-scripting-gdscript>`, a Godot-specific and tightly integrated language with a lightweight syntax, or :ref:`C# <toc-learn-scripting-C#>`, which is popular in the games industry. These are the two main scripting languages we support.
ja: Godot専用に最適化された軽量言語である :ref:`GDScript <toc-learn-scripting-gdscript>`と、ゲーム産業で一般的に使われている :ref:`C# <toc-learn-scripting-C#>` でコーディングすることが出来ます。これら2種は公式にメインでサポートするスクリプト言語です。
ko: 게임을 개발할 때는 :ref:`GDScript <toc-learn-scripting-gdscript>`를 사용하여 코드를 작성할 수 있습니다. GDScript는 Godot에 특화된 가벼운 문법을 가진 언어로, 엔진과 긴밀하게 통합되어 있습니다. 또한, 게임 산업에서 인기 있는 :ref:`C# <toc-learn-scripting-C#>`도 지원하는 두 가지 주요 스크립팅 언어입니다.
pl: Możesz pisać kod swoich gier używając :ref:`GDScript <toc-learn-scripting-gdscript>`, specyficznego dla silnika Godot i ściśle zintegrowanego z nim języka o nieskomplikowanej (lekkiej) składni, lub :ref:`C# <toc-learn-scripting-C#> `, który jest popularny w branży gier. Są to dwa główne języki skryptowe, które obsługujemy.
zh_tw: 您可以使用 :ref:`GDScript <toc-learn-scripting-gdscript>` 編寫遊戲，它是一門專屬於 Godot、緊密集成、語法輕量的語言，也可以使用 :ref:`C# <toc-learn-scripting-C#>` ，在遊戲工業中很流行。這兩者是我們支援的主要指令碼語言。

source: With the GDExtension technology, you can also write gameplay or high-performance algorithms in C or C++ without recompiling the engine. You can use this technology to integrate third-party libraries and other Software Development Kits (SDK) in the engine.
ja: GDExtension テクノロジを使用すると、エンジンを再コンパイルせずに、C または C++ でゲームプレイや高性能アルゴリズムを実装することもできます。 このテクノロジーを使用して、サードパーティのライブラリや他のソフトウェア開発キット (SDK) をエンジンに統合できます。
zh_tw: 通過 GDExtension 技術，你也可以用 C 或 C++ 編寫遊戲玩法相關或高性能演算法，而無需重新編譯引擎。你可以使用這項技術在引擎中集成協力廠商庫和其他軟體開發套件（SDK）。

source: Of course, you can also directly add modules and features to the engine, as it's completely free and open source.
ja: もちろん、Godotは完全に無料でオープンソースであるため、エンジンにモジュールや機能を直接追加することもできます。
zh_tw: 當然，你也可以直接向引擎新增模組和功能，因為它是完全自由且開源的。

source: What do I need to know to use Godot?
ja: Godotを使うのに必要な知識は？
ko: Godot를 사용하려면 무엇을 알아야 하나요?
pl: Co muszę wiedzieć, żeby korzystać z Godot?
zh_tw: 使用 Godot 我需要知道什麼？

source: Godot is a feature-packed game engine. With its thousands of features, there is a lot to learn. To make the most of it, you need good programming foundations. While we try to make the engine accessible, you will benefit a lot from knowing how to think like a programmer first.
ja: Godotはオールインワンのゲームエンジンです。無数の機能があり、それらを学ぶ必要があるでしょう。それらを理解するためにプログラミングの基礎が必要になります。私たちはエンジンをもっととっつきやすいものにしようと試みていますが、まずはプログラマー的な思考を知ることがあなたに大きな利益をもたらすでしょう。
ko: Godot은 수천 가지의 다양한 기능을 가진 게임엔진이기 때문에, 배울 것이 많습니다. 엔진을 최대한 활용하기 위해서는 좋은 프로그래밍 기반 지식이 필요합니다. 엔진을 접근하기 쉽게 만들려고 노력하지만, 먼저 프로그래머처럼 생각하는 방법을 알면 많은 도움을 받을 수 있을 것입니다.
pl: Godot to wypełniony możliwościami silnik do tworzenia gier. Z powodu tysięcy funkcji jest naprawdę czego się uczyć. Aby w pełni wykorzystać potencjał w nim drzemiący, potrzebujesz dobrych podstaw programistycznych. Chociaż staramy się, aby silnik był przystępny dla każdego, sporo skorzystasz wiedząc, jak myśli programista.
zh_tw: Godot 是一個功能豐富的遊戲引擎。它有成千上萬的功能，有很多東西需要學習。為了充分利用它，你需要良好的程式設計基礎。雖然我們試圖讓引擎變得簡單易懂，但如果你首先知道如何像程式師一樣思考，你會受益匪淺的。

source: Godot relies on the object-oriented programming paradigm. Being comfortable with concepts such as classes and objects will help you code efficiently in it.
ja: Godot はオブジェクト指向プログラミング パラダイムに基づいています。 クラスやオブジェクトなどの概念に慣れると、効率的にコーディングできるようになります。
pl: Godot opiera się na paradygmacie programowania obiektowego. Znajomość pojęć takich jak klasy i obiekty pomoże Ci efektywnie używać silnika.
zh_tw: Godot 依賴物件導向程式設計規範。熟悉類、物件之類的概念可以更有效率地去寫程式碼。

source: If you are entirely new to programming, we recommend following the `CS50 open courseware`_ from Harvard University. It's a great free course that will teach you everything you need to know to be off to a good start. It will save you countless hours and hurdles learning any game engine afterward.
ja: プログラミングにまったく慣れていない場合は、ハーバード大学の `CS50 open courseware` を参照することをお勧めします。 良いスタートを切るために知っておくべきことをすべて教えてくれる素晴らしい無料コースです。 それにより、後からゲーム エンジンを学習する際の数え切れないほどの時間とハードルを節約することできます。
pl: Jeśli dopiero zaczynasz programować, zalecamy zapoznanie się z otwartymi materiałami szkoleniowymi CS50 z Uniwersytetu Harvarda ( `CS50 open courseware`) . To świetny, bezpłatny kurs, który nauczy Cię wszystkiego, co musisz wiedzieć, aby dobrze zacząć. Oszczędzi ci to niezliczone godziny i przeszkody związane z nauką dowolnego silnika gry.
zh_tw: 如果你是一個程式設計新手，我們建議你去觀看哈佛大學提供的 `CS50 open courseware`_ 。這是一個很好的免費課程。它能教你所有你在使用 Godot 前需要知道的知識。在之後學習任何遊戲引擎時，他會幫你節省非常多的時間並跨過非常多的障礙。

source: In CS50, you will learn multiple programming languages. Don't be afraid of that: programming languages have many similarities. The skills you learn with one language transfer well to others.
ja: CS50では、複数のプログラミング言語を学びます。 心配しないでください: プログラミング言語には多くの類似点があります。 1 つの言語で学んだスキルは、他の言語でも活用できます。
pl: W CS50 nauczysz się wielu języków programowania. Nie bój się tego: języki programowania mają wiele podobieństw. Umiejętności nabyte w jednym języku dobrze sprawdzają się w innym.
zh_tw: 在 CS50 中，你會學習很多程式設計語言。不要感到害怕：程式設計語言之間有很多的相似之處。你在學習一個語言時學到的技巧能夠很容易地轉移到其他語言上。

source: We will provide you with more Godot-specific learning resources in :ref:`doc_learning_new_features`.
ja: :ref:`doc_learning_new_features` で、より Godot 固有の学習リソースを提供しています。
pl: Więcej zasobów edukacyjnych związanych z Godotem udostępnimy w :ref:`doc_learning_new_features`.
zh_tw: 在 :ref:`doc_learning_new_features` 中，我們會提供更多具體為 Godot 學習的資源。

source: In the next part, you will get an overview of the engine's essential concepts.
ja: 次のパートでは、Godotエンジンの基本となるコンセプトの概要をお見せします。
ko: 다음 파트에서는 엔진의 필수 개념에 대한 개요를 살펴볼 것입니다.
pl: W części następnej pokażemy Ci podstawowe koncepcje silnika Godot.
zh_tw: 在下一部分中，您將大致瞭解引擎的基本概念。

source: Translation status
ja: 翻訳ステータス
ko: 번역 상태
pl: Status tłumaczenia
zh_tw: 翻譯狀態
