Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/key_concepts_overview.po
Languages: de, zh_tw

source: Overview of Godot's key concepts
de: Überblick über Godots Schlüsselkonzepte
zh_tw: Godot 關鍵概念概述

source: Every game engine revolves around abstractions you use to build your applications. In Godot, a game is a **tree** of **nodes** that you group together into **scenes**. You can then wire these nodes so they can communicate using **signals**.
de: Jede Spiele-Engine basiert auf Abstraktionen, die Sie brauchen, um ihre Anwendungen zu entwickeln. In Godot ist ein Spiel ein **Baum** aus **Nodes**, die man zu **Szenen** zusammenfasst. Sie können diese Nodes dann miteinander verknüpfen, so dass sie über **Signale** kommunizieren können.
zh_tw: 任何遊戲引擎都是圍繞著建構程式所用的抽象的。在 Godot 中，遊戲就是一棵由 **節點** 構成的 **樹** ，樹又可以結合起來構成 **場景** 。然後你還可以將這些節點連起來，讓它們通過 **訊號** 進行通信。

source: These are the four concepts you will learn here. We're going to look at them briefly to give you a sense of how the engine works. In the getting started series, you will get to use them in practice.
de: Das sind die vier Konzepte, die Sie hier lernen werden. Wir werden sie kurz betrachten, um Ihnen ein Gefühl dafür zu vermitteln, wie die Engine funktioniert. In der Artikelreihe „Erste Schritte“ werden Sie sie in der Praxis anwenden.
zh_tw: 這就是你將在這裡學習的四個概念。我們將簡要地看一下它們，讓你對引擎的工作原理有一個瞭解。在入門系列中，你將在實踐中使用它們。

source: Scenes
de: Szenen
zh_tw: 場景

source: In Godot, you break down your game in reusable scenes. A scene can be a character, a weapon, a menu in the user interface, a single house, an entire level, or anything you can think of. Godot's scenes are flexible; they fill the role of both prefabs and scenes in some other game engines.
de: In Godot gliedern Sie Ihr Spiel in wiederverwendbare Szenen. Eine Szene kann ein Charakter, eine Waffe, ein Menü in der Benutzeroberfläche, ein einzelnes Haus, ein ganzes Level oder alles andere sein, was Sie sich vorstellen können. Godots Szenen sind flexibel; sie übernehmen die Rolle von Prefabs und Szenen, die einige andere Game Engines verwenden.
zh_tw: 在 Godot 中，你把你的遊戲分解成可重複使用的場景。場景可以是一個角色、一件武器、使用者介面中的一個功能表、一座房子、整個關卡，或者任何你能想到的東西。Godot 的場景很靈活，既能夠充當預製件（Prefab），又能夠用作其他遊戲引擎中的場景。

source: You can also nest scenes. For example, you can put your character in a level, and drag and drop a scene as a child of it.
de: Sie können auch Szenen verschachteln. Zum Beispiel können Sie Ihren Charakter in ein Level setzen und eine Szene als Child dieses Levels per Drag&Drop ablegen.
zh_tw: 你還可以巢狀場景。例如，你可以把你的角色放在關卡中，然後拖放一個場景作為它的子級。

source: A scene is composed of one or more **nodes**. Nodes are your game's smallest building blocks that you arrange into trees. Here's an example of a character's nodes.
de: Eine Szene besteht aus einem oder mehreren **Nodes**. Nodes sind die kleinsten Bausteine Ihres Spiels, die Sie in Bäumen anordnen. Hier ist als Beispiel der Nodes eines Charakters.
zh_tw: 場景由若干 **節點** 組成。節點是你的遊戲最小的構件，你將其排列成樹狀。下面是一個人物節點的例子。

source: It is made of a ``CharacterBody2D`` node named "Player", a ``Camera2D``, a ``Sprite2D``, and a ``CollisionShape2D``.
de: Er besteht aus einem ``CharacterBody2D``-Node namens „Player“, einem ``Camera2D``, ``Sprite2D``, und ``CollisionShape2D``.

source: The node names end with "2D" because this is a 2D scene. Their 3D counterparts have names that end with "3D". Be aware that "Spatial" Nodes are now called "Node3D" starting with Godot 4.
de: Die Node-Namen enden mit „2D“, da es sich um eine 2D-Szene handelt. Ihre 3D-Gegenstücke haben Namen, die mit „3D“ enden. Beachten Sie, dass „Spatial“-Nodes ab Godot 4 jetzt „Node3D“ genannt werden.
zh_tw: 節點名稱以“2D”結尾，因為這是一個 2D 場景。對應 3D 節點的名稱以“3D”結尾。請注意，原本的空間節點“Spatial”從 Godot 4 開始改名成了“Node3D”。

source: Notice how nodes and scenes look the same in the editor. When you save a tree of nodes as a scene, it then shows as a single node, with its internal structure hidden in the editor.
de: Beachten Sie, dass Nodes und Szenen im Editor gleich aussehen. Wenn Sie einen Node-Baum als Szene speichern, wird sie als einzelner Node angezeigt, wobei dessen interne Struktur im Editor verborgen bleibt.
zh_tw: 注意節點和場景在編輯器中看起來是一樣的。當你把一棵節點樹保存為場景時，它就顯示為一個單一的節點，其內部結構在編輯器中是隱藏的。

source: Godot provides an extensive library of base node types you can combine and extend to build more powerful ones. 2D, 3D, or user interface, you will do most things with these nodes.
de: Godot bietet eine umfangreiche Bibliothek von Basis-Node-Typen, die Sie kombinieren und erweitern können, um noch leistungsfähigere Nodes zu erstellen. Ob 2D-, 3D- oder Benutzeroberflächen, mit diesen Nodes können Sie die meisten Dinge tun.
zh_tw: Godot 提供了豐富的基礎節點型別程式庫，你可以通過組合和擴充來建立更強大的節點。無論是 2D、3D 還是使用者介面，你都可以用這些節點完成大多數事情。

source: The scene tree
de: Der Szenenbaum
zh_tw: 場景樹

source: All your game's scenes come together in the **scene tree**, literally a tree of scenes. And as scenes are trees of nodes, the scene tree also is a tree of nodes. But it's easier to think of your game in terms of scenes as they can represent characters, weapons, doors, or your user interface.
de: Alle Szenen des Spiels kommen im **Szenenbaum** (engl. Scene Tree) zusammen, buchstäblich ein Baum von Szenen. Und da Szenen wiederum Bäume von Nodes sind, ist auch der Szenenbaum ein Baum von Nodes. Aber es ist einfacher, sich Ihr Spiel in Szenen vorzustellen, da sie Charaktere, Waffen, Türen oder die Benutzeroberfläche darstellen können.
zh_tw: 遊戲的所有場景都彙集在 **場景樹** 中，字面意思是一棵場景樹。由於場景是節點樹，因此場景樹也是節點樹。但是，從場景的角度來考慮您的遊戲更容易，因為它們可以代表角色、武器、門或您的使用者介面。

source: Signals
de: Signale
zh_tw: 訊號

source: Nodes emit signals when some event occurs. This feature allows you to make nodes communicate without hard-wiring them in code. It gives you a lot of flexibility in how you structure your scenes.
de: Nodes senden Signale aus, wenn ein Ereignis eintritt. Mit diesem Feature können Sie Nodes miteinander kommunizieren lassen, ohne sie im Code fest zu verdrahten. Das gibt Ihnen eine große Flexibilität bei der Strukturierung Ihrer Szenen.
zh_tw: 節點在發生某些事件時發出訊號。此功能無需在程式碼中硬連接它們就能讓節點相互通信。它為您提供了建構場景的靈活性。

source: Signals are Godot's version of the *observer* pattern. You can read more about it here: https://gameprogrammingpatterns.com/observer.html
de: Signale sind Godots Version des *Observer*-Design Patterns. Sie können hier mehr darüber lesen: https://gameprogrammingpatterns.com/observer.html
zh_tw: 欲瞭解更多有關觀察者模式的資訊，請參考：https://gameprogrammingpatterns.com/observer.html

source: For example, buttons emit a signal when pressed. You can connect to this signal to run code in reaction to this event, like starting the game or opening a menu.
de: Zum Beispiel senden Buttons ein Signal aus, wenn sie gedrückt werden. Sie können eine Verbindung zu diesem Signal herstellen, um Code als Reaktion auf dieses Ereignis auszuführen, z.B. um das Spiel zu starten oder ein Menü zu öffnen.
zh_tw: 例如，按鈕在按下時會發出訊號。您可以連接到此訊號以運作程式碼以回應此事件，例如啟動遊戲或打開功能表。

source: Other built-in signals can tell you when two objects collided, when a character or monster entered a given area, and much more. You can also define new signals tailored to your game.
de: Andere Built-in-Signale können Ihnen mitteilen, wenn zwei Objekte zusammengestoßen sind, wenn ein Charakter oder ein Monster einen bestimmten Bereich betreten hat und vieles mehr. Sie können auch neue Signale definieren, die auf Ihr Spiel zugeschnitten sind.
zh_tw: 其他內建訊號可以告訴您兩個物件何時碰撞，角色或怪物何時進入給定區域等等。您還可以針對遊戲量身定制新的訊號。

source: Summary
de: Zusammenfassung
zh_tw: 總結

source: Nodes, scenes, the scene tree, and signals are four core concepts in Godot that you will manipulate all the time.
de: Nodes, Szenen, der Szenenbaum und Signale sind vier zentrale Konzepte in Godot, mit denen Sie ständig arbeiten werden.
zh_tw: 節點、場景、場景樹和訊號是 Godot 中的四個核心概念，您將一直操縱它們。

source: Nodes are your game's smallest building blocks. You combine them to create scenes that you then combine and nest into the scene tree. You can then use signals to make nodes react to events in other nodes or different scene tree branches.
de: Nodes sind die kleinsten Bausteine Ihres Spiels. Man kombiniert sie, um Szenen zu erstellen, die man dann wiederum kombiniert und in den Szenenbaum einfügt. Mithilfe von Signalen können Sie Nodes dazu bringen, auf Ereignisse in anderen Nodes oder anderen Zweigen des Szenenbaums zu reagieren.
zh_tw: 節點是遊戲最小的建構塊。你把它們組合起來建立場景，再把它們組合起來並巢狀到場景樹中。最後，你可以使用訊號來使節點對其他節點或不同的場景樹分支中的事件做出回應。

source: After this short breakdown, you probably have many questions. Bear with us as you will get many answers throughout the getting started series.
de: Nach diesem kurzen Überblick haben Sie wahrscheinlich viele Fragen. Haben Sie Geduld mit uns, denn Sie werden im Laufe der Artikelreihe „Erste Schritte“ viele Antworten erhalten.
zh_tw: 經過這個簡短的分解，你可能有很多問題。請耐心等待，你將在整個入門系列中得到更多解答。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Nodes
zh_tw: 節點
