Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: ja, pl, tr, uk, zh_tw

source: We recommend dismissing architectural code patterns when making games with Godot, such as Model-View-Controller (MVC) or Entity-Relationship diagrams. Instead, you can start by imagining the elements players will see in your game and structure your code around them.
ja: Godot でゲームを作る場合、MVC (Model-View-Controller) や Entity-Relationship ダイアグラムのようなアーキテクチャのコードパターンを排除することをお勧めします。その代わりに、プレイヤーがゲームの中で目にする要素を想像することから始め、それらに基づいてコードを構成するとよいでしょう。
tr: Godot ile oyunlar yaparken, mimari kodlama kalıplarını görmezden gelmenizi tavsiye ediyoruz; mesela Model-Görünüm-Denetim (MVC) veya Varlık-İlişkileri (ER) şemaları gibi. Bunların yerine, oyuncuların oyununuzda görecekleri öğeleri hayal ederek başlayın ve kodunuzu bunların etrafında yapılandırın.
uk: Ми рекомендуємо відмовитися від шаблонів архітектурного коду під час створення ігор з Godot, наприклад, діаграми модель-вигляд-контролер (MVC) або діаграми сутність-відношення. Замість цього ви можете почати з уявлення елементів, які гравці побачать у вашій грі, і структурувати ваш код навколо них.
zh_tw: 我們建議在使用 Godot 製作遊戲時忽略架構程式碼模式，例如模型-視圖-控制器 （MVC） 或實體關係圖。相反，你可以從想像玩家將在遊戲中看到的元素開始，並圍繞它們建構程式碼。

source: For example, you could break down a shooter game like so:
ja: 例えば、シューティングゲームを分解すると、こんな感じです。
tr: Örneğin, bir silahlı saldırı oyununu şu şekilde parçalarına ayırabiliriz:
uk: Наприклад, ви можете розбити гру-шутер так:
zh_tw: 例如，可以這樣想像簡單的射擊遊戲：

source: You can come up with a diagram like this for almost any type of game. Each rectangle represents an entity that's visible in the game from the player's perspective. The arrows tell you which scene owns which.
ja: このような図は、ほとんどどんな種類のゲームでも思いつくでしょう。それぞれの長方形は、プレイヤーの視点からゲーム内で見えるエンティティを表しています。矢印は、どのシーンがどれを所有しているかを示しています。
tr: Böyle bir şemayı, neredeyse her türden oyunlar için yapabilirsiniz. Her bir dikdörtgen, oyunun içerisinde olup, oyuncunun bakış açısından görünür durumdaki bir varlığı temsil eder. Oklar ise size hangi sahnede hangi varlığın olduğunu gösterir.
uk: Ви можете створити подібну схему майже для будь-якої гри. Кожен прямокутник представляє об’єкт, який видно в грі з точки зору гравця. Стрілки вказують на зв'язок сцен між собою.
zh_tw: 幾乎任何一種遊戲都可以用這種方式畫成圖片。先寫下遊戲裡可以被看到的部分，然後在每個部分用箭頭來表示這些元素的從屬關係。

source: Once you have a diagram, we recommend creating a scene for each element listed in it to develop your game. You'll use instancing, either by code or directly in the editor, to build your tree of scenes.
ja: ダイアグラムができたら、そこに記載されている各要素のシーンを作成して、ゲームを開発することをお勧めします。シーンのツリーを構築するために、コードまたはエディタで直接インスタンス化を使用するのがよいでしょう。
uk: Після того, як у вас є діаграма, ми рекомендуємо створити сцену для кожного елемента, перерахованого в ній, щоб розвивати вашу гру. Для побудови дерева сцен ви будете використовувати екземпляри, або за допомогою коду, або безпосередньо в редакторі.
zh_tw: 畫出這樣的圖之後，我們建議你為圖上的各個元素都建立一個場景來使用，再通過實體化來做出從屬關係 (可以用程式碼或是直接在編輯器裡實體化)。

source: Programmers tend to spend a lot of time designing abstract architectures and trying to fit components into it. Designing based on scenes makes development faster and more straightforward, allowing you to focus on the game logic itself. Because most game components map directly to a scene, using a design based on scene instantiation means you need little other architectural code.
ja: プログラマーは、抽象的なアーキテクチャを設計し、そこにコンポーネントを当てはめようとすることに多くの時間を費やす傾向があります。シーンをベースにした設計は、開発をより速く、より簡単にし、ゲームロジックそのものに集中することができます。ほとんどのゲームコンポーネントはシーンに直接マッピングされるため、シーンのインスタンス化をベースにしたデザインを使用すると、他のアーキテクチャのコードはほとんど必要ありません。
tr: Programcılar, zamanlarının büyük çoğunluğunu soyut yapılar tasarlamak, ve bileşenleri bunlara uydurmak için harcama eğilimindedirler. Sahne temelli tasarlama, geliştirmenin hızlı ve açık olmasını sağlarken, sizin oyunun mantığına odaklanmanıza izin verir. Oyun bileşenlerinin büyük kısmı doğrudan sahnelere haritalandığı için, sahne örneklemeye dayalı bir tasarım kullanmak, diğer yapısal kodların çok daha az olmasını sağlar.
uk: Програмісти, як правило, витрачають багато часу на розробку абстрактних архітектур і потім намагаючись вмістити в них компоненти. Проектування на основі сцен робить розробку швидшою та простішою, дозволяючи зосередитися на самій логіці гри. Оскільки більшість ігрових компонентів відображаються безпосередньо на сцені, використання підходу заснованого на екземплярі сцени, означає, що вам знадобиться зовсім небагато іншого архітектурного коду.
zh_tw: 開發遊戲 (或是一般軟體) 時，我們總會花費許多時間來設計架構，然後再花時間把遊戲的元素都套用到這個架構上。以場景為基礎來設計就取代了這個過程，讓開發變得更快速而且更直觀，也讓你能直接專注於實作遊戲本身的邏輯。由於大多數的遊戲元件都可以直接對應到場景上，使用使用以場景實體化為基礎的設計也就能在架構上花費較少的程式碼。

source: Here's the example of a scene diagram for an open-world game with tons of assets and nested elements:
ja: ここでは、大量のアセットとネストされた要素を持つオープンワールドゲームのシーン図の例を示します。
tr: İşte size, tonlarca varlık ve içiçe geçmiş öğelerden oluşan bir açık-dünya oyunu için, örnek bir sahne şeması:
uk: Ось приклад діаграми сцени для гри з відкритим світом з безліччю ресурсів і вкладених елементів:
zh_tw: 再來看看另一個某方面來說更複雜的例子。這個例子是開放世界型別的遊戲，有很多素材以及巢狀的元素：

source: Imagine we started by creating the room. We could make a couple of different room scenes, with unique arrangements of furniture in them. Later, we could make a house scene that uses multiple room instances for the interior. We would create a citadel out of many instanced houses and a large terrain on which we would place the citadel. Each of these would be a scene instancing one or more sub-scenes.
ja: まず、部屋を作るところから始めると想像してください。家具をユニークに配置した、いくつかの異なる部屋のシーンを作成することができます。その後、インテリアに複数の部屋のインスタンスを使用する家のシーンを作成することができます。インスタンス化された多くの家と、城塞を置くための大きな地形から、城塞を作ることになります。これらは、それぞれ1つまたは複数のサブシーンをインスタンス化したシーンとなります。
tr: Bir odayı oluşturarak başladığımızı hayal edin. Her birinin içinde benzersiz düzenlenmiş mobilyalar bulunan, bir kaç farklı oda sahnesi oluşturabilirdik. Sonra, içerisinde bir sürü oda örneklemesi kullanan bir ev yapabilirdik. Bir sürü ev örneklemesinden oluşan bir kale oluşturabilir ve bunu çok geniş bir araziye yerleştirebilirdik. Bunların her biri, bir ya da daha fazla alt-sahne örneklemesi kullanan bir sahne olabilirdi.
uk: Уявіть, що ми почали зі створення кімнати. Ми могли б зробити кілька різних сцен кімнат з унікальним розташуванням меблів. Пізніше ми могли б створити сцену будинку, яка використовує декілька екземплярів кімнати для інтер’єру. Ми створили б цитадель з багатьох екземплярів будинків і великої місцевості, на якій ми б розмістили цитадель. Кожна з них буде сценою, що містить одну або кілька підсцен.
zh_tw: 想像一下，我們從建立房間開始。我們可以製作幾個不同的房間場景，在其中有獨特的傢俱安排。後來，我們可以製作一個房屋場景，在內部使用多個房間實例。我們將用許多產生實體的房子和一個大的地形來建立一個城堡，我們將把城堡放在這個地形上。每一個場景都將是一個或多個子場景的實例。

source: Later, we could create scenes representing guards and add them to the citadel. They would be indirectly added to the overall game world.
ja: その後、衛兵のシーンを作り、城塞に追加することもできます。間接的にゲームの世界全体に追加されることになります。
tr: Daha sonra, muhafızları temsil eden sahneleri oluşturup, bunları kaleye ekleyebilirdik. Böylece bunlar, dolaylı olarak oyun dünyasına eklenmiş olurlardı.
uk: Пізніше ми могли б створити сцени, що представляють охорону, і додати їх до цитаделі. Вони будуть опосередковано додані до загального світу гри.
zh_tw: 接下來我們可以建立一些代表守衛 (以及其他 NPC) 的場景，然後也把這些場景都加進城堡裡。這樣一來，這些 NPC 就間接地進到了整個遊戲世界裡了。

source: With Godot, it's easy to iterate on your game like this, as all you need to do is create and instantiate more scenes. We designed the editor to be accessible to programmers, designers, and artists alike. A typical team development process can involve 2D or 3D artists, level designers, game designers, and animators, all working with the Godot editor.
ja: Godotでは、このようにシーンを作成してインスタンス化するだけで、簡単にゲーム上で反復することができます。エディターは、プログラマー、デザイナー、アーティストが同様に利用できるように設計されています。典型的なチーム開発では、2Dや3Dのアーティスト、レベルデザイナー、ゲームデザイナー、アニメーターが参加し、全員がGodotエディターで作業を行います。
tr: Godot ile, kendi oyununuzda böyle bir yineleme yapmak kolaydır, çünkü tek yapmanız gereken daha fazla sahne oluşturmak ve bunları örneklemektir. Düzenleyicimizi, programcılar olduğu kadar tasarımcılar ve sanatçılar içinde erişilebilir olacak şekilde tasarladık. Tipik bir ekip geliştirme süreci, her birinin Godot düzenleyici ile çalıştığı, 2B ve 3B sanatçıları, seviye tasarımcılarını, oyun tasarımcılarını, ve animatörleri içerebilir.
uk: З Godot легко відтворити гру, схожу на цю, адже все, що вам потрібно зробити, це створити сцени та створити більше екземплярів сцен. Крім того, інтерфейс редактора побудований так, щоб ним було зручно користуватися, як програмістам, так і не програмістам. Типовий склад команди розробки може залучати 2D або 3D художників, дизайнерів рівнів, дизайнерів ігор та аніматорів і всі вони можуть працювати з інтерфейсом редактора.
zh_tw: 在 Godot 裡，很容易就可以通過這種方式來迭代出遊戲，需要做的就只是建立場景、實體化場景然後建立更多場景再實體化更多場景。而且，不管是對於程式設計師或非程式設計師來說，Godot 的編輯器 UI 很友善。一般標準的團隊開發流程還會有 2D 與 3D 設計師、關卡設計師、遊戲設計師以及動畫家的參與，大家都會使用 Godot 編輯器界面來進行作業。

source: Summary
ja: 概要
pl: Podsumowanie
tr: Özet
uk: Підсумок
zh_tw: 總結

source: Instancing, the process of producing an object from a blueprint, has many handy uses. With scenes, it gives you:
ja: インスタンス化とは、設計図からオブジェクトを生成するプロセスで、多くの便利な使い方があります。シーンを使えば、次のようなことが実現できます。
uk: Інстанціювання, процес створення об'єкта за шаблоном, має багато корисних застосувань. Зі сценами він дає вам:

source: The ability to divide your game into reusable components.
ja: ゲームを再利用可能なコンポーネントに分割する機能。
tr: Oyununuzu yeniden kullanılabilen bileşenlere ayırma yeteneği.
uk: Можливість розділити гру на повторно використовувані компоненти.
zh_tw: 能讓你的遊戲拆分成可充分利用的元件。

source: A tool to structure and encapsulate complex systems.
ja: 複雑なシステムを構造化し、カプセル化するためのツール。
tr: Karmaşık sistemleri yapılandırmak ve sarmalamak için bir araç.
uk: Інструмент для структурування та інкапсуляції складних систем.
zh_tw: 一個建構和封裝複雜系統的工具。

source: A language to think about your game project's structure in a natural way.
ja: ゲームプロジェクトの構造を自然な方法で考えるための言語。
tr: Oyununuzun yapısı hakkında doğal bir düşünme yapısı sunan bir dil.
uk: Можливість продумати структуру вашого ігрового проекту природним чином.
zh_tw: 一種以自然方式思考遊戲專案結構的語言。

source: Translation status
ja: 翻訳ステータス
pl: Status tłumaczenia
tr: Çeviri durumu
uk: Стан перекладу
zh_tw: 翻譯狀態
