Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: ja, pl, tr, uk, zh_tw

source: Creating instances
ja: インスタンスの作成
pl: Tworzenie instancji
tr: Örnekleme oluşturmak
uk: Створення екземплярів
zh_tw: 編輯實體

source: In the previous part, we saw that a scene is a collection of nodes organized in a tree structure, with a single node as its root. You can split your project into any number of scenes. This feature helps you break down and organize your game's different components.
ja: 前のパートでは、シーンとは1つのノードをルートとし、ツリー構造で構成されたノードの集まりであることを見てきました。プロジェクトは、いくつものシーンに分割することができます。この機能により、ゲームの様々なコンポーネントを分解して整理することができます。
pl: W poprzedniej części nauczyliśmy się, że scena to kolekcja węzłów ułożonych w strukturę drzewa, z jednym, głównym węzłem stanowiącym korzeń (root). Możesz podzielić swój projekt na dowolną ilość scen. Ta funkcja pomoże Ci wydzielić mniejsze części i zorganizować wszystkie składowe Twojej gry.
tr: Önceki bölümde bir sahnenin, kökünü tek bir düğümün oluşturduğu, ağaç yapısında düzenlenmiş sahnelerin bir derlemesi olduğunu gördük.Projenizi herhangi bir sayıda sahneye ayırabilirsiniz. Bu özellik, oyununuzu parçalara ayırıp, farklı bileşenlerini bir düzene koymanızı sağlar.
uk: У попередній частині ми бачили, що сцена — це набір вузлів, організованих у структуру дерева, з одним вузлом як коренем. Ви можете розділити свій проект на будь-яку кількість сцен. Ця функція допоможе вам розбити та організувати різні компоненти вашої гри.
zh_tw: 上一部分中，我們瞭解到場景是一系列組織成樹狀結構的節點，其中只有一個節點是根節點。你可以將專案拆分成任意數量的場景。這一功能可以幫你將遊戲拆解成不同的元件，並進行組織。

source: You can create as many scenes as you'd like and save them as files with the ``.tscn`` extension, which stands for "text scene". The ``label.tscn`` file from the previous lesson was an example. We call those files "Packed Scenes" as they pack information about your scene's content.
ja: 好きなだけシーンを作成し、\ ``.tscn``\ ("text scene") という拡張子でファイルに保存することができます。前のレッスンの\ ``Label.tscn``\ ファイルはその例です。シーンの内容に関する情報をパックしているため、これらのファイルを "Packed Scenes" と呼んでいます。
pl: Możesz utworzyć dowolną liczbę scen i zapisać je jako pliki z rozszerzeniem ``.tscn``, co jest skrótem od angielskiego wyrażenia "text scene". Przykładem jest plik ``label.tscn`` z poprzedniej lekcji. Nazywamy te pliki "spakowanymi scenami" ("Packed Scenes"), ponieważ zapakowano do nich informacje o zawartości sceny.
uk: Ви можете створювати скільки завгодно сцен і зберігати їх як файли з розширенням ``.tscn``, що означає "текстова сцена". Прикладом може слугувати файл ``label.tscn`` з попереднього уроку. Ми називаємо ці файли "запакованими сценами", оскільки вони містять інформацію про вміст вашої сцени.
zh_tw: 你可以建立任意數量的場景並將他們保存成副檔名為 ``.tscn`` （“text scene” 文字場景）的檔。上節課的 ``label.tscn`` 檔就是一個例子。我們把這些檔叫作“打包的場景”（Packed Scene），因為它們將場景的內容資訊進行了打包。

source: Here's an example of a ball. It's composed of a :ref:`RigidBody2D <class_RigidBody2D>` node as its root named Ball, which allows the ball to fall and bounce on walls, a :ref:`Sprite2D <class_Sprite2D>` node, and a :ref:`CollisionShape2D <class_CollisionShape2D>`.
ja: 以下はボールの例です。ボールが落ちたり壁で跳ねたりできるようにするために、Ballという名前の :ref:`RigidBody2D <class_RigidBody2D>` ノードをルートとしており、さらに :ref:`Sprite2D <class_Sprite2D>` ノードと :ref:`CollisionShape2D <class_CollisionShape2D>` から構成されています。
pl: Oto przykład z piłką. Składa się z węzła :ref:`RigidBody2D <class_RigidBody2D>` będącego korzeniem o nazwie Ball - element ten pozwala piłce spadać i odbijać się od ścian, węzła :ref:`Sprite2D <class_Sprite2D>` oraz :ref:`CollisionShape2D <class_CollisionShape2D>`.
uk: Ось приклад м'яча. Він складається з вузла :ref:`RigidBody2D <клас_RigidBody2D>`, який має корінь Ball, що дозволяє м'ячу падати і відскакувати від стін, вузла :ref:`Sprite2D <клас_Sprite2D>` і вузла :ref:`CollisionShape2D <клас_CollisionShape2D>`.
zh_tw: 這有一個小球的例子。它由以下內容組成：一個叫“Ball”的 :ref:`RigidBody2D <class_RigidBody2D>` 節點是根節點，可以讓小球下落、在撞牆後反彈；一個 :ref:`Sprite2D <class_Sprite2D>` 節點以及一個 :ref:`CollisionShape2D <class_CollisionShape2D>` 。

source: Once you saved a scene, it works as a blueprint: you can reproduce it in other scenes as many times as you'd like. Replicating an object from a template like this is called **instancing**.
ja: 一度保存したシーンは設計図として機能し、他のシーンで何度でも再現することができます。このようにテンプレートからオブジェクトを複製することを、**instancing** と呼びます。
pl: Po zapisaniu sceny działa ona jak forma dla rzeźby: możesz odlać, odtworzyć jej zawartość na innych scenach tyle razy, ile chcesz. Replikacja obiektu z takiej formy, takiego szablonu nazywa się **instancją**.
tr: Bir sahneyi kaydettiğinizde, bir tasarım planı olarak işliyor: bunu başka sahnelerde istediğiniz kadar çok sayıda yeniden kullanabilirsiniz. Bir nesneyi böyle bir şablondan çoğaltmaya **örnekleme** (instancing) diyoruz.
uk: Після збереження сцени вона працює як шаблон: ви можете відтворювати її в інших сценах скільки завгодно разів. Відтворення об’єкта з такого шаблону називається **instancing**.
zh_tw: 保存場景過後，這個場景就可以作為藍圖使用：你可以在其他場景中進行任意數量的翻制。將物件根據範本進行翻制的這一過程就叫作 **產生實體** 。

source: As we mentioned in the previous part, instanced scenes behave like a node: the editor hides their content by default. When you instance the Ball, you only see the Ball node. Notice also how each duplicate has a unique name.
ja: 前のパートで述べたように、インスタンス化されたシーンは、ノードのように動作します。エディタは、デフォルトでそのコンテンツを隠蔽します。Ballをインスタンス化すると、Ballノードだけが表示されます。また、各複製がユニークな名前を持っていることに注意してください。
pl: Jak wspomnieliśmy w poprzedniej części, instancje scen w edytorze zachowują się jak węzły: edytor domyślnie ukrywa ich zawartość. Kiedy utworzysz instancję Ball, zobaczysz tylko węzeł Ball. Zwróć także uwagę, że każdy duplikat ma unikalną nazwę.
tr: Önceki bölümde bahsettiğimiz gibi, örneklenmiş sahneler de bir düğüm gibi davranırlar: bunların içerikleri düzenleyici içinde varsayılan olarak gizlenir. Ball sahnesini örneklediğiniz zaman, sadece Ball düğümünü görürsünüz. Ayrıca, dikkat ederseniz, her bir kopyanın kendi benzersiz ismi var.
uk: Як ми згадували в попередній частині, екземпляри сцен поводяться як вузол: редактор за замовчуванням приховує їх вміст. Коли ви створюєте екземпляр Ball, ви бачите лише вузол Ball. Зверніть також увагу на те, що кожен дублікат має унікальну назву.
zh_tw: 我們在上一部分提到過，產生實體場景的行為與節點類似：編輯器預設會隱藏其中的內容。產生實體 Ball 之後，你只會看到 Ball 節點。請注意製作出的副本，名字是唯一的。

source: Every instance of the Ball scene starts with the same structure and properties as ``ball.tscn``. However, you can modify each independently, such as changing how they bounce, how heavy they are, or any property exposed by the source scene.
ja: Ball シーンのすべてのインスタンスは、\ ``ball.tscn``\ と同じ構造とプロパティで開始されます。ただし、それぞれを独立して変更することができます。たとえば、跳ね返り方、重さ、またはソースシーンによって公開されるプロパティなどです。
pl: Każda instancja sceny Ball powstaje mając tą samą strukturę i właściwości jak oryginalny plik ``ball.tscn``. Można jednak modyfikować każdą instancję niezależnie, na przykład zmieniać sposób odbijania się piłki, jej ciężar lub dowolną właściwość sceny źródłowej.
uk: Кожен екземпляр сцени М'яч починається з тієї самої структури та властивостей, що й ``ball.tscn``. Однак ви можете змінювати кожну з них незалежно, наприклад, змінювати спосіб відскоку, вагу або будь-які властивості, визначені у вихідній сцені.
zh_tw: Ball 場景的實例最開始都和 ``ball.tscn`` 有相同的結構和屬性。不過你也可以單獨修改各個實例，比如修改反彈的方式、重量等源場景所暴露的屬性。

source: In practice
ja: 実際に使う
pl: W praktyce
tr: Uygulamada
uk: На практиці
zh_tw: 最佳實踐

source: Let's use instancing in practice to see how it works in Godot. We invite you to download the ball's sample project we prepared for you: `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
ja: インスタンス化を実際に使って、Godotで具体的にどう動くのかを見てみましょう。私たちが用意したボールのサンプルプロジェクトをダウンロードしてください： :download:`instancing.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`.
pl: Aby dowiedzieć się, jak w praktyce działa instancjonowanie, zacznijmy od pobrania przykładowego projektu sceny z kulą (ball):`instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
uk: Давайте використаємо інстанцію на практиці, щоб побачити, як вона працює в Godot. Запрошуємо вас завантажити приклад проекту м'яча, який ми підготували для вас: `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
zh_tw: 讓我們先下載一個範例專案來瞭解實體化是怎麼運作的： :download:`instancing.zip <files/instancing.zip>` 。

source: Extract the archive on your computer. To import it, you need the Project Manager. The Project Manager is accessed by opening Godot, or if you already have Godot opened, click on *Project -> Quit to Project List* (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` on macOS)
ja: コンピュータ上で展開してください。インポートするために、プロジェクトマネージャーを開く必要があります。プロジェクトマネージャーはGodotの開始画面からアクセスできます。すでにGodotを開いているのであれば、 *プロジェクト -> 終了してプロジェクト一覧を開く* (:kbd:`Ctrl + Shift + Q`, macOSでは :kbd:`Ctrl + Option + Cmd + Q` ) を押してください。

source: In the Project Manager, click the *Import* button to import the project.
ja: プロジェクトマネージャーにて、*インポート* ボタンを使用してこのプロジェクトをインポートしてください。
pl: Otwórz Godot i w Menedżerze Projektu, kliknij przycisk „Zaimportuj”, aby zaimportować projekt.
uk: У Менеджері проектів натисніть кнопку *Імпортувати*, щоб імпортувати проект.
zh_tw: 在專案管理員裡點擊 [匯入] 按鈕來匯入該專案。

source: In the pop-up that appears, click the browse button and navigate to the folder you extracted.
ja: 表示されたポップアップで、参照ボタン("Browse")をクリックし、解凍したフォルダに移動します。
pl: W okienku, które wyskoczy, kliknij przycisk przeglądania i przejdź do rozpakowanego folderu.
tr: Açılan pencerede, Gözat düğmesine tıklayın ve ayıkladığınız klasöre gidin.
uk: У спливаючому вікні, що з’явиться, натисніть кнопку огляду та перейдіть до теки, яку ви розпакували.
zh_tw: 在彈出框中點擊瀏覽按鈕，定位到剛才解壓的資料夾。

source: Double-click the ``project.godot`` file to open it.
ja: \ ``project.godot``\ ファイルをダブルクリックして開いてください。
pl: Kliknij dwa razy plik ``project.godot``, aby go otworzyć.
tr: Açmak için ``project.godot`` dosyasına çift-tıklayın.
uk: Двічі клацніть файл ``project.godot``, щоб відкрити його.
zh_tw: 按兩下打開 ``project.godot`` 檔案。

source: Finally, click the Import & Edit button.
ja: 最後に、「インポートと編集」("Import & Edit")ボタンをクリックします。
pl: Na końcu, kliknij przycisk Importuj i Edytuj.
tr: Son olarak, İçe Aktar & Düzenle düğmesine tıklayın.
uk: Нарешті, натисніть кнопку Імпорт і редагування.
zh_tw: 最後，點擊匯入 & 編輯按鈕。

source: The project contains two packed scenes: ``main.tscn``, containing walls against which the ball collides, and ``ball.tscn``. The Main scene should open automatically. If you're seeing an empty 3D scene instead of the main scene, click the 2D button at the top of the screen.
ja: このプロジェクトには、2つのパックされたシーンが含まれています。\ ``main.tscn``\ (ボールと衝突する壁を含む)と\ ``ball.tscn``\ のシーンです。メインシーンは自動的に開きます。もし、メインシーンの代わりに空の3Dシーンが表示されたら、画面上部の2Dボタンを押してください。
uk: Проект містить дві упаковані сцени: ``main.tscn``, що містить стіни, з якими стикається м'яч, та ``ball.tscn``. Головна сцена повинна відкриватися автоматично. Якщо ви бачите порожню 3D сцену замість головної, натисніть кнопку 2D у верхній частині екрана.

source: Let's add a ball as a child of the Main node. In the Scene dock, select the Main node. Then, click the link icon at the top of the scene dock. This button allows you to add an instance of a scene as a child of the currently selected node.
ja: Mainノードの子として、ボールを追加してみましょう。Scene ドックで、Main ノードを選択します。次に、シーンドックの上部にあるリンクアイコンをクリックします。このボタンで、現在選択されているノードの子として、シーンのインスタンスを追加することができます。
pl: Dodajmy kulkę jako element podrzędny węzła "Main". W doku "Scena" wybierz węzeł "Main". Następnie kliknij ikonę "łącze" (ten łańcuch) w doku "Scena". Przycisk ten umożliwia dodanie instancji sceny jako elementu podrzędnego (dziecko węzła) dla aktualnie wybranego węzła.
tr: Şimdi ana sahneye alt-öğe olarak bir top ekleyelim. Sahne yuvasında, Main düğümünü seçin. Sonra, sahne yuvasının en üstündeki bağlantı simgesine tıklayın. Bu düğme, bir sahnenin örneklemesini, seçili olan sahnenin alt-öğesi olarak eklemeyi sağlar.
uk: Додамо м'яч як дочірній вузол Main. У панелі «Сцена» виберіть головний вузол. Потім клацніть значок зв'язування у верхній частині панелі сцени. Ця кнопка дозволяє вам додати екземпляр сцени як дочірній для поточного вибраного вузла.
zh_tw: 讓我們為 Main 節點新增一個小球作為子節點。在“場景”面板中，選擇 Main 節點。然後點擊場景面板頂部的連結圖示。這個按鈕的作用是為目前選中節點新增另一個場景的實例作為子節點。

source: Double-click the ball scene to instance it.
ja: Ballシーンをダブルクリックしてインスタンス化します。
pl: Dwukrotnie kliknij scenę z kulką ("Ball.tscn"), by ją zainstancjonować.
tr: Örneklemek için, top sahnesine (ball) çift-tıklayın.
uk: Двічі клацніть сцену з м’ячем, щоб створити її екземпляр.
zh_tw: 按兩下小球場景來產生實體。

source: The ball appears in the top-left corner of the viewport.
ja: ビューポートの左上隅にボールが表示されます。
pl: Kulka pojawi się w górnej części widoku perspektywy (viewport).
tr: Toplar, çerçevenin sol-üst köşesinde ortaya çıkarlar.
uk: М'яч з’явиться у верхньому лівому куті вікна перегляду.
zh_tw: Logo 會顯示在螢幕的最上方。

source: Click on it and drag it towards the center of the view.
ja: それをクリックし、ビューの中心に向かってドラッグします。
pl: Kliknij na kulkę i przeciągnij ją w kierunku centrum w widoku Perspektywy.
tr: Üzerine tıklayıp görünümün ortalarına doğru sürükleyin.
uk: Клацніть на ньому та перетягніть його до центру перегляду.
zh_tw: 點擊「新增合集」然後拖移並選擇整個圖塊表。

source: Play the game by pressing :kbd:`F5` (:kbd:`Cmd + B` on macOS). You should see it fall.
ja: F5キー(macOSでは :kbd:`Cmd + B`) を押してゲームを実行してください。ボールが落ちるのが見えるはずです。
pl: Uruchom grę naciskając klawisz F5 (:kbd:`Cmd + B` na macOS). Powinieneś zobaczyć jak kulka opada.
uk: Запустіть гру, натиснувши :kbd:`F5` (:kbd:`Cmd + B` на macOS). Ви повинні побачити, як він падає.
zh_tw: 按 :kbd:`Ctrl + F` (或 macOS 上 :kbd:`Cmd + F`) 可以搜尋列表。

source: Now, we want to create more instances of the Ball node. With the ball still selected, press :kbd:`Ctrl + D` (:kbd:`Cmd + D` on macOS) to call the duplicate command. Click and drag to move the new ball to a different location.
ja: さて、Ball ノードのインスタンスをさらに作成したいと思います。ボールを選択したまま、 :kbd:`Ctrl-D` (macOS では :kbd:`Cmd-D`) を押して、複製コマンドを呼び出します。クリックアンドドラッグして、新しいボールを別の場所に移動してください。
uk: Тепер ми хочемо створити більше екземплярів вузла Ball. Виділивши кулю, натисніть :kbd:`Ctrl + D` (:kbd:`Cmd + D` на macOS), щоб викликати команду дублювання. Клацніть і перетягніть, щоб перемістити нову кулю в інше місце.

source: You can repeat this process until you have several in the scene.
ja: この作業を、シーン内にいくつかボールができるまで繰り返すことができます。
pl: Kontynuuj to działanie tworząc kilka kulek na scenie.
tr: Sahnede bunlardan bir sürü olana kadar bu işlemi tekrar edebilirsiniz.
uk: Ви можете повторювати цей процес, поки у сцені не з’явиться кілька м'ячів.
zh_tw: 你可以重複這個過程，直到你已經放幾個在場景上。

source: Play the game again. You should now see every ball fall independently from one another. This is what instances do. Each is an independent reproduction of a template scene.
ja: もう一度ゲームを実行します。今度は、すべてのボールが互いに独立して落下するのが見えるはずです。これがインスタンスの役割です。それぞれが、テンプレートのシーンを独立して再現しているのです。
pl: Zagraj w grę ponownie. Powinieneś teraz zobaczyć, jak każda piłka spada niezależnie od drugiej. Tak właśnie robią instancje. Każdy z nich jest niezależnym odlewem z formy jaką jest scena.
tr: Oyunu tekrar başlatın. Şimdi bütün topların diğerlerinden bağımsız olarak düştüklerini görmelisiniz. Örneklemenin yaptığı şey budur. Her biri bir şablon sahnenin bağımsız birer kopyasıdır.
uk: Запустіть гру ще раз. Тепер ви повинні бачити, як кожен м'яч падає незалежно один від одного. Це те, що роблять екземпляри. Кожен є самостійним відтворенням шаблонної сцени.
zh_tw: 再次運作遊戲。現在你應該看到每個小球都各自下落。這就是實例的作用。每一個都是範本場景的獨立副本。

source: Editing scenes and instances
ja: シーンとインスタンスの編集
pl: Edycja scen i instancji
tr: Sahneleri ve örnekleri düzenleme
uk: Редагування сцен і екземплярів
zh_tw: 編輯實體

source: There is more to instances. With this feature, you can:
ja: インスタンスにはまだまだあります。この機能を使用すると、次のことができます。
pl: To nie wszystko odnośnie instancjonowania. Ta funkcja pozwala Ci również:
tr: Örnekleme hakkında daha fazlası var. Bu özelliği kullanarak, şunları yapabilirsiniz:
uk: Є ще багато про екземпляри. Ця особливість дозволяє:
zh_tw: 實例還有很多用法。使用這個功能，你可以：

source: Change the properties of one ball without affecting the others using the Inspector.
ja: インスペクタを使って、1つのボールのプロパティを他のボールに影響を与えずに変更します。
pl: Zmienić właściwości jednej kulki bez oddziaływania na inne kulki, przy pomocy Inspektora (Inspector).
tr: Denetleyiciyi kullanarak, diğerlerini etkilemeden bir topun özelliklerini değiştirmek.
uk: Змініть властивості однієї кулі, не впливаючи на інші за допомогою Інспектора.
zh_tw: 使用“屬性面板”修改一個小球的屬性，不影響其他實例。

source: Change the default properties of every Ball by opening the ``ball.tscn`` scene and making a change to the Ball node there. Upon saving, all instances of the Ball in the project will see their values update.
ja: \ ``ball.tscn``\ シーンを開き、Ball ノードに変更を加えることによって、すべての Ball のデフォルトプロパティを変更することができます。保存すると、プロジェクト内のすべてのBallインスタンスの値が更新されます。
pl: Zmienić domyślne właściwości każdej z kulek, otwierając scenę ``ball.tscn`` i dokonując zmian w węźle Ball. Po zapisaniu wartości, wszystkie kulki (instancje Ball) w projekcie zostaną zaktualizowane.
uk: Змініть властивості за замовчуванням для кожної Кулі, відкривши сцену ``ball.tscn`` і зробивши там зміни у вузлі Ball. Після збереження, всі екземпляри Кулі у проекті побачать оновлення своїх значень.
zh_tw: 打開 ``ball.tscn`` 場景修改 Ball 節點，從而修改所有 Ball 的預設屬性。在保存時，專案中所有 Ball 的實例都會更新其屬性值。

source: Changing a property on an instance always overrides values from the corresponding packed scene.
ja: インスタンスのプロパティを変更すると、対応するパックされたシーンの値が常に上書きされます。
pl: Zmiana właściwości instancji nadpisuje właściwości na scenie, na której jest umiejscowiona.
tr: Bir örnekleme üzerinden bir özelliği değiştirmek, her zaman paket sahneden karşılık gelen değerlerin üzerine yazar.
uk: Зміна властивості екземпляра завжди перевизначає значення з відповідної упакованої сцени.
zh_tw: 修改實例上的屬性總是會覆蓋對應打包場景中的值。

source: Let's try this. Open ``ball.tscn`` and select the Ball node. In the Inspector on the right, click on the PhysicsMaterial property to expand it.
ja: 試してみましょう。\ ``ball.tscn``\ を開き、Ball ノードを選択します。右側のインスペクタで、PhysicsMaterialプロパティをクリックして展開します。
pl: Spróbujmy. Otwórz plik ``ball.tscn`` i wybierz węzeł Ball. W Inspektorze, po prawej stronie, kliknij na właściwość PhysicsMaterial, aby ją rozwinąć.
uk: Давайте спробуємо це зробити. Відкрийте файл ``ball.tscn`` і виберіть вузол Ball. В інспекторі праворуч клацніть на властивості PhysicsMaterial, щоб розгорнути її.
zh_tw: 讓我們來試一試。打開 ``ball.tscn`` 然後選中 Ball 節點。在右側的“屬性面板”中，點擊展開 PhysicsMaterial 屬性。

source: Set its Bounce property to ``0.5`` by clicking on the number field, typing ``0.5``, and pressing :kbd:`Enter`.
ja: 数値フィールドをクリックし、\ ``0.5``\ と入力し、 :kbd:`Enter` を押して、バウンスプロパティを \ ``0.5``\ にセットしてください。
pl: Ustaw jego właściwość Odbijanie (Bounce) na ``0,5``, klikając pole liczbowe, wpisując ``0,5'' i naciskając :kbd:`Enter`.
uk: Встановіть його властивість Bounce на ``0.5``, клацнувши на числовому полі, набравши ``0.5`` і натиснувши :kbd:`Enter`.
zh_tw: 將其 Bounce（彈力）屬性設為 ``0.5`` ，只要點擊對應的數字欄位、輸入 ``0.5`` 、然後按 :kbd:`Enter` 就可以了。

source: Let's now adjust an individual instance. Head back to the Main scene by clicking on the corresponding tab above the viewport.
ja: それでは、個々のインスタンスを調整しましょう。ビューポートの上にある対応するタブをクリックして、Mainシーンに戻りましょう。
pl: Dostosujmy teraz pojedynczą instancję. Wróć do sceny głównej (Main), klikając odpowiednią kartę nad widokiem perspektywy (viewport).
tr: Şimdi de tek bir örneklemeye ayar yapalım. Çerçevenin üstündeki ilgili sekmeye tıklayarak, Main sahnesine geri dönün.
uk: Тепер налаштуємо окремий екземпляр. Поверніться до основної сцени, натиснувши відповідну вкладку над вікном перегляду.
zh_tw: 現在讓我們來調整單個實例。點擊視口上方的對應分頁回到 Main 場景。

source: Select one of the instanced Ball nodes and, in the Inspector, set its Gravity Scale value to ``10``.
ja: インスタンス化されたBallノードの1つを選択し、インスペクタで、その重力スケール("Gravity Scale")値を\ ``10``\ に設定します。
pl: Wybierz jeden z węzłów Ball i w Inspektorze ustaw jego wartość Skali Grawitacji (Gravity Scale) na ``10``.
tr: Örneklenmiş Ball düğümlerinden birini seçin ve, Denetleyicide, Yerçekimi Ölçeği'ni ``10`` olarak ayarlayın.
uk: Виберіть один із створених вузлів Ball і в Інспекторі встановіть його значення Gravity Scale на ``10``.
zh_tw: 選擇一個 Ball 實例節點，然後“屬性面板”中將 Gravity Scale（重力縮放）設為 ``10`` 。

source: A grey "revert" button appears next to the adjusted property.
ja: 変更したプロパティの横に、グレーの「復元」ボタンが表示されます。
pl: Obok dostosowanej właściwości pojawi się szary przycisk z zawiniętą strzałką - przycisk "przywróć".
tr: Değiştirilen özelliğin hemen yanında gri bir "geri al" düğmesi çıkar.
uk: Поруч зі зміненою властивістю з’являється сіра кнопка «Повернути».
zh_tw: 在被調整過的屬性旁邊就會多一個灰色的“復原”按鈕。

source: This icon indicates you are overriding a value from the source packed scene. Even if you modify the property in the original scene, the value override will be preserved in the instance. Clicking the revert icon will restore the property to the value in the saved scene.
ja: このアイコンは、元のパックされたシーンから値を上書きしていることを示します。元のシーンでプロパティを変更しても、値のオーバーライドはインスタンスに保存されます。復元アイコンをクリックすると、プロパティが保存されたシーンの値に復元されます。
pl: Zauważ, że obok dostosowanej właściwości pojawia się szary przycisk przywrócenia. Gdy przycisk ten jest obecny, oznacza to, że zmodyfikowano właściwość instancji w celu zastąpienia jej wartości w zapisanej scenie. Nawet jeśli ta właściwość zostanie zmodyfikowana w oryginalnej scenie, wartość niestandardowa pozostanie. Naciśnięcie przycisku przywracania spowoduje przywrócenie właściwości do wartości zapisanej sceny.
tr: Bu simge, paketlenmiş bir sahne kaynağından gelen değerin üzerine yazdığınızı gösterir. Özelliği, daha sonra kendi asıl sahnesinde değiştirseniz bile, bu örnekleme için yaptığınız üzerine yazma işlemi korunacaktır. Geri alma simgesine tıklamak, özelliği kaydedilen sahnedeki değerine geri alacaktır.
uk: Ця піктограма вказує на те, що ви замінюєте значення з вихідної запакованої сцени. Навіть якщо ви зміните властивість у вихідній сцені, перевизначення значення буде збережено в екземплярі. Натискання значка повернення відновить властивість до значення у збереженій сцені.
zh_tw: 可以注意到在已經調整的屬性旁邊會出現一個灰色的 [還原] 按鈕。如果出現了這個按鈕就代表修改了實體化的場景，而且這個節點的數值覆蓋了原始場景的值。就算再次修改原本的場景，這裡自定的數值還是會保留。點擊 [還原] 按鈕就能把屬性還原成原始場景的值。

source: Rerun the game and notice how this ball now falls much faster than the others.
ja: ゲームを再実行し、このボールが他のボールよりずっと速く落ちていることに注目してください。
pl: Uruchom grę ponownie i zwróć uwagę, że ta kulka spada teraz znacznie szybciej niż inne.
tr: Oyunu tekrar çalıştırın ve bu topun artık diğerlerinden çok daha hızlı düştüğüne dikkat edin.
uk: Запустіть гру знову і зверніть увагу, що цей м’яч тепер падає набагато швидше за інші.
zh_tw: 重新運作遊戲，請注意這個小球會比其他小球落得快得多。

source: Resources are another essential building block of Godot games we will cover in a later lesson.
ja: リソースは、後のレッスンで取り上げますが、Godotゲームの重要な構成要素の一つです。
tr: Kaynaklar, Godot oyunlarının bir diğer temel yapı taşıdır; bunu sonraki bir derste daha detaylı inceleyeceğiz.
uk: Ресурси є ще одним важливим будівельним блоком ігор Godot, про які ми розповімо в наступному уроці.
zh_tw: 資源也是 Godot 遊戲的關鍵元件，我們會在後續課程中介紹。

source: Scene instances as a design language
ja: デザイン言語としてのシーンインスタンス
tr: Tasarım dili olarak sahne örneklemeleri
uk: Екземпляри сцен як мова дизайну
zh_tw: 作為設計語言的場景實例

source: Instances and scenes in Godot offer an excellent design language, setting the engine apart from others out there. We designed Godot around this concept from the ground up.
ja: Godotのインスタンスとシーンは、優れたデザイン言語を提供し、他のエンジンとは一線を画しています。私たちは、一からこのコンセプトに基づいてGodotを設計しました。
tr: Godot'da örneklemeler ve sahneler, bu motoru diğerlerinden ayıran, harika bir tasarım dili sunarlar. Godot'yu bu kavram etrafında temelinden tasarladık.
uk: Екземпляри та сцени в Godot пропонують чудову мову дизайну, що виділяє двигун серед інших. Ми розробили Godot навколо цієї концепції з нуля.
zh_tw: Godot中的實例和場景提供了一種優秀的設計語言，使該引擎與其他引擎不同。我們從一開始就圍繞這個概念設計Godot。
