Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/nodes_and_scenes.po
Languages: de, ja

source: Nodes and Scenes
de: Nodes und Szenen
ja: ノードとシーン

source: In :ref:`doc_key_concepts_overview`, we saw that a Godot game is a tree of scenes and that each scene is a tree of nodes. In this lesson, we explain a bit more about them. You will also create your first scene.
de: In :ref:`doc_key_concepts_overview` haben wir gesehen, dass ein Godot-Spiel ein Baum von Szenen ist und dass jede Szene ein Baum von Nodes ist. In dieser Lektion erklären wir ein wenig mehr über sie. Sie werden auch Ihre erste Szene erstellen.
ja: :ref:`doc_key_concepts_overview` では、Godotゲームはシーンのツリーで構成され、各シーンはノードのツリーで構成されることを知りました。このレッスンでは、それらについてもう少し詳しく説明します。また、最初のシーンを作成します。

source: Nodes
ja: ノード

source: **Nodes are the fundamental building blocks of your game**. They are like the ingredients in a recipe. There are dozens of kinds that can display an image, play a sound, represent a camera, and much more.
de: **Nodes sind die grundlegenden Bausteine Ihres Spiels**. Sie sind wie die Zutaten in einem Rezept. Es gibt Dutzende von Arten, die ein Bild anzeigen, einen Sound abspielen, eine Kamera darstellen und vieles mehr.
ja: **ノードとは、ゲームの基礎的な構成要素のことです** 。ノードはレシピの材料のようなものです。ノードには、画像を表示したり、音を鳴らしたり、カメラを表現したりと、様々な種類があります。

source: All nodes have the following characteristics:
de: Alle Nodes weisen die folgenden Merkmale auf:
ja: すべてのノードには次の特性があります。

source: A name.
de: Ein Name.
ja: 名前

source: Editable properties.
de: Bearbeitbare Eigenschaften.
ja: 編集できるプロパティ

source: They receive callbacks to update every frame.
de: Sie erhalten Callbacks, um sich in jedem Frame zu aktualisieren.
ja: 毎フレーム、更新するためのコールバックを受け取ります。

source: You can extend them with new properties and functions.
de: Sie können um neue Eigenschaften und Funktionen erweitert werden.
ja: 新しいプロパティと関数を使用して拡張できます。

source: You can add them to another node as a child.
de: Sie können einem anderen Node als Child hinzugefügt werden.
ja: 別のノードを子として追加できます。

source: The last characteristic is important. **Together, nodes form a tree**, which is a powerful feature to organize projects. Since different nodes have different functions, combining them produces more complex behavior. As we saw before, you can build a playable character the camera follows using a :ref:`CharacterBody2D <class_CharacterBody2D>` node, a :ref:`Sprite2D <class_Sprite2D>` node, a :ref:`Camera2D <class_Camera2D>` node, and a :ref:`CollisionShape2D <class_CollisionShape2D>` node.
de: Das letzte Merkmal ist wichtig. **Zusammen bilden die Nodes einen Baum**, was ein leistungsstarkes Konzept zur Organisation von Projekten darstellt. Da verschiedene Nodes unterschiedliche Funktionen haben, kann durch ihre Kombination komplexeres Verhalten erreicht werden. Wie wir bereits gesehen haben, können Sie einen spielbaren Charakter, dem die Kamera folgt, mit einem :ref:`CharacterBody2D <class_CharacterBody2D>`-Node, einem :ref:`Sprite2D <class_Sprite2D>`-Node, einem :ref:`Camera2D <class_Camera2D>`-Node und einem :ref:`CollisionShape2D <class_CollisionShape2D>`-Node erstellen.
ja: 最後の特性が重要です。 **ノードは集まってツリーを形成します** 。これは、プロジェクトを構成するための強力な機能です。 異なるノードには異なる機能があるため、それらを組み合わせるとより複雑な動作が実現できます。 前に説明したように、カメラが追従するプレイアブルキャラクターを、 :ref:`CharacterBody2D <class_CharacterBody2D>` ノード、 :ref:`Sprite2D <class_Sprite2D>` ノード、 :ref:`Camera2D <class_Camera2D>` ノード、および :ref:`CollisionShape2D <class_CollisionShape2D>` ノードを使って作成することができます。

source: Scenes
de: Szenen
ja: シーン

source: When you organize nodes in a tree, like our character, we call this construct a scene. Once saved, scenes work like new node types in the editor, where you can add them as a child of an existing node. In that case, the instance of the scene appears as a single node with its internals hidden.
de: Wenn Sie Nodes in einem Baum organisieren, wie unseren Charakter, nennen wir dieses Konstrukt eine Szene. Nach dem Speichern funktionieren Szenen wie neue Node-Typen im Editor, wo Sie sie als Child eines bestehenden Nodes hinzufügen können. In diesem Fall erscheint die Instanz der Szene als ein einzelner Node, dessen innerer Zustand ausgeblendet ist.
ja: このキャラクタのようにツリー内のノードを編成したものをシーンと呼びます。保存すると、シーンはエディタの新しいタイプのノードのように動作し、既存のノードの子として追加できます。シーンのインスタンスは、内部が非表示になっている単一のノードとして表示されます。

source: Scenes allow you to structure your game's code however you want. You can **compose nodes** to create custom and complex node types, like a game character that runs and jumps, a life bar, a chest with which you can interact, and more.
de: Mit Szenen können Sie den Code Ihres Spiels strukturieren, wie Sie wollen. Sie können **Nodes zusammenstellen**, um benutzerdefinierte und komplexe Node-Typen zu erstellen, wie z.B. eine Spielcharakter, der läuft und springt, einen Lebensbalken, eine Truhe, mit der Sie interagieren können, und vieles mehr.
ja: シーンを使用すると、ゲームのコードを好きなように構成できます。 **ノードを構成** して、走ったりジャンプしたりするゲームキャラクター・ライフバー・操作できるチェストなど、独自で複雑なノードタイプを作成できます。

source: The Godot editor essentially is a **scene editor**. It has plenty of tools for editing 2D and 3D scenes, as well as user interfaces. A Godot project can contain as many of these scenes as you need. The engine only requires one as your application's **main scene**. This is the scene Godot will first load when you or a player runs the game.
de: Der Godot-Editor ist im Wesentlichen ein **Szeneneditor**. Er verfügt über eine Vielzahl von Tools zur Bearbeitung von 2D- und 3D-Szenen sowie von Benutzeroberflächen. Ein Godot-Projekt kann so viele dieser Szenen enthalten, wie Sie benötigen. Die Engine benötigt nur eine als **Hauptszene** Ihrer Anwendung. Dies ist die Szene, die Godot zuerst lädt, wenn Sie oder ein Spieler das Spiel starten.
ja: Godotエディタは基本的に **シーンエディタ** です。2Dや3Dのシーンを編集するためのツールや、ユーザーインターフェースなどが充実しています。1つのGodotプロジェクトには、必要なだけのシーンを含めることができます。エンジンが最低限で必要とするのは、アプリケーションの **メインシーン** の1つだけです。これは、あなたやプレイヤーがゲームを実行したときに、Godotが最初にロードするシーンです。

source: On top of acting like nodes, scenes have the following characteristics:
de: Zusätzlich zu ihrer Funktion als Nodes haben Szenen die folgenden Eigenschaften:
ja: ノードのように機能することに加えて、シーンには次の特性があります。

source: They always have one root node, like the "Character" in our example.
de: Sie haben immer einen Root-Node, wie der „Charakter“ in unserem Beispiel.
ja: この例の「キャラクター」のように、常に1つのルートノードがあります。

source: You can save them to your local drive and load them later.
de: Sie können auf Ihrem lokalen Laufwerk gespeichert und später geladen werden.
ja: ローカルドライブに保存しておいて、後で読み込むことができます。

source: You can create as many instances of a scene as you'd like. You could have five or ten characters in your game, created from your Character scene.
de: Es können so viele Instanzen einer Szene erstellt werden, wie Sie möchten. Sie könnten fünf oder zehn Charaktere in Ihrem Spiel haben, die aus Ihrer Charakter-Szene erstellt wurden.
ja: シーンのインスタンスはいくつでも作成できます。5人でも10人でも、キャラクターシーンから、キャラクターをゲームに保持することが出来ます。

source: Creating your first scene
de: Erstellen der ersten Szene
ja: 最初のシーンを作る

source: Let's create our first scene with a single node. To do so, you will need to :ref:`create a new project <doc_creating_and_importing_projects>` first. After opening the project, you should see an empty editor.
de: Lassen Sie uns unsere erste Szene mit einem einzelnen Node erstellen. Dazu müssen Sie zunächst :ref:`ein neues Projekt erstellen <doc_creating_and_importing_projects>`. Nachdem Sie das Projekt geöffnet haben, sollten Sie einen leeren Editor sehen.
ja: それでは、最初のシーンをノード1つだけで作成してみましょう。そのためには、最初に :ref:`新しいプロジェクト <doc_creating_and_importing_projects>` を作成する必要があります。 プロジェクトを開くと、空のエディタが表示されるはずです。

source: In an empty scene, the Scene dock on the left shows several options to add a root node quickly. "2D Scene" adds a :ref:`Node2D <class_Node2D>` node, "3D Scene" adds a :ref:`Node3D <class_Node3D>` node, and "User Interface" adds a :ref:`Control <class_Control>` node. These presets are here for convenience; they are not mandatory. "Other Node" lets you select any node to be the root node. In an empty scene, "Other Node" is equivalent to pressing the "Add Child Node" button at the top-left of the Scene dock, which usually adds a new node as a child of the currently selected node.
de: In einer leeren Szene zeigt das Szenendock auf der linken Seite mehrere Optionen zum schnellen Hinzufügen eines Root-Nodes an. „2D-Szene“ fügt ein :ref:`Node2D <class_Node2D>`-Node hinzu, „3D-Szene“ fügt ein :ref:`Node3D <class_Node3D>`-Node hinzu und „Benutzeroberfläche“ fügt ein :ref:`Control <class_Control>`-Node hinzu. Diese Vorgaben dienen der Bequemlichkeit; sie sind nicht verpflichtend. Mit „Anderer Node“ können Sie einen beliebigen Node als Root-Node auswählen. In einer leeren Szene ist „Anderer Node“ gleichbedeutend mit dem Drücken der Buttons „Child-Node hinzufügen“ oben links im Szenendock, wodurch normalerweise ein neues Node als Child des aktuell ausgewählten Nodes hinzugefügt wird.
ja: 空のシーンでは、左側のシーン ドックに、ルートノードをすばやく追加するための選択肢がいくつか表示されます。「2D Scene (2Dシーン)」は :ref:`Node2D <class_Node2D>` ノードを追加し、「3D Scene (3Dシーン)」は :ref:`Node3D <class_Node3D>` ノードを追加し、「User Interface (ユーザーインターフェイス)」は :ref:`Control <class_Control>` ノードを追加します。これらのプリセットは便宜上用意されているもので、必ずしもこのボタンを使わなければならないというわけではありません。「Other Node (その他のノード)」では任意のノードを選択できます。空のシーンにおいては、「その他のノード」はシーンドックの上部左側にある「Add Child Node (子ノードを追加)」と全く同じ機能で、その機能は通常、現在選択しているノードの子として新しいノードを追加するときに使います。

source: We're going to add a single :ref:`Label <class_Label>` node to our scene. Its function is to draw text on the screen.
de: Wir werden ein einzelnes :ref:`Label <class_Label>`-Node zu unserer Szene hinzufügen. Seine Funktion ist es, Text auf dem Bildschirm zu zeichnen.
ja: ここでは、:ref:`Label <class_Label>` ノードを1つシーンに追加します。このノードの役割は、スクリーンにテキストを描くことです。

source: Press the "Add Child Node" button or "Other Node" to create a root node.
de: Drücken Sie „Child-Node hinzufügen“ oder „Anderer Node“ um einen Root-Node zu erstellen.
ja: "子ノードを追加"ボタンをクリックするか、その他のノードをクリックして親ノードを作成します。

source: The Create Node dialog opens, showing the long list of available nodes.
de: Das Dialogfeld „Node erstellen“ wird geöffnet und zeigt die lange Liste der verfügbaren Nodes an.
ja: するとノード作成のダイアログが開いて、作成できるノードの長いリストが表示されます。

source: Select the Label node. You can type its name to filter down the list.
de: Wählen Sie den Label-Node. Sie können seinen Namen eingeben, um die Liste zu filtern.
ja: [Label] ノードを選択します。名前を入力して、リストを絞り込むことができます。

source: Click on the Label node to select it and click the Create button at the bottom of the window.
de: Klicken Sie auf den Label-Node, um ihn auszuwählen, und klicken Sie auf den Erstellen-Button am unteren Rand des Fensters.
ja: [Label] ノードをクリックして選択し、ウィンドウの下部にある [Create] ボタンをクリックします。

source: A lot happens when you add a scene's first node. The scene changes to the 2D workspace because Label is a 2D node type. The Label appears, selected, in the top-left corner of the viewport. The node appears in the Scene dock on the left, and the node's properties appear in the Inspector dock on the right.
de: Es passiert viel, wenn Sie den ersten Node einer Szene hinzufügen. Die Szene wechselt in den 2D-Viewport, da Label ein 2D-Nodetyp ist. Das Label erscheint, ausgewählt, in der oberen linken Ecke des Viewports. Der Node erscheint im Szenendock auf der linken Seite, und die Eigenschaften des Nodes erscheinen im Inspektor-Dock auf der rechten Seite.
ja: シーンの最初のノードを追加すると、多くのことが起こります。[Label]が 2D ノード タイプであるため、シーンは 2D ワークスペースに変わります。ビューポートの左上隅に[Label]が表示されます。ノードは左側のシーン ドックに表示され、ノードのプロパティは右側のインスペクター ドックに表示されます。

source: Changing a node's properties
de: Ändern der Eigenschaften eines Nodes
ja: ノードのプロパティの変更

source: The next step is to change the Label's "Text" property. Let's change it to "Hello World".
de: Mit dem nächsten Schritt wird die "Text"-Eigenschaft des Labels geändert. Ändern wir es zu "Hello World".
ja: 次の一歩はLabelの「Text(テキスト)」プロパティを変更することです。「Hello world」に変えてみましょう。

source: Head to the Inspector dock on the right of the viewport. Click inside the field below the Text property and type "Hello World".
de: Gehen Sie zum Inspektor-Dock auf der rechten Seite des Viewports. Klicken Sie in das Feld unter der Eigenschaft Text und geben Sie "Hello World" ein.
ja: ビューポートの右側にあるインスペクター ドックに向かいます。Text プロパティの下のフィールドをクリックし、「Hello World」と入力します。

source: You will see the text draw in the viewport as you type.
de: Sie sehen, wie der Text im Viewport gezeichnet wird, während Sie tippen.
ja: 入力すると、ビューポートにテキストが描画されるのがわかります。

source: You can edit any property listed in the Inspector as we did with the Text. For a complete reference of the Inspector dock, see :ref:`doc_editor_inspector_dock`.
de: Sie können jede im Inspektor aufgeführte Property bearbeiten, wie wir es mit dem Text getan haben. Eine vollständige Referenz des Inspektor-Docks finden Sie unter :ref:`doc_editor_inspector_dock`.
ja: Text プロパティで行ったように、インスペクターに表示されたプロパティを編集することができます。インスペクター ドックの詳細なリファレンスについては :ref:`doc_editor_inspector_dock` をご覧ください。

source: You can move your Label node in the viewport by selecting the move tool in the toolbar.
de: Sie können Ihr Label-Node im Viewport verschieben, indem Sie das Verschiebungs-Tool in der Toolbar auswählen.
ja: ビューポート内のLabelノードを移動するには、ツールバーの移動ツールを選択します。

source: With the Label selected, click and drag anywhere in the viewport to move it to the center of the view delimited by the rectangle.
de: Während das Label ausgewählt ist, ziehen Sie es per Drag&Drop an eine beliebige Stelle im Viewport, um es in die Mitte der durch das Rechteck begrenzten Ansicht zu verschieben.
ja: [Label] を選択した状態で、ビューポート内の任意の場所をクリックしてドラッグすると、長方形で区切られたビューの中心に移動します。

source: Running the scene
de: Ausführen der Szene
ja: シーンの実行

source: Everything's ready to run the scene! Press the Play Scene button in the top-right of the screen or press :kbd:`F6` (:kbd:`Cmd + R` on macOS).
de: Alles ist bereit, die Szene abzuspielen! Drücken Sie den "Szene abspielen"-Button oben rechts auf dem Bildschirm oder drücken Sie :kbd:`F6` (:kbd:`Cmd + R` unter macOS).
ja: さて、シーンを実行する準備がすべて整いました！トップバーの右の[シーンを実行]ボタンを押します (または :kbd:`F6` を押します)。

source: A popup invites you to save the scene, which is required to run it. Click the Save button in the file browser to save it as ``label.tscn``.
de: Ein Popup-Fenster fordert Sie auf, die Szene zu speichern; das ist zum Ausführen der Szene erforderlich. Klicken Sie im Dateibrowser auf den Speichern-Button, um die Szene als ``label.tscn`` zu speichern.
ja: シーンを保存するように促すポップアップが表示されますが、シーンの実行のために必要となります。ファイルブラウザの保存ボタンを押して、シーンを "label.tscn" という名前で保存してください。

source: The Save Scene As dialog, like other file dialogs in the editor, only allows you to save files inside the project. The ``res://`` path at the top of the window represents the project's root directory and stands for "resource path". For more information about file paths in Godot, see :ref:`doc_filesystem`.
de: Der Dialog "Szene speichern als" erlaubt, wie andere Dateidialoge im Editor, nur das Speichern von Dateien innerhalb des Projekts. Der ``res://`` Pfad am oberen Rand des Fensters stellt das Stammverzeichnis des Projekts dar und steht für "Ressourcen-Pfad". Für weitere Informationen über Dateipfade in Godot siehe :ref:`doc_filesystem`.
ja: Save Scene As ダイアログは、エディタの他のファイルダイアログと同様に、プロジェクト内のファイルのみ保存可能です。ウィンドウ上部の``res://`` パスはプロジェクト'のルートディレクトリを表し、 "resource path" を意味しています。Godotのファイルパスについての詳細は、 :ref:`doc_filesystem` を参照してください。

source: The application should open in a new window and display the text "Hello World".
de: Die Anwendung sollte sich in einem neuen Fenster öffnen und den Text "Hello World" anzeigen.
ja: アプリケーションが新しいウィンドウで開き、"Hello World"のテキストが表示されるはずです。

source: Close the window or press :kbd:`F8` (:kbd:`Cmd + .` on macOS) to quit the running scene.
de: Schließen Sie das Fenster oder drücken Sie :kbd:`F8` (:kbd:`Cmd + .` unter macOS), um die laufende Szene zu beenden.
ja: ウィンドウを閉じるか、 :kbd:`F8`（macOS では :kbd:`Cmd + .`）を押すと、実行中のシーンを終了します。

source: Setting the main scene
de: Die Hauptszene festlegen
ja: メイン シーンの設定

source: To run our test scene, we used the Play Scene button. Another button next to it allows you to set and run the project's main scene. You can press :kbd:`F5` (:kbd:`Cmd + B` on macOS) to do so.
de: Um unsere Testszene auszuführen, haben wir den "Szene abspielen"-Button verwendet. Ein weiterer Button daneben ermöglicht es Ihnen, die Hauptszene des Projekts einzustellen und auszuführen. Dazu können Sie :kbd:`F5` (:kbd:`Cmd + B` in macOS) drücken.
ja: テストシーンを実行するには、「実行」ボタンを使用します。その隣にある別のボタンで、プロジェクトのメインシーンを設定して実行することができます'。その際は :kbd:`F5` を押してください。

source: A popup window appears and invites you to select the main scene.
de: Ein Popup-Fenster erscheint und lädt Sie ein, die Hauptszene auszuwählen.
ja: ポップアップウィンドウが表示され、メインシーンを選択するように促されます。

source: Click the Select button, and in the file dialog that appears, double click on ``label.tscn``.
de: Klicken Sie auf den Auswählen-Button, und doppelklicken Sie im daraufhin angezeigten Dateidialog auf ``label.tscn``.
ja: 「選択」ボタンをクリックし、表示されたファイルダイアログで、 ``label.tscn`` をダブルクリックします。

source: The demo should run again. Moving forward, every time you run the project, Godot will use this scene as a starting point.
de: Die Demo sollte wieder laufen. In Zukunft wird Godot jedes Mal, wenn Sie das Projekt ausführen, diese Szene als Startpunkt verwenden.
ja: デモが再び実行されるはずです。今後、プロジェクトを実行するたびに、Godot はこのシーンを開始点として使用します。

source: The editor saves the main scene's path in a project.godot file in your project's directory. While you can edit this text file directly to change project settings, you can also use the "Project -> Project Settings" window to do so. For more information, see :ref:`doc_project_settings`.
de: Der Editor speichert den Pfad der Hauptszene in einer project.godot-Datei im Verzeichnis Ihres Projekts. Sie können diese Textdatei direkt bearbeiten, um die Projekteinstellungen zu ändern, Sie können aber auch das Fenster "Projekt -> Projekteinstellungen" dazu verwenden. Für weitere Informationen siehe :ref:`doc_project_settings`.
ja: エディターは、プロジェクトのディレクトリに、project.godotファイルとしてメインシーンのパスを保存します。このテキストファイルを直接編集してプロジェクトの設定を変更することもできますが、"Project -> Project Settings"ウィンドウを使用して変更することも可能です。 :ref:`doc_project_settings` をご確認下さい。

source: In the next part, we will discuss another key concept in games and in Godot: creating instances of a scene.
de: Im nächsten Teil werden wir ein weiteres Schlüsselkonzept in Spielen und in Godot besprechen: das Erstellen von Instanzen einer Szene.
ja: 次のパートでは、ゲームとGodotのもう1つの重要な概念、シーンのインスタンスの作成について説明します。

source: Translation status
de: Übersetzungsstatus
ja: 翻訳ステータス
