Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: de, ru, zh_tw

source: The line inside the function, ``rotation += angular_speed * delta``, increments our sprite's rotation every frame. Here, ``rotation`` is a property inherited from the class ``Node2D``, which ``Sprite2D`` extends. It controls the rotation of our node and works with radians.
de: Die Zeile innerhalb der Funktion, ``rotation += angular_speed * delta``, erhöht die Rotation des Sprites in jedem Frame. Hier ist ``rotation`` eine Eigenschaft, die von der Klasse ``Node2D`` geerbt wurde, die ``Sprite2D`` erweitert. Sie kontrolliert die Rotation unseres Node und arbeitet im Bogenmaß.
ru: Строка внутри функции, ``rotation += angular_speed * delta``, увеличивает угол поворота нашего спрайта каждый кадр. Здесь ``rotation`` — это свойство, унаследованное от класса ``Node2D``, который расширяет класс ``Sprite2D``. Он контролирует поворот нашего узла и работает с радианами.
zh_tw: 函式內部的那一行 ``rotation += angular_speed * delta`` 每一影格都會增加我們的精靈的旋轉量。這裡 ``rotation`` 是從 ``Sprite2D`` 所擴充的 ``Node2D`` 類繼承的屬性。它可以控制我們節點的旋轉，以弧度為單位。

source: In the code editor, you can ctrl-click on any built-in property or function like ``position``, ``rotation``, or ``_process`` to open the corresponding documentation in a new tab.
de: Im Code-Editor können Sie bei gedrückter Strg-Taste auf jede Built-in-Eigenschaft oder Funktion klicken, z.B. ``position``, ``rotation``, oder ``_process``, um die entsprechende Dokumentation in einem neuen Tab zu öffnen.
ru: В редакторе кода вы можете нажать Ctrl+ЛКМ на любом встроенном свойстве или функции, таких как ``position``, ``rotation``, или ``_process``, чтобы открыть соответствующую документацию в новой вкладке.
zh_tw: 在程式碼編輯器中，你可以按住 ctrl 按一下任何內建的屬性或函式，如 ``position`` 、 ``rotation`` 、 ``_process`` 以在新標籤頁中打開相應的文件。

source: Run the scene to see the Godot icon turn in-place.
de: Führen Sie die Szene aus, um zu sehen, wie sich das Godot-Icon an Ort und Stelle dreht.
ru: Запустите сцену, чтобы увидеть, что иконка Godot крутится на месте.
zh_tw: 運作該場景，可以看到 Godot 的圖示在原地轉動。

source: In C#, notice how the ``delta`` argument taken by ``_Process()`` is a ``double``. We therefore need to convert it to ``float`` when we apply it to the rotation.
de: In C# ist das Argument ``delta``, das von ``_Process()`` verwendet wird, ein ``double``. Wir müssen es daher in ``float`` umwandeln, wenn wir es auf die Rotation anwenden.
ru: Заметьте, что в C# аргумент ``delta``, принимаемый ``_Process()`` – это ``double``. Поэтому нам нужно конвертировать его в ``float``, когда мы применяем его к углу вращения.
zh_tw: 在 C# 中，請注意 ``_Process()`` 所採用的 ``delta`` 參數型別是 ``double`` 。 故當我們將其應用於旋轉時，需要將其轉換為 ``float`` 。

source: Moving forward
de: Gehen wir voran
ru: Движение вперёд
zh_tw: 下一頁

source: Let's now make the node move. Add the following two lines inside of the ``_process()`` function, ensuring the new lines are indented the same way as the ``rotation += angular_speed * delta`` line before them.
de: Lassen Sie uns nun den Node bewegen. Fügen Sie die folgenden zwei Zeilen innerhalb der Funktion ``_process()`` ein und achten Sie darauf, dass die neuen Zeilen genauso eingerückt sind wie die Zeile ``rotation += angular_speed * delta`` davor.
zh_tw: 現在我們來讓節點移動。在 ``_process()`` 函式中新增下面兩行程式碼，確保每一行都和之前的 ``rotation += angular_speed * delta`` 行的縮進保持一致。

source: As we already saw, the ``var`` keyword defines a new variable. If you put it at the top of the script, it defines a property of the class. Inside a function, it defines a local variable: it only exists within the function's scope.
de: Wie wir bereits gesehen haben, definiert das Schlüsselwort ``var`` eine neue Variable. Wenn Sie es an den Anfang des Skripts setzen, definiert es eine Eigenschaft der Klasse. Innerhalb einer Funktion definiert es eine lokale Variable: Sie existiert nur innerhalb des Funktionsbereichs.
ru: Как мы уже видели, ключевое слово ``var`` определяет новую переменную. Если вы поместите его в верхней части скрипта, оно определит свойство класса. Внутри функции оно определяет локальную переменную: данная переменная существует только в области действия функции.
zh_tw: 正如我們所看到的， ``var`` 關鍵字可以定義新變數。如果你把它放在腳本頂部，定義的就是類的屬性。在函式內部，定義的則是區域變數：只在函式的作用域中存在。

source: We define a local variable named ``velocity``, a 2D vector representing both a direction and a speed. To make the node move forward, we start from the Vector2 class's constant ``Vector2.UP``, a vector pointing up, and rotate it by calling the Vector2 method ``rotated()``. This expression, ``Vector2.UP.rotated(rotation)``, is a vector pointing forward relative to our icon. Multiplied by our ``speed`` property, it gives us a velocity we can use to move the node forward.
de: Wir definieren eine lokale Variable namens ``velocity``, ein 2D-Vektor, der sowohl eine Richtung als auch eine Geschwindigkeit repräsentiert. Um den Node vorwärts zu bewegen, gehen wir von der Konstante ``Vector2.UP`` der Klasse Vector2 aus, einem Vektor, der nach oben zeigt, und rotieren ihn, indem wir die Vector2-Methode ``rotated()`` aufrufen. Dieser Ausdruck, ``Vector2.UP.rotated(rotation)``, ist ein Vektor, der relativ zu unserem Icon nach vorne zeigt. Multipliziert mit unserer Eigenschaft ``speed`` ergibt sich eine Geschwindigkeit, mit der wir den Node vorwärts bewegen können.
ru: Мы определяем локальную переменную ``velocity``, 2D-вектор, представляющий собой направление и скорость. Чтобы заставить узел двигаться вперёд, мы берём константу ``Vector2.UP`` класса Vector2, вектор, указывающий вверх, и вращаем его, вызывая метод ``rotated()``. Данное выражение ``Vector2.UP.rotated(rotation)`` - вектор, указывающий вперёд относительно нашей иконки. Умноженное на наше свойство ``speed``, это выражение даёт нам скорость, которую мы можем использовать для перемещения узла вперёд.

source: We add ``velocity * delta`` to the node's ``position`` to move it. The position itself is of type :ref:`Vector2 <class_Vector2>`, a built-in type in Godot representing a 2D vector.
de: Wir fügen ``velocity * delta`` zu der ``position`` des Nodes hinzu, um ihn zu verschieben. Die Position selbst ist vom Typ :ref:`Vector2 <class_Vector2>`, einem Built-in-Typ in Godot, der einen 2D-Vektor darstellt.
ru: Мы добавляем ``velocity * delta`` к узлу ``position``, чтобы переместить его. Сама позиция имеет тип :ref:`Vector2 <class_Vector2>`, встроенный тип в Godot, представляющий двумерный вектор.
zh_tw: 我們在節點的 ``position`` 里加上 ``velocity * delta`` 來實作移動。位置本身是 :ref:`Vector2 <class_Vector2>` 型別的，是 Godot 用於表示 2D 向量的內建型別。

source: Run the scene to see the Godot head run in circles.
de: Führen Sie die Szene aus, um den Godot-Kopf im Kreis laufen zu sehen.
ru: Запустите сцену, чтобы увидеть, что голова Godot движется по кругу.
zh_tw: 運作場景就可以看到 Godot 頭像在繞圈圈。

source: Moving a node like that does not take into account colliding with walls or the floor. In :ref:`doc_your_first_2d_game`, you will learn another approach to moving objects while detecting collisions.
de: Beim Verschieben eines solchen Nodes werden Kollisionen mit Wänden oder dem Boden nicht berücksichtigt. In :ref:`doc_your_first_2d_game` lernen Sie einen anderen Ansatz, um Objekte zu bewegen und dabei Kollisionen zu erkennen.
ru: При таком перемещении узла не учитывается столкновение со стенами или полом. В :ref:`doc_your_first_2d_game` вы узнаете другой подход к перемещению объектов с обнаруженем столкновений.
zh_tw: 使用這樣的方法不會考慮與牆壁和地面的碰撞。在 :ref:`doc_your_first_2d_game` 中，你會學到另一種移動物件的方法，可以偵測碰撞。

source: Our node currently moves by itself. In the next part, :ref:`doc_scripting_player_input`, we'll use player input to control it.
de: Unser Node bewegt sich derzeit von selbst. Im nächsten Teil, :ref:`doc_scripting_player_input`, werden wir ihn mit Spielereingaben steuern.

source: Complete script
de: Vollständiges Skript
ru: Готовый скрипт
zh_tw: GDScript 範例

source: Here is the complete ``sprite_2d.gd`` file for reference.
de: Hier ist die vollständige Datei ``sprite_2d.gd`` als Referenz.
zh_tw: 這是完整的 ``sprite_2d.gd`` 檔案，僅供參考。

source: Translation status
de: Übersetzungsstatus
ru: Статус перевода
zh_tw: 翻譯狀態

source: Hello, world!
ru: Привет, мир!
