Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_languages.po
Languages: de, tr, zh_tw

source: Scripting languages
de: Skriptsprachen
tr: Betik dilleri
zh_tw: 為場景編寫腳本

source: This lesson will give you an overview of the available scripting languages in Godot. You will learn the pros and cons of each option. In the next part, you will write your first script using GDScript.
de: Diese Lektion gibt Ihnen einen Überblick über die verfügbaren Skriptsprachen in Godot. Sie lernen die Vor- und Nachteile der einzelnen Optionen kennen. Im nächsten Teil werden Sie Ihr erstes Skript mit GDScript schreiben.
tr: Bu ders size, Godot içinde kullanılabilir olan betik dilleri hakkında bir genel bakış sunar. Her birinin güçlü ve zayıf yönlerini öğreneceksiniz. Sonraki bölümde, GDScript ile ilk betiğinizi yazacaksınız.
zh_tw: 本課將向你介紹 Godot 中可用的指令碼語言。你將瞭解每個選項的優點和缺點。在下一部分，你將使用 GDScript 編寫你的第一個腳本。

source: **Scripts attach to a node and extend its behavior**. This means that scripts inherit all functions and properties of the node they attach to.
de: **Skripte hängen an einem Node und erweitern dessen Verhalten**. Das bedeutet, dass Skripte alle Funktionen und Eigenschaften des Nodes erben an das sie angehängt sind.
tr: **Betikler, bir düğüme bağlanır ve onun davranışını genişletir**. Bunun anlamı betiklerin, bağlandıkları düğümlerin bütün fonksiyonlarını ve özelliklerini miras almalarıdır.
zh_tw: **腳本附加到節點並擴充其行為** 。這意味著腳本繼承所附加節點的全部函式和屬性。

source: For example, take a game where a Camera2D node follows a ship. The Camera2D node follows its parent by default. Imagine you want the camera to shake when the player takes damage. As this feature is not built into Godot, you would attach a script to the Camera2D node and code the shake.
de: Nehmen wir zum Beispiel ein Spiel, in dem ein Camera2D-Node einem Schiff folgt. Der Camera2D-Node folgt standardmäßig seinem Parent. Stellen Sie sich vor, Sie wollen, dass die Kamera wackelt, wenn der Spieler Schaden nimmt. Da dieses Feature in Godot nicht eingebaut ist, würden Sie ein Skript an den Camera2D-Node anhängen und das Wackeln programmieren.
tr: Örneğin, bir 2B kamera düğümünün, Camera2D, bir gemiyi takp ettiği bir oyunu ele alalım. Camera2D düğümü, varsayılan olarak kendi üst-öğesini takip eder. Oyuncu hasar aldığında kemarayı sarsmak istediğinizi hayal edin. Böyle bir özellik Godot'un içinde yerleşik gelmediğinden dolayı, Camera2D düğümüne bir betik bağlar ve sarsıntıyı kodlardınız.
zh_tw: 例如，以一個 Camera2D 節點跟隨一艘船的遊戲為例。Camera2D 節點預設跟隨其父節點。想像一下，當玩家受到傷害時，您希望相機震動。由於此功能未內建在 Godot 中，因此您可以在該 Camera2D 節點上附加腳本並對抖動進行程式設計。

source: Available scripting languages
de: Verfügbare Skriptsprachen
tr: Kullanılabilir betik dilleri
zh_tw: 與其他腳本語言溝通

source: Godot offers **four gameplay programming languages**: GDScript, C#, and, via its GDExtension technology, C and C++. There are more community-supported languages, but these are the official ones.
de: Godot bietet **fünf Gameplay-Programmiersprachen** an: GDScript, C#, VisualScript und über seine GDExtension-Technologie C und C++. Es gibt noch mehr von der Community-unterstützte Sprachen, aber dies sind die offiziellen.
zh_tw: Godot 提供了 **四種遊戲程式設計語言** ：GDScript、C# 以及通過 GDExtension 技術提供的 C 和 C++。還有更多社區支援的語言，但這四個是官方語言。

source: You can use multiple languages in a single project. For instance, in a team, you could code gameplay logic in GDScript as it's fast to write, and use C# or C++ to implement complex algorithms and maximize their performance. Or you can write everything in GDScript or C#. It's your call.
de: Sie können mehrere Sprachen in einem einzigen Projekt verwenden. In einem Team könnten Sie zum Beispiel die Spiellogik in GDScript programmieren, da es schnell zu schreiben ist, und C# oder C++ verwenden, um komplexe Algorithmen zu implementieren und deren Leistung zu maximieren. Oder Sie können alles in GDScript oder C# schreiben. Es ist Ihre Entscheidung.
zh_tw: 您可以在一個專案中使用多種語言。例如，在團隊中，您可以在 GDScript 中編寫遊戲邏輯，因為它編寫起來很快，並使用 C# 或 C++ 來實作複雜的演算法並最大限度地提高其性能。或者您可以使用 GDScript 或 C# 編寫所有內容。由您決定。

source: We provide this flexibility to answer the needs of different game projects and developers.
de: Wir bieten diese Flexibilität, um den Anforderungen verschiedener Spieleprojekte und Entwickler gerecht zu werden.
tr: Farklı oyun projeleri ve geliştiricilerin ihtiyaçlarını karşılamak için bu esneklği sağlıyoruz.
zh_tw: 我們提供這種靈活性以滿足不同遊戲專案和開發者的需求。

source: Which language should I use?
de: Welche Sprache soll verwendet werden?
tr: Hangi dili kullanmalıyım?
zh_tw: GDScript是什麼？為什麼我要用它？

source: If you're a beginner, we recommend to **start with GDScript**. We made this language specifically for Godot and the needs of game developers. It has a lightweight and straightforward syntax and provides the tightest integration with Godot.
de: Wenn Sie Anfänger sind, empfehlen wir **mit GDScript zu beginnen**. Wir haben diese Sprache speziell für Godot und die Bedürfnisse von Spieleentwicklern entwickelt. Sie hat eine leichtgewichtige und unkomplizierte Syntax und bietet die engste Integration mit Godot.
tr: Eğer yeni başlayan biri iseniz, **GDScript ile başlama** 'nızı öneriyoruz. Bu dili Godot ve oyun geliştiricleri için özel olarak yaptık. Hafif ve anlaşılır bir söz dizimi var ve Godot ile en sıkı bütünleşmeyi sağlar.
zh_tw: 如果你是初學者，我們推薦 **從 GDScript 入手** 。這門語言是我們針對 Godot 和遊戲開發者的需求製作的。語法簡單直白，與 Godot 結合得最為緊密。

source: For C#, you will need an external code editor like `VSCode <https://code.visualstudio.com/>`_ or Visual Studio. While C# support is now mature, you will find fewer learning resources for it compared to GDScript. That's why we recommend C# mainly to users who already have experience with the language.
de: Für C# benötigen Sie einen externen Code-Editor wie `VSCode <https://code.visualstudio.com/>`_ oder Visual Studio. Obwohl die C#-Unterstützung mittlerweile ausgereift ist, werden Sie im Vergleich zu GDScript weniger Lernressourcen dafür finden. Deshalb empfehlen wir C# vor allem Anwendern, die bereits Erfahrung mit der Sprache haben.
tr: C# için, `VSCode <https://code.visualstudio.com/>`_ ya da Visual Studio gibi harici bir kod düzenleyiciye ihtiyacınız olacak. C# desteği şimdi çok daha olgun olsa da, GDScript ile karşılatırınca daha az öğrenme kaynağı olduğunu göreceksiniz. C# kullanmayı, asıl olarak dilin kendisi ile deneyimli olan kullanıcılara öneriyor olmamızın nedeni bundandır.
zh_tw: 使用 C# 時，你需要使用 `VSCode <https://code.visualstudio.com/>`_ 或 Visual Studio 等外部編輯器。雖然對 C# 支援目前已經成熟，但相對 GDScript 而言，能找到的學習資源會比較少。因此，我們主要推薦已經熟悉 C# 語言的使用者去使用 C#。

source: Let's look at each language's features, as well as its pros and cons.
de: Schauen wir uns die Merkmale jeder Sprache an, sowie ihre Vor- und Nachteile.
tr: Her dilin özelliklerine, ve güçlü ve zayıf taraflarına bir bakalım.
zh_tw: 讓我們來看看各個語言的功能，以及優缺點。

source: :ref:`GDScript<doc_gdscript>` is an `object-oriented <https://en.wikipedia.org/wiki/Object-oriented_programming>`_ and `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`_ programming language built for Godot. It's made by and for game developers to save you time coding games. Its features include:
de: :ref:`GDScript<doc_gdscript>` ist eine `objektorientierte <https://en.wikipedia.org/wiki/Object-oriented_programming>`_ und `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`_ Programmiersprache für Godot. Sie wurde von und für Spieleentwickler entwickelt, um Ihnen Zeit beim Programmieren von Spielen zu sparen. Seine Features umfassen:
tr: :ref:`GDScript<doc_gdscript>`, Godot için türetilmiş bir `nesne-tabanlı <https://en.wikipedia.org/wiki/Object-oriented_programming>`_ ve `emredici <https://en.wikipedia.org/wiki/Imperative_programming>`_ programlama dilidir. Oyunları kodlarken zaman kazanmak için, oyun geliştiricileri tarafından ve yine onlar için yapıldı. Özellikleri arasında şunlar var:
zh_tw: :ref:`GDScript<doc_gdscript>` 是一門 `物件導向 <https://zh.wikipedia.org/wiki/%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E7%A8%8B%E5%BA%8F%E8%AE%BE%E8%AE%A1>`_ 的 `指令式 <https://zh.wikipedia.org/wiki/%E6%8C%87%E4%BB%A4%E5%BC%8F%E7%B7%A8%E7%A8%8B>`_ 程式設計語言，專為 Godot 建構。是遊戲開發者為遊戲開發者製作的，目的是節省編寫遊戲程式碼的時間。它的功能包括：

source: A simple syntax that leads to short files.
de: Eine einfache Syntax, die zu kurzen Textdateien führt.
tr: Kısa dosyalarla sonuçlanan basit söz dizimi.
zh_tw: 簡單的語法，讓檔更短。

source: Blazing fast compilation and loading times.
de: Rasend schnelle Kompilierungs- und Ladezeiten.
tr: Çok hızlı derleme ve yüklenme süreleri.
zh_tw: 極快的編譯和載入速度。

source: Tight editor integration, with code completion for nodes, signals, and more information from the scene it's attached to.
de: Enge Editor-Integration mit Code-Vervollständigung für Nodes, Signale und weitere Informationen aus der Szene, an die es angehängt ist.
tr: Düğümler ve sinyaller için kod tamamlama, ve bağlandığı sahne için çok daha fazla bilgi verebilen sıkı düzenleyici bütünleşmesi.
zh_tw: 編輯器整合讓作業過程變得更開心。節點、訊號以及其他與正在編輯的場景有關的專案都能進行程式碼補全。

source: Built-in vector and transform types, making it efficient for heavy use of linear algebra, a must for games.
de: Built-in-Vektor- und Transformations-Typen, die eine effiziente Nutzung der linearen Algebra ermöglichen - ein Muss für Spiele.
tr: Yerleşik vektör ve dönüştürme tipleri; oyunların olmazsa olmazı doğrusal cebirin yoğun kullanımını verimli hale getirir.
zh_tw: 有內建 Vector 型別 (如 Vector, Transform…等)，當需要大量線性代數運算時更有效率。

source: Supports multiple threads as efficiently as statically typed languages.
de: Unterstützt mehrere Threads so effizient wie statisch typisierte Sprachen.
tr: Çoklu iş parçacıklarını, statik yazımlı diller kadar etkin şekilde destekler.
zh_tw: 與靜態型別相比效能較差。

source: No `garbage collection <https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)>`_, as this feature eventually gets in the way when creating games. The engine counts references and manages the memory for you in most cases by default, but you can also control memory if you need to.
de: Keine `Garbage Collection <https://de.wikipedia.org/wiki/Garbage_Collection>`_, da dieses Feature bei der Erstellung von Spielen irgendwann im Weg ist. Die Engine zählt Referenzen und verwaltet den Speicher in den meisten Fällen standardmäßig für Sie, aber Sie können den Speicher auch kontrollieren, wenn Sie ihn brauchen.
tr: `Çöp toplama <https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)>`_ bulunmaz, çünkü bu özellik oyunlar oluştururken mutlaka bir engel oluşturur. Motor, pek çok durumda varsayılan olarak, başvuruları sayar ve hafızayı sizin için yönetir, ama gerekirse hafızayı kendiniz de denetleyebilirsiniz.
zh_tw: 沒有 `垃圾回收 <https://zh.wikipedia.org/wiki/%E5%9E%83%E5%9C%BE%E5%9B%9E%E6%94%B6_(%E8%A8%88%E7%AE%97%E6%A9%9F%E7%A7%91%E5%AD%B8)>`_ ，因為最終會影響遊戲的開發。引擎會預設進行引用計數，在大多數情況下為你管理記憶體，但你也可以在需要時自行控制記憶體。

source: `Gradual typing <https://en.wikipedia.org/wiki/Gradual_typing>`_. Variables have dynamic types by default, but you also can use type hints for strong type checks.
de: `Gradual Typing <https://en.wikipedia.org/wiki/Gradual_typing>`_. Variablen haben standardmäßig dynamische Typen, aber Sie können auch Typ-Hinweise für strenge Typ-Prüfungen verwenden.
tr: `Kademeli tipler <https://en.wikipedia.org/wiki/Gradual_typing>`_. Değişkenler, varsayılan olarak dinamik tiplere sahiptir, ancak güçlü tip denetlemesi için tip belirteçlerini kullanabilirsiniz.
zh_tw: `緩型別 <https://en.wikipedia.org/wiki/Gradual_typing>`_ 。變數預設是動態型別，但你也可以使用型別提示來做強型別檢查。

source: GDScript looks like Python as you structure your code blocks using indentations, but it doesn't work the same way in practice. It's inspired by multiple languages, including Squirrel, Lua, and Python.
de: GDScript sieht aus wie Python, da Sie Ihre Codeblöcke mit Einrückungen strukturieren, aber in der Praxis funktioniert es nicht auf dieselbe Weise. Es ist von mehreren Sprachen inspiriert, darunter Squirrel, Lua und Python.
tr: GDScript, Python gibi görünür çünkü kodunuzu girintili kod kalıpları kullanarak şekillendirirsiniz, ancak uygulamada pekte aynı şekilde çalışmaz. Squirrel, Lua, ve Python dahil pek çok dilden esinlenilmiştir.
zh_tw: 因為 GDScript 用縮進來做程式碼塊的結構化，所以它看上去像 Python，不過實際上這兩者的原理截然不同。GDScript 是從 Squirrel、Lua、Python 等諸多語言中得到的靈感。

source: Why don't we use Python or Lua directly?
de: Warum verwenden wir nicht direkt Python oder Lua?
tr: Neden doğrudan Python ya da Lua kullanmıyoruz?
zh_tw: 我們為什麼不直接使用 Python 或者 Lua？

source: Years ago, Godot used Python, then Lua. Both languages' integration took a lot of work and had severe limitations. For example, threading support was a big challenge with Python.
de: Vor Jahren verwendete Godot Python, dann Lua. Die Integration beider Sprachen erforderte eine Menge Arbeit und hatte starke Einschränkungen. Zum Beispiel war die Unterstützung von Threads eine große Herausforderung bei Python.
tr: Yıllar önce Godot, Python kullanıyordu, sonra Lua kullandı. Her iki dilinde bütünleşmesi çok fazla iş istiyordu ve ciddi sınırlamaları vardı. Örneğin, Python ile iş parçacıkları desteği büyük bir mücadeleydi.
zh_tw: 很多年前，Godot 使用過 Python，後來也用過 Lua。這兩個語言的集成花費了大量精力，並且還存在局限性。例如，在 Python 中做多執行緒支援是非常大的挑戰。

source: Developing a dedicated language doesn't take us more work and we can tailor it to game developers' needs. We're now working on performance optimizations and features that would've been difficult to offer with third-party languages.
de: Die Entwicklung einer eigenen Sprache bedeutet für uns nicht mehr Arbeit und wir können sie auf die Bedürfnisse von Spieleentwicklern zuschneiden. Wir arbeiten jetzt an Leistungsoptimierungen und Features, die mit Sprachen von Drittanbietern nur schwer zu realisieren wären.
tr: Adanmış bir dil geliştirmeye çalışmak daha fazla iş yükü getirmiyor, ve bunu oyun geliştiricilerin ihtiyacına göre şekillendirebiliyoruz. Şimdi artık performans en iyileştirmelerine ve üçüncü-taraf dillerle sunmanın çok zor olacağı özellikler üzerine çalışıyoruz.
zh_tw: 開發專屬語言不會花費更多的時間，我們還能針對遊戲開發者的需求去量體裁衣。我們現在在做性能優化工作，以及用協力廠商語言難以實作的功能。

source: As Microsoft's `C# <https://en.wikipedia.org/wiki/C_Sharp_(programming_language)>`_ is a favorite amongst game developers, we officially support it. C# is a mature and flexible language with tons of libraries written for it. We were able to add support for it thanks to a generous donation from Microsoft.
de: Da Microsofts `C# <https://en.wikipedia.org/wiki/C_Sharp_(programming_language)>`_ ein Favorit unter Spieleentwicklern ist, unterstützen wir sie offiziell. C# ist eine ausgereifte und flexible Sprache, für die eine Vielzahl von Bibliotheken geschrieben wurde. Dank einer großzügigen Spende von Microsoft konnten wir die Unterstützung für diese Sprache hinzufügen.
zh_tw: 微軟的 C# 是很受遊戲開發者歡迎的語言，所以 Godot 也新增了對 C# 的官方支援。C# 是一個成熟的語言，有許多程式都是用 C# 寫的。要感謝微軟慷慨的捐款讓我們能夠支援 C#。

source: C# offers a good tradeoff between performance and ease of use, although you should be aware of its garbage collector.
de: C# besitzt einen hervorragenden Kompromiss zwischen Leistung und Benutzerfreundlichkeit, obwohl man sich seines Garbage Collectors bewusst sein muss.
tr: C#, performans ve kullanım kolaylığı arasında iyi bir denge sunar, ancak çöp toplayıcısı hakkında dikkatli olmanız gerekir.
zh_tw: C# 在易用度與效能間的平衡做得非常優秀，雖然需要注意一下記憶體回收行程。

source: You must use the .NET edition of the Godot editor to script in C#. You can download it on the Godot website's `download <https://godotengine.org/download/>`_ page.
de: Sie müssen die .NET-Edition des Godot-Editors verwenden, um Skripte in C# zu schreiben. Sie können ihn auf der Godot-Website unter `Download <https://godotengine.org/download/>`_ herunterladen.
zh_tw: 你必須使用 .NET版本的 Godot 編輯器才能在專案中使用 C# 進行程式設計。你可以在 Godot 網站的 `下載 <https://godotengine.org/download/>`_ 頁面進行下載。

source: Since Godot uses .NET 6, in theory, you can use any third-party .NET library or framework in Godot, as well as any Common Language Infrastructure-compliant programming language, such as F#, Boo, or ClojureCLR. However, C# is the only officially supported .NET option.
de: Da Godot .NET 6 verwendet, können Sie theoretisch jede .NET-Bibliothek oder jedes .NET-Framework eines Drittanbieters in Godot verwenden, ebenso wie jede Programmiersprache, die mit der Common Language Infrastructure kompatibel ist, z.B. F#, Boo oder ClojureCLR. C# ist jedoch die einzige offiziell unterstützte .NET-Option.
zh_tw: Godot 使用了 `Mono <https://mono-project.com>`_ .NET 執行環境，理論上任一第三方 .NET 函式庫或框架都可以拿來在 Godot 裡使用。同樣的，理論上其他 CLI (Common Language Infrastructure，通用語言基礎結構) 相容的程式語言也都能使用，如 F#, Boo 或是 ClojureCLR。但 C# 是唯一官方支援的 .NET 選項。

source: GDScript code itself doesn't execute as fast as compiled C# or C++. However, most script code calls functions written with fast algorithms in C++ code inside the engine. In many cases, writing gameplay logic in GDScript, C#, or C++ won't have a significant impact on performance.
de: Der GDScript-Code selbst ist nicht so schnell wie kompilierter C#- oder C++-Code. Allerdings ruft der meiste Skriptcode Funktionen auf, die mit schnellen Algorithmen in C++-Code innerhalb der Engine geschrieben wurden. In vielen Fällen hat das Schreiben von Spiellogik in GDScript, C# oder C++ keine signifikanten Auswirkungen auf die Leistung.
tr: GDScript kodu tek başına, derlenmiş bir C# veya C++ kadar hızlı çalışmaz. Buna rağmen, betik kodlarının pek çoğu motorun içinde C++ ile kodlanmış hızlı algoritmalarla yazılmış fonksiyonları çağırırlar. Pek çok durumda, oynanış mantığını yazarken GDScript, C#, veya C++ kullanmanın performans üzerindeki etkisi çok fazla değişmez.
zh_tw: GDScript 程式碼本身的執行是沒有 C# 或 C++ 等編譯型語言快的。然而，大多數腳本程式碼都是在呼叫引擎中的 C++ 程式碼快速演算法。在許多情況下，使用 GDScript、C#、C++ 編寫遊戲邏輯並不會有顯著的性能區別。

source: Projects written in C# using Godot 4 currently cannot be exported to the web platform. To use C# on that platform, consider Godot 3 instead. Android and iOS platform support is available as of Godot 4.2, but is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
de: Projekte, die in C# mit Godot 4 geschrieben wurden, können derzeit nicht auf die Web-Plattform exportiert werden. Um C# auf dieser Plattform zu verwenden, sollten Sie stattdessen Godot 3 verwenden. Unterstützung für die Plattformen Android und iOS ist ab Godot 4.2 verfügbar, dies ist aber experimentell und :ref:`es gelten einige Einschränkungen <doc_c_sharp_platforms>`.

source: C++ via GDExtension
de: C++ per GDExtension
zh_tw: 通過 GDExtension 使用 C++

source: GDExtension allows you to write game code in C++ without needing to recompile Godot.
de: Mit der GDExtension können Sie Spielcode in C++ schreiben, ohne Godot neu kompilieren zu müssen.
zh_tw: 最後是 3.0 版所新增的亮點：GDNative。使用 GDNative 就可以在不需要重新編譯 (甚至重新啟動) Godot 的情況下以 C++ 來寫腳本。

source: You can use any version of the language or mix compiler brands and versions for the generated shared libraries, thanks to our use of an internal C API Bridge.
de: Dank unserer internen C-API-Brücke können Sie jede beliebige Version der Sprache verwenden oder Compiler-Hersteller und -Versionen für die generierten gemeinsamen Bibliotheken mischen.
tr: Dilin herhangi bir sürümü kullanılabilir, veya üretilen paylaşımlı kütüphaneler için derleyici markalarını ve sürümlerini karıştırabilirsiniz; bunların hepsi dahili bir C API Köprüsü kullanmamız sayesindedir.
zh_tw: 可以使用任一版本的 C++。而因為使用了內部 C API Bridge，也可以正常使用由不同編譯器產生的共用函式庫。

source: GDExtension is the best choice for performance. You don't need to use it throughout an entire game, as you can write other parts in GDScript or C#.
de: GDExtension ist die beste Wahl, wenn Sie Leistung benötigen. Sie müssen sie nicht für das gesamte Spiel verwenden, da Sie andere Teile in GDScript oder C# schreiben können.
zh_tw: 若要追求效能，GDNative / C++ 是最好的選擇。而且不需要整個遊戲都改用 GDNative / C++，其他部分還是可以用 GDScript 或視覺腳本 (Visual Script) 來寫。話雖如此，GDNative 的 API 還是很清楚簡單的，因為大部分都是直接用 Godot 原生 API。

source: When working with GDExtension, the available types, functions, and properties closely resemble Godot's actual C++ API.
de: Bei der Arbeit mit GDExtension ähneln die verfügbaren Typen, Funktionen und Eigenschaften stark der eigentlichen C++-API von Godot.
zh_tw: 當使用 GDExtension 時，可用的型別、函式和屬性與 Godot 實際的 C++ API 非常相似。

source: Summary
de: Zusammenfassung
tr: Özet
zh_tw: 總結

source: Scripts are files containing code that you attach to a node to extend its functionality.
de: Skripte sind Dateien mit Code, die Sie an ein Node anhängen, um dessen Funktionalität zu erweitern.
tr: Betikler, bir düğüme bağladığınız ve onun özelliklerini genişleten kodlar içeren dosyalardır.
zh_tw: 腳本是包含附加到節點以擴充其功能的程式碼檔。

source: Godot supports four official scripting languages, offering you flexibility between performance and ease of use.
de: Godot unterstützt vier offizielle Skriptsprachen und bietet Ihnen damit Flexibilität zwischen Leistung und Benutzerfreundlichkeit.
zh_tw: Godot 支援四種官方指令碼語言，在性能和易用性之間為你提供靈活性。

source: You can mix languages, for instance, to implement demanding algorithms with C or C++ and write most of the game logic with GDScript or C#.
de: Sie können Sprachen mischen, um beispielsweise anspruchsvolle Algorithmen mit C oder C++ zu implementieren und den Großteil der Spiellogik mit GDScript oder C# zu schreiben.
tr: Dilleri karıştırabilirsiniz; mesela çok zorlu algoritmaları C veya C++ ile yazıp, oyun mantığının çoğunluğunu da GDScript veya C# ile yazabilirsiniz.
zh_tw: 你可以混合語言，例如，用 C 或 C++ 實作高要求的演算法，用 GDScript 或 C# 編寫大部分的遊戲邏輯。

source: Translation status
de: Übersetzungsstatus
tr: Çeviri durumu
zh_tw: 翻譯狀態
