Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_player_input.po
Languages: tr

source: Listening to player input
tr: Oyuncu girdisini dinlemek

source: You have two main tools to process the player's input in Godot:
tr: Oyuncu girdilerini işlemek için, Godot'da iki ana araç bulunur:

source: The built-in input callbacks, mainly ``_unhandled_input()``. Like ``_process()``, it's a built-in virtual function that Godot calls every time the player presses a key. It's the tool you want to use to react to events that don't happen every frame, like pressing :kbd:`Space` to jump. To learn more about input callbacks, see :ref:`doc_inputevent`.
tr: Başta ``_unhandled_input()`` olmak üzere dahili girdi geriçağrıları. ``_process()`` gibi bu da, oyuncunun bir tuşa bastığı her seferinde Godot'nun çağırdığı dahili bir sanal fonksiyondur. :kbd:`Boşluk` tuşuna basıp zıplamak gibi, her karede gerçekleşmeyen olaylara tepki vermek için kullanmak isteyeceğiniz bir araçtır. Girdi geriçağrıları hakkında daha fazlasını öğrenmek, :ref:`doc_inputevent` sayfasına bakınız.

source: The ``Input`` singleton. A singleton is a globally accessible object. Godot provides access to several in scripts. It's the right tool to check for input every frame.
tr: ``Input`` tekil nesnesi. Bir tekil nesne, genel erişilebilir bir nesnedir. Godot, betik içerisinde bunlardan pek çoğuna erişim sağlar. Her karede girdileri denetlemek en doğru araçtır.

source: We're going to use the ``Input`` singleton here as we need to know if the player wants to turn or move every frame.
tr: Burada ``Input`` tekil nesnesini kullanacağız, çünkü oyuncunun dönmeyi veya hareket etmeyi isteyip istemediğini her karede bilmemiz gerekiyor.

source: For turning, we should use a new variable: ``direction``. In our ``_process()`` function, replace the ``rotation += angular_speed * delta`` line with the code below.
tr: Dönüş için, yeni bir değişken kullanmalıyız: ``direction`` (yön). ``_process()`` fonksiyonumuzda, ``rotation += angular_speed * delta`` satırını aşağıdaki kod ile değiştirin.

source: Our ``direction`` local variable is a multiplier representing the direction in which the player wants to turn. A value of ``0`` means the player isn't pressing the left or the right arrow key. A value of ``1`` means the player wants to turn right, and ``-1`` means they want to turn left.
tr: ``direction`` yerel değişkeni, oyuncunun dönmek istediği yönü belirten bir çarpandır. ``0`` değeri oyuncunun sol veya sağ ok tuşlarına basmadığını ifade eder. ``1`` değeri oyuncunun sağa dönmek istediği, ``-1`` ise sola dönmek istediği anlamındadır.

source: To produce these values, we introduce conditions and the use of ``Input``. A condition starts with the ``if`` keyword in GDScript and ends with a colon. The condition is the expression between the keyword and the end of the line.
tr: Bu değerleri üretmek için, koşulları ve ``Input`` kullanımını tanıtıyoruz. Bir koşul, GDScript'te ``if`` (eğer) anahtar kelimesi ile başlar ve iki nokta üstüste ile biter. Koşulun kendisi ise anahtar kelime ile satır sonu arasında kalan ifadedir.

source: To check if a key was pressed this frame, we call ``Input.is_action_pressed()``. The method takes a text string representing an input action and returns ``true`` if the action is pressed, ``false`` otherwise.
tr: Bu karede bir tuşa basılıp basılmadığını denetlemek için ``Input.is_action_pressed()`` çağrısını yaparız. Yöntem, girdi eylemini temsil eden bir yazı dizesi alır, ve eğer eylem basılmışsa ``true`` (doğru), değilse ``false`` (yanlış) döndürür.

source: The two actions we use above, "ui_left" and "ui_right", are predefined in every Godot project. They respectively trigger when the player presses the left and right arrows on the keyboard or left and right on a gamepad's D-pad.
tr: Yukarıda kullandığımız iki tane eylem, "ui_left" ve "ui_right", her Godot projesinde ön tanımlı gelir. Bunlar oyuncunun klavyeden sırasıyla sol ve sağ ok tuşlarına, veya oyun kumandasındaki D-pad üzerinde sol ve sağ düğmelere basması ile tetiklenir.

source: You can see and edit input actions in your project by going to Project -> Project Settings and clicking on the Input Map tab.
tr: Projenizin girdi eylemlerini, Proje -> Proje Ayarları'na gidip Girdi Haritası sekmesine tıklayarak görebilir ve düzenleyebilirsiniz.

source: Finally, we use the ``direction`` as a multiplier when we update the node's ``rotation``: ``rotation += angular_speed * direction * delta``.
tr: Son olarak, ``direction`` (yön) değerini düğümümüzün dönmesini, ``rotation``, güncellerken çarpan olarak kullanıyoruz: ``rotation += angular_speed * direction * delta``.

source: If you run the scene with this code, the icon should rotate when you press :kbd:`Left` and :kbd:`Right`.
tr: Eğer sahnenizi bu kod ile çalıştırırsanız, simgenin :kbd:`Sol` ve :kbd:`Sağ` tuşlara bastığınız zaman döndüğünü görmelisiniz.

source: Moving when pressing "up"
tr: "Yukarı" basarak hareket etmek

source: To only move when pressing a key, we need to modify the code that calculates the velocity. Replace the line starting with ``var velocity`` with the code below.
tr: Sdece bir tuşa basarken hareket etmek için, hız vektörünü hesaplayan kodu değiştirmemiz gerekiyor. ``var velocity`` ile başlayan satırı aşağıdaki kod ile değiştirin.

source: We initialize the ``velocity`` with a value of ``Vector2.ZERO``, another constant of the built-in ``Vector`` type representing a 2D vector of length 0.
tr: ``velocity`` 'yi ``Vector2.ZERO`` ilk değeri ile başlattık; bu da yine yerleşik ``Vector`` tipinde, uzunluğu 0 olan bir 2B vektörü temsil eder (sıfır).

source: If the player presses the "ui_up" action, we then update the velocity's value, causing the sprite to move forward.
tr: Eğer oyuncu "ui_up" (yukarı) eylemine basarsa, hız vektörünün değerini güncelleriz, bu da grafik öğeyi ileriye hareket ettirir.

source: Complete script
tr: Tamamlanmış betik

source: If you run the scene, you should now be able to rotate with the left and right arrow keys and move forward by pressing :kbd:`Up`.
tr: Eğer bu sahneyi çalıştırırsanız, sol ve sağ ok tuşları ile dönebiliyor, ve :kbd:`Yukarı` basarak ileri hareket edebiliyor olmanız gerekir.

source: Summary
tr: Özet

source: In GDScript, the variables you put at the top of the file are your class's properties, also called member variables. Besides variables, you can define functions, which, for the most part, will be your classes' methods.
tr: GDScript'te dosyanın en üstüne koyduğunuz değişkenler, üye değişkenler de denilen, sınıfınızın özellikleridir. Değişkenlerin yanında, fonksiyonlar da tanımlayabilirsiniz, ki pek çok durumda, bunlar da sınıfınızın yöntemleri olacaklardır.

source: Godot provides several virtual functions you can define to connect your class with the engine. These include ``_process()``, to apply changes to the node every frame, and ``_unhandled_input()``, to receive input events like key and button presses from the users. There are quite a few more.
tr: Godot, sınıfınızı motora bağlamak için tanımlayabileceğiniz bir çok sanal fonksiyon da sağlar. Bunların arasında, değişiklikleri düğüme her karede uygulamak için ``_process()``, ve kullanıcıların tuş ve düğmelere basması gibi girdi eylemlerini alan ``_unhandled_input()`` bulunur. Bunlardan daha oldukça fazlası var.

source: The ``Input`` singleton allows you to react to the players' input anywhere in your code. In particular, you'll get to use it in the ``_process()`` loop.
tr: ``Input`` tekil nesnesi, oyuncu girdilerine kodunuzun her yerinden tepki vermenizi sağlar. Özellikle, ``_process()`` döngüsü içerisinden çokça kullanmaya başlayacaksınız.

source: Translation status
tr: Çeviri durumu
