Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: de, ru, zh_tw

source: Creating your first script
de: Erstellen eines ersten Skripts
ru: Создание вашего первого скрипта
zh_tw: 建立腳本

source: In this lesson, you will code your first script to make the Godot icon turn in circles using GDScript. As we mentioned :ref:`in the introduction <toc-learn-introduction>`, we assume you have programming foundations. The equivalent C# code has been included in another tab for convenience.
de: In dieser Lektion programmieren Sie Ihr erstes Skript, um das Godot-Icon sich mithilfe von GDScript im Kreis drehen zu lassen. Wie wir :ref:`in der Einführung <toc-learn-introduction>` erwähnt haben, gehen wir davon aus, dass Sie Programmiergrundlagen haben. Der entsprechende C#-Code wurde der Einfachheit halber in einen anderen Tab eingefügt.
ru: В этом уроке вы напишете свой первый скрипт для вращения иконки Godot кругами, используя GDScript. Как мы упоминали :ref:`во Введении <toc-learn-introduction>`, этот урок рассчитан на тех, кто обладает базовыми знаниями в программировании. Для удобства, в другой вкладке приведен код C#.
zh_tw: 在本課中，你將用 GDScript 編寫第一個腳本，使 Godot 圖示轉圈。正如我們 :ref:`在介紹中 <toc-learn-introduction>` 提到的，我們假設你有程式設計基礎。方便起見，我們在單獨的分頁中包含了等價的 C# 程式碼。

source: To learn more about GDScript, its keywords, and its syntax, head to the :ref:`GDScript reference<doc_gdscript>`.
de: Um mehr über GDScript, seine Schlüsselwörter und seine Syntax zu erfahren, besuchen Sie die :ref:`GDScript-Referenz<doc_gdscript>`.
ru: Подробнее о GDScript, его ключевых словах и синтаксисе, читайте в :ref:`Основы GDScript<doc_gdscript>`.
zh_tw: 要瞭解更多關於GDScript、其關鍵字和語法的資訊，請前往 :ref:`GDScript 參考<doc_gdscript>` 。

source: To learn more about C#, head to the :ref:`C# basics <doc_c_sharp>` page.
de: Weitere Informationen zu C# finden Sie auf der Seite :ref:`C#-Grundlagen <doc_c_sharp>`.
ru: За дополнительно информацией по C#, обратитесь к странице: :ref:`Основы C# <doc_c_sharp>`.
zh_tw: 更多資訊請參考 :ref:`doc_c_sharp_differences` 一頁。

source: Project setup
de: Projektkonfiguration
ru: Настройка проекта
zh_tw: 設定專案

source: Please :ref:`create a new project <doc_creating_and_importing_projects>` to start with a clean slate. Your project should contain one picture: the Godot icon, which we often use for prototyping in the community.
de: Bitte :ref:`legen Sie ein neues Projekt an <doc_creating_and_importing_projects>`, um mit einem neuen Projekt zu beginnen. Ihr Projekt sollte bereits ein Bild enthalten: das Godot-Icon, das wir in der Community häufig für Prototypen verwenden.
ru: Пожалуйста, :ref:`создайте новый проект <doc_creating_and_importing_projects>`, чтобы начать с чистого листа. Ваш проект должен содержать одно изображение: иконку Godot, которую мы в сообществе часто используем для прототипирования.
zh_tw: 請從頭開始 :ref:`建立一個新專案<doc_creating_and_importing_projects>` 。您的專案應該包含一張圖片：Godot 圖示，我們經常在社區中使用它來製作原型。

source: We need to create a Sprite2D node to display it in the game. In the Scene dock, click the Other Node button.
de: Wir müssen einen Sprite2D-Node erstellen, um ihn im Spiel anzuzeigen. Klicken Sie im Szene-Dock auf den Anderer Node-Button.
ru: Нам нужно создать узел Sprite2D для отображения в игре. В панели Сцена (Scene), кликните на кнопку Другой Узел (Other Node).
zh_tw: 我們需要建立一個 Sprite2D 節點來在遊戲中顯示它。在“場景”停靠面板中，點擊“其他節點”按鈕。

source: Type "Sprite2D" in the search bar to filter nodes and double-click on Sprite2D to create the node.
de: Geben Sie "Sprite2D" in die Suchleiste ein, um Nodes zu filtern, und doppelklicken Sie auf Sprite2D, um den Node zu erstellen.
ru: Наберите "Sprite2D" в поисковой строке, чтобы отобразились нужные узлы, затем дважды кликните на Sprite2D, чтобы создать узел.
zh_tw: 在搜索欄中輸入“Sprite2D”來篩選節點，按兩下 Sprite2D 來建立節點。

source: Your Scene tab should now only have a Sprite2D node.
de: Das Szene-Tab sollte jetzt nur einen Sprite2D-Node enthalten.
ru: Вкладка Сцена (Scene) теперь должна содержать только узел Sprite2D.
zh_tw: 你的“場景”分頁現在應該只有一個 Sprite2D 節點。

source: A Sprite2D node needs a texture to display. In the Inspector on the right, you can see that the Texture property says "[empty]". To display the Godot icon, click and drag the file ``icon.svg`` from the FileSystem dock onto the Texture slot.
de: Ein Sprite2D-Node benötigt eine Textur zur Darstellung. Im Inspektor auf der rechten Seite können Sie sehen, dass die Eigenschaft Textur "[leer]" lautet. Um das Godot-Icon anzuzeigen, klicken Sie auf die Datei ``icon.svg`` und ziehen Sie sie per Drag&Drop aus dem Dateisystem-Dock auf den Textur-Slot.
ru: Узлу Sprite2D нужна текстура для отображения. В Инспекторе справа вы можете увидеть, что в свойстве текстуры указано "[пусто]". Чтобы отобразить иноку Godot, кликните и перетащите файл ``icon.png``из файловой системы панели на слот текстуры.
zh_tw: Sprite2D 節點需要用於顯示的紋理。在右邊的“屬性面板”中，你可以看到 Texture（紋理）屬性寫著“[空]”。要顯示 Godot 圖示，請點擊瓶拖拽“檔案系統”面板中的 ``icon.svg`` 檔案到 Texture 插槽上。

source: You can create Sprite2D nodes automatically by dragging and dropping images on the viewport.
de: Sie können Sprite2D-Nodes automatisch erzeugen, indem Sie Bilder per Drag&Drop auf den Viewport ziehen.
ru: Также вы можете создавать узлы Sprite2D автоматически, перетаскивая изображения в Окно просмотра.
zh_tw: 您可以通過將圖像拖放到視口上來自動建立 Sprite2D 節點。

source: Then, click and drag the icon in the viewport to center it in the game view.
de: Klicken und ziehen Sie dann das Icon in den Viewport, um es in der Spielansicht zu zentrieren.
ru: Затем нажмите и перетащите значок в окне просмотра, чтобы отцентрировать его в игровом представлении.
zh_tw: 然後，點擊並拖動視口中的圖示，使其在遊戲視圖中居中。

source: Creating a new script
de: Ein neues Skript erstellen
ru: Создание нового скрипта
zh_tw: 建立腳本

source: To create and attach a new script to our node, right-click on Sprite2D in the scene dock and select "Attach Script".
de: Um ein neues Skript zu erstellen und an unseren Node anzuhängen, klicken Sie mit der rechten Maustaste auf Sprite2D im Szenendock und wählen Sie "Skript hinzufügen".
ru: Чтобы создать и прикрепить новый скрипт к нашему узлу, нажмите правой кнопкой мыши на Sprite2D в панели сцены и выберите "Прикрепить Скрипт" (Attach Script).
zh_tw: 在場景面板的 Sprite2D 上點擊右鍵並選擇“新增腳本”，來建立或附加一個新的腳本到我們的節點上。

source: The Attach Node Script window appears. It allows you to select the script's language and file path, among other options.
de: Das Node-Skript hinzufügen-Fenster erscheint. Hier können Sie unter anderem die Sprache des Skripts und den Dateipfad auswählen.
ru: Откроется окно "Прикрепить скрипт" (Attach Node Script). В этом окне вы можете указать язык программирования скрипта, путь в корневой папке и другие параметры.
zh_tw: 接著會彈出腳本建立視窗。在這個視窗裡可以設定腳本所使用的語言、類別名稱以及其他相關設定。

source: Change the Template field from "Node: Default" to "Object: Empty" to start with a clean file. Leave the other options set to their default values and click the Create button to create the script.
de: Ändern Sie das Feld „Vorlage“ von "Node: Default" nach "Objekt: Leer", um mit einer sauberen Datei zu beginnen. Belassen Sie die anderen Optionen in der Standardeinstellung und klicken Sie auf den Erstellen-Button, um das Skript zu erstellen.
ru: Измените Template (Шаблон) с Default на Empty, чтобы начать с чистого файла. Оставьте остальные параметры по умолчанию и нажмите кнопку Create (Создать), чтобы создать скрипт.

source: The Script workspace should appear with your new ``sprite_2d.gd`` file open and the following line of code:
de: Der Skript-Arbeitsbereich sollte mit der neuen Datei ``sprite_2d.gd`` und der folgenden Code-Zeile geöffnet sein:
ru: В рабочей области Script должен появиться новый файл ``sprite_2d.gd`` и следующая строка кода:
zh_tw: 此時 Script 工作區將自動打開並顯示你新建的 ``sprite_2d.gd`` 檔，顯示以下程式碼行：

source: Every GDScript file is implicitly a class. The ``extends`` keyword defines the class this script inherits or extends. In this case, it's ``Sprite2D``, meaning our script will get access to all the properties and functions of the Sprite2D node, including classes it extends, like ``Node2D``, ``CanvasItem``, and ``Node``.
de: Jede GDScript-Datei ist implizit eine Klasse. Das Schlüsselwort ``extends`` definiert die Klasse, die das Skript erbt oder erweitert. In diesem Fall ist es ``Sprite2D``, was bedeutet, dass unser Skript Zugriff auf alle Eigenschaften und Funktionen des Sprite2D-Nodes erhält, einschließlich der Klassen, die es erweitert, wie ``Node2D``, ``CanvasItem`` und ``Node``.
ru: Каждый файл GDScript неявно является классом. Ключевое слово ``extends`` определяет класс, который наследует или расширяет данный скрипт. В этом случае ``Sprite2D`` означает, что наш скрипт получит доступ к свойствам и функциям узла ``Sprite2D``, включая классы, которые он расширяет, такие как ``Node2D``, ``CanvasItem`` и ``Node``.
zh_tw: 每個 GDScript 檔都是一個隱含的類。 ``extends`` 關鍵字定義了這個腳本所繼承或擴充的類。本例中它是 ``Sprite2D`` ，意味著我們的腳本將獲得 Sprite2D 節點的所有屬性和函式，包括它繼承的 ``Node2D`` 、 ``CanvasItem`` 、 ``Node`` 等類。

source: In GDScript, if you omit the line with the ``extends`` keyword, your class will implicitly extend :ref:`RefCounted <class_RefCounted>`, which Godot uses to manage your application's memory.
de: Wenn Sie in GDScript die Zeile mit dem Schlüsselwort ``extends`` weglassen, erweitert Ihre Klasse implizit :ref:`RefCounted <class_RefCounted>`, das Godot zur Verwaltung des Speichers Ihrer Anwendung verwendet.
ru: В GDScript, если вы опустите строку с ключевым словом ``extends``, ваш класс будет неявно расширять :ref:`RefCounted <class_RefCounted>`, который Godot использует для управления памятью вашего приложения.
zh_tw: 在GDScript中，如果你沒有寫帶有 ``extends`` 關鍵字的一行，你的類將隱式地擴充自 :ref:`RefCounted <class_RefCounted>`，Godot使用這個類來管理你的應用程式的記憶體。

source: Inherited properties include the ones you can see in the Inspector dock, like our node's ``texture``.
de: Zu den vererbten Eigenschaften gehören diejenigen, die Sie im Inspektor-Dock sehen können, wie z.B. ``Textur`` in unserem Node.
ru: К унаследованным свойствам относятся те, которые вы можете видеть в инспекторе, например, ``texture`` узла.
zh_tw: 繼承的屬性包括您可以在“屬性面板”面板中看到的屬性，例如節點的 ``texture`` 。

source: By default, the Inspector displays a node's properties in "Title Case", with capitalized words separated by a space. In GDScript code, these properties are in "snake_case", which is lowercase with words separated by an underscore.
de: Der Inspektor zeigt die Eigenschaften eines Nodes standardmäßig auf deutsch übersetzt an. Im GDScript-Code werden diese Eigenschaften auf englisch verwendet, und zwar in "snake_case", also kleingeschrieben mit Underscores. Klicken Sie im Inspektor auf das Icon mit dem Schraubenschlüssel, um die Angaben zwischen deutsch, englisch und dem internen Namen umzuschalten.
ru: По умолчанию, Инспектор отображает свойства узла в "Title Case", с заглавными буквами вначале, разделенные пробелом. В GDScript эти свойства записываются в "snake_case", строчными буквами, разделенными подчёркиванием.
zh_tw: “屬性面板”預設使用“Title Case”形式展示節點的屬性，將單詞的首字母大寫、用空格分隔。在 GDScript 程式碼中，這些屬性使用的是“snake_case”，全小寫、單詞之間使用底線分隔。

source: You can hover over any property's name in the Inspector to see a description and its identifier in code.
de: Sie können mit dem Mauszeiger über den Namen einer beliebigen Eigenschaft im Inspektor fahren, um eine Beschreibung und ihren Bezeichner im Code anzuzeigen.
zh_tw: 你可以在屬性面板中懸停任何屬性的名稱來查看它的描述和在程式碼中的識別字。

source: Our script currently doesn't do anything. Let's make it print the text "Hello, world!" to the Output bottom panel to get started.
de: Unser Skript tut derzeit nichts. Lassen wir es den Text "Hallo, Welt!" in den Ausgabe-Bereich des Unteren Bedienfelds drucken, um loszulegen.
ru: Наш скрипт ничего не делает. Давайте заставим его вывести "Hello, world!" в панель вывода в нижней части экрана.
zh_tw: 我們的腳本目前沒有做任何事情。讓我們開始列印文字“Hello, world!”到底部輸出面板。

source: Add the following code to your script:
de: Fügen Sie den folgenden Code in Ihr Skript ein:
ru: Добавьте следующий код в ваш скрипт:
zh_tw: 往腳本中新增以下程式碼：

source: Let's break it down. The ``func`` keyword defines a new function named ``_init``. This is a special name for our class's constructor. The engine calls ``_init()`` on every object or node upon creating it in memory, if you define this function.
de: Schauen wir uns das mal an. Das Schlüsselwort ``func`` definiert eine neue Funktion namens ``_init``. Dies ist ein spezieller Name für den Konstruktor unserer Klasse. Die Engine ruft ``_init()`` für jedes Objekt oder jeden Node auf, sobald es im Speicher erstellt wird, falls Sie diese Funktion definieren.
ru: Давайте разберём это. Слово ``func`` объявляет новую функцию ``_init``. Это конструктор нашего класса. Движок вызывает ``_init`` при создании объекта в памяти, если вы определили эту функцию.
zh_tw: 讓我們把它分解一下。 ``func`` 關鍵字定義了一個名為 ``_init`` 的新函式。這是類建構子的一個特殊名稱。如果你定義了這個函式，引擎會在記憶體中建立每個物件或節點時呼叫 ``_init()`` 。

source: GDScript is an indent-based language. The tab at the start of the line that says ``print()`` is necessary for the code to work. If you omit it or don't indent a line correctly, the editor will highlight it in red and display the following error message: "Indented block expected".
de: GDScript ist eine einrückungsbasierte Sprache. Der Tabstopp am Anfang der Zeile mit der Aufschrift ``print()`` ist notwendig, damit der Code funktioniert. Wenn Sie es weglassen oder eine Zeile nicht richtig einrücken, hebt der Editor dies rot hervor und zeigt die folgende Fehlermeldung an: "Expected indented block" (deutsch: „eingerückter Block erwartet“).
ru: GDScript - язык с отступами. Отступ (табуляция) в начале строки ``print()`` обязателен для работы кода. Если вы пропустите отступ или отступите неправильно, редактор выделит строку красным и выведет сообщение:"Indented block expected" ("Блок отступа пропущен").
zh_tw: GDScript 是基於縮進的語言。行首的定位字元是 ``print()`` 程式碼正常工作的必要條件。如果你省略了它或者沒有正確縮進一行，編輯器將以紅色高亮顯示，並顯示以下錯誤資訊：“Indented block expected”（應有縮進塊）。

source: Save the scene as ``sprite_2d.tscn`` if you haven't already, then press :kbd:`F6` (:kbd:`Cmd + R` on macOS) to run it. Look at the **Output** bottom panel that expands. It should display "Hello, world!".
de: Speichern Sie die Szene unter dem Namen ``sprite_2d.tscn``, falls Sie das noch nicht getan haben, und drücken Sie dann :kbd:`F6` (:kbd:`Cmd + R` unter macOS), um sie zu starten. Schauen Sie sich den Bereich **Ausgabe** im Unteren Bedienfeld an, das sich aufklappt. Es sollte "Hello, world!" anzeigen.
ru: Сохраните сцену как ``sprite_2d.tscn``, если ещё не сделали этого, затем нажмите :kbd:`F6` (:kbd:`Cmd + R` на macOS) для запуска. Посмотрите в окно вывода **Вывод** (Output) в панели внизу. Там должно отобразится "Hello, world!".
zh_tw: 如果你還沒有保存場景為 ``sprite_2d.tscn`` ，請保存，然後按 :kbd:`F6` （macOS 上為 :kbd:`Cmd + R` ）來運作它。看一下底部展開的 **輸出** 面板。它應該顯示“Hello, world!”。

source: Delete the ``_init()`` function, so you're only left with the line ``extends Sprite2D``.
de: Löschen Sie die Funktion ``_init()``, so dass nur noch die Zeile ``extends Sprite2D`` übrig bleibt.
ru: Удалите функцию ``_init()``, оставив только строку ``extends Sprite2D``.
zh_tw: 將 ``_init()`` 函式刪除，這樣你就只有一行 ``extends Sprite2D`` 了。

source: Turning around
de: Im Kreis drehen
ru: Поворот вокруг
zh_tw: 四處旋轉

source: It's time to make our node move and rotate. To do so, we're going to add two member variables to our script: the movement speed in pixels per second and the angular speed in radians per second. Add the following after the ``extends Sprite2D`` line.
de: Jetzt ist es an der Zeit, unseren Node zu bewegen und zu rotieren. Dazu fügen wir zwei Variablen in unser Skript ein: die Bewegungsgeschwindigkeit in Pixeln pro Sekunde und die Winkelgeschwindigkeit in Radiant pro Sekunde. Fügen Sie das Folgende nach der Zeile ``extends Sprite2D`` ein.
ru: Теперь сделаем наш узел двигающимся и вращающимся. Для этого добавим две переменных-члена в наш скрипт: скорость перемещения в пикселях в секунду и угловую скорость в радианах в секунду. Добавим следующий код после строки ``extends Sprite2D``.
zh_tw: 是時候讓我們的節點移動和旋轉了。為此，我們將向腳本中新增兩個成員變數：以像素每秒為單位的移動速度，和以弧度每秒為單位的角速度。將下述內容新增到 ``extends Sprite2D`` 行的後面。

source: Member variables sit near the top of the script, after any "extends" lines, but before functions. Every node instance with this script attached to it will have its own copy of the ``speed`` and ``angular_speed`` properties.
de: Member-Variablen befinden sich am Anfang des Skripts, nach allen "extends"-Zeilen, aber vor Funktionen. Jede Node-Instanz, an die dieses Skript angehängt ist, hat eine eigene Kopie der Eigenschaften ``speed`` und ``angular_speed``.
ru: Переменные-члены располагаются в начале скрипта, после всех строк "extends", но перед функциями. Каждый экземпляр узла с прикреплённым к нему скриптом имеет собственную копию свойств ``speed`` и ``angular_speed``.
zh_tw: 成員變數位於腳本的頂部，在“extends”之後、函式之前。附加了此腳本的每個節點實例都將具有自己的 ``speed`` 和 ``angular_speed`` 屬性副本。

source: Angles in Godot work in radians by default, but you have built-in functions and properties available if you prefer to calculate angles in degrees instead.
de: Winkel in Godot funktionieren standardmäßig im Bogenmaß, aber Sie haben Built-in-Funktionen und -Eigenschaften zur Verfügung, wenn Sie es vorziehen, Winkel stattdessen in Grad zu berechnen.
ru: Углы в Godot по умолчанию задаются в радианах, как и в некоторых других движках, но вы можете использовать встроенные функции и свойства для работы с градусами.
zh_tw: 與其他一些引擎一樣，Godot 中的角度預設使用弧度為單位，但如果您更喜歡以度為單位計算角度，則可以使用內建函式和屬性。

source: To move our icon, we need to update its position and rotation every frame in the game loop. We can use the ``_process()`` virtual function of the ``Node`` class. If you define it in any class that extends the Node class, like Sprite2D, Godot will call the function every frame and pass it an argument named ``delta``, the time elapsed since the last frame.
de: Um unser Icon zu bewegen, müssen wir seine Position und Drehung in jedem Frame der Spielschleife aktualisieren. Wir können die virtuelle Funktion ``_process()`` der Klasse ``Node`` verwenden. Wenn Sie diese Funktion in einer Klasse definieren, die von der Node-Klasse erbt, wie z.B. Sprite2D, wird Godot die Funktion bei jedem Frame aufrufen und ihr ein Argument namens ``delta`` übergeben; die Zeit, die seit dem letzten Frame verstrichen ist.
ru: Для перемещения иконки мы должны обновлять её позицию и вращение каждый кадр игрового цикла. Для этого используем виртуальную функцию ``_process()`` класса ``Node``. При объявлении этой функции в любом классе, наследуемом от ``Node`` (например, ``Sprite``), Godot будет вызывать её каждый кадр и передавать в аргументе ``delta`` время, прошедшее от предыдущего кадра.
zh_tw: 為了移動我們的圖示，我們需要在遊戲迴圈中每一影格更新其位置和旋轉。我們可以使用 ``Node`` 類中的虛函式 ``_process()`` 。如果你在任何擴充自 Node 類的類中定義它，如 Sprite2D，Godot將在每一影格呼叫該函式，並傳遞給它一個名為 ``delta`` 的參數，即從上一影格開始經過的時間。

source: Games work by rendering many images per second, each called a frame, and they do so in a loop. We measure the rate at which a game produces images in Frames Per Second (FPS). Most games aim for 60 FPS, although you might find figures like 30 FPS on slower mobile devices or 90 to 240 for virtual reality games.
de: Bei Spielen werden viele Bilder pro Sekunde gerendert, die als Frames bezeichnet werden, und zwar in einer Schleife. Wir messen die Rate, mit der ein Spiel Bilder produziert, in Frames pro Sekunde (FPS). Die meisten Spiele streben 60 FPS an, obwohl man bei langsameren Mobilgeräten auch Werte wie 30 FPS oder bei Virtual-Reality-Spielen 90 bis 240 FPS finden kann.
ru: Игры работают в цикле, отображая множество изображений в секунду, каждое из которых называется кадром. Скорость, с которой игра создаёт эти изображения, измеряется в кадрах в секунду (Frame Per Second). Большинство игр нацелены на 60 FPS, хотя вы можете найти такие цифры, как 30 кадров в секунду на более медленных мобильных устройствах или от 90 до 240 для игр виртуальной реальности.
zh_tw: 遊戲的工作方式是每秒鐘算繪許多圖像，每幅圖像稱為一影格，而且是迴圈進行的。我們用每秒影格數（FPS）來衡量一個遊戲產生圖像的速度。大多數遊戲的目標是60FPS，儘管你可能會發現在較慢的移動裝置上的數位是30FPS，或者是虛擬實境遊戲的90至240。

source: The engine and game developers do their best to update the game world and render images at a constant time interval, but there are always small variations in frame render times. That's why the engine provides us with this delta time value, making our motion independent of our framerate.
de: Die Engine- und Spieleentwickler tun ihr Bestes, um in einem konstanten Zeitintervall die Spielwelt zu aktualisieren und die Bilder zu rendern, aber es gibt immer kleine Abweichungen bei den Renderzeiten der Frames. Deshalb liefert uns die Engine diesen Delta-Zeitwert, der unsere Bewegung unabhängig von unserer Framerate macht.
ru: Движок и разработчики игры делают все возможное, чтобы обновлять игровой мир и рендерить изображения с постоянным интервалом времени, но всегда существуют небольшие отклонения во времени рендеринга кадров. Поэтому движок предоставляет нам это значение дельта-времени, делая наше движение независимым от частоты кадров.
zh_tw: 引擎和遊戲開發者盡最大努力以恒定的時間間隔更新遊戲世界和算繪圖像，但在影格的算繪時間上總是存在著微小的變化。這就是為什麼引擎為我們提供了這個delta時間值，使我們的運動與我們的畫面播放速率無關。

source: At the bottom of the script, define the function:
de: Definieren Sie am Ende des Skripts die Funktion:
ru: В нижней части скрипта определите функцию:
zh_tw: 在腳本的底部，定義該函式：

source: The ``func`` keyword defines a new function. After it, we have to write the function's name and arguments it takes in parentheses. A colon ends the definition, and the indented blocks that follow are the function's content or instructions.
de: Das Schlüsselwort ``func`` definiert eine neue Funktion. Danach müssen wir den Namen der Funktion und die Argumente, die sie benötigt, in Klammern setzen. Ein Doppelpunkt beendet die Definition, und die folgenden eingerückten Blöcke sind der Inhalt oder die Anweisungen der Funktion.
ru: Ключевое слово ``func`` определяет (создаёт) новую функцию. После него в нужно написать имя функции и в скобках аргументы, которые она принимает. Двоеточие завершает определение, а следующие за ним блоки с отступом представляют собой содержимое или инструкции функции.
zh_tw: ``func`` 關鍵字定義了一個新函式。在它之後，我們必須在括弧裡寫上函式的名稱和它所接受的參數。冒號結束定義，後面的縮進塊是函式的內容或指令。

source: Notice how ``_process()``, like ``_init()``, starts with a leading underscore. By convention, Godot's virtual functions, that is to say, built-in functions you can override to communicate with the engine, start with an underscore.
de: Beachten Sie, dass ``_process()``, wie ``_init()``, mit einem führenden Unterstrich beginnt. Godots virtuelle Funktionen, d.h. Built-in-Funktionen, die Sie überschreiben können, um mit der Engine zu kommunizieren, beginnen mit einem Unterstrich.
ru: Обратите внимание, что ``_process()``, как и ``_init()``, начинается с символа подчёркивания. По соглашению, виртуальные функции, то есть встроенные функции Godot, которые вы можете переопределить - начинаются с символа подчёркивания.
zh_tw: 請注意 ``_process()`` 和 ``_init()`` 一樣都是以底線開頭的。按照約定，這是 Godot 的虛函式，也就是你可以覆蓋的與引擎通信的內建函式。
