Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/running_code_*_the_editor.po
Languages: de, zh_tw

source: Running code in the editor
de: Code im Editor ausführen
zh_tw: 在編輯器中運作程式碼

source: What is ``@tool``?
de: Was ist ``@tool``?
zh_tw: 不能做什麼？

source: ``@tool`` is a powerful line of code that, when added at the top of your script, makes it execute in the editor. You can also decide which parts of the script execute in the editor, which in game, and which in both.
de: ``@tool`` ist eine leistungsstarke Codezeile, die im Editor ausgeführt wird, wenn man sie oben im Skript hinzufügt. Sie können auch entscheiden, welche Teile des Skripts im Editor ausgeführt werden, welche im Spiel und welche in beiden.
zh_tw: ``@tool`` 是一行強大的程式碼，新增到腳本的頂部後，腳本就會在編輯器中執行。你還可以決定腳本的哪些部分在編輯器中執行、哪些部分在遊戲中執行、哪部分在兩者中均執行。

source: You can use it for doing many things, but it is mostly useful in level design for visually presenting things that are hard to predict ourselves. Here are some use cases:
de: Sie können es für viele Dinge verwenden, aber es ist vor allem im Level-Design nützlich, um Dinge visuell darzustellen, die selbst schwer vorherzusagen sind. Hier sind einige Anwendungsfälle:
zh_tw: 您可以使用它來做很多事情, 它在層次設計中非常有用, 可以直觀地呈現難以預測的事物. 以下是一些用例:

source: If you have a cannon that shoots cannonballs affected by physics (gravity), you can draw the cannonball's trajectory in the editor, making level design a lot easier.
de: Wenn Sie eine Kanone haben, die Kanonenkugeln abschießt, die von der Physik (Schwerkraft) beeinflusst werden, können Sie die Flugbahn der Kanonenkugel im Editor zeichnen, was das Leveldesign sehr erleichtert.
zh_tw: 如果你有一門發射受物理學(重力)影響的炮彈的大炮, 你可以在編輯器中畫出炮彈的軌跡, 使關卡設計容易得多.

source: If you have jumppads with varying jump heights, you can draw the maximum jump height a player would reach if it jumped on one, also making level design easier.
de: Wenn Sie Sprungfelder mit unterschiedlichen Sprunghöhen haben, können Sie die maximale Sprunghöhe einzeichnen, die ein Spieler erreichen würde, wenn er auf ein Sprungfeld springt, was die Levelgestaltung ebenfalls erleichtert.
zh_tw: 如果您有不同跳躍高度的跳線, 您可以繪製遊戲角色能跳過的最大跳躍高度, 也可以讓關卡設計變得更容易.

source: If your player doesn't use a sprite, but draws itself using code, you can make that drawing code execute in the editor to see your player.
de: Wenn Ihr Spieler kein Sprite verwendet, sondern durch Code gezeichnet wird, können Sie diesen Zeichencode im Editor ausführen lassen, um Ihren Spieler anzuzeigen.
zh_tw: 如果您的遊戲角色不使用精靈, 卻使用程式碼來繪製, 您可以在編輯器中執行該繪圖程式碼以查看您的遊戲角色.

source: ``@tool`` scripts run inside the editor, and let you access the scene tree of the currently edited scene. This is a powerful feature which also comes with caveats, as the editor does not include protections for potential misuse of ``@tool`` scripts. Be **extremely** cautious when manipulating the scene tree, especially via :ref:`Node.queue_free<class_Node_method_queue_free>`, as it can cause crashes if you free a node while the editor runs logic involving it.
de: ``@tool``-Skripte laufen innerhalb des Editors und erlauben den Zugriff auf den Szenenbaum der aktuell bearbeiteten Szene. Dies ist eine mächtige Funktion, die aber auch ihre Tücken hat, da der Editor keinen Schutz gegen möglichen Missbrauch von ``@tool``-Skripten bietet. Seien Sie **äußerst** vorsichtig, wenn Sie den Szenenbaum manipulieren, besonders über :ref:`Node.queue_free<class_Node_method_queue_free>`, da es zu Abstürzen führen kann, wenn Sie einen Node freigeben, während der Editor eine Logik ausführt, die ihn betrifft.
zh_tw: ``tool`` 腳本在編輯器內運作, 讓你存取目前編輯的場景樹. 這是一個強大的功能, 但也有一些注意事項, 因為編輯器不包括對 ``@tool`` 腳本潛在濫用的保護. 在操作場景樹時, 尤其是通過 :ref:`Node.queue_free<class_Node_method_queue_free>` 時, 要 **極其** 謹慎, 因為如果你在編輯器運作涉及到節點的邏輯時釋放該節點, 可能會導致當機.

source: How to use ``@tool``
de: Wie man ``@tool`` verwendet

source: To turn a script into a tool, add the ``@tool`` annotation at the top of your code.
de: Um ein Skript in ein Tool zu verwandeln, fügen Sie das Schlüsselwort ``@tool`` am Anfang Ihres Codes ein.
zh_tw: 要把一個腳本變成一個工具, 在你的程式碼頂部新增關鍵字 ``@tool`` .

source: To check if you are currently in the editor, use: ``Engine.is_editor_hint()``.
de: Um zu prüfen, ob Sie sich gerade im Editor befinden, verwenden Sie: ``Engine.is_editor_hint()``.
zh_tw: 要檢查您目前是否在編輯器中, 請使用 : ``Engine.editor_hint``.

source: For example, if you want to execute some code only in the editor, use:
de: Wenn Sie beispielsweise Code nur im Editor ausführen möchten, verwenden Sie:
zh_tw: 例如，可以依據平台來更改程式碼：

source: On the other hand, if you want to execute code only in game, simply negate the same statement:
de: Wenn Sie dagegen Code nur im Spiel ausführen möchten, negieren Sie einfach dieselbe Anweisung:
zh_tw: 另一方面, 如果你想只在遊戲中執行程式碼, 只需否定相同的敘述:

source: Pieces of code that do not have either of the 2 conditions above will run both in-editor and in-game.
de: Codeteile, auf die keine der beiden oben genannten Bedingungen zutreffen, werden sowohl im Editor als auch im Spiel ausgeführt.

source: Here is how a ``_process()`` function might look for you:
de: Hier sieht man wie eine ``_process()`` Funktion aussehen könnte:
zh_tw: 以下是 ``_process()`` 函式的範例:

source: Modifications in the editor are permanent. For example, in the following case, when we remove the script, the node will keep its rotation. Be careful to avoid making unwanted modifications.
de: Änderungen im Editor sind dauerhaft. Wenn wir zum Beispiel im folgenden Fall das Skript entfernen, behält der Node seine Drehung bei. Seien Sie vorsichtig, um unerwünschte Änderungen zu vermeiden.
zh_tw: 編輯器中的修改是永久性的. 例如, 在下面的情況下, 當我們刪除腳本時, 節點將保持其旋轉. 要注意避免做不需要的修改.

source: Extending a ``@tool`` script does not automatically make the extending script a ``@tool``. Omitting ``@tool`` from the extending script will disable tool behavior from the super class. Therefore the extending script should also specify the ``@tool`` annotation.
de: Das Erweitern eines ``@tool``-Skripts macht das erweiternde Skript nicht automatisch zu einem ``@tool``. Das Weglassen von ``@tool`` im erweiternden Skript deaktiviert das Tool-Verhalten der Superklasse. Daher sollte das erweiternde Skript auch das ``@tool``-Schlüsselwort enthalten.

source: Try ``@tool`` out
de: Probieren Sie ``@tool`` aus

source: Add a ``Sprite2D`` node to your scene and set the texture to Godot icon. Attach and open a script, and change it to this:
de: Fügen Sie einen ``Sprite2D``-Node zu Ihrer Szene hinzu und setzen Sie die Textur auf das Godot Icon. Fügen Sie ein Skript hinzu, öffnen Sie es und ändern Sie es wie folgt:
zh_tw: 在場景中新增一個 ``Sprite`` 節點, 並將紋理設定為Godot圖示. 新增並打開腳本, 並將其更改為:

source: Save the script and return to the editor. You should now see your object rotate. If you run the game, it will also rotate.
de: Speichern Sie das Skript und kehren Sie zum Editor zurück. Sie sollten jetzt sehen, wie Ihr Objekt rotiert. Wenn Sie das Spiel ausführen, rotiert es ebenfalls.
zh_tw: 保存腳本並返回編輯器. 現在您應該看到您的物件在旋轉. 如果您運作遊戲, 它也會旋轉.

source: If you don't see the changes, reload the scene (close it and open it again).
de: Wenn Sie die Änderungen nicht sehen, laden Sie die Szene neu (schließen Sie sie und öffnen sie erneut).
zh_tw: 如果您沒有看到變化, 請重新載入場景(關閉它並再次打開).

source: Now let's choose which code runs when. Modify your ``_process()`` function to look like this:
de: Wählen wir nun aus, welcher Code wann ausgeführt wird. Ändern Sie Ihre ``_process()``-Funktion so ab:
zh_tw: 現在讓我們選擇何時運作程式碼. 將 ``_process()`` 函式修改為:

source: Save the script. Now the object will spin clockwise in the editor, but if you run the game, it will spin counter-clockwise.
de: Speichern Sie das Skript. Jetzt dreht sich das Objekt im Editor im Uhrzeigersinn, aber wenn Sie das Spiel ausführen, dreht es sich gegen den Uhrzeigersinn.
zh_tw: 保存腳本. 現在, 物件將在編輯器中順時針旋轉, 但如果您運作遊戲, 它將逆時針旋轉.

source: Editing variables
de: Variablen bearbeiten
zh_tw: 本地坐標

source: Add and export a variable speed to the script. To update the speed and also reset the rotation angle add a setter ``set(new_speed)`` which is executed with the input from the inspector. Modify ``_process()`` to include the rotation speed.
de: Fügen Sie dem Skript eine variable Geschwindigkeit hinzu und exportieren Sie sie. Um die Geschwindigkeit zu aktualisieren und auch den Drehwinkel zurückzusetzen, fügen Sie einen Setter ``set(new_speed)`` hinzu, der mit der Eingabe vom Inspektor ausgeführt wird. Modifizieren Sie ``_process()``, um die Rotationsgeschwindigkeit einzubeziehen.
zh_tw: 在腳本中新增並匯出一個變數速度. 在 "setget" 之後的函式set_speed與你的輸入一起執行, 以改變這個變數. 修改 ``_process()`` 以包含旋轉速度.

source: Code from other nodes doesn't run in the editor. Your access to other nodes is limited. You can access the tree and nodes, and their default properties, but you can't access user variables. If you want to do so, other nodes have to run in the editor too. Autoload nodes cannot be accessed in the editor at all.
de: Code von anderen Nodes kann nicht im Editor ausgeführt werden. Ihr Zugriff auf andere Nodes ist eingeschränkt. Sie können auf den Baum und die Nodes sowie deren Default-Propertys zugreifen, aber nicht auf Benutzervariablen. Wenn Sie dies tun wollen, müssen andere Nodes ebenfalls im Editor laufen. Auf Autoloading-Nodes kann im Editor überhaupt nicht zugegriffen werden.
zh_tw: 其他節點的程式碼不會在編輯器中運作. 您對其他節點的存取權限被限制了. 您可以存取樹和節點及其預設屬性, 但無法存取使用者變數. 如果要這樣做, 其他節點也必須在編輯器中運作. AutoLoad節點時無法在編輯器中存取的.

source: Reporting node configuration warnings
de: Meldung von Warnungen bei der Node-Konfiguration
zh_tw: 程式碼樣式設定

source: Godot uses a *node configuration warning* system to warn users about incorrectly configured nodes. When a node isn't configured correctly, a yellow warning sign appears next to the node's name in the Scene dock. When you hover or click on the icon, a warning message pops up. You can use this feature in your scripts to help you and your team avoid mistakes when setting up scenes.
de: Godot verwendet ein *Node-Konfigurations-Warnsystem*, um Benutzer vor falsch konfigurierten Nodes zu warnen. Wenn ein Node nicht korrekt konfiguriert ist, erscheint ein gelbes Warnzeichen neben dem Namen des Nodes im Scene-Dock. Wenn Sie mit dem Mauszeiger über das Symbol fahren oder darauf klicken, wird eine Warnmeldung eingeblendet. Sie können diese Funktion in Ihren Skripten verwenden, um Ihnen und Ihrem Team zu helfen, Fehler beim Einrichten von Szenen zu vermeiden.
zh_tw: Godot 使用*節點設定警告*系統來警告使用者有關錯誤配置的節點。當節點配置不正確時，場景停靠欄中該節點名稱旁邊會出現一個黃色警告旗標。當您將滑鼠懸停或點擊該圖示時，會彈出警告訊息。您可以在腳本中使用此功能來幫助您和您的團隊在設定場景時避免錯誤。

source: When using node configuration warnings, when any value that should affect or remove the warning changes, you need to call :ref:`update_configuration_warnings<class_Node_method_update_configuration_warnings>` . By default, the warning only updates when closing and reopening the scene.
de: Wenn Sie Node-Konfigurations-Warnungen verwenden, müssen Sie :ref:`update_configuration_warnings<class_Node_method_update_configuration_warnings>` aufrufen, wenn sich ein Wert ändert, der die Warnung beeinflussen oder entfernen soll. Standardmäßig wird die Warnung nur beim Schließen und erneuten Öffnen der Szene aktualisiert.
zh_tw: 使用節點配置警告時，當影響或刪除警告的任何值發生變更時，您需要呼叫 update_configuration_warnings<class_Node_method_update_configuration_warnings>` 。預設情況下，警告僅在關閉並重新開啟場景時更新。

source: Running one-off scripts using EditorScript
de: Ausführen von Einmal-Skripten mit EditorScript

source: Sometimes, you need to run code just one time to automate a certain task that is not available in the editor out of the box. Some examples might be:
de: Manchmal müssen Sie einen Code nur einmal ausführen, um eine bestimmte Aufgabe zu automatisieren, die im Editor nicht sofort verfügbar ist. Einige Beispiele könnten sein:

source: Use as a playground for GDScript or C# scripting without having to run a project. ``print()`` output is displayed in the editor Output panel.
de: Verwenden Sie den Editor als Spielwiese für GDScript- oder C#-Skripte, ohne ein Projekt ausführen zu müssen. Die ``print()`` Ausgabe wird im Ausgabefenster des Editors angezeigt.

source: Scale all light nodes in the currently edited scene, as you noticed your level ends up looking too dark or too bright after placing lights where desired.
de: Skalieren Sie alle Lichtquellen-Nodes in der aktuell bearbeiteten Szene, da Sie bemerkt haben, dass Ihr Level am Ende zu dunkel oder zu hell aussieht, nachdem Sie die Lichter an den gewünschten Stellen platziert haben.

source: Replace nodes that were copy-pasted with scene instances to make them easier to modify later.
de: Ersetzen Sie Nodes, die durch Kopieren eingefügt wurden, durch Szeneninstanzen, damit sie später leichter geändert werden können.

source: This is available in Godot by extending :ref:`class_EditorScript` in a script. This provides a way to run individual scripts in the editor without having to create an editor plugin.
de: Dies ist in Godot durch die Erweiterung :ref:`class_EditorScript` in einem Skript möglich. Dies ermöglicht es, einzelne Skripte im Editor auszuführen, ohne ein Editor-Plugin erstellen zu müssen.

source: To create an EditorScript, right-click a folder or empty space in the FileSystem dock then choose **New > Script...**. In the script creation dialog, click the tree icon to choose an object to extend from (or enter ``EditorScript`` directly in the field on the left, though note this is case-sensitive):
de: Um ein EditorScript zu erstellen, klicken Sie mit der rechten Maustaste auf einen Ordner oder einen leeren Bereich im Dateisystem-Dock und wählen Sie **Neu > Skript...**. Klicken Sie im Dialogfenster für die Skripterstellung auf das Baumsymbol, um ein Objekt auszuwählen, das Sie erweitern möchten (oder geben Sie ``EditorScript`` direkt in das Feld auf der linken Seite ein, wobei die Groß- und Kleinschreibung beachtet werden muss):

source: Creating an editor script in the script editor creation dialog
de: Erstellen eines Editor-Skripts im Dialogfeld "Skript-Editor erstellen

source: This will automatically select a script template that is suited for EditorScripts, with a ``_run()`` method already inserted:
de: Dadurch wird automatisch eine Skriptvorlage ausgewählt, die für EditorScripts geeignet ist und bereits eine ``_run()`` Methode enthält:

source: This ``_run()`` method is executed when you use **File > Run** or the keyboard shortcut :kbd:`Ctrl + Shift + X` while the EditorScript is the currently open script in the script editor. This keyboard shortcut is only effective when currently focused on the script editor.
de: Diese ``_run()``-Methode wird ausgeführt, wenn Sie **Datei > Ausführen** oder das Tastaturkürzel :kbd:`Strg + Umschalt + X` verwenden, während das EditorScript das aktuell geöffnete Skript im Skript-Editor ist. Dieses Tastaturkürzel ist nur wirksam, wenn der Skript-Editor gerade fokussiert ist.

source: Scripts that extend EditorScript must be ``@tool`` scripts to function.
de: Skripte, die EditorScript erweitern, müssen ``@tool``-Skripte sein, um zu funktionieren.

source: EditorScripts have no undo/redo functionality, so **make sure to save your scene before running one** if the script is designed to modify any data.
de: EditorScripts haben keine Rückgängig-/Wiederherstellen-Funktion, also **sichern Sie Ihre Szene, bevor Sie ein Skript ausführen**, wenn das Skript Daten verändern soll.

source: To access nodes in the currently edited scene, use the :ref:`EditorScript.get_scene <class_EditorScript_method_get_scene>` method which returns the root Node of the currently edited scene. Here's an example that recursively gets all nodes in the currently edited scene and doubles the range of all OmniLight3D nodes:
de: Um auf Nodes in der aktuell bearbeiteten Szene zuzugreifen, verwenden Sie die Methode :ref:`EditorScript.get_scene <class_EditorScript_method_get_scene>`, die den Root-Node der aktuell bearbeiteten Szene zurückgibt. Hier ist ein Beispiel, das rekursiv alle Nodes in der aktuell bearbeiteten Szene abruft und den Bereich aller OmniLight3D Nodes verdoppelt:

source: You can change the currently edited scene at the top of the editor even while the Script view is open. This will affect the return value of :ref:`EditorScript.get_scene <class_EditorScript_method_get_scene>`, so make sure you've selected the scene you intend to iterate upon before running the script.
de: Sie können die aktuell bearbeitete Szene im oberen Bereich des Editors ändern, auch wenn die Skriptansicht geöffnet ist. Dies wirkt sich auf den Rückgabewert von :ref:`EditorScript.get_scene <class_EditorScript_method_get_scene>` aus. Stellen Sie also sicher, dass Sie die Szene ausgewählt haben, die Sie bearbeiten wollen, bevor Sie das Skript ausführen.

source: Instancing scenes
de: Instanziierung von Szenen
zh_tw: 實體化場景

source: You can instantiate packed scenes normally and add them to the scene currently opened in the editor. By default, nodes or scenes added with :ref:`Node.add_child(node) <class_Node_method_add_child>` are **not** visible in the Scene tree dock and are **not** persisted to disk. If you wish the node or scene to be visible in the scene tree dock and persisted to disk when saving the scene, you need to set the child node's :ref:`owner <class_Node_property_owner>` property to the currently edited scene root.
de: Sie können gepackte Szenen ganz normal instanziieren und sie zu der gerade im Editor geöffneten Szene hinzufügen. Standardmäßig sind Nodes oder Szenen, die mit :ref:`Node.add_child(node) <class_Node_method_add_child>` hinzugefügt werden, **nicht** im Szenenbaum-Dock sichtbar und werden **nicht** auf der Festplatte gespeichert. Wenn Sie möchten, dass der Node oder die Szene im Szenenbaum sichtbar ist und beim Speichern der Szene auf der Festplatte gespeichert wird, müssen Sie die Property :ref:`owner <class_Node_property_owner>` des Child-Nodes auf den aktuell bearbeiteten Szenen-Root setzen.
zh_tw: 在編輯器中，你可以正常產生實體打包場景，並將它們新增到目前打開的場景中。預設情況下，使用 :ref:`Node.add_child(node) <class_Node_method_add_child>` 新增的節點或場景在“場景”樹面板中是**不可見**的，也**不會**持久化到磁片上。如果你希望節點和場景在場景樹面板中可見，並在保存場景時持久化到磁片上，則需要將這些子節點的 :ref:`owner <class_Node_property_owner>` 屬性設為目前編輯場景的根節點。

source: If you are using ``@tool``:
de: Wenn Sie ``@tool`` verwenden:
zh_tw: 如果你使用的是 ``@tool`` :

source: If you are using :ref:`EditorScript<class_EditorScript>`:
de: Wenn Sie :ref:`EditorScript <class_EditorScript>` verwenden:
zh_tw: 如果你使用 :ref:`EditorScript<class_EditorScript>` :

source: Using ``@tool`` improperly can yield many errors. It is advised to first write the code how you want it, and only then add the ``@tool`` annotation to the top. Also, make sure to separate code that runs in-editor from code that runs in-game. This way, you can find bugs more easily.
de: Die falsche Verwendung von ``@tool`` kann zu vielen Fehlern führen. Es ist ratsam, zuerst den Code so zu schreiben, wie Sie ihn haben wollen, und erst dann das ``@tool``-Schlüsselwort am Anfang hinzuzufügen. Stellen Sie außerdem sicher, dass Sie Code, der im Editor läuft, von Code, der im Spiel läuft, trennen. Auf diese Weise können Sie Bugs leichter finden.
zh_tw: 不適當地使用 ``@tool`` 會產生許多錯誤. 建議首先按照你想要的方式寫程式碼, 然後才在上面新增 ``@tool`` 關鍵字. 另外, 要確保把在編輯器中運作的程式碼和在遊戲中運作的程式碼分開. 這樣, 你可以更容易地發現錯誤.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
