Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/audio_buses.po
Languages: de, pt_br, zh_tw

source: Audio buses
de: Audio-Busse
pt_br: Barramentos de áudio
zh_tw: 音訊匯流排

source: Introduction
de: Einführung
pt_br: Introdução
zh_tw: 前言

source: Godot's audio processing code has been written with games in mind, with the aim of achieving an optimal balance between performance and sound quality.
de: Godots Audioverarbeitung wurde für die Spieleentwicklung erstellt, damit eine optimale Balance zwischen Performance und Klangqualität erreicht werden kann.
pt_br: O código de processamento de áudio do Godot foi escrito com jogos em mente, com o intuito de alcançar um equilíbrio favorável entre desempenho e qualidade de som.
zh_tw: Godot的音訊處理程式碼是為了遊戲而寫的, 以達到性能和音質之間的最佳平衡.

source: Godot's audio engine allows any number of audio buses to be created and any number of effect processors can be added to each bus. Only the hardware of the device running your game will limit the number of buses and effects that can be used before performance starts to suffer.
de: Die Audio-Engine von Godot ermöglicht die Erstellung einer beliebigen Anzahl von Audiobussen und das Hinzufügen einer beliebigen Anzahl von Effektprozessoren zu jedem Bus. Nur die Hardware des Geräts, auf dem Ihr Spiel läuft, begrenzt die Anzahl der Busse und Effekte, die verwendet werden können, bevor die Performance zu leiden beginnt.
pt_br: O motor de áudio do Godot permite qualquer número de barramentos de áudio a serem criados e qualquer número de processadores de efeito podem ser adicionados a cada barramento. Apenas o hardware do dispositivo executando seu jogo irá limitar o número de barramentos e efeitos que podem ser usados antes que o desempenho comece a cair.
zh_tw: Godot的音訊引擎允許建立任意數量的音訊匯流排, 並且可以向每個匯流排新增任意數量的效果處理器. 運作遊戲的裝置的硬體會限制匯流排的數量, 以及在性能開始下降之前可以使用的效果.

source: Decibel scale
de: Dezibel-Skala
pt_br: Escala decibel
zh_tw: 分貝標度

source: Godot's sound interface is designed to meet the expectations of sound design professionals. To this end, it primarily uses the decibel scale.
de: Godots Sound Interface wurde entwickelt, um den Erwartungen eines professionellen Sound-Designs gerecht zu werden, weshalb hauptsächlich die Dezibel-Skala verwendet wird.
pt_br: A interface de som do Godot é designada para combinar com as expectativas dos profissionais de design de som. Para este fim, utiliza-se primariamente a escala decibel.
zh_tw: Godot的聲音介面是為了滿足聲音設計專業人士的期望而設計的. 因此主要採用分貝標度.

source: For those unfamiliar with it, it can be explained with a few facts:
de: Für alle die damit nicht vertraut sind, werden nachfolgend einige Fakten erklärt:
pt_br: Para aqueles não familiarizados, pode-se explicar com alguns fatos:
zh_tw: 對於那些不熟悉它的人, 可以用一些事實來解釋:

source: The decibel (dB) scale is a relative scale. It represents the ratio of sound power by using 20 times the base 10 logarithm of the ratio (20 × log\ :sub:`10`\ (P/P\ :sub:`0`\ )).
de: Die Dezibel-Skala (dB) ist eine relative Skala. Sie stellt das Verhältnis des Schalldrucks dar, indem sie das 20-fache des dekadischen Logarithmus des Verhältnisses verwendet (20 × log\ :sub:`10`\ (P/P\ :sub:`0`\)).
pt_br: A escala decibel (dB) é uma escala relativa. Ela representa a taxa de potência de som ao usar 20 vezes o logaritmo de base 10 da proporção (20 × log\ :sub:`10`\ (P/P\ :sub:`0`\ )).
zh_tw: 分貝（dB）標度是一個相對標度.它等於聲功率比的常用對數的20倍（20 × log\ ：sub：'10'\ （P/P/\ ：sub：'0'\ ））。

source: For every 6 dB, sound amplitude doubles or halves. 12 dB represents a factor of 4, 18 dB a factor of 8, 20 dB a factor of 10, 40 dB a factor of 100, etc.
de: Für jeweils 6 dB verdoppelt oder halbiert sich die Schallamplitude. 12 dB entsprechen einem Faktor 4, 18 dB einem Faktor 8, 20 dB einem Faktor 10, 40 dB einem Faktor 100 usw.
pt_br: Para cada 6 dB, a amplitude de som se duplica ou se divide pela metade. 12 dB representam um fator de 4, 18 dB um fator de 8, 20 dB um fator de 10, 40dB um fator de 100, etc.
zh_tw: 每增/減6分貝, 聲幅就會加倍/減半.12dB代表係數4,18dB代表係數8,20dB代表係數10,40dB代表係數100, 以此類推.

source: Since the scale is logarithmic, true zero (no audio) can't be represented.
de: Da die Skala logarithmisch ist, kann der wahre Nullpunkt (kein Geräusch) nicht dargestellt werden.
pt_br: Como a escala é logarítmica, um zero verdadeiro (sem áudio) não pode ser representado.
zh_tw: 由於比例是對數的, 因此無法表示真零(無音訊).

source: 0 dB is the maximum amplitude possible in a digital audio system. This limit is not the human limit, but a limit from the sound hardware. Audio with amplitudes that are too high to be represented properly below 0 dB create a kind of distortion called *clipping*.
de: 0 dB ist die maximal mögliche Amplitude in einem digitalen Audiosystem. Diese Grenze ist nicht die menschliche Hörschwelle, sondern eine Schwelle der Audio-Hardware. Audio mit Amplituden, die zu hoch sind, um unter 0 dB richtig dargestellt zu werden, erzeugen eine Art von Verzerrung, die als *Clipping* bezeichnet wird.
pt_br: 0 dB é a amplitude máxima possível em um sistema de áudio digital. Este não é o limite humano, mas um limite do hardware de som. Áudio com amplitudes que são muito altas para serem representados corretamente criam uma distorção chamada *clipping*.
zh_tw: 0 dB 是數位音訊系統中可能的最大振幅. 這個限制不是人為的限制, 而是聲音硬體的限制. 因振幅太高而無法完全反映在0dB以下的音訊, 會產生一種被稱為 *削波* 的失真.

source: To avoid clipping, your sound mix should be arranged so that the output of the *master bus* (more on that later) never exceeds 0 dB.
de: Um Clipping zu vermeiden, sollte Ihr Audio-Mix so gestaltet sein, dass der Ausgang des *Master-Busses* (dazu später mehr) niemals 0 dB überschreitet.
pt_br: Para evitar clipping, sua mixagem de som deve ser organizada para que a saída do *barramento mestre* (mais detalhes depois) nunca exceda 0dB.
zh_tw: 為了避免削波，你應該調整混音，使*master 匯流排*（後面會有更多的介紹）永遠不超過 0 dB。

source: Every 6 dB below the 0 dB limit, sound energy is *halved*. It means the sound volume at -6 dB is half as loud as 0dB. -12 dB is half as loud as -6 dB and so on.
de: Alle 6 dB unter der 0-dB-Grenze wird der Schalldruck *halbiert*. Das bedeutet, dass die Lautstärke bei -6 dB halb so laut ist wie bei 0 dB. -12 dB ist halb so laut wie -6 dB und so weiter.
pt_br: Para cada 6 dB abaixo do limite de 0 dB, a energia de som é *cortada pela metade*. Significa que o volume de som em -6 dB possui metade da intensidade de 0 dB. -12 dB possui metade da intensidade de -6 dB e assim por diante.
zh_tw: 低於0dB限制的每6dB, 聲能就會 *減半* . 這意味著-6dB的音量是0dB的一半. -12dB是-6dB的一半, 依此類推.

source: When working with decibels, sound is considered no longer audible between -60 dB and -80 dB. This makes your working range generally between -60 dB and 0 dB.
de: Wenn Sie mit Dezibel arbeiten, gilt der Schall zwischen -60 dB und -80 dB als nicht mehr hörbar. Ihr Arbeitsbereich liegt also im Allgemeinen zwischen -60 dB und 0 dB.
pt_br: Ao trabalhar com decibels, um som é considerado inaudível entre -60 dB e -80 dB. Isso faz com que seu alcance de trabalho seja geralmente entre -60 dB e 0 dB.
zh_tw: 使用分貝時, -60dB和-80dB範圍內的聲音被認為是聽不見的. 也就是說你的工作範圍一般在-60dB和0dB之間.

source: This can take a bit getting used to, but it's friendlier in the end and will allow you to communicate better with audio professionals.
de: Das kann etwas gewöhnungsbedürftig sein, ist aber letztlich angenehmer und ermöglicht Ihnen eine bessere Kommunikation mit Audioexperten.
pt_br: Pode levar um pouco de tempo para pegar o jeito, porém é mais amigável no fim e permitirá que você se comunique melhor com profissionais de áudio.
zh_tw: 這可能需要一點時間來習慣, 但最終會變得友好, 並且可以讓您與音訊專業人員更好地進行交流.

source: Audio buses can be found in the bottom panel of the Godot editor:
de: Audiobusse finden Sie im unteren Bedienfeld des Godot-Editors:
pt_br: Barramentos de áudio podem ser encontrados no painel inferior do editor do Godot:
zh_tw: 音訊匯流排可以在Godot 編輯器的底部面板中找到:

source: An *audio bus* (also called an *audio channel*) can be considered a place that audio is channeled through on the way to playback through a device's speakers. Audio data can be *modified* and *re-routed* by an audio bus. An audio bus has a VU meter (the bars that light up when sound is played) which indicates the amplitude of the signal passing through.
de: Ein *Audiobus* (auch *Audiokanal* genannt) kann als ein Ort betrachtet werden, durch den Audio auf dem Weg zur Wiedergabe über die Lautsprecher eines Geräts geleitet wird. Audiodaten können über einen Audiobus *verändert* und *umgeleitet* werden. Ein Audiobus verfügt über ein VU-Meter (die Balken, die aufleuchten, wenn ein Ton abgespielt wird), das die Amplitude des durchlaufenden Signals anzeigt.
pt_br: Um *barramento de áudio* (também chamado de *canal de áudio*) pode ser considerado um lugar por onde o áudio é canalizado no caminho para a reprodução nos alto-falantes de um dispositivo. Dados de áudio podem ser *modificados* e *redirecionados* por um barramento de áudio. Um barramento de áudio possui um medidor VU (as barras que se iluminam quando o som é reproduzido) que indica a amplitude da passagem do sinal.
zh_tw: *音訊匯流排* (audio bus)(通常也稱為 *音訊通道* (audio channel) )是音訊從揚聲器播放出來之前通過的地方. 它可以 *修改* 和 *重路由* 音訊資料. 音訊匯流排有一個 VU表(播放聲音時亮起的條形), 表示通過的訊號的幅度.

source: The leftmost bus is the *master bus*. This bus outputs the mix to your speakers so, as mentioned in the *Decibel scale* section above, make sure that your mix level doesn't reach 0 dB in this bus. The rest of the audio buses can be flexibly routed. After modifying the sound, they send it to another bus to the left. The destination bus can be specified for each of the non-master audio buses. Routing always passes audio from buses on the right to buses further to the left. This avoids infinite routing loops.
de: Der Bus ganz links ist der *Master-Bus*. Dieser Bus gibt den Mix an Ihre Lautsprecher aus. Wie im Abschnitt *Dezibelskala* oben erwähnt, sollten Sie darauf achten, dass der Pegel Ihres Mixes in diesem Bus nicht 0 dB erreicht. Die übrigen Audiobusse können flexibel geroutet werden. Nach der Bearbeitung des Sounds senden sie ihn an einen anderen Bus auf der linken Seite. Der Zielbus kann für jeden der Nicht-Master-Audiobusse festgelegt werden. Das Routing leitet den Ton immer von den Bussen auf der rechten Seite zu den Bussen weiter links weiter. Dadurch werden unendliche Routing-Schleifen vermieden.
pt_br: O barramento mais à esquerda é o *barramento mestre*. Este barramento gera o mix para seus alto-falantes então, como mencionado na seção *Escala decibel* acima, certifique-se de que seu nível de mixagem não chegue a 0 dB neste barramento. O resto dos barramentos de áudio podem ser flexivelmente encaminhados. Após modificar o som, eles o enviam para outro barramento à esquerda. O barramento destinatário pode ser especificado por cada um dos barramentos não-mestre. O encaminhamento sempre passa áudio de barramentos na direita para barramentos além para a esquerda. Isso evita ciclos de encaminhamento infinitos.
zh_tw: 最左邊的匯流排是 *主匯流排* . 此匯流排將混音輸出到你的揚聲器, 因此, 正如之前 *分貝標度* 部分所述, 請確保主匯流排中的混音水平永遠低於 0 dB. 其餘的音訊匯流排可以靈活地進行路由. 在修改聲音後, 它們會將其發送到左邊的另一條匯流排上. 非主匯流排的目標匯流排可以被單獨設定. 而右側匯流排的音訊會被路由至左側匯流排, 這避免了無限迴圈.

source: In the above image, the output of *Bus 2* has been routed to the *Master* bus.
de: In der obigen Abbildung wurde der Ausgang von *Bus 2* auf den *Master*-Bus geroutet.
pt_br: Na imagem acima, a saída do *Bus 2* foi encaminhada para o barramento *Master*.
zh_tw: 在上圖中, *Bus 2* 的輸出被路由到了 *主* 匯流排.

source: Playback of audio through a bus
de: Wiedergabe von Audio durch einen Bus
pt_br: Reprodução de áudio através de um barramento
zh_tw: 通過匯流排播放音訊

source: To test passing audio to a bus, create an AudioStreamPlayer node, load an AudioStream and select a target bus for playback:
de: Um das Weiterleiten von Audio an einen Bus zu testen, erstellen Sie einen AudioStreamPlayer-Node, laden Sie einen AudioStream und wählen Sie einen Zielbus für die Wiedergabe aus:
pt_br: Para testar a passagem de áudio para um barramento, crie um nó AudioStreamPlayer, carregue um AudioStream e selecione um barramento de destino para reprodução:
zh_tw: 要測試將音訊傳遞到匯流排, 請建立AudioStreamPlayer節點, 載入AudioStream並選擇要播放的目標匯流排:

source: Finally, toggle the **Playing** property to **On** and sound will flow.
de: Schalten Sie abschließend die Property **Wiedergabe** auf **Ein** und die Tonausgabe startet.
pt_br: Por fim, alterne a propriedade **Playing** para **On** e o som fluirá.
zh_tw: 最後將 **Playing** 屬性勾上 **On** , 聲音就開始播放了.

source: You may also be interested in reading about :ref:`doc_audio_streams` now.
de: Vielleicht möchten Sie jetzt auch Folgendes lesen: :ref:`doc_audio_streams`.
pt_br: Você também pode estar interessado em ler sobre :ref:`doc_audio_streams` agora.
zh_tw: 你現在可能有興趣閱讀 :ref:`doc_audio_streams`。

source: Adding effects
de: Effekte hinzufügen
pt_br: Adicionando efeitos
zh_tw: 新增特效

source: Audio buses can contain all sorts of effects. These effects modify the sound in one way or another and are applied in order.
de: Audiobusse können alle Arten von Effekten enthalten. Diese Effekte verändern den Klang auf die eine oder andere Weise und werden der Reihe nach angewendet.
pt_br: Barramentos de áudio podem conter todos os tipos de efeitos. Esses efeitos modificam o som de uma forma ou outra e são aplicados em ordem.
zh_tw: 音訊匯流排可以包含各種效果. 這些效果以某種方式修改聲音並按順序應用.

source: For information on what each effect does, see :ref:`doc_audio_effects`.
de: Informationen über die Funktionen der einzelnen Effekte finden Sie unter :ref:`doc_audio_effects`.
pt_br: Para obter mais informações sobre o que cada efeito faz, consulte: ref: `doc_audio_effects`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: Automatic bus disabling
de: Automatische Bus-Deaktivierung
pt_br: Desativando barramentos automaticamente
zh_tw: 自動匯流排禁用

source: There is no need to disable buses manually when not in use. Godot detects that the bus has been silent for a few seconds and disables it (including all effects).
de: Es ist nicht erforderlich, Busse manuell zu deaktivieren, wenn sie nicht verwendet werden. Godot erkennt, dass der Bus einige Sekunden lang still war, und deaktiviert ihn (einschließlich aller Effekte).
pt_br: Não há necessidade de desabilitar barramentos manualmente quando não estiverem em uso. O Godot detecta que o barramento ficou silencioso por alguns segundos e o desativa (incluindo todos os efeitos).
zh_tw: 你不需要手動禁用閒置匯流排,Godot在偵測到匯流排已經靜音數秒之後, 就會禁用它(以及所有效果).

source: Disabled buses have a blue VU meter instead of a red-green one.
de: Abgeschaltete Busse haben einen blauen VU-Zähler anstelle eines rot-grünen.
pt_br: Barramentos desativados têm um medidor VU azul ao invés de um vermelho-verde.
zh_tw: 已禁用的匯流排VU表為藍色, 而不是紅綠色.

source: Bus rearrangement
de: Bus-Neuanordnung
pt_br: Reorganizando barramentos
zh_tw: 匯流排重排

source: Stream Players use bus names to identify a bus, which allows adding, removing and moving buses around while the reference to them is kept. However, if a bus is renamed, the reference will be lost and the Stream Player will output to Master. This system was chosen because rearranging buses is a more common process than renaming them.
de: Stream-Player verwenden Busnamen zur Identifizierung eines Busses, was das Hinzufügen, Entfernen und Verschieben von Bussen ermöglicht, während der Bezug zu ihnen erhalten bleibt. Wenn jedoch ein Bus umbenannt wird, geht der Bezug verloren und der Stream-Player gibt das Signal an den Master aus. Dieses System wurde gewählt, weil das Umordnen von Bussen häufiger vorkommt als deren Umbenennung.
pt_br: Stream Players usam nomes de barramento para identificar um barramento, o que permite adicionar, remover e mover barramentos enquanto a referência a eles é mantida. No entanto, se um barramento for renomeado, a referência será perdida e o áudio do Stream Player será enviado para o Master. Este sistema foi escolhido porque reorganizar os barramentos é um processo mais comum do que renomeá-los.
zh_tw: 流播放機使用匯流排名稱來識別匯流排, 允許在保留對匯流排的引用時新增, 刪除和移動匯流排. 然而, 重命名匯流排會導致引用丟失, 流播放機將輸出到主匯流排. 之所以選擇這個系統, 是因為重新排列匯流排相比重命名匯流排更為常用.

source: Default bus layout
pt_br: Layout de barramento padrão
zh_tw: 預設匯流排佈局

source: The default bus layout is automatically saved to the ``res://default_bus_layout.tres`` file. Custom bus arrangements can be saved and loaded from disk.
de: Das Default-Buslayout wird automatisch in der Datei ``res://default_bus_layout.tres`` gespeichert. Benutzerdefinierte Busanordnungen können gespeichert und von der Festplatte geladen werden.
pt_br: O layout de barramento padrão é salvo automaticamente no arquivo ``res://default_bus_layout.tres``. Layouts de barramento personalizados podem ser salvos e carregados do disco.
zh_tw: 預設的匯流排佈局會自動保存到 ``res:// default_bus_layout.tres`` 檔案中. 自訂匯流排佈局可以從磁片中保存和載入.

source: Translation status
de: Übersetzungsstatus
pt_br: Progresso da Tradução
zh_tw: 翻譯狀態
