Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/audio_effects.po
Languages: de

source: Audio effects
de: Audio-Effekte

source: Godot includes several audio effects that can be added to an audio bus to alter every sound file that goes through that bus.
de: Godot enthält mehrere Audioeffekte, die zu einem Audiobus hinzugefügt werden können, um jede Audiodatei, die durch diesen Bus läuft, zu verändern.

source: Try them all out to get a sense of how they alter sound. Here follows a short description of the available effects:
de: Probieren Sie sie alle aus, um ein Gefühl dafür zu bekommen, wie diese den Klang verändern. Hier folgt eine kurze Beschreibung der verfügbaren Effekte:

source: Amplify
de: Verstärken

source: Amplify changes the volume of the signal. Some care needs to be taken, though: setting the level too high can make the sound digitally clip, which can produce unpleasant crackles and pops.
de: Verstärken ändert die Lautstärke des Signals. Einige Vorsicht ist geboten: wenn Sie den Pegel zu hoch einstellen, wird der Ton geclippt, was möglicherweise unangenehme Knack- und Poppgeräusche erzeugen könnte.

source: BandLimit and BandPass
de: BandLimit und BandPass-Filter

source: These are resonant filters which block frequencies around the *Cutoff* point. BandPass can be used to simulate sound passing through an old telephone line or megaphone. Modulating the BandPass frequency can simulate the sound of a wah-wah guitar pedal, think of the guitar in Jimi Hendrix's *Voodoo Child (Slight Return)*.
de: Dies sind Resonanzfilter, die Frequenzen um den *Grenzfrequenz*-Punkt blockieren. Mit BandPass kann der Klang simuliert werden, der über eine alte Telefonleitung oder ein Megaphon übertragen wird. Das Modulieren der BandPass-Frequenz kann den Klang eines Wah-Wah-Gitarrenpedals simulieren. Denken Sie an die Gitarre in Jimi Hendrix *Voodoo Child (Slight Return)*.

source: The Capture effect copies the audio frames of the audio bus that it is on into an internal buffer. This can be used to capture data from the microphone or to transmit audio over the network in real-time.
de: Der Capture-Effekt kopiert die Audio-Frames des Audiobusses, an den er angeschlossen ist, in einen internen Puffer. Dies kann verwendet werden, um Daten vom Mikrofon zu erfassen oder um Audio in Echtzeit über das Netzwerk zu übertragen.

source: As the name of the effect implies, the Chorus effect makes a single audio sample sound like an entire chorus. It does this by duplicating a signal and very slightly altering the timing and pitch of each duplicate, and varying that over time via an LFO (low frequency oscillator). The duplicate(s) are then mixed back together with the original signal, producing a lush, wide, and large sound. Although chorus is traditionally used for voices, it can be desirable with almost any type of sound.
de: Wie der Name des Effekts schon sagt, lässt der Chorus-Effekt ein einzelnes Audiosample wie einen ganzen Chor klingen. Dazu wird ein Signal dupliziert und das Timing und die Tonhöhe jedes Duplikats geringfügig verändert und über einen LFO (Niederfrequenz-Oszillator) zeitlich variiert. Die Duplikate werden dann wieder mit dem Originalsignal zusammengemischt, wodurch ein üppiger, breiter und großer Klang entsteht. Obwohl der Chorus traditionell für Stimmen verwendet wird, kann er für fast alle Arten von Klängen eingesetzt werden.

source: Compressor
de: Kompressor

source: A dynamic range compressor automatically attenuates (ducks) the level of the incoming signal when its amplitude exceeds a certain threshold. The level of attenuation applied is proportional to how far the incoming audio exceeds the threshold. The compressor's Ratio parameter controls the degree of attenuation. One of the main uses of a compressor is to reduce the dynamic range of signals with very loud and quiet parts. Reducing the dynamic range of a signal can make it fit more comfortably in a mix.
de: Ein Dynamikbereichskompressor dämpft automatisch den Pegel des eingehenden Signals ("Ducking"), wenn seine Amplitude einen bestimmten Schwellenwert überschreitet. Die Stärke der Dämpfung ist proportional dazu, wie weit der eingehende Ton den Schwellenwert überschreitet. Der Parameter Ratio des Kompressors steuert den Dämpfungsgrad. Eine der Hauptanwendungen eines Kompressors besteht darin, den Dynamikbereich von Signalen mit sehr lauten und leisen Teilen zu reduzieren. Die Verringerung des Dynamikbereichs eines Signals kann dazu beitragen, dass es sich besser in einen Mix einfügt.

source: The compressor has many uses. For example:
de: Der Kompressor kann vielfältig genutzt werden, zum Beispiel:

source: It can be used in the Master bus to compress the whole output prior to being hit by a limiter, making the effect of the limiter much more subtle.
de: Er kann im Master-Bus verwendet werden, um das gesamte Ausgangssignal zu komprimieren, bevor es von einem Limiter erfasst wird, wodurch die Wirkung des Limiters viel subtiler wird.

source: It can be used in voice channels to ensure they sound as even as possible.
de: Es kann in Sprachkanälen verwendet werden, um sicherzustellen, dass sie so gleichmäßig wie möglich klingen.

source: It can be *sidechained* by another sound source. This means it can reduce the sound level of one signal using the level of another audio bus for threshold detection. This technique is very common in video game mixing to "duck" the level of music or sound effects when in-game or multiplayer voices need to be fully audible.
de: Er kann von einer anderen Klangquelle *sidechained* werden. Das bedeutet, dass er den Schallpegel eines Signals reduzieren kann, indem er den Pegel eines anderen Audiobusses zur Schwellenwerterkennung verwendet. Diese Technik wird häufig bei der Abmischung von Videospielen verwendet, um den Pegel von Musik oder Soundeffekten zu "ducken", wenn Stimmen im Spiel oder im Mehrspielermodus voll hörbar sein müssen.

source: It can accentuate transients by using a slower attack. This can make sound effects more punchy.
de: Er kann Einschwingvorgänge durch einen langsameren Attack akzentuieren. Dies kann Soundeffekte druckvoller machen.

source: If your goal is to prevent a signal from exceeding a given amplitude altogether, rather than to reduce the dynamic range of the signal, a :ref:`limiter <doc_audio_buses_limiter>` is likely a better choice than a compressor for this purpose. However, applying compression before a limiter is still good practice.
de: Wenn Sie verhindern wollen, dass ein Signal eine bestimmte Amplitude überschreitet, und nicht den Dynamikbereich des Signals reduzieren wollen, ist ein :ref:`Limiter <doc_audio_buses_limiter>` für diesen Zweck wahrscheinlich die bessere Wahl als ein Kompressor. Die Anwendung einer Kompression vor einem Limiter ist jedoch immer noch eine gute Praxis.

source: Digital delay essentially duplicates a signal and repeats it at a specified speed with a volume level that decays for each repeat. Delay is great for simulating the acoustic space of a canyon or large room, where sound bounces have a lot of *delay* between their repeats. This is in contrast to reverb, which has a more natural and blurred sound to it. Using this in conjunction with reverb can create very natural sounding environments!
de: Beim digitalen Delay wird ein Signal im Wesentlichen dupliziert und mit einer bestimmten Geschwindigkeit wiederholt, wobei der Lautstärkepegel bei jeder Wiederholung abnimmt. Delay eignet sich hervorragend für die Simulation des akustischen Raums einer Schlucht oder eines großen Raums, in dem die Schallwellen zwischen ihren Wiederholungen eine große Verzögerung aufweisen. Dies steht im Gegensatz zu Reverb, das einen natürlicheren und verschwommeneren Klang hat. In Verbindung mit Reverb können Sie damit sehr natürlich klingende Umgebungen schaffen!

source: Distortion
de: Verzerrung

source: Makes the sound distorted. Godot offers several types of distortion:
de: Verzerrt den Klang. Godot bietet mehrere Arten der Verzerrung:

source: *Overdrive* sounds like a guitar distortion pedal or megaphone. Sounds distorted with this sound like they're coming through a low-quality speaker or device.
de: *Overdrive* klingt wie ein Gitarrenverzerrer oder ein Megaphon. Damit verzerrte Töne klingen, als kämen sie aus einem minderwertigen Lautsprecher oder Gerät.

source: *Tan* sounds like another interesting flavor of overdrive.
de: *Tan* klingt wie eine andere interessante Variante von Overdrive.

source: *Bit crushing* clamps the amplitude of the signal, making it sound flat and crunchy.
de: *Bit Crushing* clampt die Amplitude des Signals, wodurch es flach und knackig klingt.

source: All three types of distortion can add higher frequency sounds to an original sound, making it stand out better in a mix.
de: Alle drei Arten der Verzerrung können einem Originalsound höhere Frequenzen hinzufügen, wodurch er in einer Mischung besser zur Geltung kommt.

source: EQ is what all other equalizers inherit from. It can be extended with Custom scripts to create an equalizer with a custom number of bands.
de: EQ ist das, wovon alle anderen Equalizer erben. Es kann mit benutzerdefinierten Skripten erweitert werden, um einen Equalizer mit einer benutzerdefinierten Anzahl von Bändern zu erstellen.

source: Godot provides three equalizers with different numbers of bands, which are represented in the title (6, 10, and 21 bands, respectively). An equalizer on the Master bus can be useful for cutting low and high frequencies that the device's speakers can't reproduce well. For example, phone or tablet speakers usually don't reproduce low frequency sounds well, and could make a limiter or compressor attenuate sounds that aren't even audible to the user anyway.
de: Godot bietet drei Equalizer mit einer unterschiedlichen Anzahl von Bändern, die im Titel dargestellt sind (6, 10 bzw. 21 Bänder). Ein Equalizer auf dem Master-Bus kann nützlich sein, um tiefe und hohe Frequenzen abzuschneiden, die von den Lautsprechern des Geräts nicht gut wiedergegeben werden können. Zum Beispiel geben die Lautsprecher eines Smartphones oder Tablets tiefe Frequenzen nicht gut wieder, so dass ein Limiter oder Kompressor Klänge abschwächen kann, die für den Benutzer ohnehin nicht hörbar sind.

source: Note: The equalizer effect can be disabled when headphones are plugged in, giving the user the best of both worlds.
de: Hinweis: Der Equalizer-Effekt kann deaktiviert werden, wenn ein Kopfhörer angeschlossen ist, so dass der Benutzer das Beste aus beiden Welten erhält.

source: Filter is what all other filters inherit from and should not be used directly.
de: Filter ist das, was alle anderen Filter erben, es sollte nicht direkt verwendet werden.

source: Cuts frequencies below a specific *Cutoff* frequency. HighPassFilter is used to reduce the bass content of a signal.
de: Schneidet Frequenzen unter einer bestimmten *Grenzfrequenz* ab. HighPassFilter wird verwendet, um den Bassinhalt eines Signals zu reduzieren.

source: Reduces all frequencies above a specific *Cutoff* frequency.
de: Reduziert alle Frequenzen oberhalb einer bestimmten *Grenzfrequenz*.

source: A limiter is similar to a compressor, but it's less flexible and designed to prevent a signal's amplitude exceeding a given dB threshold. Adding a limiter to the final point of the Master bus is good practice, as it offers an easy safeguard against clipping.
de: Ein Limiter ähnelt einem Kompressor, ist aber weniger flexibel und soll verhindern, dass die Amplitude eines Signals einen bestimmten dB-Schwellenwert überschreitet. Das Hinzufügen eines Limiters am letzten Punkt des Master-Busses ist eine gute Praxis, da er einen einfachen Schutz gegen Clipping bietet.

source: Cuts frequencies above a specific *Cutoff* frequency and can also resonate (boost frequencies close to the *Cutoff* frequency). Low pass filters can be used to simulate "muffled" sound. For instance, underwater sounds, sounds blocked by walls, or distant sounds.
de: Schneidet Frequenzen oberhalb einer bestimmten *Grenzfrequenz* ab und kann auch in Resonanz gehen ("Verstärkung von Frequenzen nahe der *Grenzfrequenz*"). Low Pass-Filter können verwendet werden, um "gedämpften" Klang zu simulieren. Zum Beispiel Unterwassergeräusche, Geräusche, die durch Wände blockiert werden, oder entfernte Geräusche.

source: Reduces all frequencies below a specific *Cutoff* frequency.
de: Reduziert alle Frequenzen unterhalb einer bestimmten *Grenzfrequenz*.

source: The opposite of the BandPassFilter, it removes a band of sound from the frequency spectrum at a given *Cutoff* frequency.
de: Das Gegenteil zum BandPassFilter, es wird ein Schallband mit einer bestimmten *Grenzfrequenz* aus dem Frequenzspektrum entfernt.

source: The Panner allows the stereo balance of a signal to be adjusted between the left and right channels. Headphones are recommended when configuring in this effect.
de: Mit dem Panner kann die Stereo-Balance eines Signals zwischen dem linken und dem rechten Kanal eingestellt werden. Bei der Konfiguration dieses Effekts wird ein Kopfhörer empfohlen.

source: This effect is formed by de-phasing two duplicates of the same sound so they cancel each other out in an interesting way. Phaser produces a pleasant whooshing sound that moves back and forth through the audio spectrum, and can be a great way to create sci-fi effects or Darth Vader-like voices.
de: Dieser Effekt entsteht, indem zwei Duplikate desselben Klangs phasenverschoben werden, so dass sie sich auf interessante Weise gegenseitig auslöschen. Der Phaser erzeugt einen angenehmen, zischenden Klang, der sich durch das Audiospektrum hin und her bewegt, und eignet sich hervorragend zur Erzeugung von Sci-Fi-Effekten oder Darth-Vader-ähnlichen Stimmen.

source: This effect allows the adjustment of the signal's pitch independently of its speed. All frequencies can be increased/decreased with minimal effect on transients. PitchShift can be useful to create unusually high or deep voices. Do note that altering pitch can sound unnatural when pushed outside of a narrow window.
de: Mit diesem Effekt lässt sich die Tonhöhe des Signals unabhängig von seiner Geschwindigkeit einstellen. Alle Frequenzen können mit minimalen Auswirkungen auf die Einschwingvorgänge erhöht/verringert werden. PitchShift kann nützlich sein, um ungewöhnlich hohe oder tiefe Stimmen zu erzeugen. Beachten Sie jedoch, dass die Änderung der Tonhöhe unnatürlich klingen kann, wenn sie außerhalb eines engen Fensters erfolgt.

source: The Record effect allows the user to record sound from a microphone.
de: Mit dem Record-Effekt kann Audio, das über den Bus geleitet wird, in eine Datei geschrieben werden.

source: Reverb simulates rooms of different sizes. It has adjustable parameters that can be tweaked to obtain the sound of a specific room. Reverb is commonly outputted from :ref:`Area3Ds <class_Area3D>` (see :ref:`Reverb buses <doc_audio_streams_reverb_buses>`), or to apply a "chamber" feel to all sounds.
de: Reverb (auch: Hall) simuliert Räume unterschiedlicher Größe. Es verfügt über einstellbare Parameter, die angepasst werden können, um den Klang eines bestimmten Raums zu erhalten. Reverb wird normalerweise ausgegeben von :ref:`Area3Ds <class_Area3D>` (siehe :ref:`Reverb-Busse <doc_audio_streams_reverb_buses>`) oder um allen Sounds ein "Kammer"-Gefühl zu verleihen.

source: This effect doesn't alter audio, instead, you add this effect to buses you want a spectrum analysis of. This would typically be used for audio visualization. Visualizing voices can be a great way to draw attention to them without just increasing their volume. A demo project using this can be found `here <https://github.com/godotengine/godot-demo-projects/tree/master/audio/spectrum>`__.
de: Dieser Effekt verändert nicht das Audiosignal, stattdessen fügen Sie den Effekt zu Bussen hinzu, für die Sie eine Spektrum-Analyse wünschen. Dieser Effekt wird in der Regel für die Audiovisualisierung verwendet. Die Visualisierung von Stimmen kann eine gute Möglichkeit sein, die Aufmerksamkeit auf sie zu lenken, ohne einfach nur ihre Lautstärke zu erhöhen. Ein Demoprojekt, das diesen Effekt verwendet, finden Sie `hier <https://github.com/godotengine/godot-demo-projects/tree/master/audio/spectrum>`__.

source: This effect uses a few algorithms to enhance a signal's stereo width.
de: Dieser Effekt verwendet einige Algorithmen, um die Stereobreite eines Signals zu verbessern.

source: Translation status
de: Übersetzungsstatus
