Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/recording_with_microphone.po
Languages: de, zh_tw

source: Recording with microphone
de: Aufnahme mit Mikrofon
zh_tw: 使用麥克風錄音

source: Godot supports in-game audio recording for Windows, macOS, Linux, Android and iOS.
de: Godot unterstützt Audioaufnahmen innerhalb des Spiels unter Windows, MacOS, Linux, Android und iOS.
zh_tw: Godot支援Windows, macOS, Linux, Android和iOS的遊戲內音訊錄製.

source: A simple demo is included in the official demo projects and will be used as support for this tutorial: `<https://github.com/godotengine/godot-demo-projects/tree/master/audio/mic_record>`_.
de: Ein einfaches Beispiel ist in den offiziellen Demo-Projekten enthalten und wird als Unterstützung für diese Anleitung verwendet: `<https://github.com/godotengine/godot-demo-projects/tree/master/audio/mic_record>`_.
zh_tw: 一定要查看Viewport演示！ 可以下載演示檔案中的Viewport資料夾, 或: `<https://github.com/godotengine/godot-demo-projects/tree/master/audio/mic_record>`_.

source: You will need to enable audio input in the project settings, or you'll just get empty audio files.
de: Sie müssen die Audioeingabe in den Projekteinstellungen aktivieren, da Sie sonst nur leere Audiodateien erhalten.
zh_tw: 你需要在專案設定中啟用音訊輸入，否則只能獲得空的音訊檔。

source: The structure of the demo
de: Der Aufbau der Demo
zh_tw: 根節點的結構

source: The demo consists of a single scene. This scene includes two major parts: the GUI and the audio.
de: Die Demo besteht aus einer einzelnen Szene. Diese Szene enthält zwei Hauptteile: die GUI und das Audio.
zh_tw: 該演示由單一場景組成, 這個場景包括兩個主要部分:GUI和音訊.

source: We will focus on the audio part. In this demo, a bus named ``Record`` with the effect ``Record`` is created to handle the audio recording. An ``AudioStreamPlayer`` named ``AudioStreamRecord`` is used for recording.
de: Wir werden uns auf den Audioteil konzentrieren. In dieser Demo wird ein Bus mit dem Namen ``Record`` mit dem Effekt ``Record`` für die Audioaufnahme erstellt. Ein ``AudioStreamPlayer`` mit dem Namen ``AudioStreamRecord`` wird für die Aufnahme verwendet.
zh_tw: 我們將重點介紹音訊部分. 在本演示中, 建立了一個名為 ``Record`` 的匯流排, 效果為 ``Record``, 用於處理音訊錄製. 用一個名為 ``AudioStreamPlayer`` 的 ``AudioStreamRecord`` 進行錄音.

source: The audio recording is handled by the :ref:`class_AudioEffectRecord` resource which has three methods: :ref:`get_recording() <class_AudioEffectRecord_method_get_recording>`, :ref:`is_recording_active() <class_AudioEffectRecord_method_is_recording_active>`, and :ref:`set_recording_active() <class_AudioEffectRecord_method_set_recording_active>`.
de: Die Audioaufnahme wird von der Ressource :ref:`class_AudioEffectRecord` gehandhabt, die drei Methoden hat: :ref:`get_recording() <class_AudioEffectRecord_method_get_recording>`, :ref:`is_recording_active() <class_AudioEffectRecord_method_is_recording_active>`, und :ref:`set_recording_active() <class_AudioEffectRecord_method_set_recording_active>`.
zh_tw: 音訊錄製由 :ref:`class_AudioEffectRecord` 資源處理, 它有三個方法: :ref:`get_recording() <class_AudioEffectRecord_method_get_recording>`, :ref:`is_recording_active() <class_AudioEffectRecord_method_is_recording_active>`, 以及 :ref:`set_recording_active() <class_AudioEffectRecord_method_set_recording_active>`.

source: At the start of the demo, the recording effect is not active. When the user presses the ``RecordButton``, the effect is enabled with ``set_recording_active(true)``.
de: Zu Beginn der Demo ist der Aufnahmeeffekt nicht aktiv. Wenn der Benutzer den ``RecordButton`` drückt, wird der Effekt mit ``set_recording_active(true)`` aktiviert.
zh_tw: 在演示開始時, 錄音效果是未啟動. 當使用者按下 ``RecordButton`` 時, 用 ``set_recording_active(true)`` 啟用該效果.

source: On the next button press, as ``effect.is_recording_active()`` is ``true``, the recorded stream can be stored into the ``recording`` variable by calling ``effect.get_recording()``.
de: Beim nächsten Druck auf den Button, wenn ``effect.is_recording_active()`` auf ``true`` steht, kann der aufgenommene Stream durch den Aufruf von ``effect.get_recording()`` in der Variable ``recording`` gespeichert werden.
zh_tw: 在下一次按下按鈕時, 由於 ``effect.is_recording_active()`` 為 ``true``, 可以通過呼叫 ``effect.get_recording()`` 將錄製的流儲存到 ``recording`` 變數中.

source: To playback the recording, you assign the recording as the stream of the ``AudioStreamPlayer`` and call ``play()``.
de: Um die Aufnahme abzuspielen, weisen Sie die Aufnahme als Stream des ``AudioStreamPlayer`` zu und rufen ``play()`` auf.
zh_tw: 要重播錄音, 你可以將錄音指定為 ``AudioStreamPlayer`` 的流, 並呼叫 ``play()``.

source: To save the recording, you call ``save_to_wav()`` with the path to a file. In this demo, the path is defined by the user via a ``LineEdit`` input box.
de: Um die Aufnahme zu speichern, rufen Sie ``save_to_wav()`` mit dem Pfad zu einer Datei auf. In dieser Demo wird der Pfad vom Benutzer über ein ``LineEdit`` Eingabefeld definiert.
zh_tw: 要保存錄音, 你需要呼叫 ``save_to_wav()``, 並提供檔的路徑. 在本演示中, 路徑由使用者通過 ``LineEdit`` 輸入框定義.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
