Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/cpu_optimization.po
Languages: de, zh_tw

source: One quirk of the :ref:`SceneTree <class_SceneTree>` is that you can sometimes get much better performance by removing nodes from the SceneTree, rather than by pausing or hiding them. You don't have to delete a detached node. You can for example, keep a reference to a node, detach it from the scene tree using :ref:`Node.remove_child(node) <class_Node_method_remove_child>`, then reattach it later using :ref:`Node.add_child(node) <class_Node_method_add_child>`. This can be very useful for adding and removing areas from a game, for example.
de: Eine Besonderheit des :ref:`SceneTree <class_SceneTree>` ist, dass man manchmal eine viel bessere Performance erhält, wenn man Nodes aus dem SceneTree entfernt, anstatt sie anzuhalten oder zu verstecken. Sie müssen einen abgetrennten Node nicht löschen. Man kann zum Beispiel einen Verweis auf einen Node behalten, ihn mit :ref:`Node.remove_child(node) <class_Node_method_remove_child>` aus dem SceneTree entfernen und ihn später mit :ref:`Node.add_child(node) <class_Node_method_add_child>` wieder anhängen. Dies kann sehr nützlich sein, um z.B. Bereiche in einem Spiel hinzuzufügen oder zu entfernen.
zh_tw: :ref:`SceneTree <class_SceneTree>` 的一個怪癖是, 你有時可以通過從SceneTree中刪除節點, 而不是通過暫停或隱藏節點來獲得更好的性能. 您不一定要刪除一個分離的節點. 例如, 您可以保留一個節點的引用, 使用 :ref:`Node.remove_child(node) <class_Node_method_remove_child>` 將其從場景樹中分離出來, 然後使用 :ref:`Node.add_child(node) <class_Node_method_add_child>` 將其重新連接. 例如, 這對於在遊戲中新增和刪除區域是非常有用的.

source: You can avoid the SceneTree altogether by using Server APIs. For more information, see :ref:`doc_using_servers`.
de: Sie können den Szenenbaum mithilfe von Server-APIs vollständig umgehen. Weitere Informationen finden Sie unter :ref:`doc_using_servers`.
zh_tw: 你可以通過使用伺服器API來完全避免使用SceneTree. 更多資訊, 請參見 :ref:`doc_using_servers` .

source: Physics
de: Physik
zh_tw: 物理

source: In some situations, physics can end up becoming a bottleneck. This is particularly the case with complex worlds and large numbers of physics objects.
de: In einigen Situationen kann die Physik zu einem Bottleneck werden, insbesondere bei komplexen Welten und einer großen Anzahl von Physikobjekten.
zh_tw: 在某些情況下, 物理學最終會成為一個瓶頸. 尤其是在複雜的世界和大量物理物件的情況下, 更是如此.

source: Here are some techniques to speed up physics:
de: Einige Techniken zur Beschleunigung der Physik:
zh_tw: 有幾點需要注意：

source: Try using simplified versions of your rendered geometry for collision shapes. Often, this won't be noticeable for end users, but can greatly increase performance.
de: Versuchen Sie vereinfachte Versionen Ihrer gerenderten Geometrie für die Physik zu verwenden. Dies ist für Endbenutzer nicht wahrnehmbar, kann jedoch die Performance erheblich steigern.
zh_tw: 嘗試使用簡化版本的算繪幾何圖形來處理碰撞形狀. 通常情況下, 這對終端使用者來說並不明顯, 但可以大大提高性能.

source: Try removing objects from physics when they are out of view / outside the current area, or reusing physics objects (maybe you allow 8 monsters per area, for example, and reuse these).
de: Versuchen Sie Objekte aus der Physik zu entfernen, wenn sie sich außerhalb des aktuellen Bereichs befinden, oder Physikobjekte wiederzuverwenden (möglicherweise erlauben Sie beispielsweise 8 Monster pro Bereich und verwenden diese wieder).
zh_tw: 試著從物理學中移除物體, 當它們不在視野中/在目前區域之外時, 或者重新使用物理學物件(例如, 也許你允許每個區域有8個怪物, 並重新使用這些怪物).

source: Another crucial aspect to physics is the physics tick rate. In some games, you can greatly reduce the tick rate, and instead of for example, updating physics 60 times per second, you may update them only 30 or even 20 times per second. This can greatly reduce the CPU load.
de: Ein weiterer entscheidender Aspekt von Physik ist die Physik-Tick-Rate. In einigen Spielen können Sie die Tick-Rate erheblich reduzieren. Anstatt beispielsweise die Physik 60 Mal pro Sekunde zu aktualisieren, können Sie sie mit 30 oder sogar 20 Ticks pro Sekunde aktualisieren. Dies kann die CPU-Auslastung erheblich reduzieren.
zh_tw: 物理的另一個關鍵方面是物理週期率。在一些遊戲中，你可以大大降低週期率，比如說，你可以不用每秒更新物理 60 次，而只需每秒更新 30 次甚至 20 次。這樣可以大大降低 CPU 的負載。

source: The downside of changing physics tick rate is you can get jerky movement or jitter when the physics update rate does not match the frames per second rendered. Also, decreasing the physics tick rate will increase input lag. It's recommended to stick to the default physics tick rate (60 Hz) in most games that feature real-time player movement.
de: Der Nachteil einer Änderung der Physik-Tick-Rate ist, dass es zu ruckartigen Bewegungen oder Jittern kommen kann, wenn die Aktualisierungsrate der Physik nicht mit den gerenderten Bildern pro Sekunde übereinstimmt. Außerdem erhöht sich durch die Verringerung der Physik-Tick-Rate die Eingabeverzögerung. Es wird empfohlen, die Default-Physik-Tick-Rate (60 Hz) in den meisten Spielen mit Echtzeit-Spielerbewegungen beizubehalten.
zh_tw: 改變物理週期率的缺點是，當物理學更新速率與每秒算繪的影格數不配對時，你可能會出現運動抖動或抖動。另外，降低物理週期率會增加輸入延遲。建議在大多數以玩家即時移動為特色的遊戲中，堅持使用預設的物理週期率（60 Hz）。

source: The solution to jitter is to use *fixed timestep interpolation*, which involves smoothing the rendered positions and rotations over multiple frames to match the physics. You can either implement this yourself or use a `third-party addon <https://github.com/lawnjelly/smoothing-addon>`__. Performance-wise, interpolation is a very cheap operation compared to running a physics tick. It's orders of magnitude faster, so this can be a significant performance win while also reducing jitter.
de: Die Lösung für Jitter ist die Verwendung von *fixed timestep interpolation*, bei der die gerenderten Positionen und Rotationen über mehrere Frames geglättet werden, um der Physik zu entsprechen. Sie können dies entweder selbst implementieren oder ein `Addon eines Drittanbieters <https://github.com/lawnjelly/smoothing-addon>`__ verwenden. In Bezug auf die Performance ist die Interpolation eine sehr billige Operation im Vergleich zur Ausführung eines Physik-Ticks. Sie ist um Größenordnungen schneller, so dass dies ein erheblicher Performance-Gewinn sein kann, während gleichzeitig Jitter reduziert wird.
zh_tw: 解決抖動的方法是使用*固定時間步長插值*，這涉及到平滑多個影格的算繪位置和旋轉，以配對物理。你可以自己實作，或者使用`協力廠商外掛程式 <https://github.com/lawnjelly/smoothing-addon>`__ 。從性能上來說，與運作物理週期相比，插值是一個非常廉價的操作。它的速度快了好幾個數量級，所以這在減少抖動的同時也帶來了部分顯著的性能提升。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
