Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/cpu_optimization.po
Languages: de, zh_tw

source: CPU optimization
de: CPU-Optimierung
zh_tw: 最佳化

source: Measuring performance
de: Messen der Performance
zh_tw: 效能

source: We have to know where the "bottlenecks" are to know how to speed up our program. Bottlenecks are the slowest parts of the program that limit the rate that everything can progress. Focusing on bottlenecks allows us to concentrate our efforts on optimizing the areas which will give us the greatest speed improvement, instead of spending a lot of time optimizing functions that will lead to small performance improvements.
de: Wir müssen wissen, wo die "Bottlenecks" sind, um zu wissen, wie wir unser Programm beschleunigen können. Bottlenecks sind die langsamsten Teile des Programms, die begrenzen, wie schnell das ganze Programm laufen kann. Wenn wir uns auf die Bottlenecks konzentrieren, können wir unseren Aufwand auf die Optimierung der Bereiche konzentrieren, die uns die größte Geschwindigkeitsverbesserung bringen, anstatt viel Zeit mit der Optimierung von Funktionen zu verbringen, die nur zu kleinen Performanceverbesserungen führen.
zh_tw: 我們必須知道“瓶頸”在哪裡，才能知道如何加快我們的程式。瓶頸是指程式中最慢的部分，限制了所有事情的進展速度。專注於瓶頸，可以讓我們集中精力優化能給我們帶來最大速度提升的地方，而不是花大量時間去優化那些能帶來微小性能提升的功能。

source: For the CPU, the easiest way to identify bottlenecks is to use a profiler.
de: Für die CPU ist die Verwendung eines Profilers der einfachste Weg, um Bottlenecks zu identifizieren.
zh_tw: 對於 CPU 來說，找出瓶頸的最簡單方法就是使用性能剖析器。

source: CPU profilers
de: CPU-Profiler
zh_tw: 分析工具

source: Profilers run alongside your program and take timing measurements to work out what proportion of time is spent in each function.
de: Profiler laufen neben Ihrem Programm und nehmen Laufzeit-Messungen vor, um herauszufinden wie viel Zeit in jeder Funktion verbracht wird.
zh_tw: 剖析器與您的程式一起運作, 並進行時間測量, 以計算出每個功能所花費的時間比例.

source: The Godot IDE conveniently has a built-in profiler. It does not run every time you start your project: it must be manually started and stopped. This is because, like most profilers, recording these timing measurements can slow down your project significantly.
de: Die Godot-IDE verfügt über einen integrierten Profiler. Er wird nicht jedes Mal ausgeführt wenn Sie Ihr Projekt starten und muss manuell gestartet und gestoppt werden. Dies liegt daran, da das Aufzeichnen dieser Laufzeit-Messungen, wie bei den meisten Profilern, Ihr Projekt erheblich verlangsamen kann.
zh_tw: Godot整合式開發環境有一個方便的內建剖析器. 它不會在每次啟動專案時運作: 必須手動啟動和停止. 這是因為, 與大多數剖析器一樣, 記錄這些時序測量會大大減慢你的專案速度.

source: After profiling, you can look back at the results for a frame.
de: Wenn der Profiler seine Arbeit getan hat, können Sie sich die Ergebnisse eines Frames ansehen.
zh_tw: 剖析後, 你可以回看一影格的結果.

source: Screenshot of the Godot profiler
de: Screenshot des Godot-Profilers
zh_tw: 使用現有的 Godot 材質

source: Results of a profile of one of the demo projects.
de: Dies sind die Profiling-Ergebnisse eines der Demo-Projekte.
zh_tw: 其中一個演示專案的簡介結果.

source: We can see the cost of built-in processes such as physics and audio, as well as seeing the cost of our own scripting functions at the bottom.
de: Wir können die Kosten für Built-in-Prozesse wie Physik und Audio sowie die Kosten für unsere eigenen Skriptfunktionen unten sehen.
zh_tw: 我們可以看到物理, 音訊等內建流程的消耗, 也可以在底部看到自己腳本功能的消耗.

source: Time spent waiting for various built-in servers may not be counted in the profilers. This is a known bug.
de: Die Wartezeit auf verschiedene Built-in-Server wird in den Profilern möglicherweise nicht berücksichtigt. Dies ist ein bekannter Bug.
zh_tw: 等待各種內建伺服器的時間可能不會被計算在剖析器中. 這是一個已知的錯誤.

source: When a project is running slowly, you will often see an obvious function or process taking a lot more time than others. This is your primary bottleneck, and you can usually increase speed by optimizing this area.
de: Wenn ein Projekt langsam läuft, werden Sie häufig feststellen, dass eine bestimmte Funktion oder ein Prozess viel mehr Zeit benötigt als andere. Dies ist Ihr primäres Bottleneck und Sie können die Geschwindigkeit normalerweise erhöhen, indem Sie diesen Bereich optimieren.
zh_tw: 當一個專案運作緩慢時, 你經常會看到一個明顯的功能或流程比其他功能或流程花費更多的時間. 這是你的主要瓶頸, 你通常可以通過優化這個領域來提高速度.

source: For more info about using Godot's built-in profiler, see :ref:`doc_debugger_panel`.
de: Weitere Informationen zur Verwendung des eingebauten Profilers finden sich unter :ref:`doc_debugger_panel`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: External profilers
de: Externe Profiler
zh_tw: External Files - 外部檔案

source: Although the Godot IDE profiler is very convenient and useful, sometimes you need more power, and the ability to profile the Godot engine source code itself.
de: Obwohl der Godot-IDE-Profiler sehr praktisch und nützlich ist, benötigen Sie manchmal mehr Leistung und die Möglichkeit, für den Quellcode der Godot-Engine selbst ein Profiling-Lauf durchzuführen.
zh_tw: 雖然Godot IDE剖析器非常方便有用, 但有時你需要更強大的功能, 以及對Godot引擎原始程式碼本身進行剖析的能力.

source: You can :ref:`use a number of third-party C++ profilers <doc_using_cpp_profilers>` to do this.
de: Sie können :ref:`eine Reihe von C++-Profilern von Drittanbietern <doc_using_cpp_profilers>` verwenden, um dies zu tun.
zh_tw: 你可以 :ref:`使用若干個協力廠商 C++ 分析器 <doc_using_cpp_profilers>` 來實作。

source: Screenshot of Callgrind
de: Screenshot von Callgrind
zh_tw: Callgrind 的截圖

source: Example results from Callgrind, which is part of Valgrind.
de: Beispielergebnisse von Callgrind, das Teil von Valgrind ist.
zh_tw: 例子結果來自Callgrind, 這是Valgrind的一部分.

source: From the left, Callgrind is listing the percentage of time within a function and its children (Inclusive), the percentage of time spent within the function itself, excluding child functions (Self), the number of times the function is called, the function name, and the file or module.
de: Von links beginnend listet Callgrind folgende Werte auf: Den Prozentsatz der Zeit innerhalb einer Funktion und ihrer untergeordneten Elemente (einschließlich), den Prozentsatz der Zeit innerhalb der Funktion selbst, ohne untergeordnete Funktionen (Self), die Häufigkeit der Funktionsaufrufe, den Funktionsnamen und die Datei oder das Modul.
zh_tw: 從左邊開始,Callgrind正在列出函式及其子函式內的時間百分比(Inclusive), 函式本身(不包括子函式)內的時間百分比(Self), 函式被呼叫的次數, 函式名稱以及檔或模組.

source: In this example, we can see nearly all time is spent under the ``Main::iteration()`` function. This is the master function in the Godot source code that is called repeatedly. It causes frames to be drawn, physics ticks to be simulated, and nodes and scripts to be updated. A large proportion of the time is spent in the functions to render a canvas (66%), because this example uses a 2D benchmark. Below this, we see that almost 50% of the time is spent outside Godot code in ``libglapi`` and ``i965_dri`` (the graphics driver). This tells us the a large proportion of CPU time is being spent in the graphics driver.
de: In diesem Beispiel können wir sehen, dass fast die gesamte Zeit unter der Funktion ``Main::iteration()`` verbracht wird. Dies ist die Hauptfunktion im Godot-Quellcode, die wiederholt aufgerufen wird. Sie sorgt dafür, dass Frames gezeichnet werden, Physik-Ticks simuliert und Nodes und Skripte aktualisiert werden. Ein großer Teil der Zeit entfällt auf die Funktionen zum Rendern eines Canvas (66%), da in diesem Beispiel ein 2D-Benchmark verwendet wird. Darunter sehen wir, dass fast 50% der Zeit außerhalb des Godot-Codes in ``libglapi`` und ``i965_dri`` (dem Grafiktreiber) verbracht wird. Dies zeigt uns, dass ein großer Teil der CPU-Zeit im Grafiktreiber verbracht wird.
zh_tw: 在這個例子中，我們可以看到幾乎所有的時間都花在 `Main::iter()` 函式下。這是 Godot 原始程式碼中被反復呼叫的主函式。它導致影格被繪製、物理週期被類比、節點和腳本被更新。很大一部分時間是花在算繪畫布的函式中（66%），因為這個例子使用的是 2D 基準。下面，我們看到幾乎 50% 的時間都花在了 Godot 程式碼之外的 ``libglapi`` 和 ``i965_dri``（圖形驅動）中。這告訴我們，很大一部分 CPU 時間都花在了圖形驅動上。

source: This is actually an excellent example because, in an ideal world, only a very small proportion of time would be spent in the graphics driver. This is an indication that there is a problem with too much communication and work being done in the graphics API. This specific profiling led to the development of 2D batching, which greatly speeds up 2D rendering by reducing bottlenecks in this area.
de: Dies ist tatsächlich ein hervorragendes Beispiel, denn in einer idealen Welt würde nur ein sehr geringer Teil der Zeit im Grafiktreiber verbracht werden. Dies ist ein Hinweis darauf, dass es ein Problem damit gibt, dass zu viel Kommunikation und Arbeit in der Grafik-API stattfindet. Dieses spezifische Profiling führte zur Entwicklung von 2D-Batching, was zu einer erheblichen Beschleunigung des 2D-Renderings führt, indem Bottlecks in diesem Bereich reduziert wurden.
zh_tw: 這其實是一個很好的例子, 因為在理想的世界裡, 只有很小一部分時間會花在圖形驅動上. 這說明存在一個問題, 就是在圖形API中進行了太多的交流和工作. 這種特殊的剖析導致了2D批次處理的發展, 通過減少這方面的瓶頸, 大大加快了2D算繪的速度.

source: Manually timing functions
de: Manuelle Timing-Funktionen
zh_tw: 數學函式

source: Another handy technique, especially once you have identified the bottleneck using a profiler, is to manually time the function or area under test. The specifics vary depending on the language, but in GDScript, you would do the following:
de: Eine weitere praktische Methode, insbesondere wenn Sie das Bottleneck mithilfe eines Profilers identifiziert haben, besteht darin, die Funktion oder den zu testenden Bereich manuell zu messen. Die Einzelheiten variieren je nach Sprache, aber in GDScript würden Sie Folgendes tun:
zh_tw: 另一個方便的技術, 特別是當你使用分析器確定了瓶頸後, 就是手動為功能或被測區域計時. 具體細節因語言而異, 但在GDScript中, 你可以做如下操作:

source: When manually timing functions, it is usually a good idea to run the function many times (1,000 or more times), instead of just once (unless it is a very slow function). The reason for doing this is that timers often have limited accuracy. Moreover, CPUs will schedule processes in a haphazard manner. Therefore, an average over a series of runs is more accurate than a single measurement.
de: Bei der manuellen Laufzeitmessung von Funktionen ist es in der Regel eine gute Idee, die Funktion mehrmals (1.000 Mal oder öfter) auszuführen, anstatt nur einmal (es sei denn, es handelt sich um eine sehr langsame Funktion). Der Grund dafür ist, dass Laufzeitmesser oft eine begrenzte Genauigkeit haben. Außerdem planen CPUs ihre Prozesse willkürlich. Daher ist ein Durchschnitt über eine Reihe von Läufen genauer als eine einzelne Messung.
zh_tw: 當手動為函式計時時, 通常最好是多次(1000次或更多次)運作該函式, 而不是只運作一次(除非是非常慢的函式). 這樣做的原因是, 計時器的精度往往有限. 此外,CPU會以一種無序的方式調度程序. 因此, 一系列運作的平均值比單次測量更準確.

source: As you attempt to optimize functions, be sure to either repeatedly profile or time them as you go. This will give you crucial feedback as to whether the optimization is working (or not).
de: Wenn Sie versuchen, Funktionen zu optimieren, achten Sie darauf, entweder wiederholt Profilings zu erstellen oder die Laufzeit zu messen, während Sie arbeiten. So erhalten Sie eine wichtige Rückmeldung darüber, ob die Optimierung funktioniert (oder nicht).
zh_tw: 當你嘗試優化功能時, 一定要反復對它們進行剖析或計時. 這將為您提供關鍵的回饋, 說明優化是否有效(或無效).

source: Caches
zh_tw: 快取

source: CPU caches are something else to be particularly aware of, especially when comparing timing results of two different versions of a function. The results can be highly dependent on whether the data is in the CPU cache or not. CPUs don't load data directly from the system RAM, even though it's huge in comparison to the CPU cache (several gigabytes instead of a few megabytes). This is because system RAM is very slow to access. Instead, CPUs load data from a smaller, faster bank of memory called cache. Loading data from cache is very fast, but every time you try and load a memory address that is not stored in cache, the cache must make a trip to main memory and slowly load in some data. This delay can result in the CPU sitting around idle for a long time, and is referred to as a "cache miss".
de: CPU-Caches sind ein weiterer Punkt, der besonders zu beachten ist, vor allem, wenn man die Laufzeit-Ergebnisse zweier verschiedener Versionen einer Funktion vergleicht. Die Ergebnisse können stark davon abhängen, ob sich die Daten im CPU-Cache befinden oder nicht. CPUs laden keine Daten direkt aus dem System-RAM, auch wenn dieser im Vergleich zum CPU-Cache riesig ist (mehrere Gigabyte statt einiger Megabyte). Das liegt daran, dass der Zugriff auf das System-RAM sehr langsam ist. Stattdessen laden die CPUs Daten aus einem kleineren, schnelleren Speicherbereich, dem Cache. Das Laden von Daten aus dem Cache ist sehr schnell, aber jedes Mal, wenn Sie versuchen, eine Speicheradresse zu laden, die nicht im Cache gespeichert ist, muss der Cache eine Reise zum Hauptspeicher machen und langsam Daten laden. Diese Verzögerung kann dazu führen, dass die CPU lange Zeit untätig bleibt, was als "Cache-Miss" bezeichnet wird.
zh_tw: CPU快取是另外一個需要特別注意的東西, 特別是在比較一個函式的兩個不同版本的時序結果時. 其結果可能高度依賴於資料是否在CPU快取中.CPU不會直接從系統RAM中載入資料, 儘管它與CPU快取相比非常巨大(幾千百萬位元組而不是幾百萬位元組). 這是因為系統RAM的存取速度非常慢. 相反,CPU從一個較小, 較快的記憶體庫中載入資料, 稱為cache. 從快取中載入資料的速度非常快, 但每次你試圖載入一個沒有儲存在快取中的記憶體位址時, 快取必須前往主記憶體並緩慢地載入一些資料. 這種延遲會導致CPU長時間閒置, 被稱為 "cache miss".

source: This means that the first time you run a function, it may run slowly because the data is not in the CPU cache. The second and later times, it may run much faster because the data is in the cache. Due to this, always use averages when timing, and be aware of the effects of cache.
de: Das bedeutet, dass eine Funktion beim ersten Mal möglicherweise langsam ausgeführt wird, weil sich die Daten nicht im CPU-Cache befinden. Beim zweiten Mal und später kann sie viel schneller ausgeführt werden, da sich die Daten im Cache befinden. Aus diesem Grund sollten Sie bei der Laufzeitmessung immer Durchschnittswerte verwenden und sich der Auswirkungen des Cache bewusst sein.
zh_tw: 這意味著, 第一次運作一個函式時, 由於資料不在CPU快取中, 它可能運作得很慢. 第二次和以後的時間, 可能運作得更快, 因為資料在快取中. 由於這個原因, 在計時時一定要使用平均數, 並且要注意快取的影響.

source: Understanding caching is also crucial to CPU optimization. If you have an algorithm (routine) that loads small bits of data from randomly spread out areas of main memory, this can result in a lot of cache misses, a lot of the time, the CPU will be waiting around for data instead of doing any work. Instead, if you can make your data accesses localised, or even better, access memory in a linear fashion (like a continuous list), then the cache will work optimally and the CPU will be able to work as fast as possible.
de: Das Verständnis des Caching ist auch für die CPU-Optimierung von entscheidender Bedeutung. Wenn Sie einen Algorithmus (eine Routine) haben, der kleine Datenbits aus zufällig verteilten Bereichen des Hauptspeichers lädt, kann dies zu vielen Cache-Misses führen. In vielen Fällen wartet die CPU auf Daten, anstatt irgendeine Arbeit zu erledigen. Wenn Sie stattdessen Ihre Datenzugriffe lokal halten oder noch besser linear auf den Speicher zugreifen können (wie eine fortlaufende Liste), funktioniert der Cache optimal und die CPU kann so schnell wie möglich arbeiten.
zh_tw: 瞭解快取對於CPU優化也是至關重要的. 如果你有一個演算法(常式), 從主記憶體隨機分佈的區域載入小資料位元, 這可能會導致大量的快取失誤, 很多時候,CPU會在附近等待資料, 而不是做別的工作. 相反, 如果你能使你的資料存取當地語系化, 或者更好的是以線性方式存取記憶體(像一個連續的列表), 那麼快取將以最佳方式工作,CPU將能夠盡可能快地工作.

source: Godot usually takes care of such low-level details for you. For example, the Server APIs make sure data is optimized for caching already for things like rendering and physics. Still, you should be especially aware of caching when writing GDExtensions.
de: Godot kümmert sich normalerweise um solche Low-Level-Details für Sie. Zum Beispiel sorgen die Server-APIs dafür, dass Daten bereits für das Zwischenspeichern von Dingen wie Rendering und Physik optimiert sind. Dennoch sollten Sie beim Schreiben von GDExtensions besonders auf das Caching achten.
zh_tw: Godot通常會為你處理這些低級的細節. 例如, 伺服器API確保資料已經為算繪和物理學等方面的快取進行了優化. 不過, 在使用 :ref:`GDNative <toc-tutorials-gdnative>` 時, 你還是要特別注意快取問題.

source: Languages
de: Sprachen
zh_tw: 語言

source: Godot supports a number of different languages, and it is worth bearing in mind that there are trade-offs involved. Some languages are designed for ease of use at the cost of speed, and others are faster but more difficult to work with.
de: Godot unterstützt eine Reihe verschiedener Sprachen und es ist zu beachten, dass es manchmal Kompromisse braucht. Einige Sprachen sind auf Benutzerfreundlichkeit ausgelegt, was auf Kosten der Geschwindigkeit geht, und andere sind schneller, aber dafür schwieriger zu handhaben.
zh_tw: Godot支援多種不同的語言, 值得注意的是, 其中有一些折衷. 有些語言是以速度為代價而設計的, 便於使用, 而另一些語言速度更快, 但更難使用.

source: Built-in engine functions run at the same speed regardless of the scripting language you choose. If your project is making a lot of calculations in its own code, consider moving those calculations to a faster language.
de: Die integrierten Engine-Funktionen werden unabhängig von der von Ihnen gewählten Skriptsprache mit derselben Geschwindigkeit ausgeführt. Wenn Ihr Projekt viele Berechnungen in seinem eigenen Code durchführt, sollten Sie diese Berechnungen in eine schnellere Sprache verschieben.
zh_tw: 無論你選擇哪種指令碼語言, 內建的引擎函式都以同樣的速度運作. 如果你的專案在自己的程式碼中進行了大量的計算, 可以考慮將這些計算轉移到更快的語言中.

source: :ref:`GDScript <toc-learn-scripting-gdscript>` is designed to be easy to use and iterate, and is ideal for making many types of games. However, in this language, ease of use is considered more important than performance. If you need to make heavy calculations, consider moving some of your project to one of the other languages.
de: :ref:`GDScript <toc-learn-scripting-gdscript>` ist so konzipiert, dass es einfach zu benutzen und zu überarbeiten ist, und ist ideal für die Entwicklung vieler Arten von Spielen. Allerdings wird bei dieser Sprache die Benutzerfreundlichkeit höher bewertet als die Performance. Wenn Sie umfangreiche Berechnungen durchführen müssen, sollten Sie einen Teil Ihres Projekts in eine der anderen Sprachen verlagern.
zh_tw: :ref:`GDScript <toc-learn-scripting-gdscript>` 被設計成易於使用和反覆運算的語言, 是製作多種型別遊戲的理想選擇. 然而, 在這種語言中, 易用性被認為比性能更重要. 如果您需要進行繁重的計算, 請考慮將您的一些專案轉移到其他語言中.

source: :ref:`C# <toc-learn-scripting-C#>` is popular and has first-class support in Godot. It offers a good compromise between speed and ease of use. Beware of possible garbage collection pauses and leaks that can occur during gameplay, though. A common approach to workaround issues with garbage collection is to use *object pooling*, which is outside the scope of this guide.
de: :ref:`C# <toc-learn-scripting-C#>` ist beliebt und wird von Godot erstklassig unterstützt. Es bietet einen guten Kompromiss zwischen Geschwindigkeit und Benutzerfreundlichkeit. Achten Sie jedoch auf mögliche Pausen bei der Garbage Collection und Lecks, die während des Spielens auftreten können. Ein gängiger Ansatz zur Umgehung von Problemen mit der Garbage Collection ist die Verwendung von *Object Pooling*, was jedoch außerhalb des Rahmens dieses Handbuchs liegt.
zh_tw: :ref:`C # <toc-learn-scripting-C#>` 很受歡迎, 在Godot中得到了一流的支援. 它在速度和易用性之間提供了一個很好的折中. 不過要注意遊戲過程中可能出現的垃圾收集暫停和洩漏. 解決垃圾收集問題的一個常見方法是使用 *物件集區*, 這不在本指南的範圍內.

source: Other languages
de: Andere Sprachen
zh_tw: 設計語言

source: Third parties provide support for several other languages, including `Rust <https://github.com/godot-rust/gdext>`_.
de: Drittanbieter bieten Unterstützung für verschiedene andere Sprachen, darunter `Rust <https://github.com/godot-rust/gdext>`_.
zh_tw: 協力廠商提供對其他幾種語言的支援，包括 `Rust <https://github.com/godot-rust/godot-rust>`_ 和 `Javascript <https://github.com/GodotExplorer/ECMAScript>`_。

source: Godot is written in C++. Using C++ will usually result in the fastest code. However, on a practical level, it is the most difficult to deploy to end users' machines on different platforms. Options for using C++ include GDExtensions and :ref:`custom modules <doc_custom_modules_in_cpp>`.
de: Godot ist in C++ geschrieben. Die Verwendung von C++ führt in der Regel zu dem schnellsten Code. In der Praxis ist es jedoch am schwierigsten, ihn auf den Rechnern der Endbenutzer auf verschiedenen Plattformen einzusetzen. Optionen für die Verwendung von C++ sind GDExtensions und :ref:`custom modules <doc_custom_modules_in_cpp>`.
zh_tw: Godot是用C++編寫的. 使用C++通常會帶來最快的程式碼. 然而, 在實際操作層面上, 它是最難在不同平臺上部署到終端使用者的機器上的. 使用C++的選項包括 :ref:`GDNative <toc-tutorials-gdnative>` 和 :ref:`custom modules <doc_custom_modules_in_c++>` .

source: Threads
zh_tw: 執行緒

source: Consider using threads when making a lot of calculations that can run in parallel to each other. Modern CPUs have multiple cores, each one capable of doing a limited amount of work. By spreading work over multiple threads, you can move further towards peak CPU efficiency.
de: Erwägen Sie die Verwendung von Threads, wenn Sie viele Berechnungen durchführen, die parallel zueinander laufen können. Moderne CPUs haben mehrere Kerne, von denen jeder eine begrenzte Menge an Arbeit erledigen kann. Indem Sie die Arbeit auf mehrere Threads verteilen, können Sie die CPU-Effizienz weiter steigern.
zh_tw: 在進行大量的計算時, 考慮使用執行緒, 這些計算可以相互並行運作. 現代CPU有多個核心, 每個核心能做的工作量有限. 通過將工作分散在多個執行緒上, 你可以進一步向CPU的峰值效率邁進.

source: The disadvantage of threads is that you have to be incredibly careful. As each CPU core operates independently, they can end up trying to access the same memory at the same time. One thread can be reading to a variable while another is writing: this is called a *race condition*. Before you use threads, make sure you understand the dangers and how to try and prevent these race conditions. Threads can make debugging considerably more difficult.
de: Der Nachteil von Threads ist, dass man sehr vorsichtig sein muss. Da jeder CPU-Kern unabhängig arbeitet, kann es passieren, dass sie versuchen, gleichzeitig auf denselben Speicher zuzugreifen. Ein Thread kann auf eine Variable zugreifen, während ein anderer schreibt: Dies wird als *Race Condition* bezeichnet. Bevor Sie Threads verwenden, sollten Sie sich über die Gefahren im Klaren sein und wissen, wie Sie diese Race Conditions verhindern können. Threads können das Debuggen erheblich erschweren.
zh_tw: 執行緒的缺點是，你必須非常小心。由於每個 CPU 核心都是獨立運作的，它們最終可能會在同一時間試圖存取相同的記憶體。一個執行緒可以在另一個執行緒在寫的時候讀取一個變數：這被稱為*競態條件*。在你使用執行緒之前，請確保你瞭解這些危險以及如何嘗試和防止這些競態條件。

source: For more information on threads, see :ref:`doc_using_multiple_threads`.
de: Für weitere Informationen zu Threads siehe :ref:`doc_using_multiple_threads`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: Although Nodes are an incredibly powerful and versatile concept, be aware that every node has a cost. Built-in functions such as ``_process()`` and ``_physics_process()`` propagate through the tree. This housekeeping can reduce performance when you have a very large numbers of nodes (how many exactly depends on the target platform and can range from thousands to tens of thousands so ensure that you profile performance on all target platforms during development).
de: Obwohl Nodes ein unglaublich mächtiges und vielseitiges Konzept sind, sollte man sich darüber im Klaren sein, dass jeder Node Kosten verursacht. Built-in-Funktionen wie ``_process()`` und ``_physics_process()`` pflanzen sich durch den Baum fort. Dieses "Housekeeping" kann die Performance verringern, wenn Sie eine sehr große Anzahl von Nodes haben (wie viele genau, hängt von der Zielplattform ab und kann von Tausenden bis zu Zehntausenden reichen, also stellen Sie sicher, dass Sie während der Entwicklung ein Performance-Profiling auf allen Zielplattformen erstellen).
zh_tw: 雖然節點是一個非常強大和通用的概念, 但請注意, 每個節點都是有代價的. 內建的函式, 如 `_process()` 和 `_physics_process()` 會在樹中傳播. 當你有非常多的節點(通常是成千上萬的節點)時, 這種內務管理會降低性能.

source: Each node is handled individually in the Godot renderer. Therefore, a smaller number of nodes with more in each can lead to better performance.
de: Jeder Node wird im Godot-Renderer einzeln behandelt. Daher kann eine geringere Anzahl von Nodes mit jeweils Inhalt zu einer besseren Performance führen.
zh_tw: 在Godot算繪器中, 每個節點都是單獨處理的. 因此, 較少的節點數量與較多的每個節點可以帶來更好的性能.
