Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/general_optimization.po
Languages: de, zh_tw

source: As with design, you should concentrate your efforts first on making sure the algorithms and data structures are the best they can be. Data access should be local (to make best use of CPU cache), and it can often be better to use compact storage of data (again, always profile to test results). Often, you precalculate heavy computations ahead of time. This can be done by performing the computation when loading a level, by loading a file containing precalculated data or simply by storing the results of complex calculations into a script constant and reading its value.
de: Wie beim Entwurf sollten Sie sich zunächst darauf konzentrieren, dass die Algorithmen und Datenstrukturen so gut wie möglich sind. Der Datenzugriff sollte lokal erfolgen (um den CPU-Cache optimal zu nutzen), und oft kann es besser sein, die Daten kompakt zu speichern (nochmal: immer profilen, um die Ergebnisse zu testen). Häufig berechnen Sie aufwendige Berechnungen im Voraus. Dies kann geschehen, indem man die Berechnung beim Laden eines Levels durchführt, eine Datei mit vorberechneten Daten lädt oder einfach die Ergebnisse komplexer Berechnungen in einer Skriptkonstante speichert und deren Wert ausliest.
zh_tw: 與設計一樣, 你應該首先集中精力確保演算法和資料結構是最好的. 資料存取應該是局部的(以最好地利用CPU快取), 而且使用緊湊的資料儲存通常會更好(同樣, 總是對測試結果進行分析). 通常情況下, 你會提前預計算繁重的計算. 這可以通過在載入關卡時執行計算, 載入包含預計算資料的檔或簡單地將複雜的計算結果儲存到腳本常數中並讀取其值來實作.

source: Once algorithms and data are good, you can often make small changes in routines which improve performance. For instance, you can move some calculations outside of loops or transform nested ``for`` loops into non-nested loops. (This should be feasible if you know a 2D array's width or height in advance.)
de: Sobald die Algorithmen und Daten gut sind, können Sie häufig kleine Änderungen an Routinen vornehmen, um die Performance zu verbessern. Sie können beispielsweise einige Berechnungen aus Schleifen heraus schieben oder verschachtelte ``for``-Schleifen in nicht verschachtelte Schleifen umwandeln. (Dies sollte möglich sein, wenn Sie die Breite oder Höhe eines 2D-Arrays im Voraus kennen.)
zh_tw: 如果確認演算法和資料沒有問題，你通常可以在常式中做一些小的改變來提高性能。例如，可以將一些計算移到迴圈之外，或者將巢狀的 ``for`` 迴圈轉化為非巢狀的迴圈。（如果你事先知道 2D 陣列的寬和高，應該就是可行的。）

source: Always retest your timing/bottlenecks after making each change. Some changes will increase speed, others may have a negative effect. Sometimes, a small positive effect will be outweighed by the negatives of more complex code, and you may choose to leave out that optimization.
de: Testen Sie das Timing bzw. mögliche Bottlenecks erneut nach jeder Änderung. Einige Änderungen erhöhen die Geschwindigkeit, andere können sich negativ auswirken. Manchmal wird ein kleiner positiver Effekt durch die negativen Aspekte komplexeren Codes aufgewogen, und Sie können diese Optimierung weglassen.
zh_tw: 每次更改後, 一定要重新測試您的時長和瓶頸. 有些改變會提高速度, 有些則可能會產生負面效果. 有時, 一個小的積極效果會被更複雜的程式碼的負面效果所抵消, 可以選擇不做這種優化.

source: Appendix
de: Anhang
zh_tw: 附錄

source: Bottleneck math
de: Bottleneck-Mathematik
zh_tw: 瓶頸數學

source: The proverb *"a chain is only as strong as its weakest link"* applies directly to performance optimization. If your project is spending 90% of the time in function ``A``, then optimizing ``A`` can have a massive effect on performance.
de: Das Sprichwort "Eine Kette ist nur so stark wie ihr schwächstes Glied" gilt direkt für die Performanceoptimierung. Wenn Ihr Projekt 90% der Zeit in Funktion ``A`` verbringt, kann die Optimierung von ``A`` einen massiven Einfluss auf die Performance haben.
zh_tw: 諺語 *"一條鏈子的強度取決於其最薄弱的環節 "* 直接適用於性能優化. 如果你的專案90%的時間都花在功能 ``A`` 上, 那麼優化 ``A`` 就會對性能產生巨大影響.

source: In this example, improving this bottleneck ``A`` by a factor of 9× decreases overall frame time by 5× while increasing frames per second by 5×.
de: In diesem Beispiel wird das Bottleneck ``A`` um den Faktor 9x verbessert, was die gesamte Frame-Laufzeit um das 5-fache verringert und somit die Frames pro Sekunde um das 5-fache erhöht.
zh_tw: 在這個例子中, 將這個瓶頸 ``A`` 改進9倍, 總體影格時間減少5倍, 同時每秒影格數增加5倍.

source: However, if something else is running slowly and also bottlenecking your project, then the same improvement can lead to less dramatic gains:
de: Wenn jedoch etwas anderes langsam läuft und Ihr Projekt ausbremst, kann dieselbe Verbesserung zu weniger dramatischen Erfolgen führen:
zh_tw: 但是, 如果其他東西運作緩慢, 也給你的專案帶來了瓶頸, 那麼同樣的改進只會帶來不那麼顯著的收益:

source: In this example, even though we have hugely optimized function ``A``, the actual gain in terms of frame rate is quite small.
de: In diesem Beispiel ist der tatsächliche Gewinn in Bezug auf die Framerate recht gering, obwohl wir die Funktion ``A`` enorm optimiert haben.
zh_tw: 在這個例子中, 儘管我們對函式 ``A`` 進行了大量的優化, 但實際的影格率收益卻相當小.

source: In games, things become even more complicated because the CPU and GPU run independently of one another. Your total frame time is determined by the slower of the two.
de: In Spielen werden die Dinge noch komplizierter, weil CPU und GPU unabhängig voneinander laufen. Ihre gesamte Frame-Laufzeit wird durch die langsamere der beiden bestimmt.
zh_tw: 在遊戲中, 事情變得更加複雜, 因為CPU和GPU彼此獨立運作. 你的總影格時間是由兩者中較慢的那一個決定的.

source: In this example, we optimized the CPU hugely again, but the frame time didn't improve because we are GPU-bottlenecked.
de: In diesem Beispiel haben wir die CPU erneut enorm optimiert, aber die Frame-Laufzeit hat sich nicht verbessert, da wir ein GPU-Bottleneck haben.
zh_tw: 在這個例子中, 我們又對CPU進行了大量的優化, 但是影格數並沒有提高, 因為是GPU瓶頸.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
