Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/general_optimization.po
Languages: de, zh_tw

source: General optimization tips
de: Generelle Optimierungs-Tipps
zh_tw: **通用選項**

source: Introduction
de: Einführung
zh_tw: 前言

source: In an ideal world, computers would run at infinite speed. The only limit to what we could achieve would be our imagination. However, in the real world, it's all too easy to produce software that will bring even the fastest computer to its knees.
de: In einer idealen Welt würden Computer mit unendlicher Geschwindigkeit laufen, und die einzige Grenze für das, was wir erreichen könnten, wäre unsere Vorstellungskraft. In der realen Welt ist es jedoch allzu einfach, Software zu erstellen, die selbst den schnellsten Computer in die Knie zwingt.
zh_tw: 在一個理想的世界裡, 電腦將以無限的速度運作. 我們唯一的限制是我們的想像力. 然而, 在現實世界中, 製造出能讓最快的電腦也屈服的軟體實在是太容易了.

source: Thus, designing games and other software is a compromise between what we would like to be possible, and what we can realistically achieve while maintaining good performance.
de: Das Entwerfen von Spielen und anderer Software ist somit ein Kompromiss zwischen dem, was wir möchten, und dem, was wir realistisch erreichen können, und dabei eine zufriedenstellende Performance beizubehalten.
zh_tw: 因此, 設計遊戲和其他軟體是在我們希望可能的情況下, 和在保持良好性能的前提下, 能夠實際實作的情況之間的折中.

source: To achieve the best results, we have two approaches:
de: Um die besten Ergebnisse zu erzielen, haben wir zwei Ansätze:
zh_tw: 要達到最佳效果, 我們有兩種方法:

source: Work faster.
de: Schneller arbeiten.
zh_tw: 工作更快.

source: Work smarter.
de: Intelligenter arbeiten.
zh_tw: 工作更智慧。

source: And preferably, we will use a blend of the two.
de: Und idealerweise verwenden wir eine Mischung aus beiden.
zh_tw: 我們最好將兩者混合使用.

source: Smoke and mirrors
de: Schall und Rauch
zh_tw: 節點與資源

source: Part of working smarter is recognizing that, in games, we can often get the player to believe they're in a world that is far more complex, interactive, and graphically exciting than it really is. A good programmer is a magician, and should strive to learn the tricks of the trade while trying to invent new ones.
de: Zu einer intelligenteren Arbeitsweise gehört auch die Erkenntnis, dass wir in Spielen den Spieler oft glauben machen können, er befände sich in einer Welt, die weitaus komplexer, interaktiver und grafisch aufregender ist, als sie tatsächlich ist. Ein guter Programmierer ist ein Zauberer und sollte sich bemühen, die Tricks seines Handwerks zu lernen, während er versucht, neue zu erfinden.
zh_tw: 更聰明地工作的一部分是認識到, 在遊戲中, 我們經常可以讓玩家相信他們所處的世界比實際情況要複雜得多, 互動性強, 圖形上也更刺激. 一個好的程式師是一個魔術師, 應該努力學習行業的技巧, 同時努力發明新的技巧.

source: The nature of slowness
de: Die Natur der Langsamkeit
zh_tw: 緩慢的本質

source: To the outside observer, performance problems are often lumped together. But in reality, there are several different kinds of performance problems:
de: Für den externen Beobachter werden Performanceprobleme häufig über einen Kamm geschoren. In Wirklichkeit gibt es jedoch verschiedene Arten von Performanceproblemen zu differenzieren:
zh_tw: 在外界觀察者看來, 業績問題往往被歸納在一起. 但實際上, 業績問題有幾種不同的型別:

source: A slow process that occurs every frame, leading to a continuously low frame rate.
de: Ein langsamer Prozess, der bei jedem Frame auftritt und zu einer kontinuierlich niedrigen Framerate führt.
zh_tw: 每一影格都發生的緩慢過程, 導致持續的低影格率.

source: An intermittent process that causes "spikes" of slowness, leading to stalls.
de: Ein zeitweise einsetzender Prozess, der Überlastungsspitzen verursacht und damit Verzögerungen hervorruft.
zh_tw: 一個斷斷續續的過程, 造成緩慢的到達 "巔峰", 導致停滯不前.

source: A slow process that occurs outside of normal gameplay, for instance, when loading a level.
de: Ein langwieriger Prozess, der außerhalb des normalen Spielablaufs stattfindet, z.B. beim Laden eines Levels.
zh_tw: 在正常遊戲之外發生的緩慢程序, 例如載入關卡時.

source: Each of these are annoying to the user, but in different ways.
de: Jedes davon ist für den Benutzer ärgerlich, aber auf unterschiedliche Weise.
zh_tw: 每一種都會給使用者帶來煩惱, 但方式不同.

source: Measuring performance
de: Messen der Performance
zh_tw: 效能

source: Probably the most important tool for optimization is the ability to measure performance - to identify where bottlenecks are, and to measure the success of our attempts to speed them up.
de: Das wahrscheinlich wichtigste Instrument zur Optimierung ist die Möglichkeit, die Performance zu messen - um festzustellen, wo Bottlenecks liegen, und um den Erfolg unserer Versuche zu messen, sie zu beschleunigen.
zh_tw: 對於優化來說, 最重要的工具可能是衡量性能的能力--找出瓶頸所在, 並衡量我們突破瓶頸的嘗試是否成功.

source: There are several methods of measuring performance, including:
de: Es gibt mehrere Optionen zur Performancemessung, wie:
zh_tw: 有幾種衡量性能的方法, 包括:

source: Putting a start/stop timer around code of interest.
de: Einen Start/Stop-Timer um den zu untersuchenden Code herum zu setzen.
zh_tw: 在感興趣的程式碼周圍放置一個 開啟/停止 的計時器.

source: Using the :ref:`Godot profiler <doc_the_profiler>`.
de: Verwendung des :ref:`Godot-Profilers <doc_the_profiler>`.
zh_tw: 使用現有的 Godot 材質

source: Using :ref:`external CPU profilers <doc_using_cpp_profilers>`.
de: Verwendung :ref:`externer CPU-Profiler <doc_using_cpp_profilers>`.
zh_tw: 使用 :ref:`外部 CPU 分析器 <doc_using_cpp_profilers>` 。

source: Using external GPU profilers/debuggers such as `NVIDIA Nsight Graphics <https://developer.nvidia.com/nsight-graphics>`__, `Radeon GPU Profiler <https://gpuopen.com/rgp/>`__ or `Intel Graphics Performance Analyzers <https://www.intel.com/content/www/us/en/developer/tools/graphics-performance-analyzers/overview.html>`__.
de: Verwendung externer GPU-Profiler/Debugger wie `NVIDIA Nsight Graphics <https://developer.nvidia.com/nsight-graphics>`__, `Radeon GPU Profiler <https://gpuopen.com/rgp/>`__ oder `Intel Graphics Performance Analyzers <https://www.intel.com/content/www/us/en/developer/tools/graphics-performance-analyzers/overview.html>`__.
zh_tw: 使用外部 GPU 分析器或除錯器，例如： `NVIDIA Nsight Graphics <https://developer.nvidia.com/nsight-graphics>`__ ， `Radeon GPU Profiler <https://gpuopen.com/rgp/>`__ 或 `Intel Graphics Performance Analyzers <https://www.intel.com/content/www/us/en/developer/tools/graphics-performance-analyzers/overview.html>`__ 。

source: Checking the frame rate (with V-Sync disabled). Third-party utilities such as `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows) or `MangoHud <https://github.com/flightlessmango/MangoHud>`__ (Linux) can also be useful here.
de: Überprüfung der Framerate (bei deaktiviertem V-Sync). Hilfsprogramme von Drittanbietern wie `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows) oder `MangoHud <https://github.com/flightlessmango/MangoHud>`__ (Linux) können hier ebenfalls nützlich sein.
zh_tw: 查看影格率（禁用 V-Sync ）。也可以用協力廠商工具，如 `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ （Windows）or `MangoHud <https://github.com/flightlessmango/MangoHud>`__ （Linux）。

source: Using an unofficial `debug menu add-on <https://github.com/godot-extended-libraries/godot-debug-menu>`__.
de: Verwendung eines inoffiziellen `Debug-Menü-Addons <https://github.com/godot-extended-libraries/godot-debug-menu>`__.
zh_tw: 使用一個非官方的`除錯功能表附加元件 <https://github.com/godot-extended-libraries/godot-debug-menu>`__.

source: Be very aware that the relative performance of different areas can vary on different hardware. It's often a good idea to measure timings on more than one device. This is especially the case if you're targeting mobile devices.
de: Beachten Sie insbesondere, dass die relative Performance der verschiedenen Bereiche auf unterschiedlicher Hardware variieren kann. Es ist oft eine gute Idee, die Laufzeiten auf mehr als einem Gerät zu messen. Dies gilt insbesondere, wenn Sie für mobile Geräte entwickeln.
zh_tw: 要非常清楚, 不同區域的相對性能在不同的硬體上會有所不同. 在一個以上的裝置上測量計時通常是個好主意. 如果你的目標是移動裝置, 情況尤其如此.

source: Limitations
de: Einschränkungen
zh_tw: 限制

source: CPU profilers are often the go-to method for measuring performance. However, they don't always tell the whole story.
de: CPU-Profiler sind oft das Mittel der Wahl zur Performancemessung. Sie geben jedoch nicht zwangsläufig Rückschlüsse auf alle Probleme.
zh_tw: CPU分析器通常是測量性能的常用方法. 然而, 它們並不總是能反映全部情況.

source: Bottlenecks are often on the GPU, "as a result" of instructions given by the CPU.
de: Bottlenecks treten häufig auf der GPU auf, und zwar "als Folge" der von der CPU erteilten Anweisungen.
zh_tw: 瓶頸往往在GPU上,"由於"CPU給出的指令.

source: Spikes can occur in the operating system processes (outside of Godot) "as a result" of instructions used in Godot (for example, dynamic memory allocation).
de: Spitzen können in den Betriebssystemprozessen (außerhalb von Godot) "als Ergebnis" von Anweisungen auftreten, die in Godot verwendet werden (z.B. dynamische Speicherallokation).
zh_tw: 由於在Godot中使用的指令(例如, 動態記憶體分配)"導致" 作業系統程序(在Godot之外)可能出現巔峰.

source: You may not always be able to profile specific devices like a mobile phone due to the initial setup required.
de: Aufgrund der erforderlichen initialen Einrichtung ist es nicht immer möglich, Profiling für bestimmte Geräte wie ein Mobiltelefon durchzuführen.
zh_tw: 由於需要進行初始設定, 您可能並不總是能夠對特定裝置進行配置, 例如手機.

source: You may have to solve performance problems that occur on hardware you don't have access to.
de: Möglicherweise müssen Performanceprobleme gelöst werden, die auf Hardware auftreten, auf die Sie keinen Zugriff haben.
zh_tw: 您可能需要解決您無法存取的硬體上出現的性能問題.

source: As a result of these limitations, you often need to use detective work to find out where bottlenecks are.
de: Aufgrund dieser Einschränkungen müssen Sie oft Detektivarbeit leisten, um herauszufinden, wo die Bottlenecks liegen.
zh_tw: 由於這些限制, 你經常需要使用偵測工作來找出瓶頸所在.

source: Detective work
de: Detektivarbeit
zh_tw: Detect 3d 選項

source: Detective work is a crucial skill for developers (both in terms of performance, and also in terms of bug fixing). This can include hypothesis testing, and binary search.
de: Detektivarbeit ist eine entscheidende Fähigkeit für Entwickler (sowohl in Bezug auf die Performance als auch in Bezug auf das Beheben von Bugs). Dies kann Hypothesentests und Binärsuche umfassen.
zh_tw: 偵測工作對於開發人員來說是一項至關重要的技能(無論是在性能方面, 還是在錯誤修復方面). 這可以包括假設測試和二進位搜索.

source: Hypothesis testing
de: Hypothesentests
zh_tw: 型別轉換

source: Say, for example, that you believe sprites are slowing down your game. You can test this hypothesis by:
de: Nehmen wir zum Beispiel an, Sie glauben, dass Sprites Ihr Spiel verlangsamen. Sie können diese Hypothese testen, indem Sie:
zh_tw: 比如說, 你認為精靈使你的遊戲速度變慢. 可以通過以下方式來驗證這個假設:

source: Measuring the performance when you add more sprites, or take some away.
de: die Performance messen, indem Sie weitere Sprites hinzufügen oder einige entfernen.
zh_tw: 當你新增更多的精靈或移除一些精靈時, 測量其性能.

source: This may lead to a further hypothesis: does the size of the sprite determine the performance drop?
de: Dies kann zu einer weiteren Hypothese führen: Bestimmt die Größe des Sprites den Performanceverlust?
zh_tw: 這可能會引出一個進一步的假設: 精靈的大小是否決定了性能的下降？

source: You can test this by keeping everything the same, but changing the sprite size, and measuring performance.
de: Sie können dies testen, indem Sie alles gleich lassen, aber die Sprite-Größe ändern, und die Performance messen.
zh_tw: 你可以通過保持一切不變, 但改變精靈的大小, 並測量性能來進行測試.

source: Binary search
de: Binärsuche
zh_tw: 二分搜尋

source: If you know that frames are taking much longer than they should, but you're not sure where the bottleneck lies. You could begin by commenting out approximately half the routines that occur on a normal frame. Has the performance improved more or less than expected?
de: Wenn Sie wissen, dass Frames viel länger brauchen, als sie sollten, Sie aber nicht sicher sind, wo das Bottleneck liegt. Sie könnten damit beginnen, etwa die Hälfte der Routinen auszukommentieren, die bei einem normalen Frame auftreten. Hat sich die Performance mehr oder weniger als erwartet verbessert?
zh_tw: 如果你知道影格的時間比它們應該的時間長得多, 但你不確定瓶頸在哪裡. 你可以先注釋掉正常影格上發生的大約一半常式, 測量性能的提升比預期的多還是少？

source: Once you know which of the two halves contains the bottleneck, you can repeat this process until you've pinned down the problematic area.
de: Sobald Sie wissen, in welcher der beiden Hälften sich das Bottleneck befindet, können Sie diesen Vorgang wiederholen, bis Sie den problematischen Bereich ausfindig gemacht haben.
zh_tw: 一旦你知道兩半中的哪一半包含瓶頸, 你可以重複這個過程, 直到你確定問題區域.

source: Profilers
de: Profiler
zh_tw: 分析工具

source: Profilers allow you to time your program while running it. Profilers then provide results telling you what percentage of time was spent in different functions and areas, and how often functions were called.
de: Mit Profilern können Sie die Laufzeit Ihres Programms messen. Profiler liefern dann Ergebnisse, die Ihnen sagen, wie viel Prozent der Zeit in verschiedenen Funktionen und Bereichen verbracht wurde und wie oft Funktionen aufgerufen wurden.
zh_tw: 分析器允許你在運作程式時對其進行計時. 然後, 分析器提供結果, 告訴你在不同的功能和區域所花費的時間百分比, 以及功能被呼叫的頻率.

source: This can be very useful both to identify bottlenecks and to measure the results of your improvements. Sometimes, attempts to improve performance can backfire and lead to slower performance. **Always use profiling and timing to guide your efforts.**
de: Das kann sehr nützlich sein, um Bottlenecks zu identifizieren und die Ergebnisse von Optimierungsansätzen zu beobachten. Manche Ansätze können sich als suboptimal herausstellen und letzlichen zu einer noch schwächeren Performance führen. **Verwenden Sie immer Profiling und Timing, um zielgerichtet vorzugehen.**
zh_tw: 這對於確定瓶頸和衡量改進的結果都非常有用. 有時, 改善性能的嘗試可能會適得其反, 導致性能變慢. **始終使用分析器和時長來指導您的工作**

source: For more info about using Godot's built-in profiler, see :ref:`doc_the_profiler`.
de: Weitere Informationen über die Verwendung des in Godot eingebauten Profilers finden Sie unter :ref:`doc_the_profiler`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: Principles
de: Prinzipien
zh_tw: 原則

source: `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__ said:
de: `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__ sagte einmal:
zh_tw: `SOLID <https://zh.wikipedia.org/zh-tw/SOLID_(%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E8%AE%BE%E8%AE%A1)>`_

source: *Programmers waste enormous amounts of time thinking about, or worrying about, the speed of noncritical parts of their programs, and these attempts at efficiency actually have a strong negative impact when debugging and maintenance are considered. We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil. Yet we should not pass up our opportunities in that critical 3%.*
de: *Programmierer verschwenden enorm viel Zeit damit, über die Geschwindigkeit unkritischer Teile ihrer Programme nachzudenken bzw. sich darüber Gedanken zu machen, und diese Versuche der Effizienzsteigerung wirken sich tatsächlich stark negativ aus, wenn Debugging und Wartung in Betracht gezogen werden. Wir sollten kleine Verbesserungen vergessen, etwa in 97% der Fälle: Vorzeitige Optimierung ist die Wurzel allen Übels. Dennoch sollten wir unsere Gelegenheiten bei diesen kritischen 3% nicht verpassen.*
zh_tw: *程式師浪費了大量的時間去考慮或者擔心程式中非關鍵部分的速度, 如果考慮到除錯和維護, 這些提高效率的嘗試實際上會產生強烈的負面影響. 我們應該忘掉小效率, 比如說97%左右的時間: 過早的優化是萬惡之源. 然而不應該放棄那關鍵的3%的機會*

source: The messages are very important:
de: Die Botschaften hier sind sehr wichtig:
zh_tw: 這些消息非常重要:

source: Developer time is limited. Instead of blindly trying to speed up all aspects of a program, we should concentrate our efforts on the aspects that really matter.
de: Entwicklungszeit ist begrenzt. Anstatt blindlings zu versuchen, jeden noch so kleinen Aspekt eines Programms zu beschleunigen, sollten wir uns auf diejenen Aspekte konzentrieren, die wirklich wichtig sind.
zh_tw: 開發者的時間是有限的. 與其盲目地試圖加快一個程式的所有方面, 應該集中精力在真正重要的方面.

source: Efforts at optimization often end up with code that is harder to read and debug than non-optimized code. It is in our interests to limit this to areas that will really benefit.
de: Optimierungsversuche führen häufig zu Code, der schwieriger zu lesen und zu debuggen ist als nicht optimierter Code. Es liegt im eigenen Interesse, dies auf Bereiche zu beschränken, die wesentlich davon profitieren.
zh_tw: 在優化方面的努力, 最終往往會得到比非優化程式碼更難閱讀和除錯的程式碼. 將這種情況限制在真正受益的領域更符合我們的利益.

source: Just because we *can* optimize a particular bit of code, it doesn't necessarily mean that we *should*. Knowing when and when not to optimize is a great skill to develop.
de: Nur weil wir einen bestimmten Teil des Codes optimieren *können*, heißt das nicht unbedingt, dass wir das auch tun *sollten*. Zu wissen, wann man optimieren sollte und wann nicht, ist eine wichtige Fähigkeit.
zh_tw: 僅僅因為我們 *可以* 優化某段程式碼, 並不一定意味著 *應該* . 知道什麼時候優化, 什麼時候不優化, 是一項更好的技能.

source: One misleading aspect of the quote is that people tend to focus on the subquote *"premature optimization is the root of all evil"*. While *premature* optimization is (by definition) undesirable, performant software is the result of performant design.
de: Ein irreführender Aspekt des Zitats ist, dass sich Leute eher auf das Unterzitat *"vorzeitige Optimierung ist die Wurzel allen Übels"* fokussieren. Während *vorzeitige* Optimierung (per Definition) unerwünscht ist, ist performante Software das Ergebnis eines performanten Designs.
zh_tw: 這句話有一個誤導性的地方, 就是人們往往把注意力集中在 *"過早的優化是萬惡之源 "* 這句話上. 雖然過早的優化是不可取的, 但高性能的軟體是高性能設計的結果.

source: Performant design
de: Performantes Design
zh_tw: 效能

source: The danger with encouraging people to ignore optimization until necessary, is that it conveniently ignores that the most important time to consider performance is at the design stage, before a key has even hit a keyboard. If the design or algorithms of a program are inefficient, then no amount of polishing the details later will make it run fast. It may run *faster*, but it will never run as fast as a program designed for performance.
de: Die Gefahr bei der Empfehlung, Optimierungen so lange zu ignorieren, bis sie notwendig sind, besteht darin, dass dabei übersehen wird, dass der wichtigste Zeitpunkt für die Berücksichtigung der Performance in der Entwurfsphase liegt, bevor überhaupt eine Taste auf der Tastatur gedrückt wurde. Wenn das Design oder die Algorithmen eines Programms ineffizient sind, dann wird keine noch so kleine Detailverbesserung dafür sorgen, dass es schnell läuft. Es kann zwar *schneller* laufen, aber niemals so schnell wie ein Programm, das auf Performance ausgelegt ist.
zh_tw: 鼓勵人們在必要時忽略優化的危險在於, 它很方便地忽略了考慮性能的最重要時間是在設計階段, 甚至在一個鍵碰到鍵盤之前. 如果一個程式的設計或演算法是低效的, 那麼以後再多的細節修飾也不會使它運作得很快. 它可能運作得更快, 但永遠不會像為性能而設計的程式那樣快.

source: This tends to be far more important in game or graphics programming than in general programming. A performant design, even without low-level optimization, will often run many times faster than a mediocre design with low-level optimization.
de: In der Spiele- und Grafikprogrammierung ist das weitaus wichtiger als in der allgemeinen Programmierung. Ein performantes Design läuft auch ohne Low-Level-Optimierung oft um ein Vielfaches schneller als ein mittelmäßiges Design mit Low-Level-Optimierung.
zh_tw: 這在遊戲或圖形程式設計中往往比在一般程式設計中更為重要. 一個高性能的設計, 即使沒有低水平的優化, 通常也會比一個低水平優化的平庸設計快很多倍.

source: Incremental design
de: Inkrementelles Design
zh_tw: 漸進更新／修補

source: Of course, in practice, unless you have prior knowledge, you are unlikely to come up with the best design the first time. Instead, you'll often make a series of versions of a particular area of code, each taking a different approach to the problem, until you come to a satisfactory solution. It's important not to spend too much time on the details at this stage until you have finalized the overall design. Otherwise, much of your work will be thrown out.
de: In der Praxis ist es natürlich unwahrscheinlich, dass man ohne Vorkenntnisse gleich beim ersten Mal den besten Entwurf findet. Stattdessen werden Sie oft eine Reihe von Versionen eines bestimmten Bereichs des Codes erstellen, die jeweils einen anderen Ansatz für das Problem verfolgen, bis Sie zu einer zufriedenstellenden Lösung kommen. Es ist wichtig, dass Sie in dieser Phase nicht zu viel Zeit auf die Details verwenden, bis Sie den Gesamtentwurf fertiggestellt haben. Andernfalls wird ein Großteil Ihrer Arbeit verworfen werden.
zh_tw: 當然, 在實踐中, 除非你事先有知識, 否則你不可能在第一次就拿出最好的設計. 相反, 你往往會對某一特定區域的程式碼做出一系列版本, 每一個版本都採取不同的方法來解決這個問題, 直到你得出一個滿意的解決方案. 重要的是, 在你最終確定整體設計之前, 在這個階段不要在細節上花費太多時間. 否則, 你的很多工作都會被淘汰.

source: It's difficult to give general guidelines for performant design because this is so dependent on the problem. One point worth mentioning though, on the CPU side, is that modern CPUs are nearly always limited by memory bandwidth. This has led to a resurgence in data-oriented design, which involves designing data structures and algorithms for *cache locality* of data and linear access, rather than jumping around in memory.
de: Es ist schwierig, allgemeine Richtlinien für ein performantes Design zu geben, da dies stark von der Problemstellung abhängt. Ein erwähnenswerter Punkt auf der CPU-Seite ist jedoch, dass moderne CPUs fast immer durch die Speicherbandbreite begrenzt sind. Dies hat zu einem Wiederaufleben des datenorientierten Designs geführt, bei dem Datenstrukturen und Algorithmen für die *Cache-Lokalität* von Daten und den linearen Zugriff entworfen werden, anstatt im Speicher herumzuspringen.
zh_tw: 很難給出高性能設計的一般規範，因為這與問題本身有很大關係。不過有一點值得一提，在 CPU 方面，現代 CPU 幾乎總是受到記憶體頻寬的限制。這導致了面向資料的設計的重新興起，涉及到圍繞資料的*快取本地性*（cache locality）和線性存取進行資料結構和演算法的設計，避免在記憶體中進行跳轉。

source: The optimization process
de: Der Optimierungprozess
zh_tw: 動畫

source: Assuming we have a reasonable design, and taking our lessons from Knuth, our first step in optimization should be to identify the biggest bottlenecks - the slowest functions, the low-hanging fruit.
de: Unter der Annahme, dass wir ein vernünftiges Design haben und unsere Lehren aus Knuth ziehen, sollte unser erster Schritt bei der Optimierung darin bestehen, die größten Bottlenecks zu identifizieren - die langsamsten Funktionen, die niedrig hängenden Früchte.
zh_tw: 假設我們有一個合理的設計, 聽取Knuth的教訓, 優化的第一步應該是找出最大的瓶頸--最慢的功能, 可輕鬆實作的目標.

source: Once we've successfully improved the speed of the slowest area, it may no longer be the bottleneck. So we should test/profile again and find the next bottleneck on which to focus.
de: Sobald wir die Geschwindigkeit des langsamsten Bereichs erfolgreich verbessert haben, ist dies möglicherweise nicht mehr das Bottleneck. Wir sollten also erneut testen/profilen und das nächsten Bottleneck finden, auf das wir uns konzentrieren können.
zh_tw: 一旦我們成功地提高了最慢區域的速度, 它可能就不再是瓶頸了. 因此, 我們應該再次進行測試/分析, 找到下一個需要關注的瓶頸.

source: The process is thus:
de: Der Prozess ist also:
zh_tw: 因此, 該過程是:

source: Profile / Identify bottleneck.
de: Profilen / Bottleneck identifizieren.
zh_tw: 分析和確定瓶頸.

source: Optimize bottleneck.
de: Bottleneck optimieren.
zh_tw: 最佳化 APK 大小

source: Return to step 1.
de: Zu Schritt 1 zurückkehren.
zh_tw: 返回步驟1.

source: Optimizing bottlenecks
de: Bottlenecks optimieren
zh_tw: 最佳化 APK 大小

source: Some profilers will even tell you which part of a function (which data accesses, calculations) are slowing things down.
de: Einige Profiler sagen Ihnen sogar, welcher Teil einer Funktion (welche Datenzugriffe, Berechnungen) die Dinge verlangsamt.
zh_tw: 有些分析器甚至會告訴你一個函式的哪個部分在減慢速度(哪些資料存取, 計算).
