Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/gpu_optimization.po
Languages: de, zh_tw

source: GPU optimization
de: GPU-Optimierungen
zh_tw: 最佳化

source: Introduction
de: Einführung
zh_tw: 前言

source: The demand for new graphics features and progress almost guarantees that you will encounter graphics bottlenecks. Some of these can be on the CPU side, for instance in calculations inside the Godot engine to prepare objects for rendering. Bottlenecks can also occur on the CPU in the graphics driver, which sorts instructions to pass to the GPU, and in the transfer of these instructions. And finally, bottlenecks also occur on the GPU itself.
de: Die Nachfrage nach neuen Grafik-Features und der Fortschritt garantieren fast, dass Sie auf Grafik-Bottlenecks stoßen werden. Einige davon können CPU-seitig sein, beispielsweise bei Berechnungen innerhalb der Godot-Engine um Objekte für das Rendern vorzubereiten. Bottlenecks können auch im Grafiktreiber der CPU auftreten, der Anweisungen sortiert, welche an die GPU übergeben werden sollen, und bei der Übertragung dieser Anweisungen. Und schließlich treten auch auf der GPU selbst Bottlenecks auf.
zh_tw: 對新的圖形功能和進步的需求幾乎可以保證你必會遇到圖形瓶頸. 有些瓶頸可能出現在CPU端, 例如在Godot引擎內部的計算中, 為算繪準備對象. 瓶頸也可能發生在CPU上的圖形驅動中, 它將指令分類傳遞給GPU, 以及這些指令的傳輸過程. 最後, 瓶頸也會發生在GPU本身.

source: Where bottlenecks occur in rendering is highly hardware-specific. Mobile GPUs in particular may struggle with scenes that run easily on desktop.
de: Wo beim Rendern Bottlenecks auftreten, ist sehr hardwarespezifisch. Insbesondere mobile GPUs haben möglicherweise Probleme mit Szenen, die problemlos auf dem Desktop ausgeführt werden können.
zh_tw: 算繪中的瓶頸發生在哪裡, 高度依賴於硬體. 特別是移動GPU可能會在桌面上輕鬆運作的場景中掙扎.

source: Understanding and investigating GPU bottlenecks is slightly different to the situation on the CPU. This is because, often, you can only change performance indirectly by changing the instructions you give to the GPU. Also, it may be more difficult to take measurements. In many cases, the only way of measuring performance is by examining changes in the time spent rendering each frame.
de: Das Verständnis und die Untersuchung von GPU Bottlenecks unterscheidet sich etwas von der Situation der CPU. Das liegt daran, dass man die Performance oft nur indirekt ändern kann, indem man die Anweisungen an die GPU ändert. Außerdem kann es schwieriger sein, Messungen vorzunehmen. In vielen Fällen besteht die einzige Möglichkeit, die Performance zu messen, darin, die Veränderungen in der für das Rendern der einzelnen Frames benötigten Zeit zu untersuchen.
zh_tw: 瞭解和調查GPU瓶頸與CPU上的情況略有不同. 這是因為, 通常情況下, 你只能通過改變你給GPU的指令來間接改變性能. 另外, 測量起來可能更困難. 在許多情況下, 衡量性能的唯一方法是通過檢查每影格算繪時間的變化.

source: Draw calls, state changes, and APIs
de: Zeichenaufrufe, Statusänderungen und APIs
zh_tw: 繪製呼叫、狀態更變、API

source: The following section is not relevant to end-users, but is useful to provide background information that is relevant in later sections.
de: Der folgende Abschnitt ist für Endbenutzer nicht relevant, aber nützlich, um Hintergrundinformationen zu geben, die in späteren Abschnitten wichtig sind.
zh_tw: 以下部分與最終使用者無關, 但對於提供與後面章節相關的背景資訊是有用的.

source: Godot sends instructions to the GPU via a graphics API (Vulkan, OpenGL, OpenGL ES or WebGL). The communication and driver activity involved can be quite costly, especially in OpenGL, OpenGL ES and WebGL. If we can provide these instructions in a way that is preferred by the driver and GPU, we can greatly increase performance.
de: Godot sendet Anweisungen an die GPU über eine Grafik-API (Vulkan, OpenGL, OpenGL ES oder WebGL). Die damit verbundene Kommunikation und Treiberaktivität kann recht kostspielig sein, insbesondere bei OpenGL, OpenGL ES und WebGL. Wenn wir diese Anweisungen auf eine Weise bereitstellen können, die vom Treiber und der GPU bevorzugt wird, können wir die Performance erheblich steigern.
zh_tw: Godot通過圖形API(OpenGL, OpenGL ES或Vulkan)向GPU發送指令. 所涉及的通信和驅動活動可能非常昂貴, 尤其是在OpenGL和OpenGL ES中. 如果我們能以驅動和GPU喜歡的方式提供這些指令, 就能大大提高性能.

source: Nearly every API command in OpenGL requires a certain amount of validation to make sure the GPU is in the correct state. Even seemingly simple commands can lead to a flurry of behind-the-scenes housekeeping. Therefore, the goal is to reduce these instructions to a bare minimum and group together similar objects as much as possible so they can be rendered together, or with the minimum number of these expensive state changes.
de: Fast jeder API-Befehl in OpenGL erfordert ein gewisses Maß an Validierung, um sicherzustellen, dass sich die GPU im richtigen Zustand befindet. Selbst scheinbar einfache Befehle können zu einer Flut von Verwaltungsaufgaben hinter den Kulissen führen. Ziel ist es daher, diese Befehle auf ein absolutes Minimum zu reduzieren und ähnliche Objekte so weit wie möglich zu gruppieren, damit sie zusammen gerendert werden können, oder mit einer minimalen Anzahl dieser teuren Zustandsänderungen.
zh_tw: OpenGL中幾乎每一個API命令都需要一定的驗證, 以確保GPU處於正確的狀態. 即使是看似簡單的命令, 也會導致一連串的幕後工作. 因此, 我們的目標是將這些指令減少到最低限度, 並盡可能地將相似的物件群組, 以便它們可以一起算繪, 或者以最少的數量進行這些昂貴的狀態變化.

source: 2D batching
zh_tw: 2D 批次處理

source: In 2D, the costs of treating each item individually can be prohibitively high - there can easily be thousands of them on the screen. This is why 2D *batching* is used with OpenGL-based rendering methods. Multiple similar items are grouped together and rendered in a batch, via a single draw call, rather than making a separate draw call for each item. In addition, this means state changes, material and texture changes can be kept to a minimum.
de: In 2D können die Kosten für die Behandlung jedes einzelnen Objekts unerschwinglich hoch sein - es können leicht Tausende von ihnen auf dem Bildschirm zu sehen sein. Aus diesem Grund wird bei OpenGL-basierten Rendering-Methoden 2D-*Batching* verwendet. Mehrere ähnliche Elemente werden gruppiert und in einem Batch gerendert, und zwar über einen einzigen Zeichenaufruf, anstatt für jedes Element einen separaten Zeichenaufruf zu machen. Darüber hinaus bedeutet dies, dass Zustandsänderungen, Material- und Texturänderungen auf ein Minimum beschränkt werden können.
zh_tw: 在2D中, 單獨處理每個專案的成本可能會非常高--螢幕上很容易有成千上萬的專案. 這就是為什麼使用2D *批次處理* 的原因. 多個類似的專案被歸為一組, 並通過一個單一的繪製呼叫進行批量算繪, 而不是對每個專案進行單獨的繪製呼叫. 此外, 這意味著狀態變化, 材質和紋理變化可以保持在最低限度.

source: Vulkan-based rendering methods do not use 2D batching yet. Since draw calls are much cheaper with Vulkan compared to OpenGL, there is less of a need to have 2D batching (although it can still be beneficial in some cases).
de: Vulkan-basierte Rendering-Methoden verwenden noch kein 2D-Batching. Da Zeichenaufrufe mit Vulkan im Vergleich zu OpenGL viel billiger sind, besteht weniger Bedarf an 2D-Batching (obwohl es in einigen Fällen immer noch von Vorteil sein kann).
zh_tw: 基於 Vulkan 的算繪方法尚不使用 2D 批次。由於與 OpenGL 相比，Vulkan 的繪製呼叫要便宜得多，因此不太需要 2D 批次（儘管在某些情況下它仍然是有益的）。

source: 3D batching
zh_tw: 3D 批次處理

source: In 3D, we still aim to minimize draw calls and state changes. However, it can be more difficult to batch together several objects into a single draw call. 3D meshes tend to comprise hundreds or thousands of triangles, and combining large meshes in real-time is prohibitively expensive. The costs of joining them quickly exceeds any benefits as the number of triangles grows per mesh. A much better alternative is to **join meshes ahead of time** (static meshes in relation to each other). This can be done by artists, or programmatically within Godot using an add-on.
de: In 3D versuchen wir nach wie vor, Zeichenaufrufe und Zustandsänderungen zu minimieren. Es kann jedoch schwieriger sein, mehrere Objekte in einem einzigen Zeichenaufruf zusammenzufassen. 3D-Meshes bestehen in der Regel aus Hunderten oder Tausenden von Dreiecken, und die Kombination großer Meshes in Echtzeit ist unerschwinglich teuer. Die Kosten für das Zusammenfügen übersteigen schnell die Vorteile, wenn die Anzahl der Dreiecke pro Mesh steigt. Eine viel bessere Alternative ist das **Verbinden von Meshes im Voraus** (statische Meshes im Verhältnis zueinander). Dies kann von Künstlern oder programmatisch innerhalb von Godot mit Hilfe eines Add-ons erfolgen.
zh_tw: 在3D中, 我們的目標仍然是儘量減少繪製呼叫和狀態變化. 然而, 將多個物件批量合併到一個繪圖呼叫中可能比較困難.3D網格往往由數百個或數千個三角形組成, 而即時組合大型網格的成本非常高. 隨著每個網格的三角形數量的增加, 加入它們的成本很快就超過了帶來的好處. 一個更好的選擇是 **提前加入網格** (靜態網格之間的關係). 這可以由設計師完成, 或者在Godot中以程式設計方式完成.

source: There is also a cost to batching together objects in 3D. Several objects rendered as one cannot be individually culled. An entire city that is off-screen will still be rendered if it is joined to a single blade of grass that is on screen. Thus, you should always take objects' location and culling into account when attempting to batch 3D objects together. Despite this, the benefits of joining static objects often outweigh other considerations, especially for large numbers of distant or low-poly objects.
de: Auch das Zusammenfassen von Objekten in 3D hat seinen Preis. Mehrere Objekte, die als eines gerendert werden, können nicht einzeln entfernt werden. Eine ganze Stadt, die sich außerhalb des Bildschirms befindet, wird auch dann gerendert, wenn sie mit einem einzelnen Grashalm verbunden wird, der sich auf dem Bildschirm befindet. Daher sollten Sie beim Zusammenfügen von 3D-Objekten immer den Standort der Objekte und das Culling berücksichtigen. Trotzdem überwiegen die Vorteile des Zusammenfügens von statischen Objekten oft, insbesondere bei einer großen Anzahl von weit entfernten oder Objekten aus wenigen Polygonen.
zh_tw: 在3D中把物體批次處理在一起也是有成本的. 幾個物件算繪成一個, 就不能單獨剔除. 如果將螢幕外的整座城市與螢幕上的一片草地連接在一起, 那麼它仍然會被算繪. 因此, 當試圖將3D物件批量連接在一起時, 應該始終考慮到對象的位置和剔除. 儘管如此, 加入靜態物件的好處往往大於其他考慮因素, 特別是對於大量的遠距離或低多邊形物體.

source: For more information on 3D specific optimizations, see :ref:`doc_optimizing_3d_performance`.
de: Für weitere Informationen zu 3D-spezifische Optimierungen, siehe :ref:`doc_optimizing_3d_performance`.
zh_tw: 更多有關光照烘焙的資訊，請參考 :ref:`doc_baked_lightmaps` 。

source: Reuse shaders and materials
de: Wiederverwendung von Shadern und Materialien
zh_tw: 重複使用著色器和材質

source: The Godot renderer is a little different to what is out there. It's designed to minimize GPU state changes as much as possible. :ref:`StandardMaterial3D <class_StandardMaterial3D>` does a good job at reusing materials that need similar shaders. If custom shaders are used, make sure to reuse them as much as possible. Godot's priorities are:
de: Der Godot-Renderer unterscheidet sich ein wenig von dem, was es sonst da draußen gibt. Er wurde entwickelt, um GPU-Zustandsänderungen so weit wie möglich zu minimieren. :ref:`StandardMaterial3D <class_StandardMaterial3D>` leistet gute Arbeit bei der Wiederverwendung von Materialien, die ähnliche Shader benötigen. Wenn benutzerdefinierte Shader verwendet werden, stellen Sie sicher, dass sie so oft wie möglich wiederverwendet werden. Die Prioritäten von Godot sind:
zh_tw: Godot 算繪器和其它的算繪器不同，是以儘量減少 GPU 狀態更改為目標的。 :ref:`SpatialMaterial <class_SpatialMaterial>` 可以在所需著色器相似時很好地複用材質。如果是用自訂著色器，那麼請儘量進行複用。Godot 的優先順序是：

source: **Reusing Materials:** The fewer different materials in the scene, the faster the rendering will be. If a scene has a huge amount of objects (in the hundreds or thousands), try reusing the materials. In the worst case, use atlases to decrease the amount of texture changes.
de: **Wiederverwendung von Materialien:** Je weniger verschiedene Materialien in der Szene vorhanden sind, desto schneller wird das Rendering sein. Wenn eine Szene eine große Anzahl von Objekten hat (Hunderte oder Tausende), versuchen Sie, die Materialien wiederzuverwenden. Im schlimmsten Fall sollten Sie Atlanten verwenden, um die Anzahl der Texturänderungen zu verringern.
zh_tw: **複用材質：**場景中不同的材質越少, 算繪的速度就越快. 如果一個場景有大量的物體(數以百計或數以千計), 可以嘗試重複使用這些材質. 在最壞的情況下, 使用合集來減少紋理變化的數量.

source: If a scene has, for example, 20,000 objects with 20,000 different materials each, rendering will be slow. If the same scene has 20,000 objects, but only uses 100 materials, rendering will be much faster.
de: Wenn eine Szene z.B. 20.000 Objekte mit jeweils 20.000 verschiedenen Materialien enthält, ist das Rendering langsam. Wenn die gleiche Szene 20.000 Objekte hat, aber nur 100 Materialien verwendet, ist das Rendering viel schneller.
zh_tw: 例如, 如果一個場景有 ``20,000`` 個物體, 每個物體有 ``20,000`` 種不同的材質, 算繪會很慢. 如果同一個場景有 ``20,000`` 個物體, 但只使用 ``100`` 種材料, 算繪就會快很多.

source: Pixel cost versus vertex cost
de: Pixel-Kosten vs. Vertex-Kosten
zh_tw: 像素成本與頂點成本

source: You may have heard that the lower the number of polygons in a model, the faster it will be rendered. This is *really* relative and depends on many factors.
de: Sie haben vielleicht schon gehört, dass ein Modell umso schneller gerendert wird, je weniger Polygone es hat. Das ist *wirklich* relativ und hängt von vielen Faktoren ab.
zh_tw: 你可能聽說過, 一個模型中的多邊形數量越少, 它的算繪速度就越快. 這其實是 *相對的* , 取決於許多因素.

source: On a modern PC and console, vertex cost is low. GPUs originally only rendered triangles. This meant that every frame:
de: Auf einem modernen PC und einer modernen Konsole sind die Vertex-Kosten gering. GPUs haben ursprünglich nur Dreiecke gerendert. Das bedeutete, dass in jedem Frame:
zh_tw: 在現代PC和控制台, 頂點成本很低.GPU最初只算繪三角形. 這意味著每一影格:

source: All vertices had to be transformed by the CPU (including clipping).
de: Alle Vertices von der CPU transformiert werden mussten (einschließlich Clipping).
zh_tw: 所有頂點都必須由 CPU 進行轉換（包括剪裁）。

source: All vertices had to be sent to the GPU memory from the main RAM.
de: Alle Vertices vom Hauptspeicher aus an den GPU-Speicher gesendet werden mussten.
zh_tw: 所有頂點都必須從主 RAM 發送到 GPU 記憶體。

source: Nowadays, all this is handled inside the GPU, greatly increasing performance. 3D artists usually have the wrong feeling about polycount performance because 3D modeling software (such as Blender, 3ds Max, etc.) need to keep geometry in CPU memory for it to be edited, reducing actual performance. Game engines rely on the GPU more, so they can render many triangles much more efficiently.
de: Heutzutage wird all dies von der GPU erledigt, was die Performance erheblich steigert. 3D-Künstler haben in der Regel ein falsches Bild von der Polycount-Performance, da 3D-Modellierungssoftware (wie Blender, 3ds Max usw.) die Geometrie im CPU-Speicher halten muss, damit sie bearbeitet werden kann, was die tatsächliche Performance verringert. Spiele-Engines verlassen sich mehr auf die GPU, so dass sie viele Dreiecke viel effizienter rendern können.
zh_tw: 現在, 所有這些都在GPU內部處理, 大大提高了性能. 三維藝術家通常對多維性能有錯誤的感覺, 因為三維DCC(如Blender, Max等)需要將幾何圖形保存在CPU記憶體中進行編輯, 從而降低了實際性能. 遊戲引擎更依賴GPU, 所以它們可以更有效地算繪許多三角形.

source: On mobile devices, the story is different. PC and console GPUs are brute-force monsters that can pull as much electricity as they need from the power grid. Mobile GPUs are limited to a tiny battery, so they need to be a lot more power efficient.
de: Bei mobilen Geräten sieht die Sache anders aus. PC- und Konsolen-GPUs sind brachiale Monster, die so viel Strom aus dem Stromnetz ziehen können, wie sie brauchen. Mobile GPUs sind auf eine winzige Batterie beschränkt, daher müssen sie viel stromsparender sein.
zh_tw: 在移動裝置上, 情況則不同. 個人電腦和控制台的GPU是粗暴的怪物, 可以從電網中獲取所需的電力. 移動GPU被限制在一個很小的電池裡, 所以它們需要更高的功率效率.

source: To be more efficient, mobile GPUs attempt to avoid *overdraw*. Overdraw occurs when the same pixel on the screen is being rendered more than once. Imagine a town with several buildings. GPUs don't know what is visible and what is hidden until they draw it. For example, a house might be drawn and then another house in front of it (which means rendering happened twice for the same pixel). PC GPUs normally don't care much about this and just throw more pixel processors to the hardware to increase performance (which also increases power consumption).
de: Um effizienter zu sein, versuchen mobile GPUs, *Overdraw* zu vermeiden. Overdraw tritt auf, wenn dasselbe Pixel auf dem Bildschirm mehr als einmal gerendert wird. Stellen Sie sich eine Stadt mit mehreren Gebäuden vor. GPUs wissen nicht, was sichtbar ist und was nicht, bis sie es zeichnen. Zum Beispiel könnte ein Haus gezeichnet werden und dann ein anderes Haus davor (was bedeutet, dass dasselbe Pixel zweimal gerendert wird). PC-Grafikprozessoren kümmern sich in der Regel nicht darum und stellen der Hardware einfach mehr Pixelprozessoren zur Verfügung, um die Performance zu steigern (was auch den Stromverbrauch erhöht).
zh_tw: 為了提高工作效率, 移動GPU試圖避免 *overdraw* . 當螢幕上的同一個像素被算繪了不止一次時, 就會出現Overdraw. 想像一下, 一個有幾座建築的小鎮. 在繪製之前,GPU不知道哪些是可見的, 哪些是隱藏的. 例如, 一棟房子可能被畫出來, 然後在它前面又畫了一棟房子(這意味著同一像素的算繪發生了兩次).PC GPU通常不怎麼關心這個問題, 只是把更多的像素處理扔給硬體以提高性能(這也會增加功耗).

source: Using more power is not an option on mobile so mobile devices use a technique called *tile-based rendering* which divides the screen into a grid. Each cell keeps the list of triangles drawn to it and sorts them by depth to minimize *overdraw*. This technique improves performance and reduces power consumption, but takes a toll on vertex performance. As a result, fewer vertices and triangles can be processed for drawing.
de: Mehr Strom zu verbrauchen ist auf mobilen Geräten keine Option, daher verwenden mobile Geräte eine Technik namens *Tile-Based-Rendering*, die den Bildschirm in ein Raster unterteilt. Jede Zelle speichert die Liste der auf ihr gezeichneten Dreiecke und sortiert sie nach Tiefe, um das *Overdraw* zu minimieren. Diese Technik verbessert die Performance und reduziert den Stromverbrauch, geht aber zu Lasten der Vertex-Performance. Infolgedessen können weniger Vertices und Dreiecke zum Zeichnen verarbeitet werden.
zh_tw: 在移動裝置上使用更多的電力是不可能的，所以移動裝置使用一種叫做*基於圖塊的算繪*的技術，將螢幕劃分為一個網格。每個儲存格都保存著繪製的三角形列表，並按深度進行排序，以儘量減少*過度繪製*。這種技術提高了性能，降低了功耗，但對頂點性能造成了影響。因此，可以處理更少的頂點和三角形進行繪製。

source: Additionally, tile-based rendering struggles when there are small objects with a lot of geometry within a small portion of the screen. This forces mobile GPUs to put a lot of strain on a single screen tile, which considerably decreases performance as all the other cells must wait for it to complete before displaying the frame.
de: Außerdem hat das Tile-Based-Rendering Probleme, wenn kleine Objekte mit viel Geometrie auf einem kleinen Teil des Bildschirms zu sehen sind. Dies zwingt mobile GPUs dazu, ein einzelnes Bildschirm-Tile stark zu belasten, was die Performance erheblich beeinträchtigt, da alle anderen Zellen auf die Fertigstellung warten müssen, bevor der Frame angezeigt wird.
zh_tw: 一般來說, 這並不是那麼糟糕, 但在移動裝置上有一個必須避免的特殊情況, 即在螢幕的一小部分內具有大量幾何形狀的小物體. 這迫使移動GPU在單個螢幕單元上用很大的力氣, 大大降低了性能(因為所有其他單元必須等待它完成才能顯示該影格).

source: To summarize, don't worry about vertex count on mobile, but **avoid concentration of vertices in small parts of the screen**. If a character, NPC, vehicle, etc. is far away (which means it looks tiny), use a smaller level of detail (LOD) model. Even on desktop GPUs, it's preferable to avoid having triangles smaller than the size of a pixel on screen.
de: Zusammenfassend lässt sich sagen, dass die Anzahl der Vertices auf mobilen Geräten keine Rolle spielt, dass aber **eine Konzentration von Vertices in kleinen Teilen des Bildschirms** vermieden werden sollte. Wenn ein Charakter, NPC, Fahrzeug usw. weit entfernt ist (was bedeutet, dass es winzig aussieht), verwenden Sie ein Modell mit geringerem Detailgrad (LOD). Selbst auf Desktop-GPUs sollten Dreiecke vermieden werden, die kleiner sind als die Größe eines Pixels auf dem Bildschirm.
zh_tw: 總而言之, 在移動端不要擔心頂點數量, 但 **避免頂點集中在螢幕的一小部分** . 如果一個角色, NPC, 車輛等離得很遠(這意味著它看起來很小), 就使用一個較小的細節級別模型(LOD). 即使在桌面GPU上, 最好也不要讓三角形小於螢幕上一個像素的大小.

source: Pay attention to the additional vertex processing required when using:
de: Beachten Sie die zusätzlich erforderliche Vertex-Verarbeitung, wenn Sie Folgendes verwenden:
zh_tw: 使用時要注意額外的頂點處理：

source: Skinning (skeletal animation)
de: Skinning (Skelettanimation)
zh_tw: 蒙皮（骨骼動畫）

source: Morphs (shape keys)
zh_tw: 變形（形態鍵）

source: Pixel/fragment shaders and fill rate
de: Pixel/Fragment-Shader und Füllrate
zh_tw: 像素/片段著色器和填充速率

source: In contrast to vertex processing, the costs of fragment (per-pixel) shading have increased dramatically over the years. Screen resolutions have increased: the area of a 4K screen is 8,294,400 pixels, versus 307,200 for an old 640×480 VGA screen. That is 27 times the area! Also, the complexity of fragment shaders has exploded. Physically-based rendering requires complex calculations for each fragment.
de: Im Gegensatz zur Vertex-Verarbeitung sind die Kosten für Fragment-Shading (pro Pixel) im Laufe der Jahre drastisch gestiegen. Die Bildschirmauflösungen haben zugenommen: Die Fläche eines 4K-Bildschirms beträgt 8.294.400 Pixel, gegenüber 307.200 bei einem alten 640×480-VGA-Bildschirm. Das ist die 27-fache Fläche! Auch die Komplexität von Fragment-Shadern ist explodiert. Physikbasiertes Rendering erfordert komplexe Berechnungen für jedes Fragment.
zh_tw: 與頂點處理相比, 片段著色器(每像素)的成本在這些年裡急劇增加. 螢幕解析度提高了(4K螢幕的面積是829400像素, 而老式640×480 VGA螢幕的面積是307200, 是27倍), 但片段著色器的複雜度也爆炸式增長. 基於物理的算繪需要對每個片段進行複雜的計算.

source: You can test whether a project is fill rate-limited quite easily. Turn off V-Sync to prevent capping the frames per second, then compare the frames per second when running with a large window, to running with a very small window. You may also benefit from similarly reducing your shadow map size if using shadows. Usually, you will find the FPS increases quite a bit using a small window, which indicates you are to some extent fill rate-limited. On the other hand, if there is little to no increase in FPS, then your bottleneck lies elsewhere.
de: Sie können ganz einfach testen, ob ein Projekt eine Füllratenbegrenzung aufweist. Schalten Sie V-Sync aus, um eine Frameratenbegrenzung zu verhindern, und vergleichen Sie dann die Frames pro Sekunde bei der Ausführung mit einem großen Fenster mit denen bei der Ausführung mit einem sehr kleinen Fenster. Es kann auch von Vorteil sein, die Größe der Shadow-Map zu reduzieren, wenn Sie Schatten verwenden. In der Regel werden Sie feststellen, dass die FPS bei einem kleinen Fenster ziemlich stark ansteigen, was darauf hindeutet, dass Sie in gewissem Maße in der Füllrate eingeschränkt sind. Wenn sich die FPS hingegen kaum oder gar nicht erhöhen, liegt der Bottleneck woanders.
zh_tw: 你可以很容易地測試一個專案是否受到填充率限制. 關閉V-Sync以防止每秒影格數的上限, 然後比較使用大視窗運作時的每秒影格數和使用非常小的視窗運作時的影格數. 如果使用陰影, 你也可以從同樣減少陰影貼圖大小中獲益. 通常, 你會發現使用小視窗的FPS會增加不少, 這說明你在某種程度上受到了填充率的限制. 另一方面, 如果FPS幾乎沒有增加, 那麼你的瓶頸就在其他地方.

source: You can increase performance in a fill rate-limited project by reducing the amount of work the GPU has to do. You can do this by simplifying the shader (perhaps turn off expensive options if you are using a :ref:`StandardMaterial3D <class_StandardMaterial3D>`), or reducing the number and size of textures used. Also, when using non-unshaded particles, consider forcing vertex shading in their material to decrease the shading cost.
de: Sie können die Performance in einem Projekt mit Füllratenbegrenzung erhöhen, indem Sie den Arbeitsaufwand für die GPU reduzieren. Sie können dies tun, indem Sie den Shader vereinfachen (vielleicht deaktivieren Sie teure Optionen, wenn Sie ein :ref:`StandardMaterial3D <class_StandardMaterial3D>` verwenden) oder die Anzahl und Größe der verwendeten Texturen reduzieren. Wenn Sie Partikel ohne Shading verwenden, sollten Sie auch in Erwägung ziehen, Vertex-Shading in ihrem Material zu erzwingen, um die Shading-Kosten zu senken.
zh_tw: 你可以通過減少 GPU 的工作量來提高填充率限制專案的性能。你可以通過簡化著色器（如果你使用的是 :ref:`SpatialMaterial <class_SpatialMaterial>`，也許可以關閉昂貴的選項），或者減少使用的紋理數量和大小來實作。

source: On supported hardware, :ref:`doc_variable_rate_shading` can be used to reduce shading processing costs without impacting the sharpness of edges on the final image.
de: Auf unterstützter Hardware kann :ref:`doc_variable_rate_shading` verwendet werden, um die Kosten für die Shading-Verarbeitung zu reduzieren, ohne die Schärfe der Kanten des endgültigen Bildes zu beeinträchtigen.
zh_tw: 在支援的硬體上，可以使用 :ref:`doc_variable_rate_shading` 降低著色過程的損耗，並且不影響最終圖片邊緣的銳度。
