Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/gpu_optimization.po
Languages: de, zh_tw

source: **When targeting mobile devices, consider using the simplest possible shaders you can reasonably afford to use.**
de: **Wenn Sie für mobile Geräte entwickeln, sollten Sie die einfachsten Shader verwenden, die Sie sich leisten können.**
zh_tw: **在針對移動裝置時, 考慮使用你能合理負擔得起的最簡單的著色器.**

source: Reading textures
de: Texturen einlesen
zh_tw: 匯入紋理

source: The other factor in fragment shaders is the cost of reading textures. Reading textures is an expensive operation, especially when reading from several textures in a single fragment shader. Also, consider that filtering may slow it down further (trilinear filtering between mipmaps, and averaging). Reading textures is also expensive in terms of power usage, which is a big issue on mobiles.
de: Der andere Faktor bei Fragment-Shadern sind die Kosten für das Lesen von Texturen. Das Lesen von Texturen ist ein teurer Vorgang, vor allem, wenn mehrere Texturen in einem einzigen Fragment-Shader gelesen werden. Berücksichtigen Sie auch, dass die Filterung den Vorgang weiter verlangsamen kann (trilineare Filterung zwischen Mipmaps und Mittelwertbildung). Das Lesen von Texturen ist auch teuer in Bezug auf den Stromverbrauch, was auf Mobiltelefonen ein großes Problem darstellt.
zh_tw: 片段著色器的另一個因素是讀取紋理的成本。讀取紋理是一項昂貴的操作，尤其是在一個片段著色器中從多個紋理中讀取時。另外，考慮到篩選可能會進一步減慢它的速度（mipmap 之間的三線性篩選，以及平均）。讀取紋理在功耗方面也很昂貴，這在手機上是個大問題。

source: **If you use third-party shaders or write your own shaders, try to use algorithms that require as few texture reads as possible.**
de: **Wenn Sie Shader von Drittanbietern verwenden oder Ihre eigenen Shader schreiben, versuchen Sie, Algorithmen zu verwenden, die so wenig Texturlesevorgänge wie möglich erfordern.**
zh_tw: **如果您使用協力廠商著色器或編寫自己的著色器, 請儘量使用需要盡可能少的紋理讀取的演算法.**

source: Texture compression
de: Texturkomprimierung
zh_tw: 紋理壓縮

source: By default, Godot compresses textures of 3D models when imported using video RAM (VRAM) compression. Video RAM compression isn't as efficient in size as PNG or JPG when stored, but increases performance enormously when drawing large enough textures.
de: Godot komprimiert beim Import standardmäßig Texturen von 3D-Modellen (VRAM-Komprimierung). Diese Video-RAM-Komprimierung ist nicht so effizient wie beim Speichern von PNG oder JPG, steigert aber die Performance enorm, wenn genügend große Texturen gezeichnet werden.
zh_tw: 預設情況下,Godot在匯入3D模型時使用影片RAM(VRAM)壓縮來壓縮紋理. 影片RAM壓縮在儲存時不如PNG或JPG有效, 但在繪製足夠大的紋理時, 會極大地提高性能.

source: This is because the main goal of texture compression is bandwidth reduction between memory and the GPU.
de: Dies liegt daran, dass das Hauptziel der Texturkomprimierung die Bandbreitenreduzierung zwischen Speicher und GPU ist.
zh_tw: 這是因為紋理壓縮的主要目標是在記憶體和GPU之間減少頻寬.

source: In 3D, the shapes of objects depend more on the geometry than the texture, so compression is generally not noticeable. In 2D, compression depends more on shapes inside the textures, so the artifacts resulting from 2D compression are more noticeable.
de: In 3D hängen die Formen von Objekten mehr von der Geometrie als von der Textur ab, sodass eine Komprimierung im Allgemeinen nicht erkennbar ist. In 2D hängt die Komprimierung stärker von den Formen innerhalb der Texturen ab, sodass die durch die 2D-Komprimierung resultierenden Artefakte stärker wahrgenommen werden.
zh_tw: 在3D中, 物體的形狀更多地取決於幾何體而不是紋理, 所以壓縮一般不明顯. 在2D中, 壓縮更多的是取決於紋理內部的形狀, 所以2D壓縮產生的偽影比較明顯.

source: As a warning, most Android devices do not support texture compression of textures with transparency (only opaque), so keep this in mind.
de: Als Warnung: Die meisten Android-Geräte unterstützen keine Texturkomprimierung von Texturen mit Transparenz (nur undurchsichtig). Denken Sie also daran.
zh_tw: 作為警告, 大多數Android裝置不支援具有透明度的紋理的紋理壓縮(僅不透明), 因此請記住這一點.

source: Even in 3D, "pixel art" textures should have VRAM compression disabled as it will negatively affect their appearance, without improving performance significantly due to their low resolution.
de: Selbst in 3D sollte die VRAM-Komprimierung von "Pixel Art"-Texturen deaktiviert werden, da sie sich negativ auf ihr Aussehen auswirkt, ohne die Performance aufgrund ihrer geringen Auflösung wesentlich zu verbessern.
zh_tw: 即便在 3D 中，“像素畫”紋理也應該禁用 VRAM 壓縮，因為壓縮會對外觀產生負面影響，較低的解析度也無法得到顯著的性能提升。

source: Post-processing and shadows
de: Nachbearbeitung und Schatten
zh_tw: **後處理：**

source: Post-processing effects and shadows can also be expensive in terms of fragment shading activity. Always test the impact of these on different hardware.
de: Nachbearbeitungseffekte und Schatten können auch im Hinblick auf die Aktivität des Fragment-Shaders teuer sein. Testen Sie die Auswirkungen immer auf verschiedener Hardware.
zh_tw: 就片段著色活動而言, 後期處理效果和陰影也可能很昂貴. 始終測試這些對不同硬體的影響.

source: **Reducing the size of shadowmaps can increase performance**, both in terms of writing and reading the shadowmaps. On top of that, the best way to improve performance of shadows is to turn shadows off for as many lights and objects as possible. Smaller or distant OmniLights/SpotLights can often have their shadows disabled with only a small visual impact.
de: **Die Verringerung der Größe von Shadow-Maps kann die Performance** erhöhen, sowohl was das Schreiben als auch das Lesen der Shadow-Maps angeht. Darüber hinaus ist die beste Möglichkeit, die Performance von Schatten zu verbessern, die Deaktivierung von Schatten für so viele Lichter und Objekte wie möglich. Bei kleineren oder weit entfernten OmniLights/SpotLights kann der Schatten oft deaktiviert werden, ohne dass sich dies optisch bemerkbar macht.
zh_tw: **減少陰影圖的大小可以提高性能** , 無論是在寫還是讀取陰影貼圖方面. 除此之外, 提高陰影性能的最好方法是關閉盡可能多的燈光和物體的陰影. 較小或較遠的OmniLights/SpotLights通常可以禁用它們的陰影, 而對視覺影響很小.

source: Transparency and blending
de: Transparenz und Blending
zh_tw: 透明度和混合

source: Transparent objects present particular problems for rendering efficiency. Opaque objects (especially in 3D) can be essentially rendered in any order and the Z-buffer will ensure that only the front most objects get shaded. Transparent or blended objects are different. In most cases, they cannot rely on the Z-buffer and must be rendered in "painter's order" (i.e. from back to front) to look correct.
de: Transparente Objekte stellen ein besonderes Problem für die Rendering-Effizienz dar. Undurchsichtige Objekte (insbesondere in 3D) können im Wesentlichen in beliebiger Reihenfolge gerendert werden, und der Z-Puffer sorgt dafür, dass nur die vordersten Objekte schattiert werden. Bei transparenten oder überblendeten Objekten ist das anders. In den meisten Fällen können sie sich nicht auf den Z-Puffer verlassen und müssen in "Maler-Reihenfolge" gerendert werden (d. h. von hinten nach vorne), um korrekt auszusehen.
zh_tw: 透明物體對算繪效率帶來了特殊的問題. 不透明的物件(尤其是在3D中)基本上可以以任意順序算繪,Z-緩衝區將確保只有最前面的物件得到陰影. 透明或混合物件則不同, 在大多數情況下, 它們不能依賴Z-緩衝區, 必須以 "畫家順序"(即從後到前)算繪才能看起來正確.

source: Transparent objects are also particularly bad for fill rate, because every item has to be drawn even if other transparent objects will be drawn on top later on.
de: Transparente Objekte sind auch besonders schlecht für die Füllrate, da jedes Objekt gezeichnet werden muss, auch wenn später andere transparente Objekte darüber gezeichnet werden.
zh_tw: 透明物件的填充率也特別差, 因為每一個專案都要繪製, 即使之面會在上面繪製其他透明物件.

source: Opaque objects don't have to do this. They can usually take advantage of the Z-buffer by writing to the Z-buffer only first, then only performing the fragment shader on the "winning" fragment, the object that is at the front at a particular pixel.
de: Undurchsichtige Gegenstände müssen dies nicht tun. Normalerweise können sie den Z-Puffer nutzen, indem sie zuerst nur in den Z-Puffer schreiben und dann nur den Fragment-Shader für das "gewinnende" Fragment ausführen, das sich bei einem bestimmten Pixel vorne befindet.
zh_tw: 不透明的物件不需要這樣做. 它們通常可以利用Z-緩衝區, 只先向Z-緩衝區寫入資料, 然後只在 "勝利" 的片段上執行片段著色器, 也就是在某一像素處處於前面的物件.

source: Transparency is particularly expensive where multiple transparent objects overlap. It is usually better to use transparent areas as small as possible to minimize these fill rate requirements, especially on mobile, where fill rate is very expensive. Indeed, in many situations, rendering more complex opaque geometry can end up being faster than using transparency to "cheat".
de: Transparenz ist besonders teuer, wenn sich mehrere transparente Objekte überschneiden. In der Regel ist es besser, transparente Bereiche so klein wie möglich zu halten, um diese Anforderungen an die Füllrate zu minimieren, insbesondere auf mobilen Geräten, wo die Füllrate sehr teuer ist. In vielen Situationen kann das Rendern von komplexeren undurchsichtigen Geometrien sogar schneller sein als die Verwendung von Transparenz zum "Vortäuschen".
zh_tw: 在多個透明物件重疊的情況下, 透明度特別昂貴. 通常情況下, 使用透明區域越小越好, 以儘量降低這些填充率要求, 尤其是在移動端. 事實上, 在很多情況下, 算繪更複雜的不透明幾何體最終可能比使用透明度來 "作弊" 更快.

source: Multi-platform advice
de: Multi-Plattform-Tipps
zh_tw: 多執行緒

source: If you are aiming to release on multiple platforms, test *early* and test *often* on all your platforms, especially mobile. Developing a game on desktop but attempting to port it to mobile at the last minute is a recipe for disaster.
de: Wenn Sie auf mehreren Plattformen veröffentlichen möchten, testen Sie *früh* und *häufig* auf allen Ihren Plattformen, insbesondere auf Mobilgeräten. Ein Spiel auf dem Desktop zu entwickeln und es in letzter Minute das Handy zu portieren, endet meist in einer Katastrophe.
zh_tw: 如果您的目標是在多個平臺上發行, 請在您的所有平臺上(尤其是移動平臺)上進行 *早期* 並 *經常* 性測試. 在桌面上開發遊戲, 但試圖在最後一刻將其移植到移動裝置, 這是災難的根源.

source: In general, you should design your game for the lowest common denominator, then add optional enhancements for more powerful platforms. For example, you may want to use the Compatibility rendering method for both desktop and mobile platforms where you target both.
de: Im Allgemeinen sollten Sie Ihr Spiel für den kleinsten gemeinsamen Nenner entwickeln und dann optionale Erweiterungen für leistungsfähigere Plattformen hinzufügen. So können Sie beispielsweise die Rendering-Methode "Kompatibilität" sowohl für Desktop- als auch für mobile Plattformen verwenden, wenn Sie für beide Plattformen entwickeln.
zh_tw: 一般來說, 你應該從最底的共性設計你的遊戲, 然後為更強大的平臺新增可選的增強功能. 例如, 你可能希望在同時針對桌面和移動平臺的情況下, 同時使用GLES2後臺.

source: Mobile/tiled renderers
de: Mobile/Kachel-Renderer
zh_tw: 移動端和圖塊算繪

source: As described above, GPUs on mobile devices work in dramatically different ways from GPUs on desktop. Most mobile devices use tile renderers. Tile renderers split up the screen into regular-sized tiles that fit into super fast cache memory, which reduces the number of read/write operations to the main memory.
de: Wie oben beschrieben, funktionieren GPUs auf mobilen Geräten ganz anders als GPUs auf dem Desktop. Die meisten Mobilgeräte verwenden Kachel-Renderer. Diese teilen den Bildschirm in Kacheln normaler Größe auf, die in den superschnellen Cache-Speicher passen, und reduzieren die Lese- und Schreibvorgänge zum Hauptspeicher.
zh_tw: 如上所述, 移動裝置上的GPU與桌面上的GPU工作方式有很大不同. 大多數移動裝置都使用圖塊算繪器. 圖塊算繪器將螢幕分割成規則大小的圖塊, 這些圖塊可以放入超快的快取中, 從而減少了對主記憶體的讀和寫操作次數.

source: There are some downsides though. Tiled rendering can make certain techniques much more complicated and expensive to perform. Tiles that rely on the results of rendering in different tiles or on the results of earlier operations being preserved can be very slow. Be very careful to test the performance of shaders, viewport textures and post processing.
de: Es gibt jedoch einige Nachteile, durch die bestimmte Methoden erheblich komplizierter und teurer werden können. Kacheln, die auf den Ergebnissen des Renderns verschiedener Kacheln oder auf den Ergebnissen früherer Vorgänge beruhen, können sehr langsam sein. Testen Sie unbedingt die Performance von Shadern, Viewport-Texturen und der Nachbearbeitung.
zh_tw: 不過也有一些缺點. 圖塊算繪會讓某些技術變得更加複雜, 執行起來也更加昂貴. 依賴於不同圖塊算繪的結果, 或者依賴於早期操作的結果被保存的圖塊可能會非常慢. 要非常小心地測試著色器, 視圖紋理和後期處理的性能.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: **Reusing Shaders:** If materials can't be reused, at least try to reuse shaders. Note: shaders are automatically reused between StandardMaterial3Ds that share the same configuration (features that are enabled or disabled with a check box) even if they have different parameters.
de: **Wiederverwendung von Shadern:** Wenn Materialien nicht wiederverwendet werden können, versuchen Sie zumindest, Shader wiederzuverwenden. Hinweis: Shader werden automatisch zwischen StandardMaterial3Ds wiederverwendet, die dieselbe Konfiguration haben (Features, die mit einem Kontrollkästchen aktiviert oder deaktiviert sind), auch wenn sie unterschiedliche Parameter haben.
