Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/index.po
Languages: de, zh_tw

source: Performance
zh_tw: 效能

source: Introduction
de: Einführung
zh_tw: 前言

source: Godot follows a balanced performance philosophy. In the performance world, there are always tradeoffs, which consist of trading speed for usability and flexibility. Some practical examples of this are:
de: Godot verfolgt eine ausgewogene Performance-Philosophie. In der Welt der Performance gibt es immer Kompromisse, die darin bestehen, Geschwindigkeit gegen Benutzerfreundlichkeit und Flexibilität einzutauschen. Einige praktische Beispiele hierfür sind:
zh_tw: Godot遵循平衡的表現理念. 在效率表現中, 總是有需要權衡交易的東西, 可用性和靈活性. 一些實際的範例是:

source: Rendering large amounts of objects efficiently is easy, but when a large scene must be rendered, it can become inefficient. To solve this, visibility computation must be added to the rendering. This makes rendering less efficient, but at the same time, fewer objects are rendered. Therefore, the overall rendering efficiency is improved.
de: Das effiziente Rendern einer Vielzahl von Objekten ist einfach. Muss jedoch eine besonders aufwändige Szene gerendert werden, kann es ineffizient werden. Um dies zu lösen, muss vor dem Rendering eine Berechnung der sichtbaren und damit aktuell relevanten Objekte stattfinden, wodurch das Rendern ineffizienter wird, gleichzeitig jedoch weniger Objekte gezeichnet werden, sodass sich die Effizienz insgesamt verbessert.
zh_tw: 有效地算繪大量的物體是很容易的, 但是當必須算繪一個大的場景時, 效率就會變得很低. 為了解決這個問題, 必須在算繪時加入可見性計算. 這使得算繪的效率降低, 但同時, 被算繪的對象也減少了. 因此, 整體的算繪效率得到了提高.

source: Configuring the properties of every material for every object that needs to be rendered is also slow. To solve this, objects are sorted by material to reduce the costs. At the same time, sorting has a cost.
de: Auch das Setzen der Propertys jedes Materials für jedes Objekt, das gezeichnet werden muss, ist langsam. Um dieses Problem zu lösen, werden die Objekte nach Material sortiert, um die Kosten zu senken. Gleichzeitig ist die Sortierung mit Kosten verbunden.
zh_tw: 為每個需要算繪的物件配置每個材質的屬性也很慢. 為了解決這個問題, 物體被按材質分類以減少成本. 同時, 排序也是有成本的.

source: In 3D physics, a similar situation happens. The best algorithms to handle large amounts of physics objects (such as SAP) are slow at insertion/removal of objects and raycasting. Algorithms that allow faster insertion and removal, as well as raycasting, will not be able to handle as many active objects.
de: In 3D-Physik-Berechnungen besteht eine ähnliche Situation. Die besten Algorithmen für die Verarbeitung großer Mengen von Physikobjekten (z.B. SAP) sind beim Einfügen/Entfernen von Objekten und Raycasting vergleichsweise langsam. Im Gegensatz dazu können Algorithmen, die ein schnelleres Einfügen und Entfernen sowie Raycasting ermöglichen, nicht so viele aktive Objekte verarbeiten.
zh_tw: 在3D物理中, 也有類似的情況發生. 處理大量物理物件的最佳演算法(如SAP)在插入/移除物件和射線傳輸方面都很慢. 允許更快的插入和移除以及射線傳輸的演算法, 將無法處理那麼多的活動物件.

source: And there are many more examples of this! Game engines strive to be general-purpose in nature. Balanced algorithms are always favored over algorithms that might be fast in some situations and slow in others, or algorithms that are fast but are more difficult to use.
de: Und es gibt noch viele weitere Beispiele! Die meisten Spiele-Engines bieten ein breites Anwendungsspektrum an, dabei werden ausgewogene Algorithmen den Algorithmen vorgezogen, die in manchen Situationen schnell und in anderen langsam sind, oder Algorithmen, die zwar schnell, jedoch komplizierter zu verwenden sind.
zh_tw: 而這樣的例子還有很多!遊戲引擎在本質上努力成為通用的. 平衡的演算法總是受到青睞, 而不是那些在某些情況下可能很快而在另一些情況下很慢的演算法, 或者那些快但更難使用的演算法.

source: Godot is not an exception to this. While it is designed to have backends swappable for different algorithms, the default backends prioritize balance and flexibility over performance.
de: Godot bildet dabei keine Ausnahme. Während es so konzipiert ist, dass die Backends für verschiedene Algorithmen austauschbar sind, haben bei den Default-Backends Ausgewogenheit und Flexibilität Vorrang vor Performance.
zh_tw: Godot在這方面也不例外. 雖然它被設計成可以為不同的演算法交換後端, 但預設的後端將平衡和靈活性置於性能之上.

source: With this clear, the aim of this tutorial section is to explain how to get the maximum performance out of Godot. While the tutorials can be read in any order, it is a good idea to start from :ref:`doc_general_optimization`.
de: Vor diesem Hintergrund soll in diesem Tutorial erklärt werden, wie Sie die maximale Performance von Godot erzielen können. Während die Tutorials in beliebiger Reihenfolge gelesen werden können, ist es eine gute Idee, bei :ref:`doc_general_optimization` zu beginnen.
zh_tw: 明確了這一點後, 本教學部分的目的是解釋如何從Godot中獲得最大的性能. 雖然這些教學可以按任何順序閱讀, 但最好從 :ref:`doc_general_optimization` 開始.

source: Common
de: Allgemein
zh_tw: 常見

source: Threads
zh_tw: 執行緒

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
