Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/optimizing_3d_performance.po
Languages: de, zh_tw

source: optimization
de: Optimierung
zh_tw: 動畫

source: Optimizing 3D performance
de: Optimierung der 3D-Performance
zh_tw: 優化 3D 性能

source: Culling
zh_tw: 編譯

source: Godot will automatically perform view frustum culling in order to prevent rendering objects that are outside the viewport. This works well for games that take place in a small area, however things can quickly become problematic in larger levels.
de: Godot führt automatisch ein View-Frustum-Culling durch, um zu verhindern, dass Objekte gerendert werden, die außerhalb des Viewports liegen. Dies funktioniert gut für Spiele, die in einem kleinen Gebiet stattfinden, jedoch können die Dinge in größeren Ebenen schnell problematisch werden.
zh_tw: Godot會自動執行視圖視錐剔除, 以防止算繪視口外的物體. 這對於發生在小範圍內的遊戲來說效果很好, 然而在較大的關卡中, 事情很快就會變得很麻煩.

source: Occlusion culling
zh_tw: 遮擋剔除

source: Walking around a town for example, you may only be able to see a few buildings in the street you are in, as well as the sky and a few birds flying overhead. As far as a naive renderer is concerned however, you can still see the entire town. It won't just render the buildings in front of you, it will render the street behind that, with the people on that street, the buildings behind that. You quickly end up in situations where you are attempting to render 10× or 100× more than what is visible.
de: Wenn Sie beispielsweise durch eine Stadt spazieren, sehen Sie vielleicht nur einige Gebäude in der Straße, in der Sie sich befinden, sowie den Himmel und ein paar Vögel, die über Ihnen fliegen. Aus der Sicht eines naiven Renderers können Sie jedoch die gesamte Stadt sehen. Es werden nicht nur die Gebäude vor Ihnen gerendert, sondern auch die Straße dahinter, mit den Menschen auf dieser Straße und den Gebäuden dahinter. Man kommt schnell in Situationen, in denen man versucht, das 10- oder 100-fache dessen zu rendern, was sichtbar ist.
zh_tw: 比如走在一個小鎮上, 你可能只能看到你所在的街道上的幾棟建築, 以及天空和幾隻飛過頭頂的鳥. 然而就一個天真的算繪器而言, 你仍然可以看到整個小鎮. 它不會只算繪你前面的建築, 它會算繪那後面的街道, 與那條街上的人, 那後面的建築. 你很快就會遇到這樣的情況: 你試圖算繪比可見的東西多10倍或100倍的東西.

source: Things aren't quite as bad as they seem, because the Z-buffer usually allows the GPU to only fully shade the objects that are at the front. This is called *depth prepass* and is enabled by default in Godot when using the Forward+ or Compatibility rendering methods. However, unneeded objects are still reducing performance.
de: Die Dinge sind nicht ganz so schlimm, wie sie scheinen, denn der Z-Puffer erlaubt es der GPU in der Regel, nur Shading auf Objekte anzuwenden, die sich im Vordergrund befinden. Dies wird als *Tiefen-Vordurchlauf* bezeichnet und ist in Godot standardmäßig aktiviert, wenn die Rendering-Methoden Forward+ oder Kompatibilität verwendet werden. Nicht benötigte Objekte beeinträchtigen jedoch weiterhin die Performance.
zh_tw: 事情並沒有看上去那麼糟糕，因為 Z 緩衝通常只允許 GPU 完全遮擋在前面的物體。這被稱為*深度預處理*（depth prepass），在使用 GLES3 算繪器時，Godot 預設啟用。然而，不需要的物件仍然在降低性能。

source: One way we can potentially reduce the amount to be rendered is to **take advantage of occlusion**. Godot 4.0 and later offers a new approach to occlusion culling using occluder nodes. See :ref:`doc_occlusion_culling` for instructions on setting up occlusion culling in your scene.
de: Eine Möglichkeit, die zu rendernde Menge zu reduzieren, besteht darin, **die Vorteile von Occlusion** zu nutzen. Godot 4.0 und spätere Versionen bieten einen neuen Ansatz für die Occlusion Culling unter Verwendung von Occluder-Nodes. Siehe :ref:`doc_occlusion_culling` für Anweisungen zum Einrichten der Occlusion Culling in Ihrer Szene.
zh_tw: 我們可以減少算繪量的一種方法是**利用遮蔽**。 Godot 4.0 及更高版本提供了一種使用遮擋器節點進行遮蔽剔除的新方法。有關在場景中設定遮蔽剔除的說明，請參閱 doc_occlusion_culling`。

source: In some cases, you may have to adapt your level design to add more occlusion opportunities. For example, you may have to add more walls to prevent the player from seeing too far away, which would decrease performance due to the lost opportunities for occlusion culling.
de: In manchen Fällen müssen Sie Ihr Leveldesign anpassen, um mehr Occlusion-Möglichkeiten zu schaffen. So müssen Sie beispielsweise mehr Wände hinzufügen, um zu verhindern, dass der Spieler zu weit weg sehen kann, was die Performance aufgrund der verlorenen Möglichkeiten für das Occlusion Culling verringern würde.
zh_tw: 在某些情況下，你可以通過調整你的關卡設計來增加更多的遮擋機會。例如，你可以增加更多的牆來防止玩家看得太遠，否則就會因為失去了遮擋機會而降低性能。

source: Transparent objects
de: Transparente Objekte
zh_tw: 透明物體

source: Godot sorts objects by :ref:`Material <class_Material>` and :ref:`Shader <class_Shader>` to improve performance. This, however, can not be done with transparent objects. Transparent objects are rendered from back to front to make blending with what is behind work. As a result, **try to use as few transparent objects as possible**. If an object has a small section with transparency, try to make that section a separate surface with its own material.
de: Godot sortiert Objekte nach :ref:`Material <class_Material>` und :ref:`Shader <class_Shader>`, um die Performance zu verbessern. Dies kann jedoch nicht mit transparenten Objekten gemacht werden. Transparente Objekte werden von hinten nach vorne gerendert, damit das Blending mit dem, was dahinter ist, funktioniert. Versuchen Sie daher, **so wenig transparente Objekte wie möglich** zu verwenden. Wenn ein Objekt einen kleinen Bereich mit Transparenz hat, versuchen Sie, diesen Bereich zu einer separaten Oberfläche mit eigenem Material zu machen.
zh_tw: Godot通過 :ref:`Material <class_Material>` 和 :ref:`Shader <class_Shader>` 對對象進行排序以提高性能. 然而, 這對透明物體來說是不可能的. 透明物體從後往前算繪, 以便與後面的物體混合. 因此, **儘量少使用透明物件** . 如果一個物體有一小部分是透明的, 儘量讓這部分成為一個獨立的表面, 有自己的材質.

source: For more information, see the :ref:`GPU optimizations <doc_gpu_optimization>` doc.
de: Für mehr Informationen siehe die Seite :ref:`GPU optimizations <doc_gpu_optimization>`.
zh_tw: 更多資訊請參考 :ref:`doc_c_sharp_differences` 一頁。

source: Level of detail (LOD)
zh_tw: 細節程度（LOD）

source: In some situations, particularly at a distance, it can be a good idea to **replace complex geometry with simpler versions**. The end user will probably not be able to see much difference. Consider looking at a large number of trees in the far distance. There are several strategies for replacing models at varying distance. You could use lower poly models, or use transparency to simulate more complex geometry.
de: In manchen Situationen, insbesondere aus der Entfernung, kann es sinnvoll sein, **komplexe Geometrie durch einfachere Versionen** zu ersetzen. Der Endbenutzer wird wahrscheinlich keinen großen Unterschied feststellen können. Betrachten Sie beispielsweise eine große Anzahl von Bäumen in der Ferne. Es gibt mehrere Strategien für das Ersetzen von Modellen in unterschiedlichen Entfernungen. Sie könnten Modelle mit niedrigeren Polygraden verwenden oder Transparenz einsetzen, um eine komplexere Geometrie zu simulieren.
zh_tw: 在某些情況下, 特別是在遠處, 用簡單的版本**代替複雜的幾何圖形可能是個好主意. 最終使用者可能看不出什麼區別. 考慮看看遠處的大量樹木. 有幾種策略可以替換不同距離的模型. 您可以使用較低的多邊形模型, 或者使用透明度來模擬更複雜的幾何體.

source: Godot 4 offers several ways to control level of detail:
de: Godot 4 bietet mehrere Möglichkeiten zur Steuerung des Level of Detail:
zh_tw: Godot 4 提供了多種控制細節等級的方法：

source: An automatic approach on mesh import using :ref:`doc_mesh_lod`.
de: Ein automatischer Ansatz für den Mesh-Import mit :ref:`doc_mesh_lod`.
zh_tw: 使用 doc_mesh_lod 進行網格匯入的自動方法。

source: A manual approach configured in the 3D node using :ref:`doc_visibility_ranges`.
de: Ein manueller Ansatz, der im 3D-Node mit :ref:`doc_visibility_ranges` konfiguriert wird.
zh_tw: 使用 doc_visibility_ranges 在 3D 節點中配置的手動方法。

source: :ref:`Decals <doc_using_decals>` and :ref:`lights <doc_lights_and_shadows>` can also benefit from level of detail using their respective **Distance Fade** properties.
de: :ref:`Decals <doc_using_decals>` und :ref:`Lichtquellen <doc_lights_and_shadows>` können ebenfalls von Level of Detail profitieren, indem sie ihre jeweiligen **Fernausblendung**-Propertys verwenden.
zh_tw: 貼紙 <doc_using_decals>` 和燈光 <doc_lights_and_shadows>` 也可以使用各自的 **距離淡入淡出** 屬性從細節等級中受益。

source: While they can be used independently, these approaches are most effective when used together. For example, you can set up visibility ranges to hide particle effects that are too far away from the player to notice. At the same time, you can rely on mesh LOD to make the particle effect's meshes rendered with less detail at a distance.
de: Obwohl sie unabhängig voneinander verwendet werden können, sind diese Ansätze am effektivsten, wenn sie zusammen eingesetzt werden. Sie können zum Beispiel Sichtbarkeitsbereiche einrichten, um Partikeleffekte auszublenden, die zu weit vom Spieler entfernt sind, um sie zu bemerken. Gleichzeitig können Sie sich auf Mesh-LOD verlassen, um die Meshes des Partikeleffekts in der Entfernung mit weniger Details zu rendern.
zh_tw: 雖然它們可以單獨使用，但一起使用時這些方法最有效。例如，您可以設定可見範圍來隱藏距離玩家太遠而無法注意到的粒子效果。同時，您可以依靠網格 LOD 來使粒子效果的網格在遠處算繪時細節較少。

source: Visibility ranges are also a good way to set up *impostors* for distant geometry (see below).
de: Sichtbarkeitsbereiche sind auch eine gute Möglichkeit, *Imposter* für entfernte Geometrien einzurichten (siehe unten).
zh_tw: 可見範圍也是為遠處幾何體設定「冒充者」的好方法（見下文）。

source: Billboards and imposters
de: Billboards und Imposter
zh_tw: Billboard 和 imposter

source: The simplest version of using transparency to deal with LOD is billboards. For example, you can use a single transparent quad to represent a tree at distance. This can be very cheap to render, unless of course, there are many trees in front of each other. In this case, transparency may start eating into fill rate (for more information on fill rate, see :ref:`doc_gpu_optimization`).
de: Die einfachste Version der Verwendung von Transparenz zur Handhabung von LOD sind Billboards. Sie können zum Beispiel ein einzelnes transparentes Quad verwenden, um einen Baum in der Ferne darzustellen. Dies kann sehr billig zu rendern, es sei denn natürlich, es gibt viele Bäume voreinander. In diesem Fall kann sich die Transparenz auf die Füllrate auswirken (weitere Informationen zur Füllrate finden Sie unter :ref:`doc_gpu_optimization`).
zh_tw: 使用透明度來處理LOD的最簡單版本是看板. 例如, 你可以用一個單一的透明四邊形來表示一棵樹的距離. 這可以是非常便宜的算繪, 當然, 除非前面有很多樹. 在這種情況下, 透明度可能會開始吞噬填充率(關於填充率的更多資訊, 請參見 :ref:`doc_gpu_optimization`).

source: An alternative is to render not just one tree, but a number of trees together as a group. This can be especially effective if you can see an area but cannot physically approach it in a game.
de: Eine Alternative besteht darin, nicht nur einen Baum, sondern mehrere Bäume als Gruppe zusammen zu rendern. Dies kann besonders effektiv sein, wenn Sie im Spiel einen Bereich sehen, sich diesem jedoch nicht nähern können.
zh_tw: 另一種方法是不只算繪一棵樹, 而是將一些樹作為一組來算繪. 如果你能看到一個區域, 但在遊戲中不能實際接近它, 這可能是特別有效的.

source: You can make imposters by pre-rendering views of an object at different angles. Or you can even go one step further, and periodically re-render a view of an object onto a texture to be used as an imposter. At a distance, you need to move the viewer a considerable distance for the angle of view to change significantly. This can be complex to get working, but may be worth it depending on the type of project you are making.
de: Sie können Imposter erstellen, indem Sie Ansichten eines Objekts in verschiedenen Winkeln vorrendern. Sie können sogar noch einen Schritt weiter gehen und eine Ansicht eines Objekts in regelmäßigen Abständen auf eine Textur übertragen, die als Imposter verwendet werden soll. In einiger Entfernung müssen Sie den Betrachter um eine beträchtliche Entfernung bewegen, damit sich der Blickwinkel erheblich ändert. Dies kann aufwendig sein bis es läuft, kann sich jedoch je nach Art des von Ihnen durchgeführten Projekts lohnen.
zh_tw: 你可以通過預先算繪物件的不同角度的視圖來製作冒牌貨. 或者你甚至可以更進一步, 週期性地將一個物體的視圖重新算繪到一個紋理上, 作為一個冒牌貨使用. 在遠處, 你需要將觀察者移動相當長的距離, 視角才會發生顯著變化. 這可能是複雜的工作, 但可能是值得的, 這取決於你正在製作的專案型別.

source: Use instancing (MultiMesh)
de: Intanzen verwenden (MultiMesh)
zh_tw: 使用產生實體（MultiMesh）

source: If several identical objects have to be drawn in the same place or nearby, try using :ref:`MultiMesh <class_MultiMesh>` instead. MultiMesh allows the drawing of many thousands of objects at very little performance cost, making it ideal for flocks, grass, particles, and anything else where you have thousands of identical objects.
de: Wenn mehrere identische Objekte am selben Ort oder in der Nähe gezeichnet werden müssen, verwenden Sie stattdessen ein :ref:`MultiMesh <class_MultiMesh>`. MultiMesh ermöglicht das Zeichnen von vielen tausend Objekten zu sehr geringen Performancekosten. Dies macht es ideal für Herden, Gras, Partikel und alles andere, bei dem Sie Tausende identischer Objekte haben.
zh_tw: 如果必須在同一地點或附近繪製多個相同的物件, 請嘗試使用 :ref:`MultiMesh <class_MultiMesh>` 來代替.MultiMesh允許以很小的性能代價來繪製成千上萬的對象, 這使得它非常適合用於繪製羊群, 草地, 粒子以及其他任何有成千上萬相同物件的地方.

source: See also the :ref:`Using MultiMesh <doc_using_multimesh>` documentation.
de: Siehe auch die :ref:`Verwendung von MultiMesh <doc_using_multimesh>`-Dokumentation.
zh_tw: 另請參閱 :ref:`Using MultiMesh <doc_using_multimesh>` 文件.

source: Bake lighting
de: Beleuchtung backen
zh_tw: 烘焙照明

source: Lighting objects is one of the most costly rendering operations. Realtime lighting, shadows (especially multiple lights), and :ref:`global illumination <doc_introduction_to_global_illumination>` are especially expensive. They may simply be too much for lower power mobile devices to handle.
de: Die Beleuchtung von Objekten ist eine der kostspieligsten Rendering-Operationen. Echtzeit-Beleuchtung, Schatten (insbesondere mehrere Lichter) und :ref:`Global Illumination <doc_introduction_to_global_illumination>` sind besonders teuer. Sie können für mobile Geräte mit geringerer Leistung einfach zu viel sein.
zh_tw: 對物體進行照明是最昂貴的算繪操作之一. 即時光照, 陰影(尤其是很多燈光)和 GI 都特別昂貴. 對於低功率的移動裝置來說, 它們可能根本無法處理.

source: **Consider using baked lighting**, especially for mobile. This can look fantastic, but has the downside that it will not be dynamic. Sometimes, this is a tradeoff worth making.
de: **Erwägen Sie die Verwendung von gebackener Beleuchtung**, insbesondere für mobile Geräte. Das kann fantastisch aussehen, hat aber den Nachteil, dass es nicht dynamisch ist. Manchmal ist dies ein lohnender Kompromiss.
zh_tw: **考慮使用烘焙照明** , 尤其是移動端, 這看起來很棒, 但有一個缺點, 那就是它不是動態的, 有時, 這需要做出的權衡.

source: See :ref:`doc_using_lightmap_gi` for instructions on using baked lightmaps. For best performance, you should set lights' bake mode to **Static** as opposed to the default **Dynamic**, as this will skip real-time lighting on meshes that have baked lighting.
de: Siehe :ref:`doc_using_lightmap_gi` für Anweisungen zur Verwendung von gebackenen Lightmaps. Um die beste Performance zu erzielen, sollten Sie den Back-Modus der Lichtquellen auf **Statisch** setzen, im Gegensatz zum Default **Dynamisch**, da dies die Echtzeit-Beleuchtung für Meshes mit gebackener Beleuchtung überspringt.
zh_tw: 有關使用烘焙光照貼圖的說明，請參閱 doc_using_lightmap_gi。為了獲得最佳性能，您應該將燈光的烘焙模式設定為**靜態**，而不是預設的**動態**，因為這將跳過具有烘焙光照的網格體上的即時光照。

source: The downside of lights with the **Static** bake mode is that they can't cast shadows onto meshes with baked lighting. This can make scenes with outdoor environments and dynamic objects look flat. A good balance between performance and quality is to keep **Dynamic** for the :ref:`class_DirectionalLight3D` node, and use **Static** for most (if not all) omni and spot lights.
de: Der Nachteil von Lichtqueleln mit dem Back-Modus **Statisch** ist, dass sie keine Schatten auf Meshes mit gebackener Beleuchtung werfen können. Dies kann dazu führen, dass Szenen mit Außenbereichen und dynamischen Objekten flach aussehen. Ein gutes Gleichgewicht zwischen Performance und Qualität besteht darin, **Dynamisch** für den Node :ref:`class_DirectionalLight3D` beizubehalten und **Statisch** für die meisten (wenn nicht alle) Omni- und Spot-Lichterquellen zu verwenden.
zh_tw: 使用**靜態**烘焙模式的燈光的缺點是它們無法將陰影投射到具有烘焙光照的網格上。這可以使具有室外環境和動態物件的場景看起來平坦。效能和品質之間的良好平衡是為 class_DirectionalLight3D 節點保持**動態**，並為大多數（如果不是全部）全向燈和聚光燈使用**靜態**。

source: Animation and skinning
de: Animation und Skinning
zh_tw: Animation - 動畫選項

source: Animation and vertex animation such as skinning and morphing can be very expensive on some platforms. You may need to lower the polycount considerably for animated models, or limit the number of them on screen at any given time. You can also reduce the animation rate for distant or occluded meshes, or pause the animation entirely if the player is unlikely to notice the animation being stopped.
de: Animation und Vertex-Animation wie Skinning und Morphing können auf einigen Plattformen sehr teuer sein. Möglicherweise müssen Sie die Polygonanzahl für animierte Modelle erheblich reduzieren oder die Anzahl der Modelle auf dem Bildschirm begrenzen. Sie können auch die Animationsrate für weit entfernte oder verdeckte Meshes verringern oder die Animation ganz anhalten, wenn der Spieler wahrscheinlich nicht bemerkt, dass die Animation angehalten wird.
zh_tw: 在某些平臺上, 動畫和頂點動畫(如換膚和變形)可能非常昂貴. 你可能需要大大降低動畫模型的多邊形數量, 或者任何時候限制螢幕上的模型數量.

source: The :ref:`class_VisibleOnScreenEnabler3D` and :ref:`class_VisibleOnScreenNotifier3D` nodes can be useful for this purpose.
de: Die Nodes :ref:`class_VisibleOnScreenEnabler3D` und :ref:`class_VisibleOnScreenNotifier3D` können für diesen Zweck nützlich sein.
zh_tw: class_VisibleOnScreenEnabler3D 和 class_VisibleOnScreenNotifier3D 節點可用於此目的。

source: Large worlds
de: Große Welten
zh_tw: 龐大的世界

source: If you are making large worlds, there are different considerations than what you may be familiar with from smaller games.
de: Wenn Sie große Welten erstellen, müssen Sie andere Überlegungen anstellen, als Sie es vielleicht von kleineren Spielen kennen.
zh_tw: 如果您要製作大型遊戲, 則與小型遊戲可能會有所不同.

source: Large worlds may need to be built in tiles that can be loaded on demand as you move around the world. This can prevent memory use from getting out of hand, and also limit the processing needed to the local area.
de: Große Welten müssen möglicherweise in Kacheln gebaut werden, die bei Bedarf geladen werden können, wenn Sie sich in der Welt bewegen. Dies beschränkt die erforderliche Verarbeitung auf den lokalen Bereich und kann verhindern, dass die Speichernutzung außer Kontrolle gerät.
zh_tw: 大型的世界可能需要用碎片建立, 可以在你在世界中移動時按需載入, 這可以防止記憶體使用失控, 也可以將所需的處理限制在局部區域.

source: There may also be rendering and physics glitches due to floating point error in large worlds. This can be resolved using :ref:`doc_large_world_coordinates`. If using large world coordinates is an option, you may be able to use techniques such as orienting the world around the player (rather than the other way around), or shifting the origin periodically to keep things centred around ``Vector3(0, 0, 0)``.
de: Es kann auch zu Rendering- und Physikproblemen aufgrund von Float-Fehlern in großen Welten kommen. Dies kann mit :ref:`doc_large_world_coordinates` behoben werden. Wenn die Verwendung von Große-Welt-Koordinaten eine Option ist, können Sie vielleicht Techniken wie die Ausrichtung der Welt um den Spieler (statt umgekehrt) oder das periodische Verschieben des Ursprungs verwenden, um die Dinge um ``Vector3(0, 0, 0)`` zu zentrieren.
zh_tw: 在大型世界中, 由於浮點錯誤, 也可能會出現算繪和物理故障, 你可能會使用一些技術, 比如將世界圍繞著玩家的方向(而不是相反), 或者定期移動原點以保持以 ``Vector3(0, 0, 0)`` 為中心.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
