Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_multiple_threads.po
Languages: de, zh_tw

source: Using multiple threads
de: Mehrere Threads verwenden
zh_tw: 使用多執行緒

source: Threads
zh_tw: 執行緒

source: Threads allow simultaneous execution of code. It allows off-loading work from the main thread.
de: Threads ermöglichen die gleichzeitige Ausführung von Code. Es ermöglicht das Auslagern von Rechenlast aus dem Hauptprogramm.
zh_tw: 執行緒允許同時執行程式碼。它允許從主執行緒解除安裝工作。

source: Godot supports threads and provides many handy functions to use them.
de: Godot unterstützt Threads und bietet viele praktische Funktionen, um sie zu verwenden.
zh_tw: Godot 支援執行緒，並提供了許多方便使用的功能。

source: If using other languages (C#, C++), it may be easier to use the threading classes they support.
de: Wenn Sie andere Sprachen verwenden (C#, C++), ist es möglicherweise einfacher, die von ihnen unterstützten Threading-Klassen zu verwenden.
zh_tw: 如果使用其他語言（C#、C++），它們支援的執行緒類可能會更容易使用。

source: Before using a built-in class in a thread, read :ref:`doc_thread_safe_apis` first to check whether it can be safely used in a thread.
de: Bevor Sie eine Built-in-Klasse in einem Thread verwenden, lesen Sie zuerst :ref:`doc_thread_safe_apis`, um zu prüfen, ob sie sicher in einem Thread verwendet werden kann.
zh_tw: 在執行緒中使用內建類之前，請先閱讀 :ref:`doc_thread_safe_apis`，檢查在執行緒中使用是否安全。

source: Creating a Thread
de: Erstellen eines Threads
zh_tw: 建立內容

source: To create a thread, use the following code:
de: Um einen Thread zu erstellen, verwenden Sie den folgenden Code:
zh_tw: 有下列事項需注意：

source: Your function will, then, run in a separate thread until it returns. Even if the function has returned already, the thread must collect it, so call :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>`, which will wait until the thread is done (if not done yet), then properly dispose of it.
de: Ihre Funktion wird dann in einem separaten Thread ausgeführt, bis sie zurückkehrt. Selbst wenn die Funktion bereits zurückgekehrt ist, muss der Thread sie einsammeln, also rufen Sie die Funktion :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>` auf, die wartet, bis der Thread fertig ist (wenn er nicht bereits fertig ist), und ihn dann ordnungsgemäß entsorgt.
zh_tw: 然後, 你的函式將在一個單獨的執行緒中運作, 直到它返回. 即使函式已經返回, 執行緒也必須收集它, 所以呼叫 :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>` , 它將等待中的執行緒完成(如果還沒有完成), 然後妥善處理它.

source: Creating threads at run-time is slow on Windows and should be avoided to prevent stuttering. Semaphores, explained later on this page, should be used instead.
de: Das Erstellen von Threads zur Laufzeit ist unter Windows langsam und sollte vermieden werden, um Stuttering zu vermeiden. Stattdessen sollten Semaphoren verwendet werden, die weiter unten auf dieser Seite erläutert werden.
zh_tw: 在 Windows 上，在執行時間建立執行緒速度很慢，應該避免，以防止卡頓出現。應改用訊號量（本頁稍後將對此進行解釋）。

source: Mutexes
zh_tw: Mutex

source: Accessing objects or data from multiple threads is not always supported (if you do it, it will cause unexpected behaviors or crashes). Read the :ref:`doc_thread_safe_apis` documentation to understand which engine APIs support multiple thread access.
de: Der Zugriff auf Objekte oder Daten von mehreren Threads aus wird nicht immer unterstützt (wenn Sie es tun, führt es zu unerwartetem Verhalten oder Abstürzen). Lesen Sie die Dokumentation :ref:`doc_thread_safe_apis`, um zu verstehen, welche Engine-APIs den Zugriff über mehrere Threads unterstützen.
zh_tw: 並不總是支援從多個執行緒存取物件或資料(如果你這樣做, 會導致意外行為或當機). 請閱讀 :ref:`doc_thread_safe_apis` 文件, 瞭解哪些引擎API支援多執行緒存取.

source: When processing your own data or calling your own functions, as a rule, try to avoid accessing the same data directly from different threads. You may run into synchronization problems, as the data is not always updated between CPU cores when modified. Always use a :ref:`Mutex<class_Mutex>` when accessing a piece of data from different threads.
de: Wenn Sie Ihre eigenen Daten verarbeiten oder Ihre eigenen Funktionen aufrufen, sollten Sie in der Regel vermeiden, von verschiedenen Threads aus direkt auf dieselben Daten zuzugreifen. Es kann zu Synchronisationsproblemen kommen, da die Daten bei Änderungen nicht immer zwischen den CPU-Kernen aktualisiert werden. Verwenden Sie immer einen :ref:`Mutex<class_Mutex>`, wenn Sie von verschiedenen Threads aus auf ein Datenelement zugreifen.
zh_tw: 在處理自己的資料或呼叫自己的函式時, 通常情況下, 儘量避免從不同的執行緒直接存取相同的資料. 你可能會遇到同步問題, 因為資料被修改後,CPU核之間並不總是更新. 當從不同執行緒存取一個資料時, 一定要使用 :ref:`Mutex<class_Mutex>` .

source: When calling :ref:`Mutex.lock()<class_Mutex_method_lock>`, a thread ensures that all other threads will be blocked (put on suspended state) if they try to *lock* the same mutex. When the mutex is unlocked by calling :ref:`Mutex.unlock()<class_Mutex_method_unlock>`, the other threads will be allowed to proceed with the lock (but only one at a time).
de: Wenn ein Thread :ref:`Mutex.lock()<class_Mutex_method_lock>` aufruft, stellt er sicher, dass alle anderen Threads blockiert (in den Suspended-Zustand versetzt) werden, wenn sie versuchen, denselben Mutex zu *sperren*. Wenn der Mutex durch den Aufruf von :ref:`Mutex.unlock()<class_Mutex_method_unlock>` entsperrt wird, können die anderen Threads mit dem Lock fortfahren (aber nur einer nach dem anderen).
zh_tw: 當呼叫 :ref:`Mutex.lock()<class_Mutex_method_lock>` 時, 一個執行緒確保所有其他執行緒如果試圖 *鎖* 同一個mutex, 就會被阻塞(進入暫停狀態). 當通過呼叫 :ref:`Mutex.unlock()<class_Mutex_method_unlock>` 來解鎖該mutex時, 其他執行緒將被允許繼續鎖定(但每次只能鎖定一個).

source: Here is an example of using a Mutex:
de: Hier ist ein Beispiel für die Verwendung eines Mutex:
zh_tw: 下面是一個使用 Mutex 的例子:

source: Semaphores
de: Semaphoren
zh_tw: Semaphore

source: Sometimes you want your thread to work *"on demand"*. In other words, tell it when to work and let it suspend when it isn't doing anything. For this, :ref:`Semaphores<class_Semaphore>` are used. The function :ref:`Semaphore.wait()<class_Semaphore_method_wait>` is used in the thread to suspend it until some data arrives.
de: Manchmal möchten Sie, dass Ihr Thread *"auf Anforderung"* arbeitet. Mit anderen Worten, sagen Sie ihm, wann er arbeiten soll und pausieren Sie ihn, wenn er nichts zu tun hat. Dafür werden :ref:`Semaphores<class_Semaphore>` verwendet. Die Funktion :ref:`Semaphore.wait()<class_Semaphore_method_wait>` wird im Thread benutzt, um ihn zu pausieren, bis Daten ankommen.
zh_tw: 有時你希望你的執行緒能“按需”工作。換句話說，告訴它什麼時候工作，讓它在不工作的時候暫停。為此，可以使用訊號量 :ref:`Semaphore <class_Semaphore>`。執行緒中使用函式 :ref:`Semaphore.wait()<class_Semaphore_method_wait>` 來暫停它的工作，直到有資料到達。

source: The main thread, instead, uses :ref:`Semaphore.post()<class_Semaphore_method_post>` to signal that data is ready to be processed:
de: Der Hauptthread verwendet stattdessen :ref:`Semaphore.post()<class_Semaphore_method_post>`, um zu signalisieren, dass die Daten zur Verarbeitung bereit sind:
zh_tw: 而主執行緒則使用 :ref:`Semaphore.post()<class_Semaphore_method_post>` 來表示資料已經準備好被處理:

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
