Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_servers.po
Languages: de, zh_tw

source: Optimization using Servers
de: Optimierung mit Servern
zh_tw: 使用伺服器進行優化

source: Engines like Godot provide increased ease of use thanks to their high level constructs and features. Most of them are accessed and used via the :ref:`Scene System<doc_scene_tree>`. Using nodes and resources simplifies project organization and asset management in complex games.
de: Engines wie Godot bieten dank ihrer High-Level-Konstrukte und -Funktionen eine größere Benutzerfreundlichkeit. Die meisten von ihnen werden über das :ref:`Scene System<doc_scene_tree>` angesprochen und verwendet. Die Verwendung von Nodes und Ressourcen vereinfacht die Projektorganisation und das Asset-Management in komplexen Spielen.
zh_tw: 像 Godot 這樣的引擎，由於其更高層次的建構和功能，提供了更多的易用性。它們中的大多數都是通過:ref:`場景系統 <doc_scene_tree>`來存取和使用的。使用節點和資源可以簡化複雜遊戲中的專案組織和素材管理。

source: There are, of course, always drawbacks:
de: Natürlich gibt es immer auch Nachteile:
zh_tw: 當然, 總是有缺點的:

source: There is an extra layer of complexity.
de: Es gibt eine zusätzliche Komplexitätsebene.
zh_tw: 那有一個額外複雜層。

source: Performance is lower than when using simple APIs directly.
de: Die Performance ist geringer als bei der direkten Verwendung einfacher APIs.
zh_tw: 性能比直接使用簡單API要低。

source: It is not possible to use multiple threads to control them.
de: Es ist nicht möglich, mehrere Threads zu verwenden, um sie zu kontrollieren.
zh_tw: 也可以有條件地複寫選項：

source: More memory is needed.
de: Mehr Speicher wird benötigt.
zh_tw: 需要更多的記憶體.

source: In many cases, this is not really a problem (Godot is very optimized, and most operations are handled with signals, so no polling is required). Still, sometimes it can be. For example, dealing with tens of thousands of instances for something that needs to be processed every frame can be a bottleneck.
de: In vielen Fällen stellt dies kein wirkliches Problem dar (Godot ist sehr optimiert und die meisten Prozesse werden an Signale weitergegeben, sodass keine Polling erforderlich ist). Dennoch kann es manchmal zu einem Bottleneck führen, etwa, wenn zehntausende Instanzen in einem Frame verarbeitet werden müssen.
zh_tw: 在很多情況下, 這並不是一個真正的問題(Godot是非常優化的, 大多數操作都是用訊號處理的, 所以不需要輪詢). 不過, 有時候還是會有這樣的情況. 例如, 對於每一影格都需要處理的東西來說, 處理數以萬計的實例可能是一個瓶頸.

source: This type of situation makes programmers regret they are using a game engine and wish they could go back to a more handcrafted, low level implementation of game code.
de: Diese Art von Situation lässt Programmierer bedauern, dass sie eine Spiele-Engine verwenden, und sie wünschen sich, sie könnten zu einer handgefertigten Low-Level-Implementierung von Spielecode zurückkehren.
zh_tw: 這種情況會讓程式師後悔自己使用的是遊戲引擎, 希望能回到更加手動, 更加低層的遊戲程式碼實作中去.

source: Still, Godot is designed to work around this problem.
de: Dennoch ist Godot darauf ausgelegt, dieses Problem zu umgehen.
zh_tw: 當然,Godot的設計工作中還是可以解決這個問題.

source: You can see how using low-level servers works in action using the `Bullet Shower demo project <https://github.com/godotengine/godot-demo-projects/tree/master/2d/bullet_shower>`__
de: Wie die Verwendung von Low-Level-Servern in der Praxis funktioniert, können Sie anhand des `Bullet Shower-Demoprojekts <https://github.com/godotengine/godot-demo-projects/tree/master/2d/bullet_shower>`__ sehen
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Servers
de: Server
zh_tw: 伺服器

source: One of the most interesting design decisions for Godot is the fact that the whole scene system is *optional*. While it is not currently possible to compile it out, it can be completely bypassed.
de: Eine der interessantesten Designentscheidungen für Godot ist die Tatsache, dass das gesamte Szenensystem *optional* ist. Während es derzeit nicht möglich ist, es herauszukompilieren, kann es vollständig umgangen werden.
zh_tw: Godot 有許多非常有趣的設計決定，其中之一就是整個場景系統都是*可選的*。雖然目前還不能在編譯時去除，但你完全可以繞過它。

source: At the core, Godot uses the concept of Servers. They are very low-level APIs to control rendering, physics, sound, etc. The scene system is built on top of them and uses them directly. The most common servers are:
de: Im Kern verwendet Godot das Konzept der Server. Es handelt sich um Low-Level-APIs zur Steuerung von Rendering, Physik, Sound usw. Das Szenensystem ist darauf aufgebaut und verwendet sie direkt. Die gängigsten Server sind:
zh_tw: Godot 在核心中使用了“伺服器”的概念。它們是非常底層的 API，用來控制算繪、物理、聲音等。場景系統建立在它們之上，直接使用它們。最常見的伺服器有：

source: :ref:`RenderingServer <class_RenderingServer>`: handles everything related to graphics.
de: :ref:`RenderingServer <class_RenderingServer>`: behandelt alles, was mit Grafik zu tun hat.
zh_tw: :ref:`RenderingServer <class_RenderingServer>`: 處理所有與圖形相關的內容。

source: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: handles everything related to 3D physics.
de: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: kümmert sich um alles rund um 3D-Physik.
zh_tw: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: 處理所有與 3D 物理相關的內容。

source: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: handles everything related to 2D physics.
de: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: kümmert sich um alles rund um 2D-Physik.
zh_tw: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: 處理所有與 2D 物理相關的內容。

source: :ref:`AudioServer <class_AudioServer>`: handles everything related to audio.
de: :ref:`AudioServer <class_AudioServer>`: kümmert sich um alles rund um Audio.
zh_tw: :ref:`AudioServer <class_AudioServer>`: 處理與音訊相關的一切.

source: Explore their APIs and you will realize that all the functions provided are low-level implementations of everything Godot allows you to do.
de: Wenn Sie nur die APIs untersuchen, werden Sie feststellen, dass alle bereitgestellten Funktionen Low-Level-Implementierungen von allem sind, was Godot Ihnen ermöglicht.
zh_tw: 你只需研究它們的 API 就會意識到，它們所提供的函式全部都是 Godot 允許你所進行的操作的底層實作。

source: RIDs
zh_tw: RID

source: The key to using servers is understanding Resource ID (:ref:`RID <class_RID>`) objects. These are opaque handles to the server implementation. They are allocated and freed manually. Almost every function in the servers requires RIDs to access the actual resource.
de: Der Schlüssel zur Verwendung von Servern liegt im Verständnis von Resource-ID-Objekten (:ref:`RID <class_RID>`). Diese stellen undurchsichtige Referenzen auf die jeweilige Server-Implementierung dar. Sie werden manuell alloziert und freigegeben. Fast jede Funktion in den Servern erfordert RIDs, um auf die tatsächliche Ressource zugreifen zu können.
zh_tw: 使用伺服器的關鍵是理解資源 ID（Resource ID，即 :ref:`RID <class_RID>`）對象。這些物件是伺服器實作的非公開的控制碼。它們是手動分配和釋放的。幾乎伺服器中的每個功能都需要 RID 來存取實際的資源。

source: Most Godot nodes and resources contain these RIDs from the servers internally, and they can be obtained with different functions. In fact, anything that inherits :ref:`Resource <class_Resource>` can be directly casted to an RID. Not all resources contain an RID, though: in such cases, the RID will be empty. The resource can then be passed to server APIs as an RID.
de: Den meisten Godot-Nodes und -Ressourcen wird diese RIDs aus den Servern intern zugewiesen und sie können mit verschiedenen Funktionen abgerufen werden. Tatsächlich kann alles, was von :ref:`Resource <class_Resource>` erbt, direkt in eine RID umgewandelt werden. Nicht alle Ressourcen enthalten jedoch eine RID; in solchen Fällen ist sie leer. Die Ressource kann dann per RID an Server-APIs übergeben werden.
zh_tw: 大多數 Godot 節點和資源都包含這些來自服務內部的 RID，它們可以通過不同的函式獲得。事實上，任何繼承 :ref:`Resource <class_Resource>` 的東西都可以直接轉換成 RID。不過並不是所有資源都包含 RID：在這種情況下，RID 為空。可以用 RID 的形式將資源傳遞給伺服器 API。

source: Resources are reference-counted (see :ref:`RefCounted <class_RefCounted>`), and references to a resource's RID are *not* counted when determining whether the resource is still in use. Make sure to keep a reference to the resource outside the server, or else both it and its RID will be erased.
de: Ressourcen werden per Reference Counting verwaltet (siehe :ref:`RefCounted <class_RefCounted>`), und Referenzen auf die RID einer Ressource werden *nicht* gezählt, wenn ermittelt wird, ob die Ressource noch in Gebrauch ist. Stellen Sie sicher, dass Sie eine Referenz auf die Ressource außerhalb des Servers aufbewahren, da sonst sowohl die Ressource als auch ihre RID gelöscht werden.
zh_tw: 資源是引用計數的（參閱 :ref:`RefCounted <class_RefCounted>`），並且對資源 RID 的引用在確定資源仍在使用時 *不* 進行計數。請確保在服務外部保持對資源的引用，否則將刪除資源及其 RID 。

source: For nodes, there are many functions available:
de: Für Nodes stehen viele Funktionen zur Verfügung:
zh_tw: 對於節點來說, 有很多函式功能可以使用:

source: For CanvasItem, the :ref:`CanvasItem.get_canvas_item() <class_CanvasItem_method_get_canvas_item>` method will return the canvas item RID in the server.
de: Für CanvasItem gibt die Methode :ref:`CanvasItem.get_canvas_item() <class_CanvasItem_method_get_canvas_item>` die RID des Canvas-Elements auf dem Server zurück.
zh_tw: 對於 CanvasItem，:ref:`CanvasItem.get_canvas_item()<class_CanvasItem_method_get_canvas_item>` 方法將在伺服器中返回該畫布專案的 RID。

source: For CanvasLayer, the :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` method will return the canvas RID in the server.
de: Für CanvasLayer gibt die Methode :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` die Canvas-RID auf dem Server zurück.
zh_tw: 對於CanvasLayer來說, :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` 方法將返回伺服器中的canvas RID.

source: For Viewport, the :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` method will return the viewport RID in the server.
de: Bei Viewports gibt die Methode :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` die RID des Viewports auf dem Server zurück.
zh_tw: 對於視口, :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` 方法將返回伺服器中的視口RID.

source: For 3D, the :ref:`World3D <class_World3D>` resource (obtainable in the :ref:`Viewport <class_Viewport>` and :ref:`Node3D <class_Node3D>` nodes) contains functions to get the *RenderingServer Scenario*, and the *PhysicsServer Space*. This allows creating 3D objects directly with the server API and using them.
de: Für 3D enthält die Ressource :ref:`World3D <class_World3D>` (erhältlich in den Nodes :ref:`Viewport <class_Viewport>` und :ref:`Node3D <class_Node3D>`) Funktionen, um das *RenderingServer Scenario* und den *PhysicsServer Space* zu erhalten. Dies ermöglicht es, 3D-Objekte direkt mit der Server-API zu erstellen und sie zu verwenden.
zh_tw: 對於3D, :ref:`World <class_World>` 資源(可在 :ref:`Viewport <class_Viewport>` 和 :ref:`Spatial <class_Spatial>` 節點中獲得)包含獲取 *VisualServer Scenario* 和 *PhysicsServer Space* 的函式. 這樣就可以直接用服務API建立3D物件並使用它們.

source: For 2D, the :ref:`World2D <class_World2D>` resource (obtainable in the :ref:`Viewport <class_Viewport>` and :ref:`CanvasItem <class_CanvasItem>` nodes) contains functions to get the *RenderingServer Canvas*, and the *Physics2DServer Space*. This allows creating 2D objects directly with the server API and using them.
de: Für 2D enthält die Ressource :ref:`World2D <class_World2D>` (erhältlich in den Nodes :ref:`Viewport <class_Viewport>` und :ref:`CanvasItem <class_CanvasItem>`) Funktionen zum Abrufen des *RenderingServer Canvas* und des *Physics2DServer Space*. Dies ermöglicht es, 2D-Objekte direkt mit der Server-API zu erstellen und sie zu verwenden.
zh_tw: 對於2D, :ref:`World2D <class_World2D>` 資源(可在 :ref:`Viewport <class_Viewport>` 和 :ref:`CanvasItem <class_CanvasItem>` 節點中獲取)包含獲取 *VisualServer Canvas* 和 *Physics2DServer Space* 的函式. 這樣就可以直接用服務API建立2D物件並使用它們.

source: The :ref:`VisualInstance3D<class_VisualInstance3D>` class, allows getting the scenario *instance* and *instance base* via the :ref:`VisualInstance3D.get_instance() <class_VisualInstance3D_method_get_instance>` and :ref:`VisualInstance3D.get_base() <class_VisualInstance3D_method_get_base>` respectively.
de: Die Klasse :ref:`VisualInstance3D<class_VisualInstance3D>` ermöglicht es, das Szenario *instance* und *instance base* über die :ref:`VisualInstance3D.get_instance() <class_VisualInstance3D_method_get_instance>` bzw. :ref:`VisualInstance3D.get_base() <class_VisualInstance3D_method_get_base>` zu erhalten.
zh_tw: :ref:`VisualInstance<class_VisualInstance>` 類, 可以分別通過 :ref:`VisualInstance.get_instance() <class_VisualInstance_method_get_instance>` 和 :ref:`VisualInstance.get_base() <class_VisualInstance_method_get_base>` 來獲取場景 *instance* 和 *instance base* .

source: Try exploring the nodes and resources you are familiar with and find the functions to obtain the server *RIDs*.
de: Versuchen Sie, die Ihnen bekannten Nodes und Ressourcen zu erkunden und die Funktionen zu finden, um die Server *RIDs* zu erhalten.
zh_tw: 請嘗試探索你所熟悉的節點和資源，找到獲得伺服器 *RID* 的功能。

source: It is not advised to control RIDs from objects that already have a node associated. Instead, server functions should always be used for creating and controlling new ones and interacting with the existing ones.
de: Es wird nicht empfohlen, RIDs von Objekten zu steuern, denen bereits ein Node zugeordnet ist. Stattdessen sollten immer Serverfunktionen verwendet werden, um neue RIDs zu erstellen und zu steuern und mit den vorhandenen RIDs zu interagieren.
zh_tw: 不建議從已經有節點關聯的物件中控制RID. 相反, 服務函式應始終用於建立和控制新的以及與現有的互動.

source: Creating a sprite
de: Ein Sprite erstellen
zh_tw: 建立內容

source: This is an example of how to create a sprite from code and move it using the low-level :ref:`CanvasItem <class_CanvasItem>` API.
de: Dies ist ein Beispiel dafür, wie man ein Sprite über Code erstellt und es mit der Low-Level-API :ref:`CanvasItem <class_CanvasItem>` verschiebt.
zh_tw: 這是一個簡單的例子, 說明如何從程式碼中建立一個精靈, 並使用低級的 :ref:`CanvasItem <class_CanvasItem>` API移動它.

source: The Canvas Item API in the server allows you to add draw primitives to it. Once added, they can't be modified. The Item needs to be cleared and the primitives re-added (this is not the case for setting the transform, which can be done as many times as desired).
de: Die Canvas Item-API des Servers ermöglicht das Hinzufügen von Zeichenprimitiven. Einmal hinzugefügt, können sie nicht mehr geändert werden. Das Element muss gelöscht und die Primitive erneut hinzugefügt werden (dies gilt nicht für die Einstellung der Transformation, die beliebig oft vorgenommen werden kann).
zh_tw: 伺服器中的 Canvas Item API 允許您向其新增繪製像素。一旦新增，它們就不能被修改。需要清除 Item，並重新新增像素（設定變換時則不然，變換可根據需要多次進行）。

source: Primitives are cleared this way:
de: Primitive werden folgendermaßen gelöscht:
zh_tw: 像素的清除方式為：

source: Instantiating a Mesh into 3D space
de: Instanziieren eines Meshs in den 3D-Raum
zh_tw: 將網格產生實體到 3D 空間

source: The 3D APIs are different from the 2D ones, so the instantiation API must be used.
de: Die 3D-APIs unterscheiden sich von den 2D-APIs, daher muss die Instanziierungs-API verwendet werden.
zh_tw: 3D API 與 2D API 不同，所以必須使用產生實體 API。

source: Creating a 2D RigidBody and moving a sprite with it
de: Erstellen eines 2D-RigidBody und Verschieben eines Sprites damit
zh_tw: 建立 2D 剛體並使用它移動精靈

source: This creates a :ref:`RigidBody2D <class_RigidBody2D>` using the :ref:`PhysicsServer2D <class_PhysicsServer2D>` API, and moves a :ref:`CanvasItem <class_CanvasItem>` when the body moves.
de: Dies erzeugt einen :ref:`RigidBody2D <class_RigidBody2D>` unter Verwendung der :ref:`PhysicsServer2D <class_PhysicsServer2D>` API und bewegt ein :ref:`CanvasItem <class_CanvasItem>`, wenn sich der Body bewegt.
zh_tw: 這將使用 :ref:`Physics2DServer <class_Physics2DServer>` API建立一個 :ref:`RigidBody2D <class_RigidBody2D>`, 並在物體移動時移動一個 :ref:`CanvasItem <class_CanvasItem>`.

source: The 3D version should be very similar, as 2D and 3D physics servers are identical (using :ref:`RigidBody3D <class_RigidBody3D>` and :ref:`PhysicsServer3D <class_PhysicsServer3D>` respectively).
de: Die 3D-Version sollte sehr ähnlich sein, da 2D- und 3D-Physikserver identisch sind (mit :ref:`RigidBody3D <class_RigidBody3D>` bzw. :ref:`PhysicsServer3D <class_PhysicsServer3D>`).
zh_tw: 3D版本應該非常相似, 因為2D和3D物理伺服器是相同的(分別使用 :ref:`RigidBody <class_RigidBody>` 和 :ref:`PhysicsServer <class_PhysicsServer>` ).

source: Getting data from the servers
de: Abrufen der Daten von den Servern
zh_tw: 從伺服器獲取資料

source: Try to **never** request any information from ``RenderingServer``, ``PhysicsServer2D`` or ``PhysicsServer3D`` by calling functions unless you know what you are doing. These servers will often run asynchronously for performance and calling any function that returns a value will stall them and force them to process anything pending until the function is actually called. This will severely decrease performance if you call them every frame (and it won't be obvious why).
de: Versuchen Sie, **niemals** Informationen von ``RenderingServer``, ``PhysicsServer2D`` oder ``PhysicsServer3D`` durch den Aufruf von Funktionen anzufordern, es sei denn, Sie wissen, was Sie tun. Diese Server laufen aus Performance-Gründen oft asynchron und der Aufruf einer Funktion, die einen Wert zurückgibt, wird sie abwürgen und sie zwingen, alles zu verarbeiten, was ansteht, bis die Funktion tatsächlich aufgerufen wird. Dies wird die Performance stark beeinträchtigen, wenn Sie sie bei jedem Frame aufrufen (und es wird nicht offensichtlich sein, warum).
zh_tw: 除非你知道自己在做什麼，否則儘量**不要**通過呼叫函式向 ``VisualServer``、``PhysicsServer``、``Physics2DServer`` 請求任何資訊。這些伺服器通常會為了性能而非同步運作, 呼叫任何返回值的函式都會使它們停滯, 並迫使它們處理任何待處理的東西, 直到函式被實際呼叫. 如果你每一影格都呼叫它們, 這將嚴重降低性能(而且原因不會很明顯).

source: Because of this, most APIs in such servers are designed so it's not even possible to request information back, until it's actual data that can be saved.
de: Aus diesem Grund sind die meisten APIs in solchen Servern so konzipiert, dass es nicht einmal möglich ist, Informationen zurückzufordern, solange es sich nicht um tatsächliche Daten handelt, die gespeichert werden können.
zh_tw: 正因為如此, 這類伺服器中的大部分API都被設計成連資訊都無法請求回來, 直到這是可以保存的實際資料.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
