Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_multimesh.po
Languages: de, zh_tw

source: Optimization using MultiMeshes
de: Optimierungen durch MultiMeshes
zh_tw: 使用 MultiMesh 進行優化

source: For large amount of instances (in the thousands), that need to be constantly processed (and certain amount of control needs to be retained), :ref:`using servers directly <doc_using_servers>` is the recommended optimization.
de: Für eine große Anzahl (Tausende) von Instanzen, die ständig verarbeitet werden müssen (und ein gewisses Maß an Kontrolle beibehalten werden muss), wird Folgendes empfohlen :ref:`Server direkt verwenden <doc_using_servers>`.
zh_tw: 對於大量的實例(成千上萬), 需要不斷處理(需要保留一定的控制), 建議優化 :ref:`直接使用服務 <doc_using_servers>` .

source: When the amount of objects reach the hundreds of thousands or millions, none of these approaches are efficient anymore. Still, depending on the requirements, there is one more optimization possible.
de: Wenn die Anzahl der Objekte Hunderttausende oder Millionen erreicht, ist keiner dieser Ansätze mehr effizient. Abhängig von den Anforderungen ist jedoch noch eine weitere Optimierung möglich.
zh_tw: 當物件數量達到數十萬或數百萬時, 這些方法都不再有效. 儘管如此, 根據要求, 還有另一種可能的優化方法.

source: MultiMeshes
zh_tw: Meshes - 網格

source: A :ref:`MultiMesh<class_MultiMesh>` is a single draw primitive that can draw up to millions of objects in one go. It's extremely efficient because it uses the GPU hardware to do this (in OpenGL ES 2.0, it's less efficient because there is no hardware support for it, though).
de: Ein :ref:`MultiMesh <class_MultiMesh>` ist ein einzelnes Zeichenelement, das bis zu Millionen von Objekten auf einmal zeichnen kann. Es ist äußerst effizient, da hierfür die GPU-Hardware verwendet wird (in OpenGL ES 2.0 ist es jedoch weniger effizient, da es keine Hardwareunterstützung gibt).
zh_tw: :ref:`MultiMesh<class_MultiMesh>` 是一個單次繪製的像素，可以一次性繪製多達數百萬個物件。它的效率非常高，因為它使用 GPU 硬體來做這件事（不過在 OpenGL ES 2.0 中，它的效率較低，因為沒有硬體支援）。

source: The only drawback is that there is no *screen* or *frustum* culling possible for individual instances. This means, that millions of objects will be *always* or *never* drawn, depending on the visibility of the whole MultiMesh. It is possible to provide a custom visibility rect for them, but it will always be *all-or-none* visibility.
de: Der einzige Nachteil ist, dass für einzelne Instanzen kein *Screen*- oder *Frustum*-Culling möglich ist. Dies bedeutet, dass Millionen von Objekten *immer* oder *nie* gezeichnet werden, abhängig von der Sichtbarkeit des gesamten MultiMesh. Es ist möglich, eine benutzerdefinierte Sichtbarkeitsrechteck für sie bereitzustellen, aber es wird immer eine *alles oder nichts*-Sichtbarkeit sein.
zh_tw: 唯一的缺點是, 對於單個實例, 不可能進行 *螢幕* 或 *視錐* 剔除. 這意味著, 根據整個MultiMesh的可見性, 數百萬個物件將被 *始終* 或 *不會* 繪製. 可以為它們提供一個自訂的可見性矩形, 但它將始終是 *全或無* 的可見性.

source: If the objects are simple enough (just a couple of vertices), this is generally not much of a problem as most modern GPUs are optimized for this use case. A workaround is to create several MultiMeshes for different areas of the world.
de: Wenn die Objekte einfach genug sind (nur ein paar Vertices) ist dies im Allgemeinen kein großes Problem, da die meisten modernen GPUs für diesen Anwendungsfall optimiert sind. Eine Umgehung des Problems besteht darin, mehrere MultiMeshes für verschiedene Regionen der Welt zu erstellen.
zh_tw: 如果物件足夠簡單(只有幾個頂點), 這通常不是什麼大問題, 因為大多數現代GPU都為這種用例進行了優化. 一個變通的方法是為世界的不同區域建立多個MultiMeshes.

source: It is also possible to execute some logic inside the vertex shader (using the ``INSTANCE_ID`` or ``INSTANCE_CUSTOM`` built-in constants). For an example of animating thousands of objects in a MultiMesh, see the :ref:`Animating thousands of fish <doc_animating_thousands_of_fish>` tutorial. Information to the shader can be provided via textures (there are floating-point :ref:`Image<class_Image>` formats which are ideal for this).
de: Es ist auch möglich, eine Logik innerhalb des Vertex-Shaders auszuführen (unter Verwendung der Built-in-Konstanten ``INSTANCE_ID`` oder ``INSTANCE_CUSTOM``). Ein Beispiel für das Animieren von Tausenden von Objekten in einem MultiMesh finden Sie in der Anleitung :ref:`Animieren von Tausenden von Fischen <doc_animating_thousands_of_fish>`. Informationen für den Shader können über Texturen bereitgestellt werden (es gibt Float-:ref:`Bild <class_Image>`-Formate, die dafür ideal sind).
zh_tw: 也可以在頂點著色器中執行一些邏輯(使用 ``INSTANCE_ID`` 或 ``INSTANCE_CUSTOM`` 內建常數). 關於在MultiMesh中對數千個物件進行動畫製作的例子, 請參見 :ref:`Animating thousands of fish <doc_animating_thousands_of_fish>` 教學. 可以通過紋理向著色器提供資訊(有浮點 :ref:`Image<class_Image>` 格式是理想的格式).

source: Another alternative is to use a GDExtension and C++, which should be extremely efficient (it's possible to set the entire state for all objects using linear memory via the :ref:`RenderingServer.multimesh_set_buffer() <class_RenderingServer_method_multimesh_set_buffer>` function). This way, the array can be created with multiple threads, then set in one call, providing high cache efficiency.
de: Eine andere Alternative ist die Verwendung einer GDExtension und C++, was extrem effizient sein sollte (es ist möglich, den gesamten Status für alle Objekte mit linearem Speicher über die Funktion :ref:`RenderingServer.multimesh_set_buffer() <class_RenderingServer_method_multimesh_set_buffer>` zu setzen). Auf diese Weise kann das Array mit mehreren Threads erstellt und dann in einem Aufruf gesetzt werden, was eine hohe Cache-Effizienz bietet.
zh_tw: 另一種選擇是使用GDNative和C++, 效率應該非常高(可以通過 :ref:`VisualServer.multimesh_set_as_bulk_array() <class_VisualServer_method_multimesh_set_as_bulk_array>` 函式來設定所有物件使用線性記憶體的全部狀態). 這樣一來, 可以用多個執行緒建立陣列, 然後在一次呼叫中設定, 提供了很高的快取效率.

source: Finally, it's not required to have all MultiMesh instances visible. The amount of visible ones can be controlled with the :ref:`MultiMesh.visible_instance_count <class_MultiMesh_property_visible_instance_count>` property. The typical workflow is to allocate the maximum amount of instances that will be used, then change the amount visible depending on how many are currently needed.
de: Schließlich müssen nicht alle MultiMesh-Instanzen sichtbar sein. Die Anzahl der sichtbaren Instanzen kann mit der Property :ref:`MultiMesh.visible_instance_count <class_MultiMesh_property_visible_instance_count>` gesteuert werden. Der typische Ablauf besteht darin, die maximale Anzahl der verwendeten Instanzen zuzuweisen und dann die sichtbare Anzahl zu ändern, je nachdem wie viele derzeit benötigt werden.
zh_tw: 最後, 並不是所有的MultiMesh實例都必須是可見的. 可以通過 :ref:`MultiMesh.visible_instance_count <class_MultiMesh_property_visible_instance_count>` 屬性來控制可見的數量. 典型的工作流程是先分配最大數量的實例, 然後根據目前需要的數量改變可見的數量.

source: Multimesh example
de: Ein MultiMesh-Beispiel
zh_tw: 計時器範例

source: Here is an example of using a MultiMesh from code. Languages other than GDScript may be more efficient for millions of objects, but for a few thousands, GDScript should be fine.
de: Hier ist ein Beispiel für die Verwendung eines MultiMeshs aus Code heraus. Andere Sprachen als GDScript sind möglicherweise für Millionen von Objekten effizienter, aber für einige Tausend sollte GDScript ausreichen.
zh_tw: 這裡是一個從程式碼中使用MultiMesh的例子.GDScript以外的其他語言對於數百萬個物件來說可能更有效, 但對於幾千個物件來說,GDScript應該是可以的.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
