Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_linuxbsd.po
Languages: de, zh_tw

source: Compiling for Linux, \*BSD
de: Kompilieren für Linux, \*BSD
zh_tw: 為 Linux, \*BSD 進行編譯

source: This page describes how to compile Linux editor and export template binaries from source. If you're looking to export your project to Linux instead, read :ref:`doc_exporting_for_linux`.
de: Diese Seite beschreibt, wie man einen Linux-Editor kompiliert und Vorlagen-Binärdateien aus dem Quellcode exportiert. Wenn Sie Ihr Projekt stattdessen nach Linux exportieren wollen, lesen Sie :ref:`doc_exporting_for_linux`.
zh_tw: 這個頁面描述的是如何從源碼編譯 Linux 編輯器和匯出範本二進位檔案。如果你要找的是匯出專案到 Linux，請閱讀 :ref:`doc_exporting_for_linux`。

source: Requirements
de: Anforderungen
zh_tw: 系統需求

source: For compiling under Linux or other Unix variants, the following is required:
de: Zum Kompilieren unter Linux oder anderen Unix-Varianten ist Folgendes erforderlich:
zh_tw: 若要在 Linux 或其他各種 Unix 下進行編譯，必須滿足下列條件：

source: GCC 7+ or Clang 6+.
de: GCC 7+ oder Clang 6+.
zh_tw: GCC 7+ 或 Clang 6+。

source: `Python 3.6+ <https://www.python.org/downloads/>`_.
zh_tw: `Python 3.5+ <https://www.python.org/downloads/>`_ 。

source: `SCons 3.0+ <https://scons.org/pages/download.html>`_ build system.
zh_tw: `SCons 3.0+ <https://scons.org/pages/download.html>`_ 建置系統。

source: If your distribution uses Python 2 by default, or you are using a version of SCons prior to 3.1.2, you will need to change the version of Python that SCons uses by changing the shebang (the first line) of the SCons script file to ``#! /usr/bin/python3``. Use the command ``which scons`` to find the location of the SCons script file.
de: Wenn Ihre Distribution standardmäßig Python 2 verwendet oder Sie eine Version von SCons vor 3.1.2 benutzen, müssen Sie die Version von Python, die SCons verwendet, ändern, indem Sie den Shebang (die erste Zeile) der SCons-Skriptdatei in ``#! /usr/bin/python3`` ändern. Benutzen Sie den Befehl ``which scons``, um den Ort der SCons-Skriptdatei zu finden.
zh_tw: SCons 3.0+ 建置系統。若使用預設為 Python 2 的發行版，或使用 3.1.2 版以前的 SCons，則必須更改 SCons 腳本檔的 Shebang (第一行) 為 ``#!/usr/bin/python3`` 來更改 SCons 使用的 Python 版本。可使用 ``which scons`` 指令來找到 SCons 腳本的位置。

source: pkg-config (used to detect the development libraries listed below).
de: pkg-config (wird verwendet, um die unten aufgeführten Entwicklungsbibliotheken zu erkennen).
zh_tw: pkg-config (用於偵測下方的相依性套件)。

source: Development libraries:
de: Entwicklungsbibliotheken:
zh_tw: ALSA 開發函式庫。

source: X11, Xcursor, Xinerama, Xi and XRandR.
de: X11, Xcursor, Xinerama, Xi und XRandR.
zh_tw: X11, Xcursor, Xinerama, Xi 與 XRandR 開發函式庫。

source: PulseAudio.
zh_tw: 音訊

source: *Optional* - libudev (build with ``udev=yes``).
de: *Optional* - libudev (Build mit ``udev=yes``).
zh_tw: **可選** - libudev (使用 ``udev=yes`` 進行建置)。

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
de: Um den Godot-Quellcode zum Kompilieren zu erhalten, siehe :ref:`doc_getting_source`.
zh_tw: 要獲取編譯所需的 Godot 源碼，請參閱 :ref:`doc_getting_source`。

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
de: Eine allgemeine Übersicht über die Verwendung von SCons für Godot finden Sie unter :ref:`doc_introduction_to_the_buildsystem`.
zh_tw: 有關配合 Godot 使用 SCons 的一般說明，請參考 :ref:`doc_introduction_to_the_buildsystem` 。

source: Distro-specific one-liners
de: Distro-spezifische Einzeiler
zh_tw: 用於各個發行版的單行安裝程式

source: For audio support, you can optionally install ``pulseaudio``.
de: Für Audio-Unterstützung können Sie optional ``pulseaudio`` installieren.
zh_tw: 若要支援音訊，則可選擇性地安裝 ``pulseaudio`` 。

source: Compiling
de: Kompilieren
zh_tw: 編譯

source: Start a terminal, go to the root dir of the engine source code and type:
de: Starten Sie ein Terminal, wechseln Sie zum Stammverzeichnis des Engine-Quellcodes und geben Sie Folgendes ein:
zh_tw: 開啟終端機，移至 Godot 原始碼的根目錄然後輸入：

source: Prior to Godot 4.0, the Linux/\*BSD target was called ``x11`` instead of ``linuxbsd``. If you are looking to compile Godot 3.x, make sure to use the `3.x branch of this documentation <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__.
de: Vor Godot 4.0 hieß das Linux/\*BSD-Target ``x11`` anstelle von ``linuxbsd``. Wenn Sie Godot 3.x kompilieren wollen, stellen Sie sicher, dass Sie den `3.x-Branch dieser Dokumentation <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__ verwenden.
zh_tw: 在Godot 4.0之前，Linux/\*BSD目標被稱為“x11”而不是“linuxbsd”。如果你想編譯Godot 3.x，請確保使用本文檔的'3.x分支<https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>'_。

source: If all goes well, the resulting binary executable will be placed in the "bin" subdirectory. This executable file contains the whole engine and runs without any dependencies. Executing it will bring up the Project Manager.
de: Wenn alles gut geht, wird die resultierende ausführbare Binärdatei im Unterverzeichnis "bin" abgelegt. Diese ausführbare Datei enthält die gesamten Engine und läuft ohne jegliche Abhängigkeiten. Wenn Sie sie ausführen, wird der Projektmanager angezeigt.
zh_tw: 若沒有出現什麼問題的話，最終產生的二進位可執行檔會被放在「bin」子資料夾中。該執行檔包含了整個 Godot 遊戲引擎，且可不依賴任何相依性套件執行。執行該檔案會開啟專案管理員。

source: If you wish to compile using Clang rather than GCC, use this command:
de: Wenn Sie nicht mit GCC, sondern mit Clang kompilieren möchten, verwenden Sie diesen Befehl:
zh_tw: 若想使用 Clang 而不是 GCC 來編譯的話，請使用這個指令：

source: Using Clang appears to be a requirement for OpenBSD, otherwise fonts would not build.
de: Die Verwendung von Clang scheint eine Voraussetzung für OpenBSD zu sein, da sonst keine Schriftarten erstellt werden.
zh_tw: 在 OpenBSD 上似乎需要使用 Clang，否則無法正確建置字形。

source: If you are compiling Godot for production use, then you can make the final executable smaller and faster by adding the SCons options ``target=template_release production=yes``.
de: Wenn Sie Godot für den Produktionseinsatz kompilieren, können Sie die endgültige ausführbare Datei kleiner und schneller machen, indem Sie die SCons-Optionen ``target=template_release production=yes`` hinzufügen.
zh_tw: 若是要為正式環境編譯 Godot，則可以通過加上 ``target=release_debug`` SCons 選項來讓最終產生的可執行檔更小且更快速。

source: If you are compiling Godot with GCC, you can make the binary even smaller and faster by adding the SCons option ``lto=full``. As link-time optimization is a memory-intensive process, this will require about 7 GB of available RAM while compiling.
de: Wenn Sie Godot mit GCC kompilieren, können Sie die Binärdatei noch kleiner und schneller machen, indem Sie die SCons-Option ``lto=full`` hinzufügen. Da die Link-Time-Optimierung ein speicherintensiver Prozess ist, werden beim Kompilieren etwa 7 GB verfügbarer Arbeitsspeicher benötigt.
zh_tw: 若使用 GCC 來編譯 Godot，則可以通過往 SCons 新增 ``use_lto=yes`` 選項來讓二進位可執行檔更小更快。由於連結時期最佳化是很消耗記憶體的過程，所以在編譯時會需要至少有 3GB 的可用記憶體。

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
de: Wenn Sie getrennte Editoreinstellungen für Ihre eigenen Godot-Builds und die offiziellen Releases verwenden wollen, können Sie den :ref:`doc_data_paths_self_contained_mode` aktivieren, indem Sie eine Datei namens ``._sc_`` oder ``_sc_`` im ``bin/``-Ordner anlegen.
zh_tw: 若想在客製化建置上使用與 Godot 官方釋出版本不同的編輯器設定，可以通過在 ``bin/`` 資料夾中建立檔名為 ``._sc_`` 或 ``_sc_`` 的檔案來開啟 :ref:`doc_data_paths_self_contained_mode` 。

source: Running a headless/server build
de: Ausführen eines Headless/Server-Builds
zh_tw: 編譯無周邊版本與伺服器版本

source: To run in *headless* mode which provides editor functionality to export projects in an automated manner, use the normal build::
de: Um im *headless* Modus zu arbeiten, der Editor-Funktionen für den automatisierten Export von Projekten bietet, verwenden Sie den normalen Build::
zh_tw: 若要編譯用於以編輯器功能來自動化匯出專案的 **無周邊** 版本，請使用：

source: And then use the ``--headless`` command line argument::
de: Und dann benutzen Sie das ``--headless`` Kommandozeilenargument::
zh_tw: 然後使用“--headless”命令列參數::

source: To compile a debug *server* build which can be used with :ref:`remote debugging tools <doc_command_line_tutorial>`, use::
de: Um einen Debug-*Server*-Build zu kompilieren, der mit :ref:`Remote Debugging-Tools <doc_command_line_tutorial>` verwendet werden kann, benutzen Sie::
zh_tw: 如果要編譯除錯版本的*伺服器*，支援:ref:`遠端除錯工具 <doc_command_line_tutorial>`，那麼請使用： ::

source: To compile a *server* build which is optimized to run dedicated game servers, use::
de: Um einen *Server*-Build zu kompilieren, der für den Betrieb von dedizierten Spieleservern optimiert ist, benutzen Sie::
zh_tw: 若要編譯可執行專屬遊戲伺服器的 **伺服器** 版本，請使用：

source: Building export templates
de: Exportvorlagen erstellen
zh_tw: 建置匯出樣板

source: Linux binaries usually won't run on distributions that are older than the distribution they were built on. If you wish to distribute binaries that work on most distributions, you should build them on an old distribution such as Ubuntu 16.04. You can use a virtual machine or a container to set up a suitable build environment.
de: Linux-Binärdateien laufen normalerweise nicht auf Distributionen, die älter sind als die Distribution, auf der sie erstellt wurden. Wenn Sie Binärdateien veröffentlichen möchten, die auf den meisten Distributionen funktionieren, sollten Sie sie auf einer alten Distribution wie Ubuntu 16.04 erstellen. Sie können eine virtuelle Maschine oder einen Container verwenden, um eine geeignete Build-Umgebung einzurichten.
zh_tw: Linux 二進位執行檔通常無法在比用來建置該執行檔還要舊的發行版上執行。若想提供能在多數發行版上執行的二進位執行檔，請使用較舊的發行版來建置，如 Ubuntu 16.04。可以使用虛擬機或容器來設定一個適合的建置環境。

source: To build Linux or \*BSD export templates, run the build system with the following parameters:
de: Um Linux- oder \*BSD-Exportvorlagen zu erstellen, führen Sie das Buildsystem mit den folgenden Parametern aus:
zh_tw: 若要建置 Linux, \*BSD 匯出樣板，請使用下列參數來執行建置系統：

source: (32 bits)
de: (32 Bit)
zh_tw: (32 位元)

source: (64 bits)
de: (64 Bit)
zh_tw: (64 位元)

source: Note that cross-compiling for the opposite bits (64/32) as your host platform is not always straight-forward and might need a chroot environment.
de: Beachten Sie, dass die Cross-Kompilierung für die gegenüberliegenden Bits (64/32) Ihrer Host-Plattform nicht immer einfach ist und möglicherweise eine chroot-Umgebung erfordert.
zh_tw: 請注意，可能無法為與目前宿主機環境不同的位元 (64/32) 進行交叉編譯時，有可能會需要 Chroot 環境。

source: To create standard export templates, the resulting files in the ``bin/`` folder must be copied to:
de: Um Standard-Exportvorlagen zu erstellen, müssen die resultierenden Dateien in den Ordner ``bin/`` kopiert werden:
zh_tw: 要建立標準的匯出樣板，則必須將產生的檔案複製至：

source: and named like this (even for \*BSD which is seen as "Linux/X11" by Godot):
de: ...und so benannt werden (sogar für \*BSD, das von Godot als "Linux/X11" angesehen wird):
zh_tw: 並將這些檔案如下命名 (在 Godot 中，\*BSD 被視為「Linux X11」)：

source: However, if you are writing your custom modules or custom C++ code, you might instead want to configure your binaries as custom export templates here:
de: Wenn Sie jedoch Ihre benutzerdefinierten Module oder benutzerdefinierten C++-Code schreiben, sollten Sie Ihre Binärdateien hier als benutzerdefinierte Exportvorlagen konfigurieren:
zh_tw: 但，若你正在撰寫客製化模組或自定 C++ 程式碼，則可能會需要在此將該二進位執行檔設定為自定匯出樣板：

source: You don't even need to copy them, you can just reference the resulting files in the ``bin/`` directory of your Godot source folder, so the next time you build, you automatically have the custom templates referenced.
de: Sie brauchen sie nicht einmal zu kopieren, Sie können einfach auf die resultierenden Dateien im ``bin/``-Verzeichnis Ihres Godot-Stammverzeichnisses verweisen, so dass Sie beim nächsten Build automatisch die benutzerdefinierten Vorlagen referenziert haben.
zh_tw: 這種情況下甚至不需要複製檔案，只需要將這些檔案參照到 Godot 原始碼目錄的 ``bin/`` 資料夾下即可。這樣下次建置時，就會自動參照到自定樣板。

source: Using Clang and LLD for faster development
de: Nutzen Sie Clang und LLD für eine schnellere Entwicklung
zh_tw: 使用 Clang 與 LLD 來更快速地開發

source: You can also use Clang and LLD to build Godot. This has two upsides compared to the default GCC + GNU ld setup:
de: Sie können auch Clang und LLD verwenden, um Godot zu bauen. Dies hat zwei Vorteile im Vergleich zum Standard-GCC + GNU ld Setup:
zh_tw: 也可以使用 Clang 與 LLD 來建置 Godot。使用 Clang 與 LLD 比起預設的 GCC + GNU ld 有兩個好處：

source: LLD links Godot significantly faster compared to GNU ld or gold. This leads to faster iteration times.
de: LLD linkt Godot im Vergleich zu GNU ld oder gold deutlich schneller. Dies führt zu schnelleren Iterationszeiten.
zh_tw: LLD 與 GNU ld 或 gold 比起來，連結速度明顯快很多。這樣就可以迭代地更快。

source: Clang tends to give more useful error messages compared to GCC.
de: Clang gibt im Vergleich zu GCC nützlichere Fehlermeldungen.
zh_tw: Clang 比起 GCC，提供的錯誤訊息通常更有用。

source: To do so, install Clang and the ``lld`` package from your distribution's package manager then use the following SCons command::
de: Um dies zu tun, installieren Sie Clang und das ``lld``-Paket aus dem Paketmanager Ihrer Distribution und verwenden dann den folgenden SCons-Befehl::
zh_tw: 要使用 Clang 與 LLD，請先使用發行版的套件管理員來安裝 Clang 與 ``lld`` 套件，然後使用下列 SCons 指令：

source: After the build is completed, a new binary with a ``.llvm`` suffix will be created in the ``bin/`` folder.
de: Nachdem der Build abgeschlossen ist, wird eine neue Binärdatei mit dem Suffix ``.llvm`` im Ordner ``bin/`` erstellt.
zh_tw: 建構完成後，將在 ``bin/`` 資料夾中建立一個以 ``.llvm`` 為後綴的新的二進位檔案。

source: It's still recommended to use GCC for production builds as they can be compiled using link-time optimization, making the resulting binaries smaller and faster.
de: Es wird immer noch empfohlen, GCC für Produktions-Builds zu verwenden, da sie mit Link-Time-Optimierung kompiliert werden können, wodurch die resultierenden Binärdateien kleiner und schneller werden.
zh_tw: 雖然我們依然建議正式版本使用 GCC 來建置，因為 GCC 可以配合連結時期最佳化來編譯，產生的二進位執行檔也更小更快。

source: If this error occurs::
de: Wenn dieser Fehler auftritt::
zh_tw: 如果出現此錯誤：：

source: There are two solutions:
de: ...gibt es gibt zwei Lösungen:
zh_tw: Godot 沒有使用限制

source: In your SCons command, add the parameter ``use_static_cpp=no``.
de: Fügen Sie in Ihrem SCons-Befehl den Parameter ``use_static_cpp=no`` hinzu.
zh_tw: 在 SCons 指令中，新增參數``use_static_cpp=no``。

source: Using mold for faster development
de: Verwendung von mold für eine schnellere Entwicklung
zh_tw: 使用 Clang 與 LLD 來更快速地開發

source: For even faster linking compared to LLD, you can use `mold <https://github.com/rui314/mold>`__. mold can be used with either GCC or Clang.
de: Für noch schnelleres Linken im Vergleich zu LLD können Sie `mold <https://github.com/rui314/mold>`__ verwenden. mold kann entweder mit GCC oder Clang verwendet werden.
zh_tw: 為了比 LLD 更快的鏈接，您可以使用 `mold <https://github.com/rui314/mold>`__。 Mold 可以與 GCC 或 Clang 一起使用。

source: As of January 2023, mold is not readily available in Linux distribution repositories, so you will have to install its binaries manually.
de: Seit Januar 2023 ist mold nicht mehr ohne weiteres in den Repositories der Linux-Distributionen verfügbar, so dass Sie die Binärdateien manuell installieren müssen.
zh_tw: 截至 2023 年 1 月，mold 在 Linux 發行版儲存庫中尚不可用，因此您必須手動安裝其二進位。

source: Download mold binaries from its `releases page <https://github.com/rui314/mold/releases/latest>`__.
de: Laden Sie die mold-Binärdateien von der `Release-Seite <https://github.com/rui314/mold/releases/latest>`__ herunter.
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: Extract the ``.tar.gz`` file, then move the extraced folder to a location such as ``.local/share/mold``.
de: Entpacken Sie die Datei ``.tar.gz`` und verschieben Sie den extrahierten Ordner an einen Ort wie ``.local/share/mold``.
zh_tw: 解壓 ``.tar.gz`` 檔，然後將得到的資料夾移動到類似於 ``.local/share/mold`` 的位置。

source: Add ``$HOME/.local/share/mold/bin`` to your user's ``PATH`` environment variable. For example, you can add the following line at the end of your ``$HOME/.bash_profile`` file:
de: Fügen Sie ``$HOME/.local/share/mold/bin`` zur ``PATH``-Umgebungsvariable Ihres Benutzers hinzu. Zum Beispiel können Sie die folgende Zeile am Ende Ihrer ``$HOME/.bash_profile`` Datei hinzufügen:
zh_tw: 將 ``$HOME/.local/share/mold/bin`` 新增到使用者的 ``PATH`` 環境變數中。例如可以在 ``$HOME/.bash_profile`` 檔的末尾加上以下內容：

source: Open a new terminal (or run ``source "$HOME/.bash_profile"``), then use the following SCons command when compiling Godot::
de: Öffnen Sie ein neues Terminal (oder führen Sie ``source "$HOME/.bash_profile"`` aus), dann verwenden Sie den folgenden SCons-Befehl beim Kompilieren von Godot::
zh_tw: 打開新的終端（或者運作 ``source "$HOME/.bash_profile"``），然後使用以下 SCons 命令編譯 Godot：::

source: Using system libraries for faster development
de: Verwendung von Systembibliotheken für eine schnellere Entwicklung
zh_tw: 使用 Clang 與 LLD 來更快速地開發

source: `Godot bundles the source code of various third-party libraries. <https://github.com/godotengine/godot/tree/master/thirdparty>`__ You can choose to use system versions of third-party libraries instead. This makes the Godot binary faster to link, as third-party libraries are dynamically linked. Therefore, they don't need to be statically linked every time you build the engine (even on small incremental changes).
de: `Godot bündelt den Quellcode verschiedener Bibliotheken von Drittanbietern. <https://github.com/godotengine/godot/tree/master/thirdparty>`__ Sie können stattdessen die Systemversionen der Bibliotheken von Drittanbietern verwenden. Dadurch kann die Godot-Binärdatei schneller gelinkt werden, da die Bibliotheken von Drittanbietern dynamisch gelinkt werden. Daher müssen sie nicht jedes Mal statisch gelinkt werden, wenn Sie die Engine bauen (selbst bei kleinen inkrementellen Änderungen).
zh_tw: `Godot 捆綁了各種第三方函式庫的源程式碼。 <https://github.com/godotengine/godot/tree/master/thirdparty>`__ 您可以選擇使用系統版本的第三方函式庫。這使得 Godot 二進位檔案的連結速度更快，因為第三方函式庫是動態連結的。因此，它們不需要在每次建立引擎時靜態連結（即使是小的差異量更改）。

source: However, not all Linux distributions have packages for third-party libraries available (or they may not be up-to-date).
de: Allerdings sind nicht für alle Linux-Distributionen Pakete für Bibliotheken von Drittanbietern verfügbar (oder sie sind nicht aktuell).
zh_tw: 但是，並非所有 Linux 發行版都有可用的第三方函式庫的軟體包（或者它們可能不是最新的）。

source: Moving to system libraries can reduce linking times by several seconds on slow CPUs, but it requires manual testing depending on your Linux distribution. Also, you may not be able to use system libraries for everything due to bugs in the system library packages (or in the build system, as this feature is less tested).
de: Der Wechsel zu Systembibliotheken kann die Link-Zeiten auf langsamen CPUs um mehrere Sekunden verkürzen, erfordert aber je nach Linux-Distribution manuelle Tests. Außerdem kann es sein, dass Sie aufgrund von Bugs in den Systembibliotheks-Paketen (oder im Buildsystem, da dieses Feature weniger getestet wird) nicht für alles Systembibliotheken verwenden können.
zh_tw: 遷移到系統庫可以將慢速 CPU 上的連結時間縮短幾秒鐘，但需要手動測試，具體取決於您的 Linux 發行版。此外，由於系統庫包中的錯誤（或建置系統中的錯誤，因為此功能測試較少），您可能無法將系統庫用於所有內容。

source: To compile Godot with system libraries, install these dependencies *on top* of the ones listed in the :ref:`doc_compiling_for_linuxbsd_oneliners`:
de: Um Godot mit Systembibliotheken zu kompilieren, installieren Sie diese Abhängigkeiten *zusätzlich* zu denen, die in :ref:`doc_compiling_for_linuxbsd_oneliners` aufgeführt sind:
zh_tw: 要使用系統庫編譯 Godot，請在 doc_compiling_for_linuxbsd_oneliners 中列出的*頂部*安裝這些依賴項：

source: After installing all required packages, use the following command to build Godot:
de: Nachdem Sie alle erforderlichen Pakete installiert haben, verwenden Sie den folgenden Befehl, um Godot zu bauen:
zh_tw: 安裝所有必需的軟體包後，使用以下命令建置 Godot：

source: You can view a list of all built-in libraries that have system alternatives by running ``scons -h``, then looking for options starting with ``builtin_``.
de: Sie können eine Liste aller Built-in-Bibliotheken, die Systemalternativen haben, anzeigen, indem Sie ``scons -h`` aufrufen und dann nach Optionen suchen, die mit ``builtin_`` beginnen.
zh_tw: 您可以透過執行「scons -h」來查看具有系統替代方案的所有內建庫的列表，然後尋找以「builtin_」開頭的選項。

source: When using system libraries, the resulting library is **not** portable across Linux distributions anymore. Do not use this approach for creating binaries you intend to distribute to others, unless you're creating a package for a Linux distribution.
de: Wenn Sie Systembibliotheken verwenden, ist die resultierende Bibliothek **nicht** mehr über Linux-Distributionen hinweg portierbar. Verwenden Sie diesen Ansatz nicht für die Erstellung von Binärdateien, die Sie an andere weitergeben möchten, es sei denn, Sie erstellen ein Paket für eine Linux-Distribution.
zh_tw: 使用系統函式庫時，產生的函式庫**不再**可跨 Linux 發行版移植。請勿使用此方法建立要分發給其他人的二進位檔案，除非您正在為 Linux 發行版建立套件。

source: Using Pyston for faster development
de: Pyston für eine schnellere Entwicklung nutzen
zh_tw: 使用 Clang 與 LLD 來更快速地開發

source: You can use `Pyston <https://www.pyston.org/>`__ to run SCons. Pyston is a JIT-enabled implementation of the Python language (which SCons is written in). It is currently only compatible with Linux. Pyston can speed up incremental builds significantly, often by a factor between 1.5× and 2×. Pyston can be combined with Clang and LLD to get even faster builds.
de: Sie können `Pyston <https://www.pyston.org/>`__ verwenden, um SCons auszuführen. Pyston ist eine JIT-fähige Implementierung der Sprache Python (in der SCons geschrieben ist). Sie ist derzeit nur mit Linux kompatibel. Pyston kann inkrementelle Builds erheblich beschleunigen, oft um einen Faktor zwischen 1,5× und 2×. Pyston kann mit Clang und LLD kombiniert werden, um noch schnellere Builds zu erhalten.
zh_tw: 你可以使用 `Pyston <https://www.pyston.org/>`__ 來運作 SCons。Pyston 是一種利用了 JIT 的 Python 語言實作（SCons 就是使用 Python 編寫的）。目前它只相容 Linux。Pyston 可以顯著加速差異量建構，經常可以達到 1.5× 和 2× 倍。可以將 Pyston 與 Clang 和 LLD 組合，進行更快的建構。

source: Download the `latest portable Pyston release <https://github.com/pyston/pyston/releases/latest>`__.
de: Laden Sie das `neueste portable Pyston-Release <https://github.com/pyston/pyston/releases/latest>`__ herunter.
zh_tw: 下載 `Pyston 的最新綠色版本 <https://github.com/pyston/pyston/releases/latest>`__。

source: Extract the portable ``.tar.gz`` to a set location, such as ``$HOME/.local/opt/pyston/`` (create folders as needed).
de: Entpacken Sie die portable ``.tar.gz``-Datei an einen bestimmten Ort, wie ``$HOME/.local/opt/pyston/`` (erstellen Sie Ordner nach Bedarf).
zh_tw: 將綠色的 ``.tar.gz`` 解壓到特定的位置，比如 `$HOME/.local/opt/pyston/`（必要時請建立資料夾）。

source: Use ``cd`` to reach the extracted Pyston folder from a terminal, then run ``./pyston -m pip install scons`` to install SCons within Pyston.
de: Benutzen Sie ``cd``, um von einem Terminal aus zum entpackten Pyston-Ordner zu gelangen, dann führen Sie ``./pyston -m pip install scons`` aus, um SCons innerhalb von Pyston zu installieren.
zh_tw: 在命令列中，使用 ``cd`` 達到 Pyston 解壓出的資料夾，然後運作 ``./pyston -m pip install scons``，在 Pyston 中安裝 SCons。

source: To make SCons via Pyston easier to run, create a symbolic link of its wrapper script to a location in your ``PATH`` environment variable::
de: Um die Ausführung von SCons über Pyston zu vereinfachen, erstellen Sie einen symbolischen Link des Wrapper-Skripts auf einen Ort in Ihrer ``PATH``-Umgebungsvariablen::
zh_tw: 為了便於通過 Pyston 運作 SCons，請建立一個指向其封裝腳本的符號連結，符號連結的位置必須在你的 ``PATH`` 環境變數中： ::

source: Instead of running ``scons <build arguments>``, run ``pyston-scons <build arguments>`` to compile Godot.
de: Anstatt ``scons <build arguments>`` auszuführen, führen Sie ``pyston-scons <build arguments>`` aus, um Godot zu kompilieren.
zh_tw: 現在就不是執行 ``scons <建構參數>`` 了，要編譯 Godot 請執行 ``pyston-scons <建構參數>``。
