Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_macos.po
Languages: de, zh_tw

source: Compiling for macOS
de: Kompilieren für MacOS
zh_tw: 為 macOS 進行編譯

source: This page describes how to compile macOS editor and export template binaries from source. If you're looking to export your project to macOS instead, read :ref:`doc_exporting_for_macos`.
de: Diese Seite beschreibt, wie man den macOS-Editor und die Exportvorlagen-Binärdateien aus dem Quellcode kompiliert . Wenn Sie Ihr Projekt stattdessen nach macOS exportieren möchten, lesen Sie :ref:`doc_exporting_for_macos`.
zh_tw: 這個頁面描述的是如何從源碼編譯 macOS 編輯器和匯出範本二進位檔案。如果你要找的是匯出專案到 macOS，請閱讀 :ref:`doc_exporting_for_macos`。

source: Requirements
de: Anforderungen
zh_tw: 系統需求

source: For compiling under macOS, the following is required:
de: Zum Kompilieren unter MacOS ist Folgendes erforderlich:
zh_tw: 若要在 macOS 下編譯，必須滿足下列需求：

source: `Python 3.6+ <https://www.python.org/downloads/macos/>`_.
zh_tw: `Python 3.5+ <https://www.python.org/downloads/>`_ 。

source: `SCons 3.0+ <https://scons.org/pages/download.html>`_ build system.
zh_tw: `SCons 3.0+ <https://scons.org/pages/download.html>`_ 建置系統。

source: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (or the more lightweight Command Line Tools for Xcode).
de: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (oder die leichtgewichtigeren Kommandozeilentools für Xcode).
zh_tw: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (或更輕巧的適用於 Xcode 的命令行工具)。

source: `Vulkan SDK <https://sdk.lunarg.com/sdk/download/latest/mac/vulkan-sdk.dmg>`_ for MoltenVK (macOS doesn't support Vulkan out of the box).
de: `Vulkan SDK <https://sdk.lunarg.com/sdk/download/latest/mac/vulkan-sdk.dmg>`_ für MoltenVK (macOS unterstützt Vulkan nicht von Haus aus).
zh_tw: 適用於 MoltenVK 的「Vulkan SDK <https://sdk.lunarg.com/sdk/download/latest/mac/vulkan-sdk.dmg>」（macOS 不支援開箱即用的 Vulkan）。

source: If you have `Homebrew <https://brew.sh/>`_ installed, you can easily install SCons using the following command::
de: Wenn Sie `Homebrew <https://brew.sh/>`_ installiert haben, können Sie SCons einfach mit dem folgenden Befehl installieren::
zh_tw: 若有安裝 `Homebrew <https://brew.sh/>`_ ，則可以通過下列指令來輕鬆安裝 SCons 與 yasm：

source: Installing Homebrew will also fetch the Command Line Tools for Xcode automatically if you don't have them already.
de: Bei der Installation von Homebrew werden auch automatisch die Kommandozeilen-Tools für Xcode installiert, falls Sie diese noch nicht haben.
zh_tw: 安裝 Homebrew 時，若還未有適用於 Xcode 的命令行工具，也會自動安裝。

source: Similarly, if you have `MacPorts <https://www.macports.org/>`_ installed, you can easily install SCons using the following command::
de: Wenn Sie `MacPorts <https://www.macports.org/>`_ installiert haben, können Sie SCons einfach mit dem folgenden Befehl installieren::
zh_tw: 若有安裝 `Homebrew <https://brew.sh/>`_ ，則可以通過下列指令來輕鬆安裝 SCons 與 yasm：

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
de: Um den Godot-Quellcode zum Kompilieren zu erhalten, siehe :ref:`doc_getting_source`.
zh_tw: 要獲取編譯所需的 Godot 源碼，請參閱 :ref:`doc_getting_source`。

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
de: Eine allgemeine Übersicht über die Verwendung von SCons für Godot finden Sie unter :ref:`doc_introduction_to_the_buildsystem`.
zh_tw: 有關配合 Godot 使用 SCons 的一般說明，請參考 :ref:`doc_introduction_to_the_buildsystem` 。

source: Compiling
de: Kompilieren
zh_tw: 編譯

source: Start a terminal, go to the root directory of the engine source code.
de: Starten Sie ein Terminal und wechseln Sie in das Stammverzeichnis des Engine-Quellcodes.
zh_tw: 開啟終端機，移至 Godot 原始碼的根目錄。

source: To compile for Intel (x86-64) powered Macs, use::
de: Zum Kompilieren für Intel (x86-64) betriebene Macs verwenden Sie::
zh_tw: 若要為 Intel (x86-64) 核心的 Mac 編譯，請使用：

source: To compile for Apple Silicon (ARM64) powered Macs, use::
de: Um für Apple Silicon (ARM64) betriebene Macs zu kompilieren, verwenden Sie::
zh_tw: 若要為 Apple Silicon (ARM64) 核心的 Mac 編譯，請使用 (僅可用於 Godot 3.2.3+)：

source: To support both architectures in a single "Universal 2" binary, run the above two commands and then use ``lipo`` to bundle them together::
de: Um beide Architekturen in einer einzigen "Universal 2"-Binärdatei zu unterstützen, führen Sie die beiden obigen Befehle aus und benutzen Sie ``lipo``, um sie zu bündeln::
zh_tw: 若要使用單一「Universal 2」二進位執行檔來同時支援兩個架構，請執行上述兩個指令，然後通過 ``lipo`` 來將這兩個檔案捆綁在一起：

source: If all goes well, the resulting binary executable will be placed in the ``bin/`` subdirectory. This executable file contains the whole engine and runs without any dependencies. Executing it will bring up the Project Manager.
de: Wenn alles gut geht, wird die resultierende ausführbare Binärdatei im Unterverzeichnis ``bin/`` abgelegt. Diese ausführbare Datei enthält die gesamte Engine und läuft ohne jegliche Abhängigkeiten. Wenn Sie sie ausführen, wird der Projektmanager angezeigt.
zh_tw: 若沒出現問題的話，產生的二進位執行檔會被放在 ``bin/`` 子資料夾中。該執行檔包含了完整的 Godot 遊戲引擎，且不需任何相依性套件即可執行。執行該檔案會開啟專案管理員。

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
de: Wenn Sie getrennte Editoreinstellungen für Ihre eigenen Godot-Builds und die offiziellen Releases verwenden wollen, können Sie den :ref:`doc_data_paths_self_contained_mode` aktivieren, indem Sie eine Datei namens ``._sc_`` oder ``_sc_`` im ``bin/``-Ordner anlegen.
zh_tw: 若想在客製化建置上使用與 Godot 官方釋出版本不同的編輯器設定，可以通過在 ``bin/`` 資料夾中建立檔名為 ``._sc_`` 或 ``_sc_`` 的檔案來開啟 :ref:`doc_data_paths_self_contained_mode` 。

source: If you are building the ``master`` branch, you also need to include support for the MoltenVK Vulkan portability library. By default, it will be linked statically from your installation of the Vulkan SDK for macOS. You can also choose to link it dynamically by passing ``use_volk=yes`` and including the dynamic library in your ``.app`` bundle::
de: Wenn Sie den ``master``-Branch bauen, müssen Sie auch die Unterstützung für die MoltenVK Vulkan-Portabilitätsbibliothek einbinden. Standardmäßig wird sie statisch von Ihrer Installation des Vulkan-SDK für macOS gelinkt. Sie können sie auch dynamisch linken, indem Sie ``use_volk=yes`` übergeben und die dynamische Bibliothek in Ihr ``.app``-Bundle einbinden::
zh_tw: 如果您正在建立「master」分支，您還需要包含對 MoltenVK Vulkan 可移植性庫的支援。預設情況下，它將透過您安裝的適用於 macOS 的 Vulkan SDK 進行靜態連結。您也可以選擇透過傳遞“use_volk=yes”並將動態庫包含在“.app”包中來動態連結它：

source: Running a headless/server build
de: Ausführen eines Headless/Server-Builds
zh_tw: 編譯無周邊版本與伺服器版本

source: To run in *headless* mode which provides editor functionality to export projects in an automated manner, use the normal build::
de: Um im *headless* Modus zu arbeiten, der Editor-Funktionen für den automatisierten Export von Projekten bietet, verwenden Sie den normalen Build::
zh_tw: 若要編譯用於以編輯器功能來自動化匯出專案的 **無周邊** 版本，請使用：

source: And then use the ``--headless`` command line argument::
de: Und dann benutzen Sie das ``--headless`` Kommandozeilenargument::
zh_tw: 然後使用“--headless”命令列參數::

source: To compile a debug *server* build which can be used with :ref:`remote debugging tools <doc_command_line_tutorial>`, use::
de: Um einen Debug-*Server*-Build zu kompilieren, der mit :ref:`Remote Debugging-Tools <doc_command_line_tutorial>` verwendet werden kann, benutzen Sie::
zh_tw: 如果要編譯除錯版本的*伺服器*，支援:ref:`遠端除錯工具 <doc_command_line_tutorial>`，那麼請使用： ::

source: To compile a release *server* build which is optimized to run dedicated game servers, use::
de: Um ein Release-*Server*-Build zu kompilieren, das für den Betrieb von dedizierten Spieleservern optimiert ist, verwenden Sie::
zh_tw: 若要編譯可執行專屬遊戲伺服器的 **伺服器** 版本，請使用：

source: Building export templates
de: Exportvorlagen erstellen
zh_tw: 建置匯出樣板

source: To build macOS export templates, you have to compile using the targets without the editor: ``target=template_release`` (release template) and ``target=template_debug``.
de: Um macOS-Exportvorlagen zu erstellen, müssen Sie die Targets ohne den Editor kompilieren: ``target=template_release`` (Release-Vorlage) und ``target=template_debug``.
zh_tw: 要建立macOS的匯出範本，你必須用 ``tools=no`` （無編輯器）進行編譯，並分別為 ``target=release`` （發行範本）和 ``target=release_debug``.

source: Official templates are universal binaries which support both Intel x86_64 and ARM64 architectures. You can also create export templates that support only one of those two architectures by leaving out the ``lipo`` step below.
de: Die offizielle Vorlagen sind universelle Binärdateien, die sowohl Intel x86_64 als auch ARM64-Architekturen unterstützen. Sie können auch Exportvorlagen erstellen, die nur eine der beiden Architekturen unterstützen, indem Sie den Schritt ``lipo`` weglassen.
zh_tw: 官方範本是通用的二進位檔案，同時支援英特爾x86_64和ARM64架構。你也可以通過省略下面的 ``lipo`` 步驟，建立只支援架構中的一種的匯出範本。

source: For Intel x86_64::
de: Für Intel x86_64::
zh_tw: 對於英特爾 x86_64： ::

source: To support both architectures in a single "Universal 2" binary, run the above two commands blocks and then use ``lipo`` to bundle them together::
de: Um beide Architekturen in einer einzigen "Universal 2"-Binärdatei zu unterstützen, führen Sie die beiden obigen Befehle in Blöcken aus und benutzen Sie ``lipo``, um sie zu bündeln::
zh_tw: 若要使用單一「Universal 2」二進位執行檔來同時支援兩個架構，請執行上述兩個指令，然後通過 ``lipo`` 來將這兩個檔案捆綁在一起：

source: You can then zip the ``macos_template.app`` folder to reproduce the ``macos.zip`` template from the official Godot distribution::
de: Sie können dann den Ordner ``macos_template.app`` zippen, um die Vorlage ``macos.zip`` aus der offiziellen Godot-Distribution zu reproduzieren::
zh_tw: 然後你可以壓縮 ``osx_template.app`` 資料夾來複製 Godot 官方發行的 ``osx.zip`` 範本： ::

source: Using Pyston for faster development
de: Pyston für eine schnellere Entwicklung nutzen
zh_tw: 使用 Clang 與 LLD 來更快速地開發

source: You can use `Pyston <https://www.pyston.org/>`__ to run SCons. Pyston is a JIT-enabled implementation of the Python language (which SCons is written in). Its "full" version is currently only compatible with Linux, but Pyston-lite is also compatible with macOS (both x86 and ARM). Pyston can speed up incremental builds significantly, often by a factor between 1.5× and 2×. Pyston can be combined with alternative linkers such as LLD or Mold to get even faster builds.
de: Sie können `Pyston <https://www.pyston.org/>`__ verwenden, um SCons auszuführen. Pyston ist eine JIT-fähige Implementierung der Sprache Python (in der SCons geschrieben ist). Die "volle" Version ist derzeit nur mit Linux kompatibel, aber Pyston-lite ist auch mit macOS (sowohl x86 als auch ARM) kompatibel. Pyston kann inkrementelle Builds erheblich beschleunigen, oft um einen Faktor zwischen 1,5× und 2×. Pyston kann mit alternativen Linkern wie LLD oder Mold kombiniert werden, um noch schnellere Builds zu erhalten.
zh_tw: 你可以使用 `Pyston <https://www.pyston.org/>`__ 來運作 SCons。Pyston 是一種利用了 JIT 的 Python 語言實作（SCons 就是使用 Python 編寫的）。目前它只相容 Linux。Pyston 可以顯著加速差異量建構，經常可以達到 1.5× 和 2× 倍。可以將 Pyston 與 Clang 和 LLD 組合，進行更快的建構。

source: To install Pyston-lite, run ``python -m pip install pyston_lite_autoload`` then run SCons as usual. This will automatically load a subset of Pyston's optimizations in any Python program you run. However, this won't bring as much of a performance improvement compared to installing "full" Pyston (which currently can't be done on macOS).
de: Um Pyston-lite zu installieren, führen Sie ``python -m pip install pyston_lite_autoload`` aus und starten Sie SCons wie gewohnt. Dies wird automatisch eine Teilmenge der Pyston-Optimierungen in jedes Python-Programm laden, das Sie ausführen. Allerdings bringt dies keine so große Performanceverbesserung im Vergleich zur Installation von "vollem" Pyston (was derzeit unter macOS nicht möglich ist).
zh_tw: 要安裝 Pyston-lite，請執行“python -m pip install pyston_lite_autoload”，然後照常執行 SCons。這將自動在您執行的任何 Python 程式中載入 Pyston 最佳化的子集。然而，與安裝「完整」Pyston（目前無法在 macOS 上完成）相比，這不會帶來那麼多的效能改進。

source: Cross-compiling for macOS from Linux
de: Cross-Kompilieren für MacOS unter Linux
zh_tw: 在 Linux 上為 macOS 進行交叉編譯

source: It is possible to compile for macOS in a Linux environment (and maybe also in Windows using the Windows Subsystem for Linux). For that, you'll need to install `OSXCross <https://github.com/tpoechtrager/osxcross>`__ to be able to use macOS as a target. First, follow the instructions to install it:
de: Es ist möglich, für macOS in einer Linux-Umgebung zu kompilieren (und vielleicht auch in Windows unter Verwendung des Windows-Subsystems für Linux). Dazu müssen Sie `OSXCross <https://github.com/tpoechtrager/osxcross>`__ installieren, um macOS als Target verwenden zu können. Folgen Sie zunächst den Anweisungen, um es zu installieren:
zh_tw: 可以在 Linux 環境下為 macOS 編譯 (Windows 下也許可以使用適用於 Linux 的 Windows 子系統來編譯)。若要在 Linux 下為 macOS 交叉編譯，則必須安裝 `OSXCross <https://github.com/tpoechtrager/osxcross>`__ 來將 macOS 作為建置目標使用。首先，請依照下列指示安裝 OSXCross：

source: Clone the `OSXCross repository <https://github.com/tpoechtrager/osxcross>`__ somewhere on your machine (or download a ZIP file and extract it somewhere), e.g.::
de: Klonen Sie das `OSXCross-Repository <https://github.com/tpoechtrager/osxcross>`__ irgendwo auf Ihrem Rechner (oder laden Sie eine ZIP-Datei herunter und entpacken Sie sie irgendwo), z.B.::
zh_tw: 先 Clone `OSXCross 儲存庫 <https://github.com/tpoechtrager/osxcross>`__ 至電腦上的某處 (或下載 ZIP 檔然後解壓縮)。如：

source: Follow the instructions to package the SDK: https://github.com/tpoechtrager/osxcross#packaging-the-sdk
de: Befolgen Sie die Anweisungen zum Packen des SDK: https://github.com/tpoechtrager/osxcross#packaging-the-sdk
zh_tw: 請依照這個指示來打包 SDK：https://github.com/tpoechtrager/osxcross#packaging-the-sdk

source: Follow the instructions to install OSXCross: https://github.com/tpoechtrager/osxcross#installation
de: Befolgen Sie die Anweisungen zum Installieren von OSXCross: https://github.com/tpoechtrager/osxcross#installation
zh_tw: 請依照這個指示來安裝 OSXCross：https://github.com/tpoechtrager/osxcross#installation

source: After that, you will need to define the ``OSXCROSS_ROOT`` as the path to the OSXCross installation (the same place where you cloned the repository/extracted the zip), e.g.::
de: Danach müssen Sie ``OSXCROSS_ROOT`` als Pfad zur OSXCross-Installation definieren (derselbe Ort, an dem Sie das Repository geklont bzw. das Zip entpackt haben), z.B.::
zh_tw: 之後，還需要將 ``OSXCROSS_ROOT`` 定義為 OSXCross 安裝的路徑 (也就是與儲存庫 Clone 或解壓縮的路徑)。如：

source: Now you can compile with SCons like you normally would::
de: Jetzt können Sie mit SCons kompilieren, wie Sie es normalerweise tun würden::
zh_tw: 之後就可以與平常一樣使用 SCons：

source: If you have an OSXCross SDK version different from the one expected by the SCons buildsystem, you can specify a custom one with the ``osxcross_sdk`` argument::
de: Wenn Sie eine andere OSXCross SDK-Version haben als die, die vom SCons Buildsystem erwartet wird, können Sie eine eigene Version mit dem ``osxcross_sdk`` Argument angeben::
zh_tw: 若 OSXCross 的 SDK 版本與 SCons 建置系統所預期不同，則必須通過 ``osxcross_sdk`` 參數來指定一個版本：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: To create an ``.app`` bundle like in the official builds, you need to use the template located in ``misc/dist/macos_tools.app``. Typically, for an optimized editor binary built with ``dev_build=yes``::
de: Um ein ``.app``-Bundle wie in den offiziellen Builds zu erstellen, müssen Sie die Vorlage verwenden, die sich in ``misc/dist/macos_tools.app`` befindet. Typischerweise ist dies für ein optimiertes Editor-Binary, das mit ``dev_build=yes`` gebaut wurde::
