Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_with_script_encryption_key.po
Languages: de, zh_tw

source: Compiling with PCK encryption key
de: Kompilieren mit PCK-Verschlüsselungscode
zh_tw: 以腳本加密密鑰進行編譯

source: The export dialog gives you the option to encrypt your PCK file with a 256-bit AES key when releasing your project. This will make sure your scenes, scripts and other resources are not stored in plain text and can not easily be ripped by some script kiddie.
de: Der Exportdialog bietet Ihnen die Möglichkeit, Ihre PCK-Datei mit einem 256-Bit-AES-Schlüssel zu verschlüsseln, wenn Sie Ihr Projekt releasen. Dadurch wird sichergestellt, dass Ihre Szenen, Skripte und anderen Ressourcen nicht im Klartext gespeichert werden und nicht einfach von einem Skript-Kiddie entwendet werden können.
zh_tw: 在釋出遊戲時，匯出對話框中有可以使用 256 位元 AES 密鑰加密腳本的選項。通過該選項可以確保腳本不以純文字形式保存，且無法輕易地被一些腳本小子 (Script Kiddie) 輕鬆取得。當然，金鑰必須要保存在二進位檔中，但經過編譯、最佳化、並移除符號後，就需要花一點時間才能找到密鑰。

source: Of course, the key needs to be stored in the binary, but if it's compiled, optimized and without symbols, it would take some effort to find it.
de: Natürlich muss der Schlüssel in der Binärdatei gespeichert sein, aber wenn sie kompiliert und optimiert ist und keine Symbole enthält, wäre es sehr mühsam, ihn zu finden.
zh_tw: 當然，金鑰需要儲存在二進位檔案中，但是經過編譯、優化、去除符號後，是需要花費一些精力才能找到的。

source: For this to work, you need to build the export templates from source, with that same key.
de: Damit dies funktioniert, müssen Sie die Exportvorlagen aus der Quelle mit demselben Schlüssel erstellen.
zh_tw: 要加密腳本，需要以同一組密鑰來從原始碼編譯匯出腳本。

source: This will **not** work if you use official, precompiled export templates. It is absolutely **required** to compile your own export templates to use PCK encryption.
de: Dies wird **nicht** funktionieren, wenn Sie offizielle, vorkompilierte Exportvorlagen verwenden. Es ist absolut **erforderlich**, dass Sie Ihre eigenen Exportvorlagen kompilieren, um die PCK-Verschlüsselung zu verwenden.
zh_tw: 如果你使用官方預編譯的匯出範本，是**不會**起作用的。要使用 PCK 加密，絕對**必須**自己編譯匯出範本。

source: By default, Android exports store assets directly in the APK file and aren't affected by PCK encryption. To use PCK encryption on Android, enable **APK expansion** in the export options.
de: Standardmäßig werden Assets bei Android-Exporten direkt in der APK-Datei gespeichert und sind von der PCK-Verschlüsselung nicht betroffen. Um PCK-Verschlüsselung unter Android zu verwenden, aktivieren Sie **APK-Erweiterung** in den Exportoptionen.
zh_tw: 預設情況下，Android 匯出將資源直接儲存在 APK 檔案中，並且不受 PCK 加密的影響。若要在 Android 上使用 PCK 加密，請在匯出選項中啟用 **APK 擴充**。

source: Step by step
de: Schritt für Schritt
zh_tw: 按部就班

source: Generate a 256-bit AES key in hexadecimal format. You can use the aes-256-cbc variant from `this service <https://asecuritysite.com/encryption/keygen>`_.
de: Erzeugen Sie einen 256-Bit-AES-Schlüssel im Hexadezimalformat. Sie können die Variante aes-256-cbc von `diesem Dienst <https://asecuritysite.com/encryption/keygen>`_ verwenden.
zh_tw: 產生十六進位格式的 256 位元 AES 密鑰。可以使用 `這個服務 <https://asecuritysite.com/encryption/keygen>`_ 中的 AES-256-CBC 變體。

source: Alternatively, you can generate it yourself using `OpenSSL <https://www.openssl.org/>`__ command-line tools:
de: Alternativ können Sie ihn auch selbst mit Hilfe der Kommandozeilen-Tools von `OpenSSL <https://www.openssl.org/>`__ erzeugen:
zh_tw: 或者，也可以通過 OpenSSL 來自行產生：

source: The output in ``godot.gdkey`` should be similar to:
de: Die Ausgabe in ``godot.gdkey`` sollte in etwa so aussehen:
zh_tw: ``godot.gdkey`` 中的輸出應該類似：

source: You can generate the key without redirecting the output to a file, but that way you can minimize the risk of exposing the key.
de: Sie können den Schlüssel generieren, ohne die Ausgabe in eine Datei umzuleiten, aber auf diese Weise können Sie das Risiko minimieren, den Schlüssel preiszugeben.
zh_tw: 產生密鑰時可以不將輸出重新導向輸出至檔案，這樣可以最小化密鑰暴露的風險。

source: Set this key as environment variable in the console that you will use to compile Godot, like this:
de: Setzen Sie diesen Schlüssel als Umgebungsvariable in der Konsole, die Sie zum Kompilieren von Godot verwenden werden, etwa so:
zh_tw: 將該密鑰在用來編譯 Godot 的主控台中設為環境變數，如：

source: Compile Godot export templates and set them as custom export templates in the export preset options.
de: Kompilieren Sie Godot-Exportvorlagen und legen Sie sie als benutzerdefinierte Exportvorlagen in den Export-Vorgabeoptionen fest.
zh_tw: 編譯 Godot 匯出樣板，並將該匯出樣板在匯出預設設定中設為自定匯出樣板。

source: Set the encryption key in the **Encryption** tab of the export preset:
de: Legen Sie den Verschlüsselungsschlüssel im Tab **Verschlüsselung** der Exportvorgabe fest:
zh_tw: 在匯出預設設定中的 ``腳本`` 分頁設定加密密鑰：

source: Add filters for the files/folders to encrypt. **By default**, include filters are empty and **nothing will be encrypted**.
de: Fügen Sie Filter für die zu verschlüsselnden Dateien/Ordner hinzu. **Standardmäßig** sind Include-Filter leer und **nichts wird verschlüsselt**.
zh_tw: 為要加密的檔案/資料夾新增篩選器。 **預設情況下**，包含篩選器為空並且**不會加密任何內容**。

source: Export the project. The project should run with the files encrypted now.
de: Exportieren Sie das Projekt. Das Projekt sollte jetzt mit verschlüsselten Dateien laufen.
zh_tw: 匯出專案。該遊戲現在應該會使用加密腳本來執行。

source: Troubleshooting
de: Fehlersuche
zh_tw: 疑難排解

source: If you get an error like below, it means the key wasn't properly included in your Godot build. Godot is encrypting PCK file during export, but can't read it at runtime.
de: Wenn Sie eine Fehlermeldung wie unten erhalten, bedeutet dies, dass der Schlüssel nicht ordnungsgemäß in Ihren Godot-Build aufgenommen wurde. Godot verschlüsselt die PCK-Datei während des Exports, kann sie aber zur Laufzeit nicht lesen.
zh_tw: 若遇到類似下方的錯誤，這代表加密密鑰沒有被正確包含到 Godot 建置中。這代表 Godot 在匯出時有加密腳本，但執行階段無法讀取。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
