Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_linuxbsd.po
Languages: de, zh_tw

source: If you can't run ``pyston-scons`` after creating the symbolic link, make sure ``$HOME/.local/bin/`` is part of your user's ``PATH`` environment variable.
de: Wenn Sie ``pyston-scons`` nicht ausführen können, nachdem Sie den symbolischen Link erstellt haben, stellen Sie sicher, dass ``$HOME/.local/bin/`` Teil der ``PATH``-Umgebungsvariable Ihres Benutzers ist.
zh_tw: 如果建立符號連結後無法執行 ``pyston-scons``，請確定 ``$HOME/.local/bin/`` 是目前使用者的 ``PATH`` 環境變數的一部分。

source: Alternatively, you can run ``python -m pip install pyston_lite_autoload`` then run SCons as usual. This will automatically load a subset of Pyston's optimizations in any Python program you run. However, this won't bring as much of a performance improvement compared to installing "full" Pyston.
de: Alternativ können Sie auch ``python -m pip install pyston_lite_autoload`` ausführen und dann SCons wie gewohnt starten. Dies wird automatisch eine Teilmenge der Pyston-Optimierungen in jedes Python-Programm laden, das Sie ausführen. Allerdings bringt dies keine so große Performanceverbesserung im Vergleich zur Installation von "vollem" Pyston.
zh_tw: 或者，您可以執行“python -m pip install pyston_lite_autoload”，然後照常執行 SCons。這將自動在您執行的任何 Python 程式中載入 Pyston 最佳化的子集。然而，與安裝「完整」Pyston 相比，這不會帶來那麼多的效能改進。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Follow `these instructions <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__ to configure, build, and install ``libatomic_ops``. Then, copy ``/usr/lib/libatomic_ops.a`` to ``/usr/lib/libatomic.a``, or create a soft link to ``libatomic_ops`` by command ``ln -s /usr/lib/libatomic_ops.a /usr/lib/libatomic.a``. The soft link can ensure the latest ``libatomic_ops`` will be used without the need to copy it everytime when it is updated.
de: Folgen Sie `diesen Anweisungen <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__, um ``libatomic_ops`` zu konfigurieren, zu bauen und zu installieren. Dann kopieren Sie ``/usr/lib/libatomic_ops.a`` nach ``/usr/lib/libatomic.a`` oder erstellen Sie einen Softlink zu ``libatomic_ops`` mit dem Befehl ``ln -s /usr/lib/libatomic_ops.a /usr/lib/libatomic.a``. Der Softlink stellt sicher, dass die neueste Version von ``libatomic_ops`` verwendet wird, ohne dass sie jedes Mal kopiert werden muss, wenn sie aktualisiert wird.
