Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_windows.po
Languages: de

source: Compiling for Windows
de: Kompilieren für Windows

source: This page describes how to compile Windows editor and export template binaries from source. If you're looking to export your project to Windows instead, read :ref:`doc_exporting_for_windows`.
de: Diese Seite beschreibt, wie man den Windows-Editor und Exportvorlagen-Binärdateien aus dem Quellcode kompiliert. Wenn Sie Ihr Projekt stattdessen nach Windows exportieren wollen, lesen Sie :ref:`doc_exporting_for_windows`.

source: Requirements
de: Anforderungen

source: For compiling under Windows, the following is required:
de: Zum Kompilieren unter Windows ist Folgendes erforderlich:

source: `Visual Studio Community <https://www.visualstudio.com/vs/community/>`_, version 2017 or later. VS 2019 is recommended. **Make sure to read "Installing Visual Studio caveats" below or you will have to run/download the installer again.**
de: `Visual Studio Community <https://www.visualstudio.com/vs/community/>`_, Version 2017 oder höher. VS 2019 wird empfohlen. **Stellen Sie sicher, dass Sie "Einschränkungen bei der Installation von Visual Studio" unten lesen, sonst müssen Sie das Installationsprogramm erneut ausführen/herunterladen.**

source: `MinGW-w64 <https://mingw-w64.org/>`_ with GCC can be used as an alternative to Visual Studio. Be sure to install/configure it to use the ``posix`` thread model. **Important:** When using MinGW to compile the ``master`` branch, you need GCC 9 or later.
de: `MinGW-w64 <https://mingw-w64.org/>`_ mit GCC kann als Alternative zu Visual Studio verwendet werden. Stellen Sie sicher, dass Sie es so installieren/konfigurieren, dass das ``posix``-Thread-Modell verwendet wird. **Wichtig:** Wenn Sie MinGW verwenden, um den ``master``-Branch zu kompilieren, benötigen Sie GCC 9 oder höher.

source: `Python 3.6+ <https://www.python.org/downloads/windows/>`_. **Make sure to enable the option to add Python to the ``PATH`` in the installer.**
de: `Python 3.6+ <https://www.python.org/downloads/windows/>`_. **Stellen Sie sicher, dass die Option, Python zum ``PATH`` hinzuzufügen, im Installationsprogramm aktiviert ist.**

source: `SCons 3.0+ <https://scons.org/pages/download.html>`_ build system. Using the latest release is recommended, especially for proper support of recent Visual Studio releases.
de: `SCons 3.0+ <https://scons.org/pages/download.html>`_-Buildsystem. Es wird empfohlen, das neueste Release zu verwenden, insbesondere für die korrekte Unterstützung der neuesten Visual Studio-Releases.

source: If you have `Scoop <https://scoop.sh/>`_ installed, you can easily install MinGW and other dependencies using the following command::
de: Wenn Sie `Scoop <https://scoop.sh/>`_ installiert haben, können Sie MinGW und andere Abhängigkeiten einfach mit dem folgenden Befehl installieren::

source: If you have `MSYS2 <https://www.msys2.org/>`_ installed, you can easily install MinGW and other dependencies using the following command::
de: Wenn Sie `MSYS2 <https://www.msys2.org/>`_ installiert haben, können Sie MinGW und andere Abhängigkeiten einfach mit dem folgenden Befehl installieren::

source: For each MSYS2 MinGW subsystem, you should then run `pip3 install scons` in its shell.
de: Für jedes MSYS2 MinGW-Subsystem sollten Sie dann `pip3 install scons` in seiner Shell ausführen.

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
de: Um den Godot-Quellcode zum Kompilieren zu erhalten, siehe :ref:`doc_getting_source`.

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
de: Eine allgemeine Übersicht über die Verwendung von SCons für Godot finden Sie unter :ref:`doc_introduction_to_the_buildsystem`.

source: Setting up SCons
de: SCons einrichten

source: To install SCons, open the command prompt and run the following command::
de: Um SCons zu installieren, öffnen Sie die Eingabeaufforderung und führen Sie den folgenden Befehl aus::

source: If you are prompted with the message ``Defaulting to user installation because normal site-packages is not writeable``, you may have to run that command again using elevated permissions. Open a new command prompt as an Administrator then run the command again to ensure that SCons is available from the ``PATH``.
de: Wenn Sie die Meldung ``Defaulting to user installation because normal site-packages is not writeable`` erhalten, müssen Sie den Befehl möglicherweise mit erweiterten Rechten erneut ausführen. Öffnen Sie eine neue Eingabeaufforderung als Administrator und führen Sie den Befehl erneut aus, um sicherzustellen, dass SCons im ``PATH`` verfügbar ist.

source: To check whether you have installed Python and SCons correctly, you can type ``python --version`` and ``scons --version`` into a command prompt (``cmd.exe``).
de: Um zu überprüfen, ob Sie Python und SCons korrekt installiert haben, können Sie ``python --version`` und ``scons --version`` in eine Eingabeaufforderung (``cmd.exe``) eingeben.

source: If the commands above don't work, make sure to add Python to your ``PATH`` environment variable after installing it, then check again. You can do so by running the Python installer again and enabling the option to add Python to the ``PATH``.
de: Wenn die obigen Befehle nicht funktionieren, stellen Sie sicher, dass Sie Python nach der Installation zu Ihrer ``PATH``-Umgebungsvariablen hinzufügen und überprüfen Sie es dann erneut. Sie können dies tun, indem Sie das Python-Installationsprogramm erneut ausführen und die Option zum Hinzufügen von Python zum ``PATH`` aktivieren.

source: If SCons cannot detect your Visual Studio installation, it might be that your SCons version is too old. Update it to the latest version with ``python -m pip install --upgrade scons``.
de: Wenn SCons Ihre Visual Studio-Installation nicht erkennen kann, könnte es sein, dass Ihre SCons-Version zu alt ist. Aktualisieren Sie es auf die neueste Version mit ``python -m pip install --upgrade scons``.

source: Installing Visual Studio caveats
de: Einschränkungen beim Installieren von Visual Studio

source: If installing Visual Studio 2017 or 2019, make sure to enable **C++** in the list of workflows to install.
de: Wenn Sie Visual Studio 2017 oder 2019 installieren, stellen Sie sicher, dass Sie **C++** in der Liste der zu installierenden Workflows aktivieren.

source: If installing Visual Studio 2015, make sure to run a **Custom** installation instead of **Typical** and select **C++** as a language there.
de: Wenn Sie Visual Studio 2015 installieren, stellen Sie sicher, dass Sie eine **Custom**-Installation anstelle von **Typical** ausführen und dort **C++** als Sprache auswählen.

source: If you've already made the mistake of installing Visual Studio without C++ support, run the installer again; it should present you a **Modify** button. Running the installer from *Add/Remove Programs* will only give you a **Repair** option, which won't let you install C++ tools.
de: Wenn Sie bereits den Fehler gemacht haben, Visual Studio ohne C++-Unterstützung zu installieren, führen Sie das Installationsprogramm erneut aus; es sollte Ihnen einen Button **Modify** anzeigen. Wenn Sie das Installationsprogramm über *Programme hinzufügen/entfernen* ausführen, erhalten Sie nur die Option **Repair**, mit der Sie keine C++-Tools installieren können.

source: Downloading Godot's source
de: Den Godot-Quellcode herunterladen

source: Refer to :ref:`doc_getting_source` for detailed instructions.
de: Siehe :ref:`doc_getting_source` für detaillierte Anweisungen.

source: The tutorial will assume from now on that you placed the source code in ``C:\godot``.
de: Das Tutorial geht davon aus, dass Sie den Quellcode in ``C:\godot`` abgelegt haben.

source: To prevent slowdowns caused by continuous virus scanning during compilation, add the Godot source folder to the list of exceptions in your antivirus software.
de: Um Verlangsamungen durch ständiges Virenscannen während der Kompilierung zu vermeiden, fügen Sie den Godot-Quellcode-Ordner zur Liste der Ausnahmen in Ihrer Antiviren-Software hinzu.

source: For Windows Defender, hit the :kbd:`Windows` key, type "Windows Security" then hit :kbd:`Enter`. Click on **Virus & threat protection** on the left panel. Under **Virus & threat protection settings** click on **Mange Settings** and scroll down to **Exclusions**. Click **Add or remove exclusions** then add the Godot source folder.
de: Für Windows Defender drücken Sie die :kbd:`Windows`-Taste, geben "Windows Sicherheit" ein und drücken dann :kbd:`Enter`. Klicken Sie unter **Viren- und Bedrohungsschutz** auf **Einstellungen verwalten** und scrollen Sie nach unten zu **Ausnahmen**. Klicken Sie auf **Ausnahmen hinzufügen oder entfernen** und fügen Sie den Godot-Quellcode-Ordner hinzu.

source: Compiling
de: Kompilieren

source: Selecting a compiler
de: Einen Compiler auswählen

source: SCons will automatically find and use an existing Visual Studio installation. If you do not have Visual Studio installed, it will attempt to use MinGW instead. If you already have Visual Studio installed and want to use MinGW, pass ``use_mingw=yes`` to the SCons command line. Note that MSVC builds cannot be performed from the MSYS2 or MinGW shells. Use either ``cmd.exe`` or PowerShell instead.
de: SCons wird automatisch eine vorhandene Visual Studio-Installation finden und verwenden. Wenn Sie Visual Studio nicht installiert haben, wird versucht, stattdessen MinGW zu verwenden. Wenn Sie Visual Studio bereits installiert haben und MinGW verwenden wollen, übergeben Sie ``use_mingw=yes`` an die SCons-Kommandozeile. Beachten Sie, dass MSVC-Builds nicht von den MSYS2- oder MinGW-Shells aus durchgeführt werden können. Verwenden Sie stattdessen entweder ``cmd.exe`` oder PowerShell.

source: During development, using the Visual Studio compiler is usually a better idea, as it links the Godot binary much faster than MinGW. However, MinGW can produce more optimized binaries using link-time optimization (see below), making it a better choice for production use.
de: Während der Entwicklung ist die Verwendung des Visual Studio-Compilers in der Regel die bessere Wahl, da er die Godot-Binärdatei viel schneller als MinGW linkt. MinGW kann jedoch mithilfe der Link-Time-Optimierung (siehe unten) optimiertere Binärdateien erzeugen und ist daher die bessere Wahl für den Produktionseinsatz.

source: Running SCons
de: SCons starten

source: After opening a command prompt, change to the root directory of the engine source code (using ``cd``) and type::
de: Nachdem Sie eine Eingabeaufforderung geöffnet haben, wechseln Sie in das Stammverzeichnis des Quellcodes der Engine (mit ``cd``) und geben Sie ein::

source: When compiling with multiple CPU threads, SCons may warn about pywin32 being missing. You can safely ignore this warning.
de: Beim Kompilieren mit mehreren CPU-Threads kann SCons eine Warnung über das Fehlen von pywin32 ausgeben. Sie können diese Warnung getrost ignorieren.

source: If all goes well, the resulting binary executable will be placed in ``C:\godot\bin\`` with the name ``godot.windows.editor.x86_32.exe`` or ``godot.windows.editor.x86_64.exe``. By default, SCons will build a binary matching your CPU architecture, but this can be overridden using ``arch=x86_64`` or ``arch=x86_32``.
de: Wenn alles gut geht, wird die resultierende Binärdatei unter dem Namen ``godot.windows.editor.x86_32.exe`` oder ``godot.windows.editor.x86_64.exe`` in ``C:\godot\bin\`` abgelegt. Standardmäßig wird SCons eine Binärdatei erstellen, die zu Ihrer CPU-Architektur passt, aber dies kann mit ``arch=x86_64`` oder ``arch=x86_32`` überschrieben werden.

source: This executable file contains the whole engine and runs without any dependencies. Running it will bring up the Project Manager.
de: Diese ausführbare Datei enthält die gesamte Engine und läuft ohne jegliche Abhängigkeiten. Wenn Sie sie ausführen, wird der Projektmanager angezeigt.

source: If you are compiling Godot for production use, then you can make the final executable smaller and faster by adding the SCons option ``target=template_release``.
de: Wenn Sie Godot für den Produktionseinsatz kompilieren, können Sie die endgültige ausführbare Datei kleiner und schneller machen, indem Sie die SCons-Option ``target=template_release`` hinzufügen.

source: If you are compiling Godot with MinGW, you can make the binary even smaller and faster by adding the SCons option ``lto=full``. As link-time optimization is a memory-intensive process, this will require about 7 GB of available RAM while compiling.
de: Wenn Sie Godot mit MinGW kompilieren, können Sie die Binärdatei noch kleiner und schneller machen, indem Sie die SCons-Option ``lto=full`` hinzufügen. Da die Link-Time-Optimierung ein speicherintensiver Prozess ist, werden beim Kompilieren etwa 7 GB verfügbarer Arbeitsspeicher benötigt.

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
de: Wenn Sie getrennte Editoreinstellungen für Ihre eigenen Godot-Builds und die offiziellen Releases verwenden wollen, können Sie den :ref:`doc_data_paths_self_contained_mode` aktivieren, indem Sie eine Datei namens ``._sc_`` oder ``_sc_`` im ``bin/``-Ordner anlegen.

source: Development in Visual Studio
de: Entwickeln in Visual Studio

source: Using an IDE is not required to compile Godot, as SCons takes care of everything. But if you intend to do engine development or debugging of the engine's C++ code, you may be interested in configuring a code editor or an IDE.
de: Die Verwendung einer IDE ist für die Kompilierung von Godot nicht erforderlich, da SCons sich um alles kümmert. Wenn Sie jedoch beabsichtigen, den C++-Code der Engine zu weiterzuentwickeln oder zu debuggen, sind Sie möglicherweise an der Konfiguration eines Code-Editors oder einer IDE interessiert.

source: Folder-based editors don't require any particular setup to start working with Godot's codebase. To edit projects with Visual Studio they need to be set up as a solution.
de: Ordnerbasierte Editoren erfordern keine besondere Einrichtung, um mit der Codebasis von Godot zu arbeiten. Um Projekte mit Visual Studio zu bearbeiten, müssen sie als Solution eingerichtet werden.

source: You can create a Visual Studio solution via SCons by running SCons with the ``vsproj=yes`` parameter, like this::
de: Sie können eine Visual Studio-Solution über SCons erstellen, indem Sie SCons mit dem Parameter ``vsproj=yes`` starten, wie folgt::

source: You will be able to open Godot's source in a Visual Studio solution now, and able to build Godot using Visual Studio's **Build** button.
de: Sie können jetzt den Quellcode von Godot in einer Visual Studio-Solution öffnen und Godot mit dem **Build**-Button von Visual Studio bauen.

source: See :ref:`doc_configuring_an_ide_vs` for further details.
de: Siehe :ref:`doc_configuring_an_ide_vs` für weitere Details.

source: Cross-compiling for Windows from other operating systems
de: Cross-Kompilierung für Windows von anderen Betriebssystemen

source: If you are a Linux or macOS user, you need to install `MinGW-w64 <https://mingw-w64.org/doku.php>`__, which typically comes in 32-bit and 64-bit variants. The package names may differ based on your distribution, here are some known ones:
de: Wenn Sie ein Linux- oder macOS-Benutzer sind, müssen Sie `MinGW-w64 <https://mingw-w64.org/doku.php>`__ installieren, das normalerweise in 32-Bit- und 64-Bit-Varianten erhältlich ist. Die Paketnamen können je nach Distribution unterschiedlich sein, hier sind einige bekannte:

source: Before attempting the compilation, SCons will check for the following binaries in your ``PATH`` environment variable::
de: Bevor die Kompilierung durchgeführt wird, sucht SCons nach den folgenden Binärdateien in Ihrer ``PATH``-Umgebungsvariable::

source: If the binaries are not located in the ``PATH`` (e.g. ``/usr/bin``), you can define the following environment variable to give a hint to the build system::
de: Wenn sich die Binaries nicht im ``PATH`` befinden (z.B. ``/usr/bin``), können Sie die folgenden Umgebungsvariablen definieren, um dem Buildsystem einen Hinweis zu geben::

source: Where ``/path/to/mingw`` is the path containing the ``bin`` directory where ``i686-w64-mingw32-gcc`` and ``x86_64-w64-mingw32-gcc`` are located (e.g. ``/opt/mingw-w64`` if the binaries are located in ``/opt/mingw-w64/bin``).
de: Dabei ist ``/path/to/mingw`` der Pfad, der das ``bin``-Verzeichnis enthält, in dem sich ``i686-w64-mingw32-gcc`` und ``x86_64-w64-mingw32-gcc`` befinden (z.B. ``/opt/mingw-w64``, wenn sich die Binaries in ``/opt/mingw-w64/bin`` befinden).

source: To make sure you are doing things correctly, executing the following in the shell should result in a working compiler (the version output may differ based on your system)::
de: Um sicherzugehen, dass Sie alles richtig machen, sollten Sie folgendes in der Shell ausführen, um einen funktionierenden Compiler zu erhalten (die Ausgabe der Version kann je nach System unterschiedlich sein)::

source: When cross-compiling for Windows using MinGW-w64, keep in mind only ``x86_64`` and ``x86_32`` architectures are supported. Be sure to specify the right ``arch=`` option when invoking SCons if building from a different architecture.
de: Beim Cross-Compiling für Windows mit MinGW-w64 ist zu beachten, dass nur ``x86_64`` und ``x86_32``-Architekturen unterstützt werden. Stellen Sie sicher, dass Sie die richtige ``arch=``-Option beim Aufruf von SCons angeben, wenn Sie von einer anderen Architektur aus kompilieren.

source: Troubleshooting
de: Fehlersuche

source: Cross-compiling from some Ubuntu versions may lead to `this bug <https://github.com/godotengine/godot/issues/9258>`_, due to a default configuration lacking support for POSIX threading.
de: Das Cross-Compiling von einigen Ubuntu-Versionen kann zu `diesem Bug <https://github.com/godotengine/godot/issues/9258>`_ führen, da die Standardkonfiguration keine Unterstützung für POSIX-Threading bietet.

source: You can change that configuration following those instructions, for 64-bit::
de: Sie können die Konfiguration gemäß diesen Anweisungen für 64-Bit ändern::

source: And for 32-bit::
de: Und für 32 Bit::

source: Creating Windows export templates
de: Erstellen von Windows-Exportvorlagen

source: Windows export templates are created by compiling Godot without the editor, with the following flags::
de: Windows-Exportvorlagen werden durch Kompilieren von Godot ohne Editor und mit den folgenden Flags erstellt::

source: If you plan on replacing the standard export templates, copy these to the following location, replacing ``<version>`` with the version identifier (such as ``3.1.1.stable`` or ``3.2.dev``)::
de: Wenn Sie vorhaben, die Default-Exportvorlagen zu ersetzen, kopieren Sie diese in das folgende Verzeichnis, wobei Sie ``<Version>`` durch die Versionskennung (wie ``3.1.1.stable`` oder ``3.2.dev``) ersetzen::

source: With the following names::
de: Mit den folgenden Namen::

source: However, if you are using custom modules or custom engine code, you may instead want to configure your binaries as custom export templates here:
de: Wenn Sie jedoch benutzerdefinierte Module oder benutzerdefinierten Engine-Code verwenden, können Sie Ihre Binärdateien hier als benutzerdefinierte Exportvorlagen konfigurieren:

source: You don't need to copy them in this case, just reference the resulting files in the ``bin\`` directory of your Godot source folder, so the next time you build, you will automatically have the custom templates referenced.
de: Sie brauchen sie in diesem Fall nicht zu kopieren, sondern referenzieren einfach die resultierenden Dateien im Verzeichnis ``bin\`` Ihres Godot-Quellordners, so dass Sie beim nächsten Build automatisch die benutzerdefinierten Vorlagen referenziert haben.

source: Translation status
de: Übersetzungsstatus
