Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/cross-compiling_for_ios_on_linux.po
Languages: de, zh_tw

source: Cross-compiling for iOS on Linux
de: Cross-Compiling für iOS unter Linux
zh_tw: 在 Linux 上為 iOS 進行交叉編譯

source: The procedure for this is somewhat complex and requires a lot of steps, but once you have the environment properly configured you can compile Godot for iOS anytime you want.
de: Das Verfahren hierfür ist etwas komplex und erfordert viele Schritte, aber sobald Sie die Umgebung richtig konfiguriert haben, können Sie Godot für iOS jederzeit kompilieren.
zh_tw: 為 iOS 交叉編譯的步驟有點複雜，並需要許多步驟。但正確設定好環境後，便能隨時輕鬆為 iOS 編譯 Godot。

source: Disclaimer
de: Wichtiger Hinweis
zh_tw: 免責宣告

source: While it is possible to compile for iOS on a Linux environment, Apple is very restrictive about the tools to be used (especially hardware-wise), allowing pretty much only their products to be used for development. So this is **not official**. However, in 2010 Apple said they relaxed some of the `App Store review guidelines <https://developer.apple.com/app-store/review/guidelines/>`__ to allow any tool to be used, as long as the resulting binary does not download any code, which means it should be OK to use the procedure described here and cross-compiling the binary.
de: Es ist zwar möglich, für iOS in einer Linux-Umgebung zu kompilieren, aber Apple ist sehr restriktiv, was die zu verwendenden Tools angeht (vor allem in Bezug auf die Hardware), und lässt so gut wie nur seine Produkte für die Entwicklung zu. Diese Vorgehensweise ist also **nicht offiziell**. Allerdings sagte Apple 2010, dass sie einige der `App Store Review Guidelines <https://developer.apple.com/app-store/review/guidelines/>`__ gelockert haben, so dass jedes Tool verwendet werden kann, solange die resultierende Binärdatei keinen Code herunterlädt, was bedeutet, dass es OK sein sollte, das hier beschriebene Verfahren zu verwenden und die Binärdatei zu kompilieren.
zh_tw: 雖然可以在 Linux 上為 iOS 平台編譯，但 Apple 對於使用的工具有嚴格的限制 (特別是硬體方面)，幾乎只允許使用 Apple 自家產品進行開發。因此，這裡提到的方法 **並非官方的** 。但是，依據 `Apple 在 2010 年發表的一篇宣告 <http://www.apple.com/pr/library/2010/09/09Statement-by-Apple-on-App-Store-Review-Guidelines.html>`__ 提到，Apple 放寬了一些 `App Store 審查方針 <https://developer.apple.com/app-store/review/guidelines/>`__ ，只要最終產生的二進位檔不會下載任何程式碼，就可以使用任何的工具。這表示，依照本頁的說明來交叉編譯二進位執行檔應該沒什麼問題。

source: Requirements
de: Anforderungen
zh_tw: 系統需求

source: `XCode with the iOS SDK <https://developer.apple.com/xcode/download>`__ (a dmg image, for newer versions a **xip** file is going to be downloaded.)
de: `XCode mit dem iOS SDK <https://developer.apple.com/xcode/download>`__ (ein dmg-Image; für neuere Versionen wird eine **xip**-Datei heruntergeladen).
zh_tw: `包含 iOS SDK 的 XCode <https://developer.apple.com/xcode/download>`__ (DMG 映像檔)

source: `Clang >= 3.5 <https://clang.llvm.org>`__ for your development machine installed and in the ``PATH``. It has to be version >= 3.5 to target ``arm64`` architecture.
de: `Clang >= 3.5 <https://clang.llvm.org>`__ für Ihren Entwicklungsrechner installiert und im ``PATH`` referenziert. Für die ``arm64``-Architektur als Target muss es Version >= 3.5 sein.
zh_tw: `Clang >= 3.5 <http://clang.llvm.org>`__ ，安裝於用於開發的機器上，並且需放置於 ``PATH`` 內。版本必須 >= 3.5 才能處理 ``arm64`` 架構的建置目標。

source: `Fuse <https://github.com/libfuse/libfuse>`__ for mounting and unmounting the dmg image.
de: `Fuse <https://github.com/libfuse/libfuse>`__ zum Mounten und Unmounten des dmg-Images.
zh_tw: `Fuse <https://github.com/libfuse/libfuse>`__ ，用於掛載與取消掛載 DMG 映像。

source: `darling-dmg <https://github.com/darlinghq/darling-dmg>`__, which needs to be built from source. The procedure for that is explained below.
de: `darling-dmg <https://github.com/darlinghq/darling-dmg>`__, das aus den Quellen gebaut werden muss. Das Verfahren dafür wird weiter unten erklärt.
zh_tw: `darling-dmg <https://github.com/darlinghq/darling-dmg>`__ ，必須從原始碼編譯。編譯方法會在稍後說明。

source: For newer versions you should download `xar <https://mackyle.github.io/xar/>`__ and `pbzx <https://github.com/NiklasRosenstein/pbzx>`__.
de: Für neuere Versionen sollten Sie `xar <https://mackyle.github.io/xar/>`__ und `pbzx <https://github.com/NiklasRosenstein/pbzx>`__ herunterladen.
zh_tw: 對於較新的版本，您應該下載 `xar <https://mackyle.github.io/xar/>`__ 和 `pbzx <https://github.com/NiklasRosenstein/pbzx>`__。

source: For building darling-dmg, you'll need the development packages of the following libraries: fuse, icu, openssl, zlib, bzip2.
de: Um darling-dmg zu erstellen, benötigen Sie die Entwicklungspakete der folgenden Bibliotheken: fuse, icu, openssl, zlib, bzip2.
zh_tw: 要建置 darling-dmg，則必須要有下列幾個函式庫的開發套件：fuse, icu, openssl, zlib, bzip2。

source: For building xar and pbzx you may want to follow `this guide <https://gist.github.com/phracker/1944ce190e01963c550566b749bd2b54>`__.
de: Für das Bauen von xar und pbzx sollten Sie `diese Anleitung <https://gist.github.com/phracker/1944ce190e01963c550566b749bd2b54>`__ befolgen.
zh_tw: 要建立 xar 和 pbzx，您可能需要遵循「本指南 <https://gist.github.com/phracker/1944ce190e01963c550566b749bd2b54>」__。

source: `cctools-port <https://github.com/tpoechtrager/cctools-port>`__ for the needed build tools. The procedure for building is quite peculiar and is described below.
de: `cctools-port <https://github.com/tpoechtrager/cctools-port>`__ für die benötigten Build-Tools. Das Verfahren zur Erstellung ist recht speziell und wird im Folgenden beschrieben.
zh_tw: `cctools-port <https://github.com/tpoechtrager/cctools-port>`__ 用於所需的建置工具。編譯的過程很特別，會在稍後說明。

source: This also has some extra dependencies: automake, autogen, libtool.
de: Dies hat auch einige zusätzliche Abhängigkeiten: automake, autogen, libtool.
zh_tw: 還有一些額外的相依性套件：automake, autogen, libtool。

source: Configuring the environment
de: Die Umgebung konfigurieren
zh_tw: 設定環境

source: Clone the repository on your machine:
de: Klonen Sie das Repository auf Ihrem Computer:
zh_tw: 將儲存庫 Clone 到機器上：

source: Build it:
de: Bauen Sie es:
zh_tw: 建置：

source: Preparing the SDK
de: Vorbereiten des SDK
zh_tw: 準備 SDK

source: Mount the XCode image:
de: Mounten Sie das XCode-Image:
zh_tw: 掛載 XCode 映像：

source: For newer versions you should extract the **xip** file:
de: Bei neueren Versionen sollten Sie die **xip**-Datei extrahieren:
zh_tw: 對於較新的版本，您應該提取 **xip** 檔案：

source: Note that for the commands below, you may need to replace the version (`X.x`) with whatever iOS SDK version you're using.
de: Beachten Sie, dass Sie bei den folgenden Befehlen die Version (`X.x`) durch die von Ihnen verwendete iOS SDK-Version ersetzen müssen.
zh_tw: 請注意，對於下面的命令，您可能需要將版本 (`Xx`) 替換為您正在使用的任何 iOS SDK 版本。

source: Extract the iOS SDK:
de: Extrahieren Sie das iOS SDK:
zh_tw: 解壓縮 iOS SDK：

source: Pack the SDK:
de: Packen Sie das SDK:
zh_tw: 打包 SDK：

source: Build cctools:
de: Bauen Sie cctools:
zh_tw: 建置 cctools：

source: Copy the tools to a nicer place. Note that the SCons scripts for building will look under ``usr/bin`` inside the directory you provide for the toolchain binaries, so you must copy to such subdirectory, akin to the following commands:
de: Kopieren Sie die Tools an einen schöneren Ort. Beachten Sie, dass die SCons-Skripte zum Bauen unter ``usr/bin`` innerhalb des Verzeichnisses suchen, das Sie für die Toolchain-Binärdateien zur Verfügung stellen, also müssen Sie in ein solches Unterverzeichnis kopieren, ähnlich wie bei den folgenden Befehlen:
zh_tw: 複製該工具至適當的地方。請注意，用於建置的 SCons 腳本會在所提供的 Toolchain 二進位檔資料夾中的 ``usr/bin`` 中搜尋，因此必須複製到這樣的子資料夾中，如下列指令：

source: Now you should have the iOS toolchain binaries in ``/home/user/iostoolchain/usr/bin``.
de: Jetzt sollten Sie die iOS-Toolchain-Binärdateien in ``/home/user/iostoolchain/usr/bin`` haben.
zh_tw: 現在 iOS Toolchain 二進位檔應該放在 ``/home/user/iostoolchain/usr/bin`` 中。

source: Compiling Godot for iPhone
de: Godot für iPhone kompilieren
zh_tw: 為 iPhone 編譯 Godot

source: Once you've done the above steps, you should keep two things in your environment: the built toolchain and the iPhoneOS SDK directory. Those can stay anywhere you want since you have to provide their paths to the SCons build command.
de: Sobald Sie die oben genannten Schritte ausgeführt haben, sollten Sie zwei Dinge in Ihrer Umgebung behalten: Die erstellte Toolchain und das iPhoneOS SDK-Verzeichnis. Diese können überall bleiben, da Sie ihre Pfade zum SCons-Build-Befehl angeben müssen.
zh_tw: 完成上述步驟後，需要將兩樣東西保留在開發環境中：建置 Toolchain 以及 iPhoneOS SDK 資料夾。因為儲存路徑需要在建置時主動提供給 SCons，所以這兩樣東西可以放在任何地方。

source: For the iPhone platform to be detected, you need the ``OSXCROSS_IOS`` environment variable defined to anything.
de: Damit die iPhone-Plattform erkannt werden kann, muss die Umgebungsvariable ``OSXCROSS_IOS`` als "anything" definiert sein.
zh_tw: 為了能偵測到 iPhone 平台，必須定義 ``OSXCROSS_IOS`` 環境變數，內容不拘。

source: Now you can compile for iPhone using SCons like the standard Godot way, with some additional arguments to provide the correct paths:
de: Jetzt können Sie mit SCons für das iPhone nach der Standard-Godot-Vorgehensweise kompilieren, mit einigen zusätzlichen Argumenten, um die richtigen Pfade anzugeben:
zh_tw: 現在可以通過與一般編譯 Godot 相同的方法來用 SCons 為 iPhone 進行編譯，但需要在一些額外的參數中提供正確路徑：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
