Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/getting_source.po
Languages: de, pt_br

source: Getting the source
de: Beschaffung des Quellcodes
pt_br: Adquirindo o código fonte

source: Downloading the Godot source code
de: Herunterladen des Godot-Quellcodes
pt_br: Baixando o código-fonte do Godot

source: Before :ref:`getting into the SCons build system <doc_introduction_to_the_buildsystem>` and compiling Godot, you need to actually download the Godot source code.
de: Bevor Sie :ref:`in das SCons-Buildsystem einsteigen <doc_introduction_to_the_buildsystem>` und Godot kompilieren, müssen Sie erst den Godot-Quellcode herunterladen.
pt_br: Antes de :ref:`entrar no sistema de compilação SCons <doc_introduction_to_the_buildsystem>` e compilar o Godot, você precisa antes baixar o código-fonte do Godot.

source: The source code is available on `GitHub <https://github.com/godotengine/godot>`__ and while you can manually download it via the website, in general you want to do it via the ``git`` version control system.
de: Der Quellcode ist auf `GitHub <https://github.com/godotengine/godot>`__ verfügbar und obwohl man ihn manuell über die Website herunterladen kann, sollte man dies im Allgemeinen über das ``git``-Versionskontrollsystem tun.
pt_br: O código-fonte está disponível no `GitHub <https://github.com/godotengine/godot>`__ e apesar de você poder baixar manualmente através do site, em geral é melhor baixar através do sistema de controle de versão ``git``.

source: If you are compiling in order to make contributions or pull requests, you should follow the instructions from the :ref:`Pull Request workflow <doc_pr_workflow>`.
de: Wenn Sie kompilieren, um eigene Beiträge oder Pull Requests zu erstellen, sollten Sie die Anweisungen des :ref:`Pull Request-Workflow <doc_pr_workflow>` befolgen.
pt_br: Se você está compilando para fazer contribuições ou pull requests, você deve seguir as instruções do :ref:`Fluxo de trabalho pull request <doc_pr_workflow>`.

source: If you don't know much about ``git`` yet, there are a great number of `tutorials <https://git-scm.com/book>`__ available on various websites.
de: Wenn Sie noch nicht viel über ``git`` wissen, gibt es eine große Anzahl von `Tutorials <https://git-scm.com/book>`__ auf verschiedenen Websites.
pt_br: Se você ainda não sabe muito sobre o ``git`, há um grande número de `tutoriais <https://git-scm.com/book>__ disponíveis em vários sites.

source: In general, you need to install ``git`` and/or one of the various GUI clients.
de: Im Allgemeinen müssen Sie ``git`` und/oder einen der verschiedenen GUI-Clients installieren.
pt_br: No geral, você precisa instalar o ``git`` e/ou um dos vários clientes GUI.

source: Afterwards, to get the latest development version of the Godot source code (the unstable ``master`` branch), you can use ``git clone``.
de: Um die neueste Entwicklungsversion des Godot-Quellcodes (den unstable ``master``-Branch) zu erhalten, können Sie ``git clone`` verwenden.
pt_br: Depois, para obter a versão de desenvolvimento mais recente do código-fonte do Godot (o ramo ``master``, instável), você pode usar ``git clone``.

source: If you are using the ``git`` command line client, this is done by entering the following in a terminal:
de: Wenn Sie den ``git``-Kommandozeilen-Client verwenden, geben Sie dazu Folgendes in ein Terminal ein:
pt_br: Se você estiver usando o cliente de linha de comando ``git``, isso é feito digitando o seguinte em um terminal:

source: For any stable release, visit the `release page <https://github.com/godotengine/godot/releases>`__ and click on the link for the release you want. You can then download and extract the source from the download link on the page.
de: Für jedes stable Release besuchen Sie die `Release-Seite <https://github.com/godotengine/godot/releases>`__ und klicken Sie auf den Link für das von Ihnen gewünschte Release. Sie können dann den Quellcode über den Download-Link auf der Seite herunterladen und extrahieren.
pt_br: Para qualquer versão estável, visite a `página de lançamentos <https://github.com/godotengine/godot/releases>`__ e clique no link para a versão que deseja. Você pode então baixar e extrair a fonte do link de download na página.

source: With ``git``, you can also clone a stable release by specifying its branch or tag after the ``--branch`` (or just ``-b``) argument::
de: Mit ``git`` können Sie auch ein stable Release klonen, indem Sie seinen Branch oder sein Tag nach dem Argument ``--branch`` (oder einfach ``-b``) angeben::
pt_br: Com o ``git``, você também pode clonar uma versão estável especificando seu ramo ou versão após o argumento ``--branch`` (ou apenas ``-b``)::

source: There are also generally branches besides ``master`` for each major version.
de: Im Allgemeinen gibt es für jede Major-Version auch andere Branches als den ``master``.
pt_br: Também há geralmente ramos além do ``master`` para cada versão principal.

source: After downloading the Godot source code, you can :ref:`continue to compiling Godot <doc_introduction_to_the_buildsystem>`.
de: Nachdem Sie den Godot-Quellcode heruntergeladen haben, können Sie :ref:`mit der Kompilierung von Godot fortfahren <doc_introduction_to_the_buildsystem>`.
pt_br: Depois de baixar o código-fonte do Godot, você pode :ref:`continuar a compilar o Godot <doc_introduction_to_the_buildsystem>`.

source: Translation status
de: Übersetzungsstatus
pt_br: Progresso da Tradução
