Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/index.po
Languages: de

source: Building from source
de: Kompilieren des Quellcodes

source: Godot prides itself on being very easy to build, by C++ projects' standards. :ref:`Godot uses the SCons build system <doc_faq_why_scons>`, and after the initial setup compiling the engine for your current platform should be as easy as running::
de: Godot ist stolz darauf, dass es für C++-Projekte sehr einfach zu bauen ist. :ref:`Godot verwendet das SCons-Build-System <doc_faq_why_scons>`, und nach der anfänglichen Einrichtung sollte das Kompilieren der Engine für Ihre aktuelle Plattform so einfach sein wie das Ausführen von::

source: But you will probably need to use at least some of the available options to configure the build to match your specific needs, be it a custom engine fork, a lightweight build stripped of extra modules, or an executable targetting engine development.
de: Aber Sie werden wahrscheinlich zumindest einige der verfügbaren Optionen verwenden müssen, um den Build an Ihre speziellen Bedürfnisse anzupassen, sei es ein benutzerdefinierter Engine-Fork, ein leichtgewichtiger Build ohne zusätzliche Module oder eine ausführbare Datei, die auf die Entwicklung der Engine abzielt.

source: The articles below should help you navigate configuration options available, as well as prerequisites required to compile Godot exactly the way you need.
de: Die folgenden Artikel sollen Ihnen helfen, sich mit den verfügbaren Konfigurationsoptionen und den Voraussetzungen vertraut zu machen, die erforderlich sind, um Godot genau so zu kompilieren, wie Sie es brauchen.

source: Basics of building Godot
de: Grundlagen für das Bauen von Godot

source: Let's start with basics, and learn how to get Godot's source code, and then which options to use to compile it regardless of your target platform.
de: Beginnen wir mit den Grundlagen und lernen wir, wie man an den Quellcode von Godot gelangt und welche Optionen man verwenden kann, um ihn unabhängig von der Target-Plattform zu kompilieren.

source: Building for target platforms
de: Bauen für Target-Plattformen

source: Below you can find instructions for compiling the engine for your specific target platform. Note that Godot supports cross-compilation, which means you can compile it for a target platform that doesn't match your current platform (say, target Linux while being on Windows). The guides will try their best to cover all possible situations.
de: Im Folgenden finden Sie eine Anleitung zum Kompilieren der Engine für Ihre spezielle Target-Plattform. Beachten Sie, dass Godot Cross-Kompilierung unterstützt, was bedeutet, dass Sie es für eine Target-Plattform kompilieren können, die nicht mit Ihrer aktuellen Plattform übereinstimmt (z.B. Linux als Target-Plattform, während Sie unter Windows arbeiten). Die Anleitungen werden ihr Bestes geben, um alle möglichen Situationen abzudecken.

source: Other compilation targets and options
de: Weitere Kompilierungs-Targets und -Optionen

source: Some additional universal compilation options require further setup. Namely, while Godot does have C#/.NET support as a part of its main codebase, it does not get compiled by default to reduce the executable size for users who don't need C# for their projects.
de: Einige zusätzliche universelle Kompilierungsoptionen erfordern eine weitere Einrichtung. Godot hat zwar C#/.NET-Unterstützung als Teil seiner Hauptcodebasis, wird aber nicht standardmäßig kompiliert, um die Größe der ausführbaren Datei für Benutzer zu reduzieren, die C# nicht für ihre Projekte benötigen.

source: Articles below explain how to configure the buildsystem for cases like this, and also cover some optimization techniques.
de: In den folgenden Artikeln wird erläutert, wie das Buildsystem für solche Fälle konfiguriert werden kann, und es werden auch einige Optimierungstechniken behandelt.

source: Translation status
de: Übersetzungsstatus
