Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/introduction_to_the_buildsystem.po
Languages: de, zh_tw

source: For instance, it's possible to provide both relative, absolute, and user directory paths containing such modules:
de: So ist es beispielsweise möglich, sowohl relative und absolute Pfade als auch Pfade zum Benutzerverzeichnis anzugeben, die solche Module enthalten:
zh_tw: 舉例來說，可以同時提供包含這種模組的相對路徑、絕對路徑、以及使用者資料夾路徑：

source: If there's any custom module with the exact directory name as a built-in module, the engine will only compile the custom one. This logic can be used to override built-in module implementations.
de: Wenn es ein benutzerdefiniertes Modul mit dem gleichen Verzeichnisnamen wie ein Built-in-Modul gibt, kompiliert die Engine nur das benutzerdefinierte Modul. Diese Logik kann verwendet werden, um Built-in-Modulimplementierungen außer Kraft zu setzen.
zh_tw: 若有自定模組的資料夾名稱與內建模組的名稱相同，則 Godot 只會編譯自定模組。可以利用這個功能來複寫掉內建的模組。

source: Cleaning generated files
de: Erzeugte Dateien bereinigen
zh_tw: 清理產生的檔案

source: Sometimes, you may encounter an error due to generated files being present. You can remove them by using ``scons --clean <options>``, where ``<options>`` is the list of build options you've used to build Godot previously.
de: Manchmal kann ein Fehler auftreten, weil noch generierte Dateien vorhanden sind. Sie können diese entfernen, indem Sie ``scons --clean <options>`` verwenden, wobei ``<options>`` die Liste der Build-Optionen ist, die Sie zuvor zum Bauen von Godot verwendet haben.
zh_tw: 有時候可能會因為已有產生出來的檔案而發聲錯誤。可以使用 ``scons --clean <選項>`` 來移除產生的檔案。``<選項>`` 是之前用來建置 Godot 的建置選項列表。

source: Alternatively, you can use ``git clean -fixd`` which will clean build artifacts for all platforms and configurations. Beware, as this will remove all untracked and ignored files in the repository. Don't run this command if you have uncommitted work!
de: Alternativ können Sie auch ``git clean -fixd`` verwenden, das die Build-Artefakte für alle Plattformen und Konfigurationen bereinigt. Seien Sie vorsichtig, da dies alle nicht getrackten und ignorierten Dateien im Repository entfernt. Führen Sie diesen Befehl nicht aus, wenn Sie Ihre Arbeit noch nicht committet haben!
zh_tw: 另外，也可以使用 ``git clean --fixd`` ，該指令會清除所有平台有設定的建置結果。請小心，因為這個指令同時也會移除儲存庫中所有尚未被 Git 追蹤的檔案以及 Git 忽略的檔案。若有還未 Commit 的更改，請不要執行這個指令！

source: Other build options
de: Weitere Build-Optionen
zh_tw: 其他建置選項

source: There are several other build options that you can use to configure the way Godot should be built (compiler, debug options, etc.) as well as the features to include/disable.
de: Es gibt verschiedene andere Build-Optionen, die Sie verwenden können, um die Art und Weise zu konfigurieren, wie Godot gebaut werden soll (Compiler, Debug-Optionen usw.) sowie die einzuschließenden/abzuschaltenden Features.
zh_tw: 還有其他一些可以用來設定如何建置 Godot 的建置選項 (調整編譯器、除錯選項…等)，還有一些可以調整要包含或禁用特定功能的選項。

source: Check the output of ``scons --help`` for details about each option for the version you are willing to compile.
de: Schauen Sie sich die Ausgabe von ``scons --help`` an, um für die Version, die Sie kompilieren wollen, Details über jede Option zu erfahren.
zh_tw: 請檢視 ``scons --help`` 的輸出，以瞭解各個選項在要編譯的版本上之詳細說明。

source: Overriding the build options
de: Überschreiben der Build-Optionen
zh_tw: 複寫建置選項

source: Using a file
de: Überschreiben per Datei
zh_tw: 使用檔案

source: The default ``custom.py`` file can be created at the root of the Godot Engine source to initialize any SCons build options passed via the command line:
de: Die Standarddatei ``custom.py`` kann im Stammverzeichnis des Godot-Engine-Quellcodes erstellt werden, um alle SCons-Build-Optionen zu initialisieren, die über die Kommandozeile übergeben werden:
zh_tw: 預設可以在 Godot Engine 的原始碼根目錄建立一個 ``custom.py`` 檔案來初始化任何通過命令行傳給 SCons 的建置選項：

source: You can also disable some of the builtin modules before compiling, saving some time it takes to build the engine. See :ref:`doc_optimizing_for_size` page for more details.
de: Sie können auch einige der Built-in-Module vor dem Kompilieren deaktivieren, um Zeit zu sparen, die für die Erstellung der Engine benötigt wird. Siehe die :ref:`doc_optimizing_for_size`-Seite für weitere Details.
zh_tw: 也可以在編譯前禁用一些內建模組，來節省建置引擎的時間。請參考 :ref:`doc_optimizing_for_size` 一頁以瞭解詳情。

source: You can use the online `Godot build options generator <https://godot-build-options-generator.github.io/>`__ to generate a ``custom.py`` file containing SCons options. You can then save this file and place it at the root of your Godot source directory.
de: Sie können den Online `Godot Build Options Generator <https://godot-build-options-generator.github.io/>`__ nutzen, um eine ``custom.py`` Datei zu erzeugen, welche die SCons-Optionen beinhaltet. Dann kann diese Datei im Stammverzeichnis von Godot gespeichert werden.
zh_tw: 可以通過 `Godot 建置選項產生器 <https://godot-build-options-generator.github.io/>`__ 線上工具來產生包含 SCons 選項的 ``custom.py`` 檔案。然後將該檔案保存並放置於 Godot 原始碼資料夾的根目錄。

source: Another custom file can be specified explicitly with the ``profile`` command line option, both overriding the default build configuration:
de: Eine weitere benutzerdefinierte Datei kann explizit mit der ``profile``-Kommandozeilenoption angegeben werden; beides überschreibt die Default-Build-Konfiguration:
zh_tw: 另外也可以通過 ``profile`` 命令行選項來明確指定要用哪個自定檔案。兩種方法都會複寫預設的建置組態：

source: Build options set from the file can be overridden by the command line options.
de: Buildoptionen, die aus der Datei festgelegt wurden, können durch die Kommandozeilenoptionen überschrieben werden.
zh_tw: 通過檔案設定的建置選項可以通過命令行選項來複寫。

source: It's also possible to override the options conditionally:
de: Es ist auch möglich, die Optionen bedingt zu überschreiben:
zh_tw: 也可以有條件地複寫選項：

source: Using the SCONSFLAGS
de: Verwenden per SCONSFLAGS
zh_tw: 使用 SCONSFLAGS

source: ``SCONSFLAGS`` is an environment variable which is used by the SCons to set the options automatically without having to supply them via the command line.
de: ``SCONSFLAGS`` ist eine Umgebungsvariable, die von SCons verwendet wird, um die Optionen automatisch zu setzen, ohne sie über die Kommandozeile eingeben zu müssen.
zh_tw: ``SCONSFLAGS`` 是 SCons 用來自動設定選項的環境變數，使用 ``SCONSFLAGS`` 就不需要通過命令行來給定選項。

source: For instance, you may want to force a number of CPU threads with the aforementioned ``-j`` option for all future builds:
de: Sie können zum Beispiel eine Anzahl von CPU-Threads mit der oben erwähnten Option ``-j`` für alle zukünftigen Builds erzwingen:
zh_tw: 舉例來說，我們可能會想使用剛才提到的 ``-j`` 選項來同時為所有功能進行建置：

source: SCU (single compilation unit) build
de: SCU (Single Compilation Unit) bauen
zh_tw: SCU（單一編譯單元）建構

source: Regular builds tend to be bottlenecked by including large numbers of headers in each compilation translation unit. Primarily to speed up development (rather than for production builds), Godot offers a "single compilation unit" build (aka "Unity / Jumbo" build).
de: Normale Builds neigen dazu, durch die Einbeziehung einer großen Anzahl von Headern in jede Compilation Translation Unit zu einem Bottleneck zu werden. In erster Linie, um die Entwicklung zu beschleunigen (und nicht für Produktions-Builds), bietet Godot einen "Single Compilation Unit"-Build (auch bekannt als "Unity/Jumbo"-Build) an.
zh_tw: 常規建置往往會因每個編譯翻譯單元中包含大量標頭而遇到瓶頸。主要是為了加快開發速度（而不是生產建置），Godot 提供了「單一編譯單元」建置（又稱「Unity / Jumbo」建置）。

source: For the folders accelerated by this option, multiple ``.cpp`` files are compiled in each translation unit, so headers can be shared between multiple files, which can dramatically decrease build times.
de: Für die Ordner, die durch diese Option beschleunigt werden, werden mehrere ``.cpp``-Dateien in jeder Translation-Unit kompiliert, so dass Header von mehreren Dateien gemeinsam genutzt werden können, was die Build-Zeit drastisch reduzieren kann.
zh_tw: 對於透過此選項加速的資料夾，每個翻譯單元中都會編譯多個“.cpp”檔案，因此可以在多個檔案之間共用標頭，這可以顯著減少建置時間。

source: To make a SCU build, use the ``scu_build=yes`` SCons option.
de: Um einen SCU-Build zu erstellen, verwenden Sie die SCons-Option ``scu_build=yes``.
zh_tw: 若要建置 SCU，請使用 ``scu_build=yes`` SCons 選項。

source: When developing a Pull Request using SCU builds, be sure to make a regular build prior to submitting the PR. This is because SCU builds by nature include headers from earlier ``.cpp`` files in the translation unit, therefore won't catch all the includes you will need in a regular build. The CI will catch these errors but it will usually be faster to catch them on a local build on your machine.
de: Wenn Sie einen Pull Request unter Verwendung von SCU-Builds entwickeln, stellen Sie sicher, dass Sie einen regulären Build erstellen, bevor Sie den PR einreichen. Das liegt daran, dass SCU-Builds von Natur aus Header von früheren ``.cpp``-Dateien in die Translation Unit einschließen und daher nicht alle Includes abfangen, die Sie in einem regulären Build benötigen. Die CI wird diese Fehler aufspüren, aber es ist in der Regel schneller, sie mit einem lokalen Build auf Ihrem Rechner zu finden.
zh_tw: 使用 SCU 建置開發 Pull 請求時，請務必在提交 PR 之前進行常規建置。這是因為 SCU 建置本質上包含翻譯單元中早期 ``.cpp`` 檔案的標頭，因此不會捕獲常規建置中所需的所有包含內容。 CI 會捕獲這些錯誤，但在電腦上的本機建置上捕獲它們通常會更快。

source: Export templates
de: Exportvorlagen
zh_tw: 匯出樣板

source: Official export templates are downloaded from the Godot Engine site: `godotengine.org <https://godotengine.org/>`__. However, you might want to build them yourself (in case you want newer ones, you are using custom modules, or simply don't trust your own shadow).
de: Offizielle Exportvorlagen können von der Godot-Engine-Website heruntergeladen werden: `godotengine.org <https://godotengine.org/>`__. Vielleicht möchten Sie sie jedoch selbst erstellen (falls Sie neuere Vorlagen benötigen, benutzerdefinierte Module verwenden oder einfach Ihrem eigenen Schatten nicht trauen).
zh_tw: 官方匯出樣板可以從 Godot Engine 網站進行下載: `godotengine.org <https://godotengine.org/>`__ 。但你也可以自行進行建置 (例如當需要新版本、使用自定模組、或是不信任其他人建置的版本時)。

source: If you download the official export templates package and unzip it, you will notice that most files are optimized binaries or packages for each platform:
de: Wenn Sie das offizielle Exportvorlagenpaket herunterladen und entpacken, werden Sie feststellen, dass die meisten Dateien optimierte Binärdateien oder Pakete für jede Plattform sind:
zh_tw: 若下載官方匯出模板套件並解壓縮後，可以注意到大多數檔案都是為各個平台最佳化過的二進位檔或套件：

source: To create those yourself, follow the instructions detailed for each platform in this same tutorial section. Each platform explains how to create its own template.
de: Um diese selbst zu erstellen, folgen Sie den Anweisungen, die für jede Plattform in diesem Abschnitt des Tutorials aufgeführt sind. Jede Plattform erklärt, wie man ihre eigene Vorlage erstellt.
zh_tw: 若要自己進行建置，請依照個別平台教學中的詳細說明來進行。各個平台的說明文件中都解釋了如何建置樣板。

source: The ``version.txt`` file should contain the corresponding Godot version identifier. This file is used to install export templates in a version-specific directory to avoid conflicts. For instance, if you are building export templates for Godot 3.1.1, ``version.txt`` should contain ``3.1.1.stable`` on the first line (and nothing else). This version identifier is based on the ``major``, ``minor``, ``patch`` (if present) and ``status`` lines of the `version.py file in the Godot Git repository <https://github.com/godotengine/godot/blob/master/version.py>`__.
de: Die Datei ``version.txt`` sollte den entsprechenden Godot-Versionsbezeichner enthalten. Diese Datei wird verwendet, um Exportvorlagen in einem versionsspezifischen Verzeichnis zu installieren, um Konflikte zu vermeiden. Wenn Sie beispielsweise Exportvorlagen für Godot 3.1.1 erstellen, sollte ``version.txt`` in der ersten Zeile ``3.1.1.stable`` enthalten (und nichts anderes). Diese Versionskennung basiert auf den Zeilen ``major``, ``minor``, ``patch`` (falls vorhanden) und ``status`` der Datei `version.py im Godot-Git-Repository <https://github.com/godotengine/godot/blob/master/version.py>`__.
zh_tw: ``version.txt`` 檔案中應該要包含有對應的 Godot 版本識別項。這個檔案是用來將匯出樣板安裝到版本特定的資料夾中，以避免衝突。舉例來說，如果為 Godot 3.1.1 建置匯出樣板，則 ``version.txt`` 的第一行應包含 ``3.1.1.stable`` (且不得含有其他內容)。這個版本識別項是基於 ``主板號 Major`` 、 ``次版號 Minor`` 、 ``修訂號 Patch`` (若有的話)、以及 `Godot Git 儲存庫中的 version.py 檔案 <https://github.com/godotengine/godot/blob/master/version.py>`__ ``狀態 Status`` 。

source: If you are developing for multiple platforms, macOS is definitely the most convenient host platform for cross-compilation, since you can cross-compile for every target. Linux and Windows come in second place, but Linux has the advantage of being the easier platform to set this up.
de: Wenn Sie für mehrere Plattformen entwickeln, ist macOS definitiv die bequemste Host-Plattform für die Cross-Kompilierung, da Sie für jedes Target crosskompilieren können. Linux und Windows kommen an zweiter Stelle, aber Linux hat den Vorteil, dass es die einfachere Plattform ist, um dies einzurichten.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: :ref:`doc_compiling_for_ios`
zh_tw: :ref:`doc_optimizing_for_size`

source: :ref:`doc_compiling_for_linuxbsd`
zh_tw: :ref:`doc_complying_with_licenses`

source: :ref:`doc_compiling_for_macos`
zh_tw: :ref:`doc_optimizing_for_size`

source: :ref:`doc_compiling_for_web`
zh_tw: :ref:`doc_optimizing_for_size`

source: :ref:`doc_compiling_for_windows`
zh_tw: :ref:`doc_optimizing_for_size`

source: Target
zh_tw: 目標

source: Dev build
zh_tw: 開發建構

source: :ref:`doc_custom_modules_in_cpp`
zh_tw: :ref:`doc_custom_modules_in_c++`
