Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/introduction_to_the_buildsystem.po
Languages: de, zh_tw

source: Introduction to the buildsystem
de: Einführung in das Buildsystem
zh_tw: 建置系統簡介

source: Godot is a primarily C++ project and it :ref:`uses the SCons build system. <doc_faq_why_scons>` We love SCons for how maintainable and easy to set up it makes our buildsystem. And thanks to that compiling Godot from source can be as simple as running::
de: Godot ist in erster Linie ein C++-Projekt und :ref:`verwendet das SCons-Buildsystem. <doc_faq_why_scons>` Wir lieben SCons, weil es unser Buildsystem so wartbar und einfach einzurichten macht. Und dank dieser Tatsache kann das Kompilieren von Godot aus dem Quellcode so einfach sein wie das Ausführen von::

source: This produces an *export template* for your current platform, operating system, and architecture. An export template is a build of the engine that is used for running exported projects. To build the *editor* instead you can run the following command::
de: Dadurch wird eine *Exportvorlage* für Ihre aktuelle Plattform, Ihr Betriebssystem und Ihre Architektur erstellt. Eine Exportvorlage ist ein Build der Engine, der für die Ausführung exportierter Projekte verwendet wird. Um stattdessen den *Editor* zu bauen, können Sie den folgenden Befehl ausführen::

source: If you plan to debug or develop the engine, then you might want to add another option to the command::
de: Wenn Sie vorhaben, die Engine zu debuggen oder sie weiterzuentwickeln, sollten Sie dem Befehl eine weitere Option hinzufügen::

source: Following sections in the article will explain these and other universal options in more detail. But before you can compile Godot, you need to install a few prerequisites. Please refer to the platform documentation to learn more:
de: In den folgenden Abschnitten dieses Artikels werden diese und andere universelle Optionen ausführlicher erläutert. Bevor Sie Godot kompilieren können, müssen Sie jedoch einige Voraussetzungen installieren. Weitere Informationen dazu finden Sie in der Dokumentation der Plattform:

source: These articles cover in great detail both how to setup your environment to compile Godot on a specific platform, and how to compile for that platform. Please feel free to go back and forth between them and this article to reference platform-specific and universal configuration options.
de: Diese Artikel beschreiben sehr detailliert, wie Sie Ihre Umgebung für das Kompilieren von Godot auf einer bestimmten Plattform einrichten, und wie Sie für diese Plattform kompilieren. Sie können gerne zwischen den Artikeln und diesem Artikel hin- und herspringen, um plattformspezifische und universelle Konfigurationsoptionen zu finden.

source: Using multi-threading
de: Multithreading verwenden

source: The build process may take a while, depending on how powerful your system is. By default, Godot's SCons setup is configured to use all CPU threads but one (to keep the system responsive during compilation). If you want to adjust how many CPU threads SCons will use, use the ``-j <threads>`` parameter to specify how many threads will be used for the build.
de: Der Erstellungsprozess kann eine Weile dauern, je nachdem, wie leistungsfähig Ihr System ist. Standardmäßig ist das SCons-Setup von Godot so konfiguriert, dass alle CPU-Threads bis auf einen verwendet werden (um das System während der Kompilierung reaktionsfähig zu halten). Wenn Sie einstellen wollen, wie viele CPU-Threads SCons verwenden soll, verwenden Sie den Parameter ``-j <Threads>``, um anzugeben, wie viele Threads für den Build verwendet werden sollen.

source: Example for using 4 threads::
de: Beispiel für die Verwendung von 4 Threads::

source: Platform selection
de: Plattformauswahl
zh_tw: 選擇平台

source: Godot's build system will begin by detecting the platforms it can build for. If not detected, the platform will simply not appear on the list of available platforms. The build requirements for each platform are described in the rest of this tutorial section.
de: Das Buildsystem von Godot erkennt zunächst die Plattformen, für die es bauen kann. Wenn die Plattform nicht erkannt wird, erscheint sie einfach nicht in der Liste der verfügbaren Plattformen. Die Build-Anforderungen für jede Plattform werden im weiteren Verlauf dieses Tutorials beschrieben.
zh_tw: Godot 的建置系統會通過偵測能建置的平台來開始。如果為偵測到，則該平台不會顯示在可用平台的列表中。建置對各個平台的需求寫在本教學接下來的段落中。

source: SCons is invoked by just calling ``scons``. If no platform is specified, SCons will detect the target platform automatically based on the host platform. It will then start building for the target platform right away.
de: SCons wird einfach durch den Aufruf von ``scons`` aufgerufen. Wenn keine Plattform angegeben wird, erkennt SCons die Target-Plattform automatisch anhand der Host-Plattform. Es wird dann sofort mit der Erstellung für die Target-Plattform beginnen.
zh_tw: 只需要呼叫 ``scons`` 就可以開啟 SCons。若未指定平台，SCons 會自動依據宿主機的平台來偵測目標平台。接著，SCons 會直接開始為目標平台進行建置。

source: To list the available target platforms, use ``scons platform=list``::
de: Um die verfügbaren Target-Plattformen aufzulisten, verwenden Sie ``scons platform=list``::
zh_tw: 若要列出所有可用的目標平台，請使用 ``scons platform=list`` ：

source: To build for a platform (for example, ``linuxbsd``), run with the ``platform=`` (or ``p=`` to make it short) argument:
de: Um für eine Plattform zu bauen (zum Beispiel ``linuxbsd``), verwenden Sie das Argument ``platform=`` (oder kurz ``p=``):
zh_tw: 若要為某個平台建置 (如 x11)，請使用 ``platform=`` (或簡寫為 ``p=`` ) 印數來執行：

source: Resulting binary
de: Erzeugte Binärdatei
zh_tw: 產生的二進位檔

source: The resulting binaries will be placed in the ``bin/`` subdirectory, generally with this naming convention::
de: Die erzeugten Binärdateien werden in das Unterverzeichnis ``bin/`` gelegt, im Allgemeinen mit folgender Namenskonvention::
zh_tw: 產生的二進位檔會放在 ``bin/`` 子資料夾中。通常來說會依照下列命名慣例：

source: For the previous build attempt, the result would look like this::
de: Für den obigen Build-Versuch würde das Ergebnis folgendermaßen aussehen::
zh_tw: 依照前面這個建置例子，產生的結果會長這樣：

source: This means that the binary is for Linux *or* \*BSD (*not* both), is not optimized, has the whole editor compiled in, and is meant for 64 bits.
de: Das bedeutet, dass die Binärdatei für Linux *oder* \*BSD (*nicht* beide) ist, nicht optimiert ist, den gesamten Editor einkompiliert hat und für 64 Bit gedacht ist.
zh_tw: 這表示，這個二進位檔是給 X11 用的，並未經過最佳化，有編譯進工具 (整個編輯器)，且是用於 64 位元的。

source: A Windows binary with the same configuration will look like this:
de: Eine Windows-Binärdatei mit derselben Konfiguration sieht folgendermaßen aus:
zh_tw: 使用相同設定的 Window 二進位執行檔會長這樣：

source: Copy that binary to any location you like, as it contains the Project Manager, editor and all means to execute the game. However, it lacks the data to export it to the different platforms. For that the export templates are needed (which can be either downloaded from `godotengine.org <https://godotengine.org/>`__, or you can build them yourself).
de: Kopieren Sie diese Binärdatei an einen beliebigen Ort, da sie den Projektmanager, den Editor und alle Elemente zur Ausführung des Spiels enthält. Es fehlen jedoch die Daten, um es auf die verschiedenen Plattformen zu exportieren. Dafür werden die Exportvorlagen benötigt (die entweder von `godotengine.org <https://godotengine.org/>`__ heruntergeladen werden können, oder die Sie sie selbst erstellen können).
zh_tw: 由於該二進位執行檔包含了專案管理員、編輯器與所有用於執行遊戲的東西，可以將該執行檔複製到任何地方。但是，這個二進位執行檔缺少了可以匯出至其他平台的資料。要匯出至其他平台，則需要匯出樣板 (匯出樣板可以從 `godotengine.org <https://godotengine.org/>`__ 下載，或是可自行建置)。

source: Aside from that, there are a few standard options that can be set in all build targets, and which will be explained below.
de: Abgesehen davon gibt es einige Standardoptionen, die in allen Build-Targets gesetzt werden können und die im Folgenden erläutert werden.
zh_tw: 除此之外，還有其他能用於所有建置目標的標準選項，下方將進行說明。

source: Target controls if the editor is contained and debug flags are used. All builds are optimized. Each mode means:
de: Target steuert, ob der Editor enthalten ist und Debug-Flags verwendet werden. Alle Builds sind optimiert. Die verschiedenen Modi:
zh_tw: 建置目標是用來控制最佳化旗標與偵錯旗標的。各個模式分別代表：

source: ``target=editor``: Build with editor, optimized, with debugging code (defines: ``TOOLS_ENABLED``, ``DEBUG_ENABLED``, ``-O2``/``/O2``)
de: ``target=editor``: Bauen mit Editor, optimiert, mit Debug-Code (Defines: ``TOOLS_ENABLED``, ``DEBUG_ENABLED``, ``-O2``/``/O2``)

source: ``target=template_debug``: Build with C++ debugging symbols (defines: ``DEBUG_ENABLED``, ``-O2``/``/O2``)
de: ``target=template_debug``: Build mit C++ Debug-Symbolen (Defines: ``DEBUG_ENABLED``, ``-O2``/``/O2``)

source: ``target=template_release``: Build without symbols (defines: ``-O3``/``/O2``)
de: ``target=template_release``: Build ohne Symbole (Defines: ``-O3``/``/O2``)

source: The editor is enabled by default in all PC targets (Linux, Windows, macOS), disabled for everything else. Disabling the editor produces a binary that can run projects but does not include the editor or the Project Manager.
de: Der Editor ist bei allen PC-Targets (Linux, Windows, macOS) standardmäßig aktiviert, bei allen anderen deaktiviert. Die Deaktivierung des Editors erzeugt eine Binärdatei, die Projekte ausführen kann, aber weder den Editor noch den Projektmanager enthält.
zh_tw: 工具預設會在所有 PC 目標上啟用 (Linux, Window, macOS)，其他平台則預設關閉。如果將工具禁用，產生的二進位檔則只能執行專案，而不會包含編輯器與專案管理員。

source: Development and production aliases
de: Aliasnamen für Entwicklung und Produktion
zh_tw: 開發

source: When creating builds for development (running debugging/:ref:`profiling <doc_using_cpp_profilers>` tools), you often have different goals compared to production builds (making binaries as fast and small as possible).
de: Bei der Erstellung von Builds für die Entwicklung (mit Debugging/:ref:`Profiling <doc_using_cpp_profilers>`-Tools) verfolgt man oft andere Ziele als bei Produktions-Builds (Erzeugen von möglichst schnellen und kleinen Binärdateien).
zh_tw: 建立開發建置（執行偵錯/:ref:`分析 <doc_using_cpp_profilers>` 工具）時，與生產建置相比，您通常有不同的目標（使二進位檔案盡可能快且小）。

source: Godot provides two aliases for this purpose:
de: Godot bietet zwei Aliasnamen für diesen Zweck:
zh_tw: Godot 提供了一系列常見的容器：

source: ``dev_mode=yes`` is an alias for ``verbose=yes warnings=extra werror=yes tests=yes``. This enables warnings-as-errors behavior (similar to Godot's continuous integration setup) and also builds :ref:`unit tests <doc_unit_testing>` so you can run them locally.
de: ``dev_mode=yes`` ist ein Alias für ``verbose=yes warnings=extra werror=yes tests=yes``. Dies aktiviert warnings-as-errors-Verhalten (ähnlich wie Godots Continuous Integration-Setup) und baut auch :ref:`Unit-Tests <doc_unit_testing>`, so dass Sie sie lokal ausführen können.
zh_tw: ``dev_mode=yes`` 是``verbose=yes warnings=extra werror=yes tests=yes`` 的別名。這將啟用警告即錯誤行為（類似於 Godot 的持續整合設定），並且還建置:ref:`單元測試 <doc_unit_testing>`，以便您可以在本地運作它們。

source: ``production=yes`` is an alias for ``use_static_cpp=yes debug_symbols=no lto=auto``. Statically linking libstdc++ allows for better binary portability when compiling for Linux. This alias also enables link-time optimization when compiling for Linux, Web and Windows with MinGW, but keeps LTO disabled when compiling for macOS, iOS or Windows with MSVC. This is because LTO on those platforms is very slow to link or has issues with the generated code.
de: ``production=yes`` ist ein Alias für ``use_static_cpp=yes debug_symbols=no lto=auto``. Das statische Linken von libstdc++ ermöglicht eine bessere Binärportabilität beim Kompilieren für Linux. Dieser Alias aktiviert auch die Link-Time-Optimierung beim Kompilieren für Linux, Web und Windows mit MinGW, aber LTO bleibt deaktiviert, wenn für macOS, iOS oder Windows mit MSVC kompiliert wird. Der Grund dafür ist, dass LTO auf diesen Plattformen sehr langsam linkt oder Probleme mit dem generierten Code hat.
zh_tw: ``product=yes`` 是``use_static_cpp=yes debug_symbols=no lto=auto`` 的別名。靜態連結 libstdc++ 可以在針對 Linux 進行編譯時實作更好的二進位可攜性。當使用 MinGW 編譯 Linux、Web 和 Windows 時，此別名還可以啟用連結時最佳化，但在使用 MSVC 編譯 macOS、iOS 或 Windows 時保持停用 LTO。這是因為這些平台上的 LTO 連結速度非常慢或產生的程式碼有問題。

source: You can manually override options from those aliases by specifying them on the same command line with different values. For example, you can use ``scons production=yes debug_symbols=yes`` to create production-optimized binaries with debugging symbols included.
de: Sie können die Optionen dieser Aliase manuell außer Kraft setzen, indem Sie sie in derselben Kommandozeile mit anderen Werten angeben. Zum Beispiel können Sie ``scons production=yes debug_symbols=yes`` verwenden, um produktionsoptimierte Binärdateien mit Debug-Symbolen zu erzeugen.
zh_tw: 您可以透過在同一命令列上使用不同的值指定這些別名來手動覆寫這些選項。例如，您可以使用 scons production=yes debug_symbols=yes 建立包含偵錯符號的生產最佳化二進位檔案。

source: ``dev_build`` should **not** be confused with ``dev_mode``, which is an alias for several development-related options (see above).
de: ``dev_build`` sollte **nicht** mit ``dev_mode`` verwechselt werden, welches ein Alias für mehrere entwicklungsbezogene Optionen ist (siehe oben).
zh_tw: ``dev_build`` 不應與 ``dev_mode`` 混淆，後者是幾個與開發相關的選項的別名（見上文）。

source: When doing engine development the ``dev_build`` option can be used together with ``target`` to enable dev-specific code. ``dev_build`` defines ``DEV_ENABLED``, disables optimization (``-O0``/``/0d``), enables generating debug symbols, and does not define ``NDEBUG`` (so ``assert()`` works in thirdparty libraries).
de: Bei der Engine-Entwicklung kann die Option ``dev_build`` zusammen mit ``target`` verwendet werden, um entwicklungsspezifischen Code zu aktivieren. ``dev_build`` definiert ``DEV_ENABLED``, deaktiviert die Optimierung (``-O0``/``/0d``), aktiviert die Erzeugung von Debug-Symbolen und definiert ``NDEBUG`` nicht (so dass ``assert()`` in Bibliotheken von Drittanbietern funktioniert).
zh_tw: 在進行引擎開發時，「dev_build」選項可以與「target」一起使用來啟用特定於開發的程式碼。 ``dev_build`` 定義``DEV_ENABLED``，停用最佳化（``-O0``/``/0d``），啟用產生偵錯符號，且不定義``NDEBUG``（因此``assert( ) `` 適用於第三方函式庫）。

source: This flag appends the ``.dev`` suffix (for development) to the generated binary name.
de: Dieses Flag fügt das Suffix ``.dev`` (für englisch "development") an den erzeugten Binärnamen an.
zh_tw: 此旗標將“.dev”後綴（用於開發）附加到產生的二進位名稱。

source: There are additional SCons options to enable *sanitizers*, which are tools you can enable at compile-time to better debug certain engine issues. See :ref:`doc_using_sanitizers` for more information.
de: Es gibt zusätzliche SCons-Optionen, um *Sanitizer* zu aktivieren, das sind Tools, die Sie zur Kompilierungszeit aktivieren können, um bestimmte Engine-Probleme besser zu debuggen. Siehe :ref:`doc_using_sanitizers` für weitere Informationen.
zh_tw: 還有其他 SCons 選項可以啟用 *sanitizers*，這些工具可以在編譯時啟用，以更好地偵錯某些引擎問題。請參閱 doc_using_sanitizers 以了解更多資訊。

source: Debugging symbols
de: Debug-Symbole
zh_tw: 偵錯

source: By default, ``debug_symbols=no`` is used, which means **no** debugging symbols are included in compiled binaries. Use ``debug_symbols=yes`` to include debug symbols within compiled binaries, which allows debuggers and profilers to work correctly. Debugging symbols are also required for Godot's crash stacktraces to display with references to source code files and lines.
de: Standardmäßig wird ``debug_symbols=no`` verwendet, was bedeutet, dass **keine** Debug-Symbole in kompilierten Binärdateien enthalten sind. Verwenden Sie ``debug_symbols=yes``, um Debugsymbole in kompilierte Binärdateien einzubinden, was Debuggern und Profilern erlaubt, korrekt zu arbeiten. Debug-Symbole sind auch erforderlich, damit Godots Crash-Stacktraces mit Verweisen auf Quellcode-Dateien und -Zeilen angezeigt werden.
zh_tw: 預設情況下，使用“debug_symbols=no”，這表示編譯的二進位檔案中不包含偵錯符號。使用“debug_symbols=yes”在編譯的二進位檔案中包含偵錯符號，這允許偵錯器和分析器正常工作。 Godot 的當機堆疊追蹤還需要偵錯符號來顯示對原始程式碼檔案和行的參考。

source: The downside is that debugging symbols are large files (significantly larger than the binaries themselves). As a result, official binaries currently do not include debugging symbols. This means you need to compile Godot yourself to have access to debugging symbols.
de: Der Nachteil ist, dass Debug-Symbole große Dateien sind (wesentlich größer als die Binärdateien selbst). Aus diesem Grund enthalten die offiziellen Binärdateien derzeit keine Debug-Symbole. Das bedeutet, dass Sie Godot selbst kompilieren müssen, um Zugang zu Debug-Symbolen zu haben.
zh_tw: 缺點是除錯符號是大檔案（比二進位檔案本身大得多）。因此，官方二進位檔案目前不包含偵錯符號。這意味著您需要自己編譯 Godot 才能存取偵錯符號。

source: When using ``debug_symbols=yes``, you can also use ``separate_debug_symbols=yes`` to put debug information in a separate file with a ``.debug`` suffix. This allows distributing both files independently. Note that on Windows, when compiling with MSVC, debugging information is *always* written to a separate ``.pdb`` file regardless of ``separate_debug_symbols``.
de: Wenn Sie ``debug_symbols=yes`` verwenden, können Sie auch ``separate_debug_symbols=yes`` verwenden, um Debug-Informationen in einer separaten Datei mit der Endung ``.debug`` abzulegen. Dies erlaubt es, beide Dateien unabhängig voneinander zu veröffentlichen. Beachten Sie, dass unter Windows, wenn Sie mit MSVC kompilieren, die Debugging-Informationen *immer* in eine separate ``.pdb``-Datei geschrieben werden, unabhängig von ``separate_debug_symbols``.
zh_tw: 當使用“debug_symbols=yes”時，您也可以使用“separate_debug_symbols=yes”將偵錯資訊放在帶有“.debug”後綴的單獨檔案中。這允許獨立分發兩個檔案。請注意，在 Windows 上，當使用 MSVC 進行編譯時，偵錯資訊*總是*寫入到單獨的 .pdb 檔案中，無論 ``separate_debug_symbols ``如何。

source: Use the ``strip <path/to/binary>`` command to remove debugging symbols from a binary you've already compiled.
de: Verwenden Sie den Befehl ``strip <path/to/binary>``, um Debug-Symbole aus einer bereits kompilierten Binärdatei zu entfernen.
zh_tw: 使用“strip <path/to/binary>”命令從已編譯的二進位檔案中刪除偵錯符號。

source: Optimization level
de: Optimierungsstufen
zh_tw: 最佳化

source: Several compiler optimization levels can be chosen from:
de: Es können verschiedene Optimierungsstufen des Compilers ausgewählt werden:
zh_tw: 可以選擇以下幾種編譯器最佳化等級：

source: ``optimize=speed_trace`` *(default when targeting non-Web platforms)*: Favors execution speed at the cost of larger binary size. Optimizations may sometimes negatively impact debugger usage (stack traces may be less accurate. If this occurs to you, use ``optimize=debug`` instead.
de: ``optimize=speed_trace`` *(Standardeinstellung, wenn Nicht-Web-Plattformen verwendet werden)*: Begünstigt die Ausführungsgeschwindigkeit auf Kosten einer größeren Binärgröße. Optimierungen können sich manchmal negativ auf die Nutzung des Debuggers auswirken (Stack Traces können weniger genau sein. Wenn dies bei Ihnen auftritt, verwenden Sie stattdessen ``optimize=debug``.
zh_tw: ``optimize=speed_trace`` *（針對非 Web 平台時的預設設定）*：以較大的二進位大小為代價提高執行速度。最佳化有時可能會對偵錯器的使用產生負面影響（堆疊追蹤可能不太準確。如果您遇到這種情況，請改用「optimize=debug」。

source: ``optimize=speed``: Favors even more execution speed, at the cost of even larger binary size compared to ``optimize=speed_trace``. Even less friendly to debugging compared to ``optimize=debug``, as this uses the most aggressive optimizations available.
de: ``optimize=speed``: Bevorzugt noch mehr Ausführungsgeschwindigkeit, auf Kosten einer noch größeren Binärgröße im Vergleich zu ``optimize=speed_trace``. Im Vergleich zu ``optimize=debug`` ist diese Option noch weniger debug-freundlich, da sie die aggressivsten verfügbaren Optimierungen verwendet.
zh_tw: 「optimize=speed」：與「optimize=speed_trace」相比，有利於更高的執行速度，但代價是二進位大小更大。與“optimize=debug”相比，除錯更加不友好，因為它使用了最積極的優化。

source: ``optimize=size`` *(default when targeting the Web platform)*: Favors small binaries at the cost of slower execution speed.
de: ``optimize=size`` *(Default, wenn das Target die Web-Plattform ist)*: Bevorzugt kleine Binärdateien auf Kosten einer langsameren Ausführungsgeschwindigkeit.
zh_tw: ``optimize=size`` *（針對 Web 平台時的預設值）*：支援小型二進位檔案，但代價是執行速度較慢。

source: ``optimize=debug``: Only enables optimizations that do not impact debugging in any way. This results in faster binaries than ``optimize=none``, but slower binaries than ``optimize=speed_trace``.
de: ``optimize=debug``: Aktiviert nur Optimierungen, die das Debugging in keiner Weise beeinflussen. Dies führt zu schnelleren Binärdateien als ``optimize=none``, aber zu langsameren Binärdateien als ``optimize=speed_trace``.
zh_tw: ``optimize=debug``：僅啟用不會以任何方式影響偵錯的最佳化。這會導致二進位檔案比“optimize=none”更快，但比“optimize=speed_trace”慢。

source: ``optimize=none``: Do not perform any optimization. This provides the fastest build times, but the slowest execution times.
de: ``optimize=none``: Keine Optimierung durchführen. Dies bietet die schnellsten Build-Zeiten, aber die langsamsten Ausführungszeiten.
zh_tw: ``optimize=none``：不執行任何最佳化。這提供了最快的建置時間，但執行時間最慢。

source: ``optimize=custom`` *(advanced users only)*: Do not pass optimization arguments to the C/C++ compilers. You will have to pass arguments manually using the ``CFLAGS``, ``CCFLAGS`` and ``CXXFLAGS`` SCons options.
de: ``optimize=custom`` *(nur für fortgeschrittene Benutzer)*: Übergibt keine Optimierungsargumente an die C/C++ Compiler. Sie müssen die Argumente manuell mit den SCons-Optionen ``CFLAGS``, ``CCFLAGS`` und ``CXXFLAGS`` übergeben.
zh_tw: ``optimize=custom`` *（僅限進階使用者）*：不要將最佳化參數傳遞給 C/C++ 編譯器。您必須使用“CFLAGS”、“CCFLAGS”和“CXXFLAGS” SCons 選項手動傳遞參數。

source: Architecture
de: Architektur
zh_tw: 架構

source: The ``arch`` option is meant to control the CPU or OS version intended to run the binaries. It is focused mostly on desktop platforms and ignored everywhere else.
de: Die Option ``arch`` ist dazu gedacht, die CPU- oder Betriebssystemversion zu bestimmen, auf der die Binärdateien laufen sollen. Sie ist hauptsächlich auf Desktop-Plattformen ausgerichtet und wird überall sonst ignoriert.
zh_tw: 位元是用來控制要執行二進位檔的 CPU 或作業系統版本。主要是用於桌面環境，而其他平台通常會忽略此一旗標。

source: Supported values for the ``arch`` option are **auto**, **x86_32**, **x86_64**, **arm32**, **arm64**, **rv64**, **ppc32**, **ppc64** and **wasm32**.
de: Unterstützte Werte für die Option ``arch`` sind **auto**, **x86_32**, **x86_64**, **arm32**, **arm64**, **rv64**, **ppc32**, **ppc64** und **wasm32**.
zh_tw: 「arch」 選項支援的值為 **auto**、**x86_32**、**x86_64**、**arm32**、**arm64**、**rv64**、**ppc32 **、 **ppc64** 和**wasm32**。

source: This flag appends the value of ``arch`` to resulting binaries when relevant. The default value ``arch=auto`` detects the architecture that matches the host platform.
de: Dieses Flag fügt den Wert von ``arch`` an die resultierenden Binärdateien an, wenn dies relevant ist. Der Standardwert ``arch=auto`` erkennt die Architektur, die der Host-Plattform entspricht.
zh_tw: 該旗標會加在最終產生的二進位檔檔名後方加上對應的 ``.32`` 或 ``.64`` 後置詞。若使用 ``bits=default`` ，則會使用偵測到的架構。

source: Custom modules
de: Benutzerdefinierte Module
zh_tw: 自定義模組

source: It's possible to compile modules residing outside of Godot's directory tree, along with the built-in modules.
de: Es ist möglich, neben den Built-in-Modulen auch Module zu kompilieren, die sich außerhalb des Godot-Verzeichnisbaums befinden.
zh_tw: 除了內建模組之外，還可以編譯在 Godot 資料夾外部的模組。

source: A ``custom_modules`` build option can be passed to the command line before compiling. The option represents a comma-separated list of directory paths containing a collection of independent C++ modules that can be seen as C++ packages, just like the built-in ``modules/`` directory.
de: Eine ``custom_modules`` Build-Option kann vor dem Kompilieren an die Kommandozeile übergeben werden. Die Option stellt eine durch Kommas getrennte Liste von Verzeichnispfaden dar, die eine Sammlung unabhängiger C++-Module enthalten, die als C++-Pakete angesehen werden können, genau wie das Built-in-Verzeichnis ``modules/``.
zh_tw: 可以在編譯前將 ``custom_modules`` 建置選項傳給命令行。該選項為以半形逗號分隔的列表，內含資料夾路徑。各個資料夾則需放置與內建 ``modules/`` 資料夾內一樣，可被視為 C++ 套件的獨立的 C++ 模組。
