Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/optimizing_for_size.po
Languages: de

source: Optimizing a build for size
de: Einen Build auf Größe optimieren

source: Rationale
de: Hintergrund

source: Sometimes, it is desired to optimize a build for size rather than speed. This means not compiling unused functions from the engine, as well as using specific compiler flags to aid on decreasing build size. Common situations include creating builds for mobile and Web platforms.
de: Manchmal ist es wünschenswert, einen Build eher auf Größe als auf Geschwindigkeit zu optimieren. Dies bedeutet, dass ungenutzte Funktionen der Engine nicht kompiliert werden und dass bestimmte Compiler-Flags verwendet werden, um die Größe des Builds zu verringern. Häufige Situationen sind die Erstellung von Builds für Mobile und Web-Plattformen.

source: This tutorial aims to give an overview on different methods to create a smaller binary. Before continuing, it is recommended to read the previous tutorials on compiling Godot for each platform.
de: Dieses Tutorial soll einen Überblick über die verschiedenen Methoden zur Erstellung einer kleineren Binärdatei geben. Bevor Sie fortfahren, sollten Sie die vorherigen Tutorials zur Kompilierung von Godot für jede Plattform lesen.

source: The options below are listed from the most important (greatest size savings) to the least important (lowest size savings).
de: Die nachstehenden Optionen sind in der Reihenfolge ihrer Wichtigkeit (größte Einsparungen) und ihrer Unwichtigkeit (geringste Einsparungen) aufgeführt.

source: Stripping binaries
de: Binärdateien bereinigen

source: **Space savings:** Very high
de: **Platzersparnis:** Sehr hoch

source: **Difficulty:** Easy
de: **Schwierigkeit:** Einfach

source: **Performed in official builds:** Yes
de: **Durchgeführt in offiziellen Builds:** Ja

source: If you build Windows (MinGW), Linux or macOS binaries from source, remember to strip debug symbols from binaries by installing the ``strip`` package from your distribution then running:
de: Wenn Sie Windows- (MinGW), Linux- oder macOS-Binärdateien aus dem Quellcode erstellen, denken Sie daran, Debug-Symbole aus den Binärdateien zu entfernen, indem Sie das Paket ``strip`` aus Ihrer Distribution installieren und dann ausführen:

source: On Windows, ``strip.exe`` is included in most MinGW toolchain setups.
de: Unter Windows ist ``strip.exe`` in den meisten MinGW Toolchain-Setups enthalten.

source: This will reduce the size of compiled binaries by a factor between 5× and 10×. The downside is that crash backtraces will no longer provide accurate information (which is useful for troubleshooting the cause of a crash). :ref:`C++ profilers <doc_using_cpp_profilers>` will also no longer be able to display function names (this does not affect the built-in GDScript profiler).
de: Dadurch wird die Größe der kompilierten Binärdateien um einen Faktor zwischen 5x und 10x reduziert. Der Nachteil ist, dass Crash-Backtraces keine genauen Informationen mehr liefern (was für die Fehlersuche bei der Ursache eines Absturzes nützlich ist). :ref:`C++-Profiler <doc_using_cpp_profilers>` werden auch nicht mehr in der Lage sein, Funktionsnamen anzuzeigen (dies betrifft nicht den Built-in-GDScript-Profiler).

source: The above command will not work on Windows binaries compiled with MSVC and platforms such as Android and Web. Instead, pass ``debug_symbols=no`` on the SCons command line when compiling.
de: Der obige Befehl funktioniert nicht bei Windows-Binärdateien, die mit MSVC kompiliert wurden, und bei Plattformen wie Android und Web. Übergeben Sie stattdessen ``debug_symbols=no`` in der SCons-Kommandozeile beim Kompilieren.

source: Compiling with link-time optimization
de: Kompilieren mit Link-Time Optimierung

source: **Space savings:** High
de: **Platzersparnis:** Hoch

source: Enabling link-time optimization produces more efficient binaries, both in terms of performance and file size. It works by eliminating duplicate template functions and unused code. It can currently be used with the GCC and MSVC compilers:
de: Die Aktivierung der Link-Time-Optimierung führt zu effizienteren Binärdateien, sowohl in Bezug auf die Performance als auch auf die Dateigröße. Sie funktioniert, indem sie doppelte Vorlagenfunktionen und ungenutzten Code eliminiert. Sie kann derzeit mit den Compilern GCC und MSVC verwendet werden:

source: Linking becomes much slower and more RAM-consuming with this option, so it should be used only for release builds:
de: Das Linken wird mit dieser Option viel langsamer und benötigt mehr RAM, daher sollte sie nur für Release-Builds verwendet werden:

source: When compiling the ``master`` branch, you need to have at least 8 GB of RAM available for successful linking with LTO enabled.
de: Wenn Sie den ``master``-Branch kompilieren, müssen Sie mindestens 8 GB RAM zur Verfügung haben, damit das Linken mit aktiviertem LTO erfolgreich ist.

source: When compiling the ``3.x`` branch, you need to have at least 6 GB of RAM available for successful linking with LTO enabled.
de: Wenn Sie den ``3.x``-Branch kompilieren, müssen Sie mindestens 6 GB RAM zur Verfügung haben, um das Linken mit aktiviertem LTO erfolgreich durchzuführen.

source: Optimizing for size instead of speed
de: Optimieren auf Größe statt Geschwindigkeit

source: **Performed in official builds:** Yes, but only for web builds
de: **Durchgeführt in offiziellen Builds:** Ja, aber nur für Web-Builds

source: Godot 3.1 onwards allows compiling using size optimizations (instead of speed). To enable this, set the ``optimize`` flag to ``size``:
de: Ab Godot 3.1 ist es möglich, die Kompilierung unter Verwendung von Größenoptimierungen (anstelle von Geschwindigkeitsoptimierungen) durchzuführen. Um dies zu aktivieren, setzen Sie das Flag ``optimize`` auf ``size``:

source: Some platforms such as WebAssembly already use this mode by default.
de: Einige Plattformen wie z.B. WebAssembly verwenden diesen Modus bereits standardmäßig.

source: Disabling advanced text server
de: Deaktivieren des erweiterten Text-Servers

source: **Performed in official builds:** No
de: **Durchgeführt in offiziellen Builds:** Nein

source: By default, Godot uses an advanced text server with the support for the following features:
de: Godot verwendet standardmäßig einen erweiterten Textserver mit Unterstützung für die folgenden Features:

source: Right-to-left typesetting and complex scripts, required to write languages such as Arabic and Hebrew.
de: Rechts-nach-links-Schriftsatz und komplexe Schriftzeichen, die für Sprachen wie Arabisch und Hebräisch erforderlich sind.

source: Font ligatures and OpenType features (such as small capitals, fractions and slashed zero).
de: Ligaturen und OpenType-Merkmale (wie Kapitälchen, Bruchzahlen und durchgestrichene Nullen).

source: Godot provides a fallback text server that isn't compiled by default. This text server can be used as a lightweight alternative to the default advanced text server:
de: Godot bietet einen Fallback-Text-Server, der standardmäßig nicht kompiliert ist. Dieser Textserver kann als leichtgewichtige Alternative zum standardmäßig verwendeten erweiterten Textserver genutzt werden:

source: If you only intend on supporting Latin, Greek and Cyrillic-based languages in your project, the fallback text server should suffice.
de: Wenn Sie in Ihrem Projekt nur lateinische, griechische und kyrillische Sprachen unterstützen wollen, sollte der Fallback-Text-Server ausreichen.

source: This fallback text server can also process large amounts of text more quickly than the advanced text server. This makes the fallback text server a good fit for mobile/web projects.
de: Dieser Fallback-Text-Server kann auch große Mengen an Text schneller verarbeiten als der erweiterte Textserver. Dadurch eignet sich der Fallback-Textserver gut für Mobile-/Webprojekte.

source: Remember to always pass ``module_text_server_fb_enabled=yes`` when using ``module_text_server_adv_enabled=no``. Otherwise, the compiled binary won't contain any text server, which means no text will be displayed at all when running the project.
de: Denken Sie daran, immer ``module_text_server_fb_enabled=yes`` zu übergeben, wenn Sie ``module_text_server_adv_enabled=no`` verwenden. Andernfalls wird die kompilierte Binärdatei keinen Textserver enthalten, was bedeutet, dass überhaupt kein Text angezeigt wird, wenn das Projekt läuft.

source: Disabling 3D
de: 3D abschalten

source: **Space savings:** Moderate
de: **Platzersparnis:** Mäßig

source: For 2D games, having the whole 3D engine available usually makes no sense. Because of this, there is a build flag to disable it:
de: Bei 2D-Spielen macht es normalerweise keinen Sinn, die gesamte 3D-Engine zur Verfügung zu haben. Aus diesem Grund gibt es ein Build-Flag, um dies zu deaktivieren:

source: Tools must be disabled in order to use this flag, as the editor is not designed to operate without 3D support. Without it, the binary size can be reduced by about 15%.
de: Die Tools müssen deaktiviert werden, um dieses Flag zu verwenden, da der Editor nicht für den Betrieb ohne 3D-Unterstützung ausgelegt ist. Ohne dieses Flag kann die Binärgröße um etwa 15 % reduziert werden.

source: Disabling advanced GUI objects
de: Deaktivieren erweiterter GUI-Objekte

source: Most small games don't require complex GUI controls such as Tree, ItemList, TextEdit or GraphEdit. They can be disabled using a build flag:
de: Die meisten kleinen Spiele benötigen keine komplexen GUI Kontroll-Elemente wie Tree, ItemList, TextEdit or GraphEdit. Sie können abgeschaltet werden mit einem Build Flag:

source: This is everything that will be disabled:
de: Dies ist alles, was deaktiviert werden wird:

source: Disabling unwanted modules
de: Unerwünschte Module deaktivieren

source: **Space savings:** Very low to moderate depending on modules
de: **Platzersparnis:** Sehr gering bis mäßig je nach Modulen

source: **Difficulty:** Medium to hard depending on modules
de: **Schwierigkeit:** Mittel bis schwer, je nach Modulen

source: A lot of Godot's functions are offered as modules. You can see a list of modules with the following command:
de: Viele der Funktionen von Godot werden als Module angeboten. Sie können eine Liste der Module mit dem folgenden Befehl anzeigen:

source: The list of modules that can be disabled will appear, together with all build options. If you are working on a simple 2D game, you could disable a lot of them:
de: Die Liste der Module, die deaktiviert werden können, wird zusammen mit allen Build-Optionen angezeigt. Wenn Sie an einem einfachen 2D-Spiel arbeiten, können Sie viele von ihnen deaktivieren:

source: If this proves not to work for your use case, you should review the list of modules and see which ones you actually still need for your game (e.g. you might want to keep networking-related modules, regex support, ``minimp3``/``ogg``/``vorbis`` to play music, or ``theora`` to play videos).
de: Wenn sich dies für Ihren Anwendungsfall als nicht praktikabel erweist, sollten Sie die Liste der Module überprüfen und sehen, welche Sie tatsächlich noch für Ihr Spiel benötigen (z.B. möchten Sie vielleicht netzwerkbezogene Module, Regex-Unterstützung, ``minimp3``/``ogg``/``vorbis`` zum Abspielen von Musik oder ``theora`` zum Abspielen von Videos behalten wollen).

source: Alternatively, you can supply a list of disabled modules by creating ``custom.py`` at the root of the source, with the contents similar to the following:
de: Alternativ können Sie eine Liste von deaktivierten Modulen bereitstellen, indem Sie ``custom.py`` im Stammverzeichnis des Quelltextes erstellen, mit einem Inhalt ähnlich wie folgt:

source: Optimizing the distribution of your project
de: Optimierung der Erstellung Ihres Projekts

source: This section is only relevant when distributing the files on a desktop platform that doesn't perform its own compression or packing. As such, this advice is relevant when you distribute ZIP archives on itch.io or GitHub Releases.
de: Dieser Abschnitt ist nur relevant, wenn Sie die Dateien für eine Desktop-Plattform veröffentlichen, die keine eigene Komprimierung oder kein eigenes Packen vornimmt. Daher ist dieser Ratschlag relevant, wenn Sie ZIP-Archive auf itch.io oder GitHub-Releases veröffentlichen.

source: Platforms like Steam already apply their own compression scheme, so you don't need to create a ZIP archive to distribute files in the first place.
de: Plattformen wie Steam wenden bereits ihr eigenes Komprimierungsverfahren an, so dass Sie nicht erst ein ZIP-Archiv erstellen müssen, um Dateien zu veröffentlichen.

source: As an aside, you can look into optimizing the distribution of your project itself. This can be done even without recompiling the export template.
de: Nebenbei bemerkt können Sie auch das Erstellen Ihres Projekts selbst optimieren. Dies kann auch ohne Neukompilierung der Exportvorlage erfolgen.

source: `7-Zip <https://7-zip.org/>`__ can be used to create ZIP archives that are more efficient than usual, while remaining compatible with every ZIP extractor (including Windows' own built-in extractor). ZIP size reduction in a large project can reach dozens of megabytes compared to a typical ZIP compressor, although average savings are in the 1-5 MB range. Creating this ZIP archive will take longer than usual, but it will extract just as fast as any other ZIP archive.
de: `7-Zip <https://7-zip.org/>`__ kann verwendet werden, um ZIP-Archive zu erstellen, die effizienter als üblich sind, während sie mit jedem ZIP-Extraktor (einschließlich des in Windows integrierten Extraktors) kompatibel bleiben. Die Reduzierung der ZIP-Größe in einem großen Projekt kann Dutzende von Megabytes im Vergleich zu einem typischen ZIP-Kompressor erreichen, obwohl die durchschnittlichen Einsparungen im Bereich von 1-5 MB liegen. Die Erstellung dieses ZIP-Archivs dauert länger als üblich, aber es wird genauso schnell entpackt wie jedes andere ZIP-Archiv.

source: When using the 7-Zip GUI, this is done by creating a ZIP archive with the Ultra compression mode. When using the command line, this is done using the following command:
de: Bei Verwendung der 7-Zip-Benutzeroberfläche erfolgt dies durch Erstellen eines ZIP-Archivs mit dem Komprimierungsmodus Ultra. Bei der Verwendung der Kommandozeile geschieht dies mit dem folgenden Befehl:

source: Enabling gzip or Brotli compression for all file types from the web export (especially the ``.wasm`` and ``.pck``) can reduce the download size significantly, leading to faster loading times, especially on slow connections.
de: Wenn Sie die gzip- oder Brotli-Komprimierung für alle Dateitypen aus dem Webexport (insbesondere für ``.wasm`` und ``.pck``) aktivieren, kann die Downloadgröße erheblich reduziert werden, was zu schnelleren Ladezeiten führt, insbesondere bei langsamen Verbindungen.

source: Creating precompressed gzip or Brotli files with a high compression level can be even more efficient, as long as the web server is configured to serve those files when they exist. When supported, Brotli should be preferred over gzip as it has a greater potential for file size reduction.
de: Die Erstellung vorkomprimierter gzip- oder Brotli-Dateien mit einem hohen Komprimierungsgrad kann noch effizienter sein, sofern der Webserver so konfiguriert ist, dass er diese Dateien bereitstellt, wenn sie vorhanden sind. Wenn unterstützt, sollte Brotli gegenüber gzip bevorzugt werden, da es ein größeres Potenzial zur Reduzierung der Dateigröße bietet.

source: See :ref:`doc_exporting_for_web_serving_the_files` for instructions.
de: Siehe :ref:`doc_exporting_for_web_serving_the_files` für weitere Informationen.

source: Translation status
de: Übersetzungsstatus
