Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/2d_skeletons.po
Languages: de, zh_tw

source: 2D skeletons
de: 2D-Skelette
zh_tw: 2D 骨架

source: Introduction
de: Einführung
zh_tw: 前言

source: When working with 3D, skeletal deforms are common for characters and creatures and most 3D modeling applications support it. For 2D, as this function is not used as often, it's difficult to find mainstream software aimed for this.
de: Bei der Arbeit mit 3D sind Skelett-Verformungen für Charaktere und Kreaturen üblich, und die meisten 3D-Modellierungsanwendungen unterstützen sie. Für 2D wird diese Funktion nicht so häufig verwendet, daher ist es schwierig, Mainstream-Software zu finden, die darauf ausgerichtet ist.

source: One option is to create animations in third-party software such as Spine or Dragonbones. From Godot 3.1 onwards, though, this functionality is supported built-in.
de: Eine Möglichkeit besteht darin, Animationen in Software von Drittanbietern wie Spine oder Dragonbones zu erstellen. Ab Godot 3.1 wird diese Funktion jedoch direkt unterstützt.
zh_tw: 你可以在 Spine、Dragonbones 等協力廠商軟體中建立動畫。不過，Godot 從 3.1 版本開始就已經內建了這個功能。

source: Why would you want to do skeletal animations directly in Godot? The answer is that there are many advantages to it:
de: Warum sollten Sie Skelett-Animationen direkt in Godot erstellen wollen? Die Antwort ist, dass es viele Vorteile hat:
zh_tw: 為什麼要在 Godot 中直接處理骨骼動畫？答案是這樣做有很多好處：

source: Better integration with the engine, so less hassle importing and editing from an external tool.
de: Bessere Integration in die Engine, damit weniger Aufwand beim Importieren und Bearbeiten durch ein externes Tool entsteht.
zh_tw: 能更好地與引擎集成, 從而減少使用外部工具匯入和編輯的麻煩.

source: Ability to control particle systems, shaders, sounds, call scripts, colors, transparency, etc. in animations.
de: Möglichkeit zur Steuerung von Partikelsystemen, Shadern, Sounds, Aufrufskripten, Farben, Transparenz usw. in Animationen.
zh_tw: 能夠控制粒子系統, 著色器, 聲音, 呼叫腳本, 顏色, 透明度等動畫.

source: The built-in skeletal system in Godot is very efficient and designed for performance.
de: Das in Godot eingebaute Skelettsystem ist sehr effizient und auf Leistung ausgelegt.
zh_tw: Godot內建的骨骼系統非常高效, 並且是為性能而設計的.

source: The following tutorial will, then, explain 2D skeletal deformations.
de: In der folgenden Anleitung werden dann die 2D-Skelettverformungen erklärt.
zh_tw: 接下來的教學將講解 2D 骨架變形。

source: Setup
de: Einrichtung
zh_tw: 設定

source: Before starting, we recommend you to go through the :ref:`doc_cutout_animation` tutorial to gain a general understanding of animating within Godot.
de: Bevor Sie beginnen, empfehlen wir Ihnen, das :ref:`doc_cutout_animation`-Tutorial durchzuarbeiten, um ein allgemeines Verständnis für das Animieren in Godot zu erlangen.
zh_tw: 在開始之前, 我們建議您先瀏覽一下 :ref:`doc_cutout_animation` 教學, 以便對Godot中的動畫製作有一個大致的瞭解.

source: For this tutorial, we will be using a single image to construct our character. Download it from :download:`gBot_pieces.png <img/gBot_pieces.png>` or save the image below.
de: In diesem Tutorial werden wir ein einziges Bild verwenden, um unsere Figur zu erstellen. Laden Sie es von :download:`gBot_pieces.png <img/gBot_pieces.png>` herunter oder speichern Sie das Bild unten.
zh_tw: 在本教學中, 我們將使用單張圖片來建構我們的角色. 從這裡下載 :download:`gBot_pieces.png <img/gBot_pieces.png>` 或保存下圖.

source: It is also advised to download the final character image :download:`gBot_complete.png <img/gBot_complete.png>` to have a good reference for putting the different pieces together.
de: Es ist auch ratsam, das endgültige Charakterbild herunterzuladen :download:`gBot_complete.png <img/gBot_complete.png>`, um eine gute Referenz für das Zusammensetzen der verschiedenen Teile zu haben.
zh_tw: 並且建議下載最終的角色圖片 :download:`gBot_complete.png <img/gBot_complete.png>` 將不同部分放在一起，以便進行參考。

source: Creating the polygons
de: Erstellen der Polygone
zh_tw: 建立內容

source: Create a new scene for your model (if it's going to be an animated character, you may want to use a ``CharacterBody2D``). For ease of use, an empty 2D node is created as a root for the polygons.
de: Erstellen Sie eine neue Szene für Ihr Modell (wenn es sich um eine animierte Figur handelt, sollten Sie einen ``CharacterBody2D`` verwenden). Der Einfachheit halber wird ein leerer 2D Node als Root für die Polygone erstellt.
zh_tw: 為您的模型建立一個新場景（如果它是一個動畫角色，您可能需要使用 ``KinematicBody2D``）。為便於使用，建立一個空的 2D 節點作為多邊形的根節點。

source: Begin with a ``Polygon2D`` node. There is no need to place it anywhere in the scene for now, so simply create it like this:
de: Beginnen Sie mit einem ``Polygon2D``-Node. Es ist nicht nötig, ihn irgendwo in der Szene zu platzieren, also erstellen Sie ihn einfach so:
zh_tw: 從 ``Polygon2D`` 節點開始。現在不需要把它放在場景何處，所以簡單建立如下：

source: Select it and assign the texture with the character pieces you have downloaded before:
de: Wählen Sie ihn aus und weisen Sie die Textur den zuvor heruntergeladenen Charakterteilen zu:
zh_tw: 為您之前下載的角色元件選擇並指定紋理：

source: Drawing a polygon directly is not advised. Instead, open the "UV" dialog for the polygon:
de: Das direkte Zeichnen eines Polygons wird nicht empfohlen. Öffnen Sie stattdessen das Dialogfeld "UV" für das Polygon:
zh_tw: 不建議直接繪製多邊形。請打開該多邊形的“UV”對話方塊：

source: Head over to the *Points* mode, select the pencil and draw a polygon around the desired piece:
de: Gehen Sie in den *Punkte*-Modus, wählen Sie den Bleistift und zeichnen Sie ein Polygon um das gewünschte Teil:
zh_tw: 轉到 *點* 模式, 選擇鉛筆, 在需要的區域繪製一個多邊形:

source: Duplicate the polygon node and give it a proper name. Then, enter the "UV" dialog again and replace the old polygon with another one in the new desired piece.
de: Duplizieren Sie den Polygon-Node und geben Sie ihm einen passenden Namen. Rufen Sie dann erneut den "UV"-Dialog auf und ersetzen Sie das alte Polygon durch ein anderes in dem neuen gewünschten Teil.
zh_tw: 複製多邊形節點, 並給它一個合適的名字. 然後, 再次進入 "UV" 對話方塊, 在新的所需設計中用另一個多邊形替換舊的多邊形.

source: When you duplicate nodes and the next piece has a similar shape, you can edit the previous polygon instead of drawing a new one.
de: Wenn Sie Nodes duplizieren und das nächste Teil eine ähnliche Form hat, können Sie das vorherige Polygon bearbeiten, anstatt ein neues zu zeichnen.
zh_tw: 當複製節點且下一塊具有相似形狀時, 可以編輯上一個多邊形, 而不是繪製新多邊形.

source: After moving the polygon, remember to update the UV by selecting **Edit > Copy Polygon to UV** in the Polygon 2D UV Editor.
de: Vergessen Sie nicht, nach dem Verschieben des Polygons die UV zu aktualisieren, indem Sie im 2D-UV-Editor für Polygone **Bearbeiten > Polygon in UV kopieren** wählen.
zh_tw: 移動多邊形後, 請記住通過在多邊形2D UV編輯器中選擇編輯->"多邊形->UV" 來更新UV.

source: Keep doing this until you mapped all pieces.
de: Machen Sie so weiter, bis Sie alle Teile zugeordnet haben.
zh_tw: 繼續這樣做, 直到你對應所有的元件.

source: You will notice that pieces for nodes appear in the same layout as they do in the original texture. This is because by default, when you draw a polygon, the UV and points are the same.
de: Sie werden feststellen, dass die Teile für Nodes im gleichen Layout erscheinen wie in der Originaltextur. Das liegt daran, dass beim Zeichnen eines Polygons standardmäßig die UV und die Punkte gleich sind.
zh_tw: 你會注意到, 節點的部分與它們在原始紋理中的佈局是一樣的. 這是因為預設情況下, 當你繪製一個多邊形時,UV和點是一樣的.

source: Rearrange the pieces and build the character. This should be pretty quick. There is no need to change pivots, so don't bother making sure rotation pivots for each piece are right; you can leave them be for now.
de: Ordnen Sie die Teile neu an und bauen Sie die Figur. Das sollte ziemlich schnell gehen. Es besteht keine Notwendigkeit, die Rotationspunkte zu ändern, also machen Sie sich nicht die Mühe, sicherzustellen, dass die Rotationspunkte für jedes Teil richtig sind; Sie können sie vorerst beibehalten.
zh_tw: 重新排列元件, 建立角色. 這個過程應該很快. 沒必要改變軸心, 因此, 不必費心確保每個元件的旋轉軸心都正確；你可以暫時不用理會它們.

source: Ah, the visual order of the pieces is not correct yet, as some are covering wrong pieces. Rearrange the order of the nodes to fix this:
de: Ach ja, die visuelle Reihenfolge der Teile ist noch nicht korrekt, da einige die falschen Teile verdecken. Ordnen Sie die Reihenfolge der Nodes neu an, um dies zu beheben:
zh_tw: 啊, 這些作品的視覺順序還不正確, 因為有些覆蓋到錯誤的部分. 重新排列節點的順序來解決這個問題:

source: And there you go! It was definitely much easier than in the cutout tutorial.
de: Und da haben Sie es! Es war auf jeden Fall viel einfacher als in der Cutout-Anleitung.
zh_tw: 恭喜你完成本節教學!它肯定比剪紙動畫教學簡單得多.

source: Creating the skeleton
de: Erstellen des Skeletts
zh_tw: 建立內容

source: Create a ``Skeleton2D`` node as a child of the root node. This will be the base of our skeleton:
de: Erstellen Sie einen ``Skeleton2D``-Node als Child des Root-Nodes. Dieser wird die Basis unseres Skeletts sein:
zh_tw: 建立一個 ``Skeleton2D`` 節點作為根節點的子項。我們將其作為骨架的基礎：

source: Create a ``Bone2D`` node as a child of the skeleton. Put it on the hip (usually skeletons start here). The bone will be pointing to the right, but you can ignore this for now.
de: Erstellen Sie einen ``Bone2D``-Node als Child des Skeletts. Setzen Sie ihn auf die Hüfte (normalerweise beginnen Skelette hier). Der Knochen wird nach rechts zeigen, aber das können Sie vorerst ignorieren.
zh_tw: 建立一個 ``Bone2D`` 節點作為骨架的子項。把它放在臀部（通常從這裡開始建立骨架）。骨骼會指向右邊，但是現在你可以忽略這個。

source: Keep creating bones in hierarchy and naming them accordingly.
de: Erstellen Sie weiterhin Knochen in der Hierarchie und benennen Sie sie entsprechend.
zh_tw: 在層級結構中繼續建立骨骼並依次命名它們.

source: At the end of this chain, there will be a *jaw* node. It is, again, very short and pointing to the right. This is normal for bones without children. The length of *tip* bones can be changed with a property in the inspector:
de: Am Ende dieser Kette befindet sich ein *Kiefer*-Node. Dieser ist wiederum sehr kurz und zeigt nach rechts. Das ist normal für Knochen ohne Child-Nodes. Die Länge der *Kiefer*-Knochen kann mit einer Property im Inspektor geändert werden:
zh_tw: 在這根鏈條的末端，會有一個*下巴*節點。它很短小，也指向右邊。這根單根骨正常情況下沒有子骨骼。*提示*單根骨的長度屬性可以通過屬性面板來改變：

source: In this case, we don't need to rotate the bone (coincidentally the jaw points right in the sprite), but in case you need to, feel free to do it. Again, this is only really needed for tip bones as nodes with children don't usually need a length or a specific rotation.
de: In diesem Fall brauchen wir den Knochen nicht zu rotieren (zufälligerweise zeigt der Kiefer genau in das Sprite), aber falls Sie es benötigen, können Sie es gerne tun. Auch dies ist nur wirklich nötig für End-Knochen, da Nodes mit Child-Nodes in der Regel keine Länge oder eine bestimmte Rotation benötigen.
zh_tw: 在這種情況下, 我們不需要旋轉骨頭, 巧合的是, 精靈中的下巴指向右邊, 但萬一需要, 可以隨意旋轉. 同樣, 這只是對尖端骨骼的真正需要, 因為帶有子節點通常不需要長度或特定的旋轉.

source: Keep going and build the whole skeleton:
de: Machen Sie weiter und bauen Sie das ganze Skelett auf:
zh_tw: 繼續建構整個骨架：

source: You will notice that all bones raise an annoying warning about a missing rest pose. This means that it's time to set one. Go to the *skeleton* node and create a rest pose. This pose is the default one, you can come back to it anytime you want (which is very handy for animating):
de: Sie werden feststellen, dass alle Knochen eine lästige Warnung über eine fehlende Standardpose ausgeben. Das bedeutet, dass es an der Zeit ist, eine zu erstellen. Gehen Sie zum Node *Skelett* und erstellen Sie eine Standardpose. Diese Pose ist die Default-Pose, zu der Sie jederzeit zurückkehren können (was für die Animation sehr praktisch ist):
zh_tw: 你會注意到，所有骨骼節點旁都有一個煩人的警告，提示你缺少放鬆姿勢。這意味著是時候設定一個了。轉到*骨架*節點並建立一個放鬆姿勢。這個姿勢是預設的，你可以隨時回來修改（對於製作動畫來說非常方便）：

source: The warnings will go away. If you modify the skeleton (add/remove bones) you will need to set the rest pose again.
de: Die Warnungen werden verschwinden. Wenn Sie das Skelett ändern (Knochen hinzufügen/entfernen), müssen Sie die Standardpose erneut einstellen.
zh_tw: 警告消失了。如果你修改骨架（新增/移除骨骼）你需要重新設定放鬆姿勢。

source: Deforming the polygons
de: Deformieren der Polygone
zh_tw: 多邊形的變形

source: Select the previously created polygons and assign the skeleton node to their ``Skeleton`` property. This will ensure that they can eventually be deformed by it.
de: Wählen Sie die zuvor erstellten Polygone aus und weisen Sie den Node des Skeletts ihrer Property ``Skelett`` zu. Dadurch wird sichergestellt, dass sie schließlich von ihm verformt werden können.
zh_tw: 選擇之前建立的多邊形，並將骨架節點分配給它們的 ``Skeleton`` 屬性。這將確保它們最終能被變形。

source: Click the property highlighted above and select the skeleton node:
de: Klicken Sie auf die oben hervorgehobene Property und wählen Sie den Skelett-Node aus:
zh_tw: 按一下上面突出顯示的屬性並選擇骨架節點：

source: Again, open the UV editor for the polygon and go to the *Bones* section.
de: Öffnen Sie erneut den UV-Editor für das Polygon und gehen Sie zum Abschnitt *Knochen*.
zh_tw: 再次打開多邊形的 UV 編輯器，進入 *Bones* 部分。

source: You will not be able to paint weights yet. For this you need to synchronize the list of bones from the skeleton with the polygon. This step is done only once and manually (unless you modify the skeleton by adding/removing/renaming bones). It ensures that your rigging information is kept in the polygon, even if a skeleton node is accidentally lost or the skeleton modified. Push the "Sync Bones to Polygon" button to sync the list.
de: Sie können noch keine Gewichte malen. Hierfür müssen Sie die Liste der Knochen aus dem Skelett mit dem Polygon synchronisieren. Dieser Schritt wird nur einmal und manuell durchgeführt (es sei denn, Sie ändern das Skelett durch Hinzufügen/Entfernen/Umbenennen von Bones). Er stellt sicher, dass Ihre Rigging-Informationen im Polygon erhalten bleiben, selbst wenn ein Node des Skeletts versehentlich verloren geht oder das Skelett verändert wird. Drücken Sie die Schaltfläche " Knochen mit Polygon synchronisieren", um die Liste zu synchronisieren.
zh_tw: 現在您還不能繪製權重。為此，您首先需要將骨架中的骨骼列表與多邊形同步。此步驟僅需手動執行一次（除非您通過新增/刪除/重命名骨骼來修改骨架）。它確保您的綁定資訊保存在多邊形中，即使骨架節點意外丟失或被修改。按“同步骨骼到多邊形”按鈕來同步列表。

source: The list of bones will automatically appear. By default, your polygon has no weight assigned to any of them. Select the bones you want to assign weight to and paint them:
de: Die Liste der Knochen wird automatisch angezeigt. Standardmäßig ist Ihrem Polygon keine Gewichtung zugewiesen. Wählen Sie die Knochen aus, denen Sie eine Gewichtung zuweisen möchten, und malen Sie sie:
zh_tw: 骨骼列表將自動顯示。預設情況下，您的多邊形沒有被分配任何權重資訊。選擇您想要分配權重的骨骼，並在它們上面繪製：

source: Points in white have a full weight assigned, while points in black are not influenced by the bone. If the same point is painted white for multiple bones, the influence will be distributed amongst them (so usually there is not that much need to use shades in-between unless you want to polish the bending effect).
de: Punkten in Weiß wird ein volles Gewicht zugewiesen, während Punkte in Schwarz nicht von dem Knochen beeinflusst werden. Wenn ein und derselbe Punkt für mehrere Knochen weiß gemalt wird, wird der Einfluss auf sie verteilt (daher ist es normalerweise nicht notwendig, Zwischenstufen zu verwenden, es sei denn, Sie möchten den Biegeeffekt verbessern).
zh_tw: 白色點完全受到權重影響，而黑色點完全不受影響。如果在多根骨骼上，繪製了相同的白色點，那麼權重的影響將平均分配在這些骨骼之間。（所以通常不需要過多使用中間色調，除非你想仔細打磨彎曲效果）。

source: After painting the weights, animating the bones (NOT the polygons!) will have the desired effect of modifying and bending the polygons accordingly. As you only need to animate bones in this approach, work becomes much easier!
de: Nach dem Malen der Gewichte hat das Animieren der Knochen (NICHT der Polygone!) den gewünschten Effekt, dass die Polygone entsprechend modifiziert und gebogen werden. Da Sie bei diesem Ansatz nur die Knochen animieren müssen, wird die Arbeit viel einfacher!
zh_tw: 繪製完權重後，製作骨骼的動畫（不是多邊形的動畫！）會具有修改和彎曲多邊形的預期效果。因為你只需用這種方法驅動骨骼，工作就變得容易得多！

source: But it's not all roses. Trying to animate bones that bend the polygon will often yield unexpected results:
de: Aber es ist noch nicht alles in Butter. Der Versuch, Knochen zu animieren, die das Polygon biegen, führt oft zu unerwarteten Ergebnissen:
zh_tw: 但這並不完美。嘗試調調骨骼的動畫，彎曲的多邊形往往會產生意想不到的結果：

source: This happens because Godot generates internal triangles that connect the points when drawing the polygon. They don't always bend the way you would expect. To solve this, you need to set hints in the geometry to clarify how you expect it to deform.
de: Dies geschieht, weil Godot beim Zeichnen des Polygons interne Dreiecke erzeugt, um die Punkte zu verbinden. Sie biegen sich nicht immer so, wie man es erwarten würde. Um dieses Problem zu lösen, müssen Sie Hints in der Geometrie festlegen, um klarzustellen, wie Sie die Verformung erwarten.
zh_tw: 這是因為Godot在繪製多邊形時, 產生了內部三角形來連接這些點. 它們並不總是按你所期望的方式彎曲. 如果要解決這個問題, 你需要在幾何圖形中設定提示, 以明確希望它如何變形.

source: Internal vertices
de: Interne Vertices
zh_tw: 內部頂點

source: Open the UV menu for each bone again and go to the *Points* section. Add some internal vertices in the regions where you expect the geometry to bend:
de: Öffnen Sie erneut das UV-Menü für jeden Knochen und gehen Sie zum Abschnitt *Punkte*. Fügen Sie einige interne Vertices in den Bereichen hinzu, in denen Sie erwarten, dass sich die Geometrie biegt:
zh_tw: 再次打開每根骨骼的 UV 功能表，進入 *Points* 部分。在你期望幾何體彎曲的地方新增一些內部頂點：

source: Now, go to the *Polygon* section and redraw your own polygons with more detail. Imagine that, as your polygons bend, you need to make sure they deform the least possible, so experiment a bit to find the right setup.
de: Gehen Sie nun in den Bereich *Polygon* und zeichnen Sie Ihre eigenen Polygone mit mehr Details nach. Stellen Sie sich vor, dass Sie beim Biegen Ihrer Polygone sicherstellen müssen, dass sie sich so wenig wie möglich verformen, also experimentieren Sie ein wenig, um die richtige Einstellung zu finden.
zh_tw: 現在轉到 *多邊形* 部分, 重新繪製細節更豐富的多邊形. 這樣, 當多邊形彎曲時, 你需要確保它們變形的可能性最小, 慢慢嘗試找出正確的設定.

source: Once you start drawing, the original polygon will disappear and you will be free to create your own:
de: Sobald Sie mit dem Zeichnen beginnen, verschwindet das ursprüngliche Polygon und Sie können Ihr eigenes Polygon erstellen:
zh_tw: 一旦你開始繪製, 原來的多邊形會消失, 你可以自由建立自己的多邊形:

source: This amount of detail is usually fine, though you may want to have more fine-grained control over where triangles go. Experiment by yourself until you get the results you like.
de: Dieser Detaillierungsgrad ist in der Regel in Ordnung, auch wenn Sie vielleicht eine feinere Kontrolle über die Position der Dreiecke haben möchten. Experimentieren Sie selbst, bis Sie die gewünschten Ergebnisse erzielen.
zh_tw: 通常這個數量的細節沒有問題, 儘管你想更精細地控制三角形. 請多多嘗試, 直到獲得你滿意的結果.

source: **Note:** Don't forget that your newly added internal vertices also need weight painting! Go to the *Bones* section again to assign them to the right bones.
de: **Hinweis:** Vergessen Sie nicht, dass Ihre neu hinzugefügten internen Vertices auch gewichtet werden müssen! Gehen Sie erneut zum Abschnitt *Knochen*, um sie den richtigen Knochen zuzuweisen.
zh_tw: **注意:** 不要忘記你新新增的內部頂點也需要繪製權重!再次轉到 *骨骼* 部分, 將它們分配到正確的骨骼.

source: Once you are all set, you will get much better results:
de: Sobald Sie fertig sind, erhalten Sie viel bessere Ergebnisse:
zh_tw: 一旦你設定好了, 你會得到更好的結果:

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
