Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/animation_track_types.po
Languages: de, zh_cn, zh_tw

source: Animation Track types
de: Animations-Track-Typen
zh_cn: 动画轨道类型
zh_tw: 動畫軌編輯器

source: This page gives an overview of the track types available for Godot's animation player node on top of the default property tracks.
de: Diese Seite gibt einen Überblick über die Track-Typen, die für den Node des Godot-Animationsplayers zusätzlich zu den Default-Property-Tracks verfügbar sind.
zh_cn: 本页面概述了在默认属性轨道之外，Godot动画播放器节点可用的轨道类型。
zh_tw: 本頁概述了預設屬性軌道之上的 Godot 動畫播放器節點可用的軌道型別。

source: We assume you already read :ref:`doc_introduction_animation`, which covers the basics, including property tracks.
de: Wir gehen davon aus, dass Sie bereits :ref:`doc_introduction_animation` gelesen haben, in dem die Grundlagen, einschließlich Property Tracks, behandelt werden.
zh_cn: 我们假设你已经阅读了 :ref:`doc_introduction_animation`\ ，其中包括了一些基础知识，包括属性轨道。
zh_tw: 我們假設您已經閱讀了 :ref:`doc_introduction_animation`，其中涵蓋了基礎知識，包括屬性軌道。

source: Property Track
zh_cn: 属性轨道
zh_tw: 屬性軌道

source: The most basic track type. See :ref:`doc_introduction_animation`.
de: Der grundlegendste Track-Typ. Siehe :ref:`doc_introduction_animation`.
zh_cn: 最基本的轨道类型。见 :ref:`doc_introduction_animation`\ 。
zh_tw: 最基本的軌道型別。見 :ref:`doc_introduction_animation`。

source: Position 3D / Rotation 3D / Scale 3D Track
de: Position 3D- / Rotation 3D- / Skalierung 3D-Track
zh_cn: 3D 位置、旋转、缩放轨道
zh_tw: 3D 位置、旋轉、縮放軌道

source: These 3D transform tracks control the location, rotation, and scale of a 3D object. They make it easier to animate a 3D object's transform compared to using regular property tracks.
de: Diese 3D-Transformations-Tracks steuern die Position, Rotation und Skalierung eines 3D-Objekts. Sie erleichtern die Animation der Transformation eines 3D-Objekts im Vergleich zur Verwendung normaler Property-Tracks.
zh_cn: 这些 3D 变换轨道控制的是 3D 对象的位置、旋转和缩放。这样为 3D 对象的变换做动画相比于使用普通属性轨道更方便。
zh_tw: 這些 3D 變換軌道控制的是 3D 物件的位置、旋轉和縮放。這樣為 3D 物件的變換做動畫相比於使用普通屬性軌道更方便。

source: It is designed for animations imported from external 3D models and can reduce resource capacity through compression.
de: Es wurde für Animationen entwickelt, die aus externen 3D-Modellen importiert wurden, und kann die Ressourcenkapazität durch Komprimierung verringern.
zh_cn: 它专为从外部3D模型导入的动画而设计，并可以通过压缩来减少资源占用。
zh_tw: 它專為從外部3D模型匯入的動畫而設計，可以透過壓縮來減少資源容量。

source: Blend Shape Track
zh_cn: 混合形状轨道
zh_tw: 混合形狀軌道

source: A blend shape track is optimized for animating blend shape in :ref:`MeshInstance3D <class_MeshInstance3D>`.
de: Ein Blend Shape-Track ist für die Animation von Blend Shapes in :ref:`MeshInstance3D <class_MeshInstance3D>` optimiert.
zh_cn: 混合形状轨道针对 :ref:`MeshInstance3D <class_MeshInstance3D>` 中的混合形状动画进行了优化。
zh_tw: 混合形狀軌跡針對 MeshInstance3D <class_MeshInstance3D> 中的混合形狀動畫進行了最佳化。

source: Call Method Track
de: Methodenaufrufs-Track
zh_cn: 方法调用轨道
zh_tw: 呼叫方法

source: A call method track allow you to call a function at a precise time from within an animation. For example, you can call ``queue_free()`` to delete a node at the end of a death animation.
de: Ein Methodenaufrufs-Track ermöglicht es Ihnen, eine Funktion zu einem bestimmten Zeitpunkt innerhalb einer Animation aufzurufen. Zum Beispiel können Sie ``queue_free()`` aufrufen, um einen Node am Ende einer Todesanimation zu löschen.
zh_cn: 方法调用轨道允许你在动画中的特定时间调用函数。例如，你可以在死亡动画的结束时调用 ``queue_free()`` 来删除节点。
zh_tw: 呼叫方法軌道允許您在動畫中的精確時間呼叫函式。例如，您可以呼叫“queue_free()”在死亡動畫結束時刪除節點。

source: The events placed on the call method track are not executed when the animation is previewed in the editor for safety.
de: Die auf dem Methodenaufrufs-Track platzierten Ereignisse werden aus Sicherheitsgründen nicht ausgeführt, wenn die Animation in der Vorschau des Editors angezeigt wird.
zh_cn: 为了安全起见，在编辑器中预览动画时，方法调用轨道上的事件不会被执行。
zh_tw: 為了安全起見，在編輯器中預覽動畫時，不會執行放置在呼叫方法軌道上的事件。

source: To create such a track, click "Add Track -> Call Method Track." Then, a window opens and lets you select the node to associate with the track. To call one of the node's methods, right-click the timeline and select "Insert Key". A window opens with a list of available methods. Double-click one to finish creating the keyframe.
de: Um einen solchen Track zu erstellen, klicken Sie auf " Track hinzufügen -> Methodenaufrufs-Track". Daraufhin wird ein Fenster geöffnet, in dem Sie den Node auswählen können, der mit dem Track verknüpft werden soll. Um eine der Methoden des Nodes aufzurufen, klicken Sie mit der rechten Maustaste auf die Zeitleiste und wählen Sie "Key einfügen". Es öffnet sich ein Fenster mit einer Liste der verfügbaren Methoden. Doppelklicken Sie auf eine, um die Erstellung des Keyframes abzuschließen.
zh_cn: 要创建这样的轨道，请单击“添加轨道 -> 方法调用轨道”。然后，一个窗口会打开，让你选择要与轨道关联的节点。要调用节点的方法，请右键单击时间轴，然后选择“插入关键帧”。一个窗口会打开，显示可用的方法列表。双击其中一个方法以完成创建关键帧。
zh_tw: 要建立這樣的跟踪，請按一下「新增追蹤 -> 呼叫方法追蹤」。然後，將開啟一個視窗，讓您選擇與軌道關聯的節點。若要呼叫節點的方法之一，請右鍵單擊時間軸並選擇“插入鍵”。將開啟一個視窗，其中包含可用方法的列表。雙擊其中一個即可完成關鍵影格的建立。

source: To change the method call or its arguments, click on the key and head to the inspector dock. There, you can change the method to call. If you expand the "Args" section, you will see a list of arguments you can edit.
de: Um den Methodenaufruf oder seine Argumente zu ändern, klicken Sie auf die Key und gehen Sie zum Inspektor-Dock. Dort können Sie die aufzurufende Methode ändern. Wenn Sie den Abschnitt "Argumente" erweitern, sehen Sie eine Liste der Argumente, die Sie bearbeiten können.
zh_cn: 要更改方法调用或其参数，请单击关键帧并转到检查器面板。在那里，你可以更改要调用的方法。如果展开“Args”部分，你将看到一个可编辑的参数列表。
zh_tw: 若要變更方法呼叫或其參數，請按一下該鍵並前往屬性面板停靠列。在那裡，您可以更改要呼叫的方法。如果展開「Args」部分，您將看到可以編輯的參數列表。

source: Bezier Curve Track
de: Bézierkurven-Track
zh_cn: 贝塞尔曲线轨道
zh_tw: 貝茲曲線軌道

source: A bezier curve track is similar to a property track, except it allows you to animate a property's value using a bezier curve.
de: Ein Bézierkurven-Track ähnelt einem Property-Track, mit dem Unterschied, dass Sie damit den Wert einer Property mithilfe einer Bézier-Kurve animieren können.
zh_cn: 贝塞尔曲线轨道类似于属性轨道，但它允许你使用贝塞尔曲线来控制属性的值。
zh_tw: 貝塞爾曲線軌道與屬性軌道類似，不同之處在於它允許您使用貝塞爾曲線為屬性值設定動畫。

source: Bezier curve track and property track cannot be blended in :ref:`AnimationPlayer <class_AnimationPlayer>` and :ref:`AnimationTree <class_AnimationTree>`.
de: Bézierkurven-Track und Property-Track können nicht in :ref:`AnimationPlayer <class_AnimationPlayer>` und :ref:`AnimationTree <class_AnimationTree>` überblendet werden.
zh_cn: 贝塞尔曲线轨道和属性轨道不能在 :ref:`AnimationPlayer <class_AnimationPlayer>` 和 :ref:`AnimationTree <class_AnimationTree>` 中混合。
zh_tw: 貝塞爾曲線軌跡和屬性軌跡不能在 :ref:`AnimationPlayer <class_AnimationPlayer>` 和 :ref:`AnimationTree <class_AnimationTree>` 中混合。

source: To create one, click "Add Track -> Bezier Curve Track". As with property tracks, you need to select a node and a property to animate. To open the bezier curve editor, click the curve icon to the right of the animation track.
de: Um einen Track zu erstellen, klicken Sie auf "Track hinzufügen -> Bézier-Kurven-Track". Wie bei den Property-Tracks müssen Sie einen Node und eine Property auswählen, die animiert werden sollen. Um den Bézierkurven-Editor zu öffnen, klicken Sie auf das Kurven-Icon rechts neben dem Animations-Track.
zh_cn: 要创建一个贝塞尔曲线轨道，请单击“添加轨道 -> 贝塞尔曲线轨道”。与属性轨道一样，你需要选择要设置动画的节点和属性。请单击动画轨道右侧的曲线图标以打开贝塞尔曲线编辑器。
zh_tw: 若要建立一個，請按一下「新增軌跡 -> 貝塞爾曲線軌跡」。與屬性軌跡一樣，您需要選擇要設定動畫的節點和屬性。若要開啟貝塞爾曲線編輯器，請點選動畫軌道右側的曲線圖示。

source: In the editor, keys are represented by filled diamonds and the outlined diamonds connected to them by a line control curve's shape.
de: Im Editor werden die Keys durch gefüllte Rauten dargestellt und die umrandeten Rauten, die mit ihnen durch die Form einer Linie verbunden sind, steuern die Form der Kurve.
zh_cn: 在编辑器中，帧由实心菱形表示，空心菱形通过线控制曲线的形状连接到它们。
zh_tw: 在編輯器中，鍵由實心菱形表示，輪廓菱形透過線控製曲線的形狀連接到它們。

source: In the right click panel of the editor, you can select the handle mode:
de: Im Rechtsklick-Panel des Editors können Sie den Griffmodus auswählen:
zh_cn: 在编辑器右键面板中，可以选择控柄模式：
zh_tw: 在編輯器右鍵面板中，可以選擇手把模式：

source: Free: Allows you to orient a manipulator in any direction without affecting the other's position.
de: Frei: Ermöglicht die Ausrichtung eines Manipulators in eine beliebige Richtung, ohne die Position des anderen zu beeinflussen.
zh_cn: 自由：允许你将操纵器定向到任何方向，而不影响另一个操纵器的位置。
zh_tw: 自由：允許您將操縱器定向到任何方向，而不影響另一個操縱器的位置。

source: Linear: Does not allow rotation of the manipulator and draws a linear graph.
de: Linear: Erlaubt keine Drehung des Manipulators und zeichnet eine lineare Grafik.
zh_cn: 线性：不允许操纵器旋转，绘制线性图形。
zh_tw: 線性：不允許機械手旋轉，繪製線性圖形。

source: Balanced: Makes it so manipulators rotate together, but the distance between the key and a manipulator is not mirrored.
de: Ausbalanciert: Sorgt dafür, dass sich die Manipulatoren gemeinsam drehen, aber der Abstand zwischen dem Key und einem Manipulator wird nicht gespiegelt.
zh_cn: 平衡：使操纵器一起旋转，但关键帧和操纵器之间的距离不镜像。
zh_tw: 平衡：使操縱器一起旋轉，但鍵和操縱器之間的距離不鏡像。

source: Mirrored: Makes the position of one manipulator perfectly mirror the other, including their distance to the key.
de: Gespiegelt: Die Position des einen Manipulators spiegelt die des anderen perfekt wider, einschließlich des Abstands zum Key.
zh_cn: 镜像：使一个操纵器的位置完美镜像另一个操纵器，包括它们到关键帧的距离。
zh_tw: 鏡像：使一個操縱器的位置完美鏡像另一個操縱器，包括它們到關鍵點的距離。

source: Audio Playback Track
zh_cn: 音频播放轨道
zh_tw: 音訊播放軌道

source: If you want to create an animation with audio, you need to create an audio playback track. To create one, your scene must have either an AudioStreamPlayer, AudioStreamPlayer2D, or AudioStreamPlayer3D node. When creating the track, you must select one of those nodes.
de: Wenn Sie eine Animation mit Audio erstellen möchten, müssen Sie einen Track zur Audiowiedergabe erstellen. Um eine solche zu erstellen, muss Ihre Szene entweder einen AudioStreamPlayer-, AudioStreamPlayer2D- oder AudioStreamPlayer3D-Node haben. Beim Erstellen des Tracks müssen Sie einen dieser Nodes auswählen.
zh_cn: 如果要创建带音频的动画，则需要创建音频播放轨道。为了创建音频播放轨道，你的场景必须具有 AudioStreamPlayer、AudioStreamPlayer2D 或 AudioStreamPlayer3D 节点。创建轨道时，你必须选择这些节点之一。
zh_tw: 如果要建立具有音訊的動畫，則需要建立音訊播放軌道。要建立一個，您的場景必須具有 AudioStreamPlayer、AudioStreamPlayer2D 或 AudioStreamPlayer3D 節點。建立軌道時，您必須選擇這些節點之一。

source: To play a sound in your animation, drag and drop an audio file from the file system dock onto the animation track. You should see the waveform of your audio file in the track.
de: Um einen Sound in Ihrer Animation abzuspielen, ziehen Sie eine Audiodatei aus dem Dateisystem-Dock auf den Animations-Track und legen Sie sie dort ab. Sie sollten die Wellenform Ihrer Audiodatei im Track sehen.
zh_cn: 为了在动画中播放声音，请将音频文件从文件系统面板拖放到动画轨道上。你应该能在轨道中看到音频文件的波形。
zh_tw: 若要在動畫中播放聲音，請將音訊檔案從檔案系統停靠欄拖曳到動畫軌道上。您應該在軌道中看到音訊檔案的波形。

source: To remove a sound from the animation, you can right-click it and select "Delete Key(s)" or click on it and press the :kbd:`Del` key.
de: Um einen Sound aus der Animation zu entfernen, können Sie ihn mit der rechten Maustaste anklicken und "Key(s) löschen" wählen oder ihn anklicken und die Taste :kbd:`Entf` drücken.
zh_cn: 为了从动画中删除声音，你可以右键单击它并选择“删除关键帧”或单击它并按 :kbd:`Del` 键。
zh_tw: 要從動畫中刪除聲音，您可以右鍵單擊它並選擇“刪除關鍵點”或單擊它並按 Del 鍵。

source: The blend mode allows you to choose whether or not to adjust the audio volume when blending in the :ref:`AnimationTree <class_AnimationTree>`.
de: Mit dem Blending-Modus können Sie wählen, ob die Lautstärke beim Überblenden des :ref:`AnimationTree <class_AnimationTree>` angepasst werden soll oder nicht.
zh_cn: 混合模式允许你选择在 :ref:`AnimationTree <class_AnimationTree>` 中混合时是否调整音频音量。
zh_tw: 混合模式可讓您選擇在 :ref:`AnimationTree <class_AnimationTree>` 中混合時是否調整音訊音量。

source: Animation Playback Track
de: Animationsplayback-Track
zh_cn: 动画播放轨道
zh_tw: 動畫播放軌道

source: Animation playback tracks allow you to sequence the animations of other animation player nodes in a scene. For example, you can use it to animate several characters in a cut-scene.
de: Mit Animationsplayback -Tracks können Sie die Animationen anderer Animation Player-Nodes in einer Szene aneinanderreihen. So können Sie zum Beispiel mehrere Charaktere in einer Szene animieren.
zh_cn: 动画播放轨道允许你对场景中其他动画播放器节点的动画进行排序。比如你可以用它为过场动画中的多个角色制作动画。
zh_tw: 動畫播放軌道可讓您對場景中其他動畫播放器節點的動畫進行排序。例如，您可以使用它為過場動畫中的多個角色製作動畫。

source: To create an animation playback track, select "New Track -> Animation Playback Track."
de: Um einen Animationswiedergabe-Track zu erstellen, wählen Sie "Neuer Track -> Animationswiedergabe-Track".
zh_cn: 要创建动画播放轨道，请选择“新建轨道 -> 动画播放轨道”。
zh_tw: 若要建立動畫播放軌道，請選擇「新軌道 -> 動畫播放軌道」。

source: Then, select the animation player you want to associate with the track.
de: Wählen Sie dann den Animationsplayer aus, den Sie mit dem Track verknüpfen möchten.
zh_cn: 而后选择要与轨道关联的动画播放器。
zh_tw: 然後，選擇要與軌道關聯的動畫播放器。

source: To add an animation to the track, right-click on it and insert a key. Select the key you just created to select an animation in the inspector dock.
de: Um dem Track eine Animation hinzuzufügen, klicken Sie ihn mit der rechten Maustaste an und fügen Sie einen Key ein. Wählen Sie den soeben erstellten Key aus, um eine Animation im Inspektor-Dock auszuwählen.
zh_cn: 请右键单击轨道并插入帧，来将动画添加到轨道中。选中你刚创建的帧，以在检查器面板中选择动画。
zh_tw: 要將動畫新增至軌道，請右鍵單擊它並插入關鍵點。選擇您剛剛建立的鍵以在屬性面板面板中選擇動畫。

source: If an animation is already playing and you want to stop it early, you can create a key and have it set to `[STOP]` in the inspector.
de: Wenn eine Animation bereits läuft und Sie sie vorzeitig beenden möchten, können Sie einen Key erstellen und ihn im Inspektor auf `[STOP]` setzen.
zh_cn: 如果动画已经在播放，并且你想提前停止它，可以创建一个帧并将其在检查器中设置为 `[STOP]` 。
zh_tw: 如果動畫已經在播放並且您想要提前停止它，您可以建立一個關鍵點並將其在屬性面板中設定為「[STOP]」。

source: If you instanced a scene that contains an animation player into your scene, you need to enable "Editable Children" in the scene tree to access its animation player. Also, an animation player cannot reference itself.
de: Wenn Sie eine Szene, die einen Animationsplayer enthält, in Ihre Szene instanziiert haben, müssen Sie " Bearbeitbare Child-Objekte" im Szenenbaum aktivieren, um auf den Animationsplayer zugreifen zu können. Außerdem kann ein Animationsplayer nicht auf sich selbst verweisen.
zh_cn: 如果你在场景中实例化了包含动画播放器的场景，则需要在场景树中启用“子节点可编辑”，才能访问它的动画播放器。除此之外，动画播放器也无法引用自身。
zh_tw: 如果您在場景中實例化了包含動畫播放器的場景，則需要在場景樹中啟用「可編輯子專案」才能存取其動畫播放器。此外，動畫播放器無法引用自身。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
