Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/animation_tree.po
Languages: de, zh_tw

source: Using AnimationTree
de: Verwendung des AnimationTree
zh_tw: 使用 AnimationTree

source: Introduction
de: Einführung
zh_tw: 前言

source: With :ref:`AnimationPlayer <class_AnimationPlayer>`, Godot has one of the most flexible animation systems that you can find in any game engine. The ability to animate almost any property in any node or resource, as well as having dedicated transform, bezier, function calling, audio and sub-animation tracks, is pretty much unique.
de: Mit :ref:`AnimationPlayer <class_AnimationPlayer>` verfügt Godot über eines der flexibelsten Animationssysteme, die man in einer Game Engine finden kann. Die Fähigkeit, fast jede Property in jedem Node oder jeder Ressource zu animieren, sowie dedizierte Transform-, Bezier-, Funktionsaufruf-, Audio- und Sub-Animations-Tracks zu haben, ist ziemlich einzigartig.
zh_tw: 通過 :ref:`AnimationPlayer <class_AnimationPlayer>`，Godot 擁有你在所有遊戲引擎中能找到的最靈活的動畫系統之一。幾乎可以在任何節點或資源中對任何屬性進行動畫處理，以及專門的變換、貝塞爾、函式呼叫、音訊和子動畫軌道，這樣的能力相當獨特。

source: However, the support for blending those animations via ``AnimationPlayer`` is relatively limited, as only a fixed cross-fade transition time can be set.
de: Die Unterstützung für Blending dieser Animationen mittels ``AnimationPlayer`` ist jedoch relativ begrenzt, da nur eine feste Crossfade-Zeit eingestellt werden kann.
zh_tw: 然而, 通過 ``AnimationPlayer`` 混合這些動畫的支援相對有限, 只能設定固定的交叉漸變過渡時間.

source: :ref:`AnimationTree <class_AnimationTree>` is a new node introduced in Godot 3.1 to deal with advanced transitions. It supersedes the ancient ``AnimationTreePlayer``, while adding a huge amount of features and flexibility.
de: :ref:`AnimationTree <class_AnimationTree>` ist ein neuer Node, der in Godot 3.1 eingeführt wurde, um fortgeschrittene Übergänge zu behandeln. Er ersetzt den alten ``AnimationTreePlayer`` und bietet gleichzeitig eine große Menge an Funktionen und Flexibilität.
zh_tw: :ref:`AnimationTree <class_AnimationTree>` 是Godot 3.1中引入的一個新節點, 用於處理更高級的變換, 它取代了舊的 ``AnimationTreePlayer`` , 同時增加了大量的功能和靈活性.

source: Creating an AnimationTree
de: Erstellen eines AnimationTree
zh_tw: 建立內容

source: Before starting, it must be made clear that an ``AnimationTree`` node does not contain its own animations. Instead, it uses animations contained in an ``AnimationPlayer`` node. This way, you can edit your animations (or import them from a 3D scene) as usual and then use this extra node to control the playback.
de: Bevor wir beginnen, muß klargestellt werden, daß ein ``AnimationTree``-Node keine eigenen Animationen enthält. Stattdessen verwendet er Animationen, die in einem ``AnimationPlayer``-Node enthalten sind. Auf diese Weise können Sie Ihre Animationen wie gewohnt bearbeiten (oder sie aus einer 3D-Szene importieren) und dann diesen zusätzlichen Node zur Steuerung der Wiedergabe verwenden.
zh_tw: 首先, 必須明確 ``AnimationTree`` 節點不包含它自己的動畫. 相反, 它使用包含在 ``AnimationPlayer`` 節點中的動畫. 通過這種形式, 您可以像往常一樣編輯動畫(或從3D場景匯入動畫), 然後使用這個額外節點來控制播放.

source: The most common way to use ``AnimationTree`` is in a 3D scene. When importing your scenes from a 3D exchange format, they will usually come with animations built-in (either multiple ones or split from a large one on import). At the end, the imported Godot scene will contain the animations in a ``AnimationPlayer`` node.
de: Die gebräuchlichste Art, ``AnimationTree`` zu verwenden, ist in einer 3D-Szene. Wenn Sie Ihre Szenen aus einem 3D-Austauschformat importieren, werden sie normalerweise mit integrierten Animationen geliefert (entweder mehrere oder von einer großen Szene beim Import getrennt). Am Ende wird die importierte Godot-Szene die Animationen in einem ``AnimationPlayer`` Node enthalten.
zh_tw: 在3D場景中經常使用 ``AnimationTree`` . 當從3D交換格式匯入場景時, 它們通常自帶動畫(要麼是多個, 要麼是在匯入時從一個大的動畫中拆分出來). 最後, 匯入的Godot場景在 ``AnimationPlayer`` 節點中包含動畫.

source: As you rarely use imported scenes directly in Godot (they are either instantiated or inherited from), you can place the ``AnimationTree`` node in your new scene which contains the imported one. Afterwards, point the ``AnimationTree`` node to the ``AnimationPlayer`` that was created in the imported scene.
de: Da man importierte Szenen in Godot selten direkt verwendet (sie werden entweder instanziiert oder geerbt), kann man den ``AnimationTree``-Node in der neuen Szene platzieren, in der die importierte Szene vorkommt. Anschließend zeigen Sie den ``AnimationTree``-Node auf den ``AnimationPlayer``, der in der importierten Szene erstellt wurde.
zh_tw: 很少在Godot中直接使用匯入的場景(它們要麼產生實體, 要麼來自繼承), 您可以將 ``AnimationTree`` 節點放置在包含匯入的新場景中. 然後, 將 ``AnimationTree`` 節點指嚮匯入場景內建立的 ``AnimationPlayer`` 節點.

source: This is how it's done in the `Third Person Shooter demo <https://github.com/godotengine/tps-demo>`_, for reference:
de: Als Referenz hier noch einmal wie es in der `Third Person Shooter Demo <https://github.com/godotengine/tps-demo>`_ gemacht wird:
zh_tw: 這是在 `第三人稱射擊遊戲演示 <https://github.com/godotengine/tps-demo>`_, 中的設定, 參考下圖:

source: A new scene was created for the player with a ``CharacterBody3D`` as root. Inside this scene, the original ``.dae`` (Collada) file was instantiated and an ``AnimationTree`` node was created.
de: Eine neue Szene wurde für den Spieler mit einem ``CharacterBody3D`` als Root erstellt. Innerhalb dieser Szene wurde die ursprüngliche ``.dae`` (Collada) Datei instanziiert und ein ``AnimationTree``-Node erstellt.
zh_tw: 為玩家建立了一個以 ``KinematicBody`` 為根節點的新場景. 在這個場景中, 已產生實體原來的 ``.dae`` (Collada)檔案, 並建立 ``AnimationTree`` 節點.

source: Creating a tree
de: Erstellen eines Baums
zh_tw: 建立內容

source: There are three main types of nodes that can be used in ``AnimationTree``:
de: Es gibt drei Haupttypen von Nodes, die in ``AnimationTree`` verwendet werden können:
zh_tw: 可以在 ``AnimationTree`` 中使用三種主要節點型別:

source: Animation nodes, which reference an animation from the linked ``AnimationPlayer``.
de: Animation-Nodes, die auf eine Animation aus dem verknüpften ``AnimationPlayer`` verweisen.
zh_tw: 動畫節點, 從連結的 ``AnimationTree`` 中引用動畫.

source: Animation Root nodes, which are used to blend sub-nodes.
de: Animations-Root-Nodes, die zum Blending von Unter-Nodes verwendet werden.
zh_tw: 動畫根節點, 用於混合子節點.

source: Animation Blend nodes, which are used within ``AnimationNodeBlendTree`` as single-graph blending via multiple input ports.
de: Animation Blend-Nodes, die innerhalb des ``AnimationNodeBlendTree`` als Single-Graph-Blending über mehrere Eingangsports verwendet werden.
zh_tw: 動畫混合節點，在 ``AnimationNodeBlendTree`` 中使用，通過多個輸入埠進行單圖混合。

source: To set a root node in ``AnimationTree``, a few types are available:
de: Um einen Root-Node in ``AnimationTree`` festzulegen, sind einige Typen verfügbar:
zh_tw: 在 ``AnimationTree`` 中設定根節點, 如下幾種型別可供選擇:

source: ``AnimationNodeAnimation``: Selects an animation from the list and plays it. This is the simplest root node, and generally not used directly as root.
de: ``AnimationNodeAnimation``: Wählt eine Animation aus der Liste aus und spielt sie ab. Dies ist der einfachste Root-Node und wird im Allgemeinen nicht direkt als Root verwendet.
zh_tw: ``AnimationNodeAnimation``：從列表中選擇一個動畫並播放它. 這是最簡單的根節點, 一般不直接用作根節點.

source: ``AnimationNodeBlendTree``: Contains many *blend* type nodes, such as mix, blend2, blend3, one shot, etc. This is one of the most commonly used roots.
de: ``AnimationNodeBlendTree``: Enthält viele Nodes vom Typ *blend*, z. B. mix, blend2, blend3, one shot usw. Dies ist einer der am häufigsten verwendeten Nodes.
zh_tw: ``AnimationNodeBlendTree``：包含許多*混合*型別的節點，如調配, 混合2, 混合3, 一對一等. 這是最常用的根節點之一.

source: ``AnimationNodeStateMachine``: Contains multiple root nodes as children in a graph. Each node is used as a *state*, and provides multiple functions to alternate between states.
de: ``AnimationNodeStateMachine``: Enthält mehrere Root-Nodes als untergeordnete Nodes in einem Diagramm. Jeder Node wird als *Zustand* verwendet und bietet mehrere Funktionen, um zwischen den Zuständen zu wechseln.
zh_tw: ``AnimationNodeStateMachine``：將多個根節點作為圖中的子節點. 每個節點作為一個 *狀態* 使用, 並提供多個函式在狀態之間進行切換.

source: ``AnimationNodeBlendSpace2D``: Allows placing root nodes in a 2D blend space. Control the blend position in 2D to mix between multiple animations.
de: ``AnimationNodeBlendSpace2D``: Ermöglicht die Platzierung von Root-Nodes in einem 2D-Blending-Space. Steuern Sie die Blending-Position in 2D, um zwischen mehreren Animationen zu überblenden.
zh_tw: ``AnimationNodeBlendSpace2D``：允許在二維混合空間中放置根節點. 在二維中控制混合位置以混合多個動畫.

source: ``AnimationNodeBlendSpace1D``: Simplified version of the above (1D).
de: ``AnimationNodeBlendSpace1D``: Vereinfachte Version des oben genannten (1D).
zh_tw: ``AnimationNodeBlendSpace1D``：以上的簡化版本（一維）。

source: Blend tree
de: Blending-Baum
zh_tw: 混合樹

source: An ``AnimationNodeBlendTree`` can contain both root and regular nodes used for blending. Nodes are added to the graph from a menu:
de: Ein ``AnimationNodeBlendTree`` kann sowohl Root- als auch reguläre Nodes enthalten, die zum Blending verwendet werden. Nodes werden dem Graphen über ein Menü hinzugefügt:
zh_tw: ``AnimationNodeBlendTree`` 可包含用於混合的根節點和常規節點。節點從選單新增到圖中：

source: All blend trees contain an ``Output`` node by default, and something has to be connected to it in order for animations to play.
de: Alle Blending-Bäume enthalten standardmäßig einen ``Output``-Node, an den etwas angeschlossen werden muß, damit die Animationen abgespielt werden können.
zh_tw: 所有混合樹預設都包含一個 ``Output``（輸出）節點，為了讓動畫播放，必須有個東西與其相連。

source: The easiest way to test this functionality is to connect an ``Animation`` node to it directly:
de: Der einfachste Weg diese Funktionalität zu testen besteht darin, einen ``Animation``-Node direkt mit ihm zu verbinden:
zh_tw: 測試此功能最簡單的方法是直接連接一個 ``Animation``（動畫）節點：

source: This will simply play back the animation. Make sure that the ``AnimationTree`` is active for something to actually happen.
de: Damit wird die Animation einfach abgespielt. Stellen Sie sicher, dass der ``AnimationTree`` aktiv ist, damit tatsächlich etwas passiert.
zh_tw: 這會簡單地重播動畫. 確保 ``AnimationTree`` 節點對實際發生的事情是啟動的.

source: Following is a short description of available nodes:
de: Es folgt eine kurze Beschreibung der verfügbaren Nodes:
zh_tw: 以下是可用節點的簡短描述:

source: Blend2 / Blend3
zh_tw: 混合2/混合3

source: These nodes will blend between two or three inputs by a user-specified blend value:
de: Diese Nodes überblenden zwischen zwei oder drei Eingängen um einen vom Benutzer festgelegten Blending-Wert:
zh_tw: 這些節點將通過使用者指定輸入的兩個或三個混合值之間進行混合:

source: For more complex blending, it is advised to use blend spaces instead.
de: Für komplexeres Blending wird empfohlen, stattdessen Blending-Spaces zu verwenden.
zh_tw: 對於更複雜的混合, 建議使用混合空間.

source: Blending can also use filters, i.e. you can control individually which tracks go through the blend function. This is very useful for layering animations on top of each other.
de: Beim Blending können auch Filter verwendet werden, d. h. Sie können individuell steuern, welche Tracks die Blending-Funktion durchlaufen. Dies ist sehr nützlich, um Animationen übereinander zu schichten.
zh_tw: 混合也可以使用篩檢程式, 也就是說, 您可以單獨控制通過混合功能的軌道. 這對於動畫的層疊非常有用.

source: This node will execute a sub-animation and return once it finishes. Blend times for fading in and out can be customized, as well as filters.
de: Dieser Node führt eine Sub-Animation aus und kehrt zurück, sobald sie beendet ist. Die Blending-Zeiten für das Ein- und Ausblenden können ebenso wie die Filter angepasst werden.
zh_tw: 此節點將執行子動畫, 並在完成後返回. 可以用於定制淡入淡出時間, 以及篩檢程式.

source: After setting the request and changing the animation playback, the one-shot node automatically clears the request on the next process frame by setting its ``request`` value to ``AnimationNodeOneShot.ONE_SHOT_REQUEST_NONE``.
de: Nach dem Setzen der Anforderung und dem Wechsel der Animationswiedergabe, löscht der One-Shot-Node die Anforderung automatisch im nächsten Prozessbild, indem er seinen ``Request``-Wert auf ``AnimationNodeOneShot.ONE_SHOT_REQUEST_NONE`` setzt.
zh_tw: 在設定時間和改變動畫播放後，尋找節點通過設定其 ``seek_position`` 值為 ``-1.0``，在下一個程序影格自動進入睡眠模式。

source: TimeSeek
zh_tw: 時間縮放

source: This node can be used to cause a seek command to happen to any sub-children of the animation graph. Use this node type to play an ``Animation`` from the start or a certain playback position inside the ``AnimationNodeBlendTree``.
de: Dieser Node kann verwendet werden, um einen Suchbefehl für beliebige untergeordnete Nodes des Animationsgraphen zu veranlassen. Verwenden Sie diesen Node-Typ, um eine ``Animation`` ab dem Start oder einer bestimmten Abspielposition innerhalb des ``AnimationNodeBlendTree`` abzuspielen.
zh_tw: 這個節點可以用來使尋找命令發生在動畫圖像的任何子代上。使用這個節點型別可以從 ``AnimationNodeBlendTree`` 中的開始或某個位置播放 ``Animation``。

source: After setting the time and changing the animation playback, the seek node automatically goes into sleep mode on the next process frame by setting its ``seek_request`` value to ``-1.0``.
de: Nach dem Einstellen der Zeit und dem Ändern der Animationswiedergabe geht der Node beim nächsten Prozessbild automatisch in den Schlafmodus über, indem er seinen ``seek_request``-Wert auf ``-1.0`` setzt.
zh_tw: 在設定時間和改變動畫播放後，尋找節點通過設定其 ``seek_position`` 值為 ``-1.0``，在下一個程序影格自動進入睡眠模式。

source: TimeScale
zh_tw: 時間縮放

source: Allows scaling the speed of the animation (or reverse it) connected to the `in` input via the `scale` parameter. Setting the `scale` to 0 will pause the animation.
de: Ermöglicht die Skalierung der Geschwindigkeit der Animation (oder deren Umkehrung), die über den Parameter `Skalierung` mit dem Eingang `in` verbunden ist. Setzt man `Skalierung` auf 0, wird die Animation angehalten.
zh_tw: 允許縮放任何子節點的動畫速度(或將其反轉). 設定為0會暫停動畫.

source: Transition
de: Übergang
zh_tw: 轉場效果

source: Very simple state machine (when you don't want to cope with a ``StateMachine`` node). Animations can be connected to the outputs and transition times can be specified. After setting the request and changing the animation playback, the transition node automatically clears the request on the next process frame by setting its ``transition_request`` value to an empty string (``""``).
de: Sehr einfache State Machine (wenn man sich nicht mit einem ``StateMachine``-Node herumschlagen will). Animationen können mit den Ausgängen verbunden werden und es können Übergangszeiten angegeben werden. Nach dem Setzen der Anforderung und dem Wechsel der Animationswiedergabe löscht der Node die Anforderung automatisch beim nächsten Prozessframe, indem er seinen ``transition_request``-Wert auf einen leeren String (``""``) setzt.
zh_tw: 非常簡單的狀態機（當您不想使用 ``StateMachine`` 節點時）。動畫可以連接到輸出，並且可以指定過渡時間。

source: BlendSpace2D
zh_tw: 二維混合空間

source: ``BlendSpace2D`` is a node to do advanced blending in two dimensions. Points are added to a two-dimensional space and then a position can be controlled to determine blending:
de: ``BlendSpace2D`` ist ein Node, der fortgeschrittenes Blending in zwei Dimensionen ermöglicht. Punkte werden zu einem zweidimensionalen Raum hinzugefügt und dann kann eine Position gesteuert werden, um das Blending zu bestimmen:
zh_tw: ``BlendSpace2D`` 是一個在二維空間進行高級混合的節點. 將點新增到一個二維空間, 然後可以控制位置來確定混合:

source: The ranges in X and Y can be controlled (and labeled for convenience). By default, points can be placed anywhere (right-click on the coordinate system or use the *add point* button) and triangles will be generated automatically using Delaunay.
de: Die Bereiche in X und Y können gesteuert (und der Einfachheit halber beschriftet) werden. Standardmäßig können Punkte an beliebiger Stelle platziert werden (klicken Sie mit der rechten Maustaste auf das Koordinatensystem oder verwenden Sie den Button *Punkt hinzufügen*) und Dreiecke werden automatisch unter Verwendung von Delaunay erzeugt.
zh_tw: 可以控制X和Y的範圍(為方便起見, 還可以標記它們). 預設情況下, 可以在任何位置放置點(只需按右鍵坐標系統或使用 *新增點* 按鈕)將自動生成德洛內三角形.

source: It is also possible to draw the triangles manually by disabling the *auto triangle* option, though this is rarely necessary:
de: Sie können die Dreiecke auch manuell zeichnen, indem Sie die Option *Automatisches Dreieck* deaktivieren, obwohl dies nur selten notwendig ist:
zh_tw: 也可以通過禁用 *自動三角形* 選項來手動繪製三角形, 雖然基本上沒必要這麼做:

source: Finally, it is possible to change the blend mode. By default, blending happens by interpolating points inside the closest triangle. When dealing with 2D animations (frame by frame), you may want to switch to *Discrete* mode. Alternatively, if you want to keep the current play position when switching between discrete animations, there is a *Carry* mode. This mode can be changed in the *Blend* menu:
de: Schließlich ist es möglich, den Blending-Modus zu ändern. Standardmäßig erfolgt Blending durch Interpolation von Punkten innerhalb des nächstgelegenen Dreiecks. Wenn Sie mit 2D-Animationen (Bild für Bild) arbeiten, sollten Sie in den Modus *Diskret* wechseln. Wenn Sie die aktuelle Abspielposition beibehalten möchten, wenn Sie zwischen diskreten Animationen wechseln, gibt es alternativ den Modus *Übernehmen*. Dieser Modus kann im Menü *Blending* geändert werden:
zh_tw: 最後, 可能會更改混合模式. 預設情況下, 混合是通過在最近的三角形內插點來實作的. 當處理二維動畫(逐影格)時, 您可能希望切換到 *離散* 模式. 此外, 如果您想在離散動畫之間切換時保持目前播放位置, 請使用 *進位元* 模式. 此模式可在 *混合* 功能表中更改:

source: BlendSpace1D
zh_tw: 一維混合空間

source: This is similar to 2D blend spaces, but in one dimension (so triangles are not needed).
de: Dies ist ähnlich wie bei 2D-Blending-Räumen, aber in einer Dimension (daher werden keine Dreiecke benötigt).
zh_tw: 這類似於二維混合空間, 但在一維空間中(所以不需要三角形).

source: StateMachine
zh_tw: 狀態機

source: This node acts as a state machine with root nodes as states. Root nodes can be created and connected via lines. States are connected via *Transitions*, which are connections with special properties. Transitions are uni-directional, but two can be used to connect in both directions.
de: Dieser Node fungiert als State Machine mit Root-Nodes als Zustände. Root-Nodes können erstellt und über Linien verbunden werden. Zustände werden über *Übergänge* verbunden, die Verbindungen mit speziellen Eigenschaften sind. Übergänge sind unidirektional, aber zwei können verwendet werden, um in beide Richtungen zu verbinden.
zh_tw: 這個節點是一個狀態機，根節點都是狀態。根節點可以建立並通過線路連接。狀態通過*轉換*連接，它們是具有特殊性質的連接。轉換是單向的，但是可以用兩個來達到雙向連接。

source: There are many types of transition:
de: Es gibt viele Arten von Übergängen:
zh_tw: Godot 沒有使用限制

source: *Immediate*: Will switch to the next state immediately. The current state will end and blend into the beginning of the new one.
de: *Sofort*: Wechselt sofort in den nächsten Zustand. Der aktuelle Zustand endet und geht in den Beginn des neuen Zustands über.
zh_tw: *Immediate*（立即）：將立即切換到下一個狀態。目前狀態將結束，並與新狀態的開頭相混合。

source: *Sync*: Will switch to the next state immediately, but will seek the new state to the playback position of the old state.
de: *Sync*: Wechselt sofort zum nächsten Zustand, sucht aber den neuen Zustand an der Abspielposition des alten Zustands.
zh_tw: *Sync*（同步）：立即切換到下一個狀態，但會將新狀態快進並到舊狀態的播放位置。

source: *At End*: Will wait for the current state playback to end, then switch to the beginning of the next state animation.
de: *Am Ende*: Wartet auf das Ende der Wiedergabe des aktuellen Zustands und schaltet dann auf den Beginn der Animation des nächsten Zustands um.
zh_tw: *At End*（末尾）：將等待目前狀態播放結束，然後切換到下一個狀態動畫的開頭。

source: Transitions also have a few properties. Click any transition and it will be displayed in the inspector dock:
de: Übergänge haben auch einige Propertys. Klicken Sie auf einen beliebigen Übergang und er wird im Inspektordock angezeigt:
zh_tw: 過渡也有一些屬性。按一下任何過渡，它就會顯示在“屬性面板”面板中：

source: *Switch Mode* is the transition type (see above), it can be modified after creation here.
de: *Switch-Modus* ist der Übergangstyp (siehe oben), der nach der Erstellung hier geändert werden kann.
zh_tw: *Switch Mode*（切換模式）為過渡型別（見上文），可以在此處建立後修改。

source: *Auto Advance* will turn on the transition automatically when this state is reached. This works best with the *At End* switch mode.
de: *Auto-Advance* schaltet den Übergang automatisch ein, wenn dieser Zustand erreicht wird. Dies funktioniert am besten mit dem Schaltermodus *Am Ende*.
zh_tw: *Auto Advance*（自動前進）當達到此狀態時將自動開啟轉換。最適合 *At End* 切換模式。

source: *Advance Condition* will turn on auto advance when this condition is set. This is a custom text field that can be filled with a variable name. The variable can be modified from code (more on this later).
de: *Advance-Bedingung* schaltet den Auto-Advance ein, wenn diese Bedingung erfüllt ist. Dies ist ein benutzerdefiniertes Textfeld, das mit einem Variablennamen gefüllt werden kann. Die Variable kann über den Code geändert werden (mehr dazu später).
zh_tw: *Advance Condition*（前進條件）會在條件成立時打開自動前進。這是一個可以用變數名填充的自訂文字欄位。可以從程式碼中修改變數（稍後將對此進行詳細介紹）。

source: *Xfade Time* is the time to cross-fade between this state and the next.
de: *Crossfade Time* ist die Zeit zum Cross-Fade zwischen diesem und dem nächsten Status.
zh_tw: *Xfade Time*（疊化時間）是在這個狀態和下一個狀態之間交叉漸變的時間。

source: *Priority* is used together with the ``travel()`` function from code (more on this later). Lower priority transitions are preferred when travelling through the tree.
de: *Priorität* wird zusammen mit der Funktion ``travel()`` aus dem Code verwendet (mehr dazu später). Übergänge mit niedrigerer Priorität werden beim Traveling des Baums bevorzugt.
zh_tw: *Priority*（優先順序）與程式碼中的 ``travel()`` 函式一起使用（後述）。當從一個狀態到另一個狀態時，會優先使用優先順序較低的過渡。

source: *Disabled* toggles disabling this transition (when disabled, it will not be used during travel or auto advance).
de: *Deaktiviert* schaltet diesen Übergang aus (wenn er deaktiviert ist, wird er während des Traveling oder während Auto Advance nicht verwendet).
zh_tw: *Disabled*（禁用）允許禁用此轉換（它不會在行程或自動前進期間使用）。

source: For better blending
de: Für besseres Blending
zh_tw: 為了更好的混合

source: In Godot 4.0+, in order for the blending results to be deterministic (reproducible and always consistent), the blended property values must have a specific initial value. For example, in the case of two animations to be blended, if one animation has a property track and the other does not, the blended animation is calculated as if the latter animation had a property track with the initial value.
de: Damit die Blending-Ergebnisse in Godot 4.0+ deterministisch (reproduzierbar und stets konsistent) sind, müssen die überblendeten Property-Werte einen bestimmten Anfangswert haben. Wenn z.B. zwei Animationen überblendet werden sollen und die eine Animation einen Property-Track hat und die andere nicht, wird die überblendete Animation so berechnet, als ob die letztere Animation einen Property-Track mit dem Anfangswert hätte.
zh_tw: 在 Godot 4.0+ 中，為了使混合結果具有確定性（可重現且始終一致），混合屬性值必須具有特定的初始值。例如，在要混合兩個動畫的情況下，如果一個動畫具有屬性軌跡而另一個動畫沒有，則計算混合動畫時就好像後一個動畫具有具有初始值的屬性軌跡一樣。

source: When using Position/Rotation/Scale 3D tracks for Skeleton3D bones, the initial value is Bone Rest. For other properties, the initial value is ``0`` and if the track is present in the ``RESET`` animation, the value of its first keyframe is used instead.
de: Bei der Verwendung von Positions/Rotations/Skalierungs-3D-Tracks für Skeleton3D-Knochen ist der Anfangswert Knochen-Standardpose. Für andere Propertys ist der Anfangswert ``0`` und wenn der Track in der ``RESET``-Animation vorhanden ist, wird stattdessen der Wert seines ersten Keyframes verwendet.
zh_tw: 當對 Skeleton3D 骨骼使用位置/旋轉/縮放 3D 軌跡時，初始值為 Bone Rest。對於其他屬性，初始值為“0”，如果軌道存在於“RESET”動畫中，則使用其第一個關鍵影格的值。

source: For example, the following AnimationPlayer has two animations, but one of them lacks a Property track for Position.
de: Der folgende AnimationPlayer hat z.B. zwei Animationen, aber in einer von ihnen fehlt ein Property-Track für Position.
zh_tw: 例如，下面的AnimationPlayer有兩個動畫，但其中一個缺少Position的Property軌道。
