Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/animation_tree.po
Languages: de, zh_tw

source: This means that the animation lacking that will treat those Positions as ``Vector2(0, 0)``.
de: Das bedeutet, dass die Animation ohne diese Positionen als ``Vector2(0, 0)`` behandelt wird.
zh_tw: 這意味著缺少的動畫會將這些位置視為「Vector2(0, 0)」。

source: This problem can be solved by adding a Property track for Position as an initial value to the ``RESET`` animation.
de: Dieses Problem kann gelöst werden, indem ein Property-Track für Position als Anfangswert der ``RESET``-Animation hinzugefügt wird.
zh_tw: 這個問題可以透過加入一個位置屬性軌跡作為「RESET」動畫的初始值來解決。

source: Be aware that the ``RESET`` animation exists to define the default pose when loading an object originally. It is assumed to have only one frame and is not expected to be played back using the timeline.
de: Beachten Sie, dass die ``RESET``-Animation existiert, um die Standard-Pose beim Laden des Objekts zu definieren. Es wird angenommen, dass diese nur einen Frame lang ist und nicht dazu gedacht ist, auf der Zeitachse abgespielt zu werden.
zh_tw: 請注意，「RESET」動畫的存在是為了定義最初載入物件時的預設姿勢。假設它只有一影格，並且預計不會使用時間軸進行播放。

source: Also keep in mind that the Rotation 3D tracks and the Property tracks for 2D rotation with Interpolation Type set to Linear Angle or Cubic Angle will prevent rotation of more than 180 degrees from the initial value as blended animation.
de: Beachten Sie auch, dass die Rotations-3D-Tracks, sowie Rotations-2D-Property-Tracks, deren Interpolationstyp auf Lineare Winkel oder Kubische Winkel eingestellt ist, eine Rotation um mehr als 180 Grad gegenüber dem Ausgangswert als Blending-Animation verhindern.
zh_tw: 另請記住，插值型別設定為線性角度或立方角的旋轉 3D 軌道和 2D 旋轉的屬性軌道將防止混合動畫從初始值旋轉超過 180 度。

source: This can be useful for Skeleton3Ds to prevent the bones penetrating the body when blending animations. Therefore, Skeleton3D's Bone Rest values should be as close to the midpoint of the movable range as possible. **This means that for humanoid models, it is preferable to import them in a T-pose**.
de: Dies kann für Skeleton3Ds nützlich sein, um zu verhindern, dass die Knochen beim Blending von Animationen in den Körper eindringen. Daher sollten die Skeleton3D-Werte für Knochen-Standardpose so nah wie möglich am Mittelpunkt des beweglichen Bereichs liegen. **Das bedeutet, dass es bei humanoiden Modellen besser ist, sie in einer T-Position zu importieren**.
zh_tw: 這對於 Skeleton3D 很有用，可以在混合動畫時防止骨頭穿透身體。因此，Skeleton3D 的 Bone Rest 值應盡可能接近可移動範圍的中點。 **這意味著對於人形模型，最好以 T 形姿勢匯入它們**。

source: You can see that the shortest rotation path from Bone Rests is prioritized rather than the shortest rotation path between animations.
de: Sie können sehen, dass der kürzeste Rotationspfad von Knochen-Standardposen gegenüber dem kürzesten Rotationspfad zwischen Animationen bevorzugt wird.
zh_tw: 您可以看到，優先考慮骨骼休息的最短旋轉路徑，而不是動畫之間的最短旋轉路徑。

source: If you need to rotate Skeleton3D itself more than 180 degrees by blend animations for movement, you can use Root Motion.
de: Wenn Sie Skeleton3D selbst um mehr als 180 Grad rotieren müssen, indem Sie Animationen für die Bewegung überblenden, können Sie Root-Bewegung verwenden.
zh_tw: 如果您需要透過混合動畫進行運動來將 Skeleton3D 本身旋轉超過 180 度，則可以使用 Root Motion。

source: Root motion
de: Root-Bewegung
zh_tw: 根骨骼運動

source: When working with 3D animations, a popular technique is for animators to use the root skeleton bone to give motion to the rest of the skeleton. This allows animating characters in a way where steps actually match the floor below. It also allows precise interaction with objects during cinematics.
de: Bei der Arbeit mit 3D-Animationen ist es eine beliebte Technik, den Root-Skelettknochen zu verwenden, um dem Rest des Skeletts Bewegung zu verleihen. Auf diese Weise können Charaktere so animiert werden, dass die Schritte tatsächlich dem Boden darunter entsprechen. Außerdem ermöglicht es eine präzise Interaktion mit Objekten während der Zwischensequenzen.
zh_tw: 處理 3D 動畫時，一種流行的技術是動畫師利用根骨骼為其餘部分骨骼製作運動動畫。這使得動畫角色的腳步與下面的地板相配對。並且允許在電影拍攝期間與物體進行精確的互動。

source: When playing back the animation in Godot, it is possible to select this bone as the *root motion track*. Doing so will cancel the bone transformation visually (the animation will stay in place).
de: Bei der Wiedergabe der Animation in Godot ist es möglich, diesen Knochen als *Root-Bewegungstrack* auszuwählen. Dadurch wird die Knochen-Transformation visuell aufgehoben (die Animation bleibt an ihrem Platz).
zh_tw: 在 Godot 中重播動畫時，可以選擇這根骨骼作為*根運動軌跡*。這會在視覺上取消這根骨骼的變換（動畫將保持原狀）。

source: Afterwards, the actual motion can be retrieved via the :ref:`AnimationTree <class_AnimationTree>` API as a transform:
de: Anschließend kann die eigentliche Bewegung über die :ref:`AnimationTree <class_AnimationTree>`-API als Transformation abgerufen werden:
zh_tw: 然後, 實際運動可以通過 :ref:`AnimationTree <class_AnimationTree>` API 作為轉換:

source: This can be fed to functions such as :ref:`CharacterBody3D.move_and_slide <class_CharacterBody3D_method_move_and_slide>` to control the character movement.
de: Dies kann an Funktionen wie :ref:`CharacterBody3D.move_and_slide <class_CharacterBody3D_method_move_and_slide>` weitergegeben werden, um die Bewegung des Charakters zu steuern.
zh_tw: 可以提供給 :ref:`KinematicBody.move_and_slide <class_KinematicBody_method_move_and_slide>` 等函式，用來控制角色移動。

source: There is also a tool node, ``RootMotionView``, that can be placed in a scene and will act as a custom floor for your character and animations (this node is disabled by default during the game).
de: Es gibt auch einen Tool-Node, ``RootMotionView``, der in einer Szene platziert werden kann und als benutzerdefinierter Boden für Ihren Charakter und Ihre Animationen fungiert (dieser Node ist während des Spiels standardmäßig deaktiviert).
zh_tw: 還有一個名為 ``RootMotionView`` 的工具節點，可以放置在場景中，作為你的角色和動畫的自訂地板（這個節點預設在遊戲期間禁用）。

source: Controlling from code
de: Steuern aus dem Code heraus
zh_tw: 使用程式碼控制

source: After building the tree and previewing it, the only question remaining is "How is all this controlled from code?".
de: Nachdem der Baum erstellt und in der Vorschau angezeigt wurde, bleibt nur noch die Frage: "Wie wird das alles vom Code aus gesteuert?".
zh_tw: 建立樹和預覽之後，只剩下一個問題：“如何使用程式碼控制所有的節點？”。

source: Keep in mind that the animation nodes are just resources and, as such, they are shared between all instances using them. Setting values in the nodes directly will affect all instances of the scene that uses this ``AnimationTree``. This is generally undesirable, but does have some cool use cases, e.g. you can copy and paste parts of your animation tree, or reuse nodes with a complex layout (such as a state machine or blend space) in different animation trees.
de: Beachten Sie, dass die Animation-Nodes nur Ressourcen sind und als solche von allen Instanzen, die sie benutzen, gemeinsam genutzt werden. Das direkte Setzen von Werten in den Nodes wirkt sich auf alle Instanzen der Szene aus, die diesen ``AnimationTree`` verwenden. Dies ist im Allgemeinen nicht wünschenswert, hat aber einige coole Anwendungsfälle, z.B. können Sie Teile Ihres Animationsbaums kopieren und einfügen, oder Nodes mit einem komplexen Layout (wie z.B. eine State Machine oder ein Blending-Space) in verschiedenen Animationsbäumen wiederverwenden.
zh_tw: 要注意動畫節點就是資源，因此他們會在所有使用他們的實例之間共用。直接修改節點中的值，將會影響到場景中所有使用這個 ``AnimationTree`` 的實例。通常是不希望這樣的，不過也有一些不錯的用法，比如你可以複製貼上你的動畫樹的一部分，或者在不同的動畫樹中複用具有複雜佈局的節點（例如狀態機和混合樹）。

source: The actual animation data is contained in the ``AnimationTree`` node and is accessed via properties. Check the "Parameters" section of the ``AnimationTree`` node to see all the parameters that can be modified in real-time:
de: Die eigentlichen Animationsdaten sind im ``AnimationTree``-Node enthalten und werden über Propertys angesprochen. Im Abschnitt "Parameter" des Nodes ``AnimationTree`` finden Sie alle Parameter, die in Echtzeit geändert werden können:
zh_tw: 實際的動畫封包含在 ``AnimationTree`` 節點中, 並通過屬性存取. 檢查 ``AnimationTree`` 節點的 "參數" 部分, 查看所有可以即時修改的參數:

source: This is handy because it makes it possible to animate them from an ``AnimationPlayer``, or even the ``AnimationTree`` itself, allowing the realization of very complex animation logic.
de: Das ist praktisch, weil es möglich ist, sie von einem ``AnimationPlayer`` aus zu animieren, oder sogar vom ``AnimationTree`` selbst, was die Realisierung sehr komplexer Animationslogik erlaubt.
zh_tw: 這很方便, 因為它可以通過 ``AnimationPlayer`` 獲得動畫效果, 甚至是 ``AnimationTree`` 本身, 允許實作非常複雜的動畫邏輯.

source: To modify these values from code, the property path must be obtained. This is done easily by hovering the mouse over any of the parameters:
de: Um diese Werte vom Code aus zu ändern, muss der Property-Pfad ermittelt werden. Dies geschieht ganz einfach, indem Sie den Mauszeiger über einen der Parameter bewegen:
zh_tw: 想要通過程式碼修改這些值, 必須獲得該屬性的路徑. 這是很容易做到的, 把滑鼠懸停在任何參數:

source: Which allows setting them or reading them:
de: Dadurch können sie eingestellt oder gelesen werden:
zh_tw: 允許設定或讀取它們:

source: State machine travel
de: Traveling der State Machine
zh_tw: 狀態機行程

source: One of the nice features in Godot's ``StateMachine`` implementation is the ability to travel. The graph can be instructed to go from the current state to another one, while visiting all the intermediate ones. This is done via the A\* algorithm. If there is no path of transitions starting at the current state and finishing at the destination state, the graph teleports to the destination state.
de: Eines der netten Features in Godots ``StateMachine``-Implementierung ist die Fähigkeit zu durchlaufen (traveling). Der Graph kann angewiesen werden, vom aktuellen Zustand in einen anderen zu gehen und dabei alle Zwischenzustände zu besuchen. Dies geschieht über den A\*-Algorithmus. Wenn es keinen Pfad von Übergängen gibt, der im aktuellen Zustand beginnt und im Zielzustand endet, teleportiert der Graph in den Zielzustand.
zh_tw: Godot的“StateMachine”實現中一個不錯的功能是旅行的能力。可以指示圖形從當前狀態轉到另一個狀態，同時訪問所有中間狀態。這是通過 A\* 演算法完成的。如果沒有從當前狀態開始到目標狀態結束的轉換路徑，則圖形將傳送到目標狀態。

source: To use the travel ability, you should first retrieve the :ref:`AnimationNodeStateMachinePlayback <class_AnimationNodeStateMachinePlayback>` object from the ``AnimationTree`` node (it is exported as a property).
de: Um die Traveling-Fähigkeit zu nutzen, sollten Sie zuerst das :ref:`AnimationNodeStateMachinePlayback <class_AnimationNodeStateMachinePlayback>`-Objekt vom Node ``AnimationTree`` abrufen (es wird als Property exportiert).
zh_tw: 要使用行程能力, 您應該首先從 ``AnimationTree`` 節點中檢索 :ref:`AnimationNodeStateMachinePlayback <class_AnimationNodeStateMachinePlayback>` 物件(其被匯出為一個屬性).

source: Once retrieved, it can be used by calling one of the many functions it offers:
de: Einmal abgerufen, kann es verwendet werden, indem Sie eine der vielen angebotenen Funktionen aufrufen:
zh_tw: 一旦檢索到, 可以呼叫它提供的許多函式之一:

source: The state machine must be running before you can travel. Make sure to either call ``start()`` or choose a node to **Autoplay on Load**.
de: Die State Machine muss laufen, bevor Sie Traveling verwenden können. Stellen Sie sicher, dass Sie entweder ``start()`` aufrufen oder einen Node für **Autoplay beim Laden** auswählen.
zh_tw: 狀態機必須正在運作才能使用行程能力。確保呼叫 ``start()`` 或選擇一個節點以**在載入時自動播放**。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
