Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: de, zh_cn, zh_tw

source: Creating movies
de: Filme erstellen
zh_cn: 创建电影
zh_tw: 建立節點

source: Godot can record **non-real-time** video and audio from any 2D or 3D project. This kind of recording is also called *offline rendering*. There are many scenarios where this is useful:
de: Godot kann **Nicht-Echtzeit** Video und Audio von jedem 2D- oder 3D-Projekt aufzeichnen. Diese Art der Aufzeichnung wird auch als *Offline-Rendering* bezeichnet. Es gibt viele Szenarien, in denen dies nützlich ist:
zh_cn: Godot 可以为任何 2D 或 3D 项目录制\ **非实时**\ 音视频。这种录制也叫\ *离线渲染*\ 。适合很多不同的场景：
zh_tw: Godot 可以為任何 2D 或 3D 專案錄製**非即時**音影片。這種錄製也叫*離線算繪*。適合很多不同的場景：

source: Recording game trailers for promotional use.
de: Aufnahme von Spieltrailern für Werbezwecke.
zh_cn: 录制游戏预告片以供宣传使用。
zh_tw: 錄製遊戲預告片以供促銷使用。

source: Recording cutscenes that will be :ref:`displayed as pre-recorded videos <doc_playing_videos>` in the final game. This allows for using higher quality settings (at the cost of file size), regardless of the player's hardware.
de: Aufzeichnen von Zwischensequenzen, die im fertigen Spiel :ref:`als voraufgezeichnete Videos <doc_playing_videos>` angezeigt werden. Dies ermöglicht die Verwendung höherer Qualitätseinstellungen (auf Kosten der Dateigröße), unabhängig von der Hardware des Spielers.
zh_cn: 录制过场动画，这些过场动画将在最终游戏中 :ref:`以预先录制的视频形式展现 <doc_playing_videos>`。这会在不管播放器硬件水平如何的情况下，允许使用更高质量的设置（以文件大小为代价）。
zh_tw: 錄製過場動畫，這些過場動畫將在最終遊戲中顯示為預先錄製的影片 <doc_playing_videos>`。這允許使用更高品質的設定（以檔案大小為代價），而不管播放器的硬體如何。

source: Recording procedurally generated animations or motion design. User interaction remains possible during video recording, and audio can be included as well (although you won't be able to hear it while the video is recording).
de: Aufzeichnung von prozedural generierten Animationen oder Motion Design. Während der Videoaufzeichnung ist eine Benutzerinteraktion weiterhin möglich, und auch Audio kann aufgenommen werden (obwohl Sie es während der Videoaufzeichnung nicht hören können).
zh_cn: 记录程序生成的动画或动作设计。在视频录制过程中，仍可以进行用户交互，录制的视频中也可以包含音频（尽管在录制视频时你将无法听到它）。
zh_tw: 記錄程式產生的動畫或動作設計。在視訊錄製期間仍然可以進行使用者互動，並且也可以包含音訊（儘管在視訊錄製時您將聽不到）。

source: Comparing the visual output of graphics settings, shaders, or rendering techniques in an animated scene.
de: Vergleich der visuellen Ausgabe von Grafikeinstellungen, Shadern oder Rendering-Methoden in einer animierten Szene.
zh_cn: 比较动画场景中图形设置、着色器或渲染技术的视觉输出。
zh_tw: 比較動畫場景中圖形設定、著色器或算繪技術的視覺輸出。

source: With Godot's animation features such as the AnimationPlayer node, Tweeners, particles and shaders, it can effectively be used to create any kind of 2D and 3D animations (and still images).
de: Mit den Godot-Animationsfunktionen wie dem AnimationPlayer-Node, Tweenern, Partikeln und Shadern können Sie jede Art von 2D- und 3D-Animationen (und Standbildern) effektiv erstellen.
zh_cn: 借助 Godot 的动画功能，例如 AnimationPlayer 节点、Tweeners、粒子和着色器，它可以有效地用于创建任何类型的 2D 和 3D 动画（以及静态图像）。
zh_tw: 借助 Godot 的動畫功能，例如 AnimationPlayer 節點、Tweeners、粒子和著色器，它可以有效地用於建立任何型別的 2D 和 3D 動畫（以及圖像）。

source: If you are already used to Godot's workflow, you may find yourself more productive by using Godot for video rendering compared to Blender. That said, renderers designed for non-real-time usage such as Cycles and Eevee can result in better visuals (at the cost of longer rendering times).
de: Wenn Sie sich bereits an den Arbeitsablauf von Godot gewöhnt haben, können Sie mit Godot für das Rendering von Videos produktiver sein als mit Blender. Abgesehen davon können Renderer, die für die Nicht-Echtzeit-Nutzung entwickelt wurden, wie Cycles und Eevee, zu besseren Bildern führen (auf Kosten längerer Rendering-Zeiten).
zh_cn: 如果你已经习惯了 Godot 的工作流程，你可能会发现使用 Godot 进行视频渲染会比 Blender 更加高效。 也就是说，非实时渲染器（例如 Cycles 和 Eevee）可以带来更好的视觉效果（代价是更长的渲染时间）。
zh_tw: 如果您已經習慣了 Godot 的工作流程，您可能會發現使用 Godot 進行影片算繪會比 Blender 更加高效。 也就是說，非即時算繪器（例如 Cycles 和 Eevee）可以帶來更好的視覺效果（代價是更長的算繪時間）。

source: Compared to real-time video recording, some advantages of non-real-time recording include:
de: Im Vergleich zur Videoaufzeichnung in Echtzeit bietet die Aufzeichnung in Nicht-Echtzeit einige Vorteile:
zh_cn: 与实时视频录像相比，非实时录像的一些优点包括：
zh_tw: 與即時錄影相比，非即時錄影的一些優點包括：

source: Use any graphics settings (including extremely demanding settings) regardless of your hardware's capabilities. The output video will *always* have perfect frame pacing; it will never exhibit dropped frames or stuttering. Faster hardware will allow you to render a given animation in less time, but the visual output remains identical.
de: Verwenden Sie alle Grafikeinstellungen (einschließlich extrem anspruchsvoller Einstellungen), unabhängig von den Möglichkeiten Ihrer Hardware. Das ausgegebene Video hat *immer* einen perfekten Bildrhythmus; es wird niemals unterbrochene Bilder oder Stutter aufweisen. Mit schnellerer Hardware können Sie eine bestimmte Animation in kürzerer Zeit rendern, aber die visuelle Ausgabe bleibt identisch.
zh_cn: 无论你的硬件性能如何，都可以使用任何图形设置（包括要求极高的设置）。输出视频 *始终* 具有完美的帧节奏；它永远不会出现丢帧或卡顿的情况。更快的硬件将允许你在更短的时间内渲染给定的动画，而视觉输出保持不变。
zh_tw: 無論您的硬體功能為何，都可以使用任何圖形設定（包括極高要求的設定）。輸出影片*始終*具有完美的影格節奏；它永遠不會出現丟影格或卡頓的情況。更快的硬體將允許您在更短的時間內算繪給定的動畫，但視覺輸出保持不變。

source: Render at a higher resolution than the screen resolution, without having to rely on driver-specific tools such as NVIDIA's Dynamic Super Resolution or AMD's Virtual Super Resolution.
de: Rendern Sie mit einer höheren Auflösung als der Bildschirmauflösung, ohne auf treiberspezifische Tools wie NVIDIAs Dynamic Super Resolution oder AMDs Virtual Super Resolution zurückgreifen zu müssen.
zh_cn: 以比屏幕分辨率更高的分辨率进行渲染，而无需依赖特定于驱动程序的工具，例如 NVIDIA 的动态超级分辨率（Dynamic Super Resolution）或 AMD 的虚拟超级分辨率（Virtual Super Resolution）。
zh_tw: 以比螢幕解析度更高的解析度進行算繪，而無需依賴特定於驅動程式的工具，例如 NVIDIA 的動態超級解析度或 AMD 的虛擬超級解析度。

source: Render at a higher framerate than the video's target framerate, then :ref:`post-process to generate high-quality motion blur <doc_creating_movies_motion_blur>`. This also makes effects that converge over several frames (such as temporal antialiasing, SDFGI and volumetric fog) look better.
de: Rendern Sie mit einer höheren Framerate als der Ziel-Framerate des Videos und erzeugen Sie dann :ref:`durch Nachbearbeitung eine qualitativ hochwertige Bewegungsunschärfe <doc_creating_movies_motion_blur>`. Dies lässt auch Effekte, die über mehrere Frames konvergieren (wie temporales Antialiasing, SDFGI und volumetrischer Nebel) besser aussehen.
zh_cn: 以高于视频目标帧率的帧率进行渲染，然后进行 :ref:`后处理以生成高质量的运动模糊 <doc_creating_movies_motion_blur>`。这也使得在多个帧上聚合的效果（例如时间抗锯齿、SDFGI 和体积雾）看起来更好。
zh_tw: 以高於視訊目標影格率的影格率進行算繪，然後進行後處理以產生高品質的運動模糊 <doc_creating_movies_motion_blur>`。這也使得在多個影格上聚合的效果（例如時間抗鋸齒、SDFGI 和體積霧）看起來更好。

source: **This feature is not designed for capturing real-time footage during gameplay.**
de: **Dieses Feature ist nicht für die Aufnahme von Echtzeit-Filmmaterial während des Spiels gedacht.**
zh_cn: **此功能并非专为在游戏中捕捉实时镜头而设计。**
zh_tw: **此功能並非專為在遊戲過程中捕捉即時鏡頭而設計。**

source: Players should use something like `OBS Studio <https://obsproject.com/>`__ or `SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ to record gameplay videos, as they do a much better job at intercepting the compositor than Godot can do using Vulkan or OpenGL natively.
de: Spieler sollten etwas wie `OBS Studio <https://obsproject.com/>`__ oder `SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ verwenden, um Gameplay-Videos aufzunehmen, da sie den Compositor viel besser abfangen, als Godot es mit Vulkan oder OpenGL nativ kann.
zh_cn: 玩家应该使用`OBS Studio <https://obsproject.com/>`__ 或`SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ 之类的工具来录制游戏视频，因为它们可以更好地截取合成器的输出，比 Godot 使用 Vulkan 或 OpenGL 所能完成的工作要多。
zh_tw: 玩家應該使用`OBS Studio <https://obsproject.com/>`__或`SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__之類的東西來錄製遊戲影片，因為它們做得更好的攔截合成器工作比 Godot 本身使用 Vulkan 或 OpenGL 所能完成的工作還要多。

source: That said, if your game runs at near-real-time speeds when capturing, you can still use this feature (but it will lack audible sound playback, as sound is saved directly to the video file).
de: Wenn Ihr Spiel bei der Aufnahme nahezu in Echtzeit läuft, können Sie dieses Feature dennoch nutzen (allerdings fehlt dann die Tonwiedergabe, da der Ton direkt in der Videodatei gespeichert wird).
zh_cn: 也就是说，如果你的游戏在录制时以接近实时的速度运行，你仍可以使用此功能（但它将缺少可被听见的音频播放，因为音频会直接保存到视频文件中）。
zh_tw: 也就是說，如果您的遊戲在捕獲時以接近即時的速度運作，您仍然可以使用此功能（但它將缺乏可聽見的聲音播放，因為聲音直接保存到視訊檔案中）。

source: Enabling Movie Maker mode
de: Aktivieren des Movie Maker-Modus
zh_cn: 启用 Movie Maker 模式
zh_tw: 啟用電影製作模式

source: To enable Movie Maker mode, click the "movie reel" button in the top-right corner of the editor *before* running the project:
de: Um den Movie Maker-Modus zu aktivieren, klicken Sie auf den Button mit der Filmspule in der oberen rechten Ecke des Editors, *bevor* Sie das Projekt starten:
zh_cn: 要启用 Movie Maker 模式，请在 *运行项目之前* 单击编辑器右上角的“电影胶片卷”（movie reel）按钮：
zh_tw: 若要啟用 Movie Maker 模式，請在*運作專案之前*點擊編輯器右上角的「電影捲軸」按鈕：

source: Movie Maker mode is disabled, click the "movie reel" icon to enable
de: Wenn der Movie Maker-Modus deaktiviert ist, klicken Sie auf das Filmspulen-Icon, um ihn zu aktivieren
zh_cn: Movie Maker 模式已禁用时，单击“电影胶片卷”图标即可启用
zh_tw: Movie Maker 模式已停用，點擊「電影捲軸」圖示即可啟用

source: The icon gets a background matching the accent color when Movie Maker mode is enabled:
de: Das Icon erhält einen Hintergrund in der Akzentfarbe, wenn der Movie Maker-Modus aktiviert ist:
zh_cn: 当启用 Movie Maker 模式时，图标的背景会与强调色相匹配：
zh_tw: 當啟用 Movie Maker 模式時，圖示的背景會與強調色相符：

source: Movie Maker mode is enabled, click the "movie reel" icon again to disable
de: Wenn der Movie Maker-Modus aktiviert ist, klicken Sie erneut auf das Filmspulen-Icon, um ihn zu deaktivieren
zh_cn: Movie Maker 模式启动后，再次点击“电影胶片卷”图标关闭
zh_tw: Movie Maker 模式啟動後，再次點擊“movie reel”圖示關閉

source: Movie Maker status is **not** persisted when the editor quits, so you must re-enable Movie Maker mode again after restarting the editor if needed.
de: Der Movie Maker-Status wird **nicht** beibehalten, wenn der Editor beendet wird, so dass Sie den Movie Maker-Modus bei Bedarf nach dem Neustart des Editors erneut aktivieren müssen.
zh_cn: 当编辑器退出时，Movie Maker 状态 **不会** 保留，因此如果需要，你必须在重新启动编辑器后再次重新启用 Movie Maker 模式。
zh_tw: 當編輯器退出時，Movie Maker 狀態**不會**保留，因此如果需要，您必須在重新啟動編輯器後再次重新啟用 Movie Maker 模式。

source: Toggling Movie Maker mode while running the project will not have any effect until the project is restarted.
de: Wenn Sie den Movie Maker-Modus ein- oder ausschalten, während das Projekt läuft, hat dies keine Auswirkungen, bis das Projekt neu gestartet wird.
zh_cn: 在项目重新启动之前，运行项目时切换 Movie Maker 模式不会产生任何效果。
zh_tw: 在專案重新啟動之前，執行專案時切換 Movie Maker 模式不會產生任何效果。

source: Before you can record video by running the project, you still need to configure the output file path. This path can be set for all scenes in the Project Settings:
de: Bevor Sie ein Video aufnehmen können, indem Sie das Projekt ausführen, müssen Sie noch den Pfad der Ausgabedatei konfigurieren. Dieser Pfad kann für alle Szenen in den Projekteinstellungen festgelegt werden:
zh_cn: 在通过运行项目录制视频之前，仍然需要配置输出文件路径。可以在项目设置中为所有场景设置该路径：
zh_tw: 在透過執行專案錄製影片之前，您仍然需要配置輸出檔案路徑。可以在Project Settings中為所有場景設定該路徑：

source: Movie Maker project settings (with Advanced toggle enabled)
de: Movie Maker-Projekteinstellungen (mit aktivierter Option "Erweitert")
zh_cn: Movie Maker 项目设置（启用高级选项）
zh_tw: Movie Maker 專案設定（啟用進階切換）

source: Alternatively, you can set the output file path on a per-scene basis by adding a String metadata with the name ``movie_file`` to the scene's **root node**. This is only used when the main scene is set to the scene in question, or when running the scene directly by pressing :kbd:`F6` (:kbd:`Cmd + R` on macOS).
de: Alternativ können Sie den Pfad der Ausgabedatei für jede Szene festlegen, indem Sie String-Metadaten mit dem Namen ``movie_file`` zum **Root-Node** der Szene hinzufügen. Dies wird nur verwendet, wenn die Hauptszene auf die betreffende Szene eingestellt ist, oder wenn die Szene direkt durch Drücken von :kbd:`F6` (:kbd:`Cmd + R` unter macOS) gestartet wird.
zh_cn: 或者，你可以通过将名为 ``movie_file`` 的 String 元数据添加到场景的 **根节点** ，来设置每个场景的输出文件路径。仅当主场景设置为相关场景时，或者通过按 :kbd:`F6`（在 macOS 上 :kbd:`Cmd + R`）直接运行场景时，该功能才会被使用。
zh_tw: 或者，您可以透過將名為「movie_file」的字串元資料新增至場景的**根節點**來設定每個場景的輸出檔案路徑。只有當主場景設定為相關場景時，或按下:kbd:`F6` （在 macOS 上:kbd:`Cmd + R`）直接執行場景時，才會使用此功能。

source: Inspector view after creating a ``movie_file`` metadata of type String
de: Inspektor-Ansicht nach dem Erstellen von ``movie_file``-Metadaten vom Typ String
zh_cn: 创建 String 类型的 ``movie_file`` 元数据后的检查器视图
zh_tw: 建立字串型別的「movie_file」元資料後的屬性面板視圖

source: The path specified in the project settings or metadata can be either absolute, or relative to the project root.
de: Der in den Projekteinstellungen oder Metadaten angegebene Pfad kann entweder absolut oder relativ zum Root des Projekts sein.
zh_cn: 项目设置或元数据中指定的路径可以是绝对路径，也可以是相对于项目根目录的路径。
zh_tw: 專案設定或元資料中指定的路徑可以是絕對路徑，也可以是相對於專案根目錄的路徑。

source: Once you've configured and enabled Movie Maker mode, it will be automatically used when running the project from the editor.
de: Sobald Sie den Movie Maker-Modus konfiguriert und aktiviert haben, wird er automatisch verwendet, wenn Sie das Projekt im Editor ausführen.
zh_cn: 在配置并启用 Movie Maker 模式后，从编辑器运行项目时将自动使用该模式。
zh_tw: 配置並啟用 Movie Maker 模式後，從編輯器執行專案時將自動使用該模式。

source: Command line usage
de: Nutzung der Kommandozeile
zh_cn: 命令行用法
zh_tw: 命令行教學

source: Movie Maker can also be enabled from the :ref:`command line <doc_command_line_tutorial>`:
de: Movie Maker kann auch über die :ref:`Kommandozeile <doc_command_line_tutorial>` aktiviert werden:
zh_cn: Movie Maker 也可以通过\ :ref:`命令行 <doc_command_line_tutorial>`\ 启用：
zh_tw: 更多有關命令行參數的資訊，請參考 :ref:`命令行教學 <doc_command_line_tutorial>` 。

source: If the output path is relative, then it is **relative to the project folder**, not the current working directory. In the above example, the file will be written to ``/path/to/your_project/output.avi``. This behavior is similar to the ``--export`` command line argument.
de: Wenn der Ausgabepfad relativ ist, dann ist er **relativ zum Projektordner**, nicht zum aktuellen Arbeitsverzeichnis. Im obigen Beispiel wird die Datei nach ``/pfad/zu/ihrem_projekt/output.avi`` geschrieben. Dieses Verhalten ist vergleichbar mit dem Kommandozeilenargument ``--export``.
zh_cn: 如果输出路径是相对路径，那么它是 **相对于项目文件夹** ，而不是当前工作目录。在上面的示例中，文件将被写入 ``/path/to/your_project/output.avi`` 。此行为类似于 ``--export`` 命令行参数。
zh_tw: 如果輸出路徑是相對的，那麼它是**相對於專案資料夾**，而不是目前工作目錄。在上面的範例中，檔案將被寫入“/path/to/your_project/output.avi”。此行為類似於“--export”命令列參數。

source: Since Movie Maker's output resolution is set by the viewport size, you can adjust the window size on startup to override it if the project uses the ``disabled`` or ``canvas_items`` :ref:`stretch mode <doc_multiple_resolutions>`:
de: Da die Ausgabeauflösung von Movie Maker durch die Größe des Viewports bestimmt wird, können Sie die Fenstergröße beim Start anpassen, um sie zu überschreiben, wenn das Projekt den Modus ``disabled`` oder ``canvas_items`` :ref:`Stretch-Mode <doc_multiple_resolutions>` verwendet:
zh_cn: 由于 Movie Maker 的输出分辨率是由视口大小设置的，因此如果项目使用 ``disabled`` 或 ``canvas_items`` :ref:`拉伸模式 <doc_multiple_resolutions>`，你可以在启动时调整窗口大小以覆盖它：
zh_tw: 由於 Movie Maker 的輸出解析度是由視窗大小設定的，因此如果專案使用「disabled」或「canvas_items」:ref:`拉伸模式 <doc_multiple_analysis>`，您可以在啟動時調整視窗大小以覆蓋它：

source: Note that the window size is clamped by your display's resolution. See :ref:`doc_creating_movies_recording_at_higher_resolution` if you need to record a video at a higher resolution than the screen resolution.
de: Beachten Sie, dass die Fenstergröße von der Auflösung Ihres Bildschirms abhängt. Siehe :ref:`doc_creating_movies_recording_at_higher_resolution`, wenn Sie ein Video mit einer höheren Auflösung als der Bildschirmauflösung aufnehmen möchten.
zh_cn: 请注意，窗口大小受显示器分辨率的限制。如果你需要以比屏幕分辨率更高的分辨率录制视频，请参阅 :ref:`doc_creating_movies_recording_at_higher_resolution`。
zh_tw: 請注意，視窗大小受顯示器解析度的限制。如果您需要以比螢幕解析度更高的解析度錄製影片，請參閱 doc_creating_movies_recording_at_higher_resolution`。

source: The recording FPS can also be overridden on the command line, without having to edit the Project Settings:
de: Die Aufnahme-FPS können auch über die Befehlszeile überschrieben werden, ohne dass die Projekteinstellungen bearbeitet werden müssen:
zh_cn: 录制的 FPS 也可以在命令行上覆盖，而无需编辑项目设置：
zh_tw: 錄製 FPS 也可以在命令列上覆蓋，而無需編輯專案設定：

source: The ``--write-movie`` and ``--fixed-fps`` command line arguments are both available in exported projects. Movie Maker mode cannot be toggled while the project is running, but you can use the :ref:`OS.execute() <class_OS_method_execute>` method to run a second instance of the exported project that will record a video file.
de: Die Kommandozeilenargumente ``--write-movie`` und ``--fixed-fps`` sind beide in exportierten Projekten verfügbar. Der Movie Maker-Modus kann nicht ein- oder ausgeschaltet werden, während das Projekt läuft, aber Sie können die Methode :ref:`OS.execute() <class_OS_method_execute>` verwenden, um eine zweite Instanz des exportierten Projekts zu starten, die eine Videodatei aufnimmt.
zh_cn: ``--write-movie`` 和 ``--fixed-fps`` 命令行参数在导出的项目中都可用。项目运行时无法切换 Movie Maker 模式，但可以使用 :ref:`OS.execute() <class_OS_method_execute>` 方法来运行导出项目的第二个实例以录制视频文件。
zh_tw: “--write-movie” 和 “--fixed-fps” 命令列參數在匯出的專案中都可使用。專案執行時間無法切換 Movie Maker 模式，但您可以使用 OS.execute() <class_OS_method_execute>` 方法執行匯出專案的第二個實例來錄製影片檔案。

source: Choosing an output format
de: Auswahl eines Ausgabeformats
zh_cn: 选择输出格式
zh_tw: 選擇動畫

source: Output formats are provided by the :ref:`MovieWriter <class_MovieWriter>` class. Godot has 2 built-in :ref:`MovieWriters <class_MovieWriter>`, and more can be implemented by extensions:
de: Die Ausgabeformate werden von der Klasse :ref:`MovieWriter <class_MovieWriter>` bereitgestellt. Godot hat 2 Built-in-:ref:`MovieWriters <class_MovieWriter>`, und weitere können durch Extensions implementiert werden:
zh_cn: 输出格式由 :ref:`MovieWriter <class_MovieWriter>` 类提供。 Godot 有 2 个内置的 :ref:`MovieWriter <class_MovieWriter>`，更多格式可以通过扩展来实现：
zh_tw: 輸出格式由:ref:`MovieWriter <class_MovieWriter>` 類別提供。 Godot 有 2 個內建的 MovieWriters <class_MovieWriter>`，更多可以透過擴充來實作：

source: AVI (recommended)
de: AVI (empfohlen)
zh_cn: AVI（推荐）
zh_tw: glTF 2.0 **(推薦)** 。

source: AVI container with MJPEG for video and uncompressed audio. Features lossy video compression, resulting in medium file sizes and fast encoding. The lossy compression quality can be adjusted by changing **Editor > Movie Writer > MJPEG Quality**.
de: AVI-Container mit MJPEG für Video und unkomprimiertem Audio. Verfügt über verlustbehaftete Videokomprimierung, was zu mittleren Dateigrößen und schneller Kodierung führt. Die verlustbehaftete Komprimierungsqualität kann durch Ändern von **Editor > Movie Writer > MJPEG-Qualität** angepasst werden.
zh_cn: 带有 MJPEG 的 AVI 容器，用于视频和未压缩的音频。具有有损视频压缩功能，可实现中等文件大小和快速编码。有损压缩质量可以通过更改 **编辑器 > Movie Writer > MJPEG 质量** 来调整。
zh_tw: 帶有 MJPEG 的 AVI 容器，用於視訊和未壓縮的音訊。具有有損視訊壓縮功能，可實作中等檔案大小和快速編碼。有損壓縮品質可以透過更改 **Editor > Movie Writer > MJPEG Quality** 來調整。

source: The resulting file can be viewed in most video players, but it must be converted to another format for viewing on the web or by Godot with the VideoStreamPlayer node. MJPEG does not support transparency. AVI output is currently limited to a file of 4 GB in size at most.
de: Die resultierende Datei kann in den meisten Videoplayern angezeigt werden, muss aber in ein anderes Format konvertiert werden, um im Internet oder von Godot mit dem VideoStreamPlayer-Node angezeigt zu werden. MJPEG unterstützt keine Transparenz. Die AVI-Ausgabe ist derzeit auf eine Dateigröße von maximal 4 GB beschränkt.
zh_cn: 生成的文件可以在大多数视频播放器中查看，但必须将其转换为另一种格式才能在 Web 上查看，或在 Godot 使用 VideoStreamPlayer 节点查看。 MJPEG 不支持透明度。 AVI 输出的文件大小目前限制为最大 4 GB。
zh_tw: 產生的檔案可以在大多數視訊播放器中查看，但必須將其轉換為另一種格式才能在 Web 上查看或由 Godot 使用 VideoStreamPlayer 節點查看。 MJPEG 不支援透明度。 AVI 輸出目前限制為最大 4 GB 的檔案大小。

source: To use AVI, specify a path to an ``.avi`` file to be created in the **Editor > Movie Writer > Movie File** project setting.
de: Um AVI zu verwenden, geben Sie in der Projekteinstellung **Editor > Movie Writer > Movie-Datei** einen Pfad zu einer zu erstellenden ``.avi``-Datei an.
zh_cn: 要使用 AVI，请指定要在 **编辑器 > Movie Writer > 电影文件** 项目设置中创建的 ``.avi`` 文件的路径。
zh_tw: 若要使用 AVI，請指定要在 **Editor > Movie Writer > Movie File** 專案設定中建立的 ``.avi`` 檔案的路徑。

source: PNG image sequence for video and WAV for audio. Features lossless video compression, at the cost of large file sizes and slow encoding. This is designed to be :ref:`encoded to a video file with an external tool after recording <doc_creating_movies_converting_avi>`.
de: PNG-Bildsequenz für Video und WAV für Audio. Verfügt über eine verlustfreie Videokomprimierung, allerdings zum Preis einer großen Dateigröße und einer langsamen Kodierung. Dies ist für die :ref:`Codierung in eine Videodatei mit einem externen Tool nach der Aufnahme von <doc_creating_movies_converting_avi>` gedacht.
zh_cn: 用于视频的 PNG 图像序列和用于音频的 WAV 图像序列。具有无损视频压缩功能，但代价是文件较大且编码速度较慢。这被设计为 :ref:`录制后使用外部工具编码为视频文件 <doc_creating_movies_converting_avi>`。
zh_tw: 用於視訊的 PNG 影像序列和用於音訊的 WAV 影像序列。具有無損視訊壓縮功能，但代價是檔案較大且編碼速度較慢。這被設計為在錄製 <doc_creating_movies_converting_avi> 後使用外部工具編碼為視訊檔案。

source: Transparency is supported, but the root viewport **must** have its ``transparent_bg`` property set to ``true`` for transparency to be visible on the output image. This can be achieved by enabling the **Rendering > Transparent Background** advanced project setting. **Display > Window > Size > Transparent** and **Display > Window > Per Pixel Transparency > Enabled** can optionally be enabled to allow transparency to be previewed while recording the video, but they do not have to be enabled for the output image to contain transparency.
de: Transparenz wird unterstützt, aber der Root-Viewport **muss** seine Property ``transparent_bg`` auf ``true`` gesetzt haben, damit die Transparenz im Ausgabebild sichtbar wird. Dies kann erreicht werden, indem die erweiterte Projekteinstellung **Rendern > Transparenter Hintergrund** aktiviert wird. **Anzeige > Fenster > Größe > Transparent** und **Anzeige > Fenster > Transparenz pro Pixel > Aktiviert** können optional aktiviert werden, damit die Transparenz während der Videoaufzeichnung in der Vorschau angezeigt werden kann.
zh_cn: 支持透明度，但根视口 **必须** 将其 ``transparent_bg`` 属性设置为 ``true`` ，以使透明度在输出图像上可见。这可以通过启用 **渲染 > 视口 > 透明背景** 高级项目设置来实现。 **显示 > 窗口 > 大小 > 透明** 和 **显示 > 窗口 > 像素级透明度 > 启用** 可以选择启用，以允许在录制视频时预览透明度，但不必在录制视频时启用它们。输出图像包含透明度。
zh_tw: 支援透明度，但根視口**必須**將其``transparent_bg``屬性設為``true``以使透明度在輸出影像上可見。這可以透過啟用 **算繪 > 透明背景** 高級專案設定來實作。 **顯示 >視窗 > 大小 > 透明** 和 **顯示 > 視窗 > 每像素透明度 > 啟用** 可以選擇啟用，以允許在錄製影片時預覽透明度，但不必在錄製影片時啟用它們。輸出影像包含透明度。

source: To use PNG, specify a ``.png`` file to be created in the **Editor > Movie Writer > Movie File** project setting. The generated ``.wav`` file will have the same name as the ``.png`` file (minus the extension).
de: Um PNG zu verwenden, geben Sie in der Projekteinstellung **Editor > Movie Writer > Movie-Datei** eine zu erstellende ``.png``-Datei an. Die erzeugte ``.wav``-Datei hat den gleichen Namen wie die ``.png``-Datei (ohne die Erweiterung).
zh_cn: 要使用 PNG，请指定要在 **编辑器 > Movie Writer > 电影文件** 项目设置中创建的 ``.png`` 文件。生成的 ``.wav`` 文件将与 ``.png`` 文件同名（去掉扩展名的话）。
zh_tw: 若要使用 PNG，請指定要在 **編輯器 > 影片編寫器 > 影片檔案** 專案設定中建立的 ``.png`` 檔案。產生的 .wav 檔案將與 .png 檔案同名（減去副檔名）。

source: Custom
de: Benutzerdefiniert
zh_cn: 自定义
zh_tw: 自定功能
