Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: de, zh_cn, zh_tw

source: If you need to encode directly to a different format or pipe a stream through third-party software, you can extend the MovieWriter class to create your own movie writers. This should typically be done using GDExtension for performance reasons.
de: Wenn Sie direkt in ein anderes Format kodieren oder einen Stream durch Software von Drittanbietern leiten müssen, können Sie die MovieWriter-Klasse erweitern, um Ihre eigenen Movie Writer zu erstellen. Dies sollte aus Gründen der Performance in der Regel mit GDExtension geschehen.
zh_cn: 如果你需要直接编码为不同的格式或通过第三方软件传输数据流，可以扩展 MovieWriter 类来创建你自己的电影编写器（movie writers）。出于性能原因，这通常应该使用 GDExtension 来完成。
zh_tw: 如果您需要直接編碼為不同的格式或透過第三方軟體傳輸串流，您可以擴充 MovieWriter 類別來建立您自己的電影編寫器。出於性能原因，這通常應該使用 GDExtension 來完成。

source: Configuration
de: Konfiguration
zh_cn: 配置
zh_tw: 配置

source: In the **Editor > Movie Writer** section of the Project Settings, there are several options you can configure. Some of them are only visible after enabling the **Advanced** toggle in the top-right corner of the Project Settings dialog.
de: Im Abschnitt **Editor > Movie Writer** der Projekteinstellungen können Sie verschiedene Optionen konfigurieren. Einige davon sind nur sichtbar, wenn Sie den Schalter **Erweitert** in der oberen rechten Ecke des Dialogfelds Projekteinstellungen aktivieren.
zh_cn: 在项目设置的 **编辑器 > Movie Writer** 部分中可配置多个选项。其中一些仅在启用“项目设置”对话框右上角的 **高级选项** 后才可见。
zh_tw: 在專案設定的 **編輯器 > 影片編寫器** 部分中，您可以配置多個選項。其中一些僅在啟用“專案設定”對話框右上角的“高級”切換後才可見。

source: **Mix Rate Hz:** The audio mix rate to use in the recorded audio when writing a movie. This can be different from the project's mix rate, but this value must be divisible by the recorded FPS to prevent audio from desynchronizing over time.
de: **Mix-Rate Hz:** Die Audio-Mix-Rate, die beim Schreiben eines Films für das aufgenommene Audio verwendet wird. Dieser Wert kann sich von der Mix-Rate des Projekts unterscheiden, muss aber durch die aufgezeichneten FPS teilbar sein, um zu verhindern, dass das Audio im Laufe der Zeit desynchronisiert wird.
zh_cn: **混音率：** 编写电影时在录制的音频中使用的音频混合率。这可能与项目的混合速率不同，但该值必须能被录制的 FPS 整除，以防止音频随着时间的推移而失去同步。
zh_tw: **混合率 Hz：** 編寫影片時在錄製的音訊中使用的音訊混合率。這可能與專案的混合速率不同，但該值必須能被記錄的 FPS 整除，以防止音訊隨著時間的推移而失去同步。

source: **Speaker Mode:** The speaker mode to use in the recorded audio when writing a movie (stereo, 5.1 surround or 7.1 surround).
de: **Lautsprechermodus:** Der Lautsprechermodus, der beim Schreiben eines Films für die Tonaufnahme verwendet werden soll (Stereo, 5.1 Surround oder 7.1 Surround).
zh_cn: **扬声器模式：** 编写电影时录制的音频中使用的扬声器模式（stereo 立体声、5.1 环绕声或 7.1 环绕声）。
zh_tw: **揚聲器模式：** 編寫影片時錄製的音訊中使用的揚聲器模式（立體聲、5.1 環繞聲或 7.1 環繞聲）。

source: **MJPEG Quality:** The JPEG quality to use when writing a video to an AVI file, between ``0.01`` and ``1.0`` (inclusive). Higher quality values result in better-looking output at the cost of larger file sizes. Recommended quality values are between ``0.75`` and ``0.9``. Even at quality ``1.0``, JPEG compression remains lossy. This setting does not affect audio quality and is ignored when writing to a PNG image sequence.
de: **MJPEG-Qualität:** Die JPEG-Qualität, die beim Schreiben eines Videos in eine AVI-Datei verwendet werden soll, liegt zwischen ``0.01`` und ``1.0`` (inklusive). Höhere Qualitätswerte führen zu einer besser aussehenden Ausgabe zum Preis einer größeren Dateigröße. Empfohlene Qualitätswerte liegen zwischen ``0.75`` und ``0.9``. Selbst bei der Qualität ``1.0`` bleibt die JPEG-Kompression verlustbehaftet. Diese Einstellung hat keinen Einfluss auf die Audioqualität und wird beim Schreiben in eine PNG-Bildsequenz ignoriert.
zh_cn: **MJPEG 质量：** 将视频写入 AVI 文件时使用的 JPEG 质量，介于 ``0.01`` 和 ``1.0`` （包含）之间。质量值越高，输出效果越好，但文件大小会越大。建议的质量值在 ``0.75`` 和 ``0.9`` 之间。即使质量为 ``1.0`` ，JPEG 压缩仍然是有损的。此设置不会影响音频质量，并且在写入 PNG 图像序列时会被忽略。
zh_tw: **MJPEG 品質：** 將影片寫入 AVI 檔案時所使用的 JPEG 質量，介於「0.01」和「1.0」（含）之間。品質值越高，輸出效果越好，但檔案大小越大。建議的品質值在“0.75”和“0.9”之間。即使質量為“1.0”，JPEG 壓縮仍然是有損的。此設定不會影響音訊質量，並且在寫入 PNG 影像序列時會被忽略。

source: **Movie File:** The output path for the movie. This can be absolute or relative to the project root.
de: **Movie-Datei:** Der Ausgabepfad für den Film. Dieser kann absolut oder relativ zum Root des Projekts sein.
zh_cn: **电影文件：** 电影的输出路径。这可以是绝对路径，或相对于项目根目录的相对路径。
zh_tw: **電影檔案：** 電影的輸出路徑。這可以是絕對的或相對於專案根的。

source: **Disable V-Sync:** If enabled, requests V-Sync to be disabled when writing a movie. This can speed up video writing if the hardware is fast enough to render, encode and save the video at a framerate higher than the monitor's refresh rate. This setting has no effect if the operating system or graphics driver forces V-Sync with no way for applications to disable it.
de: **V-Sync deaktivieren:** Wenn aktiviert, wird V-Sync beim Schreiben eines Films deaktiviert. Dies kann das Schreiben von Videos beschleunigen, wenn die Hardware schnell genug ist, um das Video mit einer höheren Framerate als die Bildwiederholfrequenz des Monitors zu rendern, zu kodieren und zu speichern. Diese Einstellung hat keine Auswirkung, wenn das Betriebssystem oder der Grafiktreiber V-Sync erzwingt, ohne den Anwendungen die Möglichkeit zu geben, es zu deaktivieren.
zh_cn: **禁用垂直同步：** 如果启用，则在写入电影时请求禁用垂直同步。如果硬件足够快，能够以高于显示器刷新率的帧速率渲染、编码和保存视频，这可以加快视频写入速度。如果操作系统或图形驱动程序强制垂直同步且应用程序无法禁用它，则此设置无效。
zh_tw: **停用垂直同步：** 如果啟用，則在寫入影片時要求停用垂直同步。如果硬體夠快，能夠以高於顯示器更新率的影格速率算繪、編碼和保存影片，這可以加快視訊寫入速度。如果作業系統或圖形驅動程式強制垂直同步且應用程式無法停用它，則此設定無效。

source: **FPS:** The rendered frames per second in the output movie. Higher values result in smoother animation, at the cost of longer rendering times and larger output file sizes. Most video hosting platforms do not support FPS values higher than 60, but you can use a higher value and use that to generate motion blur.
de: **FPS:** Die gerenderten Bilder pro Sekunde im Ausgabefilm. Höhere Werte führen zu einer flüssigeren Animation, allerdings zum Preis längerer Rendering-Zeiten und größerer Ausgabedateigrößen. Die meisten Video-Hosting-Plattformen unterstützen keine höheren FPS-Werte als 60, aber Sie können einen höheren Wert verwenden und damit Bewegungsunschärfe erzeugen.
zh_cn: **FPS：** 输出影片中每秒渲染的帧数。值越高，动画越平滑，但代价是渲染时间更长和输出文件大小更大。大多数视频托管平台不支持高于 60 的 FPS 值，但你可以使用更高的值并用它来生成运动模糊。
zh_tw: **FPS：** 輸出影片中每秒算繪的影格數。值越高，動畫越平滑，但代價是算繪時間更長和輸出檔案大小更大。大多數影片託管平台不支援高於 60 的 FPS 值，但您可以使用更高的值並用它來產生運動模糊。

source: When using the ``disabled`` or ``2d`` :ref:`stretch modes <doc_multiple_resolutions>`, the output file's resolution is set by the window size. Make sure to resize the window *before* the splash screen has ended. For this purpose, it's recommended to adjust the **Display > Window > Size > Window Width Override** and **Window Height Override** advanced project settings.
de: Wenn Sie die ``disabled`` oder ``2d``-:ref:`Stretch-Modi <doc_multiple_resolutions>` verwenden, wird die Auflösung der Ausgabedatei durch die Fenstergröße bestimmt. Stellen Sie sicher, dass Sie die Größe des Fensters *vor* dem Ende des Splash-Screens ändern. Zu diesem Zweck empfiehlt es sich, die erweiterten Projekteinstellungen **Anzeige > Fenster > Größe > Fensterbreite überschreiben** und **Fensterhöhe überschreiben** anzupassen.
zh_cn: 当使用 ``disabled`` 或 ``2d`` :ref:`拉伸模式 <doc_multiple_resolutions>` 时，输出文件的分辨率由窗口大小设置。确保在启动画面结束 *之前* 调整窗口大小。为此，建议调整高级设置中的 **显示 > 窗口 > 大小 > 窗口宽度覆盖** 和 **窗口高度覆盖** 。
zh_tw: 當使用「disabled」或「2d」:ref:`拉伸模式 <doc_multiple_resolutions>` 時，輸出檔案的解析度由視窗大小設定。確保在啟動畫面結束前*調整視窗大小。為此，建議調整 **顯示 > 視窗 > 大小 > 視窗寬度覆蓋** 和 **視窗高度覆蓋** 進階專案設定。

source: See also :ref:`doc_creating_movies_recording_at_higher_resolution`.
de: Siehe auch :ref:`doc_creating_movies_recording_at_higher_resolution`.
zh_cn: 另见 :ref:`doc_creating_movies_recording_at_higher_resolution`。
zh_tw: 另請參閱:ref:`doc_creating_movies_recording_at_higher_resolution`。

source: Quitting Movie Maker mode
de: Beenden des Movie Maker-Modus
zh_cn: 退出 Movie Maker 模式
zh_tw: 內建變數和算繪模式

source: To safely quit a project that is using Movie Maker mode, use the X button at the top of the window, or call ``get_tree().quit()`` in a script. You can also use the ``--quit-after N`` command line argument where ``N`` is the number of frames to render before quitting.
de: Um ein Projekt im Movie Maker-Modus sicher zu beenden, benutzen Sie den X-Button am oberen Rand des Fensters, oder rufen Sie ``get_tree().quit()`` in einem Skript auf. Sie können auch das Kommandozeilenargument ``--quit-after N`` verwenden, wobei ``N`` die Anzahl der zu rendernden Bilder vor dem Beenden ist.
zh_cn: 为了安全退出使用 Movie Maker 模式的项目，请使用窗口顶部的 X 按钮，或在脚本中调用 ``get_tree().quit()`` 。你也可以使用 ``--quit-after N`` 命令行参数，其中 ``N`` 是退出前要渲染的帧数。

source: Pressing :kbd:`F8` (:kbd:`Cmd + .` on macOS) or pressing :kbd:`Ctrl + C` on the terminal running Godot is **not recommended**, as it will result in an improperly formatted AVI file with no duration information. For PNG image sequences, PNG images will not be negatively altered, but the associated WAV file will still lack duration information.
de: Das Drücken von :kbd:`F8` (:kbd:`Cmd + .` unter macOS) oder das Drücken von :kbd:`Strg + C` im Terminal, in dem Godot läuft, ist **nicht empfehlenswert**, da es zu einer nicht korrekt formatierten AVI-Datei ohne Laufzeitinformationen führen wird. Bei PNG-Bildsequenzen werden die PNG-Bilder nicht zum Schlechteren verändert, aber die zugehörige WAV-Datei enthält keine Angaben zur Laufzeit.
zh_cn: **不建议** 按 :kbd:`F8`（在 macOS 上按 :kbd:`Cmd + .`）或在运行 Godot 的终端上按 :kbd:`Ctrl + C`，因为这会导致 AVI 文件出现没有时长信息的不正确情况。对于 PNG 图像序列而言，PNG 图像不会有负面影响，但关联的 WAV 文件仍会缺少时长信息。
zh_tw: **不建議**按:kbd:`F8`（在macOS 上按:kbd:`Cmd + .`）或在執行Godot 的終端機上按:kbd:`Ctrl + C`，因為這會導致格式不正確沒有持續時間資訊的 AVI 檔案。對於 PNG 影像序列，PNG 影像不會被負面改變，但關聯的 WAV 檔案仍然缺少持續時間資訊。

source: Some video players may still be able to play the AVI or WAV file with working video and audio. However, software that makes use of the AVI or WAV file such as video editors may not be able to open the file. :ref:`Using a video converter program <doc_creating_movies_converting_avi>` can help in those cases.
de: Einige Videoplayer können die AVI- oder WAV-Datei möglicherweise noch mit funktionierendem Video und Audio abspielen. Software, die mit der AVI- oder WAV-Datei arbeitet, wie z. B. Video-Editoren, kann die Datei jedoch möglicherweise nicht öffnen. :ref:`Die Verwendung eines Videokonvertierungsprogramms <doc_creating_movies_converting_avi>` kann in diesen Fällen helfen.
zh_cn: 某些视频播放器可能仍然能够播放包含有效视频和音频的 AVI 或 WAV 文件。但是，使用 AVI 或 WAV 文件的软件（例如视频编辑器）可能无法打开该文件。在这些情况下， :ref:`使用视频转换器程序 <doc_creating_movies_converting_avi>` 可以提供一些帮助。
zh_tw: 某些視訊播放器可能仍能夠播放包含有效視訊和音訊的 AVI 或 WAV 檔案。但是，使用 AVI 或 WAV 檔案的軟體（例如影片編輯器）可能無法開啟該檔案。 :ref:`使用視訊轉換器程式 <doc_creating_movies_converting_avi>` 在這些情況下可以提供協助。

source: If you're using an AnimationPlayer to control a "main action" in the scene (such as camera movement), you can enable the **Movie Quit On Finish** property on the AnimationPlayer node in question. When enabled, this property will make Godot quit on its own when an animation is done playing *and* the engine is running in Movie Maker mode. Note that *this property has no effect on looping animations*. Therefore, you need to make sure that the animation is set as non-looping.
de: Wenn Sie einen AnimationPlayer verwenden, um eine "Hauptaktion" in der Szene zu steuern (z. B. eine Kamerabewegung), können Sie die Property **Beenden bei Filmende** auf dem betreffenden AnimationPlayer-Node aktivieren. Wenn diese Property aktiviert ist, wird Godot von selbst beendet, wenn eine Animation fertig abgespielt ist *und* die Engine im Movie Maker-Modus läuft. Beachten Sie, dass *diese Property keine Auswirkungen auf Looping-Animationen* hat. Daher müssen Sie sicherstellen, dass die Animation als nicht-Looping eingestellt ist.
zh_cn: 如果你使用 AnimationPlayer 来控制场景中的“主要动作”（例如摄像机移动），则可以在相关的 AnimationPlayer 节点上启用 **Movie Quit On Finish** 属性。启用后，当动画播放完毕 *并且* 引擎在 Movie Maker 模式下运行时，此属性将使 Godot 自行退出。请注意， *此属性对循环动画没有影响* 。因此，你需要确保动画设置为非循环。
zh_tw: 如果您使用 AnimationPlayer 來控制場景中的「主要動作」（例如攝影機移動），則可以在相關的 AnimationPlayer 節點上啟用 **Movie Quit On Finish** 屬性。啟用後，當動畫播放完畢*並且*引擎在 Movie Maker 模式下運作時，此屬性將使 Godot 自行退出。請注意，*此屬性對循環動畫沒有影響*。因此，您需要確保動畫設定為非循環。

source: Using high-quality graphics settings
de: Verwendung von hohen Grafikeinstellungen
zh_cn: 使用高质量的图形设置
zh_tw: 使用高品質的圖形設定

source: The ``movie`` :ref:`feature tag <doc_feature_tags>` can be used to override specific project settings. This is useful to enable high-quality graphics settings that wouldn't be fast enough to run in real-time speeds on your hardware. Remember that putting every setting to its maximum value can still slow down movie saving speed, especially when recording at higher resolutions. Therefore, it's still recommended to only increase graphics settings if they make a meaningful difference in the output image.
de: Das ``Movie`` :ref:`Feature-Tag <doc_feature_tags>` kann verwendet werden, um bestimmte Projekteinstellungen außer Kraft zu setzen. Dies ist nützlich, um hohe Grafikeinstellungen zu aktivieren, die auf Ihrer Hardware nicht schnell genug wären, um in Echtzeit zu laufen. Denken Sie daran, dass das Setzen aller Einstellungen auf den Maximalwert immer noch die Speichergeschwindigkeit des Films verlangsamen kann, insbesondere bei der Aufnahme mit höheren Auflösungen. Daher ist es immer noch empfehlenswert, die Grafikeinstellungen nur dann zu erhöhen, wenn sie einen bedeutenden Unterschied im Ausgabebild machen.
zh_cn: ``movie`` :ref:`功能标签 <doc_feature_tags>` 可用于覆盖特定的项目设置。这对于启用高质量图形设置来说非常有用，但这些设置的速度不足以在硬件上以实时速度运行。请记住，将每个设置设为最大值仍然会降低影片保存速度，尤其是在以更高分辨率录制时。因此，建议仅在图形设置对输出图像产生可以有价值的影响时，再增加图形设置。
zh_tw: ``movie`` :ref:`功能標籤 <doc_feature_tags>` 可用來覆寫特定的專案設定。這對於啟用高品質圖形設定非常有用，但這些設定的速度不足以在硬體上以即時速度運作。請記住，將每個設定設為最大值仍然會降低影片保存速度，尤其是在以更高解析度錄製時。因此，仍建議僅在圖形設定對輸出影像產生有意義的影響時才增加圖形設定。

source: This feature tag can also be queried in a script to increase quality settings that are set in the Environment resource. For example, to further improve SDFGI detail and reduce light leaking:
de: Dieses Feature-Tag kann auch in einem Skript abgefragt werden, um die Qualitätseinstellungen zu erhöhen, die in der Environment-Ressource festgelegt sind. Zum Beispiel, um die SDFGI-Details weiter zu verbessern und Lichtlecks zu reduzieren:
zh_cn: 还可以在脚本中查询此功能标签，以提高环境资源中设置的质量设置。例如，为了进一步改善 SDFGI 细节并减少漏光：
zh_tw: 也可以在腳本中查詢此功能標記，以提高環境資源中設定的品質設定。例如，為了進一步改善SDFGI細節並減少漏光：

source: Rendering at a higher resolution than the screen resolution
de: Rendering mit einer höheren Auflösung als der Bildschirmauflösung
zh_cn: 以比屏幕分辨率更高的分辨率进行渲染
zh_tw: 以比螢幕解析度更高的解析度進行算繪

source: The overall rendering quality can be improved significantly by rendering at high resolutions such as 4K or 8K.
de: Die Gesamtqualität des Renderings kann durch Rendering mit hohen Auflösungen wie 4K oder 8K erheblich verbessert werden.
zh_cn: 通过4K或8K等高分辨率渲染可以显着提高整体渲染质量。
zh_tw: 透過4K或8K等高解析度算繪可以顯著提高整體算繪品質。

source: For 3D rendering, Godot provides a **Rendering > Scaling 3D > Scale** advanced project setting, which can be set above ``1.0`` to obtain *supersample antialiasing*. The 3D rendering is then *downsampled* when it's drawn on the viewport. This provides an expensive but high-quality form of antialiasing, without increasing the final output resolution.
de: Für das 3D-Rendering bietet Godot die erweiterte Projekteinstellung **Rendern > 3D-Skalierung > Skalierung**, die auf einen Wert über ``1.0`` gesetzt werden kann, um *Supersample-Antialiasing* zu erhalten. Das 3D-Rendering wird dann *unterabgetastet*, wenn es auf dem Viewport gezeichnet wird. Dies bietet eine teure, aber qualitativ hochwertige Form des Antialiasing, ohne die endgültige Ausgabeauflösung zu erhöhen.
zh_cn: 对于 3D 渲染，Godot 在高级项目设置中提供了 **渲染 > 缩放 3D > 缩放** ，可以将其设置为高于 ``1.0`` 以获得 *超采样抗锯齿* 。当 3D 渲染在视口上绘制时，它会被 *降采样* 。这提供了一种性能代价高昂但高质量的抗锯齿形式，并且不会增加最终的输出分辨率。
zh_tw: 對於 3D 算繪，Godot 提供了 **算繪 > 縮放 3D > 縮放** 高級專案設定，可以將其設定為高於“1.0”以獲得*超級取樣抗鋸齒*。當 3D 算繪在視窗上繪製時，它會被「下取樣」。這提供了一種昂貴但高品質的抗鋸齒形式，而不會增加最終的輸出解析度。

source: Consider using this project setting first, as it avoids slowing down movie writing speeds and increasing output file size compared to actually increasing the output resolution.
de: Erwägen Sie, diese Projekteinstellung zuerst zu verwenden, da sie eine Verlangsamung der Schreibgeschwindigkeit von Filmen und eine Vergrößerung der Ausgabedatei im Vergleich zur tatsächlichen Erhöhung der Ausgabeauflösung vermeidet.
zh_cn: 首先考虑使用此项目设置，因为与实际增加输出分辨率相比，它可以避免减慢影片写入速度和增加输出文件大小。
zh_tw: 首先考慮使用此專案設定，因為與實際增加輸出解析度相比，它可以避免減慢影片寫入速度並增加輸出檔案大小。

source: If you wish to render 2D at a higher resolution, or if you actually need the higher raw pixel output for 3D rendering, you can increase the resolution above what the screen allows.
de: Wenn Sie 2D mit einer höheren Auflösung rendern möchten oder wenn Sie die höhere Rohpixelausgabe für 3D-Rendering benötigen, können Sie die Auflösung über das hinaus erhöhen, was der Bildschirm zulässt.
zh_cn: 如果你希望以更高分辨率渲染 2D，或者实际上你需要更高的原始像素输出来进行 3D 渲染，则可以将分辨率提高到屏幕允许的分辨率之上。
zh_tw: 如果您希望以更高解析度算繪 2D，或者您實際上需要更高的原始像素輸出來進行 3D 算繪，則可以將解析度提高到螢幕允許的解析度以上。

source: By default, Godot uses the ``disabled`` :ref:`stretch modes <doc_multiple_resolutions>` in projects. If using ``disabled`` or ``canvas_items`` stretch mode, the window size dictates the output video resolution.
de: Standardmäßig verwendet Godot den :ref:`Stretch-Modus <doc_multiple_resolutions>` ``deaktiviert`` in Projekten. Wenn Sie den Stretch-Modus ``deaktiviert`` oder ``canvas_items`` verwenden, bestimmt die Fenstergröße die Ausgabeauflösung.
zh_cn: 默认情况下，Godot 在项目中使用 ``disabled`` :ref:`拉伸模式 <doc_multiple_resolutions>` 。如果使用 ``disabled`` 或 ``canvas_items`` 拉伸模式，窗口大小决定输出视频分辨率。
zh_tw: 預設情況下，Godot 在專案中使用「停用」:ref:`伸展模式 <doc_multiple_resolutions>`。如果使用「disabled」或「canvas_items」拉伸模式，視窗大小決定輸出視訊解析度。

source: On the other hand, if the project is configured to use the ``viewport`` stretch mode, the viewport resolution dictates the output video resolution. The viewport resolution is set using the **Display > Window > Size > Viewport Width** and **Viewport Height** project settings. This can be used to render a video at a higher resolution than the screen resolution.
de: Ist das Projekt hingegen so konfiguriert, dass es den ``Viewport``-Stretch-Modus verwendet, bestimmt die Viewport-Auflösung die Ausgabeauflösung. Die Viewport-Auflösung wird über die Projekteinstellungen **Anzeige > Fenster > Größe > Viewport-Breite** und **Viewport-Höhe** festgelegt. Dies kann verwendet werden, um ein Video mit einer höheren Auflösung als der Bildschirmauflösung zu rendern.
zh_cn: 另一方面，如果项目配置中使用 ``viewport`` 拉伸模式，则视口分辨率会决定输出视频分辨率。视口分辨率使用 **显示 > 窗口 > 大小 > 视口宽度** 和 **视口高度** 项目设置进行设置。这可用于以比屏幕分辨率更高的分辨率渲染视频。
zh_tw: 另一方面，如果專案配置為使用「視口」拉伸模式，則視口解析度決定輸出視訊解析度。視窗解析度使用 **顯示 > 視窗 > 大小 > 視窗寬度** 和 **視窗高度** 專案設定進行設定。這可用於以比螢幕解析度更高的解析度算繪影片。

source: To make the window smaller during recording without affecting the output video resolution, you can set the **Display > Window > Size > Window Width Override** and **Window Height Override** advanced project settings to values greater than ``0``.
de: Um das Fenster während der Aufnahme zu verkleinern, ohne die Auflösung des Ausgabevideos zu beeinflussen, können Sie die erweiterten Projekteinstellungen **Anzeige > Fenster > Größe > Fensterbreite überschreiben** und **Fensterhöhe überschreiben** auf Werte größer als ``0`` setzen.
zh_cn: 要在录制过程中缩小窗口而不影响输出视频分辨率，可以将高级项目设置中 **显示 > 窗口 > 大小 > 窗口宽度覆盖** 和 **窗口高度覆盖** 设置为大于 ``0`` 的值。
zh_tw: 若要在錄製過程中縮小視窗而不影響輸出視訊分辨率，您可以將 **顯示 > 視窗 > 大小 > 視窗寬度覆蓋** 和 **視窗高度覆蓋** 進階專案設定設為大於「0」的值`。

source: To apply a resolution override only when recording a movie, you can override those settings with the ``movie`` :ref:`feature tag <doc_feature_tags>`.
de: Um die Auflösung nur bei der Aufnahme eines Films zu überschreiben, können Sie diese Einstellungen mit dem ``Movie``-:ref:`feature tag <doc_feature_tags>` überschreiben.
zh_cn: 要仅在录制电影时应用分辨率覆盖，可以使用 ``movie`` :ref:`功能标签 <doc_feature_tags>` 来覆盖这些设置。
zh_tw: 若要僅在錄製影片時套用解析度覆蓋，您可以使用「影片」:ref:`功能標籤 <doc_feature_tags>` 覆寫這些設定。

source: Post-processing steps
de: Nachbearbeitungsschritte
zh_cn: 后期处理步骤
zh_tw: **後處理：**

source: Some common post-processing steps are listed below.
de: Im Folgenden sind einige gängige Nachbearbeitungsschritte aufgeführt.
zh_cn: 以下列出一些常见的后期处理步骤。
zh_tw: 以下列出一些常見的後期處理步驟。

source: When using several post-processing steps, try to perform all of them in a single FFmpeg command. This will save encoding time and improve quality by avoiding multiple lossy encoding steps.
de: Wenn Sie mehrere Nachbearbeitungsschritte verwenden, sollten Sie versuchen, sie alle in einem einzigen FFmpeg-Befehl auszuführen. Das spart Kodierungszeit und verbessert die Qualität, da mehrere verlustbehaftete Kodierungsschritte vermieden werden.
zh_cn: 当使用多步后处理时，请尝试在单一 FFmpeg命令中执行所有这些步骤。这将避免掉多个有损的编码步骤从而节省编码时间并提高品质。
zh_tw: 當使用多個後處理步驟時，請嘗試在單一 FFmpeg 命令中執行所有這些步驟。這將透過避免多個有損編碼步驟來節省編碼時間並提高品質。

source: Converting AVI video to MP4
de: AVI-Video in MP4 umwandeln
zh_cn: 将 AVI 视频转换为 MP4
zh_tw: 轉換縮排為 Tab

source: While some platforms such as YouTube support uploading the AVI file directly, many others will require a conversion step beforehand. `HandBrake <https://handbrake.fr/>`__ (GUI) and `FFmpeg <https://ffmpeg.org/>`__ (CLI) are popular open source tools for this purpose. FFmpeg has a steeper learning curve, but it's more powerful.
de: Während einige Plattformen wie YouTube das direkte Hochladen der AVI-Datei unterstützen, ist bei vielen anderen ein vorheriger Konvertierungsschritt erforderlich. `HandBrake <https://handbrake.fr/>`__ (GUI) und `FFmpeg <https://ffmpeg.org/>`__ (CLI) sind beliebte Open Source Tools für diesen Zweck. FFmpeg hat eine steilere Lernkurve, aber es ist leistungsfähiger.
zh_cn: 尽管 YouTube 等一些平台支持直接上传 AVI 文件，但许多其他平台则需要事先进行格式转换。`HandBrake <https://handbrake.fr/>`__\ （GUI）和 `FFmpeg <https://ffmpeg.org/>`__\ （CLI）都是这方面非常流行的开源工具。FFmpeg 的学习曲线相对陡峭，但功能也更强大。
zh_tw: `HandBrake <https://handbrake.fr/>`__（GUI）和 `FFmpeg <https://ffmpeg.org/>`__（CLI）都是這方面非常流行的開源工具。FFmpeg 的學習曲線相對陡峭，但功能也更強大。

source: The command below converts an AVI video to a MP4 (H.264) video with a Constant Rate Factor (CRF) of 15. This results in a relatively large file, but is well-suited for platforms that will re-encode your videos to reduce their size (such as most video sharing websites):
de: Der folgende Befehl konvertiert ein AVI-Video in ein MP4 (H.264)-Video mit einem Constant Rate Factor (CRF) von 15. Dies führt zu einer relativ großen Datei, eignet sich aber gut für Plattformen, die Ihre Videos neu kodieren, um ihre Größe zu verringern (wie die meisten Video-Sharing-Websites):
zh_cn: 下面的命令将 AVI 视频转换为恒定速率因子 (Constant Rate Factor ，CRF) 为 15 的 MP4 (H.264) 视频。这会产生相对较大的文件，但非常适合各种平台（例如大多数视频共享网站），因为平台会重新编码视频将其压缩到它们设置的大小：
zh_tw: 下面的命令將 AVI 視訊轉換為恆定速率因子 (CRF) 為 15 的 MP4 (H.264) 視訊。這會產生相對較大的檔案，但非常適合將視訊重新編碼為減少它們的大小（例如大多數影片分享網站）：

source: To get a smaller file at the cost of quality, *increase* the CRF value in the above command.
de: Um eine kleinere Datei auf Kosten der Qualität zu erhalten, *erhöhen* Sie den CRF-Wert im obigen Befehl.
zh_cn: 要以牺牲质量为代价获得较小的文件，请 *增加* 上述命令中的 CRF 值。
zh_tw: 要以犧牲品質為代價獲得較小的檔案，請*增加*上述命令中的 CRF 值。
