Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: de, zh_cn, zh_tw

source: To get a file with a better size/quality ratio (at the cost of slower encoding times), add ``-preset veryslow`` before ``-crf 15`` in the above command. On the contrary, ``-preset veryfast`` can be used to achieve faster encoding at the cost of a worse size/quality ratio.
de: Um eine Datei mit einem besseren Verhältnis zwischen Größe und Qualität zu erhalten (auf Kosten einer langsameren Kodierungszeit), fügen Sie ``-preset veryslow`` vor ``-crf 15`` im obigen Befehl ein. Im Gegensatz dazu kann ``-preset veryfast`` verwendet werden, um eine schnellere Kodierung auf Kosten eines schlechteren Verhältnisses von Größe und Qualität zu erreichen.
zh_cn: 要获得具有更好的大小/质量比的文件（以较慢的编码时间为代价），请在上述命令中的 ``-crf 15`` 之前添加 ``-preset veryslow`` 。相反地， ``-preset veryfast`` 可用于实现更快的编码，但代价是尺寸/质量比更差。
zh_tw: 要獲得具有更好的大小/品質比的檔案（以較慢的編碼時間為代價），請在上述命令中的“-crf 15”之前新增“-preset veryslow”。相反，「-preset veryfast」可用於實作更快的編碼，但代價是尺寸/品質比更差。

source: Converting PNG image sequence + WAV audio to a video
de: PNG-Bildsequenz + WAV-Audio in ein Video umwandeln
zh_cn: 将 PNG 图像序列 + WAV 音频转换为视频
zh_tw: 將 PNG 圖像序列 + WAV 音訊轉換為影片

source: If you chose to record a PNG image sequence with a WAV file beside it, you need to convert it to a video before you can use it elsewhere.
de: Wenn Sie eine PNG-Bildsequenz mit einer WAV-Datei daneben aufgenommen haben, müssen Sie sie in ein Video umwandeln, bevor Sie sie anderweitig verwenden können.
zh_cn: 如果你选择录制 PNG 图像序列和 WAV 文件，则需要先将其转换为视频，然后才能在其他地方使用。
zh_tw: 如果您選擇錄製 PNG 圖像序列並在其旁邊新增 WAV 檔案，則需要先將其轉換為影片，然後才能在其他地方使用。

source: The filename for the PNG image sequence generated by Godot always contains 8 digits, starting at 0 with zero-padded numbers. If you specify an output path ``folder/example.png``, Godot will write ``folder/example00000000.png``, ``folder/example00000001.png``, and so on in that folder. The audio will be saved at ``folder/example.wav``.
de: Der Dateiname für die von Godot erzeugte PNG-Bildsequenz enthält immer 8 Ziffern, beginnend mit 0 und mit Zero-Padding. Wenn Sie einen Ausgabepfad ``Ordner/Beispiel.png`` angeben, wird Godot ``Ordner/Beispiel00000000.png``, ``Ordner/Beispiel00000001.png``, usw. in diesen Ordner schreiben. Der Sound wird unter ``ordner/beispiel.wav`` gespeichert.
zh_cn: Godot 生成的 PNG 图像序列的文件名始终包含 8 位数字，从 0 开始，数字以零填充。如果指定输出路径 ``folder/example.png`` ，Godot 将在该文件夹中写入 ``folder/example00000000.png`` 、 ``folder/example00000001.png`` 等。音频将保存在 ``folder/example.wav`` 中。
zh_tw: Godot 產生的 PNG 影像序列的檔案名稱始終包含 8 位數字，從 0 開始，數字以零填充。如果指定輸出路徑“folder/example.png”，Godot 將在該資料夾中寫入“folder/example00000000.png”、“folder/example00000001.png”等。音訊將保存在“folder/example.wav”中。

source: The FPS is specified using the ``-r`` argument. It should match the FPS specified during recording. Otherwise, the video will appear to be slowed down or sped up, and audio will be out of sync with the video.
de: Die FPS werden mit dem Argument ``-r`` angegeben. Sie sollte mit den FPS übereinstimmen, die während der Aufnahme angegeben wurden. Andernfalls erscheint das Video verlangsamt oder beschleunigt, und der Ton ist nicht mit dem Video synchronisiert.
zh_cn: FPS 使用 ``-r`` 参数指定。它应该与录制期间指定的 FPS 相匹配。否则视频会显得速度减慢或加快，并且音频与视频不同步。
zh_tw: FPS 使用“-r”參數指定。它應該與錄製期間指定的 FPS 相符。否則，視訊會顯得速度減慢或加快，且音訊與視訊不同步。

source: If you recorded a PNG image sequence with transparency enabled, you need to use a video format that supports storing transparency. MP4/H.264 doesn't support storing transparency, so you can use WebM/VP9 as an alternative:
de: Wenn Sie eine PNG-Bildsequenz mit aktivierter Transparenz aufgenommen haben, müssen Sie ein Videoformat verwenden, das die Speicherung von Transparenz unterstützt. MP4/H.264 unterstützt die Speicherung von Transparenz nicht, daher können Sie WebM/VP9 als Alternative verwenden:
zh_cn: 如果你在启用透明度的情况下录制了 PNG 图像序列，则需要使用支持存储透明度的视频格式。 MP4/H.264 不支持存储透明度，因此可以使用 WebM/VP9 作为替代方案：
zh_tw: 如果您在啟用透明度的情況下錄製了 PNG 影像序列，則需要使用支援儲存透明度的影片格式。 MP4/H.264 不支援儲存透明度，因此您可以使用 WebM/VP9 作為替代方案：

source: Cutting video
de: Video schneiden
zh_cn: 视频剪辑
zh_tw: 建立節點

source: You can trim parts of the video you don't want to keep after the video is recorded. For example, to discard everything before 12.1 seconds and keep only 5.2 seconds of video after that point:
de: Sie können Teile des Videos, die Sie nicht behalten möchten, nach der Aufnahme des Videos zuschneiden. Zum Beispiel, um alles vor 12,1 Sekunden zu verwerfen und nur 5,2 Sekunden des Videos nach diesem Punkt zu behalten:
zh_cn: 录制视频后你可以剪辑掉不想保留的视频部分。例如，要丢弃 12.1 秒之前的所有内容，并仅保留该点之后 5.2 秒的视频：
zh_tw: 錄製影片後，您可以修剪不想保留的影片部分。例如，要丟棄 12.1 秒之前的所有內容並僅保留該點之後 5.2 秒的影片：

source: Cutting videos can also be done with the GUI tool `LosslessCut <https://mifi.github.io/lossless-cut/>`__.
de: Das Schneiden von Videos kann auch mit dem GUI Tool `LosslessCut <https://mifi.github.io/lossless-cut/>`__ durchgeführt werden.
zh_cn: 也可以使用 GUI 工具 `LosslessCut <https://mifi.github.io/lossless-cut/>`__ 来剪辑视频。
zh_tw: 也可以使用 GUI 工具 `LosslessCut <https://mifi.github.io/lossless-cut/>`__ 來剪下影片。

source: Resizing video
de: Größenänderung des Videos
zh_cn: 视频缩放
zh_tw: 影片縮放

source: The following command resizes a video to be 1080 pixels tall (1080p), while preserving its existing aspect ratio:
de: Mit dem folgenden Befehl wird die Größe eines Videos auf eine Höhe von 1080 Pixeln (1080p) geändert, wobei das bestehende Seitenverhältnis beibehalten wird:
zh_cn: 以下命令将视频大小调整为 1080 像素高 (1080p)，同时保留其现有的宽高比：
zh_tw: 以下命令會在保持現有長寬比的前提下將影片調整到 720 像素高（720p）。如果原始檔解析度是大於 720p 的，就能夠顯著降低檔大小：

source: Reducing framerate
de: Reduzierung der Framerate
zh_cn: 降低帧率
zh_tw: 新增腳本

source: The following command changes a video's framerate to 30 FPS, dropping some of the original frames if there are more in the input video:
de: Der folgende Befehl ändert die Bildrate eines Videos auf 30 FPS, wobei einige der ursprünglichen Bilder weggelassen werden, wenn das Eingangsvideo mehr Bilder enthält:
zh_cn: 下面的命令会将视频的帧率更改为 30 FPS，如果输入视频中帧率更高，则会丢弃一些原始帧：
zh_tw: 以下命令將影片的影格速率更改為 30 FPS，如果輸入影片中有更多影格，則丟棄一些原始影格：

source: Generating accumulation motion blur with FFmpeg
de: Erzeugen von kumulativen Bewegungsunschärfen mit FFmpeg
zh_cn: 使用 FFmpeg 生成累积运动模糊
zh_tw: 使用 FFmpeg 生成累積運動模糊

source: Godot does not have built-in support for motion blur, but it can still be created in recorded videos.
de: Godot verfügt nicht über eine integrierte Unterstützung für Bewegungsunschärfe, aber sie kann in aufgezeichneten Videos dennoch erzeugt werden.
zh_cn: Godot 没有内置对运动模糊的支持，但仍然可以在录制的视频中创建运动模糊。
zh_tw: Godot 沒有內建對運動模糊的支援，但仍然可以在錄製的影片中建立運動模糊。

source: If you record the video at a multiple of the original framerate, you can blend the frames together then reduce the frameate to produce a video with *accumulation motion blur*. This motion blur can look very good, but it can take a long time to generate since you have to render many more frames per second (on top of the time spent on post-processing).
de: Wenn Sie das Video mit einem Vielfachen der ursprünglichen Bildrate aufnehmen, können Sie die Bilder überblenden und dann die Bildrate reduzieren, um ein Video mit *Kumulierungsbewegungsunschärfe* zu erzeugen. Diese Bewegungsunschärfe kann sehr gut aussehen, aber es kann lange dauern, sie zu erzeugen, da Sie viele weitere Bilder pro Sekunde rendern müssen (zusätzlich zu der Zeit, die Sie für die Nachbearbeitung benötigen).
zh_cn: 如果你以原始帧率的几倍来录制视频，则可以将帧混合在一起，然后再减少帧率以生成具有 *累积运动模糊* 的视频。这种运动模糊看起来很棒，但因为必须每秒渲染更多帧，生成可能需要很长时间（除了后期处理所花费的时间之外）。
zh_tw: 如果您以原始影格速率的倍數錄製影片，則可以將影格混合在一起，然後減少影格速率以產生具有*累積運動模糊*的影片。這種運動模糊看起來非常好，但生成可能需要很長時間，因為您必須每秒算繪更多影格（除了後製所花費的時間之外）。

source: Example with a 240 FPS source video, generating 4× motion blur and decreasing its output framerate to 60 FPS:
de: Beispiel mit einem Quellvideo mit 240 FPS, das eine 4fache Bewegungsunschärfe erzeugt und die Ausgangsbildrate auf 60 FPS reduziert:
zh_cn: 以 240 FPS 的源视频为例，生成 4 倍运动模糊并将其输出帧率降低至 60 FPS：
zh_tw: 以 240 FPS 來源視訊為例，產生 4 倍運動模糊並將其輸出影格速率降低至 60 FPS：

source: This also makes effects that converge over several frames (such as temporal antialiasing, SDFGI and volumetric fog) converge faster and therefore look better, since they'll be able to work with more data at a given time. See :ref:`doc_creating_movies_reducing_framerate` if you want to get this benefit without adding motion blur.
de: Dies führt auch dazu, dass Effekte, die über mehrere Frames konvergieren (wie z.B. temporales Antialiasing, SDFGI und volumetrischer Nebel) schneller konvergieren und daher besser aussehen, da sie mit mehr Daten in pro Zeit arbeiten können. Siehe :ref:`doc_creating_movies_reducing_framerate`, wenn Sie diesen Vorteil nutzen wollen, ohne Bewegungsunschärfe hinzuzufügen.
zh_cn: 因为这个操作将能够在给定时间内处理更多数据，所以也会使得在多个帧上的收敛效果（例如时间抗锯齿、SDFGI 和体积雾）变得更快，因此看起来表现更好。如果你想在不添加运动模糊的情况下获得这个表现提升，请参阅 :ref:`doc_creating_movies_reducing_framerate`。
zh_tw: 這也使得在多個影格上收斂的效果（例如時間抗鋸齒、SDFGI 和體積霧）收斂得更快，因此看起來更好，因為它們將能夠在給定時間處理更多資料。如果您想在不新增運動模糊的情況下獲得此優勢，請參閱 doc_creating_movies_reducing_framerate`。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態
