Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/cutout_animation.po
Languages: de, zh_tw

source: Cutout animation
zh_tw: 剪紙動畫

source: What is it?
de: Was ist das?
zh_tw: 它是什麼？

source: Traditionally, `cutout animation <https://en.wikipedia.org/wiki/Cutout_animation>`__ is a type of `stop motion animation <https://en.wikipedia.org/wiki/Stop_motion>`__ in which pieces of paper (or other thin material) are cut into special shapes and arranged in two-dimensional representations of characters and objects. Characters' bodies are usually made out of several pieces. The pieces are arranged and photographed once for each frame of the film. The animator moves and rotates the parts in small increments between each shot to create the illusion of movement when the images are played back quickly in sequence.
de: Traditionell ist die `Cutout-Animation <https://en.wikipedia.org/wiki/Cutout_animation>`__ eine Art der `Stop-Motion-Animation <https://en.wikipedia.org/wiki/Stop_motion>`__, bei der Papierstücke (oder anderes dünnes Material) in spezielle Formen geschnitten und zu zweidimensionalen Darstellungen von Charakteren und Objekten angeordnet werden. Die Körper der Charaktere bestehen in der Regel aus mehreren Teilen. Die Teile werden angeordnet und für jedes Bild des Films einmal fotografiert. Der Animateur bewegt und dreht die Teile in kleinen Schritten zwischen jeder Aufnahme, um die Illusion von Bewegung zu erzeugen, wenn die Bilder schnell hintereinander abgespielt werden.
zh_tw: 傳統意義上, `剪影動畫 <https://en.wikipedia.org/wiki/Cutout_animation>`__ 是一種 `定格動畫 <https://zh.wikipedia.org/zh-cn/%E5%AE%9A%E6%A0%BC%E5%8A%A8%E7%94%BB>`__ . 在剪影動畫中, 人們把紙片(或者其他的薄材料)剪成特殊的形狀, 來組合成角色和物體的二維形象. 角色的身體通常是由幾個元件組成的. 這些元件在動畫的每一影格中形成一種組合, 之後對其攝影. 動畫製作者在兩次攝影之間將這些部分進行很小幅度的移動和旋轉, 這樣, 當這些攝影的畫面以很快的速度連續依次播放時, 就可以造成這些角色和物體在連續運動的假像.

source: Simulations of cutout animation can now be created using software as seen in `South Park <https://en.wikipedia.org/wiki/South_Park>`__ and `Jake and the Never Land Pirates <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
de: Simulationen von Cutout-Animationen können jetzt mit Hilfe von Software erstellt werden, wie in `South Park <https://en.wikipedia.org/wiki/South_Park>`__ und `Jake und die Nimmerland Piraten <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
zh_tw: 現在可以用軟體製作剪紙動畫的模擬，如`《南方公園》 <https://zh.wikipedia.org/zh-cn/%E5%8D%97%E6%96%B9%E5%85%AC%E5%9C%92>`__和`《傑克與夢幻島海盜》 <https://zh.wikipedia.org/zh-cn/%E5%82%91%E5%85%8B%E8%88%87%E5%A4%A2%E5%B9%BB%E5%B3%B6%E6%B5%B7%E7%9B%9C>`__。

source: In video games, this technique has also become popular. Examples of this are `Paper Mario <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ or `Rayman Origins <https://en.wikipedia.org/wiki/Rayman_Origins>`__ .
de: Auch in Videospielen ist diese Technik populär geworden. Beispiele dafür sind `Paper Mario <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ oder `Rayman Origins <https://en.wikipedia.org/wiki/Rayman_Origins>`__.
zh_tw: 在影片遊戲中，這種技術也變得流行。例如`《紙片馬里奧》 <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__或 `《雷曼 起源》 <https://zh.wikipedia.org/zh-cn/%E9%9B%B7%E5%B0%84%E8%B6%85%E4%BA%BA_%E8%B5%B7%E6%BA%90>`__。

source: Cutout animation in Godot
zh_tw: Godot 中的剪紙動畫

source: Godot provides tools for working with cutout rigs, and is ideal for the workflow:
de: Godot bietet Tools für die Arbeit mit Cutout-Rigs und ist ideal für den Workflow:
zh_tw: Godot 提供了一些工具，用於剪紙動畫的綁定，而且是工作流的理想選擇：

source: **The animation system is fully integrated with the engine**: This means animations can control much more than just motion of objects. Textures, sprite sizes, pivots, opacity, color modulation, and more, can all be animated and blended.
de: **Das Animationssystem ist vollständig in die Engine integriert**: Das bedeutet, dass Animationen viel mehr als nur die Bewegung von Objekten steuern können. Texturen, Sprite-Größen, Pivotpunkte, Deckkraft, Farbmodulation und vieles mehr können animiert und überblendet werden.
zh_tw: **動畫系統與引擎完全集成**：這意味著動畫可以控制的不僅僅是物體的運動。紋理、精靈大小、軸心、不透明度、顏色調變等都可以進行動畫和混合。

source: **Combine animation styles**: AnimatedSprite2D allows traditional cel animation to be used alongside cutout animation. In cel animation different animation frames use entirely different drawings rather than the same pieces positioned differently. In an otherwise cutout-based animation, cel animation can be used selectively for complex parts such as hands, feet, changing facial expressions, etc.
de: **Kombinieren Sie Animationsstile**: AnimatedSprite2D ermöglicht die Verwendung der traditionellen Cel-Animation neben der Cutout-Animation. Bei der Cel-Animation werden für verschiedene Animations-Frames völlig unterschiedliche Zeichnungen verwendet, anstatt dieselben Teile unterschiedlich zu positionieren. In einer ansonsten Cutout-basierten Animation kann die Cel-Animation selektiv für komplexe Teile wie Hände, Füße, wechselnde Gesichtsausdrücke usw. verwendet werden.
zh_tw: **混合動畫風格** : 動畫精靈允許將傳統賽璐璐動畫與剪紙動畫一起使用. 在賽璐璐動畫中, 不同的動畫影格使用完全不同的繪圖, 而不是相同的片段位置不同. 在其他基於剪紙的動畫中, 賽璐璐動畫可以選擇性地用於複雜的元件, 例如手, 腳, 改變面部表情等.

source: **Custom Shaped Elements**: Custom shapes can be created with :ref:`Polygon2D <class_Polygon2D>` allowing UV animation, deformations, etc.
de: **Benutzerdefinierte Form-Elemente**: Benutzerdefinierte Formen können mit :ref:`Polygon2D <class_Polygon2D>` erstellt werden und erlauben UV-Animation, Verformungen, etc.
zh_tw: **自訂形狀元素** : 可以用 :ref:`Polygon2D <class_Polygon2D>` 建立自訂形狀, 允許UV動畫, 變形等.

source: **Particle Systems**: A cutout animation rig can be combined with particle systems. This can be useful for magic effects, jetpacks, etc.
de: **Partikelsysteme**: Ein ausgeschnittenes Animations-Rig kann mit Partikelsystemen kombiniert werden. Dies kann für magische Effekte, Jetpacks, etc. nützlich sein.
zh_tw: **粒子系統** : 剪紙式動畫配件可以與粒子系統相結合, 這對魔法效果, 噴氣背包等很有用.

source: **Custom Colliders**: Set colliders and influence areas in different parts of the skeletons, great for bosses and fighting games.
de: **Benutzerdefinierte Collider**: Legen Sie Collider und Einflussbereiche in verschiedenen Teilen der Skelette fest, ideal für Bosse und Kampfspiele.
zh_tw: **自訂碰撞器**：在骨架的不同部位設定碰撞器和影響區域，非常適合 Boss 和格鬥遊戲。

source: **Animation Tree**: Allows complex combinations and blending between several animations, the same way it works in 3D.
de: **Animationsbaum**: Ermöglicht komplexe Kombinationen und Blending zwischen mehreren Animationen, wie es auch in 3D der Fall ist.
zh_tw: **動畫樹** : 允許在幾個動畫之間進行複雜的組合和混合, 與3D動畫的工作方式相同.

source: And much more!
de: Und vieles mehr!
zh_tw: 以及更多！

source: Making of GBot
de: Die Erstellung von GBot
zh_tw: 製作 GBot

source: For this tutorial, we will use as demo content the pieces of the `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ character, created by Andreas Esau.
de: Für dieses Tutorial werden wir als Demo-Inhalt die Teile des Charakters `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ verwenden, die von Andreas Esau erstellt wurde.
zh_tw: 在本教學中，我們將使用由 Andreas Esau 建立的 `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ 角色作為演示。

source: Get your assets: `cutout_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/cutout_animation_assets.zip>`_.
de: Holen Sie sich die Assets: `cutout_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/cutout_animation_assets.zip>`_.
zh_tw: 取得您的資源：`cutout_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/cutout_animation_assets.zip>`_。

source: Setting up the rig
de: Einrichten des Rigs
zh_tw: 設定裝配

source: Create an empty Node2D as root of the scene, we will work under it:
de: Erstellen Sie einen leeren Node2D als Root der Szene, um darunter zu arbeiten:
zh_tw: 建立一個空的Node2D作為場景的根, 我們將在它下面工作:

source: The first node of the model is the hip. Generally, both in 2D and 3D, the hip is the root of the skeleton. This makes it easier to animate:
de: Der erste Node des Modells ist die Hüfte. Im Allgemeinen ist die Hüfte sowohl in 2D als auch in 3D der Root des Skeletts. Das macht es einfacher, es zu animieren:
zh_tw: 模型的第一個節點是臀部。一般來說，無論是 2D 還是 3D，臀部都是骨架的根部。這使得它更容易製作動畫：

source: Next will be the torso. The torso needs to be a child of the hip, so create a child sprite and load the torso texture, later accommodate it properly:
de: Als nächstes kommt der Torso. Der Torso muss ein Child-Element der Hüfte sein, also erstellen Sie ein Child-Sprite und laden Sie die Torso-Textur, später passen Sie sie richtig an:
zh_tw: 接下來將是軀幹, 軀幹需要是臀部的子級, 所以要建立一個子級精靈, 並載入軀幹紋理, 然後適當地調整它:

source: This looks good. Let's see if our hierarchy works as a skeleton by rotating the torso. We can do this be pressing :kbd:`E` to enter rotate mode, and dragging with the left mouse button. To exit rotate mode hit :kbd:`ESC`.
de: Das sieht gut aus. Schauen wir, ob unsere Hierarchie als Skelett funktioniert, indem wir den Torso rotieren. Wir können dies tun, indem wir :kbd:`E` drücken, um den Rotationsmodus zu aktivieren, und mit der linken Maustaste ziehen. Um den Rotationsmodus zu verlassen, drücken Sie :kbd:`ESC`.
zh_tw: 這看起來不錯。讓我們通過旋轉軀幹來看看層次結構是否能像骨架一樣工作。可以按 :kbd:`E` 進入旋轉模式，然後用滑鼠左鍵拖動。要退出旋轉模式，請按 :kbd:`ESC`。

source: The rotation pivot is wrong and needs to be adjusted.
de: Der Rotations-Pivotpunkt ist falsch und muss angepasst werden.
zh_tw: 旋轉軸心錯誤，需要調整。

source: This small cross in the middle of the :ref:`Sprite2D <class_Sprite2D>` is the rotation pivot:
de: Dieses kleine Kreuz in der Mitte des :ref:`Sprite2D <class_Sprite2D>` ist der Rotations-Pivotpunkt:
zh_tw: :ref:`Sprite <class_Sprite>` 中間的這個小十字就是旋轉軸心：

source: Adjusting the pivot
de: Anpassen des Pivotpunkts
zh_tw: 調整軸心

source: The pivot can be adjusted by changing the *offset* property in the Sprite2D:
de: Der Pivotpunkt kann durch Ändern der Property *offset* im Sprite2D angepasst werden:
zh_tw: 可以通過更改 Sprite 中的 *offset* 屬性來調整軸心：

source: The pivot can also be adjusted *visually*. While hovering over the desired pivot point, press :kbd:`V` to move the pivot there for the selected Sprite2D. There is also a tool in the tool bar that has a similar function.
de: Der Pivotpunkt kann auch *visuell* eingestellt werden. Während Sie den Mauszeiger über den gewünschten Pivotpunkt halten, drücken Sie :kbd:`V`, um den Pivotpunkt für das ausgewählte Sprite2D dorthin zu verschieben. Es gibt auch ein Tool in der Toolbar, das eine ähnliche Funktion hat.
zh_tw: 軸心也可以進行*視覺化*的調整。將滑鼠懸停在所需的軸心點上時，按 :kbd:`V` 移動所選 Sprite 的軸心。工具列中還有一個工具也有類似的功能。

source: Continue adding body pieces, starting with the right arm. Make sure to put each sprite in its correct place in the hierarchy, so its rotations and translations are relative to its parent:
de: Fügen Sie weitere Körperteile hinzu und beginnen Sie mit dem rechten Arm. Achten Sie darauf, jedes Sprite an der richtigen Stelle in der Hierarchie zu platzieren, damit seine Rotationen und Translationen relativ zu seinem Parent sind:
zh_tw: 繼續新增身體元件, 從右臂開始. 確保將每個精靈放在其在層次結構中的正確位置, 其旋轉和平移都是相對於其父級而言的:

source: With the left arm there's a problem. In 2D, child nodes appear in front of their parents:
de: Beim linken Arm gibt es ein Problem. In 2D erscheinen die Child-Nodes vor ihren Parents:
zh_tw: 左臂有些問題. 在二維中, 子節點出現在父節點的前面:

source: We want the left arm to appear *behind* the hip and the torso. We could move the left arm nodes behind the hip (above the hip node in the scene hierarchy), but then the left arm is no longer in its proper place in the hierarchy. This means it wouldn't be affected by the movement of the torso. We'll fix this problem with ``RemoteTransform2D`` nodes.
de: Wir wollen, dass der linke Arm *hinter* der Hüfte und dem Torso erscheint. Wir könnten die Nodes des linken Arms hinter die Hüfte verschieben (über den Node der Hüfte in der Szenenhierarchie), aber dann ist der linke Arm nicht mehr an seinem richtigen Platz in der Hierarchie. Das bedeutet, daß er von der Bewegung des Torsos nicht beeinflußt werden würde. Wir werden dieses Problem mit ``RemoteTransform2D``-Nodes beheben.
zh_tw: 我們希望左臂出現在臀部和軀幹的 *後面* . 我們可以將左臂節點在場景層次結構中移到臀部節點上面, 但這樣一來, 左臂在層次結構中的位置就不對了, 這意味著它不會受到軀幹移動的影響. 我們用 ``RemoteTransform2D`` 節點來解決這個問題.

source: You can also fix depth ordering problems by adjusting the Z property of any node inheriting from Node2D.
de: Sie können auch Probleme mit der Tiefenanordnung beheben, indem Sie die Z-Property eines beliebigen Nodes, der von Node2D geerbt hat, anpassen.
zh_tw: 還可以通過調整從二維節點繼承的任何節點的Z屬性, 來修復深度排序問題.

source: RemoteTransform2D node
zh_tw: RemoteTransform2D 節點

source: The :ref:`RemoteTransform2D <class_RemoteTransform2D>` node transforms nodes somewhere else in the hierarchy. This node applies its own transform (including any transformation it inherits from its parents) to the remote node it targets.
de: Der :ref:`RemoteTransform2D <class_RemoteTransform2D>`-Node transformiert Nodes an anderer Stelle in der Hierarchie. Dieser Node wendet seine eigene Transformation (einschließlich aller Transformationen, die er von seinen Eltern erbt) auf den entfernten Node an, den er anvisiert.
zh_tw: :ref:`RemoteTransform2D <class_RemoteTransform2D>` 節點對層次結構中其他地方的節點進行變換. 這個節點將自己的變換, 包括它從父節點繼承的任何變換, 應用到它所針對的遙控節點.

source: This allows us to correct the visibility order of our elements, independently of the locations of those parts in the cutout hierarchy.
de: Auf diese Weise können wir die Sichtbarkeitsreihenfolge unserer Elemente korrigieren, unabhängig von der Position dieser Teile in der Cutout-Hierarchie.
zh_tw: 這使我們能夠修正元素的可見性順序, 這些部分獨立於在剪裁層次結構中的位置.

source: Create a ``RemoteTransform2D`` node as a child of the torso. Call it ``remote_arm_l``. Create another RemoteTransform2D node inside the first and call it ``remote_hand_l``. Use the ``Remote Path`` property of the two new nodes to target the ``arm_l`` and ``hand_l`` sprites respectively:
de: Erzeugen Sie einen ``RemoteTransform2D``-Node als Child des Torsos. Nennen Sie ihn ``remote_arm_l``. Erzeugen Sie einen weiteren RemoteTransform2D-Node innerhalb des ersten und nennen Sie ihn ``remote_hand_l``. Benutzen Sie die Property ``Remote Path`` der beiden neuen Nodes, um die Sprites ``arm_l`` und ``hand_l`` anzuvisieren:
zh_tw: 建立一個 ``RemoteTransform2D`` 節點作為軀幹的子節點。命名為 ``remote_arm_l``。在第一個節點中再建立一個 RemoteTransform2D 節點並將其命名為 ``remote_hand_l``。讓這兩個新節點的 ``Remote Path`` 屬性分別指向 ``arm_l`` 和 ``hand_l`` 精靈：

source: Moving the ``RemoteTransform2D`` nodes now moves the sprites. So we can create animations by adjusting the ``RemoteTransform2D`` transforms:
de: Das Bewegen der ``RemoteTransform2D``-Nodes bewegt nun die Sprites. Wir können also Animationen erzeugen, indem wir die ``RemoteTransform2D``-Transformationen anpassen:
zh_tw: 移動 ``RemoteTransform2D`` 節點現在可以移動精靈. 所以可以通過調整 ``RemoteTransform2D`` 變換來建立動畫:

source: Completing the skeleton
de: Vervollständigen des Skeletts
zh_tw: 完成骨架

source: Complete the skeleton by following the same steps for the rest of the parts. The resulting scene should look similar to this:
de: Vervollständigen Sie das Skelett, indem Sie die gleichen Schritte für die restlichen Teile ausführen. Die resultierende Szene sollte ungefähr so aussehen:
zh_tw: 按照其餘部分的相同步驟完成骨架。生成的場景應該類似於：

source: The resulting rig will be easy to animate. By selecting the nodes and rotating them you can animate forward kinematics (FK) efficiently.
de: Das resultierende Rig ist einfach zu animieren. Durch Auswahl der Nodes und deren Rotation können Sie die Vorwärtskinematik (Forward Kinematics, FK) effizient animieren.
zh_tw: 生成的裝備很容易製作動畫. 通過選擇節點並旋轉它們, 您可以有效地為前向運動學(FK)設定動畫.

source: For simple objects and rigs this is fine, but there are limitations:
de: Für einfache Objekte und Rigs ist dies in Ordnung, es gibt jedoch Einschränkungen:
zh_tw: 對於簡單的物體和裝配來說已經足夠了, 但仍然有限制:

source: Selecting sprites in the main viewport can become difficult in complex rigs. The scene tree ends up being used to select parts instead, which can be slower.
de: Die Auswahl von Sprites im Haupt-Viewport kann bei komplexen Rigs schwierig werden. Stattdessen wird der Szenenbaum verwendet, um Teile auszuwählen, was langsamer sein kann.
zh_tw: 在複雜的裝配中, 在主視口中選擇精靈會變得很困難. 場景樹最終被替代, 用來選擇元件, 這可能會比較慢.

source: Inverse Kinematics (IK) is useful for animating extremities like hands and feet, and can't be used with our rig in its current state.
de: Inverse Kinematik (IK) ist nützlich für die Animation von Extremitäten wie Händen und Füßen und kann mit unserem Rig in seinem aktuellen Zustand nicht verwendet werden.
zh_tw: 反向動力學（Inverse Kinematics、IK）對於手腳等肢體的運動非常有用，目前我們的綁定還無法使用。

source: To solve these problems we'll use Godot's skeletons.
de: Um diese Probleme zu lösen, werden wir Godots Skelette benutzen.
zh_tw: 為了解決這些問題，我們將會使用 Godot 的骨架。

source: Skeletons
de: Skelette
zh_tw: 骨架

source: In Godot there is a helper to create "bones" between nodes. The bone-linked nodes are called skeletons.
de: In Godot gibt es ein Hilfsmittel zum Erstellen von "Knochen" zwischen Nodes. Die mit Knochen verknüpften Nodes werden als Skelette bezeichnet.
zh_tw: 在 Godot 中，有一個在節點之間建立“骨骼”的輔助工具。骨骼連接起的節點稱為骨架。

source: As an example, let's turn the right arm into a skeleton. To create a skeleton, a chain of nodes must be selected from top to bottom:
de: Lassen Sie uns als Beispiel den rechten Arm in ein Skelett verwandeln. Um ein Skelett zu erstellen, muss eine Kette von Nodes von oben nach unten ausgewählt werden:
zh_tw: 舉個例子，讓我們把右臂變成一個骨架。要建立一個骨架，必須從上到下選擇節點鏈：

source: Then, click on the Skeleton menu and select ``Make Bones``.
de: Klicken Sie dann auf das Skelett-Menü und wählen Sie ``Knochen erzeugen``.
zh_tw: 然後按一下“骨架”功能表並選擇 ``製作骨骼``。

source: This will add bones covering the arm, but the result may be surprising.
de: Dadurch werden Knochen hinzugefügt, die den Arm verdecken, aber das Ergebnis ist vielleicht unerwartet.
zh_tw: 這將增加覆蓋在手臂上的骨頭, 但結果可能令人驚訝.

source: Why does the hand lack a bone? In Godot, a bone connects a node with its parent. And there's currently no child of the hand node. With this knowledge let's try again.
de: Warum fehlt der Hand ein Knochen? In Godot verbindet ein Knochen einen Node mit seinem Parent. Und es gibt derzeit kein Child des Hand-Nodes. Mit diesem Wissen können wir es noch einmal versuchen.
zh_tw: 為什麼這只手缺少一根骨骼？在 Godot 中，使用骨骼把節點和它的父節點連接起來。目前沒有手節點的子節點。有了這些知識，讓我們再試一次。

source: The first step is creating an endpoint node. Any kind of node will do, but :ref:`Marker2D <class_Marker2D>` is preferred because it's visible in the editor. The endpoint node will ensure that the last bone has orientation.
de: Der erste Schritt ist die Erstellung eines Nodes für den Endpunkt. Jede Art von Node ist geeignet, aber :ref:`Marker2D <class_Marker2D>` ist besser geeignet, da er im Editor sichtbar ist. Der Endpoint Node sorgt dafür, dass der letzte Knochen eine Orientierung hat.
zh_tw: 第一步是建立端點節點. 任何型別的節點都可以, 但是 :ref:`Position2D <class_Position2D>` 是首選, 因為它在編輯器中可見. 端點節點將確保最後一個骨骼具有方向.

source: Now select the whole chain, from the endpoint to the arm and create bones:
de: Wählen Sie nun die gesamte Kette, vom Endpunkt bis zum Arm, und erstellen Sie Knochen:
zh_tw: 現在選擇整個鏈, 從端點到手臂並建立骨骼:

source: The result resembles a skeleton a lot more, and now the arm and forearm can be selected and animated.
de: Das Ergebnis ähnelt nun viel mehr einem Skelett, und der Arm und der Unterarm können nun ausgewählt und animiert werden.
zh_tw: 結果更像骨架了，現在可以選擇手臂和前臂並設定動畫。

source: Create endpoints for all important extremities. Generate bones for all articulable parts of the cutout, with the hip as the ultimate connection between all of them.
de: Erstellen Sie Endpunkte für alle wichtigen Extremitäten. Erzeugen Sie Knochen für alle artikulierbaren Teile des Ausschnitts, wobei die Hüfte die entscheidende Verbindung zwischen all diesen Teilen darstellt.
zh_tw: 為所有重要的末端建立端點. 為剪紙的所有可關節部分生成骨骼, 臀部是它們之間的最終連接.

source: You may notice that an extra bone is created when connecting the hip and torso. Godot has connected the hip node to the scene root with a bone, and we don't want that. To fix this, select the root and hip node, open the Skeleton menu, click ``clear bones``.
de: Sie werden feststellen, dass beim Verbinden von Hüfte und Torso ein zusätzlicher Knochen erstellt wird. Godot hat den Node der Hüfte mit einem Knochen mit des Szenen-Root verbunden, und das wollen wir nicht. Um dies zu beheben, wählen Sie den Root- und den Hüftknoten aus, öffnen das Skeleton-Menü und klicken auf ``Knochen löschen``.
zh_tw: 你可能會注意到，在連接臀部和軀幹時，會多出一根骨骼。Godot 用骨骼將臀部節點連接到了場景根部，我們不希望這樣。要解決這個問題，選擇根部和臀部節點，打開“骨架”功能表，點擊 ``清除骨骼``。

source: Your final skeleton should look something like this:
de: Ihre fertiges Skelett sollte in etwa so aussehen:
zh_tw: 您的骨架最後看上去應該是這樣的：

source: You might have noticed a second set of endpoints in the hands. This will make sense soon.
de: Vielleicht haben Sie eine zweite Gruppe von Endpunkten in den Händen bemerkt. Dies wird gleich mehr Sinn ergeben.
zh_tw: 你可能已經注意到了手上的第二組端點. 這很快就會有意義.

source: Now that the whole figure is rigged, the next step is setting up the IK chains. IK chains allow for more natural control of extremities.
de: Nachdem die gesamte Figur geriggt ist, ist der nächste Schritt das Einrichten der IK-Ketten. IK-Ketten ermöglichen eine natürlichere Steuerung der Extremitäten.
zh_tw: 現在整個人物已經裝配好了，下一步就是設定 IK 鏈。IK 鏈可以更自然的控制四肢。

source: IK chains
de: IK-Ketten
zh_tw: IK 鏈

source: IK stands for inverse kinematics. It's a convenient technique for animating the position of hands, feet and other extremities of rigs like the one we've made. Imagine you want to pose a character's foot in a specific position on the ground. Without IK chains, each motion of the foot would require rotating and positioning several other bones (the shin and the thigh at least). This would be quite complex and lead to imprecise results. IK allows us to move the foot directly while the shin and thigh self-adjust.
de: IK steht für Inverse Kinematik. Es ist eine praktische Methode, um die Position von Händen, Füßen und anderen Extremitäten von Rigs wie dem von uns erstellten zu animieren. Stellen Sie sich vor, Sie möchten den Fuß eines Charakters in einer bestimmten Position auf dem Boden positionieren. Ohne IK-Ketten würde jede Bewegung des Fußes die Drehung und Positionierung mehrerer anderer Knochen erfordern (zumindest des Unterschenkels und des Oberschenkels). Das wäre ziemlich komplex und würde zu ungenauen Ergebnissen führen. Mit IK können wir den Fuß direkt bewegen, während sich der Unterschenkel und der Oberschenkel selbst einstellen.
zh_tw: IK 是反向動力學（Inverse Kinematics）的縮寫，給手部、足部以及其它肢體的動畫帶來便利。想像一下，您想要將角色的腳放在地面上的特定位置。如果沒有 IK 鏈，腳的每次運動都需要旋轉和定位其他幾個骨骼（至少得涉及大腿及小腿）。這將非常複雜並導致不精確的結果。

source: **IK chains in Godot currently work in the editor only**, not at runtime. They are intended to ease the process of setting keyframes, and are not currently useful for techniques like procedural animation.
de: **IK-Ketten in Godot funktionieren derzeit nur im Editor**, nicht zur Laufzeit. Sie sollen das Einrichten von Keyframes erleichtern und sind derzeit nicht für Methoden wie prozedurale Animation geeignet.
zh_tw: **Godot 中的 IK 鏈目前僅在編輯器中工作**，而不是在運作時工作。它們旨在簡化設定關鍵影格的過程，目前對於程式動畫等技術沒有用處。

source: To create an IK chain, select a chain of bones from endpoint to the base for the chain. For example, to create an IK chain for the right leg, select the following:
de: Um eine IK-Kette zu erstellen, wählen Sie eine Kette von Knochen vom Endpunkt bis zur Basis für die Kette aus. Um zum Beispiel eine IK-Kette für das rechte Bein zu erstellen, wählen Sie Folgendes aus:
zh_tw: 要建立 IK 鏈，請選擇從端點到鏈基的骨骼鏈。例如，要為右腿建立一條 IK 鏈，選擇以下：

source: Then enable this chain for IK. Go to Edit > Make IK Chain.
de: Aktivieren Sie dann diese Kette für IK. Wechseln Sie zu Bearbeiten > IK-Kette erstellen.
zh_tw: 然後為 IK 啟用此鏈。轉到“編輯 > 製作 IK 鏈”。
