Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/cutout_animation.po
Languages: de, zh_tw

source: As a result, the base of the chain will turn *Yellow*.
de: Dadurch wird die Basis der Kette *Gelb*.
zh_tw: 結果，鏈的基部將變為*黃色*。

source: Once the IK chain is set up, grab any child or grand-child of the base of the chain (e.g. a foot), and move it. You'll see the rest of the chain adjust as you adjust its position.
de: Sobald die IK-Kette eingerichtet ist, greifen Sie ein beliebiges untergeordnetes Element entlang der Kette (z. B. einen Fuß) und bewegen es. Sie werden sehen, dass sich der Rest der Kette anpasst, wenn Sie seine Position ändern.
zh_tw: 一旦 IK 鏈設定完畢，抓住任何鏈基（例如腳部）的任意巢狀子節點並移動。你會看到鏈的剩餘部分跟隨你的移動調整位置。

source: Animation tips
de: Tipps zur Animation
zh_tw: 動畫

source: The following section will be a collection of tips for creating animation for your cutout rigs. For more information on how the animation system in Godot works, see :ref:`doc_introduction_animation`.
de: Der folgende Abschnitt ist eine Sammlung von Tipps zur Erstellung von Animationen für Ihre Cutout-Rigs. Weitere Informationen darüber, wie das Animationssystem in Godot funktioniert, finden Sie unter :ref:`Doc_introduction_animation`.
zh_tw: 下一節將是建立剪紙動畫的技巧集合。關於 Godot 中的動畫系統如何工作的更多資訊，請參閱 :ref:`doc_introduction_animation`。

source: Setting keyframes and excluding properties
de: Festlegen von Keyframes und Ausschließen von Propertys
zh_tw: 設定關鍵影格和排除屬性

source: Special contextual elements appear in the top toolbar when the animation editor window is open:
de: Spezielle Kontextelemente werden in der oberen Toolbar angezeigt, wenn das Animations-Editorfenster geöffnet ist:
zh_tw: 當動畫編輯器視窗打開時, 特殊的本文元素會出現在頂部工具列中:

source: The key button inserts location, rotation, and scale keyframes for the selected objects or bones at the current playhead position.
de: Der Key-Button fügt Positions-, Rotations- und Skalierungs-Keyframes für die ausgewählten Objekte oder Knochen an der aktuellen Abspielkopfposition ein.
zh_tw: 按鍵按鈕在目前遊戲開始位置為選定的物件或骨骼插入位置, 旋轉和縮放關鍵影格.

source: The "loc", "rot", and "scl" toggle buttons to the left of the key button modify its function, allowing you to specify which of the three properties keyframes will be created for.
de: Mit den Schalter-Buttons "loc", "rot" und "scl" links neben dem Schlüssel können Sie deren Funktion ändern und festlegen, für welche der drei Propertys Keyframes erstellt werden sollen.
zh_tw: 通過切換關鍵影格按鈕左邊的 "位置" , "旋轉" 和 "縮放" 按鈕, 可以修改其功能, 允許您指定將為三個屬性中的哪一個建立關鍵影格.

source: Here's an illustration of how this can be useful: Imagine you have a node which already has two keyframes animating its scale only. You want to add an overlapping rotation movement to the same node. The rotation movement should begin and end at different times from the scale change that's already set up. You can use the toggle buttons to have only rotation information added when you add a new keyframe. This way, you can avoid adding unwanted scale keyframes which would disrupt the existing scale animation.
de: Hier ist eine Illustration, wie dies nützlich sein kann: Stellen Sie sich vor, Sie haben einen Node, der bereits zwei Keyframes hat, die nur seine Skalierung animieren. Sie möchten demselben Node eine überlappende Rotationsbewegung hinzufügen. Die Rotation soll zu einem anderen Zeitpunkt beginnen und enden als die Skalierungsänderung, die bereits eingerichtet ist. Mit den Schalterbuttons können Sie festlegen, dass beim Hinzufügen eines neuen Keyframes nur Rotationsinformationen hinzugefügt werden. Auf diese Weise können Sie vermeiden, dass unerwünschte Skalierungs-Keyframes hinzugefügt werden, die eine bestehende Skalierungsanimation unterbrechen würden.
zh_tw: 下面是一個例子, 說明如何使用其的: 假設您有一個節點, 其中已經有兩個關鍵影格只對其縮放進行動畫. 您想在同一個節點重疊新增旋轉移動. 旋轉運動應該在不同的時間開始和結束, 與已經設定的縮放變化不同. 在新增新關鍵影格時, 可以使用切換按鈕, 只新增旋轉資訊. 這樣, 您就可以避免新增不需要的縮放關鍵影格, 破壞現有的縮放動畫.

source: Creating a rest pose
de: Erstellen einer Standardpose
zh_tw: 建立內容

source: Think of a rest pose as a default pose that your cutout rig should be set to when no other pose is active in your game. Create a rest pose as follows:
de: Stellen Sie sich eine Standardpose (auch Rest-Pose) als eine Default-Pose vor, auf die Ihr Cutout-Rig eingestellt werden sollte, wenn keine andere Pose in Ihrem Spiel aktiv ist. Erstellen Sie eine Standardpose wie folgt:
zh_tw: 將放鬆姿勢視為預設姿勢，當遊戲中沒有其他姿勢處於活動狀態時，應該將其設定為剪紙綁定。創造一個放鬆姿勢如下：

source: 1. Make sure the rig parts are positioned in what looks like a "resting" arrangement.
de: 1. Stellen Sie sicher, dass die Rig-Teile so positioniert sind, dass sie wie eine "ruhende" Anordnung aussehen.
zh_tw: 1. 確保綁定元件處於 "休息" 狀態.

source: Create a new animation, rename it "rest".
de: Erstellen Sie eine neue Animation und benennen Sie sie in "rest" um.
zh_tw: 建立內容

source: Select all nodes in your rig (box selection should work fine).
de: Wählen Sie alle Nodes in Ihrem Rig aus (die Box-Auswahl sollte gut funktionieren).
zh_tw: 選擇裝配中的所有節點(應該可以框選).

source: 4. Make sure the "loc", "rot", and "scl" toggle buttons are all active in the toolbar.
de: 4. Stellen Sie sicher, dass die Schalterbuttons "loc", "rot" und "scl" in der Toolbar aktiviert sind.
zh_tw: 4. 確保工具列中的 "位置" , "旋轉" 和 "縮放" 切換按鈕都是活動的.

source: 5. Press the key button. Keys will be inserted for all selected parts storing their current arrangement. This pose can now be recalled when necessary in your game by playing the "rest" animation you've created.
de: 5. Drücken Sie die Schlüssel-Button. Keys werden für alle ausgewählten Teile eingefügt und ihre aktuelle Anordnung gespeichert. Diese Pose kann nun bei Bedarf in Ihrem Spiel abgerufen werden, indem Sie die von Ihnen erstellte "rest"-Animation abspielen.
zh_tw: 5. 按下關鍵影格按鈕。關鍵影格將插入所有選擇的元件，以儲存它們的目前佈局。現在，當你需要的時候，你可以通過播放你建立的“放鬆”動畫來再次調出你的姿勢。

source: Modifying rotation only
de: Nur Rotation ändern
zh_tw: 只修改旋轉

source: When animating a cutout rig, often it's only the rotation of the nodes that needs to change. Location and scale are rarely used.
de: Bei der Animation eines Cutout-Rigs muss oft nur die Rotation der Nodes geändert werden. Position und Skalierung werden nur selten verwendet.
zh_tw: 當製作剪紙動畫綁定時, 通常只需要改變節點的旋轉. 很少使用位置和比例.

source: So when inserting keys, you might find it convenient to have only the "rot" toggle active most of the time:
de: Beim Einfügen von Keys kann es also sinnvoll sein, die meiste Zeit nur den "rot"-Schalter zu aktivieren:
zh_tw: 因此, 在插入鍵時, 你可能會發現在大多數時間裡只有 "rot" 切換鍵處於啟動狀態, 會很方便:

source: This will avoid the creation of unwanted animation tracks for position and scale.
de: Dadurch wird die Erstellung unerwünschter Animationsspuren für Position und Skalierung vermieden.
zh_tw: 這將避免為座標和縮放建立不必要的動畫軌道.

source: Keyframing IK chains
de: Keyframing von IK-Ketten
zh_tw: 關鍵影格 IK 鏈

source: When editing IK chains, it's not necessary to select the whole chain to add keyframes. Selecting the endpoint of the chain and inserting a keyframe will automatically insert keyframes for all other parts of the chain too.
de: Wenn Sie IK-Ketten bearbeiten, müssen Sie nicht die gesamte Kette auswählen, um Keyframes hinzuzufügen. Wenn Sie den Endpunkt der Kette auswählen und einen Keyframe einfügen, werden automatisch auch für alle anderen Teile der Kette Keyframes eingefügt.
zh_tw: 編輯IK鏈時, 不需要選擇整個鏈來新增關鍵影格. 選擇鏈的端點並插入關鍵影格將自動為鏈的所有其他部分插入關鍵影格.

source: Visually move a sprite behind its parent
de: Ein Sprite visuell hinter seinen Parent verschieben
zh_tw: 視覺上移動父級後面的精靈

source: Sometimes it is necessary to have a node change its visual depth relative to its parent node during an animation. Think of a character facing the camera, who pulls something out from behind his back and holds it out in front of him. During this animation the whole arm and the object in his hand would need to change their visual depth relative to the body of the character.
de: Manchmal ist es notwendig, dass ein Node während einer Animation seine visuelle Tiefe relativ zu seinem Parent-Node ändert. Stellen Sie sich eine Figur vor, die der Kamera zugewandt ist und etwas hinter ihrem Rücken hervorzieht und es vor sich hält. Während dieser Animation müssten der gesamte Arm und das Objekt in seiner Hand ihre visuelle Tiefe relativ zum Körper der Figur ändern.
zh_tw: 有時, 在動畫過程中, 需要讓節點相對於其父節點更改其可視深度. 想像一個面對鏡頭的角色, 他從背後拿出一個東西放在面前. 在這個動畫過程中, 整個手臂和他手中的物體都需要改變相對於角色身體的視覺深度.

source: To help with this there's a keyframable "Behind Parent" property on all Node2D-inheriting nodes. When planning your rig, think about the movements it will need to perform and give some thought to how you'll use "Behind Parent" and/or RemoteTransform2D nodes. They provide overlapping functionality.
de: Zu diesem Zweck gibt es eine keyframe-abhängige "Hinter Parent"-Property für alle von Node2D erbenden Nodes. Überlegen Sie sich bei der Planung Ihres Rigs, welche Bewegungen es ausführen soll, und überlegen Sie sich, wie Sie "Hinter Parent"- und/oder RemoteTransform2D-Nodes verwenden werden. Sie bieten überlappende Funktionen.
zh_tw: 為了幫助解決這個問題，在所有 Node2D 的衍生節點上都有一個可製作關鍵影格的“Behind Parent”（在父級之後）屬性。規劃綁定時，請考慮它需要執行的動作，並考慮如何使用“Behind Parent”和/或 RemoteTransform2D 節點。它們提供重疊的功能。

source: Setting easing curves for multiple keys
de: Festlegen von Easing-Kurven für mehrere Tasten
zh_tw: 為多個關鍵影格設定緩動曲線

source: To apply the same easing curve to multiple keyframes at once:
de: Um dieselbe Easing-Kurve auf mehrere Keyframes gleichzeitig anzuwenden:
zh_tw: 要將同一緩動曲線同時應用於多個關鍵影格:

source: Select the relevant keys.
de: Wählen Sie die entsprechenden Keys aus.
zh_tw: 選擇相關的關鍵影格.

source: Click on the pencil icon in the bottom right of the animation panel. This will open the transition editor.
de: Klicken Sie auf das Stiftsymbol unten rechts im Animationsfenster, um den Übergangseditor zu öffnen.
zh_tw: 點擊動畫面板右下角的鉛筆圖示. 這將打開過渡編輯器.

source: In the transition editor, click on the desired curve to apply it.
de: Klicken Sie im Übergangseditor auf die gewünschte Kurve, um sie anzuwenden.
zh_tw: 在過渡編輯器中, 點擊所需曲線進行應用.

source: 2D Skeletal deform
de: 2D-Skelettverformung
zh_tw: 2D 骨架變形

source: Skeletal deform can be used to augment a cutout rig, allowing single pieces to deform organically (e.g. antennae that wobble as an insect character walks).
de: Skelettverformung kann verwendet werden, um ein Cutout-Rig zu erweitern, so dass sich einzelne Teile organisch verformen können (z. B. Fühler, die wackeln, wenn eine Insektenfigur läuft).
zh_tw: 骨架變形（Skeletal Deform）可以用來增強剪紙綁定，允許單個元件有組織地變形（例如，像昆蟲走路時擺動的觸角一樣）。

source: This process is described in a :ref:`separate tutorial <doc_2d_skeletons>`.
de: Dieser Prozess wird in einer :ref:`separaten Anleitung <doc_2d_skeletons>` beschrieben.
zh_tw: 這個過程在:ref:`單獨的教學 <doc_2d_skeletons>`中講述。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
