Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/introduction.po
Languages: de, zh_cn

source: You can tweak your animations this way until the movement "looks right."
de: Sie können Ihre Animationen auf diese Weise optimieren, bis die Bewegung "richtig" aussieht.
zh_cn: 你可以通过这种方式调整动画，直到运动“看起来正确”。

source: Using RESET tracks
de: RESET-Tracks verwenden
zh_cn: 使用 RESET 轨道

source: You can set up a special *RESET* animation to contain the "default pose". This is used to ensure that the default pose is restored when you save the scene and open it again in the editor.
de: Sie können eine spezielle *RESET*-Animation einrichten, so dass sie die "Default-Pose" enthält. Diese wird verwendet, um sicherzustellen, dass die Default-Pose wiederhergestellt wird, wenn Sie die Szene speichern und erneut im Editor öffnen.
zh_cn: 你可以设置一个特殊的 *RESET*\ （重置）动画来包含“默认姿势”。这样就可以保证在保存场景并重新在编辑器中打开时，会恢复默认姿势。

source: For existing tracks, you can add an animation called "RESET" (case-sensitive), then add tracks for each property that you want to reset. The only keyframe should be at time 0, and give it the desired default value for each track.
de: Bei vorhandenen Tracks können Sie eine Animation mit dem Namen "RESET" (Groß- und Kleinschreibung beachten) hinzufügen und dann Tracks für jede Property, die Sie zurücksetzen möchten, hinzufügen. Der einzige Keyframe sollte zum Zeitpunkt 0 sein, und ihr den gewünschten Default-Wert für jeden Track geben.
zh_cn: 对于已存在的轨道，你可以添加一个名为“RESET”（大小写敏感）的动画，然后为每一个你希望重置的属性添加轨道。应该只在时间为 0 处存在一个关键帧，其值为每条轨道所期望的默认值。

source: If AnimationPlayer's **Reset On Save** property is set to ``true``, the scene will be saved with the effects of the reset animation applied (as if it had been seeked to time ``0.0``). This only affects the saved file – the property tracks in the editor stay where they were.
de: Wenn die Property **Reset On Save** des AnimationPlayers auf ``true`` gesetzt ist, wird die Szene mit den Effekten der zurückgesetzten Animation gespeichert (als ob sie zur Zeit ``0.0`` angesprungen worden wäre). Dies betrifft nur die gespeicherte Datei - die Property-Tracks im Editor bleiben, wo sie waren.
zh_cn: 如果 AnimationPlayer 的 **Reset On Save**\ （保存时重置）属性为 ``true``\ ，场景在保存时会应用重置动画的效果（相当于寻道到 ``0.0`` 时间点的效果）。只有保存的文件会受到影响——编辑器中的属性轨道还是会保持原样。

source: If you want to reset the tracks in the editor, select the AnimationPlayer node, open the **Animation** bottom panel then choose **Apply Reset** in the animation editor's **Edit** dropdown menu.
de: Wenn Sie die Tracks im Editor zurücksetzen möchten, wählen Sie den AnimationPlayer-Node aus, öffnen Sie das untere Panel **Animation** und wählen Sie im Dropdown-Menü **Bearbeiten** des Animationseditors die Option **Zurücksetzen anwenden**.
zh_cn: 如果你想要在编辑器中重置轨道，请选中 AnimationPlayer 节点，打开 **动画** 底部面板，然后选择动画编辑器 **动画** 下拉菜单中的 **应用重置** 。

source: When adding tracks on new animations, the editor will ask you to automatically create a RESET track when using the keyframe icon next to a property in the inspector. This does not apply on tracks created with Godot versions prior to 3.4, as the animation reset track feature was added in 3.4.
de: Beim Hinzufügen von Tracks zu neuen Animationen fordert der Editor Sie auf, automatisch einen RESET-Track zu erstellen, wenn Sie das Keyframe-Icon neben einer Property im Inspektor verwenden. Dies gilt nicht für Spuren, die mit Godot-Versionen vor 3.4 erstellt wurden, da die Funktion zum Zurücksetzen von Animationen erst in 3.4 hinzugefügt wurde.
zh_cn: 为新建的动画添加轨道时，如果使用的是检查器中属性旁的关键帧图标，编辑器会询问是否自动添加一条 RESET 轨道。这对于使用 3.4 版本之前的 Godot 创建的轨道并不适用，因为动画重置轨道功能是在 3.4 版本中加入的。

source: RESET tracks is also used as a reference value for blending. See also `For better blending <../animation/animation_tree.html#for-better-blending>`__.
de: RESET-Tracks werden auch als Referenzwert für Blending verwendet. Siehe auch `Für besseres Blending <../animation/animation_tree.html#for-better-blending>`__.
zh_cn: RESET轨道也被用作混合的参考值。另见\ `更好的混合 <../animation/animation_tree.html#for-better-blending>`__\ 。

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
