Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/introduction.po
Languages: de, zh_cn

source: Introduction to the animation features
de: Einführung in die Animations-Features
zh_cn: 动画功能介绍

source: The :ref:`class_AnimationPlayer` node allows you to create anything from simple to complex animations.
de: Der :ref:`class_AnimationPlayer`-Node erlaubt es, allerlei Animationen zu erstellen - von ganz einfachen bis hin zu recht komplexen Abläufen.
zh_cn: :ref:`class_AnimationPlayer` 节点允许你创建从简单到复杂的任何动画。

source: In this guide you learn to:
de: In dieser Einführung lernen Sie:
zh_cn: 在本指南中，你将学会：

source: Work with the Animation Panel
de: mit dem Animationspanel zu arbeiten
zh_cn: 使用动画面板

source: Animate any property of any node
de: Propertys eines beliebigen Nodes zu animieren
zh_cn: 使任何节点的任何属性变成动画

source: Create a simple animation
de: eine simple Animation zu erstellen
zh_cn: 创建简单的动画

source: In Godot, you can animate anything available in the Inspector, such as Node transforms, sprites, UI elements, particles, visibility and color of materials, and so on. You can also modify values of script variables and even call functions.
de: In Godot können Sie alles animieren, was im Inspektor verfügbar ist, z. B. Node-Transformationen, Sprites, UI-Elemente, Partikel, Sichtbarkeit und Farbe von Materialien usw. Sie können auch Werte von Skriptvariablen ändern und sogar Funktionen aufrufen.
zh_cn: 在 Godot 中，你可以对“检查器”中可用的任何内容设置动画，例如 Node 的变换、精灵、UI 元素、粒子、可见性、材质的颜色等等。你还可以修改脚本变量的值、甚至调用任何函数。

source: Create an AnimationPlayer node
de: Einen AnimationPlayer-Node anlegen
zh_cn: 创建 AnimationPlayer 节点

source: To use the animation tools we first have to create an :ref:`class_AnimationPlayer` node.
de: Um die Tools zur Animation zu verwenden, benötigen wir zunächst einen :ref:`class_AnimationPlayer`-Node.
zh_cn: 要使用动画工具, 我们首先必须创建一个 :ref:`class_AnimationPlayer` 节点.

source: The AnimationPlayer node type is the data container for your animations. One AnimationPlayer node can hold multiple animations, which can automatically transition to one another.
de: Der AnimationPlayer-Node ist der Datencontainer für Ihre Animationen. Ein AnimationPlayer Node kann mehrere Animationen enthalten, die automatisch ineinander übergehen können.
zh_cn: AnimationPlayer节点类型是动画的数据容器。一个AnimationPlayer节点可以保存多个动画，这些动画可以自动相互过渡。

source: The AnimationPlayer node
de: Der AnimationPlayer-Node
zh_cn: AnimationPlayer节点

source: After you create an AnimationPlayer node, click on it to open the Animation Panel at the bottom of the viewport.
de: Nachdem Sie einen AnimationPlayer Node erstellt haben, klicken Sie darauf, um das Animationspanel am unteren Rand des Viewports zu öffnen.
zh_cn: 创建 AnimationPlayer 节点后，单击它以打开视口底部的动画面板。

source: The animation panel position
de: Die Position des Animationspanels
zh_cn: 动画面板位置

source: The animation panel consists of four parts:
de: Das Animationspanel besteht aus vier Teilen:
zh_cn: 动画面板由四部分组成：

source: The animation panel
de: Das Animationspanel
zh_cn: 动画面板

source: Animation controls (i.e. add, load, save, and delete animations)
de: Steuerelemente zur Organisation von Animationen (d.h. Hinzufügen, Laden, Speichern und Löschen von Animationen)
zh_cn: 动画控件(即添加, 加载, 保存和删除动画)

source: The tracks listing
de: Die Liste der Animations-Tracks
zh_cn: 轨道列表

source: The timeline with keyframes
de: Die Zeitleiste mit Keyframes
zh_cn: 带有关键帧的时间轴

source: The timeline and track controls, where you can zoom the timeline and edit tracks, for example.
de: Die Steuerelemente für die Zeitleiste und die Tracks, mit denen Sie z. B. die Zeitleiste zoomen und Tracks bearbeiten können.
zh_cn: 时间轴和轨道控件，例如，你可以在其中缩放时间轴和编辑轨道。

source: Computer animation relies on keyframes
de: Computeranimation basiert auf Keyframes
zh_cn: 计算机动画依赖于关键帧

source: A keyframe defines the value of a property at a point in time.
de: Ein Keyframe definiert den Wert einer Property zu einem bestimmten Zeitpunkt.
zh_cn: 关键帧定义属性在某个时间点的值。

source: Diamond shapes represent keyframes in the timeline. A line between two keyframes indicates that the value doesn't change between them.
de: Rauten stellen Keyframes in der Zeitleiste dar. Eine Linie zwischen zwei Keyframes zeigt an, dass sich der Wert zwischen ihnen nicht ändert.
zh_cn: 菱形代表时间轴中的关键帧。两个关键帧之间的线表示该值未更改。

source: Keyframes in Godot
zh_cn: Godot中的关键帧

source: You set values of a node's properties and create animation keyframes for them. When the animation runs, the engine will interpolate the values between the keyframes, resulting in them gradually changing over time.
de: Sie legen Werte für die Propertys eines Nodes fest und erstellen Animations-Keyframes für sie. Wenn die Animation läuft, interpoliert die Engine die Werte zwischen den Keyframes, so dass sie sich im Laufe der Zeit allmählich ändern.
zh_cn: 你设置节点属性的值并为其创建动画关键帧。当动画运行时，引擎将在关键帧之间插入值，使它们随着时间的推移逐渐变化。

source: Two keyframes are all it takes to obtain a smooth motion
de: Zwei Keyframes genügen, um eine flüssige Bewegung zu erreichen
zh_cn: 只需两个关键帧就可以获得一个平滑运动

source: The timeline defines how long the animation will take. You can insert keyframes at various points, and change their timing.
de: Die Zeitleiste legt fest, wie lange die Animation dauern soll. Sie können an verschiedenen Stellen Keyframes einfügen und ihr Timing ändern.
zh_cn: 时间轴定义动画需要多长时间。你可以在不同的点插入关键帧，并更改其时间。

source: The timeline in the animation panel
de: Die Zeitleiste im Animationspanel
zh_cn: 动画面板中的时间轴

source: Each line in the Animation Panel is an animation track that references a Normal or Transform property of a node. Each track stores a path to a node and its affected property. For example, the position track in the illustration refers to the ``position`` property of the Sprite2D node.
de: Jede Zeile im Animationspanel ist ein Animations-Track, der auf eine Normalen- oder Transform-Property eines Nodes verweist. Jeder Track speichert einen Pfad zu einem Node und seiner betroffenen Property. Der Positions-Track in der Abbildung bezieht sich zum Beispiel auf die Property ``Position`` des Sprite2D-Nodes.
zh_cn: 动画面板中的每一行都是引用节点的普通或变换属性的动画轨道。每个轨道存储节点的路径及其受影响的属性。例如，图中的位置轨迹指的是 Sprite2D 节点的 ``position`` 属性。

source: Example of Normal animation tracks
de: Beispiel für Normalen-Animations-Tracks
zh_cn: 普通动画轨道的示例

source: If you animate the wrong property, you can edit a track's path at any time by double-clicking on it and typing the new path. Play the animation using the "Play from beginning" button |Play from beginning| (or pressing :kbd:`Shift + D` on keyboard) to see the changes instantly.
de: Wenn Sie die falsche Property animieren, können Sie den Pfad eines Tracks jederzeit bearbeiten, indem Sie auf ihn doppelklicken und den neuen Pfad eingeben. Spielen Sie die Animation mit dem "Von Anfang an abspielen"-Button |Play from beginning| ab (oder drücken Sie :kbd:`Umschalt + D` auf der Tastatur), um die Änderungen sofort zu sehen.
zh_cn: 如果你的动画属性错误，你可以随时通过双击轨道并输入新路径来编辑轨道的路径。使用 “从头开始播放” 按钮|从头开始播放|（或按键盘上的 :kbd:`Shift + D` ）播放动画，可以立即看到变化.

source: Play from beginning
de: Von Anfang an abspielen
zh_cn: 从头开始播放

source: Tutorial: Creating a simple animation
de: Anleitung: Erstellen einer einfachen Animation
zh_cn: 教程：创建简单的动画

source: Scene setup
de: Einrichten einer Szene
zh_cn: 场景设置

source: For this tutorial, we'll create a Sprite node with an AnimationPlayer as its child. We will animate the sprite to move between two points on the screen.
de: In diesem Tutorial erstellen wir einen Sprite-Node mit einem AnimationPlayer als dessen Child-Node. Wir werden das Sprite so animieren, dass es sich zwischen zwei Punkten auf dem Bildschirm bewegt.
zh_cn: 在本教程中，我们将创建一个 AnimationPlayer 节点，并将精灵（Sprite）节点作为其子节点。我们会让这个精灵在屏幕上的两点之间进行移动。

source: Our scene setup
de: Unser Szenenaufbau
zh_cn: 我们的场景设置

source: AnimationPlayer inherits from Node instead of Node2D or Node3D, which means that the child nodes will not inherit the transform from the parent nodes due to a bare Node being present in the hierarchy.
de: AnimationPlayer erbt von Node anstelle von Node2D oder Node3D, was bedeutet, dass die Child-Nodes die Transformation nicht von den übergeordneten Knoten erben, da in der Hierarchie nur ein Node vorhanden ist.
zh_cn: AnimationPlayer 继承自 Node 而不是 Node2D 或者 Node3D。因为层级中间出现了普通的 Node 节点，所以它的子节点不会继承父节点的变换。

source: Therefore, it is not recommended to add nodes that have a 2D/3D transform as a child of an AnimationPlayer node.
de: Daher ist es nicht empfehlenswert, Nodes, die eine 2D/3D-Transformation haben, als Child-Node eines AnimationPlayer-Nodes hinzuzufügen.
zh_cn: 所以，不建议把具有 2D 或者 3D 变换的节点设置成 AnimationPlayer 节点的子节点。

source: The sprite holds an image texture. For this tutorial, select the Sprite2D node, click Texture in the Inspector, and then click Load. Select the default Godot icon for the sprite's texture.
de: Das Sprite enthält eine Bildtextur. Wählen Sie für dieses Tutorial den Sprite2D-Node, klicken Sie im Inspektor auf Textur und dann auf Laden. Wählen Sie das Standard-Godot-Symbol für die Textur des Sprites.
zh_cn: 精灵拥有图像纹理。在本教程中，选择 Sprite2D 节点，在检查器中单击 Texture ，然后单击“加载”。精灵的纹理选择为默认的 Godot 图标。

source: Adding an animation
de: Hinzufügen einer Animation
zh_cn: 添加动画

source: Select the AnimationPlayer node and click the "Animation" button in the animation editor. From the list, select "New" (|Add Animation|) to add a new animation. Enter a name for the animation in the dialog box.
de: Wählen Sie den AnimationPlayer-Node und klicken Sie im Animationseditor auf "Animation"-Button. Wählen Sie in der Liste "Neu" (|Add Animation|), um eine neue Animation hinzuzufügen. Geben Sie im Dialogfeld einen Namen für die Animation ein.
zh_cn: 选中 AnimationPlayer 节点，然后点击动画编辑器中的“动画”按钮。从列表中选择“新建”（ |Add Animation| ）来添加一个新的动画，并在对话框中为该动画输入名称。

source: Add Animation
de: Animation hinzufügen
zh_cn: 添加动画

source: Add a new animation
de: Fügen Sie eine neue Animation hinzu
zh_cn: 添加新动画

source: Manage an animation libraries
de: Verwalten einer Animationsbibliothek
zh_cn: 管理动画库

source: For reusability, the animation is registered in a list in the animation library resource. If you add an animation to AnimationPlayer without specifying any particular settings, the animation will be registered in the [Global] animation library that AnimationPlayer has by default.
de: Um die Wiederverwendbarkeit zu gewährleisten, wird die Animation in einer Liste in der Ressource Animationsbibliothek registriert. Wenn Sie eine Animation zu AnimationPlayer hinzufügen, ohne bestimmte Einstellungen festzulegen, wird die Animation in der [Globalen] Animationsbibliothek registriert, die AnimationPlayer standardmäßig besitzt.
zh_cn: 出于可复用性，动画被注册在动画库资源的列表中。如果你将动画添加到 AnimationPlayer 而不指定任何特定设置，则该动画将默认注册到 AnimationPlayer 具有的 [Global] 动画库中。

source: Manage animations
de: Verwalten von Animationen
zh_cn: 管理动画

source: If there are multiple animation libraries and you try to add an animation, a dialog box will appear with options.
de: Wenn mehrere Animationsbibliotheken vorhanden sind und Sie versuchen, eine Animation hinzuzufügen, wird ein Dialogfeld mit Optionen angezeigt.
zh_cn: 如果有多个动画库并且你尝试添加动画，则会出现一个包含选项的对话框。

source: Add a new animation with library option
de: Eine neue Animation mit der Bibliothek-Option hinzufügen
zh_cn: 添加带有库选项的新动画

source: Adding a track
de: Hinzufügen eines Tracks
zh_cn: 添加轨道

source: To add a new track for our sprite, select it and take a look at the toolbar:
de: Um einen neuen Track für unser Sprite hinzuzufügen, wählen Sie es aus und werfen Sie einen Blick auf die Toolbar:
zh_cn: 要为我们的精灵添加一个新的轨道，请选择它并在工具栏中查看：

source: Convenience buttons
de: Komfort-Buttons
zh_cn: 方便按钮

source: These switches and buttons allow you to add keyframes for the selected node's location, rotation, and scale. Since we are only animating the sprite's position, make sure that only the location switch is selected. The selected switches are blue.
de: Mit diesen Schaltern und Buttons können Sie Keyframes für die Position, Rotation und Skalierung des ausgewählten Nodes hinzufügen. Da wir nur die Position des Sprites animieren wollen, stellen Sie sicher, dass nur der Positions-Schalter ausgewählt ist. Die ausgewählten Schalter sind blau.
zh_cn: 这些开关和按钮允许你为所选节点的位置、旋转和缩放添加关键帧。由于我们仅对精灵的位置进行动画处理，因此请确保仅选择位置开关。所选开关为蓝色。

source: Click on the key button to create the first keyframe. Since we don't have a track set up for the Position property yet, Godot will offer to create it for us. Click **Create**.
de: Klicken Sie auf den Schlüssel-Button, um den ersten Keyframe zu erstellen. Da wir noch keinen Track für die Property Position eingerichtet haben, bietet Godot an, diesen für uns zu erstellen. Klicken Sie auf **Erstellen**.
zh_cn: 单击钥匙按钮（插入关键帧）创建第一个关键帧。由于我们还没有为 Position 属性设置轨道，Godot 将主动为我们创建它。点击 **创建** 。

source: Godot will create a new track and insert our first keyframe at the beginning of the timeline:
de: Godot erstellt einen neuen Track und fügt unseren ersten Keyframe am Anfang der Zeitleiste ein:
zh_cn: Godot 将创建一个新轨道，并在时间轴的开头插入我们的第一个关键帧：

source: The sprite track
de: Der Sprite-Track
zh_cn: 精灵轨道

source: The second keyframe
de: Der zweite Keyframe
zh_cn: 第二个关键帧

source: We need to set our sprite's end location and how long it will take for it to get there.
de: Wir müssen die Endposition unseres Sprites festlegen und wie lange es braucht, um dorthin zu gelangen.
zh_cn: 我们需要设置我们的精灵的最终目的地，以及它到达那里需要多长时间。

source: Let's say we want it to take two seconds to move between the points. By default, the animation is set to last only one second, so change the animation length to 2 in the controls on the right side of the animation panel's timeline header.
de: Angenommen, wir möchten, dass die Bewegung zwischen den Punkten zwei Sekunden dauert. Standardmäßig ist die Animation so eingestellt, dass sie nur eine Sekunde dauert. Ändern Sie daher die Animationslänge in den Steuerelementen auf der rechten Seite der Kopfzeile der Zeitleiste des Animationspanels auf 2.
zh_cn: 假设我们希望在点之间移动需要两秒钟。默认情况下，动画设置为仅持续一秒，因此请在动画面板时间轴标题右侧的控件中将动画长度更改为 2。

source: Animation length
de: Animationslänge
zh_cn: 动画长度

source: Now, move the sprite right, to its final position. You can use the *Move tool* in the toolbar or set the *Position*'s X value in the *Inspector*.
de: Bewegen Sie nun das Sprite nach rechts, an seine endgültige Position. Sie können das *Verschieben-Werkzeug* in der Toolbar verwenden oder den X-Wert der *Position* im *Inspektor* einstellen.
zh_cn: 现在，将精灵向右移动到其最终位置。可以使用工具栏中的 *移动工具* 或在 *检查器* 中设置* Position* 的 X 值。

source: Click on the timeline header near the two-second mark in the animation panel and then click the key button in the toolbar to create the second keyframe.
de: Klicken Sie auf die Kopfzeile der Zeitleiste in der Nähe der Zwei-Sekunden-Marke im Animationspanel und klicken Sie dann auf die Schlüssel-Button in der Symbolleiste, um den zweiten Keyframe zu erstellen.
zh_cn: 点击动画面板 2 秒附近的时间轴标题，然后单击工具栏中的钥匙按钮以创建第二个关键帧。

source: Run the animation
de: Die Animation starten
zh_cn: 运行动画

source: Click on the "Play from beginning" (|Play from beginning|) button.
de: Klicken Sie auf den "Von Anfang an spielen" (|Play from beginning|)-Button.
zh_cn: 点击“从头开始播放”（\ |Play from beginning|\ ）按钮。

source: Yay! Our animation runs:
de: Hurra! Unsere Animation läuft:
zh_cn: 好极了！ 我们的动画运行:

source: The animation
de: Die Animation
zh_cn: 动画

source: Back and forth
de: Hin und her
zh_cn: 来来回回

source: Godot has an interesting feature that we can use in animations. When Animation Looping is set but there's no keyframe specified at the end of the animation, the first keyframe is also the last.
de: Godot hat eine interessante Funktion, die wir in Animationen verwenden können. Wenn Animations-Looping eingestellt ist, aber kein Keyframe am Ende der Animation angegeben ist, ist der erste Keyframe auch der letzte.
zh_cn: Godot 有一个我们可以在动画中使用的有趣的功能。当设置了动画循环但动画末尾没有指定关键帧时，第一个关键帧也是最后一个关键帧。

source: This means we can extend the animation length to four seconds now, and Godot will also calculate the frames from the last keyframe to the first, moving our sprite back and forth.
de: Das bedeutet, dass wir die Animationslänge jetzt auf vier Sekunden verlängern können, und Godot wird auch die Frames vom letzten Keyframe bis zum ersten berechnen und unser Sprite hin und her bewegen.
zh_cn: 这意味着我们现在可以将动画长度延长到四秒，Godot 还将计算从最后一个关键帧到第一个关键帧的帧，来回移动我们的精灵。

source: Animation loop
de: Animations-Looping
zh_cn: 动画循环

source: You can change this behavior by changing the track's loop mode. This is covered in the next chapter.
de: Sie können dieses Verhalten ändern, indem Sie den Loop-Modus der Spur ändern. Dies wird im nächsten Kapitel behandelt.
zh_cn: 你可以通过更改轨道的循环模式来更改此行为。这将在下一章中介绍。

source: Track settings
de: Track-Einstellungen
zh_cn: 轨道设置

source: Each track has a settings panel at the end, where you can set its update mode, track interpolation, and loop mode.
de: Jeder Track hat am Ende ein Einstellungs-Panel, in dem Sie den Aktualisierungsmodus, die Track-Interpolation und den Loop-Modus einstellen können.
zh_cn: 每条轨道最后都有一个设置面板，可以在其中设置更新模式、轨道插值和循环模式。

source: The update mode of a track tells Godot when to update the property values. This can be:
de: Der Aktualisierungsmodus eines Tracks teilt Godot mit, wann die Propertys aktualisiert werden sollen. Dies kann sein:
zh_cn: 轨道的更新模式告诉 Godot 何时更新属性值。这可以是：

source: **Continuous:** Update the property on each frame
de: **Kontinuierlich:** Aktualisiert die Eigenschaft bei jedem Bild
zh_cn: **连续：**\ 每帧都更新属性

source: **Discrete:** Only update the property on keyframes
de: **Diskret:** Aktualisiert die Eigenschaft nur bei Keyframes
zh_cn: **离散：**\ 仅在位于关键帧时更新属性

source: **Capture:** if the first keyframe's time is greater than ``0.0``, the current value of the property will be remembered and will be blended with the first animation key. For example, you could use the Capture mode to move a node that's located anywhere to a specific location.
de: **Capture:** Wenn die Zeit des ersten Keyframes größer als ``0.0`` ist, wird der aktuelle Wert der Property gespeichert und mit dem ersten Animations-Key überblendet. Sie können den Capture-Modus zum Beispiel verwenden, um einen Node, der sich an einer beliebigen Stelle befindet, an einen bestimmten Ort zu verschieben.
zh_cn: **捕获：**\ 如果第一个关键帧的时间大于 ``0.0``\ ，就会记录该属性的当前值，并将其与第一个动画帧混合。例如，利用“捕获”模式，你可以将处于任意位置的节点移动到特定的位置。

source: Track mode
de: Track-Modus
zh_cn: 轨道模式

source: You will usually use "Continuous" mode. The other types are used to script complex animations.
de: In der Regel werden Sie den Modus "Kontinuierlich" verwenden. Die anderen Typen werden verwendet, um komplexe Animationen zu erstellen.
zh_cn: 在普通动画中，你通常使用“连续”。其他类型可用于编排复杂动画。

source: Track interpolation tells Godot how to calculate the frame values between keyframes. These interpolation modes are supported:
de: Die Track-Interpolation teilt Godot mit, wie die Frame-Werte zwischen den Keyframes berechnet werden sollen. Diese Interpolationsmodi werden unterstützt:
zh_cn: 轨迹插值告诉 Godot 如何计算关键帧之间的帧值，支持的插值模式有：

source: Nearest: Set the nearest keyframe value
de: Nearest: Legt den nächsten Keyframe-Wert fest
zh_cn: 临近：设置为最接近的关键帧的值

source: Linear: Set the value based on a linear function calculation between the two keyframes
de: Linear: Legt den Wert basierend auf einer linearen Funktionsberechnung zwischen den beiden Keyframes fest
zh_cn: 线性：使用线性函数计算两个关键帧之间的值

source: Cubic: Set the value based on a cubic function calculation between the two keyframes
de: Kubisch: Legt den Wert basierend auf einer Berechnung der kubischen Funktion zwischen den beiden Keyframes fest
zh_cn: 三次方：使用三次函数计算两个关键帧之间的值

source: Linear Angle (Only appears in rotation property): Linear mode with shortest path rotation
de: Linearer Winkel (erscheint nur in der Property Rotation): Linearer Modus mit Rotation auf kürzestem Weg
zh_cn: 线性角（仅出现在旋转属性中）：具有最短路径旋转的线性模式

source: Cubic Angle (Only appears in rotation property): Cubic mode with shortest path rotation
de: Kubischer Winkel (erscheint nur in der Property Rotation): Kubischer Modus mit Drehung auf kürzestem Weg
zh_cn: 三次角（仅出现在旋转属性中）：具有最短路径旋转的立方模式

source: Track interpolation
zh_cn: 轨道插值

source: With Cubic interpolation, animation is slower at keyframes and faster between them, which leads to more natural movement. Cubic interpolation is commonly used for character animation. Linear interpolation animates changes at a fixed pace, resulting in a more robotic effect.
de: Bei der kubischen Interpolation ist die Animation an Keyframes langsamer und zwischen den Keyframes schneller, was zu einer natürlicheren Bewegung führt. Kubische Interpolation wird häufig für die Animation von Charakteren verwendet. Bei der linearen Interpolation werden Änderungen in einem festen Tempo animiert, was zu einem eher roboterhaften Effekt führt.
zh_cn: 利用三次插值，动画在关键帧处的速度较慢，而在关键帧之间的速度较快，从而使动作更加自然。立体插值常用于角色动画。线性插值以固定的速度进行动画变化，从而产生更加机械的效果。

source: Godot supports two loop modes, which affect the animation when it's set to loop:
de: Godot unterstützt zwei Loop-Modi, die sich auf die Animation auswirken, wenn sie auf Looping eingestellt ist:
zh_cn: Godot支持两种循环模式，如果将其设置为循环时，则会影响动画效果：

source: Loop modes
de: Loop-Modi
zh_cn: 循环模式

source: Clamp loop interpolation: When this is selected, the animation stops after the last keyframe for this track. When the first keyframe is reached again, the animation will reset to its values.
de: Clamp-Loop-Interpolation: Wenn diese Option ausgewählt ist, wird die Animation nach dem letzten Keyframe für diesen Track angehalten. Wenn der erste Keyframe wieder erreicht wird, wird die Animation auf ihre Werte zurückgesetzt.
zh_cn: 钳位循环插值: 选择此选项后, 动画将在此轨道的最后一个关键帧之后停止. 再次到达第一个关键帧时, 动画将重置为其值.

source: Wrap loop interpolation: When this is selected, Godot calculates the animation after the last keyframe to reach the values of the first keyframe again.
de: Wiederhol-Loop-Interpolation: Wenn dies ausgewählt ist, berechnet Godot die Animation nach dem letzten Keyframe, um die Werte des ersten Keyframes wieder zu erreichen.
zh_cn: 包循环插值: 当选择此项时,Godot会在最后一个关键帧之后计算动画, 以再次达到第一个关键帧的值.

source: Keyframes for other properties
de: Keyframes für andere Propertys
zh_cn: 其他属性的关键帧

source: Godot's animation system isn't restricted to position, rotation, and scale. You can animate any property.
de: Godots Animationssystem ist nicht auf Position, Rotation und Skalierung beschränkt. Sie können jede Property animieren.
zh_cn: Godot的动画系统不仅限于位置、旋转和缩放。你可以对任何属性进行动画化。

source: If you select your sprite while the animation panel is visible, Godot will display a small keyframe button in the *Inspector* for each of the sprite's properties. Click on one of these buttons to add a track and keyframe to the current animation.
de: Wenn Sie Ihr Sprite auswählen, während das Animationspanel sichtbar ist, zeigt Godot einen kleinen Keyframe-Button im *Inspektor* für jede Property des Sprites an. Klicken Sie auf einen dieser Buttons, um einen Track und Keyframe zur aktuellen Animation hinzuzufügen.
zh_cn: 如果你在动画面板可见时选择你的精灵，Godot 会在 *检查器* 中为精灵的每个属性显示一个小的关键帧按钮，点击这个按钮，Godot就会自动为当前动画添加一个轨道和关键帧。

source: Edit keyframes
de: Keyframes bearbeiten
zh_cn: 编辑关键帧

source: You can click on a keyframe in the animation timeline to display and edit its value in the *Inspector*.
de: Sie können auf einen Keyframe in der Animationszeitleiste klicken, um seinen Wert im *Inspektor* anzuzeigen und zu bearbeiten.
zh_cn: 你可以在动画时间轴上点击关键帧，以在*属性面板*中显示和编辑其值。

source: Keyframe editor editing a key
de: Keyframe-Editor zum Bearbeiten eines Keys
zh_cn: 关键帧编辑器编辑一个键

source: You can also edit the easing value for a keyframe here by clicking and dragging its easing curve. This tells Godot how to interpolate the animated property when it reaches this keyframe.
de: Sie können hier auch den Easing-Wert für einen Keyframe bearbeiten, indem Sie auf die Easing-Kurve klicken und sie ziehen. Dadurch wird Godot mitgeteilt, wie die animierte Property interpoliert werden soll, wenn sie diesen Keyframe erreicht.
zh_cn: 此外，你还可以通过点击并拖动关键帧的缓和曲线，在这里编辑关键帧的缓和值。这将告诉 Godot 在动画属性到达该关键帧时如何进行插值。
