Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/playing_videos.po
Languages: de, zh_tw

source: The **video quality** level (``-q:v``) must be between ``1`` and ``10``. Quality ``6`` is a good compromise between quality and file size. If encoding at a high resolution (such as 1440p or 4K), you will probably want to decrease ``-q:v`` to ``5`` to keep file sizes reasonable. Since pixel density is higher on a 1440p or 4K video, lower quality presets at higher resolutions will look as good or better compared to low-resolution videos.
de: Die Stufe der **Videoqualität** (``-q:v``) muss zwischen ``1`` und ``10`` liegen. Qualität ``6`` ist ein guter Kompromiss zwischen Qualität und Dateigröße. Wenn Sie mit einer hohen Auflösung kodieren (z.B. 1440p oder 4K), sollten Sie ``-q:v`` auf ``5`` verringern, um die Dateigröße im Rahmen zu halten. Da die Pixeldichte bei einem 1440p- oder 4K-Video höher ist, sehen Voreinstellungen mit niedrigerer Qualität bei höheren Auflösungen genauso gut oder besser aus als Videos mit niedriger Auflösung.
zh_tw: **影片品質**等級（``-q:v``）必須在 ``1`` 和 ``10`` 之間。將品質設為 ``6`` 是在品質和檔大小之間的一個不錯的妥協。如果要編碼較高的解析度（例如 1440p 或者 4K），你可能想要把 ``-q:v`` 降為 ``5``，把檔大小控制在合理的範圍內。因為 1440p 和 4K 影片的像素密度更高，相較於低解析度的影片，較低的品質預設看上去的效果是一樣甚至更好的。

source: The **audio quality** level (``-q:a``) must be between ``-1`` and ``10``. Quality ``6`` provides a good compromise between quality and file size. In contrast to video quality, increasing audio quality doesn't increase the output file size nearly as much. Therefore, if you want the cleanest audio possible, you can increase this to ``9`` to get *perceptually lossless* audio. This is especially valuable if your input file already uses lossy audio compression. Higher quality audio does increase the CPU usage of the decoder, so it might lead to audio dropouts in case of high system load. See `this page <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__ for a table listing Ogg Vorbis audio quality presets and their respective variable bitrates.
de: Die Stufe der **Audioqualität** (``-q:a``) muss zwischen ``-1`` und ``10`` liegen. Die Qualität ``6`` bietet einen guten Kompromiss zwischen Qualität und Dateigröße. Im Gegensatz zur Videoqualität erhöht eine höhere Audioqualität die Größe der Ausgabedatei nicht annähernd so stark. Wenn Sie also eine möglichst saubere Audioqualität wünschen, können Sie die Qualität auf ``9`` erhöhen, um *wahrnehmbar verlustfreies* Audio zu erhalten. Dies ist besonders wertvoll, wenn Ihre Eingabedatei bereits verlustbehaftete Audiokompression verwendet. Höhere Audioqualität erhöht die CPU-Auslastung des Decoders, so dass es bei hoher Systembelastung zu Audioaussetzern kommen kann. Auf `dieser Seite <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__ finden Sie eine Tabelle mit den Voreinstellungen für die Ogg Vorbis-Audioqualität und ihren jeweiligen variablen Bitraten.
zh_tw: ** 音訊品質**等級（``-q:a``）必須在 ``1`` 和 ``10`` 之間。將品質設為 ``6`` 是在品質和檔大小之間的一個不錯的妥協。與影片品質不同，提升音訊品質並不會顯著增加輸出檔的大小。因此，如果你想要盡可能清晰的音訊，可以將其設為 ``9``，達到*感知上無損*的音訊。在你的輸入檔使用的已經是無損音訊壓縮時尤其有用。Ogg Vorbis 音訊品質預設及其對應的變數位元速率表見`這個頁面 <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__。

source: FFmpeg: Convert while preserving original video resolution
de: FFmpeg: Konvertieren unter Beibehaltung der ursprünglichen Videoauflösung
zh_tw: FFmpeg：轉換時保持原始影片解析度

source: The following command converts the video while keeping its original resolution. The video and audio's bitrate will be variable to maximize quality while saving space in parts of the video/audio that don't require a high bitrate (such as static scenes).
de: Der folgende Befehl konvertiert das Video unter Beibehaltung seiner ursprünglichen Auflösung. Die Bitrate von Video und Audio ist dabei variabel, um die Qualität zu maximieren und gleichzeitig Speicherplatz in Teilen des Videos/Audios zu sparen, die keine hohe Bitrate benötigen (z. B. statische Szenen).
zh_tw: 以下命令會在保持原始解析度的前提下對影片進行轉換。影片和音訊的位元速率會被設為可變，在最大化品質的同時在不需要高位元速率影片/音訊的時候節省空間（例如靜態場景）。

source: FFmpeg: Resize the video then convert it
de: FFmpeg: Ändern Sie die Größe des Videos und konvertieren Sie es dann
zh_tw: FFmpeg：調整影片大小並轉換

source: The following command resizes a video to be 720 pixels tall (720p), while preserving its existing aspect ratio. This helps decrease the file size significantly if the source is recorded at a higher resolution than 720p:
de: Der folgende Befehl ändert die Größe eines Videos auf 720 Pixel Höhe (720p), wobei das bestehende Seitenverhältnis beibehalten wird. Dadurch kann die Dateigröße erheblich verringert werden, wenn die Quelle mit einer höheren Auflösung als 720p aufgezeichnet wurde:
zh_tw: 以下命令會在保持現有長寬比的前提下將影片調整到 720 像素高（720p）。如果原始檔解析度是大於 720p 的，就能夠顯著降低檔大小：

source: Chroma key, commonly known as the "green screen" or "blue screen" effect, allows you to remove a specific color from an image or video and replace it with another background. This effect is widely used in video production to composite different elements together seamlessly.
de: Mit dem Chroma Key-Effekt, der auch als "Greenscreen"- oder "Bluescreen"-Effekt bekannt ist, können Sie eine bestimmte Farbe aus einem Bild oder Video entfernen und durch einen anderen Hintergrund ersetzen. Dieser Effekt wird in der Videoproduktion häufig verwendet, um verschiedene Elemente nahtlos zusammenzufügen.

source: We will achieve the chroma key effect by writing a custom shader in GDScript and using a `VideoStreamPlayer` node to display the video content.
de: Wir erreichen den Chroma Key-Effekt, indem wir einen benutzerdefinierten Shader in GDScript schreiben und einen `VideoStreamPlayer`-Node verwenden, um den Videoinhalt anzuzeigen.

source: Scene Setup
de: Einrichten der Szene

source: Ensure that the scene contains a `VideoStreamPlayer` node to play the video and a `Control` node to hold the UI elements for controlling the chroma key effect.
de: Stellen Sie sicher, dass die Szene einen `VideoStreamPlayer`-Node zur Wiedergabe des Videos und einen `Control`-Node zur Aufnahme der UI-Elemente zur Steuerung des Chroma Key-Effekts enthält.

source: Writing the Custom Shader
de: Schreiben des benutzerdefinierten Shaders

source: To implement the chroma key effect, follow these steps:
de: Gehen Sie folgendermaßen vor, um den Chroma Key-Effekt zu implementieren:

source: Select the `VideoStreamPlayer` node in the scene and go to its properties. Under `CanvasItem > Material`, create a new shader named "ChromaKeyShader.gdshader."
de: Wählen Sie den `VideoStreamPlayer`-Node in der Szene und gehen Sie zu seinen Propertys. Erstellen Sie unter `CanvasItem > Material` einen neuen Shader namens "ChromaKeyShader.gdshader".

source: In the "ChromaKeyShader.gdshader" file, write the custom shader code as shown below:
de: Schreiben Sie in die Datei "ChromaKeyShader.gdshader" den benutzerdefinierten Shader-Code wie unten gezeigt:

source: The shader uses the distance calculation to identify pixels close to the chroma key color and discards them, effectively removing the selected color. Pixels that are slightly further away from the chroma key color are faded based on the fade_factor, blending them smoothly with the surrounding colors. This process creates the desired chroma key effect, making it appear as if the background has been replaced with another image or video.
de: Der Shader verwendet die Abstandsberechnung, um Pixel in der Nähe der Chroma Key-Farbe zu identifizieren und verwirft sie, wodurch die ausgewählte Farbe effektiv entfernt wird. Pixel, die etwas weiter von der Chroma Key-Farbe entfernt sind, werden auf der Grundlage des fade_factor ausgeblendet, so dass sie sanft mit den umgebenden Farben überblendet werden. Dieser Prozess erzeugt den gewünschten Chroma Key-Effekt, der den Eindruck erweckt, dass der Hintergrund durch ein anderes Bild oder Video ersetzt wurde.

source: The code above represents a simple demonstration of the Chroma Key shader, and users can customize it according to their specific requirements.
de: Der obige Code stellt eine einfache Demonstration des Chroma Key-Shaders dar und kann von den Benutzern entsprechend ihren spezifischen Anforderungen angepasst werden.

source: UI Controls
de: UI-Steuerelemente

source: To allow users to manipulate the chroma key effect in real-time, we created sliders in the `Control` node. The `Control` node's script contains the following functions:
de: Damit die Benutzer den Chroma Key-Effekt in Echtzeit beeinflussen können, haben wir Schieberegler im `Control`-Node erstellt. Das Skript des `Control`-Nodes enthält die folgenden Funktionen:

source: also make sure that the range of the sliders are appropriate, our settings are :
de: Vergewissern Sie sich auch, dass der Bereich der Schieberegler angemessen ist. Unsere Einstellungen sind:

source: Signal Handling
de: Behandlung von Signalen

source: Connect the appropriate signal from the UI elements to the `Control` node's script. you created in the `Control` node's script to control the chroma key effect. These signal handlers will update the shader's uniform variables in response to user input.
de: Verbinden Sie das entsprechende Signal von den UI-Elementen mit dem Skript des `Control`-Nodes, das Sie im Skript des `Control` Nodes erstellt haben, um den Chroma Key-Effekt zu steuern. Diese Signal-Handler aktualisieren die Uniform-Variablen des Shaders als Reaktion auf Benutzereingaben.

source: Save and run the scene to see the chroma key effect in action! With the provided UI controls, you can now adjust the chroma key color, pickup range, and fade amount in real-time, achieving the desired chroma key functionality for your video content.
de: Speichern Sie die Szene und führen Sie sie aus, um den Chroma Key-Effekt in Aktion zu sehen! Mit den bereitgestellten Steuerelementen der Benutzeroberfläche können Sie jetzt die Chroma Key-Farbe, den Aufnahmebereich und den Fading-Grad in Echtzeit anpassen und so die gewünschte Chroma Key-Funktionalität für Ihre Videoinhalte erzielen.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
