Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/playing_videos.po
Languages: de, zh_tw

source: Playing videos
de: Abspielen von Videos
zh_tw: 播放影片

source: Godot supports video playback with the :ref:`class_VideoStreamPlayer` node.
de: Godot unterstützt die Videowiedergabe mit dem :ref:`class_VideoStreamPlayer`-Node.
zh_tw: Godot 通過 :ref:`class_VideoPlayer` 節點支援影片的播放。

source: Supported playback formats
de: Unterstützte Wiedergabeformate
zh_tw: 支援所有平台。

source: The only supported format in core is **Ogg Theora** (not to be confused with Ogg Vorbis audio). It's possible for extensions to bring support for additional formats, but no such extensions exist yet as of July 2022.
de: Das einzige unterstützte Format im Kern ist **Ogg Theora** (nicht zu verwechseln mit Ogg Vorbis Audio). Es ist möglich, dass Extensions die Unterstützung für weitere Formate bringen, aber es gibt noch keine solchen Extensions (Stand Juli 2022).
zh_tw: 核心中僅支援 **Ogg Theora** 格式（請勿與 Ogg Vorbis 音訊混淆）。擴充可以支援額外的格式，但是截止到 2022 年 7 月，還沒有這種擴充存在。

source: H.264 and H.265 cannot be supported in core Godot, as they are both encumbered by software patents. AV1 is royalty-free, but it remains slow to decode on the CPU and hardware decoding support isn't readily available on all GPUs in use yet.
de: H.264 und H.265 können im Godot-Kern nicht unterstützt werden, da sie beide durch Softwarepatente geschützt sind. AV1 ist lizenzfrei, aber die Dekodierung auf der CPU ist nach wie vor langsam, und die Unterstützung für die Hardware-Dekodierung ist noch nicht auf allen verwendeten GPUs verfügbar.
zh_tw: Godot 核心無法支援 H.264 和 H.265，因為它們都被軟體專利所限。AV1 不需要授權，但 CPU 解碼仍然很慢，也不是所有 GPU 都已支援硬體解碼。

source: WebM was supported in core in Godot 3.x, but support for it was removed in 4.0 as it was too buggy and difficult to maintain.
de: WebM wurde in Godot 3.x im Kern unterstützt, aber die Unterstützung dafür wurde in 4.0 entfernt, da sie zu fehlerhaft und schwer zu pflegen war.
zh_tw: Godot 3.x 核心中支援 WebM，但是會在 4.0 中移除支援，因為 bug 很多難以維護。因此**不推薦使用 WebM**。

source: You may find videos with an ``.ogg`` or ``.ogx`` extensions, which are generic extensions for data within an Ogg container.
de: Sie können Videos mit den Erweiterungen ``.ogg`` oder ``.ogx`` finden, die allgemeine Erweiterungen für Daten innerhalb eines Ogg-Containers sind.
zh_tw: 你的影片可能使用的是 ``.ogg`` 或者 ``.ogx`` 副檔名，這是帶有資料的 Ogg 容器的通用副檔名。

source: Renaming these file extensions to ``.ogv`` *may* allow the videos to be imported in Godot. However, not all files with ``.ogg`` or ``.ogx`` extensions are videos - some of them may only contain audio.
de: Die Umbenennung dieser Dateierweiterungen in ``.ogv`` *könnte* es ermöglichen, die Videos in Godot zu importieren. Allerdings sind nicht alle Dateien mit den Erweiterungen ``.ogg`` oder ``.ogx`` Videos - einige von ihnen könnten nur Audio enthalten.
zh_tw: 將這些檔副檔名修改為 ``.ogv``*可能*可以讓影片在 Godot 中匯入。不過，並不是所有 ``.ogg`` 或 ``.ogx`` 副檔名的檔都是影片——有些可能只包含音訊。

source: Setting up VideoStreamPlayer
de: Einrichten des VideoStreamPlayers
zh_tw: 設定 Godot

source: Create a VideoStreamPlayer node using the Create New Node dialog.
de: Erstellen Sie einen VideoStreamPlayer-Node mit dem Dialogfeld Neuen Knoten erstellen.
zh_tw: 該簡介是「建立新節點」對話框中唯一的描述。

source: Select the VideoStreamPlayer node in the scene tree dock, go to the inspector and load an ``.ogv`` file in the Stream property.
de: Wählen Sie den VideoStreamPlayer-Node im Szenenbaum-Dock, gehen Sie zum Inspektor und laden Sie eine ``.ogv`` Datei in die Stream-Property.
zh_tw: 在場景樹面板上選中 VideoStreamPlayer 節點，到屬性面板中為 Stream 屬性載入 ``.ogv`` 檔案。

source: If you don't have your video in Ogg Theora format yet, jump to :ref:`doc_playing_videos_recommended_theora_encoding_settings`.
de: Wenn Sie Ihr Video noch nicht im Ogg Theora-Format haben, lesen Sie :ref:`doc_playing_videos_recommended_theora_encoding_settings`.
zh_tw: 如果你還沒有把你的影片轉為 Ogg Theora 格式，請跳轉到 :ref:`doc_playing_videos_recommended_theora_encoding_settings`。

source: If you want the video to play as soon as the scene is loaded, check **Autoplay** in the inspector. If not, leave **Autoplay** disabled and call ``play()`` on the VideoStreamPlayer node in a script to start playback when desired.
de: Wenn Sie möchten, dass das Video abgespielt wird, sobald die Szene geladen ist, aktivieren Sie **Autoplay** im Inspektor. Wenn nicht, lassen Sie **Autoplay** deaktiviert und rufen Sie ``play()`` auf dem VideoStreamPlayer-Node in einem Skript auf, um die Wiedergabe bei Bedarf zu starten.
zh_tw: 如果你希望在場景載入時立即播放影片，請在屬性面板中勾選 **Autoplay**。否則，請保持 **Autoplay** 關閉，並在需要時在腳本中呼叫 VideoPlayer 節點的 ``play()`` 開始播放。

source: Handling resizing and different aspect ratios
de: Handhabung von Größenänderungen und unterschiedlichen Seitenverhältnissen
zh_tw: 處理大小變化及不同的縱橫比

source: By default in Godot 4.0, the VideoStreamPlayer will automatically be resized to match the video's resolution. You can make it follow usual :ref:`class_Control` sizing by enabling **Expand** on the VideoStreamPlayer node.
de: In Godot 4.0 wird die Größe des VideoStreamPlayers standardmäßig automatisch an die Auflösung des Videos angepasst. Sie können die Größe an die übliche :ref:`class_Control` anpassen, indem Sie **Expand** auf dem VideoStreamPlayer-Node aktivieren.
zh_tw: Godot 4.0 中在預設情況下，VideoPlayer 會自動調整到與影片解析度相配對的大小。你可以讓它遵循普通的 :ref:`class_Control` 大小規則，啟用 VideoPlayer 節點的 **Expand** 即可。

source: To adjust how the VideoStreamPlayer node resizes depending on window size, adjust the anchors using the **Layout** menu at the top of the 2D editor viewport. However, this setup may not be powerful enough to handle all use cases, such as playing fullscreen videos without distorting the video (but with empty space on the edges instead). For more control, you can use an :ref:`class_AspectRatioContainer` node, which is designed to handle this kind of use case:
de: Um die Größenanpassung des VideoStreamPlayer-Nodes in Abhängigkeit von der Fenstergröße einzustellen, passen Sie die Anker über das Menü **Layout** oben im Viewport des 2D-Editors an. Diese Einstellung ist jedoch möglicherweise nicht leistungsfähig genug, um alle Anwendungsfälle zu bewältigen, z. B. die Wiedergabe von Videos im Vollbildmodus ohne Verzerrung des Videos (statt mit leeren Bereichen an den Rändern). Für mehr Kontrolle können Sie einen :ref:`class_AspectRatioContainer`-Node verwenden, der für diese Art von Anwendungsfall entwickelt wurde:
zh_tw: 要調整 VideoPlayer 節點的大小隨視窗大小改變的方式，請通過 2D 編輯器視口頂部的**佈局**按鈕調整錨點。不過，這種設定可能不足以處理所有可能的情況，例如全屏播放影片但不造成形變（需要在邊界處留白）。要進行精確的控制，你可以使用專為處理這種情況設計的 :ref:`class_AspectRatioContainer` 節點：

source: Add an AspectRatioContainer node. Make sure it is not a child of any other container node. Select the AspectRatioContainer node, then set its **Layout** at the top of the 2D editor to **Full Rect**. Set **Ratio** in the AspectRatioContainer node to match your video's aspect ratio. You can use math formulas in the inspector to help yourself. Remember to make one of the operands a float. Otherwise, the division's result will always be an integer.
de: Fügen Sie einen AspectRatioContainer-Node hinzu. Vergewissern Sie sich, dass dieser Node kein untergeordneter Node eines anderen Containers ist. Wählen Sie den AspectRatioContainer-Node aus, und stellen Sie sein **Layout** oben im 2D-Editor auf **Vollständiges Rechteck** ein. Stellen Sie **Verhältnis** im AspectRatioContainer-Node so ein, dass es dem Seitenverhältnis Ihres Videos entspricht. Sie können die mathematischen Formeln im Inspektor zur Hilfe nehmen. Achten Sie darauf, dass einer der Operanden eine Float-Zahl ist. Andernfalls wird das Ergebnis der Division immer eine ganze Zahl sein.
zh_tw: 新增一個 AspectRatioContainer 節點。請確保它不是任何其他容器節點的子節點。選中該 AspectRatioContainer 節點，然後在 2D 編輯器的頂部將**佈局**設定為**整個矩形**。將 AspectRatioContainer 節點的 **Ratio（比例）**設定為與你的影片的長寬比配對的比例。你可以在屬性面板裡直接輸入數學公式。請記住要將其中的一個運算元寫成浮點形式，否則會得到整數的商。

source: AspectRatioContainer's Ratio property being modified in the editor inspector
de: Änderung der Verhältnis-Property des AspectRatioContainers im Inspektor des Editors
zh_tw: 在編輯器屬性面板中修改 AspectRatioContainer 的 Ratio 屬性

source: This will evaluate to (approximately) 1.777778
de: Dies ergibt einen Wert von (ungefähr) 1,777778
zh_tw: 求值會得到（大約）1.777778

source: Once you've configured the AspectRatioContainer, reparent your VideoStreamPlayer node to be a child of the AspectRatioContainer node. Make sure **Expand** is enabled on the VideoStreamPlayer. Your video should now scale automatically to fit the whole screen while avoiding distortion.
de: Nachdem Sie den AspectRatioContainer konfiguriert haben, richten Sie den VideoStreamPlayer-Node so ein, dass er ein untergeordneter Node des AspectRatioContainers ist. Stellen Sie sicher, dass **Ausdehnen** auf dem VideoStreamPlayer aktiviert ist. Ihr Video sollte nun automatisch so skaliert werden, dass es auf den gesamten Bildschirm passt und keine Verzerrungen aufweist.
zh_tw: 配置好 AspectRatioContainer 之後，請將你的 VideoPlayer 節點調整為該 AspectRatioContainer 節點的子節點。請確保禁用了該 VideoPlayer 的 **Expand**。你的影片現在應該就會自動適應到全屏的大小，不產生變形。

source: See :ref:`doc_multiple_resolutions` for more tips on supporting multiple aspect ratios in your project.
de: Weitere Tipps zur Unterstützung mehrerer Seitenverhältnisse in Ihrem Projekt finden Sie unter :ref:`doc_multiple_resolutions`.
zh_tw: 更多在專案中支援不同的長寬比的技巧，請參閱 :ref:`doc_multiple_resolutions`。

source: Displaying a video on a 3D surface
de: Anzeige eines Videos auf einer 3D-Oberfläche
zh_tw: 在 3D 表面上顯示影片

source: Using a VideoStreamPlayer node as a child of a :ref:`class_SubViewport` node, it's possible to display any 2D node on a 3D surface. For example, this can be used to display animated billboards when frame-by-frame animation would require too much memory.
de: Mit einem VideoStreamPlayer-Node als Child eines :ref:`class_SubViewport`-Nodes ist es möglich, jeden 2D-Node auf einer 3D-Oberfläche darzustellen. Dies kann zum Beispiel verwendet werden, um animierte Werbetafeln anzuzeigen, wenn eine Frame-by-Frame-Animation zu viel Speicherplatz erfordern würde.
zh_tw: 使用 VideoPlayer 節點作為 :ref:`class_Viewport` 節點的子節點，就可以在 3D 表面上顯示任何 2D 節點。例如，可以用於顯示動態的廣告板，影格動畫可能花費太多的記憶體。

source: This can be done with the following steps:
de: Dies kann mit den folgenden Schritten geschehen:
zh_tw: 填寫下列設定：

source: Create a :ref:`class_SubViewport` node. Set its size to match your video's size in pixels.
de: Erstellen Sie einen :ref:`class_SubViewport`-Node. Stellen Sie seine Größe so ein, dass sie der Größe Ihres Videos in Pixeln entspricht.
zh_tw: 建立一個 :ref:`class_Viewport` 節點。將其設定為與你的影片大小相配對的像素大小。

source: Create a VideoStreamPlayer node *as a child of the SubViewport node* and specify a video path in it. Make sure **Expand** is disabled, and enable **Autoplay** if needed.
de: Erstellen Sie einen VideoStreamPlayer-Node *als untergeordnetes Element des SubViewport-Nodes* und geben Sie darin einen Videopfad an. Stellen Sie sicher, dass **Ausdehnen** deaktiviert ist, und aktivieren Sie **Autoplay**, falls erforderlich.
zh_tw: 建立一個 VideoPlayer 節點*作為該 Viewport 節點的子節點*，並為其指定一個影片的路徑。請確保禁用了 **Expand**，需要時啟用 **Autoplay**。

source: Create a MeshInstance3D node with a PlaneMesh or QuadMesh resource in its Mesh property. Resize the mesh to match the video's aspect ratio (otherwise, it will appear distorted).
de: Erstellen Sie einen MeshInstance3D-Node mit einer PlaneMesh- oder QuadMesh-Ressource in seiner Mesh-Property. Passen Sie die Größe des Meshes an das Seitenverhältnis des Videos an (andernfalls wird es verzerrt angezeigt).
zh_tw: 建立一個 MeshInstance 節點，將其 Mesh 屬性設為 PlaneMesh 或 QuadMesh。將該網格的大小調整到與影片的長寬比一致（否則看上去就會變形）。

source: Create a new StandardMaterial3D resource in the **Material Override** property in the GeometryInstance3D section.
de: Erstellen Sie eine neue Ressource StandardMaterial3D in der Property **Material-Override** im Abschnitt GeometryInstance3D.
zh_tw: 在 GeometryInstance 部分的 **Material Override** 屬性中新建一個 SpatialMaterial 資源。

source: Enable **Local To Scene** in the StandardMaterial3D's Resource section (at the bottom). This is *required* before you can use a ViewportTexture in its Albedo Texture property.
de: Aktivieren Sie **Lokal zu Szene** im Abschnitt Ressource des StandardMaterial3D (ganz unten). Dies ist *erforderlich*, bevor Sie eine ViewportTexture in ihrer Albedo-Textur-Property verwenden können.
zh_tw: 在該 SpatialMaterial（底部）的 Resource 部分啟用 **Local To Scene**。這是在 Albedo Texture 屬性中使用 ViewportTexture 所*必須的*。

source: In the StandardMaterial3D, set the **Albedo > Texture** property to **New ViewportTexture**. Edit the new resource by clicking it, then specify the path to the SubViewport node in the **Viewport Path** property.
de: Setzen Sie im StandardMaterial3D die Property **Albedo > Textur** auf **Neue ViewportTexture**. Bearbeiten Sie die neue Ressource, indem Sie darauf klicken, und geben Sie den Pfad zum SubViewport-Node in der **Viewport Path**-Property an.
zh_tw: 在該 SpatialMaterial 中，將 **Albedo > Texture** 屬性設定為**新建 ViewportTexture**。點擊編輯這個新的資源，在 **Viewport Path** 屬性中指定指向 Viewport 節點的路徑。

source: Enable **Albedo Texture Force sRGB** in the StandardMaterial3D to prevent colors from being washed out.
de: Aktivieren Sie **Albedo-Textur sRGB erzwingen** im StandardMaterial3D, um zu verhindern, dass die Farben ausgewaschen werden.
zh_tw: 在該 SpatialMaterial 中啟用 **Albedo Tex Force sRGB**，防止顏色變化。

source: If the billboard is supposed to emit its own light, set **Shading Mode** to **Unshaded** to improve rendering performance.
de: Wenn das Billboard sein eigenes Licht emittieren soll, setzen Sie **Shading-Modus** auf **kein Shading**, um die Performance zu verbessern.
zh_tw: 如果廣告板應該自發光，請啟用 **Flags > Unshaded** 提升算繪性能。

source: See :ref:`doc_viewports` and the `GUI in 3D demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ for more information on setting this up.
de: Siehe :ref:`doc_viewports` und die `GUI in 3D-Demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ für weitere Informationen zur Einrichtung dieser Funktion.
zh_tw: 若欲檢視範例專案，請參考作業系統示範專案： https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test

source: Looping a video
de: Looping eines Videos

source: For looping a video, the **Loop** property can be enabled. This will seamlessly restart the video when it reaches its end.
de: Um ein Video in einer Loop laufen zu lassen, kann die Property **Loop** aktiviert werden. Dadurch wird das Video nahtlos neu gestartet, wenn es sein Ende erreicht.

source: Note that setting the project setting **Video Delay Compensation** to a non-zero value might cause your loop to not be seamless, because the synchronization of audio and video takes place at the start of each loop causing occasional missed frames. Set **Video Delay Compensation** in your project settings to **0** to avoid frame drop issues.
de: Beachten Sie, dass die Projekteinstellung **Videoverzögerungskompensation** auf einen Wert ungleich Null gesetzt werden kann, was dazu führen kann, dass Ihre Loop nicht nahtlos ist, da die Synchronisierung von Audio und Video am Anfang jeder Loop stattfindet, wodurch gelegentlich Frames ausgelassen werden. Setzen Sie die **Videoverzögerungskompensation** in Ihren Projekteinstellungen auf **0**, um Frame-Drop-Probleme zu vermeiden.

source: Video decoding conditions and recommended resolutions
de: Videodekodierungsbedingungen und empfohlene Auflösungen
zh_tw: 影片解碼條件及推薦解析度

source: Video decoding is performed on the CPU, as GPUs don't have hardware acceleration for decoding Theora videos. Modern desktop CPUs can decode Ogg Theora videos at 1440p @ 60 FPS or more, but low-end mobile CPUs will likely struggle with high-resolution videos.
de: Die Videodekodierung wird von der CPU durchgeführt, da GPUs keine Hardware-Beschleunigung für die Dekodierung von Theora-Videos haben. Moderne Desktop-CPUs können Ogg Theora-Videos mit 1440p @ 60 FPS oder mehr dekodieren, aber Low-End-Mobil-CPUs werden wahrscheinlich Probleme mit hochauflösenden Videos haben.
zh_tw: 由於 GPU 在解碼 Theora 影片時沒有硬體加速，所以影片解碼是在 CPU 上執行的。現代的桌面 CPU 可以以 1440p @ 60 FPS 或更高的速度解碼 Ogg Theora 格式的影片，但低端移動 CPU 處理高解析度影片可能會比較吃力。

source: To ensure your videos decode smoothly on varied hardware:
de: Damit Ihre Videos auf verschiedenen Geräten reibungslos dekodiert werden können:
zh_tw: 為了確保影片在各種硬體上都能夠順利解碼：

source: When developing games for desktop platforms, it's recommended to encode in 1080p at most (preferably at 30 FPS). Most people are still using 1080p or lower resolution displays, so encoding higher-resolution videos may not be worth the increased file size and CPU requirements.
de: Bei der Entwicklung von Spielen für Desktop-Plattformen wird empfohlen, maximal in 1080p zu kodieren (vorzugsweise mit 30 FPS). Die meisten Menschen verwenden immer noch Bildschirme mit 1080p oder einer niedrigeren Auflösung. Die Codierung von Videos mit höherer Auflösung lohnt sich daher möglicherweise nicht wegen der erhöhten Dateigröße und der CPU-Anforderungen.
zh_tw: 為桌面平臺開發遊戲時，建議最多編碼為 1080p（最好是 30 FPS）。大多數人還在使用 1080p 或者更低解析度的顯示器，所以編碼為更高解析度的影片可能不值那些增大的檔大小和 CPU 需求。

source: When developing games for mobile or web platforms, it's recommended to encode in 720p at most (preferably at 30 FPS or even lower). The visual difference between 720p and 1080p videos on a mobile device is usually not that noticeable.
de: Bei der Entwicklung von Spielen für Mobil- oder Webplattformen empfiehlt es sich, höchstens in 720p zu kodieren (vorzugsweise mit 30 FPS oder noch niedriger). Der visuelle Unterschied zwischen 720p- und 1080p-Videos ist auf einem mobilen Gerät in der Regel nicht besonders auffällig.
zh_tw: 為移動和 Web 平臺開發遊戲時，建議最多編碼為 720p（最好是 30 FPS 或更低）。移動裝置上 720p 和 1080p 的影片通常很難看出區別。

source: Playback limitations
de: Einschränkungen bei der Wiedergabe
zh_tw: 限制

source: There are several limitations with the current implementation of video playback in Godot:
de: Es gibt einige Einschränkungen bei der aktuellen Implementierung der Videowiedergabe in Godot:
zh_tw: Godot 沒有使用限制

source: Seeking a video to a certain point is not supported.
de: Das Anspringen eines bestimmten Punkts im Video wird nicht unterstützt.
zh_tw: 不支援將影片跳躍到特定的時間點。

source: Changing playback speed is not supported. VideoStreamPlayer also won't follow :ref:`Engine.time_scale<class_Engine_property_time_scale>`.
de: Das Ändern der Abspielgeschwindigkeit wird nicht unterstützt. Der VideoStreamPlayer folgt auch nicht :ref:`Engine.time_scale<class_Engine_property_time_scale>`.
zh_tw: 不支援修改播放速度。VideoPlayer 也不會遵循 :ref:`Engine.time_scale<class_Engine_property_time_scale>`。

source: Streaming a video from a URL is not supported.
de: Das Streamen eines Videos von einer URL wird nicht unterstützt.
zh_tw: 不支援從 URL 播放影片流。

source: Recommended Theora encoding settings
de: Empfohlene Theora-Kodierungseinstellungen
zh_tw: 推薦 Theora 編碼設定

source: A word of advice is to **avoid relying on built-in Ogg Theora exporters** (most of the time). There are 2 reasons you may want to favor using an external program to encode your video:
de: Ein guter Rat ist, sich **nicht auf die eingebauten Ogg Theora-Exporter** zu verlassen (meistens). Es gibt 2 Gründe, warum Sie ein externes Programm für die Kodierung Ihres Videos bevorzugen sollten:
zh_tw: 建議是（在大多數情況下）**避免依賴內建的 Ogg Theora 匯出器**。你可能想要優先使用外部程式編碼影片的原因有 2 個：

source: Some programs such as Blender can render to Ogg Theora. However, the default quality presets are usually very low by today's standards. You may be able to increase the quality options in the software you're using, but you may find the output quality to remain less than ideal (given the increased file size). This usually means that the software only supports encoding to constant bit rate (CBR), instead of variable bit rate (VBR). VBR encoding should be preferred in most scenarios as it provides a better quality to file size ratio.
de: Einige Programme wie Blender können in Ogg Theora rendern. Allerdings sind die Standardqualitätsvorgaben nach heutigen Maßstäben meist sehr niedrig. Möglicherweise können Sie die Qualitätsoptionen in der von Ihnen verwendeten Software erhöhen, aber Sie werden feststellen, dass die Ausgabequalität nicht ideal ist (angesichts der erhöhten Dateigröße). Dies bedeutet in der Regel, dass die Software nur die Kodierung mit konstanter Bitrate (CBR) anstelle der variablen Bitrate (VBR) unterstützt. Die VBR-Kodierung sollte in den meisten Fällen bevorzugt werden, da sie ein besseres Verhältnis zwischen Qualität und Dateigröße bietet.
zh_tw: Blender 等程式可以算繪 Ogg Theora。然而，預設的品質預設就如今的標準而言通常是非常低的。你可能可以在軟體裡提高品質選項，但輸出的品質可能仍然不理想（提升了檔大小）。這通常意味著那個軟體只支援按照固定位元速率（CBR）去進行編碼，不支援變數位元速率（VBR）。大多數場合應該都優先使用 VBR 編碼，因為在相同的檔大小下能夠提供更好的品質。

source: Some other programs can't render to Ogg Theora at all.
de: Einige andere Programme können überhaupt nicht in Ogg Theora rendern.
zh_tw: 有些其他的程式根本無法算繪 Ogg Theora。

source: In this case, you can **render the video to an intermediate high-quality format** (such as a high-bitrate H.264 video) then re-encode it to Ogg Theora. Ideally, you should use a lossless or uncompressed format as an intermediate format to maximize the quality of the output Ogg Theora video, but this can require a lot of disk space.
de: In diesem Fall können Sie **das Video in ein hochwertiges Zwischenformat rendern** (z. B. ein H.264-Video mit hoher Bitrate) und es dann erneut in Ogg Theora kodieren. Idealerweise sollten Sie ein verlustfreies oder unkomprimiertes Format als Zwischenformat verwenden, um die Qualität des ausgegebenen Ogg Theora-Videos zu maximieren, aber dies kann viel Speicherplatz erfordern.
zh_tw: 在這種情況下，你可以**將影片使用高品質格式算繪作為仲介**（例如高位元速率 H.264 影片），然後再重新編碼成 Ogg Theora。理想情況下，你應該使用無損或者未壓縮格式作為仲介格式，最大化輸出 Ogg Theora 影片的品質，不過這樣做會需要大量的磁碟空間。

source: `HandBrake <https://handbrake.fr/>`__ (GUI) and `FFmpeg <https://ffmpeg.org/>`__ (CLI) are popular open source tools for this purpose. FFmpeg has a steeper learning curve, but it's more powerful.
de: `HandBrake <https://handbrake.fr/>`__ (GUI) und `FFmpeg <https://ffmpeg.org/>`__ (CLI) sind beliebte Open-Source-Tools für diesen Zweck. FFmpeg hat eine steilere Lernkurve, aber es ist leistungsfähiger.
zh_tw: `HandBrake <https://handbrake.fr/>`__（GUI）和 `FFmpeg <https://ffmpeg.org/>`__（CLI）都是這方面非常流行的開源工具。FFmpeg 的學習曲線相對陡峭，但功能也更強大。

source: Here are example FFmpeg commands to convert a MP4 video to Ogg Theora. Since FFmpeg supports a lot of input formats, you should be able to use the commands below with almost any input video format (AVI, MOV, WebM, …).
de: Hier ein Beispiel für FFmpeg-Befehle zur Konvertierung eines MP4-Videos in Ogg Theora. Da FFmpeg eine Vielzahl von Eingabeformaten unterstützt, sollten Sie in der Lage sein, die folgenden Befehle mit fast jedem Eingabevideoformat (AVI, MOV, WebM, ...) zu verwenden.
zh_tw: 這是將 MP4 視訊轉換為 Ogg Theora 的 FFmpeg 命令範例。因為 FFmpeg 支援很多輸入格式，幾乎任何輸入影片格式（AVI、MOV、WebM……）應該都可以使用下面的命令。

source: Make sure your copy of FFmpeg is compiled with libtheora and libvorbis support. You can check this by running ``ffmpeg`` without any arguments, then looking at the ``configuration:`` line in the command output.
de: Stellen Sie sicher, dass Ihr FFmpeg mit Unterstützung für libtheora und libvorbis kompiliert ist. Sie können dies überprüfen, indem Sie ``ffmpeg`` ohne Argumente ausführen und dann die Zeile ``configuration:`` in der Befehlsausgabe betrachten.
zh_tw: 請確保你的 FFmpeg 副本是啟用 libtheora 和 libvorbis 編譯的。檢查方法是不帶任何參數執行 ``ffmpeg``，然後查看命令輸出中的 ``configuration:`` 一行。

source: Balancing quality and file size
de: Ausbalancieren von Qualität und Dateigröße
zh_tw: 平衡品質與檔大小
