Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/bbcode_*_richtextlabel.po
Languages: de, zh_tw

source: BBCode in RichTextLabel
zh_tw: RichTextLabel 中的 BBCode

source: Introduction
de: Einführung
zh_tw: 前言

source: :ref:`class_Label` nodes are great for displaying basic text, but they have limitations. If you want to change the color of the text, or its alignment, you can only do that to the entire label. You can't make a part of the text have another color, or have a part of the text centered. To get around these limitations, you would use a :ref:`class_RichTextLabel`.
de: :ref:`class_Label`-Nodes eignen sich hervorragend für die Anzeige von einfachem Text, aber sie haben ihre Grenzen. Wenn Sie die Farbe des Textes oder seine Ausrichtung ändern wollen, können Sie das nur für das gesamte Label tun. Es ist nicht möglich, einem Teil des Textes eine andere Farbe zu geben oder einen Teil des Textes zu zentrieren. Um diese Einschränkungen zu umgehen, würden Sie ein :ref:`class_RichTextLabel` verwenden.
zh_tw: Label 節點非常適合顯示基本文字，但它們有局限性。如果更改文字的顏色或對齊方式，則該更改會影響標籤節點中的所有文字。沒法只讓一部分文字用一種顏色，或者只居中一部分文字。要繞過此限制，可以使用 :ref:`class_RichTextLabel` 。

source: :ref:`class_RichTextLabel` allows for complex formatting of text using a markup syntax or the built-in API. It uses BBCodes for the markup syntax, a system of tags that designate formatting rules for a part of the text. You may be familiar with them if you ever used forums (also known as `bulletin boards`, hence the "BB" in "BBCode").
de: :ref:`class_RichTextLabel` ermöglicht die komplexe Formatierung von Text mit Hilfe einer Markup-Syntax oder der eingebauten API. Es verwendet BBCodes für die Markup-Syntax, ein System von Tags, die Formatierungsregeln für einen Teil des Textes bezeichnen. Vielleicht sind Sie damit vertraut, wenn Sie schon einmal Foren benutzt haben (auch bekannt als `Bulletin Boards`, daher das "BB" in "BBCode").
zh_tw: class_RichTextLabel 允許使用標記語法或內建 API 對文字進行複雜的格式化。它使用 BBCodes 作為標記語法，這是一種為部分文字指定格式規則的標記系統。如果您曾經使用過論壇（也稱為“公告板”，因此“BBCode”中的“BB”），您可能會熟悉它們。

source: Unlike Label, RichTextLabel also comes with its own vertical scrollbar. This scrollbar is automatically displayed if the text does not fit within the control's size. The scrollbar can be disabled by unchecking the **Scroll Active** property in the RichTextLabel inspector.
de: Im Gegensatz zu Label verfügt RichTextLabel auch über eine eigene vertikale Scrollbar. Diese Scrollbar wird automatisch angezeigt, wenn der Text nicht in die Größe des Controls passt. Die Scrollbar kann durch Deaktivieren der Property **Scroll Active** im RichTextLabel-Inspektor deaktiviert werden.
zh_tw: 與 Label 不同，RichTextLabel 還帶有自己的垂直捲軸。如果文字不適合控制項的大小，則會自動顯示此捲軸。可以透過取消選取 RichTextLabel 屬性面板中的 **Scroll Active** 屬性來停用捲軸。

source: Note that the BBCode tags can also be used to some extent in the XML source of the class reference. For more information, see :ref:`doc_class_reference_primer`.
de: Beachten Sie, dass die BBCode-Tags bis zu einem gewissen Grad auch in der XML-Quelle der Klassenreferenz verwendet werden können. Für weitere Informationen, siehe :ref:`doc_class_reference_primer`.
zh_tw: 大部分BBCode標籤也可以用在 :ref:`XML 格式的類參考文件 <doc_updating_the_class_reference>` .

source: You can see how BBCode in RichTextLabel works in action using the `Rich Text Label with BBCode demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/rich_text_bbcode>`__.
de: Sie können sehen, wie BBCode in RichTextLabel in Aktion funktioniert, indem Sie das `Rich Text Label with BBCode Demoprojekt <https://github.com/godotengine/godot-demo-projects/tree/master/gui/rich_text_bbcode>`__ verwenden.
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Using BBCode
de: Verwendung von BBCode
zh_tw: 使用 BBCode

source: By default, :ref:`class_RichTextLabel` functions like a normal :ref:`class_Label`. It has the :ref:`property_text <class_RichTextLabel_property_text>` property, which you can edit to have uniformly formatted text. To be able to use BBCode for rich text formatting, you need to turn on the BBCode mode by setting :ref:`bbcode_enabled <class_RichTextLabel_property_bbcode_enabled>`. After that, you can edit the :ref:`text <class_RichTextLabel_property_text>` property using available tags. Both properties are located at the top of the inspector after selecting a RichTextLabel node.
de: Standardmäßig funktioniert :ref:`class_RichTextLabel` wie ein normales :ref:`class_Label`. Es hat die Property :ref:`property_text <class_RichTextLabel_property_text>`, die Sie bearbeiten können, um einheitlich formatierten Text zu erhalten. Um BBCode für die Rich-Text-Formatierung verwenden zu können, müssen Sie den BBCode-Modus einschalten, indem Sie :ref:`bbcode_enabled <class_RichTextLabel_property_bbcode_enabled>` setzen. Danach können Sie die Property :ref:`text <class_RichTextLabel_property_text>` mit den verfügbaren Tags bearbeiten. Beide Properties befinden sich im oberen Bereich des Inspektors, nachdem ein RichTextLabel-Node ausgewählt wurde.
zh_tw: 預設情況下，class_RichTextLabel 的功能與普通的 class_Label 類似。它具有 :ref:`property_text <class_RichTextLabel_property_text>` 屬性，您可以編輯該屬性以取得均勻格式的文字。為了能夠使用 BBCode 進行富文字格式，您需要透過設定 :ref:`bbcode_enabled <class_RichTextLabel_property_bbcode_enabled>` 開啟 BBCode 模式。之後，您可以使用可用標籤編輯:ref:`text <class_RichTextLabel_property_text>` 屬性。選擇 RichTextLabel 節點後，這兩個屬性都位於檢視器的頂端。

source: For example, ``BBCode [color=green]test[/color]`` would render the word "test" with a green color.
de: Zum Beispiel würde ``BBCode [color=green]test[/color]`` das Wort "test" mit einer grünen Farbe darstellen.
zh_tw: 例如， ``BBCode [color=blue]blue[/color]`` 將會出現藍色的單詞“blue”。

source: Most BBCodes consist of 3 parts: the opening tag, the content and the closing tag. The opening tag delimits the start of the formatted part, and can also carry some configuration options. Some opening tags, like the ``color`` one shown above, also require a value to work. Other opening tags may accept multiple options (separated by spaces within the opening tag). The closing tag delimits the end of the formatted part. In some cases, both the closing tag and the content can be omitted.
de: Die meisten BBCodes bestehen aus drei Teilen: dem öffnenden Tag, dem Inhalt und dem schließenden Tag. Der öffnende Tag grenzt den Beginn des formatierten Teils ab und kann auch einige Konfigurationsoptionen enthalten. Einige öffnende Tags, wie der oben gezeigte ``color``, benötigen auch einen Wert, um zu funktionieren. Andere öffnende Tags können mehrere Optionen akzeptieren (getrennt durch Leerzeichen innerhalb des öffnenden Tags). Der schließende Tag begrenzt das Ende des formatierten Teils. In einigen Fällen können sowohl das schließende Tag als auch der Inhalt weggelassen werden.
zh_tw: 大多數 BBCode 由 3 部群組成：開始標籤、內容和結束標籤。開始標記界定格式化部分的開始，也可以攜帶一些設定選項。一些開始標籤，例如上面顯示的“color”，也需要一個值才能工作。其他開始標籤可以接受多個選項（在開始標籤內以空格分隔）。結束標記界定格式化部分的結尾。在某些情況下，結束標記和內容都可以省略。

source: Unlike BBCode in HTML, leading/trailing whitespace is not removed by a RichTextLabel upon display. Duplicate spaces are also displayed as-is in the final output. This means that when displaying a code block in a RichTextLabel, you don't need to use a preformatted text tag.
de: Im Gegensatz zu BBCode in HTML werden führende/abschließende Leerzeichen bei der Anzeige eines RichTextLabels nicht entfernt. Auch doppelte Leerzeichen werden in der endgültigen Ausgabe unverändert angezeigt. Das bedeutet, dass Sie bei der Anzeige eines Codeblocks in einem RichTextLabel kein vorformatiertes Text-Tag verwenden müssen.
zh_tw: 與 HTML 中的 BBCode 不同，RichTextLabel 在顯示時不會刪除前導/尾隨空白。重複的空格也會以原樣顯示在最終輸出中。這意味著在 RichTextLabel 中顯示程式碼區塊時，您不需要使用預先格式化的文字標記。

source: RichTextLabel doesn't support entangled BBCode tags. For example, instead of using:
de: RichTextLabel unterstützt keine verschränkten BBCode-Tags. Zum Beispiel, statt der Verwendung von:
zh_tw: RichTextLabel 不支援糾纏 BBCode 標籤。例如，不要使用：

source: Use:
de: Verwenden Sie:
zh_tw: 請使用：

source: Handling user input safely
de: Sichere Handhabung von Benutzereingaben
zh_tw: 安全地處理使用者輸入

source: In a scenario where users may freely input text (such as chat in a multiplayer game), you should make sure users cannot use arbitrary BBCode tags that will be parsed by RichTextLabel. This is to avoid inappropriate use of formatting, which can be problematic if ``[url]`` tags are handled by your RichTextLabel (as players may be able to create clickable links to phishing sites or similar).
de: In einem Szenario, in dem Benutzer frei Text eingeben können (z.B. Chat in einem Multiplayer-Spiel), sollten Sie sicherstellen, dass Benutzer keine beliebigen BBCode-Tags verwenden können, die von RichTextLabel geparst werden. Dies dient dazu, eine unangemessene Verwendung von Formatierungen zu vermeiden, was problematisch sein kann, wenn ``[url]``-Tags von Ihrem RichTextLabel verarbeitet werden (da Spieler in der Lage sein könnten, anklickbare Links zu Phishing-Seiten oder ähnlichem zu erstellen).
zh_tw: 在使用者可以自由輸入文字的場景中（例如多人遊戲中的聊天），您應該確保使用者不能使用將由 RichTextLabel 解析的任意 BBCode 標籤。這是為了避免不當使用格式，如果您的 RichTextLabel 處理「[url]」標籤，這可能會出現問題（因為玩家可能能夠建立指向網路釣魚網站或類似網站的可點擊連結）。

source: Using RichTextLabel's ``[lb]`` and/or ``[rb]`` tags, we can replace the opening and/or closing brackets of any BBCode tag in a message with those escaped tags. This prevents users from using BBCode that will be parsed as tags – instead, the BBCode will be displayed as text.
de: Mit Hilfe der RichTextLabel-Tags ``[lb]`` und/oder ``[rb]`` können wir die öffnenden und/oder schließenden Klammern jedes BBCode-Tags in einer Nachricht durch diese maskierten Tags ersetzen. Dadurch wird verhindert, dass Benutzer BBCode verwenden, der als Tags geparst wird - stattdessen wird der BBCode als Text angezeigt.
zh_tw: 使用 RichTextLabel 的「[lb]」和/或「[rb]」標籤，我們可以用這些轉義標籤取代訊息中任何 BBCode 標籤的左括號和/或右括號。這可以防止使用者使用將被解析為標籤的 BBCode - 相反，BBCode 將顯示為文字。

source: Example of unescaped user input resulting in BBCode injection (2nd line) and escaped user input (3rd line)
de: Beispiel für eine Benutzereingabe ohne Maskierung, die zu einer BBCode-Injection führt (2. Zeile) und eine Benutzereingabe mit Maskierung (3. Zeile)
zh_tw: 未轉義的使用者輸入導致 BBCode 注入（第 2 行）和轉義的使用者輸入（第 3 行）的範例

source: The above image was created using the following script:
de: Das obige Bild wurde mit folgendem Skript erstellt:
zh_tw: 這幾個檔案的內容如下：

source: Stripping BBCode tags
de: Entfernen von BBCode-Tags
zh_tw: 在二進位檔中移除

source: For certain use cases, it can be desired to remove BBCode tags from the string. This is useful when displaying the RichTextLabel's text in another Control that does not support BBCode (such as a tooltip):
de: Für bestimmte Anwendungsfälle kann es erwünscht sein, BBCode-Tags aus dem String zu entfernen. Dies ist nützlich, wenn der Text des RichTextLabels in einem anderen Control angezeigt wird, das BBCode nicht unterstützt (z.B. ein Tooltip):
zh_tw: 對於某些用例，可能需要從字串中刪除 BBCode 標籤。當在另一個不支援 BBCode 的控制項（例如工具提示）中顯示 RichTextLabel 的文字時，這非常有用：

source: Removing BBCode tags entirely isn't advised for user input, as it can modify the displayed text without users understanding why part of their message was removed. :ref:`Escaping user input <doc_bbcode_in_richtextlabel_handling_user_input_safely>` should be preferred instead.
de: Das vollständige Entfernen von BBCode-Tags ist für Benutzereingaben nicht ratsam, da es den angezeigten Text verändern kann, ohne dass die Benutzer verstehen, warum ein Teil ihrer Nachricht entfernt wurde. :ref:`Maskieren von Benutzereingaben <doc_bbcode_in_richtextlabel_handling_user_input_safely>` sollte stattdessen bevorzugt werden.
zh_tw: 不建議對使用者輸入完全刪除 BBCode 標籤，因為它可能會修改顯示的文字，而使用者並不了解部分訊息被刪除的原因。 :ref:`轉義使用者輸入 <doc_bbcode_in_richtextlabel_handling_user_input_safely>` 應該是首選。

source: Performance
zh_tw: 效能

source: In most cases, you can use BBCode directly as-is since text formatting is rarely a heavy task. However, with particularly large RichTextLabels (such as console logs spanning thousands of lines), you may encounter stuttering during gameplay when the RichTextLabel's text is updated.
de: In den meisten Fällen können Sie BBCode direkt verwenden, da die Textformatierung selten eine schwere Aufgabe ist. Bei besonders großen RichTextLabels (z. B. Konsolenprotokollen, die Tausende von Zeilen umfassen) kann es jedoch während des Spiels zu Stuttering kommen, wenn der Text des RichTextLabels aktualisiert wird.
zh_tw: 在大多數情況下，您可以直接按原樣使用 BBCode，因為文字格式化很少是一項繁重的工作。但是，對於特別大的 RichTextLabel（例如跨越數千行的控制台紀錄），當更新 RichTextLabel 的文字時，您可能會在遊戲過程中遇到卡頓的情況。

source: There are several ways to alleviate this:
de: Es gibt mehrere Möglichkeiten, dieses Problem zu lösen:
zh_tw: Godot 沒有使用限制

source: Use the ``append_text()`` function instead of appending to the ``text`` property. This function will only parse BBCode for the added text, rather than parsing BBCode from the entire ``text`` property.
de: Verwenden Sie die Funktion ``append_text()`` anstelle des Anhängens an die ``text``-Property. Diese Funktion analysiert nur den BBCode für den hinzugefügten Text, anstatt den BBCode der gesamten ``text``-Property zu analysieren.
zh_tw: 使用“append_text()”函式而不是附加到“text”屬性。此函式只會解析新增文字的 BBCode，而不是從整個「text」屬性解析 BBCode。

source: Use ``push_[tag]()`` and ``pop()`` functions to add tags to RichTextLabel instead of using BBCode.
de: Verwenden Sie die Funktionen ``push_[tag]()`` und ``pop()``, um Tags zu RichTextLabel hinzuzufügen, anstatt BBCode zu verwenden.
zh_tw: 使用``push_[tag]()`` 和``pop()`` 函式將標籤新增至RichTextLabel，而不是使用BBCode。

source: Enable the **Threading > Threaded** property in RichTextLabel. This won't speed up processing, but it will prevent the main thread from blocking, which avoids stuttering during gameplay. Only enable threading if it's actually needed in your project, as threading has some overhead.
de: Aktivieren Sie die Property **Threading > Threaded** in RichTextLabel. Dies wird die Verarbeitung nicht beschleunigen, aber es wird verhindern, dass der Hauptthread blockiert, was Stuttering während des Spiels verhindert. Aktivieren Sie Threading nur, wenn es in Ihrem Projekt tatsächlich benötigt wird, da Threading einen gewissen Overhead verursacht.
zh_tw: 在 RichTextLabel 中啟用 **Threading > Threaded** 屬性。這不會加快處理速度，但會防止主執行緒阻塞，從而避免在遊戲過程中出現卡頓。僅在專案中實際需要時才啟用線程，因為線程有一些開銷。

source: Using push_[tag]() and pop() functions instead of BBCode
de: Verwendung der Funktionen push_[tag]() und pop() anstelle von BBCode
zh_tw: 使用 push_[標籤]() 和 pop() 函式代替 BBCode

source: If you don't want to use BBCode for performance reasons, you can use functions provided by RichTextLabel to create formatting tags without writing BBCode in the text.
de: Wenn Sie aus Performance-Gründen keinen BBCode verwenden möchten, können Sie die von RichTextLabel bereitgestellten Funktionen verwenden, um Formatierungs-Tags zu erstellen, ohne BBCode in den Text zu schreiben.
zh_tw: 如果因為效能原因不想使用 BBCode，可以使用 RichTextLabel 提供的函式來建立格式化標籤，而無需在文字中寫入 BBCode。

source: Every BBCode tag (including effects) has a ``push_[tag]()`` function (where ``[tag]`` is the tag's name). There are also a few convenience functions available, such as ``push_bold_italics()`` that combines both ``push_bold()`` and ``push_italics()`` into a single tag. See the :ref:`RichTextLabel class reference <class_RichTextLabel>` for a complete list of ``push_[tag]()`` functions.
de: Jedes BBCode Tag (einschließlich der Effekte) hat eine ``push_[tag]()`` Funktion (wobei ``[tag]`` der Name des Tags ist). Es gibt auch einige Komfortfunktionen, wie ``push_bold_italics()``, die sowohl ``push_bold()`` als auch ``push_italics()`` in einem einzigen Tag kombiniert. Siehe die :ref:`RichTextLabel Klassenreferenz <class_RichTextLabel>` für eine komplette Liste der ``push_[tag]()`` Funktionen.
zh_tw: 每個 BBCode 標籤（包括效果）都有一個``push_[tag]()`` 函式（其中``[tag]`` 是標籤的名稱）。還有一些方便的函式可用，例如“push_bold_italics()”，它將“push_bold()”和“push_italics()”組合到一個標籤中。有關``push_[tag]()`` 函式的完整列表，請參閱 RichTextLabel 類別參考 <class_RichTextLabel>`。

source: The ``pop()`` function is used to end *any* tag. Since BBCode is a tag *stack*, using ``pop()`` will close the most recently started tags first.
de: Die Funktion ``pop()`` wird benutzt, um *jedes* Tag zu beenden. Da BBCode ein Tag-*Stack* ist, werden mit ``pop()`` die zuletzt gestarteten Tags zuerst geschlossen.
zh_tw: ``pop()`` 函式用於結束 *any* 標籤。由於 BBCode 是一個標籤 *stack*，因此使用 ``pop()`` 將首先關閉最近啟動的標籤。

source: The following script will result in the same visual output as using ``BBCode [color=green]test [i]example[/i][/color]``:
de: Das folgende Skript ergibt die gleiche visuelle Ausgabe wie die Verwendung von ``BBCode [color=green]test [i]example[/i][/color]``:
zh_tw: 以下腳本將產生與使用「BBCode [color=green]test [i]example[/i][/color]」相同的視覺輸出：

source: Do **not** set the ``text`` property directly when using formatting functions. Appending to the ``text`` property will erase all modifications made to the RichTextLabel using the ``append_text()``, ``push_[tag]()`` and ``pop()`` functions.
de: Setzen Sie **nicht** die ``text``-Property direkt, wenn Sie Formatierungsfunktionen verwenden. Das Anhängen an die ``text``-Property löscht alle Änderungen, die mit den Funktionen ``append_text()``, ``push_[tag]()`` und ``pop()`` am RichTextLabel vorgenommen wurden.
zh_tw: 使用格式化函式時，請勿直接設定“text”屬性。附加到「text」屬性將刪除使用「append_text()」、「push_[tag]()」和「pop()」函式對 RichTextLabel 所做的所有修改。

source: Reference
de: Referenz
zh_tw: 參考

source: Tag
zh_tw: 標籤

source: Example
de: Beispiel
zh_tw: 範例

source: **b**
zh_tw: **乙**

source: Makes ``{text}`` use the bold (or bold italics) font of ``RichTextLabel``.
de: Verwendet die fette (oder fett-kursive) Schriftart von ``RichTextLabel`` für ``{text}``.
zh_tw: 使“{text}”使用“RichTextLabel”的粗體（或粗體斜體）字形。

source: **i**
zh_tw: **我**

source: Makes ``{text}`` use the italics (or bold italics) font of ``RichTextLabel``.
de: Macht ``{text}`` zur kursiven (oder fett-kursiven) Schriftart von ``RichTextLabel``.
zh_tw: 使“{text}”使用“RichTextLabel”的斜體（或粗體斜體）字形。

source: Makes ``{text}`` underlined.
de: Stellt ``{text}`` unterstrichen dar.
zh_tw: 在 ``{text}`` 上顯示底線。

source: Makes ``{text}`` strikethrough.
de: Stellt ``{Text}`` durchgestrichen dar.
zh_tw: 在 ``{text}`` 上顯示刪除線。

source: Makes ``{text}`` use the mono font of ``RichTextLabel``.
de: Verwendet die Mono-Schriftart von ``RichTextLabel`` für ``{text}``.
zh_tw: 讓 ``{text}`` 使用 ``RichTextLabel`` 的等寬字形。

source: Adds new paragraph with ``{text}``. Supports configuration options, see :ref:`doc_bbcode_in_richtextlabel_paragraph_options`.
de: Fügt einen neuen Absatz mit ``{text}`` hinzu. Unterstützt Konfigurationsoptionen, siehe :ref:`doc_bbcode_in_richtextlabel_paragraph_options`.
zh_tw: 新增帶有``{text}``的新段落。支援配置選項，請參閱 :ref:`doc_bbcode_in_richtextlabel_paragraph_options`。

source: ``[p {options}]{text}[/p]``
zh_tw: ``[i]{text}[/i]``

source: Makes ``{text}`` horizontally centered.
de: Stellt ``{text}`` horizontal zentriert dar.
zh_tw: 使得 {text} 水平居中.

source: Same as ``[p align=center]``.
de: Dasselbe wie ``[p align=center]``.
zh_tw: 與“[palign=center]”相同。

source: Same as ``[p align=left]``.
de: Dasselbe wie ``[p align=left]``.
zh_tw: 與“[palign=left]”相同。

source: Makes ``{text}`` horizontally right-aligned.
de: Stellt ``{text}`` horizontal rechtsbündig dar.
zh_tw: 使得 {text} 右對齊.

source: Same as ``[p align=right]``.
de: Dasselbe wie ``[p align=right]``.
zh_tw: 與“[palign=right]”相同。

source: Makes ``{text}`` fill the full width of ``RichTextLabel``.
de: Stellt ``{text}`` in voller Breite von ``RichTextLabel`` dar.
zh_tw: 使{text}填充RichTextLabel的寬度.

source: Same as ``[p align=fill]``.
de: Dasselbe wie ``[p align=fill]``.
zh_tw: 與“[palign=fill]”相同。

source: Creates a hyperlink (underlined and clickable text). Can contain optional ``{text}`` or display ``{link}`` as is.
de: Erzeugt einen Hyperlink (unterstrichener und anklickbarer Text). Kann optionalen ``{text}`` enthalten oder ``{link}`` so anzeigen, wie er ist.
zh_tw: 建立超連結（帶下劃線且可點擊的文字）。可以包含可選的“{text}”或按原樣顯示“{link}”。

source: **Must be handled with the "meta_clicked" signal to have an effect,** see :ref:`doc_bbcode_in_richtextlabel_handling_url_tag_clicks`.
de: **Muss mit dem Signal "meta_clicked" behandelt werden, um eine Wirkung zu haben,** siehe :ref:`doc_bbcode_in_richtextlabel_handling_url_tag_clicks`.
zh_tw: 顯示 {url}，文字帶有底線並且可以點擊。**必須在“meta_clicked”訊號中處理，點擊才會生效。**參閱 :ref:`doc_bbcode_in_richtextlabel_handling_url_tag_clicks`。

source: ``[url]{link}[/url]``
zh_tw: ``[url]{url}[/url]``

source: ``[url={link}]{text}[/url]``
zh_tw: ``[url=<url>]{text}[/url]``

source: **hint**
zh_tw: **霧：**

source: Creates a tooltip hint that is displayed when hovering the text with the mouse. Tooltip text should not be quoted (quotes will appear as-is in the tooltip otherwise).
de: Erzeugt einen Tooltip-Hint, der angezeigt wird, wenn man mit der Maus über den Text fährt. Der Tooltip-Text sollte nicht in Anführungszeichen gesetzt werden (Anführungszeichen erscheinen sonst unverändert im Tooltip).
zh_tw: 建立當滑鼠懸停在文字上時顯示的工具提示提示。工具提示文字不應加引號（否則引號將按原樣顯示在工具提示中）。

source: ``[hint={tooltip text displayed on hover}]{text}[/hint]``
de: ``[hint={Tooltip-Text, der beim Maus-Überfahren angezeigt wird}]{text}[/hint]``
zh_tw: ``[hint={懸停時顯示的工具提示文字}]{文字}[/hint]``

source: Inserts an image from the ``{path}`` (can be any valid :ref:`class_Texture2D` resource).
de: Fügt ein Bild aus dem ``{path}`` ein (kann jede gültige :ref:`class_Texture2D`-Ressource sein).
zh_tw: 從「{path}」插入映像（可以是任何有效的 class_Texture2D 資源）。

source: If ``{width}`` is provided, the image will try to fit that width maintaining the aspect ratio.
de: Wenn ``{width}`` angegeben ist, wird das Bild versuchen, sich dieser Breite anzupassen, wobei das Seitenverhältnis beibehalten wird.
zh_tw: 如果提供了“{width}”，圖像將嘗試適應該寬度並保持縱橫比。

source: If both ``{width}`` and ``{height}`` are provided, the image will be scaled to that size.
de: Wenn sowohl ``{width}`` als auch ``{height}`` angegeben werden, wird das Bild auf diese Größe skaliert.
zh_tw: 如果同時提供了“{width}”和“{height}”，則圖像將縮放到該尺寸。

source: If ``{valign}`` configuration is provided, the image will try to align to the surrounding text, see :ref:`doc_bbcode_in_richtextlabel_image_alignment`.
de: Wenn die Konfiguration ``{valign}`` angegeben ist, wird das Bild versuchen, sich an dem umgebenden Text auszurichten, siehe :ref:`doc_bbcode_in_richtextlabel_image_alignment`.
zh_tw: 如果提供了「{valign}」配置，圖像將嘗試與周圍的文字對齊，請參閱:ref:`doc_bbcode_in_richtextlabel_image_alignment`。

source: Supports configuration options, see :ref:`doc_bbcode_in_richtextlabel_image_options`.
de: Unterstützt Konfigurationsoptionen, siehe :ref:`doc_bbcode_in_richtextlabel_image_options`.
zh_tw: 支援配置選項，請參閱 :ref:`doc_bbcode_in_richtextlabel_image_options`。

source: ``[img={valign}]{path}[/img]``
zh_tw: ``[img]{path}[/img]``

source: ``[img {options}]{path}[/img]``
zh_tw: ``[img]{path}[/img]``

source: Makes ``{text}`` use a font resource from the ``{path}``.
de: Bringt ``{text}`` dazu, eine Schriftart-Ressource aus dem ``{path}`` zu verwenden.
zh_tw: 使“{text}”使用“{path}”中的字型資源。

source: Supports configuration options, see :ref:`doc_bbcode_in_richtextlabel_font_options`.
de: Unterstützt Konfigurationsoptionen, siehe :ref:`doc_bbcode_in_richtextlabel_font_options`.
zh_tw: 支援配置選項，請參閱 :ref:`doc_bbcode_in_richtextlabel_font_options`。

source: ``[font {options}]{text}[/font]``
zh_tw: ``[font=<path>]{text}[/font]``

source: Use custom font size for ``{text}``.
de: Eigene Schriftart für ``{text}`` verwenden.
zh_tw: 為 {text} 內容設定自訂字形, 字形由 <path> 指定.

source: Use a different font size and color for ``{text}``, while making the tag's contents span multiple lines if it's large enough.
de: Verwenden einer anderen Schriftart und Farbe für ``{text}``, wobei der Inhalt des Tags sich über mehrere Zeilen erstreckt, wenn er groß genug ist.
zh_tw: 對「{text}」使用不同的字形大小和顏色，同時使標籤的內容在足夠大的情況下跨越多行。
