Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/bbcode_*_richtextlabel.po
Languages: de, zh_tw

source: A `drop cap <https://www.computerhope.com/jargon/d/dropcap.htm>`__ is typically one uppercase character, but ``[dropcap]`` supports containing multiple characters. ``margins`` values are comma-separated and can be positive, zero or negative. Negative top and bottom margins are particularly useful to allow the rest of the paragraph to display below the dropcap.
de: Ein `Dropcap <https://www.computerhope.com/jargon/d/dropcap.htm>`__ ist normalerweise ein Großbuchstabe, aber ``[dropcap]`` kann auch mehrere Zeichen enthalten. Die Werte von ``margins`` sind durch Kommas getrennt und können positiv, null oder negativ sein. Negative obere und untere Seitenränder sind besonders nützlich, um den Rest des Absatzes unterhalb des Dropcaps anzeigen zu lassen.
zh_tw: ‘首字下沉 <https://www.computerhope.com/jargon/d/dropcap.htm>`__ 通常是一個大寫字符，但 ``[dropcap]`` 支援包含多個字元。 「margins」值以逗號分隔，可以是正數、零或負數。負頂部和底部邊距對於允許段落的其餘部分顯示在首字下沉下方特別有用。

source: **opentype_features**
zh_tw: **功能：**

source: Enables custom OpenType font features for ``{text}``. Features must be provided as a comma-separated ``{list}``.
de: Aktiviert benutzerdefinierte OpenType Schriftart-Features für ``{text}``. Die Features müssen als kommagetrennte Liste in ``{list}`` angegeben werden.
zh_tw: 為 ``{text}`` 啟用自訂 OpenType 字形功能。``{list}`` 中的功能必須以英文逗號分隔。

source: ``{text}``
zh_tw: ``{project}``

source: Changes the color of ``{text}``. Color must be provided by a common name (see :ref:`doc_bbcode_in_richtextlabel_named_colors`) or using the HEX format (e.g. ``#ff00ff``, see :ref:`doc_bbcode_in_richtextlabel_hex_colors`).
de: Ändert die Farbe von ``{text}``. Die Farbe muss durch einen allgemeinen Namen (siehe :ref:`doc_bbcode_in_richtextlabel_named_colors`) oder durch das HEX-Format (z.B. ``#ff00ff``, siehe :ref:`doc_bbcode_in_richtextlabel_hex_colors`) angegeben werden.
zh_tw: 更改“{text}”的顏色。顏色必須由通用名稱提供（請參閱 doc_bbcode_in_richtextlabel_named_colors`）或使用十六進位格式（例如“#ff00ff”，請參閱 doc_bbcode_in_richtextlabel_hex_colors`）。

source: **bgcolor**
zh_tw: **編輯器:**

source: Draws the color behind ``{text}``. This can be used to highlight text. Accepts same values as the ``color`` tag.
de: Zeichnet die Farbe hinter ``{text}``. Dies kann verwendet werden, um Text hervorzuheben. Akzeptiert dieselben Werte wie der ``color``-Tag.
zh_tw: 繪製“{text}”後面的顏色。這可用於突出顯示文字。接受與“color”標籤相同的值。

source: **fgcolor**
zh_tw: **編輯器:**

source: Draws the color in front of ``{text}``. This can be used to "redact" text by using an opaque foreground color. Accepts same values as the ``color`` tag.
de: Zeichnet die Farbe vor dem ``{text}``. Dies kann verwendet werden, um Text mit einer undurchsichtigen Vordergrundfarbe zu "schwärzen". Akzeptiert dieselben Werte wie der Tag ``color``.
zh_tw: 在``{text}``前面繪製顏色。這可用於透過使用不透明的前景色來「編輯」文字。接受與“color”標籤相同的值。

source: Use custom font outline size for ``{text}``.
de: Verwenden einer benutzerdefinierten Schriftart für ``{text}``.
zh_tw: 為 {text} 內容設定自訂字形, 字形由 <path> 指定.

source: **outline_color**
zh_tw: **編輯器:**

source: Use custom outline color for ``{text}``. Accepts same values as the ``color`` tag.
de: Verwenden einer benutzerdefinierten Umrissfarbe für ``{text}``. Akzeptiert dieselben Werte wie der ``color``-Tag.
zh_tw: 對“{text}”使用自訂輪廓顏色。接受與“color”標籤相同的值。

source: Creates a table with the ``{number}`` of columns. Use the ``cell`` tag to define table cells.
de: Erzeugt eine Tabelle mit der ``{number}`` von Spalten. Verwenden Sie den ``cell``-Tag, um Tabellenzellen zu definieren.
zh_tw: 建立一個包含「{number}」欄位的表。使用“cell”標籤來定義表格儲存格。

source: Adds a cell with ``{text}`` to the table.
de: Fügt eine Zelle mit ``{text}`` in die Tabelle ein.
zh_tw: 將帶有{text}的儲存格新增到表格中.

source: If ``{ratio}`` is provided, the cell will try to expand to that value proportionally to other cells and their ratio values.
de: Wenn ``{ratio}`` angegeben ist, wird die Zelle versuchen, sich proportional zu anderen Zellen und deren Verhältniswerten auf diesen Wert auszudehnen.
zh_tw: 如果提供了“{ratio}”，則儲存格將嘗試與其他儲存格及其比值成比例地擴充到該值。

source: Supports configuration options, see :ref:`doc_bbcode_in_richtextlabel_cell_options`.
de: Unterstützt Konfigurationsoptionen, siehe :ref:`doc_bbcode_in_richtextlabel_cell_options`.
zh_tw: 支援配置選項，請參閱 :ref:`doc_bbcode_in_richtextlabel_cell_options`。

source: ``[cell {options}]{text}[/cell]``
zh_tw: ``[cell]{text}[/cell]``

source: Adds an unordered list. List ``{items}`` must be provided by putting one item per line of text.
de: Fügt eine ungeordnete Liste hinzu. Die Liste ``{items}`` muss mit einem Element pro Textzeile angegeben werden.
zh_tw: 新增無序列表。列表「{items}」必須透過在每行文字中放置一個專案來提供。

source: The bullet point can be customized using the ``{bullet}`` parameter, see :ref:`doc_bbcode_in_richtextlabel_unordered_list_bullet`.
de: Der Aufzählungspunkt kann mit dem Parameter ``{bullet}`` angepasst werden, siehe :ref:`doc_bbcode_in_richtextlabel_unordered_list_bullet`.
zh_tw: 可以使用「{bullet}」參數自訂專案符號點，請參閱 :ref:`doc_bbcode_in_richtextlabel_unordered_list_bullet`。

source: ``[ul bullet={bullet}]{items}[/ul]``
zh_tw: ``[url=<url>]{text}[/url]``

source: Adds an ordered (numbered) list of the given ``{type}`` (see :ref:`doc_bbcode_in_richtextlabel_list_types`). List ``{items}`` must be provided by putting one item per line of text.
de: Fügt eine geordnete (nummerierte) Liste des angegebenen ``{type}`` hinzu (siehe :ref:`doc_bbcode_in_richtextlabel_list_types`). Die Liste ``{items}`` muss mit einem Element pro Textzeile angegeben werden.
zh_tw: 新增給定「{type}」的有序（編號）列表（請參閱 :ref:`doc_bbcode_in_richtextlabel_list_types`）。列表「{items}」必須透過在每行文字中放置一個專案來提供。

source: ``[ol type={type}]{items}[/ol]``
zh_tw: ``[ol 型別={型別}]{專案}[/ol]``

source: **lb**, **rb**
zh_tw: **磅**，**rb**

source: Adds ``[`` and ``]`` respectively. Allows escaping BBCode markup.
de: Fügt ``[`` bzw. ``]`` hinzu. Ermöglicht das Maskieren von BBCode Markup.
zh_tw: 分別加上``[``和``]``。允許轉義 BBCode 標記。

source: These are self-closing tags, which means you do not need to close them (and there is no ``[/lb]`` or ``[/rb]`` closing tag).
de: Dies sind selbstschließende Tags, was bedeutet, dass Sie sie nicht schließen müssen (und es gibt keinen ``[/lb]`` oder ``[/rb]``-schließenden Tag).
zh_tw: 這些是自關閉標籤，這意味著您不需要關閉它們（並且沒有“[/lb]”或“[/rb]”關閉標籤）。

source: ``[lb]b[rb]text[lb]/b[rb]`` will display as ``[b]text[/b]``.
de: ``[lb]b[rb]text[lb]/b[rb]`` wird als ``[b]text[/b]`` angezeigt.
zh_tw: ``[lb]b[rb]text[lb]/b[rb]`` 將顯示為``[b]text[/b]``。

source: Several Unicode control characters can be added using their own self-closing tags.
de: Mehrere Unicode-Steuerzeichen können mit eigenen selbstschließenden Tags hinzugefügt werden.
zh_tw: 可以使用自己的自結束標記來新增多個 Unicode 控製字元。

source: This can result in easier maintenance compared to pasting those
de: Dies kann zu einer einfacheren Verwaltung führen als das Einfügen per Copy&Paste
zh_tw: 與貼上這些相比，這可以使維護更容易

source: control characters directly in the text.
de: Steuerzeichen direkt im Text.
zh_tw: 直接在文字中控製字元。

source: ``[lrm]`` (left-to-right mark), ``[rlm]`` (right-to-left mark), ``[lre]`` (left-to-right embedding),
de: ``[lrm]`` (Links-nach-Rechts-Markierung), ``[rlm]`` (Rechts-nach-Links-Markierung), ``[lre]`` (Links-nach-Rechts-Einbettung),
zh_tw: ``[lrm]``（從左到右標記），``[rlm]``（從右到左標記），``[lre]``（從左到右嵌入），

source: ``[rle]`` (right-to-left embedding), ``[lro]`` (left-to-right override), ``[rlo]`` (right-to-left override),
de: ``[rle]`` (Rechts-nach-Links-Einbettung), ``[lro]`` (Links-nach-Rechts-Überschreibung), ``[rlo]`` (Rechts-nach-Links-Überschreibung),
zh_tw: ``[rle]``（從右到左嵌入），``[lro]``（從左到右覆蓋），``[rlo]``（從右到左覆蓋），

source: ``[pdf]`` (pop directional formatting), ``[alm]`` (Arabic letter mark), ``[lri]`` (left-to-right isolate),
zh_tw: ``[pdf]``（流行定向格式），``[alm]``（阿拉伯字母標記），``[lri]``（從左到右隔離），

source: ``[rli]`` (right-to-left isolate), ``[fsi]`` (first strong isolate), ``[pdi]`` (pop directional isolate),
zh_tw: ``[rli]``（從右到左隔離），``[fsi]``（第一個強隔離），``[pdi]``（流行定向隔離），

source: ``[zwj]`` (zero-width joiner), ``[zwnj]`` (zero-width non-joiner), ``[wj]`` (word joiner),
zh_tw: ``[zwj]``（零寬度連接符），``[zwnj]``（零寬度非連接符），``[wj]``（單字連接符），

source: ``[shy]`` (soft hyphen)
de: ``[shy]`` (weicher Bindestrich)
zh_tw: ``[害羞]``（軟連字符）

source: Tags for bold (``[b]``) and italics (``[i]``) formatting work best if the appropriate custom fonts are set up in the RichTextLabelNode's theme overrides. If no custom bold or italic fonts are defined, `faux bold and italic fonts <https://fonts.google.com/knowledge/glossary/faux_fake_pseudo_synthesized>`__ will be generated by Godot. These fonts rarely look good in comparison to hand-made bold/italic font variants.
de: Tags für fette (``[b]``) und kursive (``[i]``) Formatierung funktionieren am besten, wenn die entsprechenden benutzerdefinierten Schriftarten in den Theme-Overrides des RichTextLabelNode eingerichtet sind. Wenn keine benutzerdefinierten fetten oder kursiven Schriftarten definiert sind, werden von Godot `pseudo-fette und kursive Schriftarten <https://fonts.google.com/knowledge/glossary/faux_fake_pseudo_synthesized>`__ erzeugt. Diese Schriftarten sehen im Vergleich zu handgefertigten fetten/kursiven Schriftarten selten gut aus.
zh_tw: 如果在 RichTextLabelNode 的主題覆蓋中設定了適當的自訂字形，則粗體 (``[b]``) 和斜體 (``[i]``) 格式的標籤效果最佳。如果沒有定義自訂粗體或斜體字形，則 Godot 將產生「仿粗體和斜體字形 <https://fonts.google.com/knowledge/glossary/faux_fake_pseudo_synthesized>」。與手工製作的粗體/斜體字形變體相比，這些字形很少看起來很好。

source: The monospaced (``[code]``) tag **only** works if a custom font is set up in the RichTextLabel node's theme overrides. Otherwise, monospaced text will use the regular font.
de: Der Monospaced-(``[code]``)-Tag funktioniert **nur**, wenn eine benutzerdefinierte Schriftart in das Theme-Overrides des RichTextLabel-Nodes eingestellt ist. Andernfalls wird für einzeiligen Text die normale Schriftart verwendet.
zh_tw: 等寬（``[code]``）標籤**僅**在 RichTextLabel 節點的主題覆蓋中設定自訂字形時才有效。否則，等寬文字將使用常規字形。

source: There are no BBCode tags to control vertical centering of text yet.
de: Es gibt noch keine BBCode-Tags zur Steuerung der vertikalen Zentrierung von Text.
zh_tw: 目前還沒有用於控制文字垂直居中的BBCode標籤.

source: Options can be skipped for all tags.
de: Die Optionen können für alle Tags übersprungen werden.
zh_tw: 可以跳過所有標籤的選項。

source: Paragraph options
de: Absatz-Optionen
zh_tw: 段落選項

source: `Values`
zh_tw: 值

source: `Default`
zh_tw: 預設

source: ``left``
zh_tw: ``length()``

source: Text horizontal alignment.
de: Horizontale Ausrichtung des Textes.
zh_tw: 文字水平對齊。

source: ``default``
zh_tw: 預設

source: Structured text override.
de: Überschreiben von strukturiertem Text.
zh_tw: 結構化文字覆蓋。

source: ``ltr``, ``rtl``, ``auto``
zh_tw: ``-h``, ``--help``, ``/?``

source: Inherit
de: Vererben
zh_tw: 繼承

source: Base BiDi direction.
de: Basis-BiDi-Richtung.
zh_tw: 沿指定方向移動。

source: ISO language codes. See :ref:`doc_locales`
de: ISO-Sprachcodes. Siehe :ref:`doc_locales`
zh_tw: **圖片:** 請參閱 :ref:`doc_import_images` 。

source: Handling ``[url]`` tag clicks
de: Umgang mit ``[url]``-Tag-Klicks
zh_tw: 處理 ``[url]`` 標籤點擊

source: By default, ``[url]`` tags do nothing when clicked. This is to allow flexible use of ``[url]`` tags rather than limiting them to opening URLs in a web browser.
de: Standardmäßig bewirken ``[url]``-Tags nichts, wenn sie angeklickt werden. Dies soll eine flexible Verwendung von ``[url]``-Tags ermöglichen, anstatt sie auf das Öffnen von URLs in einem Webbrowser zu beschränken.
zh_tw: 預設情況下， ``[url]`` 標籤在按一下時不執行任何操作.這是為了允許靈活使用 ``[url]`` 標籤，而不是限制它們在Web瀏覽器中打開URL.

source: To handle clicked ``[url]`` tags, connect the ``RichTextLabel`` node's :ref:`meta_clicked <class_RichTextLabel_signal_meta_clicked>` signal to a script function.
de: Um angeklickte ``[url]``-Tags zu behandeln, verbinden Sie das :ref:`meta_clicked <class_RichTextLabel_signal_meta_clicked>`-Signal des ``RichTextLabel``-Nodes mit einer Skriptfunktion.
zh_tw: 要對點擊``[url]`` 標籤進行處理，請將該 RichTextLabel 節點的 :ref:`meta_clicked <class_RichTextLabel_signal_meta_clicked>` 訊號連接到一個腳本函式上。

source: For example, the following method can be connected to ``meta_clicked`` to open clicked URLs using the user's default web browser::
de: Zum Beispiel kann die folgende Methode mit ``meta_clicked`` verbunden werden, um angeklickte URLs mit dem Default-Webbrowser des Benutzers zu öffnen::
zh_tw: 例如，將如下方法連接到 ``meta_clicked`` 上即可在使用者的預設網頁瀏覽器中打開被點擊的 URL： ::

source: For more advanced use cases, it's also possible to store JSON in an ``[url]`` tag's option and parse it in the function that handles the ``meta_clicked`` signal. For example:
de: Für fortgeschrittene Anwendungsfälle ist es auch möglich, JSON in der Option eines ``[url]``-Tags zu speichern und es in der Funktion zu analysieren, die das ``meta_clicked``-Signal verarbeitet. Zum Beispiel:
zh_tw: 要支援更高級的用法，也可以在 ``[url]`` 標籤的選項中儲存 JSON，然後在處理 ``meta_clicked`` 訊號的函式中解析。例如：

source: Image options
de: Bild-Optionen
zh_tw: 匯入選項

source: Color name or color in HEX format
de: Farbname oder Farbe im HEX-Format
zh_tw: 顏色名稱或十六進位格式的顏色

source: Color tint of the image (modulation).
de: Farbtönung des Bildes (Modulation).
zh_tw: 圖像的著色顏色（調變）。

source: Number in pixels
de: Anzahl in Pixeln
zh_tw: 數字

source: Target height of the image.
de: Zielhöhe des Bildes.
zh_tw: 檔案的絕對路徑

source: Target width of the image.
de: Zielbreite des Bildes.
zh_tw: 檔案的絕對路徑

source: **region**
zh_tw: **版本**

source: x,y,width,height in pixels
de: x, y, Breite, Höhe in Pixeln
zh_tw: x,y,寬度,高度（以像素為單位）

source: Region rect of the image. This can be used to display a single image from a spritesheet.
de: Bereichs-Rechteck des Bildes. Dies kann verwendet werden, um ein einzelnes Bild aus einem Spritesheet anzuzeigen.
zh_tw: 圖像的區域框。可用於顯示精靈表中的單個圖像。

source: Image vertical alignment
de: Vertikale Ausrichtung des Bildes
zh_tw: 變數與賦值

source: When a vertical alignment value is provided with the ``[img]`` tag the image will try to align itself against the surrounding text. Alignment is performed using a vertical point of the image and a vertical point of the text. There are 3 possible points on the image (``top``, ``center``, and ``bottom``) and 4 possible points on the text (``top``, ``center``, ``baseline``, and ``bottom``), which can be used in any combination.
de: Wenn ein Wert für die vertikale Ausrichtung mit dem ``[img]``-Tag angegeben wird, versucht das Bild, sich an dem umgebenden Text auszurichten. Die Ausrichtung erfolgt anhand eines vertikalen Punktes des Bildes und eines vertikalen Punktes des Textes. Es gibt 3 mögliche Punkte auf dem Bild (``top``, ``center`` und ``bottom``) und 4 mögliche Punkte auf dem Text (``top``, ``center``, ``baseline`` und ``bottom``), die in jeder Kombination verwendet werden können.
zh_tw: 當使用“[img]”標籤提供垂直對齊值時，圖像將嘗試將自身與周圍的文字對齊。使用影像的垂直點和文字的垂直點來執行對齊。圖像上有 3 個可能的點（「頂部」、「中心」和「底部」），文字上有 4 個可能的點（「頂部」、「中心」、「基線``和``底部``） ，可以任意組合使用。

source: To specify both points, use their full or short names as a value of the image tag:
de: Um beide Punkte anzugeben, verwenden Sie ihre vollständigen oder kurzen Namen als Wert des Bild-Tags:
zh_tw: 若要指定這兩個點，請使用它們的全名或簡稱作為圖像標籤的值：

source: You can also specify just one value (``top``, ``center``, or ``bottom``) to make use of a corresponding preset (``top-top``, ``center-center``, and ``bottom-bottom`` respectively).
de: Sie können auch nur einen Wert angeben (``top``, ``center`` oder ``bottom``), um eine entsprechende Vorgabe zu verwenden (``top-top``, ``center-center`` bzw. ``bottom-bottom``).
zh_tw: 您也可以只指定一個值（「top」、「center」或「bottom」）以使用對應的預設（「top-top」、「center-center」） ，和「底部-底部」分別）。

source: Short names for the values are ``t`` (``top``), ``c`` (``center``), ``l`` (``baseline``), and ``b`` (``bottom``).
de: Kurznamen für die Werte sind ``t`` (``top``), ``c`` (``center``), ``l`` (``baseline``) und ``b`` (``bottom``).
zh_tw: 值的簡稱為“t”（“top”）、“c”（“center”）、“l”（“baseline”）和“b” `（``底部``）。

source: Font options
de: Schriftart-Optionen
zh_tw: 匯入選項

source: A valid Font resource path.
de: Ein gültiger Schriftart-Ressourcenpfad.
zh_tw: 資源路徑

source: Font resource path.
de: Pfad der Schriftart-Ressourcen.
zh_tw: 資源路徑

source: Number in pixels.
de: Anzahl in Pixeln.
zh_tw: 數位，單位為像素。

source: Custom font size.
de: Benutzerdefinierte Schriftgröße.
zh_tw: 自定 Godot 伺服器

source: Named colors
de: Benannte Farben
zh_tw: 有名稱的型別

source: For tags that allow specifying a color by name you can use names of the constants from the built-in :ref:`class_Color` class. Named classes can be specified in a number of styles using different casings: ``DARK_RED``, ``DarkRed``, and ``darkred`` will give the same exact result.
de: Für Tags, die es erlauben, eine Farbe durch einen Namen zu spezifizieren, können Sie die Namen der Konstanten der Built-in-Klasse :ref:`class_Color` verwenden. Benannte Klassen können in einer Reihe von Stilen mit verschiedenen Schreibstilen angegeben werden: ``DARK_RED``, ``DarkRed`` und ``darkred`` ergeben genau das gleiche Ergebnis.
zh_tw: 對於允許按名稱指定顏色的標籤，您可以使用內建 class_Color 類別中的常數名稱。命名類別可以使用不同的大小寫以多種樣式指定：「DARK_RED」、「DarkRed」和「darkred」將給出相同的精確結果。

source: Hexadecimal color codes
de: Hexadezimale Farbcodes
zh_tw: 十六進位顏色程式碼

source: For opaque RGB colors, any valid 6-digit hexadecimal code is supported, e.g. ``[color=#ffffff]white[/color]``. Shorthand RGB color codes such as ``#6f2`` (equivalent to ``#66ff22``) are also supported.
de: Für undurchsichtige RGB-Farben wird jeder gültige 6-stellige Hexadezimalcode unterstützt, z.B. ``[color=#ffffff]white[/color]``. Kurzschrift-RGB-Farbcodes wie ``#6f2`` (entspricht ``#66ff22``) werden ebenfalls unterstützt.
zh_tw: 不透明的 RGB 顏色支援使用任何有效的 6 位十六進位數，例如 ``[color=#ffffff]白色[/color]``。也支援短的 RGB 顏色碼，比如 ``#6f2``（等價於 `#66ff22`）。

source: For transparent RGB colors, any RGBA 8-digit hexadecimal code can be used, e.g. ``[color=#ffffff88]translucent white[/color]``. Note that the alpha channel is the **last** component of the color code, not the first one. Short RGBA color codes such as ``#6f28`` (equivalent to ``#66ff2288``) are supported as well.
de: Für transparente RGB-Farben kann ein beliebiger 8-stelliger RGBA-Hexadezimalcode verwendet werden, z.B. ``[color=#ffffff88]durchsichtiges Weiß[/color]``. Beachten Sie, dass der Alphakanal die **letzte** Komponente des Farbcodes ist, nicht die erste. Kurze RGBA-Farbcodes wie ``#6f28`` (entspricht ``#66ff2288``) werden ebenfalls unterstützt.
zh_tw: 透明的 RGB 顏色可以使用任意 8 位十六進位數，例如 ``[color=#88ffffff]半透明白色[/color]``。請注意這裡的 alpha 通道是顏色碼中的**第一個**分量，不是最後一個。也支援短的 RGBA 顏色碼，比如 `#86f2`（等價於 `#8866ff22`）。

source: Cell options
de: Zellenoptionen
zh_tw: **通用選項**

source: **expand**
zh_tw: **會被解析為**

source: Integer number
de: Integer-Zahl
zh_tw: 整數

source: Cell expansion ratio. This defines which cells will try to expand to proportionally to other cells and their expansion ratios.
de: Verhältnis der Zellenexpansion. Damit wird festgelegt, welche Zellen versuchen werden, proportional zu anderen Zellen und deren Expansionsverhältnis zu expandieren.
zh_tw: 細胞膨脹率。這定義了哪些單元格將嘗試按比例擴充至其他單元格及其擴充比率。

source: Cell border color.
de: Farbe der Zellenränder.
zh_tw: 儲存格邊框顏色。

source: Cell background color. For alternating odd/even row backgrounds, you can use ``bg=odd_color,even_color``.
de: Hintergrundfarbe der Zelle. Für abwechselnde ungerade/gerade Zeilenhintergründe können Sie ``bg=odd_color,even_color`` verwenden.
zh_tw: 單元格背景顏色。對於交替奇數/偶數行背景，您可以使用``bg=odd_color,even_color``。

source: Unordered list bullet
de: Aufzählungszeichen für ungeordnete Listen
zh_tw: 或無序集合：

source: By default, the ``[ul]`` tag uses the ``U+2022`` "Bullet" Unicode glyph as the bullet character. This behavior is similar to web browsers. The bullet character can be customized using ``[ul bullet={bullet}]``. If provided, this ``{bullet}`` parameter must be a *single* character with no enclosing quotes (for example, ``[bullet=*]``). Additional characters are ignored. The bullet character's width does not affect the list's formatting.
de: Standardmäßig verwendet der ``[ul]``-Tag die Unicode-Glyphe ``U+2022`` "Bullet" als Aufzählungszeichen. Dieses Verhalten ist ähnlich wie bei Webbrowsern. Das Aufzählungszeichen kann mit ``[ul bullet={bullet}]`` angepasst werden. Falls angegeben, muss der Parameter ``{bullet}`` ein *einzelnes* Zeichen ohne einschließende Anführungszeichen sein (zum Beispiel ``[bullet=*]``). Zusätzliche Zeichen werden ignoriert. Die Breite des Aufzählungszeichens hat keinen Einfluss auf die Formatierung der Liste.
zh_tw: 預設情況下，「[ul]」標籤使用「U+2022」「Bullet」Unicode 字形作為專案符號字元。此行為類似於網頁瀏覽器。可以使用“[ulBullet={bullet}]”自訂專案符號字元。如果提供，此 ``{bullet}`` 參數必須是一個*單*字符，不帶引號（例如，``[bullet=*]``）。附加字元將被忽略。專案符號字元的寬度不會影響列表的格式。

source: See `Bullet (typography) on Wikipedia <https://en.wikipedia.org/wiki/Bullet_(typography)>`__ for a list of common bullet characters that you can paste directly in the ``bullet`` parameter.
de: Siehe `Aufzählungszeichen (Typografie) auf Wikipedia <https://en.wikipedia.org/wiki/Bullet_(typography)>`__ für eine Liste der üblichen Aufzählungszeichen, die Sie direkt in den Parameter ``Aufzählungszeichen`` einfügen können.
zh_tw: 請參閱維基百科上的「專案符號（排版）」<https://en.wikipedia.org/wiki/Bullet_(typography)>`__，取得可以直接貼上到「bullet」參數中的常見專案符號字元列表。

source: Ordered list types
de: Geordnete Listenarten
zh_tw: 宣告型別

source: Ordered lists can be used to automatically mark items with numbers or letters in ascending order. This tag supports the following type options:
de: Geordnete Listen können verwendet werden, um Elemente automatisch mit Zahlen oder Buchstaben in aufsteigender Reihenfolge zu markieren. Dieses Tag unterstützt die folgenden Typoptionen:
zh_tw: 有序列表可用於自動按升序以數字或字母標記專案。此標籤支援以下型別選項：

source: ``1`` - Numbers, using language specific numbering system if possible.
de: ``1`` - Zahlen, wenn möglich unter Verwendung eines sprachspezifischen Nummerierungssystems.
zh_tw: ``1`` - 數字，如果可能，使用特定於語言的編號系統。

source: ``a``, ``A`` - Lower and upper case Latin letters.
de: ``a``, ``A`` - Lateinische Klein- und Großbuchstaben.
zh_tw: ``a``, ``A`` - 小寫和大寫拉丁字母。

source: ``i``, ``I`` - Lower and upper case Roman numerals.
de: ``i``, ``I`` - Römische Ziffern in Klein- und Großbuchstaben.
zh_tw: ``i``, ``I`` - 小寫和大寫羅馬數字。

source: Text effects
de: Text-Effekte
zh_tw: 效果

source: BBCode can also be used to create different text effects that can optionally be animated. Five customizable effects are provided out of the box, and you can easily create your own. By default, animated effects will pause :ref:`when the SceneTree is paused <doc_pausing_games>`. You can change this behavior by adjusting the RichTextLabel's **Process > Mode** property.
de: BBCode kann auch verwendet werden, um verschiedene Texteffekte zu erstellen, die optional animiert werden können. Fünf anpassbare Effekte sind standardmäßig vorhanden, und Sie können leicht Ihre eigenen erstellen. Standardmäßig pausieren animierte Effekte :ref:`wenn der SceneTree angehalten wird <doc_pausing_games>`. Sie können dieses Verhalten ändern, indem Sie die Property **Prozess > Modus** des RichTextLabel anpassen.
zh_tw: BBCode 也可用於建立不同的文字效果，並且可以選擇動畫效果。開箱即用提供了五種可自訂的效果，您可以輕鬆建立自己的效果。預設情況下，當 SceneTree 暫停 <doc_pausing_games> 時，動畫效果將暫停:ref:`。您可以透過調整 RichTextLabel 的 **Process > Mode** 屬性來變更此行為。

source: All examples below mention the default values for options in the listed tag format.
de: In allen folgenden Beispielen werden die Default-Werte für Optionen im aufgeführten Tag-Format angegeben.
zh_tw: 下面的所有範例都提到了列出的標記格式中選項的預設值。

source: Text effects that move characters' position may result in characters being clipped by the RichTextLabel node bounds.
de: Texteffekte, von denen die Position der Zeichen verschoben werden, können dazu führen, dass die Zeichen von den Begrenzungen des RichTextLabel-Nodes abgeschnitten werden.
zh_tw: 移動字元位置的文字效果可能會導致字元被 RichTextLabel 節點邊界剪切。
