Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/bbcode_*_richtextlabel.po
Languages: de, zh_tw

source: You can resolve this by disabling **Control > Layout > Clip Contents** in the inspector after selecting the RichTextLabel node, or ensuring there is enough margin added around the text by using line breaks above and below the line using the effect.
de: Sie können dieses Problem lösen, indem Sie **Steuerung > Layout > Clip-Inhalt** im Inspektor deaktivieren, nachdem Sie den RichTextLabel-Node ausgewählt haben, oder indem Sie sicherstellen, dass um den Text herum genügend Seitenrand hinzugefügt wird, indem Sie Zeilenumbrüche oberhalb und unterhalb der Zeile verwenden, die den Effekt nutzen.
zh_tw: 您可以透過在選擇RichTextLabel 節點後在屬性面板中停用**控制> 佈局> 剪輯內容** 來解決此問題，或者透過使用該效果在行上方和下方使用換行符來確保在文字周圍新增足夠的邊距。

source: Pulse
de: Pulsieren
zh_tw: 脈衝

source: Wave
de: Welle
zh_tw: 波浪

source: Wave makes the text go up and down. Its tag format is ``[wave amp=50.0 freq=5.0 connected=1]{text}[/wave]``.
de: Welle lässt den Text auf und ab wandern. Sein Tag-Format ist ``[wave amp=50.0 freq=5.0 connected=1]{text}[/wave]``.
zh_tw: 波浪會使文字上下波動。其標籤格式是 ``[wave amp=50 freq=2][/wave]``。``amp`` 控制特效高低，``freq`` 控制文字上下移動的速度。

source: ``amp`` controls how high and low the effect goes, and ``freq`` controls how fast the text goes up and down. A ``freq`` value of ``0`` will result in no visible waves, and negative ``freq`` values won't display any waves either. If ``connected`` is ``1`` (default), glyphs with ligatures will be moved together. If ``connected`` is ``0``, each glyph is moved individually even if they are joined by ligatures. This can work around certain rendering issues with font ligatures.
de: ``amp`` bestimmt, wie hoch und tief der Effekt geht, und ``freq`` bestimmt, wie schnell sich der Text auf und ab bewegt. Ein ``freq`` Wert von ``0`` führt zu keinen sichtbaren Wellen, und negative ``freq`` Werte zeigen auch keine Wellen an. Ist ``connected`` gleich ``1`` (Default), werden Glyphen mit Ligaturen zusammengeschoben. Wenn ``connected`` den Wert ``0`` hat, wird jede Glyphe einzeln verschoben, auch wenn sie durch Ligaturen verbunden sind. Dies kann bestimmte Darstellungsprobleme bei Schriftarten mit Ligaturen umgehen.
zh_tw: 「amp」控制效果的高低，「freq」控製文字上升和下降的速度。 ``freq`` 值為``0`` 將導致沒有可見波，負``freq`` 值也不會顯示任何波。如果「connected」為「1」（預設），則帶有連字的字形將一起移動。如果“connected”為“0”，則每個字形都會單獨移動，即使它們是透過連字連接的。這可以解決字形連字的某些算繪問題。

source: Tornado
zh_tw: 旋風

source: Tornado makes the text move around in a circle. Its tag format is ``[tornado radius=10.0 freq=1.0 connected=1]{text}[/tornado]``.
de: Tornado lässt den Text in einem Kreis herumlaufen. Sein Tag-Format ist ``[tornado radius=10.0 freq=1.0 connected=1]{text}[/tornado]``.
zh_tw: 龍捲風使文字在圓圈內移動, 它的標籤格式是 ``[tornado radius=5 freq=2][/tornado]`` . ``radius`` 是控制偏移的圓半徑, ``freq`` 是文字在圓中移動的速度.

source: ``radius`` is the radius of the circle that controls the offset, ``freq`` is how fast the text moves in a circle. A ``freq`` value of ``0`` will pause the animation, while negative ``freq`` will play the animation backwards. If ``connected`` is ``1`` (default), glyphs with ligatures will be moved together. If ``connected`` is ``0``, each glyph is moved individually even if they are joined by ligatures. This can work around certain rendering issues with font ligatures.
de: ``radius`` ist der Radius des Kreises, der den Offset steuert, ``freq`` gibt an, wie schnell sich der Text im Kreis bewegt. Ein ``freq``-Wert von ``0`` hält die Animation an, während ein negativer ``freq`` die Animation rückwärts abspielt. Wenn ``connected`` den Wert ``1`` hat (Default), werden Glyphen mit Ligaturen zusammen bewegt. Wenn ``connected`` gleich ``0`` ist, wird jede Glyphe einzeln bewegt, auch wenn sie durch Ligaturen verbunden sind. Dies kann bestimmte Darstellungsprobleme bei Schriftarten mit Ligaturen umgehen.
zh_tw: 「radius」是控制偏移的圓的半徑，「freq」是文字在圓中移動的速度。 ``freq`` 值為``0`` 將暫停動畫，而負值``freq`` 將向後播放動畫。如果「connected」為「1」（預設），則帶有連字的字形將一起移動。如果“connected”為“0”，則每個字形都會單獨移動，即使它們是透過連字連接的。這可以解決字形連字的某些算繪問題。

source: Shake
de: Schütteln
zh_tw: 抖動

source: Shake makes the text shake. Its tag format is ``[shake rate=20.0 level=5 connected=1]{text}[/shake]``.
de: Schütteln lässt den Text wackeln. Sein Tag-Format ist ``[shake rate=20.0 level=5 connected=1]{text}[/shake]``.
zh_tw: 晃動使文字晃動。其標籤格式為「[搖動率=20.0等級=5連線=1]{文字}[/搖動]」。

source: ``rate`` controls how fast the text shakes, ``level`` controls how far the text is offset from the origin. If ``connected`` is ``1`` (default), glyphs with ligatures will be moved together. If ``connected`` is ``0``, each glyph is moved individually even if they are joined by ligatures. This can work around certain rendering issues with font ligatures.
de: ``rate`` bestimmt, wie schnell der Text wackelt, ``level`` bestimmt, wie weit der Text vom Ursprung entfernt ist. Ist ``connected`` gleich ``1`` (Default), werden Glyphen mit Ligaturen zusammen verschoben. Wenn ``connected`` den Wert ``0`` hat, wird jede Glyphe einzeln verschoben, auch wenn sie durch Ligaturen verbunden sind. Dies kann bestimmte Darstellungsprobleme bei Schriftarten mit Ligaturen umgehen.
zh_tw: 「rate」控製文字抖動的速度，「level」控製文字偏離原點的距離。如果「connected」為「1」（預設），則帶有連字的字形將一起移動。如果“connected”為“0”，則每個字形都會單獨移動，即使它們是透過連字連接的。這可以解決字形連字的某些算繪問題。

source: Fade
de: Fading
zh_tw: 漸隱

source: Fade creates a static fade effect that multiplies each character's opacity. Its tag format is ``[fade start=4 length=14]{text}[/fade]``.
de: Fading erzeugt einen statischen Fading-Effekt, der die Deckkraft jedes Zeichens vervielfacht. Sein Tag-Format ist ``[fade start=4 length=14]{text}[/fade]``.
zh_tw: 淡入淡出創造靜態淡入淡出效果，使每個角色的不透明度倍增。其標籤格式為``[fade start=4 length=14]{text}[/fade]``。

source: ``start`` controls the starting position of the falloff relative to where the fade command is inserted, ``length`` controls over how many characters should the fade out take place.
de: ``start`` steuert die Startposition des Fadings relativ zu der Stelle, wo der Fade-Befehl eingefügt wird, ``Länge`` steuert, über wie viele Zeichen das Fading erfolgen soll.
zh_tw: 漸變在沒有動畫的文字上建立一個漸變效果, 它的標籤格式是 ``[fade start=4 length=14][/fade]`` . ``start`` 控制相對於插值淡入命令的起始位置, ``length`` 控制淡出應該發生多少個字元.

source: Rainbow
de: Regenbogen
zh_tw: 彩虹

source: Rainbow gives the text a rainbow color that changes over time. Its tag format is ``[rainbow freq=1.0 sat=0.8 val=0.8]{text}[/rainbow]``.
de: Regenbogen verleiht dem Text eine Regenbogenfarbe, die sich mit der Zeit ändert. Sein Tag-Format ist ``[rainbow freq=1.0 sat=0.8 val=0.8]{text}[/rainbow]``.
zh_tw: 彩虹讓文字呈現出隨時間變化的彩虹色, 它的標籤格式是 ``[rainbow freq=0.2 sat=10 val=20][/rainbow]`` . ``freq`` 是每秒完整的彩虹週期數, ``sat`` 是彩虹的飽和度, ``val`` 是彩虹的數值.

source: ``freq`` is the number of full rainbow cycles per second, ``sat`` is the saturation of the rainbow, ``val`` is the value of the rainbow. A ``freq`` value of ``0`` will pause the animation, while negative ``freq`` will play the animation backwards.
de: ``freq`` ist die Anzahl der vollen Regenbogenzyklen pro Sekunde, ``sat`` ist die Sättigung des Regenbogens, ``val`` ist der Wert des Regenbogens. Ein ``freq``-Wert von ``0`` hält die Animation an, während ein negativer ``freq`` die Animation rückwärts abspielt.
zh_tw: 「freq」是每秒完整彩虹週期的數量，「sat」是彩虹的飽和度，「val」是彩虹的數值。 ``freq`` 值為``0`` 將暫停動畫，而負值``freq`` 將向後播放動畫。

source: Font outlines are *not* affected by the rainbow effect (they keep their original color). Existing font colors are overridden by the rainbow effect. However, CanvasItem's **Modulate** and **Self Modulate** properties will affect how the rainbow effect looks, as modulation multiplies its final colors.
de: Die Konturen der Schriftarten werden vom Regenbogeneffekt *nicht* beeinflusst (sie behalten ihre ursprüngliche Farbe). Vorhandene Schriftarten werden durch den Regenbogeneffekt außer Kraft gesetzt. Die Propertys **Modulieren** und **Selbstmodulieren** von CanvasItem beeinflussen jedoch das Aussehen des Regenbogeneffekts, da die Modulation die endgültigen Farben vervielfacht.
zh_tw: 字形輪廓「不受」彩虹效果的影響（它們保持原來的顏色）。現有的字形顏色被彩虹效果覆蓋。但是，CanvasItem 的 **Modulate** 和 **Self Modulate** 屬性將影響彩虹效果的外觀，因為調變會倍增其最終顏色。

source: Custom BBCode tags and text effects
de: Eigene BBCode-Tags und -Texteffekte
zh_tw: 自訂 BBCode 標籤和文字效果

source: You can extend the :ref:`class_RichTextEffect` resource type to create your own custom BBCode tags. Create a new script file that extends the :ref:`class_RichTextEffect` resource type and give the script a ``class_name`` so that the effect can be selected in the inspector. Add the ``@tool`` annotation to your GDScript file if you wish to have these custom effects run within the editor itself. The RichTextLabel does not need to have a script attached, nor does it need to be running in ``tool`` mode. The new effect can be registered in the Inspector by adding it to the **Markup > Custom Effects** array, or in code with the :ref:`install_effect() <class_RichTextLabel_method_install_effect>` method:
de: Sie können den Ressourcentyp :ref:`class_RichTextEffect` erweitern, um Ihre eigenen BBCode-Tags zu erstellen. Erstellen Sie eine neue Skriptdatei, die den Ressourcentyp :ref:`class_RichTextEffect` erweitert und geben Sie dem Skript einen ``class_name``, damit der Effekt im Inspektor ausgewählt werden kann. Fügen Sie die Annotation ``@tool`` zu Ihrer GDScript-Datei hinzu, wenn Sie diese benutzerdefinierten Effekte im Editor selbst laufen lassen wollen. Das RichTextLabel muss nicht mit einem Skript verbunden sein, noch muss es im ``tool``-Modus laufen. Der neue Effekt kann im Inspektor registriert werden, indem man ihn dem Array **Markup > Benutzerdefinierte Effekte** hinzufügt, oder im Code mit der Methode :ref:`install_effect() <class_RichTextLabel_method_install_effect>`:
zh_tw: 可以通過擴充 :ref:`class_RichTextEffect` 資源型別來建立自己的 BBCode 標籤。首先擴充 :ref:`class_RichTextEffect` 資源型別並為腳本提供 ``class_name``，這樣就能夠在屬性面板中選擇該效果。如果想在編輯器中運作這些自訂效果，請在 GDScript 檔中新增 ``@tool`` 注解。RichTextLabel 不需要附加腳本，也不需要在 ``tool`` 模式下運作。註冊效果的方法是將這個新建的效果在屬性面板中加入到 **Markup > Custom Effects** 陣列中，或者在程式碼中使用 :ref:`install_effect() <class_RichTextLabel_method_install_effect>` 方法：

source: Selecting a custom RichTextEffect after saving a script that extends RichTextEffect with a ``class_name``
de: Auswählen eines benutzerdefinierten RichTextEffects nach dem Speichern eines Skripts, das RichTextEffect mit einem ``class_name`` erweitert
zh_tw: 儲存使用「class_name」擴充 RichTextEffect 的腳本後選擇自訂 RichTextEffect

source: If the custom effect is not registered within the RichTextLabel's **Markup > Custom Effects** property, no effect will be visible and the original tag will be left as-is.
de: Wenn der benutzerdefinierte Effekt nicht in der Property **Markup > Benutzerdefinierte Effekte** des RichTextLabels registriert ist, ist kein Effekt sichtbar und der ursprüngliche Tag wird unverändert belassen.
zh_tw: 如果自訂效果沒有註冊到 RichTextLabel 的 **Custom Effects** 屬性中，就不會有可見的效果，保留原始的標籤。

source: There is only one function that you need to extend: ``_process_custom_fx(char_fx)``. Optionally, you can also provide a custom BBCode identifier simply by adding a member name ``bbcode``. The code will check the ``bbcode`` property automatically or will use the name of the file to determine what the BBCode tag should be.
de: Es gibt nur eine einzige Funktion, die Sie erweitern müssen: ``_process_custom_fx(char_fx)``. Optional können Sie auch einen benutzerdefinierten BBCode-Bezeichner bereitstellen, indem Sie einfach einen Membernamen ``bbcode`` hinzufügen. Der Code wird die Property ``bbcode`` automatisch überprüfen oder den Namen der Datei verwenden, um zu bestimmen, wie der BBCode-Tag lauten soll.
zh_tw: 只需要擴充一個函式: ``_process_custom_fx(char_fx)`` , 或者可以通過新增成員名稱 ``bbcode`` 來提供自訂BBCode識別字, 該程式碼將自動檢查bbcode屬性, 或使用檔案名來決定BBCode標籤應該是什麼.

source: This is where the logic of each effect takes place and is called once per glyph during the draw phase of text rendering. This passes in a :ref:`class_CharFXTransform` object, which holds a few variables to control how the associated glyph is rendered:
de: Hier findet die Logik jedes Effekts statt und wird einmal pro Glyphe während der Zeichenphase der Textdarstellung aufgerufen. Dabei wird ein :ref:`class_CharFXTransform`-Objekt übergeben, das einige Variablen enthält, die steuern, wie die zugehörige Glyphe gerendert wird:
zh_tw: 這是每個效果的邏輯生效的地方, 在文字算繪繪製階段, 每個字元被呼叫一次, 將傳入一個 :ref:`class_CharFXTransform` 物件, 該物件擁有一些變數來控制相關字元的算繪方式:

source: ``identity`` specifies which custom effect is being processed. You should use that for code flow control.
de: ``identity`` gibt an, welcher benutzerdefinierte Effekt verarbeitet wird. Sie sollten das für die Code-Flusskontrolle verwenden.
zh_tw: ``identity身份`` 指定正在處理哪個自訂效果, 應該用它來控制程式碼流程.

source: ``outline`` is ``true`` if effect is called for drawing text outline.
de: ``outline`` ist ``true`` , wenn der Effekt zum Zeichnen des Textumrisses aufgerufen wird.
zh_tw: 如果呼叫效果來繪製文字輪廓，則「outline」為「true」。

source: ``range`` tells you how far into a given custom effect block you are in as an index.
de: ``range`` sagt Ihnen, wie weit Sie sich als Index in einem gegebenen benutzerdefinierten Effektblock befinden.
zh_tw: ``relative_index`` 告訴你在一個給定的自訂效果區塊中的索引有多遠.

source: ``elapsed_time`` is the total amount of time the text effect has been running.
de: ``elapsed_time`` ist die Gesamtzeit, die der Texteffekt ausgeführt wurde.
zh_tw: ``elapsed_time`` 是文字效果運作的總時間.

source: ``visible`` will tell you whether the glyph is visible or not and will also allow you to hide a given portion of text.
de: Mit ``visible`` können Sie feststellen, ob die Glyphe sichtbar ist oder nicht, und Sie können einen bestimmten Teil des Textes ausblenden.
zh_tw: ``visible`` 將告訴你這個字元是否可見, 也允許你隱藏文字的某個部分.

source: ``offset`` is an offset position relative to where the given glyph should render under normal circumstances.
de: ``offset`` ist eine Offset-Position relativ zu der Stelle, an der die angegebene Glyphe unter normalen Umständen dargestellt werden sollte.
zh_tw: ``offset`` 是相對於給定字元在正常情況下應該呈現的位置的偏移位置.

source: ``color`` is the color of a given glyph.
de: ``color`` ist die Farbe einer bestimmten Glyphe.
zh_tw: ``color`` 是一種預先規定的字元顏色.

source: ``glyph_index`` and ``font`` is glyph being drawn and font data resource used to draw it.
de: ``glyph_index`` und ``font`` ist die Glyphe, die gezeichnet wird und die Schriftdaten-Ressource, die zum Zeichnen verwendet wird.
zh_tw: “glyph_index” 和 “font” 是正在繪製的字形和用於繪製它的字形資料資源。

source: Finally, ``env`` is a :ref:`class_Dictionary` of parameters assigned to a given custom effect. You can use :ref:`get() <class_Dictionary_method_get>` with an optional default value to retrieve each parameter, if specified by the user. For example ``[custom_fx spread=0.5 color=#FFFF00]test[/custom_fx]`` would have a float ``spread`` and Color ``color`` parameters in its ``env`` Dictionary. See below for more usage examples.
de: Schließlich ist ``env`` ein :ref:`class_Dictionary` mit Parametern, die einem bestimmten benutzerdefinierten Effekt zugeordnet sind. Sie können :ref:`get() <class_Dictionary_method_get>` mit einem optionalen Defaultwert verwenden, um jeden Parameter abzurufen, falls vom Benutzer angegeben. Zum Beispiel würde ``[custom_fx spread=0.5 color=#FFFF00]test[/custom_fx]`` einen float ``spread`` und Color ``color``-Parameter in seinem ``env``-Dictionary haben. Siehe unten für weitere Anwendungsbeispiele.
zh_tw: 最後, ``env`` 是一個指定自訂效果的參數 :ref:`class_Dictionary` . 如果使用者指定, 您可以使用 :ref:`Get()<CLASS_Dictionary_Method_Get>` 和可選預設值來檢索每個參數. 例如, ``[custom_fx spread=0.5 color=#FFFF00]test[/custom_fx]`` 在其 ``env`` 字典中將有一個浮動 ``spread`` 和顏色 ``color`` 參數. 有關更多的實例用法, 請參閱下面的內容.

source: The last thing to note about this function is that it is necessary to return a boolean ``true`` value to verify that the effect processed correctly. This way, if there's a problem with rendering a given glyph, it will back out of rendering custom effects entirely until the user fixes whatever error cropped up in their custom effect logic.
de: Der letzte Punkt, der bei dieser Funktion zu beachten ist: Ein boolescher ``true``-Wert muss zurückgegeben werden, um zu überprüfen, ob der Effekt korrekt verarbeitet wurde. Wenn es also ein Problem mit der Darstellung einer bestimmten Glyphe gibt, wird die Funktion die Darstellung von benutzerdefinierten Effekten komplett abbrechen, bis der Benutzer den Fehler in seiner benutzerdefinierten Effektlogik behoben hat.
zh_tw: 最後需要注意的關於此函式, 必須返回一個布林值 ``true`` , 以驗證結果處理正確, 這樣一來, 如果這個預先規定的字元算繪出現問題, 它將完全退出自訂算繪的效果, 直到使用者修復自訂算繪出現的任何錯誤.

source: Here are some examples of custom effects:
de: Hier sind einige Beispiele benutzedefinierter Effekte:
zh_tw: 以下是一些自訂效果的範例:

source: Ghost
de: Geist
zh_tw: 幽靈

source: Matrix
zh_tw: 矩陣

source: This will add a few new BBCode commands, which can be used like so:
de: Dadurch werden einige neue BBCode-Befehle hinzugefügt, die wie folgt verwendet werden können:
zh_tw: 這將增加一些新的BBCode命令, 可以像這樣使用:

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Makes ``{text}`` horizontally left-aligned.
de: Stellt ``{text}`` horizontal linksbündig dar.

source: Indents ``{text}`` once. The indentation width is the same as with ``[ul]`` or ``[ol]``, but without a bullet point.
de: Rückt ``{text}`` einmal ein. Die Einrückungsbreite ist die gleiche wie bei ``[ul]`` oder ``[ol]``, aber ohne Zeichen für punktierte Listen.

source: Overrides the language for ``{text}`` that is set by the **BiDi > Language** property in :ref:`class_RichTextLabel`. ``{code}`` must be an ISO :ref:`language code <doc_locales>`. This can be used to enforce the use of a specific script for a language without starting a new paragraph. Some font files may contain script-specific substitutes, in which case they will be used.
de: Überschreibt die Sprache für ``{text}``, die durch die **BiDi > Sprache**-Property in :ref:`class_RichTextLabel` festgelegt ist. ``{code}`` muss ein ISO :ref:`Sprachcode <doc_locales>` sein. Dies kann verwendet werden, um die Verwendung einer bestimmten Schrift für eine Sprache zu erzwingen, ohne einen neuen Absatz zu beginnen. Einige Schriftarten können skript-spezifische Ersetzungen enthalten, die dann verwendet werden.

source: Locale override. Some font files may contain script-specific substitutes, in which case they will be used.
de: Gebietsschema überschreiben. Einige Schriftarten können skriptspezifische Ersetzungen enthalten, die dann verwendet werden.

source: List of floating-point numbers, e.g. ``10.0,30.0``
de: Liste von Float-Zahlen, z.B. ``10.0,30.0``

source: Width of the space character in the font
de: Breite des Leerzeichens in der Schriftart

source: Overrides the horizontal offsets for each tab character. When the end of the list is reached, the tab stops will loop over. For example, if you set ``tab_stops`` to ``10.0,30.0``, the first tab will be at ``10`` pixels, the second tab will be at ``10 + 30 = 40`` pixels, and the third tab will be at ``10 + 30 + 10 = 50`` pixels from the origin of the RichTextLabel.
de: Überschreibt die horizontalen Offsets für jedes Tab-Zeichen. Wenn das Ende der Liste erreicht ist, werden die Tabstopps in einer Schleife durchlaufen. Wenn Sie zum Beispiel ``tab_stops`` auf ``10.0,30.0`` setzen, ist der erste Tab bei ``10`` Pixeln, der zweite Tab bei ``10 + 30 = 40`` Pixeln und der dritte Tab bei ``10 + 30 + 10 = 50`` Pixeln vom Ursprung des RichTextLabels.

source: Pulse creates an animated pulsing effect that multiplies each character's opacity and color. It can be used to bring attention to specific text. Its tag format is ``[pulse freq=1.0 color=#ffffff40 ease=-2.0]{text}[/pulse]``.
de: Pulsieren erzeugt einen animierten, pulsierenden Effekt, der die Deckkraft und Farbe jedes Zeichens vervielfacht. Er kann verwendet werden, um die Aufmerksamkeit auf einen bestimmten Text zu lenken. Sein Tag-Format ist ``[pulse freq=1.0 color=#ffffff40 ease=-2.0]{text}[/pulse]``.

source: ``freq`` controls the frequency of the half-pulsing cycle (higher is faster). A full pulsing cycle takes ``2 * (1.0 / freq)`` seconds. ``color`` is the target color multiplier for blinking. The default mostly fades out text, but not entirely. ``ease`` is the easing function exponent to use. Negative values provide in-out easing, which is why the default is ``-2.0``.
de: ``freq`` steuert die Frequenz des halben Pulszyklus (höher ist schneller). Ein voller Pulszyklus dauert ``2 * (1.0 / freq)`` Sekunden. ``color`` ist der Zielfarben-Multiplikator für das Blinken. Der Default lässt den Text meist per Fading verblassen, aber nicht vollständig. ``ease`` ist der Exponent der Easing-Funktion, der verwendet werden soll. Negative Werte sorgen für ein In-Out-Easing, deshalb ist der Default ``-2.0``.
