Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/custom_gui_controls.po
Languages: de, zh_tw

source: Custom GUI controls
de: Benutzerdefinierte GUI-Controls
zh_tw: 自訂 GUI 控制項

source: So many controls...
de: So viele Controls...
zh_tw: 控制項真多呀……

source: Yet there are never enough. Creating your own custom controls that act just the way you want them to is an obsession of almost every GUI programmer. Godot provides plenty of them, but they may not work exactly the way you want. Before contacting the developers with a pull-request to support diagonal scrollbars, at least it will be good to know how to create these controls easily from script.
de: Doch es gibt nie genug. Das Erstellen eigener benutzerdefinierter Steuerelemente, die genau so funktionieren, wie Sie es möchten, ist eine Leidenschaft fast aller GUI-Programmierer. Godot bietet viele davon, aber sie funktionieren möglicherweise nicht genau so, wie Sie es möchten. Bevor Sie sich mit einem Pull-Request an die Entwickler wenden, um diagonale Scrollbars zu unterstützen, sollten Sie zumindest wissen, wie Sie diese Controls einfach aus einem Skript heraus erstellen können.
zh_tw: 不過這是永遠不嫌多的。每個 GUI 程式師幾乎都癡迷於建立自己的自訂控制項，讓這些控制項讓自己的要求工作。Godot 提供了大量的控制項，但它們可能並不完全如您所願的方式工作。在使用支援對角捲軸的拉取請求與開發人員聯繫之前，至少應該瞭解如何從腳本輕鬆地建立這些控制項。

source: Drawing
de: Zeichnen
zh_tw: 繪製

source: For drawing, it is recommended to check the :ref:`doc_custom_drawing_in_2d` tutorial. The same applies. Some functions are worth mentioning due to their usefulness when drawing, so they will be detailed next:
de: Zum Zeichnen wird empfohlen, das :ref:`doc_custom_drawing_in_2d`-Tutorial zu lesen. Einige Funktionen sind aufgrund ihrer Nützlichkeit beim Zeichnen erwähnenswert, daher werden sie als nächstes detailliert beschrieben:
zh_tw: 談到繪製, 推薦看看這篇 :ref:`doc_custom_drawing_in_2d` 的教學. 同樣的原理適用與控制項繪製. 這裡有些函式值得一提, 因為它們在繪製時有用, 所以接下來將進行詳細說明:

source: Checking control size
de: Prüfen der Control-Größe
zh_tw: 檢查控制項的大小

source: Unlike 2D nodes, "size" is important with controls, as it helps to organize them in proper layouts. For this, the :ref:`Control.size <class_Control_property_size>` property is provided. Checking it during ``_draw()`` is vital to ensure everything is kept in-bounds.
de: Im Gegensatz zu 2D-Nodes ist die "Größe" bei Controls wichtig, da sie hilft, sie in geeigneten Layouts zu organisieren. Hierfür gibt es die Property :ref:`Control.size <class_Control_property_size>`. Die Überprüfung dieser Property während ``_draw()`` ist wichtig, um sicherzustellen, dass alle Grenzen eingehalten werden.
zh_tw: 與2D節點不同,"size" 對控制項很重要, 因為它有助於在適當的佈局中組織它們. 為此, 我們提供了 :ref:`Control.rect_size <class_Control_property_rect_size>` 屬性. 在 ``_draw()`` 中檢查它以確保所有東西都在範圍之內.

source: Checking focus
de: Prüfen des Fokus
zh_tw: 檢查輸入焦點

source: Some controls (such as buttons or text editors) might provide input focus for keyboard or joypad input. Examples of this are entering text or pressing a button. This is controlled with the :ref:`Control.focus_mode <class_Control_property_focus_mode>` property. When drawing, and if the control supports input focus, it is always desired to show some sort of indicator (highlight, box, etc.) to indicate that this is the currently focused control. To check for this status, the :ref:`Control.has_focus() <class_Control_method_has_focus>` method exists. Example
de: Einige Controls (z.B. Buttons oder Texteditoren) bieten möglicherweise einen Eingabefokus für die Tastatur- oder Joypad-Eingabe. Beispiele hierfür sind die Eingabe von Text oder das Drücken einer Taste. Dies wird mit der Property :ref:`Control.focus_mode <class_Control_property_focus_mode>` gesteuert. Beim Zeichnen (wenn das Control Eingabefokus unterstützt) ist es immer wünschenswert eine Art Indikator (Hervorhebung, Box, usw.) anzuzeigen, um das aktuell fokussierte Control zu erkennen. Um diesen Status zu überprüfen, ist die Methode :ref:`Control.has_focus() <class_Control_method_has_focus>` vorhanden. Beispiel
zh_tw: 一些控制項(如按鈕或文字編輯器)可為鍵盤或手柄輸入提供輸入焦點. 這方面的例子是輸入文字或按下一個按鈕. 這可以通過 :ref:`Control.focus_mode <class_Control_property_focus_mode>` 屬性來控制. 繪製時, 如果控制項支援輸入焦點, 總是希望顯示某種指示來表明(高亮, 方框等), 目前這是焦點控制項. 為了檢查這個狀態, 存在一個 :ref:`Control.has_focus() <class_Control_method_has_focus>` 的方法. 例子

source: Sizing
de: Größenanpassung
zh_tw: 調整大小

source: As mentioned before, size is important to controls. This allows them to lay out properly, when set into grids, containers, or anchored. Controls, most of the time, provide a *minimum size* to help properly lay them out. For example, if controls are placed vertically on top of each other using a :ref:`VBoxContainer <class_VBoxContainer>`, the minimum size will make sure your custom control is not squished by the other controls in the container.
de: Wie bereits erwähnt, ist die Größe für Controls wichtig. Dadurch können sie richtig angeordnet werden, wenn sie in Rastern, Containern organisiert oder verankert sind. Controls bieten in der Regel eine *Mindestgröße*, damit sie richtig angeordnet werden können. Wenn Controls zum Beispiel mit einem :ref:`VBoxContainer <class_VBoxContainer>` vertikal übereinander platziert werden, sorgt die Mindestgröße dafür, dass Ihr benutzerdefiniertes Control nicht von den anderen Controls im Container gequetscht wird.
zh_tw: 如前所述, 尺寸對控制項是很重要的. 這可以讓它們在設定網格, 容器或錨定時以正確佈局. 控制項, 在大多數情況下, 提供了一個 *minimum size* , 以幫助它們正確佈局. 例如, 如果控制項被垂直放置在彼此的頂部, 使用 :ref:`VBoxContainer <class_VBoxContainer>` , 最小尺寸將確保你的自訂控制項不會被容器中的其他控制項擠壓.

source: To provide this callback, just override :ref:`Control._get_minimum_size() <class_Control_private_method__get_minimum_size>`, for example:
de: Um diesen Callback bereitzustellen, überschreiben Sie einfach :ref:`Control._get_minimum_size() <class_Control_private_method__get_minimum_size>`, zum Beispiel:

source: Alternatively, set it using a function:
de: Alternativ können Sie es mit einer Funktion einstellen:
zh_tw: 或者, 使用函式進行設定:

source: Input
de: Eingabe
zh_tw: 輸入

source: Controls provide a few helpers to make managing input events much easier than regular nodes.
de: Controls bieten einige Hilfsmittel, um die Verwaltung von Eingabeereignissen viel einfacher zu gestalten als bei normalen Nodes.
zh_tw: 控制項為輸入事件的管理提供了一些輔助工具，比普通節點要方便一點。

source: Input events
de: Eingabe-Events
zh_tw: 輸入事件

source: There are a few tutorials about input before this one, but it's worth mentioning that controls have a special input method that only works when:
de: Es gibt ein paar Tutorials über die Eingabe vor diesem, aber es ist erwähnenswert, dass Controls eine spezielle Eingabemethode haben, die nur funktioniert, wenn:
zh_tw: 在此之前有幾個關於輸入的教學, 但值得一提的是, 控制項有一個特殊的輸入方法, 只有在以下情況下才起作用:

source: The mouse pointer is over the control.
de: Der Mauszeiger sich über dem Control befindet.
zh_tw: 滑鼠指標懸停在控制項上.

source: The button was pressed over this control (control always captures input until button is released)
de: Der Button über diesem Control gedrückt wurde (die Steuerung erfasst immer die Eingabe, bis der Button losgelassen wird)
zh_tw: 滑鼠按鍵在此控制項上被按下 (控制項始終捕獲輸入, 直到按鈕被釋放)

source: Control provides keyboard/joypad focus via :ref:`Control.focus_mode <class_Control_property_focus_mode>`.
de: Das Control stellt den Tastatur/Joypad-Fokus über :ref:`Control.focus_mode <class_Control_property_focus_mode>` zur Verfügung.
zh_tw: 控制項通過以下方式提供鍵盤和手柄焦點 :ref:`Control.focus_mode <class_Control_property_focus_mode>`.

source: This function is :ref:`Control._gui_input() <class_Control_private_method__gui_input>`. Simply override it in your control. No processing needs to be set.
de: Diese Funktion ist :ref:`Control._gui_input() <class_Control_private_method__gui_input>`. Überschreiben Sie sie einfach in Ihrem Control. Es muss keine Prozessierung eingestellt werden.

source: For more information about events themselves, check the :ref:`doc_inputevent` tutorial.
de: Für weitere Informationen über Events, siehe das :ref:`doc_inputevent`-Tutorial.
zh_tw: 有關事件本身的詳細資訊，請查看 :ref:`doc_inputevent` 教學。

source: Notifications
de: Benachrichtigungen
zh_tw: 通知

source: Controls also have many useful notifications for which no dedicated callback exists, but which can be checked with the _notification callback:
de: Controls haben auch viele nützliche Benachrichtigungen, für die es keinen eigenen Callback gibt, die aber mit dem _notification-Callback überprüft werden können:
zh_tw: 控制項也有許多有用的通知, 這些通知不存在專門的回呼函式, 但可以用_notification回呼函式來檢查:

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
