Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_skinning.po
Languages: de, zh_tw

source: Introduction to GUI skinning
de: Einführung in GUI-Skinning
zh_tw: 序言

source: It is essential for a game to provide clear, informative, and yet visually pleasing user interface to its players. While :ref:`Control <class_Control>` nodes come with a decently functional look out of the box, there is always room for uniqueness and case-specific tuning. For this purpose Godot engine includes a system for GUI skinning (or theming), which allows you to customize the look of every control in your user interface, including your custom controls.
de: Für ein Spiel ist es wichtig, seinen Spielern eine klare, informative und dennoch optisch ansprechende Benutzeroberfläche zu bieten. Während :ref:`Control <class_Control>`-Nodes von Haus aus mit einem anständig funktionalen Aussehen ausgestattet sind, gibt es immer Raum für Einzigartigkeit und fallspezifisches Tuning. Zu diesem Zweck enthält die Godot-Engine ein System für das GUI-Skinning (oder Theming), mit dem Sie das Aussehen jedes Controls in Ihrer Benutzeroberfläche, einschließlich Ihrer benutzerdefinierten Controls, anpassen können.
zh_tw: 遊戲必須為其玩家提供清晰、資訊豐富且視覺上令人愉悅的使用者介面。雖然 :ref:`Control <class_Control>` 節點具有開箱即用的功能外觀，但始終有獨功能和特定於案例的調整空間。為此，Godot 引擎包括一個用於 GUI 換膚（或主題化）的系統，它允許您自訂使用者介面中每個控制項的外觀，包括您的自訂控制項。

source: Here is an example of this system in action — a game with the GUI that is radically different from the default UI theme of the engine:
de: Hier ist ein Beispiel für dieses System in Aktion - ein Spiel mit einer grafischen Benutzeroberfläche, die sich radikal vom Standard-UI-Theme der Engine unterscheidet:
zh_tw: 下面是這個系統的一個例子—— 一個遊戲的 GUI 與引擎的預設 UI 主題完全不同：

source: A "Gear Up!" screen in Tank Kings, courtesy of Winterpixel Games
de: Ein "Ausrüsten!"-Bildschirm in Tank Kings, mit freundlicher Genehmigung von Winterpixel Games
zh_tw: 《坦克王》中的“裝備起來！”介面，由 Winterpixel Games 提供

source: Beyond achieving a unique look for your game, this system also enables developers to provide customization options to the end users, including accessibility settings. UI themes are applied in a cascading manner (i.e. they propagate from parent controls to their children), which means that font settings or adjustments for colorblind users can be applied in a single place and affect the entire UI tree. Of course this system can also be used for gameplay purposes: your hero-based game can change its style for the selected player character, or you can give different flavors to the sides in your team-based project.
de: Mit diesem System können Sie nicht nur ein einzigartiges Aussehen für Ihr Spiel erzielen, sondern auch Anpassungsoptionen für die Endbenutzer bereitstellen, einschließlich Einstellungen für die Barrierefreiheit. UI-Themen werden kaskadierend angewendet (d. h. sie werden von Parent-Controls auf ihre Child-Controls übertragen), was bedeutet, dass Schrifteinstellungen oder Anpassungen für farbenblinde Benutzer an einer einzigen Stelle vorgenommen werden können und den gesamten UI-Baum betreffen. Natürlich kann dieses System auch für Gameplay-Zwecke verwendet werden: Ihr heldenbasiertes Spiel kann seinen Stil für den ausgewählten Spielercharakter ändern, oder Sie können den Seiten in Ihrem teambasierten Projekt verschiedene Geschmacksrichtungen geben.
zh_tw: 除了為您的遊戲實作獨特的外觀外，該系統還使開發人員能夠為最終使用者提供自訂選項，包括互動設定。 UI 主題以級聯方式應用（即從父控制項傳播到其子控制項），這意味著色盲使用者的字形設定或調整，可以在從某處應用並影響整個 UI 樹。當然，這個系統也可以用於遊戲：基於英雄的遊戲可以為選定的玩家角色改變其風格，或者您可以為基於團隊的專案中的雙方賦予不同的風格。

source: Basics of themes
de: Theme-Grundlagen
zh_tw: 主題基礎知識

source: The skinning system is driven by the :ref:`Theme <class_Theme>` resource. Every Godot project has an inherent default theme that contains the settings used by the built-in control nodes. This is what gives the controls their distinct look out of the box. A theme only describes the configuration, however, and it is still the job of each individual control to use that configuration in the way it requires to display itself. This is important to remember when implementing :ref:`your own custom controls <doc_custom_gui_controls>`.
de: Das Skinning-System wird durch die Ressource :ref:`Theme <class_Theme>` gesteuert. Jedes Godot-Projekt hat ein vorgegebenes Default-Theme, das die von den eingebauten Control-Nodes verwendeten Einstellungen enthält. Dadurch erhalten die Controls ihr unverwechselbares Aussehen. Ein Theme beschreibt jedoch nur die Konfiguration, und es ist immer noch die Aufgabe jedes einzelnen Controls, diese Konfiguration so zu verwenden, wie es für seine Darstellung erforderlich ist. Dies ist wichtig zu bedenken, wenn Sie :ref:`Ihre eigenen benutzerdefinierten Controls <doc_custom_gui_controls>` implementieren.
zh_tw: 皮膚系統由 :ref:`Theme <class_Theme>` 資源驅動。每個 Godot 專案都有一個固有的預設主題，其中包含內建控制節點使用的設定。這就是使控制項具有開箱即用的獨特外觀的原因。然而，主題僅用於描述配置，並且每個單獨控制項的工作仍然是按照顯示自身所需的方式使用該配置。在實作 :ref:`你自己的自訂控制項 <doc_custom_gui_controls>`時要記住這一點很重要。

source: Even the Godot editor itself relies on the default theme. But it doesn't look the same as a Godot project, because it applies its own heavily customized theme on top of the default one. In principle, this works exactly like it would in your game as explained :ref:`below <doc_gui_theme_in_project>`.
de: Sogar der Godot-Editor selbst basiert auf dem Default-Theme. Aber er sieht nicht so aus wie ein Godot-Projekt, weil er sein eigenes, stark angepasstes Theme auf das Default-Theme anwendet. Im Prinzip funktioniert das genau so wie in Ihrem Spiel, wie :ref:`hier <doc_gui_theme_in_project>` erklärt.
zh_tw: 甚至 Godot 編輯器本身也依賴於預設主題。但它看起來與 Godot 專案不同，因為它在預設主題之上應用了自己高度定制的主題。原則上，這與在您的遊戲中的工作方式完全相同，:ref:`如下所述 <doc_gui_theme_in_project>`。

source: Theme items
de: Theme-Elemente
zh_tw: 主題

source: The configuration that is stored in a theme consists of theme items. Each item has a unique name and must be one of the following data types:
de: Die Konfiguration, die in einem Theme gespeichert wird, besteht aus Theme-Elementen. Jedes Element hat einen eindeutigen Namen und muss einem der folgenden Datentypen entsprechen:
zh_tw: 儲存在一個主題中的配置由主題專案組成。每個專案都有一個唯一的名稱，並且必須是以下資料型別之一：

source: **Color**
zh_tw: **編輯器:**

source: A :ref:`color <class_Color>` value, which is often used for fonts and backgrounds. Colors can also be used for modulation of controls and icons.
de: Ein :ref:`Color <class_Color>`-Wert, der oft für Schriftarten und Hintergründe verwendet wird. Farben können auch für die Anpassung von Controls und Icons verwendet werden.
zh_tw: :ref:`color <class_Color>` 值，通常用於字形和背景。顏色也可用於控制項和圖示的調變。

source: **Constant**
de: **Konstante**
zh_tw: 常數

source: An integer value, which can be used either for numeric properties of controls (such as the item separation in a :ref:`BoxContainer <class_BoxContainer>`), or for boolean flags (such as the drawing of relationship lines in a :ref:`Tree <class_Tree>`).
de: Ein Integer-Wert, der entweder für numerische Propertys von Controls (z. B. den Elementabstand in einem :ref:`BoxContainer <class_BoxContainer>`) oder für boolesche Flags (z.B. das Zeichnen von Beziehungslinien in einem :ref:`Tree <class_Tree>`) verwendet werden kann.
zh_tw: 整型值，可用於控制項的數位型別屬性（例如 :ref:`BoxContainer <class_BoxContainer>` 的間隙設定）或布林值標記（例如 :ref:`Tree <class_Tree>` 中是否繪製關係線條）。

source: **Font**
zh_tw: **霧：**

source: A :ref:`font <class_Font>` resource, which is used by controls that display text. Fonts contain most text rendering settings, except for its size and color. On top of that, alignment and text direction are controlled by individual controls.
de: Eine :ref:`Font <class_Font>`-Ressource, die von Controls verwendet wird, die Text anzeigen. Schriftarten enthalten die meisten Einstellungen für die Textdarstellung, mit Ausnahme von Größe und Farbe. Darüber hinaus werden Ausrichtung und Textrichtung von einzelnen Controls gesteuert.
zh_tw: 一個字形資源（:ref:`font <class_Font>`），常常被用於顯示控制項中的文字。字形包含了許多算繪設定，像字形的大小和顏色。之後呢，用另一個單獨的控制項來控制對齊屬性和文字方向。

source: **Font size**
de: **-Schriftgröße**
zh_tw: **霧：**

source: An integer value, which is used alongside a font to determine the size at which the text should be displayed.
de: Ein Integer-Wert, der zusammen mit einer Schriftart verwendet wird, um die Größe zu bestimmen, in der ein Text angezeigt werden soll.
zh_tw: 一個整數值，與字形一起使用以確定文字的顯示大小。

source: **Icon**
zh_tw: **版本**

source: A :ref:`texture <class_Texture2D>` resource, which is normally used to display an icon (on a :ref:`Button <class_Button>`, for example).
de: Eine :ref:`Textur <class_Texture2D>`-Ressource, die normalerweise verwendet wird, um ein Icon darzustellen (zum Beispiel auf einem :ref:`Button <class_Button>`).
zh_tw: 一個材質資源（:ref:`texture <class_Texture>`），通常用於顯示一個圖示或者圖片（例如在按鈕中 :ref:`Button <class_Button>`）。

source: **StyleBox**
zh_tw: **樣式**

source: A :ref:`StyleBox <class_StyleBox>` resource, a collection of configuration options which define the way a UI panel should be displayed. This is not limited to the :ref:`Panel <class_Panel>` control, as styleboxes are used by many controls for their backgrounds and overlays.
de: Eine :ref:`StyleBox <class_StyleBox>`-Ressource, eine Sammlung von Konfigurationsoptionen, die festlegen, wie ein UI-Panel angezeigt werden soll. Dies ist nicht auf das :ref:`Panel <class_Panel>`-Contol beschränkt, da Styleboxen von vielen Controls für ihre Hintergründe und Overlays verwendet werden.
zh_tw: 一個樣式盒資源（:ref:`StyleBox <class_StyleBox>`），是一個用來定義一個UI面板怎樣展示的配置項集合。不只是用於面板控制項（:ref:`Panel <class_Panel>`），它還常常用於許多控制項的背景設定和遮罩設定。

source: Theme types
de: Theme-Typen
zh_tw: 有名稱的型別

source: To help with the organization of its items each theme is separated into types, and each item must belong to a single type. In other words, each theme item is defined by its name, its data type and its theme type. This combination must be unique within the theme. For example, there cannot be two color items named ``font_color`` in a type called ``Label``, but there can be another ``font_color`` item in a type ``LineEdit``.
de: Um die Organisation der Elemente zu erleichtern, ist jedes Theme in Typen unterteilt, und jedes Element muss zu einem einzigen Typ gehören. Mit anderen Worten: Jedes Theme wird durch seinen Namen, seinen Datentyp und seinen Theme-Typ definiert. Diese Kombination muss innerhalb des Themes eindeutig sein. Zum Beispiel kann es nicht zwei Farbelemente mit dem Namen ``font_color`` in einem Typ namens ``Label`` geben, aber es kann ein weiteres ``font_color``-Element in einem Typ ``LineEdit`` geben.
zh_tw: 用來説明組織分配這些專案中每個主題該屬於哪些型別，並且每個專案只能屬於單個型別。也就是說，用命名來定義每個主題專案，它是資料型別也是它的主題型別。這些組合體中的主題必須是唯一的。例如，``Label`` 型別中不能有 2 個叫做 ``font_color`` 的顏色專案，但是在另一個 ``LineEdit`` 中可以出現 ``font_color`` 專案。

source: The default Godot theme comes with multiple theme types already defined, one for every built-in control node that uses UI skinning. The example above contains actual theme items present in the default theme. You can refer to the **Theme Properties** section in the class reference for each control to see which items are available to it and its child classes.
de: Das Default-Godot-Theme enthält mehrere bereits definierte Theme-Typen, einen für jeden eingebauten Control-Node, der UI-Skinning verwendet. Das obige Beispiel enthält tatsächliche Theme-Elemente, die im Default-Theme vorhanden sind. Sie können im Abschnitt **Theme-Propertys** in der Klassenreferenz für jedes Control nachsehen, welche Elemente für dieses und seine Child-Klassen verfügbar sind.
zh_tw: Godot 的預設主題誕生之初就已經定義了眾多的主題型別，它內建於每個使用了 UI 皮膚的控制項節點中。在預設主題裡上述例子都是目前再用的主題專案。你可以在每個控制項的類參考手冊中查看**主題屬性**區域看看哪些專案是父類和子類別都可用的。

source: Child classes can use theme items defined for their parent class (``Button`` and its derivatives being a good example of that). In fact, every control can use every theme item of any theme type, if it needs to (but for the clarity and predictability we try to avoid that in the engine).
de: Child-Klassen können Theme-Elemente verwenden, die für ihre Parent-Klasse definiert sind (``Button`` und seine Derivate sind ein gutes Beispiel dafür). Tatsächlich kann jedes Control bei Bedarf jedes Theme-Element eines beliebigen Theme-Typs verwenden (aber aus Gründen der Übersichtlichkeit und Vorhersehbarkeit versuchen wir, dies in der Engine zu vermeiden).
zh_tw: 子類別可以使用為其父類定義的主題項， ``Button`` 及其衍生型別就是很好實例。事實上，如果需要的話，每個控制項都可以使用任何主題型別的單個主題項，但為了清晰可控，在引擎中儘量避免這樣做。

source: It is important to remember that for child classes that process is automated. Whenever a built-in control requests a theme item from the theme it can omit the theme type, and its class name will be used instead. On top of that, the class names of its parent classes will also be used in turn. This allows changes to the parent class, such as ``Button``, to affect all derived classes without the need to customize every one of them.
de: Es ist wichtig, sich daran zu erinnern, dass dieser Prozess für Child-Klassen automatisiert ist. Wann immer ein Built-in-Control ein Theme-Element aus dem Theme anfordert, kann es den Theme-Typ weglassen, und stattdessen wird sein Klassenname verwendet. Darüber hinaus werden auch die Klassennamen der Parent-Klassen verwendet. Dies ermöglicht es, dass Änderungen an der Parent-Klasse, wie z.B. ``Button``, sich auf alle abgeleiteten Klassen auswirken, ohne daß jede einzelne von ihnen angepasst werden muss.
zh_tw: 牢記子類別中，哪些過程是自動執行的很重要.不論什麼時候內建控制項在主題裡面請求主題專案時，我們可以忽略主題型別僅通過它的類別名稱知悉。之後呢，下次時我們能根據它的父級類別名稱來使用.可以通過改變父級類，例如 ``Button``，來影響所有衍生類，而不是調整每一個類來實作。

source: You can also define your own theme types, and additionally customize both built-in controls and your own controls. Because built-in controls have no knowledge of your custom theme types, you must utilize scripts to access those items. All control nodes have several methods that allow to fetch theme items from the theme that is applied to them. Those methods accept the theme type as one of the arguments.
de: Sie können auch Ihre eigenen Theme-Typen definieren und zusätzlich sowohl die Built-in-Controls als auch Ihre eigenen Controls anpassen. Da die Built-in-Controls keine Kenntnis von Ihren benutzerdefinierten Theme-Typen haben, müssen Sie Skripte verwenden, um auf diese Elemente zuzugreifen. Alle Control-Nodes verfügen über mehrere Methoden, die es ermöglichen, Theme-Elemente aus dem auf sie angewendeten Theme zu holen. Diese Methoden akzeptieren den Theme-Typ als eines der Argumente.
zh_tw: 你當然可以定義你自己的主題型別,並且此外你還可以自訂所有內建控制項和自建控制項.因為內建控制項不會有你自訂主題的內容，所以你必須使用腳本把它們加入到這些專案中.所有控制項節點都有一系列的方法可以用來把目前應用主題的主題專案都例遍出來.這些方法通常是把主題型別做為一個可輸入參數.

source: To give more customization opportunities types can also be linked together as type variations. This is another use-case for custom theme types. For example, a theme can contain a type ``Header`` which can be marked as a variation of the base ``Label`` type. An individual ``Label`` control can then be set to use the ``Header`` variation for its type, and every time a theme item is requested from a theme this variation will be used before any other type. This allows to store various presets of theme items for the same class of the control node in the single ``Theme`` resource.
de: Um mehr Anpassungsmöglichkeiten zu bieten, können Typen auch als Typvariationen miteinander verknüpft werden. Dies ist ein weiterer Anwendungsfall für benutzerdefinierte Theme-Typen. Zum Beispiel kann ein Theme einen Typ ``Header`` enthalten, der als eine Variation des Basistyps ``Label`` markiert werden kann. Ein individuelles ``Label``-Control kann dann so eingestellt werden, daß es die ``Header``-Variation für seinen Typ verwendet, und jedesmal, wenn ein Theme-Element von einem Theme angefordert wird, wird diese Variation vor jedem anderen Typ verwendet. Dies erlaubt es, verschiedene Vorgaben von Theme-Elementen für die gleiche Klasse des Control-Nodes in einer einzigen ``Theme``-Ressource zu speichern.
zh_tw: 為了提供更多的自訂可能性，型別還能夠連結在一起成為變種。這是自訂主題型別的另一種使用場景。例如，主題可以包含 ``Header`` 型別，標記為基礎 ``Label`` 型別的變種。那麼各個 ``Label`` 控制項就可以將其型別設為使用 ``Header`` 變種，主題請求主題專案的時候，這個變種都會先於其他型別使用。這樣就可以在同一個 ``Theme`` 資源裡為同樣使用某個類的控制項節點保存不同主題專案的預設值。

source: Only variations available from the default theme or defined in the custom project theme are shown in the Inspector dock as options. You can still input manually the name of a variation that is defined outside of those two places, but it is recommended to keep all variations to the project theme.
de: Nur Variationen, die im Default-Theme verfügbar oder im benutzerdefinierten Projektthema definiert sind, werden im Inspektor-Dock als Optionen angezeigt. Sie können den Namen einer Variation, die außerhalb dieser beiden Orte definiert ist, immer noch manuell eingeben, aber es wird empfohlen, alle Variationen im Projekt-Theme zu halten.
zh_tw: 只有預設主題或者自訂專案主題中的變種才會在“屬性面板”中列為可選項。在這兩處之外定義的變種名稱仍然可以手動輸入，但是建議把所有變種都放到專案主題裡面。

source: You can learn more about creating and using theme type variations in a :ref:`dedicated article <doc_gui_theme_type_variations>`.
de: Sie können mehr über die Erstellung und Verwendung von Theme-Typ-Variationen in einem :ref:`eigenen Artikel <doc_gui_theme_type_variations>` erfahren.
zh_tw: 你可以通過:ref:`專門的文章 <doc_gui_theme_type_variations>`瞭解到更多關於主題型別變種的建立和使用的內容。

source: Customizing a control
de: Benutzerdefiniertes Anpassen eines Controls
zh_tw: 自訂控制項

source: Each control node can be customized directly without the use of themes. This is called local overrides. Every theme property from the control's class reference can be overridden directly on the control itself, using either the Inspector dock, or scripts. This allows to make granular changes to a particular part of the UI, while not affecting anything else in the project, including this control's children.
de: Jeder Control-Node kann direkt ohne die Verwendung von Themes angepasst werden. Dies wird als lokale Überschreibungen bezeichnet. Jede Theme-Property aus der Klassenreferenz des Controls kann direkt auf dem Control selbst überschrieben werden, entweder über das Inspektor-Dock oder über Skripte. Dies ermöglicht es, granulare Änderungen an einem bestimmten Teil der Benutzeroberfläche vorzunehmen, ohne dass sich dies auf andere Teile des Projekts auswirkt, einschließlich der Child-Nodes dieses Controls.
zh_tw: 可以不用主題直接對各個控制項節點進行自訂。這種方式稱為本地重載。控制項的類參考手冊中列出的每個主題屬性，無論是通過屬性面板面板還是腳本，都可以在該控制項上直接重載。這樣就可以針對 UI 中的特定部份進行精細的修改，不影響專案中包括該控制項子類別在內的其他內容。

source: Local overrides are less useful for the visual flair of your user interface, especially if you aim for consistency. However, for layout nodes these are essential. Nodes such as :ref:`BoxContainer <class_BoxContainer>` and :ref:`GridContainer <class_GridContainer>` use theme constants for defining separation between their children, and :ref:`MarginContainer <class_MarginContainer>` stores its customizable margins in its theme items.
de: Lokale Überschreibungen sind weniger nützlich für das visuelle Flair Ihrer Benutzeroberfläche, insbesondere wenn Sie auf Konsistenz achten. Für Layout-Nodes sind sie jedoch unerlässlich. Nodes wie :ref:`BoxContainer <class_BoxContainer>` und :ref:`GridContainer <class_GridContainer>` verwenden Theme-Konstanten zur Definition der Trennung zwischen ihren Child-Nodes, und :ref:`MarginContainer <class_MarginContainer>` speichert seine anpassbaren Seitenränder in seinen Theme-Elementen.
zh_tw: 本地重載對於提升使用者介面的美觀程度意義不大，如果你注重一致性的話就更是如此。然而，本地重載對於佈局節點而言是不可或缺的。:ref:`BoxContainer <class_BoxContainer>` 和 :ref:`GridContainer <class_GridContainer>` 等節點通過主題常數定義其子節點的間隙大小，:ref:`MarginContainer <class_MarginContainer>` 用主題專案來保存自訂邊距。

source: Whenever a control has a local theme item override, this is the value that it uses. Values provided by the theme are ignored.
de: Wenn ein Control ein lokales Theme-Element überschreibt, wird dieser Wert verwendet. Vom Theme bereitgestellte Werte werden ignoriert.
zh_tw: 控制項存在本地主題專案重載時，會直接使用這個值，主題中所提供的值會被忽略。

source: Customizing a project
de: Benutzerdefiniertes Anpassen eines Projekts
zh_tw: 建立專案

source: Out of the box each project adopts the default project theme provided by Godot. The default theme itself is constant and cannot be changed, but its items can be overridden with a custom theme. Custom themes can be applied in two ways: as a project setting, and as a node property throughout the tree of control nodes.
de: Jedes Projekt nimmt standardmäßig das von Godot bereitgestellte Projekt-Theme an. Das Default-Theme selbst ist fest und kann nicht geändert werden, aber seine Elemente können mit einem benutzerdefinierten Theme überschrieben werden. Benutzerdefinierte Themes können auf zwei Arten angewendet werden: Als Projekteinstellung und als Node-Property im gesamten Baum der Control-Nodes.
zh_tw: 所有全新專案使用的都是 Godot 提供的預設專案主題。預設主題本身是常數，無法修改，但可以通過自訂主題進行覆蓋。設定自訂主題有兩種方法：修改專案設定，或者修改場景樹控制項節點的節點屬性。

source: There are two project settings that can be adjusted to affect your entire project: :ref:`gui/theme/custom<class_ProjectSettings_property_gui/theme/custom>` allows you to set a custom project-wide theme, and :ref:`gui/theme/custom_font<class_ProjectSettings_property_gui/theme/custom_font>` does the same to the default fallback font. When a theme item is requested by a control node the custom project theme, if present, is checked first. Only if it doesn't have the item the default theme is checked.
de: Es gibt zwei Projekteinstellungen, die so angepasst werden können, dass sie das gesamte Projekt betreffen: :ref:`gui/theme/custom<class_ProjectSettings_property_gui/theme/custom>` ermöglicht es Ihnen, ein benutzerdefiniertes projektweites Theme festzulegen, und :ref:`gui/theme/custom_font<class_ProjectSettings_property_gui/theme/custom_font>` macht dasselbe mit der Default-Fallback-Schriftart. Wird ein Theme-Element von einem Control-Node angefordert, so wird das benutzerdefinierte Projekt-Theme, falls vorhanden, zuerst geprüft. Nur wenn das Element nicht vorhanden ist, wird das Default-Theme geprüft.
zh_tw: 目前有2個計畫設定適用於你的整個計畫專案 ::ref:`gui/theme/custom<class_ProjectSettings_property_gui/theme/custom>` 允許你設定一種自訂計畫專案寬屏主題，並且 :ref:`gui/theme/custom_font<class_ProjectSettings_property_gui/theme/custom_font>` 的功能和預設的字形是一樣的。當一個自訂主題的控制項節點使用一個主題專案時，如果專案存在它將被當先選中。只有當它不存在專案時，預設主題將被選中。

source: This allows you to configure the default look of every Godot control with a single theme resource, but you can go more granular than that. Every control node also has a :ref:`theme <class_Control_property_theme>` property, which allows you to set a custom theme for the branch of nodes starting with that control. This means that the control and all of its children, and their children in turn, would first check that custom theme resource before falling back on the project and the default themes.
de: Auf diese Weise können Sie die Default-Darstellung jedes Godot-Controls mit einer einzigen Theme-Ressource konfigurieren, aber Sie können detaillierter vorgehen. Jeder Control-Node verfügt außerdem über eine :ref:`Theme <class_Control_property_theme>`-Property, mit der Sie ein benutzerdefiniertes Theme für den Zweig von Nodes festlegen können, der mit diesem Control beginnt. Dies bedeutet, dass das Control und alle seine Child-Elemente und deren Child-Elemente zuerst diese benutzerdefinierte Theme-Ressource überprüfen, bevor sie auf das Projekt und die Default-Themes zurückgreifen.
zh_tw: 在一個單獨的主題資源中，你可以設定所有 Godot 控制項的預設樣式與外觀,但是你可以做更多的細節調整.每一個控制項節點同樣擁有一個:ref:`主題 <class_Control_property_theme>`屬性，通過這個屬性你可以為一個控制項的所有節點分支設定一個自訂的主題.那意味著那個控制項與其所有的子類別，和子類別的子類別，在回滾目前專案和預設主題之前自訂主題的資源將第一個被檢查。
