Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: de, zh_tw

source: Hinting controls how aggressively glyph edges should be snapped to pixels when rasterizing the font. **None** results in the smoothest appearance, which can make the font look blurry at small sizes. **Light** (default) is sharper by snapping glyph edges to pixels on the Y axis only, while **Full** is even sharper by snapping glyph edges to pixels on both X and Y axes. Depending on personal preference, you may prefer using one hinting mode over the other.
de: Hinting steuert, wie aggressiv die Glyphenkanten beim Rastern der Schriftart an Pixeln einrasten sollen. **Keine** ergibt das glatteste Erscheinungsbild, was die Schriftart bei kleinen Größen unscharf erscheinen lassen kann. **Leicht** (Default) ist schärfer, da die Glyphenkanten nur auf der Y-Achse an Pixeln ausgerichtet werden, während **Voll** noch schärfer ist, da die Glyphenkanten sowohl auf der X- als auch auf der Y-Achse an Pixeln ausgerichtet werden. Je nach persönlicher Vorliebe kann es sein, dass Sie einen der beiden Hinting-Modi dem anderen vorziehen.
zh_tw: 提示控制在光柵化字形時應如何積極地將字形邊緣捕捉到像素。 **無** 會產生最平滑的外觀，這會使字形在小尺寸下看起來模糊。 **淺色**（預設）透過僅將字形邊緣捕捉到Y 軸上的像素來變得更加清晰，而**全** 透過將字形邊緣捕捉到X 軸和Y 軸上的像素來更加清晰。根據個人喜好，您可能更喜歡使用一種提示模式而不是另一種。

source: Font hinting comparison
de: Vergleich Schriftart-Hinting
zh_tw: 視覺比較

source: From top to bottom: None, Light, Full hinting
de: Von oben nach unten: Keine, Leichtes, Volles Hinting
zh_tw: 由上至下：無、淺色、完整提示

source: If changing the hinting mode has no visible effect after clicking **Reimport**, it's usually because the font doesn't include hinting instructions. This can be resolved by looking for a version of the font file that includes hinting instructions, or enabling **Force Autohinter** in the Import dock. This will use `FreeType <https://freetype.org/>`__'s autohinter to automatically add hinting instructions to the imported font.
de: Wenn die Änderung des Hinting-Modus nach dem Klicken auf **Neu importieren** keine sichtbaren Auswirkungen hat, liegt das in der Regel daran, dass die Schriftart keine Hinting-Anweisungen enthält. Dies kann behoben werden, indem Sie nach einer Version der Schriftart suchen, die Hinting-Anweisungen enthält, oder indem Sie **Autohinting erzwingen** im Import-Dock aktivieren. Dadurch wird das Autohinting von `FreeType <https://freetype.org/>`__ verwendet, um automatisch Hinting-Anweisungen in die importierte Schriftart einzufügen.
zh_tw: 如果點選「重新匯入」後變更提示模式沒有明顯效果，通常是因為字型不包含提示指令。可以透過尋找包含提示指令的字型檔案版本或在匯入塢中啟用 **強制自動提示** 來解決此問題。這將使用 `FreeType <https://freetype.org/>`__ 的自動提示器自動為匯入的字型新增提示指令。

source: Subpixel positioning
de: Subpixel-Positionierung
zh_tw: 次像素定位

source: Subpixel positioning can be adjusted. This is a `FreeType <https://freetype.org/>`__ feature that allows glyphs to be rendered more closely to their intended form. The default setting of **Auto** automatically enables subpixel positioning at small sizes, but disables it at large font sizes to improve rasterization performance.
de: Die Subpixel-Positionierung kann angepasst werden. Dies ist eine Funktion von `FreeType <https://freetype.org/>`__, die es ermöglicht, Glyphen näher an ihrer beabsichtigten Form zu rendern. Mit der Default-Einstellung **Auto** wird die Subpixel-Positionierung bei kleinen Schriftarten automatisch aktiviert, bei großen Schriftarten jedoch deaktiviert, um die Rasterungs-Performance zu verbessern.
zh_tw: 子像素定位可以調整。這是一個 `FreeType <https://freetype.org/>`__ 功能，允許字形算繪得更接近其預期形式。預設設定「自動」會在小尺寸下自動啟用子像素定位，但在大字形尺寸下停用子像素定位，以提高光柵化效能。

source: You can force the subpixel positioning mode to **Disabled**, **One half of a pixel** or **One quarter of a pixel**. **One quarter of a pixel** provides the best quality, at the cost of longer rasterization times.
de: Sie können den Subpixel-Positionierungsmodus auf **Deaktiviert**, **Halbes Pixel** oder **Viertel-Pixel** einstellen. **Ein Viertel-Pixel** bietet die beste Qualität, allerdings auf Kosten längerer Rasterungszeiten.
zh_tw: 您可以將子像素定位模式強制設定為**停用**、**二分之一像素**或**四分之一像素**。 **四分之一像素**可提供最佳質量，但代價是光柵化時間較長。

source: Changing antialiasing, hinting and subpixel positioning has the most visible effect at smaller font sizes.
de: Die Änderung von Antialiasing, Hinting und Subpixel-Positionierung wirkt sich am deutlichsten bei kleineren Schriftarten aus.
zh_tw: 更改抗鋸齒、提示和子像素定位在較小的字形大小下具有最明顯的效果。

source: Fonts that have a pixel art appearance should have their subpixel positioning mode set to **Disabled**. Otherwise, the font may appear to have uneven pixel sizes.
de: Bei Pixel-Art-Schriftarten sollte der Subpixel-Positionierungsmodus auf **Deaktiviert** eingestellt sein. Andernfalls kann es vorkommen, dass die Schriftart ungleichmäßige Pixelgrößen aufweist.
zh_tw: 具有像素藝術外觀的字形應將其子像素定位模式設為**禁用**。否則，字形的像素大小可能會顯得不均勻。

source: This step is not required for bitmap fonts, as subpixel positioning is only relevant for dynamic fonts (which are usually made of vector elements).
de: Dieser Schritt ist für Bitmap-Schriftarten nicht erforderlich, da die Subpixelpositionierung nur für dynamische Schriftarten (die in der Regel aus Vektorelementen bestehen) relevant ist.
zh_tw: 點陣字形不需要此步驟，因為子像素定位僅與動態字形（通常由向量元素組成）相關。

source: By default, fonts do not have mipmaps generated to reduce memory usage and speed up rasterization. However, this can cause downscaled fonts to become grainy. This can be especially noticeable with :ref:`doc_3d_text` that doesn't have **Fixed Size** enabled. This can also occur when displaying text with a traditional rasterized (non-:ref:`MSDF <doc_using_fonts_msdf>`) font in a Control node that has its scale lower than ``(1, 1)``.
de: Standardmäßig werden bei Schriftarten keine Mipmaps erzeugt, um den Speicherbedarf zu verringern und die Rasterung zu beschleunigen. Dies kann jedoch dazu führen, dass herunterskalierte Schriftarten körnig werden. Dies kann besonders bei :ref:`doc_3d_text` auffallen, bei dem **Feste Größe** nicht aktiviert ist. Dies kann auch auftreten, wenn Text mit einer traditionell gerasterten (nicht :ref:`MSDF <doc_using_fonts_msdf>`) Schriftart in einem Control-Node angezeigt wird, dessen Skala kleiner als ``(1, 1)`` ist.
zh_tw: 預設情況下，字形不會產生 mipmap，以減少記憶體使用並加快光柵化速度。但是，這可能會導致縮小後的字形變得有顆粒感。對於未啟用 **固定大小** 的 :ref:`doc_3d_text`，這一點尤其明顯。當在比例低於「(1, 1)」的控制節點中使用傳統光柵化（非 :ref:`MSDF <doc_using_fonts_msdf>`）字形顯示文字時，也會發生這種情況。

source: After selecting a font in the FileSystem dock, you can enable the **Mipmaps** in the Import dock to improve downscaled font rendering appearance.
de: Nachdem Sie eine Schriftart im Dateisystem-Dock ausgewählt haben, können Sie die **Mipmaps** im Import-Dock aktivieren, um die Darstellung von herunterskalierten Schriftarten zu verbessern.
zh_tw: 在檔案系統擴充座中選擇字形後，您可以在匯入擴充座中啟用 **Mipmaps** 以改善縮小字形的算繪外觀。

source: Mipmaps can be enabled on MSDF fonts as well. This can improve font rendering quality a little at smaller-than-default sizes, but MSDF fonts are already resistant to graininess out of the box.
de: Mipmaps können auch für MSDF Schriftarten aktiviert werden. Dies kann die Qualität der Schriftart bei kleineren als den Default-Größen ein wenig verbessern, aber MSDF-Schriftarten sind bereits von Haus aus resistent gegen Körnigkeit.

source: MSDF font rendering
de: MSDF-Schriftart-Rendering
zh_tw: MSDF 字形算繪

source: Multi-channel signed distance field (MSDF) font rendering allows rendering fonts at any size, without having to re-rasterize them when their size changes.
de: Das Rendering Multi-Channel Signed Distance Field (MSDF)-Schriftart-Rendering ermöglicht das Rendern von Schriftarten in beliebiger Größe, ohne dass sie bei Größenänderungen neu gerastert werden müssen.
zh_tw: 多通道帶符號距離場（Multi-channel signed distance field，MSDF）字形算繪能夠將字形算繪為任意大小，無需在大小發生變化時重新柵格化。

source: MSDF font rendering has 2 upsides over traditional font rasterization, which Godot uses by default:
de: Das MSDF-Rendern von Schriftarten hat zwei Vorteile gegenüber der herkömmlichen Rasterung von Schriftarten, die Godot standardmäßig verwendet:
zh_tw: 與 Godot 預設使用的傳統字形柵格化相比，MSDF 字形算繪有兩個優點：

source: The font will always look crisp, even at huge sizes.
de: Die Schriftart sieht auch bei großen Größen immer klar und deutlich aus.
zh_tw: 即便文字非常巨大，字形看上去也總是清晰的。

source: There is less stuttering when rendering characters *at large font sizes* for the first time, as there is no rasterization performed.
de: Beim erstmaligen Rendern von Zeichen *bei großen Schriftarten* kommt es zu weniger Stutter-Effekten, da keine Rasterung durchgeführt wird.
zh_tw: 首次算繪*大字型大小字形*的字元時卡頓更短，因為無須執行柵格化。

source: The downsides of MSDF font rendering are:
de: Die Nachteile des MSDF-Schriftart-Rendering sind:
zh_tw: MSDF 字形算繪的缺點有：

source: Higher baseline cost for font rendering. This is usually not noticeable on desktop platforms, but it can have an impact on low-end mobile devices.
de: Höhere Basiskosten für das Rendern von Schriftarten. Auf Desktop-Plattformen macht sich dies in der Regel nicht bemerkbar, kann sich aber auf Low-End-Mobilgeräten bemerkbar machen.
zh_tw: 字形算繪的基礎開銷較高。桌面平臺上通常無法察覺，但是會影響低端移動裝置。

source: Fonts at small sizes will not look as clear as rasterized fonts, due to the lack of hinting.
de: Schriftarten in kleinen Größen sehen aufgrund des fehlenden Hintings nicht so klar aus wie gerasterte Schriftarten.
zh_tw: 由於缺少微調，較小的字形沒有柵格化字形清晰。

source: Rendering new glyphs for the first time *at small font sizes* may be more expensive compared to traditional rasterized fonts. :ref:`doc_using_fonts_font_prerendering` can be used to alleviate this.
de: Das erstmalige Rendern neuer Glyphen *bei kleinen Schriftgrößen* kann im Vergleich zu traditionellen gerasterten Schriftarten teurer sein. :ref:`doc_using_fonts_font_prerendering` kann verwendet werden, um dieses Problem zu lindern.
zh_tw: 與傳統的柵格化字形相比，首次為新字形算繪*小字型大小字形*的開銷可能更大。可以使用 :ref:`doc_using_fonts_font_prerendering` 緩解。

source: LCD subpixel optimization cannot be enabled for MSDF fonts.
de: Die LCD-Subpixel-Optimierung kann für MSDF-Schriftarten nicht aktiviert werden.
zh_tw: 無法為 MSDF 字形啟用 LCD 次像素優化。

source: Fonts with self-intersecting outlines will not render correctly in MSDF mode. If you notice rendering issues on fonts downloaded from websites such as `Google Fonts <https://fonts.google.com>`__, try downloading the font from the font author's official website instead.
de: Schriftarten mit sich selbst überschneidenden Umrissen werden im MSDF-Modus nicht korrekt wiedergegeben. Wenn Sie Rendering-Probleme bei Schriftarten feststellen, die Sie von Websites wie `Google Fonts <https://fonts.google.com>`__ heruntergeladen haben, versuchen Sie stattdessen, die Schriftart von der offiziellen Website des Schriftart-Autors herunterzuladen.
zh_tw: MSDF 模式下無法正確算繪輪廓自相交的字形。如果使用從 `Google Fonts <https://fonts.google.com>`__ 等處下載到的字形時出現算繪問題，請嘗試改為從作者的官方網站下載。

source: Comparison of font rasterization methods
de: Vergleich von Methoden zur Rasterung von Schriftarten

source: Comparison of font rasterization methods. From top to bottom: rasterized without oversampling, rasterized with oversampling, MSDF
de: Vergleich der Methoden zur Rasterung von Schriftarten. Von oben nach unten: gerastert ohne Oversampling, gerastert mit Oversampling, MSDF

source: To enable MSDF rendering for a given font, select it in the FileSystem dock, go to the Import dock, enable **Multichannel Signed Distance Field**, then click **Reimport**:
de: Um das MSDF-Rendering für eine bestimmte Schriftart zu aktivieren, wählen Sie sie im Dateisystem-Dock aus, wechseln Sie zum Import-Dock, aktivieren Sie **Multichannel Signed Distance Field** und klicken Sie dann auf **Neu importieren**:

source: Enabling MSDF in the font's import options
de: Aktivieren von MSDF in den Importoptionen der Schriftart

source: Using emoji
de: Emojis verwenden
zh_tw: 使用空白字元

source: Godot has limited support for emoji fonts:
de: Godot verfügt über eine begrenzte Unterstützung für Emoji-Schriftarten:
zh_tw: Godot 對 Emoji 字形的支援有限：

source: CBDT/CBLC (embedded PNGs) and SVG emoji fonts are supported.
de: CBDT/CBLC (eingebettete PNGs) und SVG-Emoji-Schriftarten werden unterstützt.
zh_tw: 支援 CBDT/CBLC（內嵌 PNG）和 SVG Emoji 字形。

source: COLR/CPAL emoji fonts (custom vector format) are **not** supported.
de: COLR/CPAL-Emoji-Schriftarten (benutzerdefiniertes Vektorformat) werden **nicht** unterstützt.
zh_tw: **不支援** COLR/CPAL Emoji 字形（自訂向量格式）。

source: EMJC bitmap image compression (used by iOS' system emoji font) is **not** supported. This means that to support emoji on iOS, you must use a custom font that uses SVG or PNG bitmap compression instead.
de: Die EMJC-Bitmap-Bildkomprimierung (die von der iOS-System-Emoji-Schriftart verwendet wird) wird **nicht** unterstützt. Das bedeutet, dass Sie zur Unterstützung von Emoji unter iOS eine benutzerdefinierte Schriftart verwenden müssen, die stattdessen SVG- oder PNG-Bitmap-Komprimierung verwendet.
zh_tw: **不支援** EMJC 點陣圖壓縮（iOS 系統 Emoji 字形需要用到）。這意味著如果要在 iOS 上支援 Emoji，你就必須改用自訂的使用 SVG 或 PNG 點陣圖壓縮的字形。

source: For Godot to be able to display emoji, the font used (or one of its :ref:`fallbacks <doc_using_fonts_font_fallbacks>`) needs to include them. Otherwise, emoji won't be displayed and placeholder "tofu" characters will appear instead:
de: Damit Godot Emojis anzeigen kann, muss die verwendete Schriftart (oder eine ihrer :ref:`Fallbacks <doc_using_fonts_font_fallbacks>`) diese enthalten. Andernfalls werden Emojis nicht angezeigt und stattdessen erscheinen "Tofu"-Zeichen als Platzhalter:
zh_tw: 為了讓 Godot 能夠顯示表情符號，所使用的字形（或其:ref:`後備字形之一 <doc_using_fonts_font_fallbacks>`）需要包含它們。否則，表情符號將不會顯示，而是會出現佔位符「豆腐」字元：

source: Default appearance when trying to use emoji in a label
de: Default Aussehen bei der Verwendung von Emoji in einem Label
zh_tw: 嘗試在標籤中使用 Emoji 的預設外觀

source: After adding a font to display emoji such as `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, you get the expected result:
de: Nach dem Hinzufügen einer Schriftart zur Darstellung von Emojis, wie z. B. `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, erhalten Sie das erwartete Ergebnis:
zh_tw: 新增字形來顯示表情符號（例如「Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__」）後，您將獲得預期結果：

source: Correct appearance after adding an emoji font to the label
de: Korrektes Aussehen nach Hinzufügen einer Emoji-Schriftart zum Label
zh_tw: 為標籤新增 Emoji 字形後的正確外觀

source: To use a regular font alongside emoji, it's recommended to specify a :ref:`fallback font <doc_using_fonts_font_fallbacks>` that points to the emoji font in the regular font's advanced import options. If you wish to use the default project font while displaying emoji, leave the **Base Font** property in FontVariation empty while adding a font fallback pointing to the emoji font:
de: Um eine reguläre Schriftart zusammen mit Emojis zu verwenden, empfiehlt es sich, in den erweiterten Importoptionen der regulären Schriftart eine :ref:`Fallback-Schriftart <doc_using_fonts_font_fallbacks>` anzugeben, die auf die Emoji-Schriftart verweist. Wenn Sie bei der Anzeige von Emojis die Default-Projektschriftart verwenden möchten, lassen Sie die Property **Base Font** in FontVariation leer und fügen Sie eine Schriftart als Fallback hinzu, die auf die Emoji-Schriftart verweist:
zh_tw: 若要在表情符號旁使用常規字形，建議在常規字形的進階匯入選項中指定指向表情符號字形的:ref:`後備字形 <doc_using_fonts_font_fallbacks>`。如果您希望在顯示表情符號時使用預設專案字形，請將 FontVariation 中的 **Base Font** 屬性保留為空，同時新增指向表情符號字形的後備字形：

source: Emoji fonts are quite large in size, so you may want to :ref:`load a system font <doc_using_fonts_system_fonts>` to provide emoji glyphs rather than bundling it with your project. This allows providing full emoji support in your project without increasing the size of its exported PCK. The downside is that emoji will look different depending on the platform, and loading system fonts is not supported on all platforms.
de: Emoji-Schriftarten sind ziemlich groß, daher sollten Sie :ref:`eine Systemschriftart <doc_using_fonts_system_fonts>` laden, um Emoji-Glyphen bereitzustellen, anstatt sie mit Ihrem Projekt zu bündeln. Dies ermöglicht eine vollständige Unterstützung von Emoji in Ihrem Projekt, ohne die Größe des exportierten PCKs zu erhöhen. Der Nachteil ist, dass Emojis je nach Plattform unterschiedlich aussehen, und das Laden von Systemschriftarten wird nicht auf allen Plattformen unterstützt.
zh_tw: 表情符號字形非常大，因此您可能需要載入:ref:`系統字形 <doc_using_fonts_system_fonts>` 來提供表情符號字形，而不是將其與您的專案捆綁在一起。這允許在您的專案中提供完整的表情符號支援，而無需增加其匯出的 PCK 的大小。缺點是表情符號會根據平台的不同看起來有所不同，並且並非所有平台都支援載入系統字形。

source: It's possible to use a system font as a fallback font too.
de: Es ist auch möglich, eine Systemschriftart als Fallbackschriftart zu verwenden.
zh_tw: 也可以使用系統字體作為後備字體。

source: Using icon fonts
de: Verwendung von Schriftarten für Symbole
zh_tw: 2 個檢視區

source: Tools like `Fontello <https://fontello.com/>`__ can be used to generate font files containing vectors imported from SVG files. This can be used to render custom vector elements as part of your text, or to create extruded 3D icons with :ref:`doc_3d_text` and TextMesh.
de: Tools wie `Fontello <https://fontello.com/>`__ können verwendet werden, um Schriftarten zu erzeugen, die aus SVG-Dateien importierte Vektoren enthalten. Dies kann verwendet werden, um benutzerdefinierte Vektorelemente als Teil Ihres Textes zu rendern, oder um extrudierte 3D-Symbole mit :ref:`doc_3d_text` und TextMesh zu erstellen.
zh_tw: `Fontello <https://fontello.com/>`__ 等工具可用於產生包含從 SVG 檔案匯入的向量的字型檔案。這可用於將自訂向量元素算繪為文字的一部分，或使用 doc_3d_text 和 TextMesh 建立擠壓 3D 圖示。

source: Fontello currently does not support creating multicolored fonts (which Godot can render). As of November 2022, support for multicolored fonts in icon font generation tools remains scarce.
de: Fontello unterstützt derzeit nicht die Erstellung mehrfarbiger Schriftarten (die von Godot wiedergegeben werden können). Ab November 2022 wird die Unterstützung für mehrfarbige Schriftarten in Tools zur Erzeugung von Icon-Schriftarten nur noch spärlich vorhanden sein.
zh_tw: Fontello 目前不支援建立多色字形（Godot 可以算繪）。截至 2022 年 11 月，圖標字形產生工具對彩色字形的支援仍然很少。

source: Depending on your use cases, this may lead to better results compared to using the ``img`` tag in :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. Unlike bitmap images (including SVGs which are rasterized on import by Godot), true vector data can be resized to any size without losing quality.
de: Je nach Anwendungsfall kann dies zu besseren Ergebnissen führen als die Verwendung des ``img``-Tags in :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. Im Gegensatz zu Bitmap-Bildern (einschließlich SVGs, die beim Import durch Godot gerastert werden), können echte Vektordaten ohne Qualitätsverlust auf jede beliebige Größe gebracht werden.
zh_tw: 根據您的用例，與在 :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>` 中使用 ``img`` 標籤相比，這可能會帶來更好的結果。與點陣圖影像（包括由 Godot 匯入時光柵化的 SVG）不同，真正的向量資料可以調整為任意大小，而不會損失品質。

source: After downloading the generated font file, load it in your Godot project then specify it as a custom font for a Label, RichTextLabel or Label3D node. Switch over to the Fontello web interface, then copy the character by selecting it then pressing :kbd:`Ctrl + C` (:kbd:`Cmd + C` on macOS). Paste the character in the **Text** property of your Label node. The character will appear as a placeholder glyph in the inspector, but it should appear correctly in the 2D/3D viewport.
de: Nachdem Sie die generierte Schriftart-Datei heruntergeladen haben, laden Sie sie in Ihr Godot-Projekt und geben Sie sie als benutzerdefinierte Schriftart für einen Label-, RichTextLabel- oder Label3D-Node an. Wechseln Sie zur Fontello-Weboberfläche und kopieren Sie das Zeichen, indem Sie es auswählen und dann :kbd:`Strg + C` (:kbd:`Cmd + C` unter macOS) drücken. Fügen Sie das Zeichen in die **Text**-Property Ihres Label-Nodes ein. Das Zeichen wird als Platzhalterglyphe im Inspektor angezeigt, sollte aber im 2D/3D-Viewport korrekt erscheinen.
zh_tw: 下載生成的字型檔案後，將其載入到 Godot 專案中，然後將其指定為 Label、RichTextLabel 或 Label3D 節點的自訂字形。切換到 Fontello Web 介面，然後透過選擇該字元並按 :kbd:`Ctrl + C`（在 macOS 上:kbd:`Cmd + C`）來複製該字元。將字元貼到標籤節點的 **Text** 屬性中。該字元將在屬性面板中顯示為佔位符字形，但它應該在 2D/3D 視窗中正確顯示。

source: To use an icon font alongside a traditional font in the same Control, you can specify the icon font as a :ref:`fallback <doc_using_fonts_font_fallbacks>`. This works because icon fonts use the Unicode *private use area*, which is reserved for use by custom fonts and doesn't contain standard glyphs by design.
de: Um eine Icon-Schriftart neben einer traditionellen Schriftart im selben Control zu verwenden, können Sie die Icon-Schriftart als :ref:`fallback <doc_using_fonts_font_fallbacks>` angeben. Dies funktioniert, weil Icon-Schriftarten den Unicode-Bereich *private use area* verwenden, der für die Verwendung durch benutzerdefinierte Schriftarten reserviert ist und von vornherein keine Standardglyphen enthält.
zh_tw: 若要在同一控制項中將圖示字形與傳統字形一起使用，您可以將圖示字形指定為 :ref:`Fallback <doc_using_fonts_font_fallbacks>`。這是可行的，因為圖示字形使用 Unicode *專用區域*，該區域保留供自訂字形使用，並且在設計上不包含標準字形。

source: Several modern icon fonts such as `Font Awesome 6 <https://fontawesome.com/download>`__ have a desktop variant that uses *ligatures* to specify icons. This allows you to specify icons by entering their name directly in the **Text** property of any node that can display fonts. Once the icon's name is fully entered as text (such as ``house``), it will be replaced by the icon.
de: Mehrere moderne Schriftarten wie `Font Awesome 6 <https://fontawesome.com/download>`__ haben eine Desktop-Variante, die *Ligaturen* zur Angabe von Symbolen verwendet. Damit können Sie Icons angeben, indem Sie ihren Namen direkt in die **Text**-Property eines beliebigen Nodes eingeben, der Schriftarten anzeigen kann. Sobald der Name des Icons vollständig als Text eingegeben wird (z.B. ``Haus``), wird er durch das Icon ersetzt.
zh_tw: 幾種現代圖示字形，例如“Font Awesome 6 <https://fontawesome.com/download>”，有一個使用*連字*來指定圖示的桌面變體。這允許您透過直接在任何可以顯示字形的節點的 **Text** 屬性中輸入圖示名稱來指定圖示。一旦圖示的名稱以文字形式完整輸入（例如“house”），它將被圖示取代。

source: While easier to use, this approach cannot be used with font fallbacks as the main font's characters will take priority over the fallback font's ligatures.
de: Dieser Ansatz ist zwar einfacher zu handhaben, kann aber nicht mit Schriftarten verwendet werden, die als Fallback verwendet werden, da die Zeichen der Hauptschriftart Vorrang vor den Ligaturen der Fallback-Schriftart haben.
zh_tw: 雖然更易於使用，但此方法不能與字形後備一起使用，因為主要字形的字元將優先於後備字形的連字。

source: Font fallbacks
de: Schriftart-Fallbacks
zh_tw: 字形退回

source: Godot supports defining one or more fallbacks when the main font lacks a glyph to be displayed. There are 2 main use cases for defining font fallbacks:
de: Godot unterstützt die Definition eines oder mehrerer Fallbacks, wenn in der Hauptschriftart eine anzuzeigende Glyphe fehlt. Es gibt 2 Hauptanwendungsfälle für die Definition von Schriftart-Fallbacks:
zh_tw: 當主字形缺少要顯示的字形時，Godot 支援定義一個或多個後備。定義字形後備有 2 個主要用例：

source: Use a font that only supports Latin character sets, but use another font to be able to display text another character set such as Cyrillic.
de: Verwendung einer Schriftart, die nur lateinische Zeichensätze unterstützt, aber eine andere Schriftart, um Text in einem anderen Zeichensatz wie z.B. Kyrillisch anzeigen zu können.
zh_tw: 使用僅支援拉丁字元集的字形，但使用其他字形可以顯示其他字元集（例如西里爾字母）的文字。

source: Use a font to render text, and another font to render emoji or icons.
de: Verwendung einer Schriftart zur Darstellung von Text und einer anderen Schriftart zur Darstellung von Emojis oder Icons.
zh_tw: 使用一種字形呈現文字，使用另一種字形呈現表情符號或圖示。
