Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: de, zh_tw

source: Open the Advanced Import Settings dialog by double-clicking the font file in the FileSystem dock. You can also select the font in the FileSystem dock, go to the Import dock then choose **Advanced…** at the bottom:
de: Öffnen Sie das Dialogfeld "Erweiterte Importeinstellungen", indem Sie im "Dateisystem"-Dock auf die Schriftart-Datei doppelklicken. Sie können die Schriftart auch im "Dateisystem"-Dock auswählen, zum "Import"-Dock gehen und dann unten **Erweitert...** wählen:
zh_tw: 雙擊檔案系統停靠列中的字型檔案，開啟「進階匯入設定」對話框。您也可以在檔案系統底座中選擇字形，前往匯入底座，然後選擇底部的**進階...**：

source: In the dialog that appears, look for **Fallbacks** section on the sidebar on the right, click the **Array[Font] (size 0)** text to expand the property, then click **Add Element**:
de: Suchen Sie in dem daraufhin angezeigten Dialogfeld den Abschnitt **Fallbacks** in der rechten Seitenleiste, klicken Sie auf den Text **Array[Font] (Größe 0)**, um die Property zu erweitern, und klicken Sie dann auf **Element hinzufügen**:
zh_tw: 在出現的對話方塊中，在右側邊欄上尋找 **Fallbacks** 部分，按一下 **Array[Font] (size 0)** 文字以展開屬性，然後按一下 **Add Element**：

source: Adding font fallback
de: Hinzufügen der Fallback-Schriftart
zh_tw: 新增字形退回

source: Click the dropdown arrow on the new element, then choose a font file using the **Quick Load** or **Load** options:
de: Klicken Sie auf den Dropdown-Pfeil des neuen Elements und wählen Sie dann eine Schriftart-Datei mit den Optionen **Schnellladen** oder **Laden**:
zh_tw: 點擊新元素上的下拉箭頭，然後使用 **快速載入** 或 **載入** 選項選擇字形檔案：

source: Loading font fallback
de: Laden der Fallback-Schriftart
zh_tw: 載入字形退回

source: It is possible to add fallback fonts while using the default project font. To do so, leave the **Base Font** property empty while adding one or more font fallbacks.
de: Es ist möglich, Fallback-Schriftarten hinzuzufügen, während die Default-Schriftart des Projekts verwendet wird. Lassen Sie dazu die Property **Basisschriftart** leer, während Sie eine oder mehrere Schriftarten als Fallback hinzufügen.
zh_tw: 使用預設專案字形時可以新增後備字形。為此，請將 **Base Font** 屬性留空，同時新增一種或多種字形後備。

source: Font fallbacks can also be defined on a local basis similar to :ref:`doc_using_fonts_opentype_font_features`, but this is not covered here for brevity reasons.
de: Fallback-Schriftarten können auch auf lokaler Basis definiert werden, ähnlich wie bei :ref:`doc_using_fonts_opentype_font_features`, aber dies wird hier aus Gründen der Kürze nicht behandelt.
zh_tw: 字形後備也可以在本地定義，類似於 :ref:`doc_using_fonts_opentype_font_features`，但出於簡潔原因，這裡不介紹。

source: Variable fonts
de: Variable Schriftarten
zh_tw: 變數

source: Godot has full support for `variable fonts <https://variablefonts.io/>`__, which allow you to use a single font file to represent various font weights and styles (regular, bold, italic, …). This must be supported by the font file you're using.
de: Godot bietet volle Unterstützung für `variable Schriftarten <https://variablefonts.io/>`__, die es Ihnen ermöglichen, eine einzige Schriftart-Datei zu verwenden, um verschiedene Schriftstärken und -stile (normal, fett, kursiv, ...) darzustellen. Dies muss von der verwendeten Schriftart-Datei unterstützt werden.
zh_tw: Godot 完全支援`可變字形 <https://variablefonts.io/>`__，它允許您使用單一字形檔案來表示各種字形粗細和樣式（常規、粗體、斜體等）。您正在使用的字形檔案必須支援此功能。

source: To use a variable font, create a :ref:`class_FontVariation` resource in the location where you intend to use the font, then load a font file within the FontVariation resource:
de: Um eine variable Schriftart zu verwenden, erstellen Sie eine Ressource :ref:`class_FontVariation` an dem Ort, an dem Sie die Schriftart verwenden wollen, und laden Sie dann eine Schriftart-Datei in die FontVariation-Ressource:
zh_tw: 若要使用可變字形，請在要使用該字形的位置建立一個 :ref:`class_FontVariation` 資源，然後在 FontVariation 資源中載入字形檔案：

source: Creating a FontVariation resource
de: Erstellen einer FontVariation-Ressource
zh_tw: 建立自己的資源

source: Loading a font file into the FontVariation resource
de: Laden einer Schriftart-Datei in die FontVariation-Ressource
zh_tw: 為 FontVariation 資源載入字形檔

source: Scroll down to the FontVariation's **Variation** section, then click the **Variation Coordinates** text to expand the list of axes that can be adjusted:
de: Scrollen Sie zum Abschnitt **Variation** der FontVariation und klicken Sie dann auf den Text **Variation Coordinates**, um die Liste der Achsen zu erweitern, die angepasst werden können:
zh_tw: 向下捲動至 FontVariation 的 **變化** 部分，然後按一下 **變更座標** 文字以展開可調整的軸列表：

source: List of variation axes
de: Liste der Variationsachsen
zh_tw: 功能列表

source: The set of axes you can adjust depends on the font loaded. Some variable fonts only support one axis of adjustment (typically *weight* or *slant*), while others may support multiple axes of adjustment.
de: Die Anzahl der Achsen, die Sie einstellen können, hängt von der geladenen Schriftart ab. Einige variable Schriftarten unterstützen nur eine Anpassungsachse (typischerweise *Gewicht* oder *Schräge*), während andere mehrere Anpassungsachsen unterstützen können.
zh_tw: 您可以調整的軸集取決於載入的字形。有些可變字形僅支援一個調整軸（通常為*粗細*或*傾斜*），而其他可變字形可能支援多個調整軸。

source: For example, here's the `Inter V <https://rsms.me/inter/>`__ font with a *weight* of ``900`` and a *slant* of ``-10``:
de: Hier ist zum Beispiel die Schriftart `Inter V <https://rsms.me/inter/>`__ mit einem *Gewicht* von ``900`` und einer *Schräge* von ``-10``:
zh_tw: 例如，這裡是`Inter V <https://rsms.me/inter/>`__ 字形，其*粗細*為“900”，*傾斜*為“-10”：

source: Variable font example (Inter V)
de: Beispiel für eine variable Schriftart (Inter V)
zh_tw: 可變字形範例（Inter V）

source: While variable font axis names and scales aren't standardized, some common conventions are usually followed by font designers. For instance, the *weight* axis typically uses ``400`` as the "regular" font weight and ``700`` as the "bold" font weight.
de: Auch wenn die Namen und Skalen der variablen Schriftarten nicht standardisiert sind, halten sich die Designer von Schriftarten in der Regel an einige gemeinsame Konventionen. Die *Gewicht*-Achse beispielsweise verwendet typischerweise ``400`` für die "normale" Schriftart und ``700`` für die "fette" Schriftart.
zh_tw: 雖然可變字形軸名稱和比例沒有標準化，但字形設計者通常遵循一些常見的約定。例如，*weight* 軸通常使用“400”作為“常規”字形粗細，使用“700”作為“粗體”字形粗細。

source: You can save the FontVariation to a ``.tres`` resource file to reuse it in other places:
de: Sie können die FontVariation in einer ``.tres`` Ressourcendatei speichern, um sie an anderen Stellen wiederzuverwenden:
zh_tw: 您可以將 FontVariation 儲存到「.tres」資源檔案中，以便在其他地方重複使用它：

source: Saving FontVariation to an external resource file
de: Speichern von FontVariation in einer externen Ressourcendatei
zh_tw: 將 FontVariation 保存為外部資源檔

source: Faux bold and italic
de: Pseudo-Fett und -Kursiv
zh_tw: 假粗體和假斜體

source: When writing text in bold or italic, using font variants specifically designed for this looks better. Spacing between glyphs will be more consistent when using a bold font, and certain glyphs' shapes may change entirely in italic variants (compare "a" and *"a"*).
de: Wenn Sie Text fett oder kursiv schreiben, sehen Sie besser aus, wenn Sie Schriftarten verwenden, die speziell für diesen Zweck entwickelt wurden. Die Abstände zwischen den Glyphen sind bei einer fetten Schriftart gleichmäßiger, und die Form bestimmter Glyphen kann sich bei kursiven Varianten völlig verändern (vgl. "a" und *"a"*).
zh_tw: 當以粗體或斜體書寫文字時，使用專門為此設計的字形變體看起來會更好。使用粗體時，字形之間的間距將更加一致，並且某些字形的形狀可能會在斜體變體中完全改變（比較“a”和*“a”*）。

source: However, real bold and italic fonts require shipping more font files, which increases distribution size. A single :ref:`variable font <doc_using_fonts_variable_fonts>` file can also be used, but this file will be larger than a single non-variable font. While file size is usually not an issue for desktop projects, it can be a concern for mobile/web projects that strive to keep distribution size as low as possible.
de: Echte fette und kursive Schriftarten erfordern jedoch die Auslieferung mehrerer Schriftartendateien, was den Umfang der Distribution erhöht. Eine einzelne :ref:`variable Schriftart <doc_using_fonts_variable_fonts>`-Datei kann auch verwendet werden, aber diese Datei wird größer sein als eine einzelne nicht-variable Schriftart. Während die Dateigröße bei Desktop-Projekten in der Regel kein Problem darstellt, kann sie bei Mobil-/Web-Projekten, bei denen die Größe der Distribution so gering wie möglich gehalten werden soll, ein Problem darstellen.
zh_tw: 然而，真正的粗體和斜體字形需要傳送更多的字形檔案，這會增加分發大小。也可以使用單一:ref:`可變字形 <doc_using_fonts_variable_fonts>` 檔案，但該檔案將比單一非可變字形大。雖然檔案大小對於桌面專案來說通常不是問題，但對於努力保持分發大小盡可能小的行動/Web 專案來說，這可能是一個問題。

source: To allow bold and italic fonts to be displayed without having to ship additional fonts (or use a variable font that is larger in size), Godot supports *faux* bold and italic.
de: Damit fette und kursive Schriftarten angezeigt werden können, ohne dass zusätzliche Schriftarten ausgeliefert werden müssen (oder eine variable Schriftart mit größerem Schriftgrad verwendet wird), unterstützt Godot pseudo-fette und kursive Schriftarten.
zh_tw: 為了允許顯示粗體和斜體字形而無需提供額外的字形（或使用尺寸較大的可變字形），Godot 支援 *faux* 粗體和斜體。

source: Faux bold/italic (top), real bold/italic (bottom). Normal font used: Open Sans SemiBold
de: Pseudo-fette/kursive Schrift (oben), echte fette/kursive Schrift (unten). Verwendete normale Schriftart: Open Sans SemiBold
zh_tw: 仿粗體/斜體（上），真粗體/斜體（下）。使用的普通字形：Open Sans SemiBold

source: Faux bold and italic is automatically used in :ref:`class_RichTextLabel`'s bold and italic tags if no custom fonts are provided for bold and/or italic.
de: Pseudo-Fett und Kursiv wird automatisch in den Tags bold und italic von :ref:`class_RichTextLabel` verwendet, wenn keine benutzerdefinierten Schriftarten für Fett und/oder Kursiv angegeben sind.
zh_tw: 如果沒有為粗體和/或斜體提供自訂字形，則會在 :ref:`class_RichTextLabel` 的粗體和斜體標籤中自動使用仿粗體和斜體。

source: To use faux bold, create a FontVariation resource in a property where a Font resource is expected. Set **Variation > Embolden** to a positive value to make a font bolder, or to a negative value to make it less bold. Recommended values are between ``0.5`` and ``1.2`` depending on the font.
de: Um Pseudo-Fettschrift zu verwenden, erstellen Sie eine FontVariation-Ressource in einer Property, in der eine Font-Ressource erwartet wird. Setzen Sie **Variation > Embolden** auf einen positiven Wert, um eine Schriftart fetter zu machen, oder auf einen negativen Wert, um sie weniger fett zu machen. Empfohlene Werte liegen zwischen ``0.5`` und ``1.2``, je nach Schriftart.
zh_tw: 若要使用仿粗體，請在需要 Font 資源的屬性中建立 FontVariation 資源。將 **Variation > Embolden** 設為正值以使字形更粗，或設為負值以使其不那麼粗體。根據字形，建議值介於「0.5」和「1.2」之間。

source: Faux italic is created by skewing the text, which is done by modifying the per-character transform. This is also provided in FontVariation using the **Variation > Transform** property. Setting the ``yx`` component of the character transform to a positive value will italicize the text. Recommended values are between ``0.2`` and ``0.4`` depending on the font.
de: Pseudo-Kursivschrift wird durch eine Schrägstellung des Textes erzeugt, die durch eine Änderung der zeichenbezogenen Transformation erreicht wird. Dies ist auch in FontVariation mit der Eigenschaft **Variation > Transform** möglich. Setzt man die Komponente ``yx`` der Zeichentransformation auf einen positiven Wert, wird der Text kursiv dargestellt. Empfohlene Werte liegen zwischen ``0.2`` und ``0.4``, abhängig von der Schriftart.
zh_tw: 仿斜體是透過傾斜文字建立的，這是透過修改每個字元的轉換來完成的。這也在 FontVariation 中使用 **Variation > Transform** 屬性提供。將字元轉換的“yx”元件設為正值將使文字變為斜體。根據字形，建議值介於「0.2」和「0.4」之間。

source: Adjusting font spacing
de: Anpassen der Schriftart-Abstände
zh_tw: 調整字形間距

source: For stylistic purposes or for better readability, you may want to adjust how a font is presented in Godot.
de: Aus stilistischen Gründen oder zur besseren Lesbarkeit können Sie die Darstellung einer Schriftart in Godot anpassen.
zh_tw: 出於風格目的或為了更好的可讀性，您可能需要調整字形在 Godot 中的呈現方式。

source: Create a FontVariation resource in a property where a Font resource is expected. There are 4 properties available in the **Variation > Extra Spacing** section, which accept positive and negative values:
de: Erstellen Sie eine FontVariation-Ressource in einer Property, in der eine Schriftart-Ressource erwartet wird. Im Abschnitt **Variation > Extra-Abstand** sind 4 Propertys verfügbar, die positive und negative Werte akzeptieren:
zh_tw: 在需要 Font 資源的屬性中建立 FontVariation 資源。 **變化 > 額外間距**部分中有 4 個可用屬性，它們接受正值和負值：

source: **Glyph:** Additional spacing between every glyph.
de: **Glyphe:** Zusätzliche Abstände zwischen den einzelnen Glyphen.
zh_tw: **字形：** 每個字形之間的額外間距。

source: **Space:** Additional spacing between words.
de: **Abstand:** Zusätzliche Abstände zwischen den Wörtern.
zh_tw: **空格：** 單字之間的額外間距。

source: **Top:** Additional spacing above glyphs. This is used for multiline text, but also to calculate the minimum size of controls such as :ref:`class_Label` and :ref:`class_Button`.
de: **Oben:** Zusätzlicher Abstand über Glyphen. Dies wird für mehrzeiligen Text, aber auch zur Berechnung der Mindestgröße von Controls wie :ref:`class_Label` und :ref:`class_Button` verwendet.
zh_tw: **頂部：** 字形上方的額外間距。這用於多行文字，但也用於計算控制項的最小大小，例如 :ref:`class_Label` 和 :ref:`class_Button`。

source: **Top:** Additional spacing below glyphs. This is used for multiline text, but also to calculate the minimum size of controls such as :ref:`class_Label` and :ref:`class_Button`.
de: **Unten:** Zusätzlicher Abstand unter den Glyphen. Dies wird für mehrzeiligen Text, aber auch zur Berechnung der Mindestgröße von Controls wie :ref:`class_Label` und :ref:`class_Button` verwendet.
zh_tw: **頂部：** 字形下方的額外間距。這用於多行文字，但也用於計算控制項的最小大小，例如 :ref:`class_Label` 和 :ref:`class_Button`。

source: The **Variation > Transform** property can also be adjusted to stretch characters horizontally or vertically. This is specifically done by adjusting the ``xx`` (horizontal scale) and ``yy`` (vertical scale) components. Remember to adjust glyph spacing to account for any changes, as glyph transform doesn't affect how much space each glyph takes in the text. Non-uniform scaling of this kind should be used sparingly, as fonts are generally not designed to be displayed with stretching.
de: Die Property **Variation > Transformieren** kann auch eingestellt werden, um Zeichen horizontal oder vertikal zu strecken. Dies geschieht insbesondere durch die Anpassung der Komponenten ``xx`` (horizontale Skalierung) und ``yy`` (vertikale Skalierung). Vergessen Sie nicht, die Glyphenabstände anzupassen, da die Glyphentransformation keinen Einfluss darauf hat, wie viel Platz jede Glyphe im Text einnimmt. Diese Art der ungleichmäßigen Skalierung sollte sparsam eingesetzt werden, da Schriftarten im Allgemeinen nicht für die Darstellung mit Streckung konzipiert sind.
zh_tw: 也可以調整 **變化 > 變換** 屬性以水平或垂直拉伸字元。這是透過調整“xx”（水平比例）和“yy”（垂直比例）組件來具體完成的。請記住調整字形間距以適應任何變化，因為字形轉換不會影響每個字形在文字中佔用的空間。應謹慎使用這種非均勻縮放，因為字形通常不設計為透過拉伸顯示。

source: OpenType font features
de: Features der OpenType-Schriftart
zh_tw: 預設功能

source: Godot supports enabling OpenType font features, which are a standardized way to define alternate characters that can be toggled without having to swap font files entirely. Despite being named OpenType font features, these are also supported in TrueType (``.ttf``) and WOFF/WOFF2 font files.
de: Godot unterstützt die Aktivierung von OpenType-Schriftarten, die eine standardisierte Möglichkeit darstellen, alternative Zeichen zu definieren, die ein- und ausgeschaltet werden können, ohne dass Schriftartendateien vollständig ausgetauscht werden müssen. Obwohl sie als OpenType-Schriftarten-Features bezeichnet werden, werden sie auch in TrueType- (``.ttf``) und WOFF/WOFF2-Schriftarten-Dateien unterstützt.
zh_tw: Godot 支援啟用 OpenType 字形功能，這是一種定義替代字符的標準化方法，可以切換這些字符，而無需完全交換字形檔案。儘管被命名為 OpenType 字型功能，但 TrueType (``.ttf``) 和 WOFF/WOFF2 字型檔案也支援這些功能。

source: Support for OpenType features highly depends on the font used. Some fonts don't support any OpenType features, while other fonts can support dozens of toggleable features.
de: Die Unterstützung für OpenType-Features hängt stark von der verwendeten Schriftart ab. Einige Schriftarten unterstützen keine OpenType-Features, während andere Schriftarten Dutzende von ein- und ausschaltbaren Funktionen unterstützen können.
zh_tw: 對 OpenType 功能的支援很大程度上取決於所使用的字形。某些字形不支援任何 OpenType 功能，而其他字形可以支援數十種可切換功能。

source: There are 2 ways to use OpenType font features:
de: Es gibt 2 Möglichkeiten, OpenType-Schriftarten zu verwenden:

source: **Globally on a font file**
de: **Global in einer Schriftart-Datei**
zh_tw: **全域字形檔案**

source: In the dialog that appears, look for the **Metadata Overrides > OpenType Features** section on the sidebar on the right, click the **Features (0 of N set)** text to expand the property, then click **Add Feature**:
de: Suchen Sie in dem daraufhin angezeigten Dialogfeld den Abschnitt **Metadatenüberschreibungen > OpenType-Features** in der rechten Seitenleiste, klicken Sie auf den Text **Features (0 von N gesetzt)**, um die Property zu erweitern, und klicken Sie dann auf **Merkmal hinzufügen**:
zh_tw: 在出現的對話方塊中，在右側側邊欄上尋找**元資料覆蓋> OpenType 功能**部分，按一下**功能（N 群組中的0 個）** 文字以展開屬性，然後按一下**新增特徵**：

source: OpenType feature overrides in Advanced Import Settings
de: OpenType-Funktion-Überschreibungen in den erweiterten Importeinstellungen
zh_tw: 高級匯入設定中的 OpenType 功能覆蓋

source: **In a specific font usage (FontVariation)**
de: **Bei einer bestimmten Schriftart (FontVariation)**
zh_tw: **在特定字形使用（FontVariation）**

source: To use a font feature, create a FontVariation resource like you would do for a :ref:`variable font <doc_using_fonts_variable_fonts>`, then load a font file within the FontVariation resource:
de: Um eine Schriftart zu verwenden, erstellen Sie eine FontVariation-Ressource, wie Sie es für eine :ref:`Variable Schriftart <doc_using_fonts_variable_fonts>` tun würden, und laden dann eine Schriftart-Datei in die FontVariation-Ressource:
zh_tw: 若要使用字型功能，請建立 FontVariation 資源，就像建立可變字型 <doc_using_fonts_variable_fonts>` 一樣，然後在 FontVariation 資源中載入字型檔案：

source: Loading a font file into a FontVariation resource
de: Laden einer Schriftart-Datei in eine FontVariation-Ressource
zh_tw: 在 FontVariation 資源中載入字形檔

source: Scroll down to the FontVariation's **OpenType Features** section, click the **Features (0 of N set)** text to expand the property, then click **Add Feature** and select the desired feature in the dropdown:
de: Scrollen Sie nach unten zum Abschnitt **OpenType Features** der FontVariation, klicken Sie auf den Text **Features (0 of N set)**, um die Property zu erweitern, klicken Sie dann auf **Add Feature** und wählen Sie das gewünschte Feature in der Dropdown-Liste aus:
zh_tw: 向下捲動至FontVariation 的**OpenType Features** 部分，按一下**Features (0 of N set)** 文字以展開屬性，然後按一下**Add Feature** 並在下拉列表中選擇所需的功能：

source: Specifying OpenType features in a FontVariation resource
de: Festlegen von OpenType-Features in einer FontVariation-Ressource
zh_tw: 在 FontVariation 資源中指定 OpenType 功能

source: For example, here's the `Inter <https://rsms.me/inter/>`__ font without the *Slashed Zero* feature (top), then with the *Slashed Zero* OpenType feature enabled (bottom):
de: Hier ist zum Beispiel die Schriftart `Inter <https://rsms.me/inter/>`__ ohne die Funktion *Slashed Zero* (oben) und mit der aktivierten OpenType-Funktion *Slashed Zero* (unten):
zh_tw: 例如，這裡是沒有 *Slashed Zero* 功能（頂部）的 Inter <https://rsms.me/inter/>`__ 字形，然後啟用了 *Slashed Zero* OpenType 功能（底部）：

source: OpenType feature comparison (Inter)
de: OpenType-Featurevergleich (Inter)
zh_tw: OpenType 功能比較（Inter）

source: You can disable ligatures and/or kerning for a specific font by adding OpenType features, then unchecking them in the inspector:
de: Sie können Ligaturen und/oder Kerning für eine bestimmte Schriftart deaktivieren, indem Sie OpenType-Funktionen hinzufügen und dann im Inspektor deaktivieren:
zh_tw: 您可以透過新增 OpenType 功能來停用特定字形的連字和/或字距調整，然後在檢視器中取消選取它們：

source: Disabling ligatures and kerning for a font
de: Deaktivieren von Ligaturen und Kerning für eine Schriftart
zh_tw: 禁用字形的合字和字偶距

source: System fonts
de: System-Schriftarten
zh_tw: 系統字形

source: Loading system fonts is only supported on Windows, macOS, Linux, Android and iOS.
de: Das Laden von Systemschriftarten wird nur unter Windows, macOS, Linux, Android und iOS unterstützt.
zh_tw: 只有 Windows、macOS、Linux、Android、iOS 支援載入系統字形。

source: However, loading system fonts on Android is unreliable as there is no official API for doing so. Godot has to rely on parsing system configuration files, which can be modified by third-party Android vendors. This may result in non-functional system font loading.
de: Das Laden von Systemschriftarten unter Android ist jedoch unzuverlässig, da es dafür keine offizielle API gibt. Godot muss sich auf das Parsen von Systemkonfigurationsdateien verlassen, die von Android-Drittanbietern geändert werden können. Dies kann dazu führen, dass das Laden von Systemschriftarten nicht funktioniert.

source: System fonts are a different type of resource compared to imported fonts. They are never actually imported into the project, but are loaded at run-time. This has 2 benefits:
de: Systemschriftarten sind eine andere Art von Ressource als importierte Schriftarten.Sie werden nie wirklich in das Projekt importiert, sondern zur Laufzeit geladen.Dies hat 2 Vorteile:
zh_tw: 與匯入的字形相比，系統字形是一種不同型別的資源。它們實際上從未匯入到專案中，而是在運作時加載。這樣做有兩個好處：

source: The fonts are not included within the exported PCK file, leading to a smaller file size for the exported project.
de: Die Schriftarten sind nicht in der exportierten PCK-Datei enthalten, was zu einer geringeren Dateigröße des exportierten Projekts führt.
zh_tw: 字形不包含在匯出的 PCK 檔案中，導致匯出專案的檔案大小較小。

source: Since fonts are not included with the exported project, this avoids licensing issues that would occur if proprietary system fonts were distributed alongside the project.
de: Da die Schriftarten nicht in das exportierte Projekt aufgenommen werden, werden Lizenzierungsprobleme vermieden, die auftreten würden, wenn proprietäre Systemschriftarten zusammen mit dem Projekt verteilt würden.
zh_tw: 由於匯出的專案中不包含字形，因此可以避免在專有系統字形與專案一起分發時可能出現的許可問題。

source: The engine automatically uses system fonts as fallback fonts, which makes it possible to display CJK characters and emoji without having to load a custom font. There are some restrictions that apply though, as mentioned in the :ref:`Using emoji <doc_using_fonts_emoji>` section.
de: Die Engine verwendet automatisch Systemschriftarten als Ersatzschriftarten, was die Darstellung von CJK-Zeichen und Emoji ermöglicht, ohne dass eine eigene Schriftart geladen werden muss. Es gelten jedoch einige Einschränkungen, wie im Abschnitt :ref:`Verwendung von Emoji <doc_using_fonts_emoji>` erwähnt.
zh_tw: 引擎會自動使用系統字形作為後備字形，這使得無需加載自訂字形即可顯示 CJK 字元和表情符號。但有一些限制適用，如 :ref:`使用表情符號 <doc_using_fonts_emoji>` 部分所述。

source: Create a :ref:`class_SystemFont` resource in the location where you desire to use the system font:
de: Erstellen Sie eine Ressource :ref:`class_SystemFont` an dem Ort, an dem Sie die Systemschriftart verwenden möchten:

source: Creating a SystemFont resource
de: Erstellen einer SystemFont-Ressource
zh_tw: 建立自己的資源

source: Specifying a font name to use in a SystemFont resource
de: Angeben eines Schriftart-Namens zur Verwendung in einer SystemFont-Ressource
zh_tw: 指定要在 SystemFont 資源中使用的字型名稱

source: You can either specify one or more font names explicitly (such as ``Arial``), or specify the name of a font *alias* that maps to a "standard" default font for the system:
de: Sie können entweder einen oder mehrere Schriftarten explizit angeben (z.B. ``Arial``), oder den Namen einer *Alias-Schriftart* angeben, die einer "Standard"-Schriftart für das System entspricht:
zh_tw: 你可以明確的指定若干字形名稱（例如 ``Arial``），也可以指定字形的*別名*，後者會對應到系統中的“標準”預設字形：

source: Font alias
de: Schriftart-Alias
zh_tw: 前視圖
