Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_theme_editor.po
Languages: de, zh_tw

source: Using the theme editor
de: Verwendung des Theme-Editors
zh_tw: 使用主題編輯器

source: This article explains how to create and manage UI themes using the Godot editor and its theme editor tool. We recommend getting familiar with the basics behind GUI skinning/theming by reading :ref:`doc_gui_skinning` before starting.
de: Dieser Artikel erklärt, wie man mit dem Godot-Editor und seinem Theme-Editor-Tool UI-Themes erstellt und verwaltet. Wir empfehlen, sich mit den Grundlagen des GUI-Skinning/Theming vertraut zu machen, indem Sie :ref:`doc_gui_skinning` lesen, bevor Sie beginnen.
zh_tw: 本文介紹如何通過 Godot 編輯器及其主題編輯器工具來建立並管理 UI 主題。我們推薦您在開始前先閱讀 :ref:`doc_gui_skinning`，熟悉一下 GUI 換皮/主題背後的基本知識。

source: The theme editor is a bottom panel tool that activates automatically, when a :ref:`Theme <class_Theme>` resource is selected for editing. It contains the necessary UI for adding, removing, and adjusting theme types and theme items. It features a preview section for testing your changes live, as well as a window dialog for doing bulk operations of the theme items.
de: Der Theme-Editor ist ein Tool im unteren Panel, das automatisch aktiviert wird, wenn eine :ref:`Theme <class_Theme>`-Ressource zur Bearbeitung ausgewählt wird. Er enthält die notwendige Benutzeroberfläche zum Hinzufügen, Entfernen und Anpassen von Theme-Typen und -Elementen. Es verfügt über einen Vorschaubereich, in dem Sie Ihre Änderungen live testen können, sowie über ein Dialogfenster, in dem Sie Massenoperationen an den Theme-Elementen durchführen können.
zh_tw: 主題編輯器是底部面板工具，當一個 :ref:`Theme <class_Theme>` 資源被選中進行編輯時，面板會自動啟動。面板包含了新增、刪除和調整主題型別和主題專案的必要使用者介面。面板有一個預覽區，用於測試你做出的變化，以及一個視窗對話方塊，用於對主題專案進行批量操作。

source: Creating a theme
de: Erstellen eines Themes
zh_tw: 建立主題

source: Like any other resources, themes can be created directly in the file system dock by right-clicking and selecting **New Resource...**, then selecting **Theme** and clicking **Create**. This is especially useful for creating project-wide themes.
de: Wie jede andere Ressource können Themes direkt im Dateisystem-Dock erstellt werden, indem Sie mit der rechten Maustaste klicken und **Neue Ressource...** auswählen, dann **Theme** auswählen und auf **Erstellen** klicken. Dies ist besonders nützlich für die Erstellung projektweiter Themes.
zh_tw: 和其他任何資源一樣，主題可以直接在檔案系統面板中建立：右鍵，選擇**新建資源...**，然後選擇 **Theme** 並點擊**建立**。用來建立專案範圍的主題很方便。

source: Themes also can be created from any control node. Select a control node in the scene hierarchy, then in the inspector go to the ``theme`` property. From there you can select **New Theme**.
de: Themes können auch von jedem Control-Node aus erstellt werden. Wählen Sie einen Control-Node in der Szenenhierarchie aus, dann gehen Sie im Inspektor auf die Property``Theme``. Von dort aus können Sie **Neues Theme** wählen.
zh_tw: 也可以在任何控制項節點中建立主題。在場景樹中選擇控制項節點後，找到屬性面板中的 ``theme`` 熟悉。然後就可以選擇**新建 Theme**。

source: This will create an empty theme and open up the theme editor. Keep in mind that resources created this way are bundled with the scene by default. Use the context menu to save the new theme to a file instead.
de: Dadurch wird ein leeres Theme erstellt und der Theme-Editor geöffnet. Beachten Sie, dass die auf diese Weise erstellten Ressourcen standardmäßig mit der Szene verknüpft werden. Verwenden Sie stattdessen das Kontextmenü, um das neue Theme in einer Datei zu speichern.
zh_tw: 這樣就會建立一個空主題，並且打開主題編輯器。請記住，這樣建立的資源預設是和場景綁定的。可以使用本文功能表將新建的主題保存為單獨的檔。

source: While the theme editor provides the tools to manage theme types and items, themes also include the default, fallback font that you can edit only using the Inspector dock. Same applies to the contents of complex resource types, such as :ref:`StyleBoxes <class_StyleBox>` and icons — they open for editing in the Inspector.
de: Während der Theme-Editor die Tools zum Verwalten von Theme-Typen und -Elementen bereitstellt, enthalten Themes auch die Default-Fallback-Schrift, die Sie nur über das Inspektor-Dock bearbeiten können. Das Gleiche gilt für den Inhalt komplexer Ressourcentypen, wie z.B. :ref:`StyleBoxes <class_StyleBox>` und Icons — Sie lassen sich im Inspektor bearbeiten.
zh_tw: 雖然主題編輯器提供了管理主題型別和專案的工具，主題也包括預設的備用字形，你只能使用屬性面板面板來編輯。這同樣適用於複雜的資源型別的內容，如:ref:`樣式盒 <class_StyleBox>`和圖示——它們會在屬性面板中打開編輯。

source: Theme editor overview
de: Übersicht über den Theme-Editor
zh_tw: 編輯器

source: The theme editor has two main parts. The main theme editor, located at the bottom of the Godot editor, aims to provide users with tools to quickly create, edit, and delete theme items and types. It gives visual tools for picking and changing controls, abstracting the underlying theme concepts. The **Manage Theme Items** dialog, on the other hand, tries to address the needs of those who want to change themes manually. It's also useful for creating a new editor theme.
de: Der Theme-Editor besteht aus zwei Hauptteilen. Der Haupteditor für Themes, der sich am unteren Rand des Godot-Editors befindet, soll den Benutzern Tools zum schnellen Erstellen, Bearbeiten und Löschen von Theme-Elementen und -typen an die Hand geben. Er bietet visuelle Tools zum Auswählen und Ändern von Controls und abstrahiert die zugrunde liegenden Theme-Konzepte. Das Dialogfeld **Theme-Elemente verwalten** ist dagegen auf die Bedürfnisse derjenigen ausgerichtet, die Themes manuell ändern möchten. Er ist auch nützlich, um ein neues Editor-Theme zu erstellen.
zh_tw: 主題編輯器有兩個主要部分。主要的主題編輯器位於Godot編輯器的底部，為使用者提供了快速建立、編輯和刪除主題專案和型別的工具。它提供了挑選和改變控制項的視覺化工具，抽象了底層的主題概念。另一方面，**管理主題專案**對話方塊，提供解決手動改變主題的需求。其對於建立新的編輯器主題時很有用。

source: Theme previews
de: Theme-Vorschau
zh_tw: 主題預覽

source: The left-hand side of the main editor has a set of preview tabs. The **Default Preview** tab is visible out of the box and contains most of the frequently used controls in various states. Previews are interactive, so intermediate states (e.g. hover) can be previewed as well.
de: Die linke Seite des Haupteditors enthält eine Reihe von Vorschau-Tabs. Der Tab **Default-Vorschau** ist standardmäßig sichtbar und enthält die meisten der häufig verwendeten Controls in verschiedenen Zuständen. Die Vorschauen sind interaktiv, so dass auch Zwischenzustände (z. B. Hover) in der Vorschau angezeigt werden können.
zh_tw: 主編輯器左側的是一組預覽分頁。**預設預覽**分頁預設可見，裡面有處於各種狀態的大多數常用控制項。預覽是可互動的，所以也可以預覽中間狀態（比如滑鼠懸停）。

source: Additional tabs can be created from arbitrary scenes in your project. The scene must have a control node as its root to function as a preview. To add a new tab click the **Add Preview** button and select the saved scene from your file system.
de: Zusätzliche Tabs können aus beliebigen Szenen in Ihrem Projekt erstellt werden. Die Szene muss einen Kontroll-Node als Root haben, um als Vorschau zu funktionieren. Um einen neuen Tab hinzuzufügen, klicken Sie auf den Button **Vorschau hinzufügen** und wählen Sie die gespeicherte Szene aus Ihrem Dateisystem aus.
zh_tw: 可以使用你自己專案中的任意場景建立更多的分頁。場景的根節點必須是控制項節點才能進行預覽。點擊**新增預覽**按鈕然後從檔案系統中選擇已保存的場景，就可以新增一個新的分頁。

source: If you make changes to the scene, they will not be reflected in the preview automatically. To update the preview click the reload button on the toolbar.
de: Wenn Sie Änderungen an der Szene vornehmen, werden diese nicht automatisch in die Vorschau übernommen. Um die Vorschau zu aktualisieren, klicken Sie auf den Button "Neu laden" in der Toolbar.
zh_tw: 對場景的修改不會自動反映到預覽中。更新預覽需要點擊工具列上的重新載入按鈕。

source: Previews can also be used to quickly select the theme type to edit. Select the picker tool from the toolbar and hover over the preview area to highlight control nodes. Highlighted control nodes display their class name, or type variation if available. Clicking on the highlighted control opens it for editing on the right-hand side.
de: Vorschauen können auch verwendet werden, um schnell den zu bearbeitenden Theme-Typ auszuwählen. Wählen Sie das Picker-Tool aus der Toolbar und bewegen Sie den Mauszeiger über den Vorschaubereich, um die Control-Nodes zu markieren. Hervorgehobene Control-Nodes zeigen ihren Klassennamen an. Wenn Sie auf das hervorgehobene Control klicken, wird es auf der rechten Seite zur Bearbeitung geöffnet.
zh_tw: 還可以使用預覽快速選擇要編輯的主題型別。點擊工具列上的吸管按鈕，將滑鼠懸停到預覽區域就可以將控制項節點高亮。高亮的控制項節點會顯示類別名稱。點擊高亮的控制項就可以將它在右側打開並編輯。

source: Theme types and items
de: Themen-Typen und Elemente
zh_tw: 主題型別與專案

source: The right-hand side of the theme editor provides a list of theme types available in the edited theme resource, and the contents of the selected type. The list of type's items is divided into several tabs, corresponding to each data type available in the theme (colors, constants, styles, etc.). If the **Show Default** option is enabled, then for each built-in type its default theme values are displayed, greyed out. If the option is disabled, only the items available in the edited theme itself are displayed.
de: Auf der rechten Seite des Theme-Editors finden Sie eine Liste der in der bearbeiteten Theme-Ressource verfügbaren Theme-Typen sowie den Inhalt des ausgewählten Typs. Die Liste der Elemente des Typs ist in mehrere Tabs unterteilt, die den einzelnen im Theme verfügbaren Datentypen entsprechen (Farben, Konstanten, Stile usw.). Wenn die Option **Default anzeigen** aktiviert ist, werden für jeden Built-in-Typ die Default-Werte des Themes in grauer Schrift angezeigt. Wenn die Option deaktiviert ist, werden nur die im bearbeiteten Theme selbst verfügbaren Elemente angezeigt.
zh_tw: 主題編輯器的右側提供了編輯主題資源中可用的主題型別列表，以及所選型別的內容。型別的專案列表分為幾個分頁，對應於主題中可用的每種資料型別（顏色、常數、樣式等）。如果啟用了**顯示預設**選項，則對於每個內建型別，其預設主題值都會顯示為灰色。如果禁用該選項，則只顯示編輯主題本身的可用專案。

source: Individual items from the default theme can be added to the current theme by clicking on the **Override** button next to the item. You can also override all the default items of the selected theme type by clicking on the **Override All** button. Overridden properties can then be removed with the **Remove Item** button. Properties can also be renamed using the **Rename Item** button, and completely custom properties can be added to the list using the text field below it.
de: Einzelne Elemente aus dem Default-Theme können zum aktuellen Theme hinzugefügt werden, indem Sie auf den Button **Überschreiben** neben dem Element klicken. Sie können auch alle Default-Elemente des ausgewählten Theme-Typs überschreiben, indem Sie auf die Schaltfläche **Alle überschreiben** klicken. Überschriebene Propertys können dann mit dem Button **Element entfernen** entfernt werden. Propertys können auch über den Button **Element umbenennen** umbenannt werden, und vollständig benutzerdefinierte Propertys können der Liste über das Textfeld darunter hinzugefügt werden.
zh_tw: 通過點擊專案旁邊的**Override**按鈕，可以將預設主題中的個別專案新增到目前主題中。你也可以通過點擊**Override All**按鈕來覆蓋所選主題型別的所有預設專案。然後可以用**Remove Item**按鈕移除被覆蓋的屬性。屬性也可以用**Rename Item**按鈕重命名，完全自訂的屬性可以用它下面的文字欄位新增到列表中。

source: Overridden theme items can be edited directly in the right-hand panel, unless they are resources. Resources have rudimentary controls available for them, but must be edited in the Inspector dock instead.
de: Überschriebene Theme-Elemente können direkt im rechten Panel bearbeitet werden, sofern es sich nicht um Ressourcen handelt. Ressourcen verfügen über rudimentäre Controls, müssen aber stattdessen im Inspektor-Dock bearbeitet werden.
zh_tw: 覆蓋的主題專案可以直接在右側面板中編輯，除非它們是資源。資源具有可用的基本控制項，但必須在屬性面板欄中進行編輯。

source: Styleboxes have an unique feature available, where you can pin an individual stylebox from the list. Pinned stylebox acts like the leader of the pack, and all styleboxes of the same type are updated alongside it when you change its properties. This allows you to edit properties of several styleboxes at the same time.
de: Styleboxen verfügen über eine einzigartige Funktion, bei der Sie eine einzelne Stylebox aus der Liste anheften können. Die angeheftete Stylebox fungiert als Anführer der Gruppe, und alle Styleboxen desselben Typs werden mit ihr aktualisiert, wenn Sie ihre Propertys ändern. So können Sie die Propertys mehrerer Styleboxen gleichzeitig bearbeiten.
zh_tw: 樣式盒子有一個獨特的功能，您可以在其中固定列表中的單個樣式盒子。固定樣式盒子就像包頭一樣，當您更改其屬性時，所有相同型別的樣式盒子都會隨之更新。這允許您同時編輯多個樣式盒子的屬性。

source: While theme types can be picked from a preview, they can also be added manually. Clicking the plus button next to the type list opens the **Add item Type** menu. In that menu you can either select a type from the list, or you can enter an arbitrary name to create a custom type. Text field also filters the list of control nodes.
de: Theme-Typen können aus einer Vorschau ausgewählt werden, sie können aber auch manuell hinzugefügt werden. Wenn Sie auf den Plus-Button neben der Typ-Liste klicken, öffnet sich das Menü **Elementtyp hinzufügen**. In diesem Menü können Sie entweder einen Typ aus der Liste auswählen oder einen beliebigen Namen eingeben, um einen eigenen Typ zu erstellen. Das Textfeld filtert auch die Liste der Control-Nodes.
zh_tw: 雖然可以從預覽中選擇主題型別，但也可以手動新增。按一下型別列表旁邊的加號按鈕可以打開**新增專案型別**功能表。在功能表中，可以從列表中選擇一種型別，也可以輸入任意名稱來建立自訂型別。文字欄位篩選控制項節點列表。

source: Manage and import items
de: Verwalten und Importieren von Elementen
zh_tw: 訊號與屬性

source: Clicking the **Manage Items** button brings up the **Manage Theme Items** dialog. In the **Edit Items** tab you can view and add theme types, as well as view and edit the theme items of the selected type.
de: Wenn Sie auf die Button **Elemente verwalten** klicken, wird das Dialogfeld **Themenelemente verwalten** angezeigt. Auf dem Tab **Elemente bearbeiten** können Sie Theme-Typen anzeigen und hinzufügen sowie die Theme-Elemente des ausgewählten Typs anzeigen und bearbeiten.
zh_tw: 按一下**Manage Items**按鈕會打開**Manage Theme Items**對話方塊。在**Edit Items**分頁中，您可以查看和新增主題型別，以及查看和編輯所選型別的主題專案。

source: You can create, rename and remove individual theme items here by clicking the corresponding **Add X Item** and specifying their name. You can also mass delete theme items either by their data type (using the brush icon in the list) or by their quality. **Remove Class Items** will remove all built-in theme items you have customized for a control node type. **Remove Custom Items** will remove all the custom theme items for the selected type. Finally, **Remove All Items** will remove everything from the type.
de: Sie können hier einzelne Theme-Elemente erstellen, umbenennen und entfernen, indem Sie auf das entsprechende **X-Element hinzufügen** klicken und den Namen angeben. Sie können auch Theme-Elemente entweder nach ihrem Datentyp (über das Pinselsymbol in der Liste) oder nach ihrer Qualität in großem Umfang löschen. Mit **Klassenelemente entfernen** werden alle Built-in-Theme-Elemente entfernt, die Sie für einen Control-Node-Typ angepasst haben. Mit **Benutzerdefinierte Elemente entfernen** werden alle benutzerdefinierten Theme-Elemente für den ausgewählten Typ entfernt. Schließlich werden mit **Alle Elemente entfernen** alle Elemente des Typs entfernt.
zh_tw: 你可以通過點擊相應的 **Add X Item** 並指定其名稱，建立、重命名和刪除單個主題專案。你也可以按資料型別（使用列表中的畫筆圖示）或按品質批量刪除主題項。**Remove Class Items**將刪除你為一個控制節點型別定制的所有內建主題專案。**Remove Custom Items**將刪除所選型別的所有自訂主題專案。\\\\**Remove All Items**將刪除該型別的所有專案。

source: From the **Import Items** tab you can import theme items from other themes. You can import items from the default Godot theme, the Godot editor theme, or another custom theme. You can import individual or multiple items, and you can decide whether to copy or omit their data as well. There are several ways you can select and deselect the items, including by hand, by hierarchy, by data type, and everything. Opting to include the data will copy all theme items as they are to your theme. Omitting the data will create the items of the corresponding data type and name, but will leave them empty, creating a template of a theme in a way.
de: Auf dem Tab **Elemente importieren** können Sie Theme-Elemente aus anderen Themes importieren. Sie können Elemente aus dem Default-Godot-Theme, dem Godot-Editor-Theme oder einem anderen benutzerdefinierten Theme importieren. Sie können einzelne oder mehrere Elemente importieren und entscheiden, ob Sie deren Daten kopieren oder weglassen wollen. Es gibt mehrere Möglichkeiten, die Elemente auszuwählen und die Auswahl aufzuheben, z.B. von Hand, nach Hierarchie, nach Datentyp und nach allem. Wenn Sie sich dafür entscheiden, die Daten einzuschließen, werden alle Theme-Elemente so, wie sie sind, in Ihr Theme kopiert. Wenn Sie die Daten weglassen, werden die Elemente mit dem entsprechenden Datentyp und Namen erstellt, bleiben aber leer, so dass gewissermaßen eine Vorlage für ein Theme entsteht.
zh_tw: 從**Import Items**\\\\分頁，你可以從其他主題匯入主題專案.你可以從Godot預設主題匯入專案，如Godot編輯器主題或者其他自訂主題.你可以匯入單個或多個專案並選擇匯入或忽略他們的資料.有幾種選擇專案的放大，包括手動、按結構層次、按資料型別等等.選擇包括資料將複製所有專案到你的主題.忽略資料將建立具有相應資料型別和名稱的專案，但是他們會保存為空，以所指定的方式建立了範本.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
