Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_skinning.po
Languages: de, zh_tw

source: Instead of changing the project setting you can set the custom theme resource to the root-most control node of your entire UI branch to almost the same effect. While in the running project it will behave as expected, individual scenes will still display using the default theme when previewing or running them directly. To fix that you can set the same theme resource to the root control of each individual scene.
de: Anstatt die Projekteinstellung zu ändern, können Sie die Ressource für das benutzerdefinierte Theme auf den obersten Control-Node Ihres gesamten UI-Zweigs setzen, um fast denselben Effekt zu erzielen. Während es sich im laufenden Projekt wie erwartet verhält, werden einzelne Szenen immer noch mit dem Default-Theme angezeigt, wenn sie in der Vorschau angezeigt oder direkt ausgeführt werden. Um dies zu beheben, können Sie dieselbe Theme-Ressource auf das Root-Control jeder einzelnen Szene setzen.
zh_tw: 計畫設定作為一種變化的替代手段，可以讓你通過設定自訂主題資源對幾乎整個UI分支中的根控制項節點做出相同的影響. 然而運作計畫專案時可以充當預期效果展示,當單獨場景直接預覽或者運作時還將使用預設主題展示。為了解決這個問題你可以為每一個單獨場景中的根控制項設定相同的主題資源.

source: For example, you can have a certain style for buttons in your project theme, but want a different look for buttons inside of a popup dialog. You can set a custom theme resource to the root control of your popup and define a different style for buttons within that resource. As long as the chain of control nodes between the root of the popup and the buttons is uninterrupted, those buttons will use the styles defined in the theme resource that is closest to them. All other controls will still be styled using the project-wide theme and the default theme styles.
de: Sie können zum Beispiel einen bestimmten Stil für Buttons in Ihrem Projektthema haben, aber ein anderes Aussehen für Buttons innerhalb eines Popup-Dialogs wünschen. Sie können eine benutzerdefinierte Theme-Ressource auf das Root-Control Ihres Popups setzen und einen anderen Stil für die Buttons innerhalb dieser Ressource definieren. Solange die Kette der Control-Nodes zwischen dem Root des Popups und den Buttons nicht unterbrochen ist, verwenden diese Buttons die Stile, die in der Theme-Ressource definiert sind, die ihnen am nächsten ist. Alle anderen Controls werden weiterhin mit dem projektweiten Thema und den Default-Theme-Stilen formatiert.
zh_tw: 例如，你可以在專案主題中為按鈕設定特定的樣式，希望在彈出對話方塊中的按鈕又有不同的外觀。你可以為快顯視窗的根控制項設定自訂主題資源，並在該資源中為按鈕定義不同的樣式。只要快顯視窗的根控制項和按鈕之間的節點鏈不中斷，這些按鈕就會使用最接近它們的主題資源中定義的樣式。所有其他控制項仍將使用整個專案的主題和預設的主題樣式。

source: To sum it up, for an arbitrary control its theme item lookup would look something like this:
de: Zusammenfassend lässt sich sagen, dass für ein beliebiges Control das Aussehen der Theme-Elemente etwa so ablaufen würde:
zh_tw: 寶石計數器看起來應該長這樣

source: Check for local overrides of the same data type and name.
de: Prüfung auf lokale Überschreibungen desselben Datentyps und Namens.
zh_tw: 檢查相同資料型別和名稱的本地重寫。

source: Using control's type variation, class name and parent class names:
de: Verwenden der Typvariation des Controls, des Klassennamens und der Namen der Parent-Klassen:
zh_tw: 使用控制項的類別名稱和父類別名稱：

source: Check every control starting from itself and see if it has a theme property set;
de: Überprüfen jedes Controls, beginnend mit sich selbst, ob es eine Theme-Property hat;
zh_tw: 從自身開始檢查每個控制項，看看它是否設定了主題屬性;

source: If it does, check that theme for the matching item of the same name, data and theme type;
de: Wenn dies der Fall ist, wird dieses Theme nach dem passenden Element mit demselben Namen, denselben Daten und demselben Theme-Typ überprüft;
zh_tw: 如果設定了，就在該主題中搜尋名稱、資料、主題型別都相同的專案;

source: If there is no custom theme or it doesn't have the item, move to the parent control;
de: Wenn es kein benutzerdefiniertes Theme gibt oder das Element nicht vorhanden ist, wird zum Parent-Control gewechselt;
zh_tw: 如果沒有自訂主題，或者主題中沒有配對的條目，就前往父控制項;

source: Repeat steps a-c. until the root of the tree is reached, or a non-control node is reached.
de: Wiederholen der Schritte a-c, bis die Wurzel des Baums erreicht ist oder ein Nicht-Control-Node erreicht ist.
zh_tw: 重複步驟 a 至 c，到場景樹的根節點或者非控制項節點為止。

source: Using control's type variation, class name and parent class names check the project-wide theme, if it's present.
de: Anhand der Typvariation des Controls, des Klassennamens und der Namen der Parent-Klassen wird das projektweite Theme überprüft, sofern es vorhanden ist.
zh_tw: 如果存在專案範圍的主題，就在這個主題中搜尋控制項的類別名稱。

source: Using control's type variation, class name and parent class names check the default theme.
de: Mit der Typvariation des Controls, des Klassennamen und der Namen der Parent-Klassen wird das Default-Theme überprüft.
zh_tw: 在預設主題中搜尋控制項的類別名稱。

source: Even if the item doesn't exist in any theme, a corresponding default value for that data type will be returned.
de: Selbst wenn das Element in keinem Theme vorhanden ist, wird ein entsprechender Default-Wert für diesen Datentyp zurückgegeben.
zh_tw: 即便所有主題中都不存在對應的專案，也會返回一個針對該資料型別的預設值。

source: Beyond controls
de: Jenseits von Controls
zh_tw: 超越控制項

source: Naturally, themes are an ideal type of resource for storing configuration for something visual. While the support for theming is built into control nodes, other nodes can use them as well, just like any other resource.
de: Natürlich sind Themes eine ideale Art von Ressource, um die Konfiguration für etwas Visuelles zu speichern. Während die Unterstützung für das Theme in Control-Nodes integriert ist, können andere Nodes sie ebenfalls verwenden, genau wie jede andere Ressource.
zh_tw: 主題是一種用來保存視覺效果配置的理想資源，也非常合理。雖然其他節點並沒有像控制項節點一樣內建針對主題的支援，但還是可以和使用其他資源一樣來使用主題。

source: An example of using themes for something beyond controls can be a modulation of sprites for the same units on different teams in a strategy game. A theme resource can define a collection of colors, and sprites (with a help from scripts) can use those colors to draw the texture. The main benefit being that you could make different themes using the same theme items for red, blue, and green teams, and swap them with a single resource change.
de: Ein Beispiel für die Verwendung von Themes für etwas, das über die Steuerung hinausgeht, kann die Veränderung von Sprites für dieselben Einheiten in verschiedenen Teams in einem Strategiespiel sein. Eine Theme-Ressource kann eine Sammlung von Farben definieren, und Sprites können (mit Hilfe von Skripten) diese Farben verwenden, um die Textur zu zeichnen. Der Hauptvorteil besteht darin, dass man verschiedene Themes mit denselben Theme-Elementen für rote, blaue und grüne Teams erstellen und sie mit einer einzigen Ressourcenänderung austauschen kann.
zh_tw: 舉個非控制項使用主題的例子：在策略遊戲中，相同單位需要根據隊伍的不同而使用不同顏色的精靈。可以在主題資源中定義顏色的合集，精靈（在腳本的幫助下）就可以使用這些顏色來繪製紋理。這樣做的最大好處是可以為紅綠藍隊製作不同的主題但使用相同的主題專案，切換隊伍只需要替換資源就可以了。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
