Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_containers.po
Languages: de, zh_tw

source: Using Containers
de: Verwendung von Containern
zh_tw: 使用容器

source: :ref:`Anchors <doc_size_and_anchors>` are an efficient way to handle different aspect ratios for basic multiple resolution handling in GUIs.
de: :ref:`Anker <doc_size_and_anchors>` sind ein effizienter Weg, um verschiedene Seitenverhältnisse für die grundlegende Handhabung mehrerer Auflösungen in GUIs zu handhaben.

source: For more complex user interfaces, they can become difficult to use.
de: Bei komplexeren Benutzeroberflächen kann die Verwendung schwierig werden.
zh_tw: 對於更複雜的使用者介面, 它們可能會變得難以使用.

source: This is often the case of games, such as RPGs, online chats, tycoons or simulations. Another common case where more advanced layout features may be required is in-game tools (or simply just tools).
de: Dies ist häufig der Fall bei Spielen wie RPGs, Online-Chats, Tycoons oder Simulationen. Ein weiterer häufiger Fall, in dem erweiterte Layout-Funktionen erforderlich sein können, sind In-Game-Tools (oder einfach nur Tools).
zh_tw: 這通常是遊戲的情況下, 如角色扮演類, 線上聊天, 大富翁類或模擬類遊戲. 另一個需要更高級佈局功能的常見情況是遊戲內工具(或者僅僅是工具).

source: All these situations require a more capable OS-like user interface, with advanced layout and formatting. For that, :ref:`Containers <class_container>` are more useful.
de: All diese Situationen erfordern eine leistungsfähigere, OS-ähnliche Benutzeroberfläche mit fortgeschrittenem Layout und Formatierung. Hierfür sind :ref:`Container <class_container>` nützlicher.
zh_tw: 這些情況需要一個更強大的類似作業系統的使用者介面，具有先進的佈局和格式。用 :ref:`Container <class_container>` 會更方便。

source: Containers provide a huge amount of layout power (as an example, the Godot editor user interface is entirely done using them):
de: Container bieten eine riesige Menge an Layout-Möglichkeiten (die Benutzeroberfläche des Godot-Editors ist zum Beispiel vollständig mit Containern gestaltet):
zh_tw: 容器提供了巨大的佈局能力(例如,Godot編輯器的使用者介面就是完全使用它們完成的):

source: When a :ref:`Container <class_Container>`-derived node is used, all children :ref:`Control <class_Control>` nodes give up their own positioning ability. This means the *Container* will control their positioning and any attempt to manually alter these nodes will be either ignored or invalidated the next time their parent is resized.
de: Wenn ein von :ref:`Container <class_Container>` abgeleiteter Node verwendet wird, geben alle untergeordneten :ref:`Control <class_Control>`-Nodes ihre eigene Positionierungsfähigkeit auf. Das bedeutet, dass der *Container* ihre Positionierung kontrolliert und jeder Versuch, diese Nodes manuell zu verändern, wird ignoriert oder bei der nächsten Größenänderung des Parent-Nodes ungültig gemacht.
zh_tw: 當使用 :ref:`Container <class_Container>` 衍生的節點時，所有作為子項的 :ref:`Control <class_Control>` 節點都會放棄自我定位能力。這意味著*容器*將控制它們的位置，任何手動更改這些節點的嘗試，都將在它們的父節點下一次調整大小時被忽略或失效。

source: Likewise, when a *Container* derived node is resized, all its children will be re-positioned according to it, with a behavior based on the type of container used:
de: Wenn ein von *Container* abgeleiteter Node in der Größe verändert wird, werden alle seine Child-Nodes entsprechend neu positioniert, wobei das Verhalten vom Typ des verwendeten Containers abhängt:
zh_tw: 同樣，調整 *Container* 衍生節點的大小時，它的所有子節點都將根據它重新定位，其行為基於所用的容器型別：

source: Example of *HBoxContainer* resizing children buttons.
de: Beispiel für *HBoxContainer*, der die Größe der Child-Buttons ändert.
zh_tw: *HBoxContainer* 調整子按鈕大小的例子。

source: The real strength of containers is that they can be nested (as nodes), allowing the creation of very complex layouts that resize effortlessly.
de: Die wahre Stärke von Containern liegt darin, dass sie (als Nodes) verschachtelt werden können, was die Erstellung sehr komplexer Layouts ermöglicht, die sich mühelos in der Größe verändern lassen.
zh_tw: 容器的真正優勢在於它們可以巢狀(作為節點), 允許建立非常複雜的佈局, 調整毫不費力.

source: Sizing options
de: Optionen zur Größenanpassung
zh_tw: 大小選項

source: When adding a node to a container, the way the container treats each child depends mainly on their *container sizing options*. These options can be found by inspecting the layout of any *Control* that is a child of a *Container*.
de: Wenn Sie einen Node zu einem Container hinzufügen, hängt die Art und Weise, wie der Container jeden Child-Node behandelt, hauptsächlich von den *Container-Größenanpassungs-Optionen* ab. Diese Optionen lassen sich ermitteln, indem man das Layout jedes *Controls* im Inspektor untersucht, das ein Child-Node eines *Containers* ist.
zh_tw: 當向容器新增節點時, 容器對待每個子元素的方式, 主要取決於它們的 *size flags尺寸標記* . 通過檢查 *容器* 的子控制項, 可以找到這些標記.

source: Sizing options are independent for vertical and horizontal sizing and not all containers make use of them (but most do):
de: Die Größenanpassungs-Optionen sind für die jeweils unabhängig für die vertikale und horizontale Größenanpassung und werden nicht von allen Containern genutzt (aber von den meisten):
zh_tw: 尺寸標記獨立於垂直和水平尺寸, 並不是所有容器都使用它們(但大多數容器都使用):

source: **Fill**: Ensures the control *fills* the designated area within the container. No matter if a control *expands* or not (see below), it will only *fill* the designated area when this is toggled on (it is by default).
de: **Füllen**: Stellt sicher, dass das Control den vorgesehenen Bereich innerhalb des Containers *ausfüllt*. Unabhängig davon, ob ein Control *expandiert* oder nicht (siehe unten), füllt es den vorgesehenen Bereich nur dann aus, wenn diese Option aktiviert ist (Default).
zh_tw: **Fill填充** : 確保控制項 *fills填充* 容器內指定的區域. 無論控制項是否 *expands擴充* (見下面), 當此選項被選中時(預設情況), 只 *填充* 指定區域.

source: **Expand**: Attempts to use as much space as possible in the parent container (in each axis). Controls that don't expand will be pushed away by those that do. Between expanding controls, the amount of space they take from each other is determined by the *Stretch Ratio* (see below). This option is only available when the parent Container is of the right type, for example the *HBoxContainer* has this option for horizontal sizing.
de: **Expandieren**: Versucht, so viel Platz wie möglich im Parent-Container (in jeder Achse) zu nutzen. Controls, die nicht expandieren, werden von denen verdrängt, die expandieren. Zwischen den expandierenden Controls wird die Menge an Platz, die sie voneinander wegnehmen, durch das *Streckungsverhältnis* (siehe unten) bestimmt. Diese Option ist nur verfügbar, wenn der Parent-Container vom richtigen Typ ist, z.B. hat der *HBoxContainer* diese Option für die horizontale Größenanpassung.
zh_tw: **Expand擴充** : 試圖在父容器中盡可能多地使用空間(在每個軸中). 不展開的控制項會被展開的控制項推開. 在擴充的控制項之間, 它們相互佔用的空間大小由 *Ratio* 決定(見下文).

source: **Shrink Begin** When expanding, try to remain at the left or top of the expanded area.
de: **Zum Anfang verkleinern** Versucht beim Expandieren, am linken oder oberen Rand des expandierten Bereichs zu bleiben.
zh_tw: **Shrink Center收縮中心** 當擴充時(如果不填充), 儘量保持在擴充區域的中心(預設情況下, 它仍然位於左側或頂部).

source: **Shrink Center** When expanding, try to remain at the center of the expanded area.
de: **Zur Mitte schrumpfen** Versucht beim Expandieren, in der Mitte des expandierten Bereichs zu bleiben.
zh_tw: **Shrink Center收縮中心** 當擴充時(如果不填充), 儘量保持在擴充區域的中心(預設情況下, 它仍然位於左側或頂部).

source: **Shrink End** When expanding, try to remain at the right or bottom of the expanded area.
de: **Zum Ende Schrumpfen** Versucht, beim Expandieren am rechten oder unteren Rand des expandierten Bereichs zu bleiben.
zh_tw: **Shrink Center收縮中心** 當擴充時(如果不填充), 儘量保持在擴充區域的中心(預設情況下, 它仍然位於左側或頂部).

source: **Stretch Ratio**: The ratio of how much expanded controls take up the available space in relation to each other. A control with "2", will take up twice as much available space as one with "1".
de: **Streckungsverhältnis**: Das Verhältnis, in dem die erweiterten Controls den verfügbaren Platz im Verhältnis zueinander einnehmen. Ein Control mit "2" nimmt doppelt so viel Platz ein wie eines mit "1".
zh_tw: **Ratio比例** 擴充控制項之間, 相互佔用可用空間的簡單比例. 一個比例為 "2" 的控制項, 將佔用比例為 "1" 控制項的兩倍可用空間.

source: Experimenting with these flags and different containers is recommended to get a better grasp on how they work.
de: Es empfiehlt sich, mit diesen Flaggen und verschiedenen Behältern zu experimentieren, um die Funktionsweise besser zu verstehen.
zh_tw: 建議使用這些標記和不同的容器進行試驗, 以便更好地瞭解它們是如何工作的.

source: Container types
de: Containertypen
zh_tw: 容器型別

source: Godot provides several container types out of the box as they serve different purposes:
de: Godot stellt verschiedene Containertypen zur Verfügung, da diese unterschiedlichen Zwecken dienen:
zh_tw: Godot提供了幾種開箱即用的容器型別, 因為它們有不同的用途:

source: Box Containers
de: Box-Container
zh_tw: 盒式容器

source: Arranges child controls vertically or horizontally (via :ref:`HBoxContainer <class_HBoxContainer>` and :ref:`VBoxContainer <class_VBoxContainer>`). In the opposite of the designated direction (as in, vertical for an horizontal container), it just expands the children.
de: Ordnet Child-Controls vertikal oder horizontal an (über :ref:`HBoxContainer <class_HBoxContainer>` und :ref:`VBoxContainer <class_VBoxContainer>`). In der entgegengesetzten Richtung (z. B. vertikal für einen horizontalen Container) werden die Child-Controls einfach erweitert.
zh_tw: 將子控制項垂直或者水平排列（使用 :ref:`HBoxContainer <class_HBoxContainer>` 和 :ref:`VBoxContainer <class_VBoxContainer>` ）。而在相對方向上（比如水平容器的垂直方向），子節點會被擴充。

source: These containers make use of the *Ratio* property for children with the *Expand* flag set.
de: Diese Container verwenden die *Ratio*-Property für Child-Nodes, bei denen das *Expandieren*-Flag gesetzt ist.
zh_tw: 這些容器會用到設定了 *Expand（擴充）* 選項的子節點的 *Ratio（比例）* 屬性。

source: Grid Container
de: Raster-Container
zh_tw: 網格容器

source: Arranges child controls in a grid layout (via :ref:`GridContainer <class_GridContainer>`, amount of columns must be specified). Uses both the vertical and horizontal expand flags.
de: Ordnet Child-Controls in einem Raster-Layout an (über :ref:`GridContainer <class_GridContainer>`, Anzahl der Spalten muss angegeben werden). Verwendet sowohl die vertikalen als auch die horizontalen Expandieren-Flags.
zh_tw: 將子控制項按照網格排列（使用 :ref:`GridContainer <class_GridContainer>` ，必須指定列數），會同時用到垂直和水平擴充選項。

source: Margin Container
de: Seitenrand-Container
zh_tw: 邊距容器

source: Child controls are expanded towards the bounds of this control (via :ref:`MarginContainer <class_MarginContainer>`). Padding will be added on the margins depending on the theme configuration.
de: Child-Controls werden in Richtung der Ränder dieses Controls erweitert (über :ref:`MarginContainer <class_MarginContainer>`). Abhängig von der Konfiguration des Themes wird an den Seitenrändern ein Padding hinzugefügt.
zh_tw: 將子節點擴充到該控制項的邊界（使用 :ref:`MarginContainer <class_MarginContainer>` ），會根據主題的設定來新增不同大小的邊距。

source: Again, keep in mind that the margins are a *Theme* value, so they need to be edited from the constants overrides section of each control:
de: Beachten Sie auch hier, dass die Seitenränder ein *Theme*-Wert sind, sodass sie im Abschnitt zum Überschreiben von Konstanten jedes Controls bearbeitet werden müssen:
zh_tw: 同樣, 請記住, 邊距是一個 *Theme* 值, 所以它們需要從每個控制項的常數重寫部分進行編輯:

source: Allows you to place several child controls stacked on top of each other (via :ref:`TabContainer <class_TabContainer>`), with only the *current* one visible.
de: Ermöglicht es Ihnen, mehrere untergeordnete Controls übereinander zu platzieren (über :ref:`TabContainer <class_TabContainer>`), wobei nur das *aktuelle* Control sichtbar ist.
zh_tw: 允許你將多個子控制項堆疊在一起（使用 :ref:`TabContainer <class_TabContainer>` ），只會顯示 *目前* 控制項。

source: Changing the *current* one is done via tabs located at the top of the container, via clicking:
de: Das Ändern des *aktuellen* Controls erfolgt über den Tab oben im Container, den Sie anklicken können:
zh_tw: 點擊容器頂部的分頁可以更改 *目前* 控制項：

source: The titles are generated from the node names by default (although they can be overridden via *TabContainer* API).
de: Die Titel werden standardmäßig aus den Namen der Nodes generiert (sie können jedoch über die *TabContainer*-API überschrieben werden).
zh_tw: 標題預設是根據節點名稱生成的（儘管可以通過 *TabContainer* 的 API 重寫）。

source: Settings such as tab placement and *StyleBox* can be modified in the *TabContainer* theme overrides.
de: Einstellungen wie die Platzierung der Tabs und die *StyleBox* können in den *TabContainer* Theme-Überschreibungen geändert werden.
zh_tw: 可以在 *TabContainer* 的主題覆蓋項中修改類似分頁位置和 *StyleBox* 等設定。

source: Accepts only one or two children controls, then places them side to side with a divisor (via :ref:`HSplitContainer <class_HSplitContainer>` and :ref:`VSplitContainer <class_VSplitContainer>`). Respects both horizontal and vertical flags, as well as *Ratio*.
de: Akzeptiert nur ein oder zwei Child-Controls und platziert sie dann mit einem Trenner nebeneinander (über :ref:`HSplitContainer <class_HSplitContainer>` und :ref:`VSplitContainer <class_VSplitContainer>`). Beachtet sowohl horizontale und vertikale Flags als auch *Verhältnis*.
zh_tw: 只接受單個或者兩個子控制項，會將它們相鄰放置，中間是分隔線（使用 :ref:`HSplitContainer <class_HSplitContainer>` 和 :ref:`VSplitContainer <class_VSplitContainer>` ），會使用到水平和垂直選項以及 *Ratio* 屬性。

source: The divisor can be dragged around to change the size relation between both children:
de: Der Trenner kann herumgeschoben werden, um die Größenbeziehung zwischen beiden Child-Elementen zu ändern:
zh_tw: 可以通過拖動分隔線來調整兩個子節點所占區域的大小：

source: A container that draws a *StyleBox*, then expands children to cover its whole area (via :ref:`PanelContainer <class_PanelContainer>`, respecting the *StyleBox* margins). It respects both the horizontal and vertical sizing options.
de: Ein Container, der eine *StyleBox* zeichnet und dann die Child-Nodes so erweitert, dass sie den gesamten Bereich abdecken (über :ref:`PanelContainer <class_PanelContainer>`, unter Berücksichtigung der *StyleBox*-Seitenränder). Er respektiert sowohl die horizontalen als auch die vertikalen Größenoptionen.
zh_tw: 繪製 *StyleBox* 的簡單容器，會將子節點擴大到整個區域（使用 :ref:`PanelContainer <class_PanelContainer>`，會考慮 *StyleBox* 的邊距）。它同時考慮水平和垂直尺寸旗標。

source: This container is useful as top-level, or just to add custom backgrounds to sections of a layout.
de: Dieser Container eignet sich für die oberste Ebene oder einfach nur, um Abschnitten eines Layouts benutzerdefinierte Hintergründe hinzuzufügen.
zh_tw: 這個容器作為頂層非常有用, 或者只是為佈局各個部分新增自訂背景.

source: Accepts a single child node. If this node is bigger than the container, scrollbars will be added to allow panning the node around (via :ref:`ScrollContainer <class_ScrollContainer>`). Both vertical and horizontal size options are respected, and the behavior can be turned on or off per axis in the properties.
de: Akzeptiert einen einzelnen Child-Node. Wenn dieser Node größer als der Container ist, werden Scrollbars hinzugefügt, um den Node zu verschieben (über :ref:`ScrollContainer <class_ScrollContainer>`). Sowohl vertikale als auch horizontale Größenoptionen werden beachtet, und das Verhalten kann in den Properys für jede Achse ein- oder ausgeschaltet werden.
zh_tw: 接受一個單獨的子節點. 如果這個節點比容器大, 將新增捲軸以允許移動節點（通過 :ref:`ScrollContainer <class_ScrollContainer>`）。垂直和水平尺寸旗標都會被遵守，該行為可以在屬性中的每個軸上打開或關閉.

source: Mouse wheel and touch drag (when touch is available) are also valid ways to pan the child control around.
de: Das Mausrad und Touch Drag (wenn Touch verfügbar ist) sind ebenfalls gültige Methoden, um das Child-Control zu verschieben.
zh_tw: 滑鼠滾輪和觸摸拖動(當觸摸可用時)也是平移子控制項的有效方法.

source: As in the example above, one of the most common ways to use this container is together with a *VBoxContainer* as child.
de: Wie im obigen Beispiel ist eine der häufigsten Arten, diesen Container gemeinsam mit einem *VBoxContainer* als dessen Child-Node zu verwenden.
zh_tw: 正如上面的例子中所展示的，使用此容器最常見的方法之一，是將 *VBoxContainer* 作為子容器一起使用。

source: A container type that arranges its child controls in a way that preserves their proportions automatically when the container is resized. (via :ref:`AspectRatioContainer <class_AspectRatioContainer>`). It has multiple stretch modes, providing options for adjusting the child controls' sizes concerning the container: "fill," "width control height," "height control width," and "cover."
de: Ein Containertyp, der seine Child-Controls so anordnet, dass ihre Proportionen automatisch erhalten bleiben, wenn die Größe des Containers geändert wird. (über :ref:`AspectRatioContainer <class_AspectRatioContainer>`). Es hat mehrere Stretch-Modi, die Optionen für die Anpassung der Größen der Child-Controls in Bezug auf den Container bieten: "fill", "width control height", "height control width" und "cover".

source: useful when you have a container that needs to be dynamic and responsive to different screen sizes, and you want the child elements to scale proportionally without losing their intended shapes.
de: nützlich, wenn Sie einen Container haben, der dynamisch sein und auf verschiedene Bildschirmgrößen reagieren muss, und Sie möchten, dass die Child-Elemente proportional skaliert werden, ohne dass sie ihre beabsichtigte Form verlieren.

source: FlowContainer is a container that arranges its child controls either horizontally or vertically, (via :ref:`HFlowContainer <class_HFlowContainer>` and via :ref:`VFlowContainer <class_VFlowContainer>`). and when the available space runs out, it wraps the children to the next line or column, similar to how text wraps in a book.
de: FlowContainer ist ein Container, der seine Child-Controls entweder horizontal oder vertikal anordnet (über :ref:`HFlowContainer <class_HFlowContainer>` und über :ref:`VFlowContainer <class_VFlowContainer>`). Wenn der verfügbare Platz erschöpft ist, werden die Child-Controls in die nächste Zeile oder Spalte umgebrochen, ähnlich wie beim Umbrechen von Text in einem Buch.

source: useful for creating flexible layouts where the child controls adjust automatically to the available space without overlapping.
de: nützlich für die Erstellung flexibler Layouts, bei denen sich die Child-Controls automatisch an den verfügbaren Platz anpassen, ohne sich zu überlappen.

source: CenterContainer is a container that automatically keeps all of its child controls centered within it at their minimum size. It ensures that the child controls are always aligned to the center, making it easier to create centered layouts without manual positioning. (via :ref:`CenterContainer <class_CenterContainer>`).
de: CenterContainer ist ein Container, der alle seine Child-Controls automatisch in ihrer Mindestgröße zentriert hält. Er stellt sicher, dass die Child-Controls immer in der Mitte ausgerichtet sind, was es einfacher macht, zentrierte Layouts ohne manuelle Positionierung zu erstellen. (über :ref:`CenterContainer <class_CenterContainer>`).

source: This is a special control that will only accept a single *Viewport* node as child, and it will display it as if it was an image (via :ref:`SubViewportContainer <class_SubViewportContainer>`).
de: Dies ist ein spezielles Control, das nur einen einzigen *Viewport*-Node als Child-Node akzeptiert und ihn wie ein Bild anzeigt (über :ref:`SubViewportContainer <class_SubViewportContainer>`).
zh_tw: 這是一個特殊的控制項，只接受單個 *Viewport* 節點作為子節點，並且會把它作為圖片顯示（使用 :ref:`ViewportContainer <class_ViewportContainer>`）。

source: Creating custom Containers
de: Erstellen benutzerdefinierter Container
zh_tw: 建立內容

source: It is possible to create a custom container using a script. Here is an example of a container that fits children to its rect size:
de: Es ist möglich, einen benutzerdefinierten Container mithilfe eines Skripts zu erstellen. Hier ist ein Beispiel eines Containers, der Child-Nodes an seine rechteckige Größe anpasst:
zh_tw: 可以使用腳本輕鬆地建立自訂容器。下面是一個簡單容器的例子，它會根據自身的矩形尺寸調整子節點：

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Container layout
zh_tw: 容器佈局

source: Tab Container
zh_tw: 分頁容器

source: Split Container
zh_tw: 拆分容器

source: SubViewportContainer
zh_tw: 建立內容
