Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: de, zh_tw

source: Using Fonts
de: Verwenden von Schriftarten
zh_tw: 建立內容

source: Godot allows you to set specific fonts for different UI nodes.
de: In Godot können Sie bestimmte Schriftarten für verschiedene UI-Nodes festlegen.
zh_tw: Godot 中能夠為不同的 UI 節點設定指定的字形。

source: There are three different places where you can setup font usage. The first is the theme editor. Choose the node you want to set the font for and select the font tab. The second is in the inspector for control nodes under **Theme Overrides > Fonts**. Lastly, in the inspector settings for themes under **Default Font**.
de: Es gibt drei verschiedene Stellen, an denen Sie die Verwendung von Schriften einstellen können. Der erste ist der Theme-Editor. Wählen Sie den Node, für den Sie die Schriftart festlegen möchten, und wählen Sie den Tab Schriftart. Der zweite ist im Inspektor für Control-Nodes unter **Theme Überschreibungen> Fonts**. Und schließlich im Inspektor für die Einstellungen von Themes unter **Default-Schriftart**.
zh_tw: 您可以在三個不同的位置設定字形使用。第一個是主題編輯器。選擇要為其設定字形的節點，然後選擇字形標籤。第二個位於 **Theme Overrides > Fonts** 下的控制節點屬性面板。最後，在**預設字形**下的主題屬性面板設定中。

source: If no font override is specified anywhere, `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold is used as the default project font.
de: Wenn nirgends eine Schriftartüberschreibung angegeben wird, wird `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold als Default-Projektschriftart verwendet.
zh_tw: 如果在任何地方都沒有指定字形覆蓋，則使用「Open Sans <https://fonts.google.com/specimen/Open+Sans>」__ SemiBold 作為預設專案字形。

source: Since Godot 4.0, font sizes are no longer defined in the font itself but are instead defined in the node that uses the font. This is done in the **Theme Overrides > Font Sizes** section of the inspector.
de: Seit Godot 4.0 werden die Schriftgrößen nicht mehr in der Schriftart selbst, sondern in dem Node definiert, der die Schriftart verwendet. Dies geschieht im Abschnitt **Theme-Überschreibungen > Schriftgrößen** des Inspektors.
zh_tw: 從 Godot 4.0 開始，字形大小不再在字形本身中定義，而是在使用該字形的節點中定義。這是在屬性面板的 **主題覆蓋 > 字形大小** 部分完成的。

source: This allows changing the font size without having to duplicate the font resource for every different font size.
de: Dadurch kann die Schriftgröße geändert werden, ohne dass die Schriftressource für jede unterschiedliche Schriftgröße dupliziert werden muss.
zh_tw: 這允許更改字形大小，而不必為每個不同的字形大小複製字形資源。

source: There are 2 kinds of font files: *dynamic* (TTF/OTF/WOFF/WOFF2 formats) and *bitmap* (BMFont ``.fnt`` format or monospaced image). Dynamic fonts are the most commonly used option, as they can be resized and still look crisp at higher sizes. Thanks to their vector-based nature, they can also contain a lot more glyphs while keeping a reasonable file size compared to bitmap fonts. Dynamic fonts also support some advanced features that bitmap fonts cannot support, such as *ligatures* (several characters transforming into a single different design).
de: Es gibt 2 Arten von Schriftdateien: *dynamische* (TTF/OTF/WOFF/WOFF2-Formate) und *Bitmap* (BMFont ``.fnt``-Format oder monospaced image). Dynamische Schriftarten werden am häufigsten verwendet, da sie in der Größe verändert werden können und auch in größeren Formaten noch klar und deutlich aussehen. Dank ihres vektorbasierten Charakters können sie auch viel mehr Glyphen enthalten und dabei eine vernünftige Dateigröße im Vergleich zu Bitmap-Schriften beibehalten. Dynamische Schriftarten unterstützen auch einige fortgeschrittene Funktionen, die Bitmap-Schriftarten nicht unterstützen können, wie z.B. *Ligaturen* (mehrere Zeichen, die sich in ein einziges separates Design verwandeln).
zh_tw: 有兩種字型檔案：*動態*（TTF/OTF/WOFF/WOFF2 格式）和*點陣圖*（BMFont ``.fnt`` 格式或等寬影像）。動態字形是最常用的選項，因為它們可以調整大小，並且在較大尺寸下仍然看起來清晰。由於其基於向量的性質，與點陣字形相比，它們還可以包含更多的字形，同時保持合理的檔案大小。動態字形也支援點陣字形無法支援的一些進階功能，例如*連字*（多個字元轉換為單一不同的設計）。

source: You can find freely licensed font files on websites such as `Google Fonts <https://fonts.google.com/>`__ and `Font Library <https://fontlibrary.org/>`__.
de: Sie können frei lizenzierte Schriftdateien auf Websites wie `Google Fonts <https://fonts.google.com/>`__ und `Font Library <https://fontlibrary.org/>`__ finden.
zh_tw: 您可以在「Google Fonts <https://fonts.google.com/>」和「Font Library <https://fontlibrary.org/>」等網站上找到免費授權的字型檔案。

source: Fonts are covered by copyright. Double-check the license of a font before using it, as not all fonts allow commercial use without purchasing a license.
de: Schriftarten unterliegen dem Urheberrecht. Überprüfen Sie die Lizenz einer Schriftart, bevor Sie sie verwenden, da nicht alle Schriftarten die kommerzielle Nutzung ohne den Erwerb einer Lizenz erlauben.
zh_tw: 字形受版權保護。使用字形之前請仔細檢查字形的許可證，因為並非所有字形都允許在不購買許可證的情況下進行商業使用。

source: You can see how fonts work in action using the `BiDI and Font Features demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
de: Sie können sehen, wie Schriftarten in Aktion funktionieren, indem Sie das `BiDI and Font Features demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__ verwenden.
zh_tw: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Dynamic fonts
de: Dynamische Schriftarten
zh_tw: 動態性

source: Godot supports the following dynamic font formats:
de: Godot unterstützt die folgenden dynamischen Schriftformate:
zh_tw: Godot 支援下列 3D **場景檔案格式** ：

source: TrueType Font or Collection (``.ttf``, ``.ttc``)
de: TrueType-Schriftart oder -Collection (``.ttf``, ``.ttc``)
zh_tw: TrueType 字形或合集（``.ttf``、``.ttc``）

source: OpenType Font or Collection (``.otf``, ``.otc``)
de: OpenType Schriftart oder -Collection (``.otf``, ``.otc``)
zh_tw: OpenType 字形或合集（``.otf``、``.otc``）

source: Web Open Font Format 2 (``.woff2``, since Godot 3.5)
de: Web Open Font Format 2 (``.woff2``, ab Godot 3.5)
zh_tw: Web 開放字形格式 2（``.woff2``，從 Godot 3.5 開始支援）

source: While ``.woff`` and especially ``.woff2`` tend to result in smaller file sizes, there is no universally "better" font format. In most situations, it's recommended to use the font format that was shipped on the font developer's website.
de: Obwohl ``.woff`` und vor allem ``.woff2`` tendenziell zu kleineren Dateigrößen führen, gibt es kein allgemein "besseres" Schriftformat. In den meisten Fällen ist es empfehlenswert, das Schriftformat zu verwenden, das auf der Website des Schriftart-Entwicklers angeboten wird.
zh_tw: 雖然“.woff”，特別是“.woff2”往往會導致較小的檔案大小，但沒有普遍“更好”的字形格式。在大多數情況下，建議使用字形開發人員網站上提供的字形格式。

source: Bitmap fonts
de: Bitmap-Schriftarten
zh_tw: 點陣字型

source: Godot supports the BMFont (``.fnt``) bitmap font format. This is a format created by the `BMFont <https://www.angelcode.com/products/bmfont/>`__ program. Many BMFont-compatible programs also exist, like `BMGlyph <https://www.bmglyph.com/>`__.
de: Godot unterstützt das BMFont (``.fnt``) Bitmap-Schriftformat. Dieses Format wurde von dem Programm `BMFont <https://www.angelcode.com/products/bmfont/>`__ erstellt. Es gibt auch viele BMFont-kompatible Programme, wie `BMGlyph <https://www.bmglyph.com/>`__.
zh_tw: Godot 支援 BMFont (``.fnt``) 點字字形格式。這是由 `BMFont <https://www.angelcode.com/products/bmfont/>`__ 程式所建立的格式。也存在許多 BMFont 相容程式，例如「BMGlyph <https://www.bmglyph.com/>」。

source: Alternatively, you can import any image to be used as a bitmap font. This is only supported for **monospaced** fonts (fonts where each character has the same width). To do so, select the image in the FileSystem dock, go to the Import dock, change its import type to **Font Data (Monospace Image Font)** then click **Reimport**:
de: Alternativ können Sie auch ein beliebiges Bild importieren, das als Bitmap-Schriftart verwendet werden soll. Dies wird nur für **Monospaced**-Schriftarten unterstützt (Schriftarten, bei denen jedes Zeichen die gleiche Breite hat). Wählen Sie dazu das Bild im "Dateisystem"-Dock aus, wechseln Sie zum "Importieren"-Dock, ändern Sie den Importtyp in **Schriftdaten (Monospace Image Font)** und klicken Sie auf **Neu importieren**:
zh_tw: 或者，您可以匯入任何圖像以用作點陣字形。僅支援**等寬**字形（每個字元具有相同寬度的字形）。為此，請在檔案系統擴充座中選擇圖像，請前往匯入擴充塢，將其匯入型別變更為 **字形資料（等寬影像字形）**，然後按一下 **重新匯入**：

source: Changing import type to Font Data (Monospace Image Font)
de: Ändern des Importtyps in Schriftartdaten (Monospace Image Font)
zh_tw: 將匯入型別變更為字形資料（等寬圖像字形）

source: Changing import type to **Font Data (Monospace Image Font)**
de: Ändern der Importart in **Schriftarten (Monospace Image Font)**
zh_tw: 將匯入型別變更為 **字形資料（等寬圖像字形）**

source: The font's character set layout can be in any order, but orders that match standard Unicode are recommended as they'll require far less configuration to import. For example, the bitmap font below contains `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ characters and follows standard ASCII ordering:
de: Das Layout der Schriftart kann in beliebiger Reihenfolge sein, aber es wird empfohlen, eine Reihenfolge zu wählen, die dem Unicode-Standard entspricht, da sie weit weniger Konfiguration für den Import erfordert. Die nachstehende Bitmap-Schriftart enthält zum Beispiel `ASCII <https://en.wikipedia.org/wiki/ASCII>`__-Zeichen und folgt der ASCII-Standardreihenfolge:
zh_tw: 字形的字元集佈局可以採用任何順序，但建議使用與標準 Unicode 相符的順序，因為匯入它們所需的配置要少得多。例如，下面的點陣圖字形包含 `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ 字元並遵循標準 ASCII 排序：

source: Bitmap font example
de: Beispiel einer Bitmap-Schriftart
zh_tw: 在下方範例中：

source: Credit: `LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ (scaled and cropped to exclude extended range)
de: Quelle: `LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ (skaliert und beschnitten, um den erweiterten Bereich auszuschließen)
zh_tw: 圖片來源：`LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__（縮放和裁剪以排除擴充範圍）

source: The following import options can be used to import the above font image successfully:
de: Die folgenden Importoptionen können verwendet werden, um das obige Schriftart-Bild erfolgreich zu importieren:
zh_tw: 這個節點有如下屬性可供設定：

source: Import options to use for the above example font
de: Importoptionen für die obige Beispielschriftart
zh_tw: 用於上述範例字形的匯入選項

source: The **Character Ranges** option is an array that maps each position on the image (in tile coordinates, not pixels). The font atlas is traversed from left to right and top to bottom. Characters can be specified with decimal numbers (``127``), hexadecimal numbers (``0x007f``) or between *single* quotes (``'~'``). Ranges can be specified with a hyphen between characters.
de: Die Option **Zeichenbereiche** ist ein Array, das jede Position im Bild abbildet (in Kachelkoordinaten, nicht in Pixeln). Der Schriftart-Atlas wird von links nach rechts und von oben nach unten durchlaufen. Zeichen können mit Dezimalzahlen (``127``), Hexadezimalzahlen (``0x007f``) oder zwischen *einfachen* Anführungszeichen (``'~'``) angegeben werden. Bereiche können mit einem Bindestrich zwischen den Zeichen angegeben werden.
zh_tw: **字元範圍**選項是一個對應影像上每個位置的陣列（以圖塊座標，而不是像素為單位）。字形合集是從左到右、從上到下走訪的。字元可以用十進位數字（``127``）、十六進位數字（``0x007f``）或*單*引號（``'~'``）之間指定。可以使用字元之間的連字符指定範圍。

source: For instance, ``0-127`` (or ``0x0000-0x007f``) denotes the full ASCII range. As another example, ``' '-'~'`` is equivalent to ``32-127`` and denotes the range of *printable* (visible) ASCII characters.
de: Zum Beispiel bezeichnet ``0-127`` (oder ``0x0000-0x007f``) den gesamten ASCII-Bereich. Ein anderes Beispiel: ``' '-'~'`` ist gleichbedeutend mit ``32-127`` und bezeichnet den Bereich der *druckbaren* (sichtbaren) ASCII-Zeichen.
zh_tw: 例如，「0-127」（或「0x0000-0x007f」）表示完整的 ASCII 範圍。另一個例子，``''-'~'`` 等價於``32-127`` 並表示*可列印*（可見）ASCII 字元的範圍。

source: Make sure the **Character Ranges** option doesn't exceed the number of **Columns** × **Rows** defined. Otherwise, the font will fail to import.
de: Stellen Sie sicher, dass die Option **Zeichenbereiche** die Anzahl der definierten **Spalten** × **Zeilen** nicht überschreitet. Andernfalls wird die Schriftart nicht importiert.
zh_tw: 確保**字元範圍**選項不超過定義的**列** × **行**的數量。否則，字形將無法匯入。

source: If your font image contains margins not used for font glyphs (such as attribution information), try adjusting **Image Margin**. This is a margin applied only once around the whole image.
de: Wenn Ihr Schriftart-Bild Ränder enthält, die nicht für Schriftglyphen verwendet werden (wie z.B. Attributinformationen), versuchen Sie, den **Bild-Seitenrand** anzupassen. Dies ist ein Seitenrand, der nur einmal um das gesamte Bild herum angewendet wird.
zh_tw: 如果您的字形圖像包含未用於字形字形的邊距（例如屬性資訊），請嘗試調整**圖像邊距**。這是在整個影像周圍僅應用一次的邊距。

source: If your font image contains guides (in the form of lines between glyphs) or if spacing between characters appears incorrect, try adjusting **Character Margin**. This margin is applied for every imported glyph.
de: Wenn Ihre Schriftart Hilfslinien (in Form von Linien zwischen Glyphen) enthält oder wenn die Abstände zwischen den Zeichen nicht korrekt erscheinen, versuchen Sie, den **Zeichen-Seitenrand** anzupassen. Dieser Seitenrand wird für jede importierte Glyphe angewendet.
zh_tw: 如果您的字形影像包含參考線（以字形之間的線條形式）或字元之間的間距看起來不正確，請嘗試調整**字元邊距**。此邊距適用於每個匯入的字形。

source: Loading a font file
de: Laden einer Schriftart-Datei
zh_tw: 使用檔案

source: To load a font file (dynamic or bitmap), use the resource dropdown's **Quick Load** or **Load** option next to a font property, then navigate to the font file in question:
de: Um eine Schriftart-Datei (dynamisch oder als Bitmap) zu laden, verwenden Sie die Option **Schnelles Laden** oder **Laden** im Dropdown-Menü der Ressource neben einer Schriftart-Property und navigieren dann zu der betreffenden Schriftart-Datei:
zh_tw: 若要載入字形檔案（動態或點陣圖），請使用字形屬性旁的資源下拉列表的 **快速載入** 或 **載入** 選項，然後導覽至相關字型檔案：

source: You can also drag-and-drop a font file from the FileSystem dock to the inspector property that accepts a Font resource.
de: Sie können auch eine Schriftart-Datei aus dem FileSystem-Dock per Drag&Drop auf die Inspektor-Property ziehen, die eine Schriftart-Ressource akzeptiert.
zh_tw: 您也可以將字型檔案從檔案系統停靠列拖曳到接受字形資源的屬性面板屬性中。

source: In Godot 4.0 and later, texture filter and repeat properties are defined in the location where the texture is used, rather than on the texture itself. This also applies to fonts (both dynamic fonts and bitmap fonts).
de: In Godot 4.0 und höher werden Texturfilter- und Wiederholungs-Propertys an der Stelle definiert, an der die Textur verwendet wird, und nicht auf der Textur selbst. Dies gilt auch für Schriftarten (sowohl dynamische Schriftarten als auch Bitmap-Schriftarten).
zh_tw: 在Godot 4.0及更高版本中，紋理篩選器和重複屬性是在使用紋理的位置定義的，而不是在紋理本身上定義的。這也適用於字形（動態字形和點陣字形）。

source: Fonts that have a pixel art appearance should have bilinear filtering disabled by changing the **Rendering > Textures > Canvas Textures > Default Texture Filter** project setting to **Nearest**.
de: Bei Pixel-Art-Schriftarten, sollte die bilineare Filterung deaktiviert werden, indem die Projekteinstellung **Rendering > Texturen > Canvas-Texturen > Default-Texturfilter** auf **Nearest** geändert wird.
zh_tw: 具有像素藝術外觀的字形應透過將**算繪>紋理>畫布紋理>預設紋理篩選器**專案設定更改為**最近**來停用雙線性篩選。

source: The font size must also be an integer multiple of the design size (which varies on a per-font basis), and the Control node using the font must be scaled by an integer multiple as well. Otherwise, the font may look blurry. Font sizes in Godot are specified in pixels (px), not points (pt). Keep this in mind when comparing font sizes across different software.
de: Die Größe der Schriftart muss ebenfalls ein ganzzahliges Vielfaches der Designgröße sein (die für jede Schriftart unterschiedlich ist), und der Node, der die Schriftart verwendet, muss ebenfalls um ein ganzzahliges Vielfaches skaliert werden. Andernfalls kann die Schriftart unscharf aussehen. Schriftarten in Godot werden in Pixeln (px) und nicht in Punkten (pt) angegeben. Beachten Sie dies, wenn Sie Schriftarten in verschiedenen Programmen vergleichen.
zh_tw: 字形大小也必須是設計大小的整數倍（根據每種字形而變化），並且使用該字形的控制節點也必須以整數倍縮放。否則，字形可能看起來模糊。 Godot 中的字形大小以像素 (px) 為單位，而非點 (pt)。在比較不同軟體之間的字形大小時請記住這一點。

source: The texture filter mode can also be set on individual nodes that inherit from CanvasItem by setting :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>`.
de: Der Texturfiltermodus kann auch für einzelne Nodes festgelegt werden, die von CanvasItem erben, indem :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>` gesetzt wird.
zh_tw: 也可以透過設定 :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>` 在繼承自 CanvasItem 的各個節點上設定紋理篩選器模式。

source: Font outlines and shadows
de: Umrisse und Schatten von Schriftarten

source: Font outlines and shadows can be used to improve readability when the background color isn't known in advance. For instance, this is the case for HUD elements that are drawn over a 2D/3D scene.
de: Umrisse und Schatten von Schriftarten können verwendet werden, um die Lesbarkeit zu verbessern, wenn die Hintergrundfarbe nicht im Voraus bekannt ist. Dies ist zum Beispiel bei HUD-Elementen der Fall, die über eine 2D/3D-Szene gezeichnet werden.

source: Font outlines are available in most nodes that derive from Control, in addition to :ref:`class_Label3D`.
de: Schriftarten sind in den meisten Nodes verfügbar, die sich von Control ableiten, zusätzlich zu :ref:`class_Label3D`.

source: To enable outline for a font on a given node, configure the theme overrides **Font Outline Color** and **Outline Size** in the inspector. The result should look like this:
de: Um die Umrisslinie für eine Schriftart auf einem bestimmten Node zu aktivieren, konfigurieren Sie die Theme-Overrides **Font Outline Color** und **Outline Size** im Inspektor. Das Ergebnis sollte wie folgt aussehen:

source: Font outline example
de: Beispiel für eine Schriftart

source: If using a font with MSDF rendering, its **MSDF Pixel Range** import option be set to at least *twice* the value of the outline size for outline rendering to look correct. Otherwise, the outline may appear to be cut off earlier than intended.
de: Wenn Sie eine Schriftart mit MSDF-Rendering verwenden, muss die Importoption **MSDF-Pixelbereich** mindestens auf den *zweifachen* Wert der Umrissgröße eingestellt werden, damit die Umrisse korrekt wiedergegeben werden. Andernfalls kann es sein, dass der Umriss früher als beabsichtigt abgeschnitten wird.

source: Support for font shadows is more limited: they are only available in :ref:`class_Label` and :ref:`class_RichTextLabel`. Additionally, font shadows always have a hard edge (but you can reduce their opacity to make them look more subtle). To enable font shadows on a given node, configure the **Font Shadow Color**, **Shadow Offset X**, and **Shadow Offset Y** theme overrides in a Label or RichTextLabel node accordingly:
de: Die Unterstützung für Schriftart-Schatten ist eingeschränkter: Sie sind nur in :ref:`class_Label` und :ref:`class_RichTextLabel` verfügbar. Außerdem haben Schriftarten-Schatten immer eine harte Kante (aber Sie können ihre Deckkraft reduzieren, um sie dezenter aussehen zu lassen). Um Schriftart-Schatten auf einem bestimmten Node zu aktivieren, konfigurieren Sie die Theme-Overrides **Schattenfarbe**, **Schattenversatz X** und **Schattenversatz Y** in einem Label- oder RichTextLabel-Node entsprechend:

source: Configuring font shadow in a Label node
de: Konfigurieren der Schriftart-Schatten in einem Label-Node

source: The result should look like this:
de: Das Ergebnis sollte wie folgt aussehen:

source: Font shadow example
de: Beispiel für Schriftart-Schatten

source: You can create local overrides to font display in Label nodes by creating a :ref:`class_LabelSettings` resource that you reuse across Label nodes. This resource takes priority over :ref:`theme properties <doc_gui_skinning>`.
de: Sie können lokale Überschreibungen für die Anzeige von Schriftarten in Label-Nodes erstellen, indem Sie eine :ref:`class_LabelSettings`-Ressource erstellen, die Sie in allen Label-Nodes wiederverwenden. Diese Ressource hat Vorrang vor :ref:`Theme-Propertys <doc_gui_skinning>`.

source: Advanced font features
de: Erweiterte Schriftart-Funktionen
zh_tw: 預設功能

source: You can adjust how the font should be smoothed out when rendering by adjusting *antialiasing* and *hinting*. These are different properties, with different use cases.
de: Sie können einstellen, wie die Schriftart beim Rendern geglättet werden soll, indem Sie *Antialiasing* und *Hinting* einstellen. Dies sind unterschiedliche Propertys mit unterschiedlichen Anwendungsfällen.
zh_tw: 您可以透過調整*抗鋸齒*和*提示*來調整算繪時字形的平滑方式。這些是不同的屬性，具有不同的用例。

source: Antialiasing controls how glyph edges should be smoothed out when rasterizing the font. The default antialiasing method (**Grayscale**) works well on every display technology. However, at small sizes, grayscale antialiasing may result in fonts looking blurry.
de: Antialiasing steuert, wie die Glyphkanten beim Rastern der Schriftart geglättet werden sollen. Die Default-Antialiasing-Methode (**Graustufen**) funktioniert auf allen Anzeigetechnologien gut. Bei kleinen Größen kann das Graustufen-Antialiasing jedoch dazu führen, dass Schriftarten unscharf aussehen.
zh_tw: 抗鋸齒控制光柵化字形時應如何平滑字形邊緣。預設的抗鋸齒方法（**灰階**）適用於每種顯示技術。然而，在小尺寸下，灰階抗鋸齒可能會導致字形看起來模糊。

source: The antialiasing sharpness can be improved by using LCD subpixel optimization, which exploits the subpixel patterns of most LCD displays by offsetting the font antialiasing on a per-channel basis (red/green/blue). The downside is that this can introduce "fringing" on edges, especially on display technologies that don't use standard RGB subpixels (such as OLED displays).
de: Die Antialiasing-Schärfe kann durch die LCD-Subpixel-Optimierung verbessert werden, die das Subpixelmuster der meisten LCD-Displays ausnutzt, indem sie das Antialiasing der Schriftart pro Kanal (Rot/Grün/Blau) ausgleicht. Der Nachteil ist, dass dies zu "Fringing" an den Rändern führen kann, insbesondere bei Display-Technologien, die keine Standard-RGB-Subpixel verwenden (wie OLED-Displays).
zh_tw: 可以透過使用 LCD 子像素優化來提高抗鋸齒清晰度，該優化透過在每個通道（紅/綠/藍）的基礎上偏移字形抗鋸齒來利用大多數 LCD 顯示器的子像素模式。缺點是這可能會在邊緣產生“邊緣”，尤其是在不使用標準 RGB 子像素的顯示技術（例如 OLED 顯示器）上。

source: In most games, it's recommended to stick to the default **Grayscale** antialiasing. For non-game applications, LCD subpixel optimization is worth exploring.
de: Für die meisten Spiele wird empfohlen, die Default-Antialiasing-Funktion **Graustufen** zu verwenden. Für Anwendungen, die keine Spiele sind, ist die LCD-Subpixel-Optimierung eine Überlegung wert.
zh_tw: 在大多數遊戲中，建議堅持使用預設的**灰階**抗鋸齒。對於非遊戲應用，LCD 子像素優化值得探索。

source: Font antialiasing comparison
de: Schriftart-Antialiasing-Vergleich
zh_tw: 視覺比較

source: From top to bottom: Disabled, Grayscale, LCD Subpixel (RGB)
de: Von oben nach unten: Deaktiviert, Graustufen, LCD-Subpixel (RGB)
zh_tw: 由上至下：停用、灰階、LCD 子像素 (RGB)

source: Antialiasing cannot be changed on :ref:`MSDF-rendered fonts <doc_using_fonts_msdf>` – these are always rendered with grayscale antialiasing.
de: Antialiasing kann bei :ref:`MSDF-gerenderten Schriftarten <doc_using_fonts_msdf>` nicht geändert werden - diese werden immer mit Graustufen-Antialiasing gerendert.
zh_tw: :ref:`MSDF 算繪字形 <doc_using_fonts_msdf>` 上的抗鋸齒功能無法變更 - 這些字形始終使用灰階抗鋸齒進行算繪。
