Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: de, zh_tw

source: *Handled by fontconfig*
de: *Verwaltet von fontconfig*
zh_tw: *由 fontconfig 處理*

source: On Android, Roboto is used for Latin/Cyrillic text and Noto Sans is used for other languages' glyphs such as CJK. On third-party Android distributions, the exact font selection may differ.
de: Unter Android wird Roboto für lateinischen/kyrillischen Text und Noto Sans für die Glyphen anderer Sprachen wie CJK verwendet. Bei Android-Distributionen von Drittanbietern kann die genaue Schriftart-Auswahl abweichen.
zh_tw: 在 Android 上，Roboto 用於拉丁文/西里爾文文字，Noto Sans 用於其他語言的字形，例如 CJK。在第三方 Android 發行版上，確切的字形選擇可能有所不同。

source: If specifying more than one font, the first font that is found on the system will be used (from top to bottom). Font names and aliases are case-insensitive on all platforms.
de: Wenn Sie mehr als eine Schriftart angeben, wird die erste Schriftart verwendet, die auf dem System gefunden wird (von oben nach unten). Bei Schriftart-Namen und -Aliasen wird auf allen Plattformen nicht zwischen Groß- und Kleinschreibung unterschieden.
zh_tw: 如果指定多個字形，則將使用系統上找到的第一個字形（從上到下）。字形名稱和別名在所有平台上都不區分大小寫。

source: Like for font variations, you can save the SystemFont arrangement to a resource file to reuse it in other places.
de: Wie bei Schriftart-Variationen können Sie die SystemFont-Anordnung in einer Ressourcendatei speichern, um sie an anderen Stellen wiederzuverwenden.
zh_tw: 與字形變體一樣，您可以將 SystemFont 排列儲存到資源檔案中，以便在其他地方重複使用它。

source: Remember that different system fonts have different metrics, which means that text that can fit within a rectangle on one platform may not be doing so on another platform. Always reserve some additional space during development so that labels can extend further if needed.
de: Denken Sie daran, dass verschiedene Systemschriftarten unterschiedliche Metriken haben. Das bedeutet, dass Text, der auf einer Plattform in ein Rechteck passt, dies auf einer anderen Plattform möglicherweise nicht tut. Reservieren Sie bei der Entwicklung immer etwas zusätzlichen Platz, damit die Labels bei Bedarf weiter ausgedehnt werden können.
zh_tw: 請記住，不同的系統字形具有不同的規格，這意味著在一個平台上可以容納在矩形內的文字可能無法在另一個平台上容納。在開發過程中始終保留一些額外的空間，以便標籤可以在需要時進一步延伸。

source: Unlike Windows and macOS/iOS, the set of default fonts shipped on Linux depends on the distribution. This means that on different Linux distributions, different fonts may be displayed for a given system font name or alias.
de: Im Gegensatz zu Windows und macOS/iOS hängt der Satz der Default-Schriftarten unter Linux von der jeweiligen Distribution ab. Das bedeutet, dass auf verschiedenen Linux-Distributionen unterschiedliche Schriftarten für einen bestimmten Systemschriftart-Namen oder -Alias angezeigt werden können.
zh_tw: 與 Windows 和 macOS/iOS 不同，Linux 上提供的預設字型集取決於發行版。這意味著在不同的 Linux 發行版上，給定的系統字形名稱或別名可能會顯示不同的字形。

source: It is also possible to load fonts at runtime even if they aren't installed on the system. See :ref:`Runtime loading and saving <doc_runtime_file_loading_and_saving_fonts>` for details.
de: Es ist auch möglich, Schriftarten zur Laufzeit zu laden, selbst wenn sie nicht auf dem System installiert sind. Siehe :ref:`Laden und Speichern zur Laufzeit <doc_runtime_file_loading_and_saving_fonts>` für Details.

source: Font prerendering
de: Vorberechnung von Schriftarten
zh_tw: 算繪

source: When using traditional rasterized fonts, Godot caches glyphs on a per-font and per-size basis. This reduces stuttering, but it can still occur the first time a glyph is displayed when running the project. This can be especially noticeable at higher font sizes or on mobile devices.
de: Bei der Verwendung herkömmlicher gerasterter Schriftarten speichert Godot die Glyphen pro Schriftart und pro Größe zwischen. Dadurch wird das Stuttering reduziert, aber es kann immer noch auftreten, wenn eine Glyphe zum ersten Mal angezeigt wird, wenn das Projekt ausgeführt wird. Dies kann besonders bei höheren Schriftgrößen oder auf mobilen Geräten auffallen.
zh_tw: 當使用傳統的光柵化字形時，Godot 根據每個字形和每個尺寸快取字形。這可以減少卡頓，但在運作專案時第一次顯示字形時，卡頓仍然可能發生。這在較大的字形大小或行動裝置上尤其明顯。

source: When using MSDF fonts, they only need to be rasterized once to a special signed distance field texture. This means caching can be done purely on a per-font basis, without taking the font size into consideration. However, the initial rendering of MSDF fonts is slower compared to a traditional rasterized font at a medium size.
de: Bei der Verwendung von MSDF-Schriftarten müssen diese nur einmal in eine spezielle Textur für die Signed Distance Field-Textur gerastert werden. Das bedeutet, dass das Zwischenspeichern nur für jede einzelne Schriftart erfolgen kann, ohne dass die Schriftgröße berücksichtigt werden muss. Allerdings ist das anfängliche Rendering von MSDF-Schriftarten langsamer als das einer herkömmlichen gerasterten Schriftart bei mittlerer Größe.
zh_tw: 使用 MSDF 字形時，只需將它們光柵化為特殊的帶符號距離場紋理一次。這意味著快取可以純粹基於每個字形來完成，而不考慮字形大小。然而，與中等尺寸的傳統光柵化字形相比，MSDF 字形的初始算繪速度較慢。

source: To avoid stuttering issues related to font rendering, it is possible to *prerender* certain glyphs. This can be done for all glyphs you intend to use (for optimal results), or only for common glyphs that are most likely to appear during gameplay (to reduce file size). Glyphs that aren't pre-rendered will be rasterized on-the-fly as usual.
de: Um Stuttering-Probleme im Zusammenhang mit dem Rendern von Schriftarten zu vermeiden, ist es möglich, bestimmte Glyphen *vorzurendern*. Dies kann für alle Glyphen geschehen, die Sie verwenden möchten (für optimale Ergebnisse), oder nur für die gängigen Glyphen, die während des Spiels am häufigsten vorkommen (um die Dateigröße zu verringern). Glyphen, die nicht vorgerendert sind, werden wie üblich in Echtzeit gerastert.
zh_tw: 為了避免與字形算繪相關的口吃問題，可以「預先算繪」某些字形。可以對您打算使用的所有字形執行此操作（以獲得最佳結果），或者僅對最有可能在遊戲過程中出現的常見字形執行此操作（以減小檔案大小）。未預先算繪的字形將像往常一樣即時光柵化。

source: In both cases (traditional and MSDF), font rasterization is done on the CPU. This means that the GPU performance doesn't affect how long it takes for fonts to be rasterized.
de: In beiden Fällen (traditionell und MSDF) wird die Rasterung der Schriftarten von der CPU durchgeführt. Das bedeutet, dass die Performance der GPU keinen Einfluss darauf hat, wie lange die Rasterung der Schriftarten dauert.
zh_tw: 在這兩種情況（傳統和 MSDF）中，字形光柵化都是在 CPU 上完成的。這意味著 GPU 效能不會影響字形光柵化所需的時間。

source: Move to the **Pre-render Configurations** tab of the Advanced Import Settings dialog, then add a configuration by clicking the "plus" symbol:
de: Wechseln Sie im Dialogfeld Erweiterte Importeinstellungen auf den **Prerender-Konfigurationen**-Tab und fügen Sie eine Konfiguration hinzu, indem Sie auf das Plus-Symbol klicken:
zh_tw: 移至「進階匯入設定」對話方塊的 **預先算繪配置** 分頁，然後透過點選「加號」符號新增配置：

source: Adding a new prerendering configuration in the Advanced Import Settings dialog
de: Hinzufügen einer neuen Prerendering-Konfiguration im Dialogfeld Erweiterte Importeinstellungen
zh_tw: 在「進階匯入設定」對話方塊中新增新的預算繪配置

source: After adding a configuration, make sure it is selected by clicking its name once. You can also rename the configuration by double-clicking it.
de: Nachdem Sie eine Konfiguration hinzugefügt haben, vergewissern Sie sich, dass sie ausgewählt ist, indem Sie einmal auf ihren Namen klicken. Sie können die Konfiguration auch umbenennen, indem Sie auf sie doppelklicken.
zh_tw: 新增配置後，請確保透過單擊其名稱一次來選擇它。您也可以透過雙擊配置來重新命名它。

source: There are 2 ways to add glyphs to be prerendered to a given configuration. It is possible to use both approaches in a cumulative manner:
de: Es gibt 2 Möglichkeiten, einer gegebenen Konfiguration Glyphen hinzuzufügen, die vorgerendert werden sollen. Es ist möglich, beide Ansätze kumulativ zu verwenden:
zh_tw: 有兩種方法可以將要預先算繪的字形新增到給定配置。可以以累積的方式使用這兩種方法：

source: **Using text from translations**
de: **Verwendung von Text aus Übersetzungen**
zh_tw: 使用 Weblate 來進行翻譯

source: For most projects, this approach is the most convenient to use, as it automatically sources text from your language translations. The downside is that it can only be used if your project supports :ref:`internationalization <doc_internationalizing_games>`. Otherwise, stick to the "Using custom text" approach described below.
de: Für die meisten Projekte ist dieser Ansatz der bequemste, da er automatisch Text aus Ihren Sprachübersetzungen bezieht. Der Nachteil ist, dass er nur verwendet werden kann, wenn Ihr Projekt :ref:`Internationalisierung <doc_internationalizing_games>` unterstützt. Andernfalls halten Sie sich an den unten beschriebenen Ansatz "Benutzerdefinierten Text verwenden".
zh_tw: 對於大多數專案來說，這種方法使用起來最方便，因為它會自動從您的語言翻譯中取得文字。缺點是它只能在您的專案支援 :ref:`國際化 <doc_internationalizing_games>` 時使用。否則，請堅持使用下面描述的“使用自訂文字”方法。

source: After adding translations to the Project Settings, use the **Glyphs from the Translations** tab to check translations by double-clicking them, then click **Shape All Strings in the Translations and Add Glyphs** at the bottom:
de: Nachdem Sie die Übersetzungen zu den Projekteinstellungen hinzugefügt haben, verwenden Sie die **Glyphen aus dem Tab Übersetzungen**, um die Übersetzungen durch Doppelklick zu überprüfen, und klicken Sie dann auf **Alle Strings in den Übersetzungen formen und Glyphen hinzufügen** am unteren Rand:
zh_tw: 將翻譯新增至專案設定後，使用「翻譯」標籤中的「**字形」透過雙擊來檢查翻譯，然後點擊底部的「**調整翻譯中的所有字串並新增字形**」：

source: Enabling prerendering in the Advanced Import Settings dialog with the Glyphs from the Translations tab
de: Aktivieren des Prerendering im Dialog Erweiterte Importeinstellungen mit den Glyphen auf dem Übersetzungen-Tab
zh_tw: 在「進階匯入設定」對話方塊中使用「翻譯」標籤中的字形啟用預先算繪

source: Enabling prerendering in the Advanced Import Settings dialog with the **Glyphs from the Translations** tab
de: Aktivieren des Prerendering im Dialogfeld Erweiterte Importeinstellungen mit dem Tab **Glyphen aus den Übersetzungen**
zh_tw: 使用「翻譯」標籤中的 **Glyphs 在「進階匯入設定」對話方塊中啟用預算繪

source: The list of prerendered glyphs is not automatically updated when translations are updated, so you need to repeat this process if your translations have changed significantly.
de: Die Liste der per Prerendering vorberechneten Glyphen wird nicht automatisch aktualisiert, wenn die Übersetzungen aktualisiert werden, so dass Sie diesen Vorgang wiederholen müssen, wenn sich Ihre Übersetzungen wesentlich geändert haben.
zh_tw: 更新翻譯時，預算繪字形列表不會自動更新，因此如果您的翻譯發生重大更改，您需要重複此過程。

source: **Using custom text**
de: **Verwendung von benutzerdefiniertem Text**
zh_tw: 使用自定節點

source: While it requires manually specifying text that will appear in the game, this is the most efficient approach for games which don't feature user text input. This approach is worth exploring for mobile games to reduce the file size of the distributed app.
de: Zwar muss der Text, der im Spiel erscheinen soll, manuell eingegeben werden, doch ist dies der effizienteste Ansatz für Spiele, bei denen keine Texteingabe durch den Benutzer erforderlich ist. Dieser Ansatz ist es wert, für mobile Spiele ausprobiert zu werden, um die Dateigröße der verteilten App zu reduzieren.
zh_tw: 雖然它需要手動指定遊戲中出現的文字，但對於不支援使用者文字輸入的遊戲來說，這是最有效的方法。對於行動遊戲來說，這種方法值得探索，以減少分散式應用程式的檔案大小。

source: To use existing text as a baseline for prerendering, go to the **Glyphs from the Text** sub-tab of the Advanced Import Settings dialog, enter text in the window on the right, then click **Shape Text and Add Glyphs** at the bottom of the dialog:
de: Um vorhandenen Text als Basis für das Prerendering zu verwenden, wechseln Sie zum Unter-Tab **Glyphen aus dem Text** des Dialogfelds Erweiterte Importeinstellungen, geben Sie den Text im Fenster rechts ein und klicken Sie dann unten im Dialogfeld auf **Text formen und Glyphen hinzufügen**:
zh_tw: 若要使用現有文字作為預先算繪的基線，請前往「進階匯入設定」對話方塊的「文字中的字形」子分頁，在右側視窗中輸入文字，然後按一下「塑造文字形狀並新增字形”* * 在對話框底部：

source: Enabling prerendering in the Advanced Import Settings dialog, Glyphs from the Text tab
de: Aktivieren des Prerendering im Dialogfeld Erweiterte Importeinstellungen, "Glyphen aus dem Text"-Tab
zh_tw: 在「進階匯入設定」對話方塊、「文字」標籤中的「字形」中啟用預算繪

source: Enabling prerendering in the Advanced Import Settings dialog with the **Glyphs from the Text** tab
de: Aktivieren des Prerendering im Dialogfeld Erweiterte Importeinstellungen mit dem Tab **Glyphen aus dem Text**
zh_tw: 使用「文字中的字形」標籤在「進階匯入設定」對話方塊中啟用預先算繪

source: If your project supports :ref:`internationalization <doc_internationalizing_games>`, you can paste the contents of your CSV or PO files in the above box to quickly prerender all possible characters that may be rendered during gameplay (excluding user-provided or non-translatable strings).
de: Wenn Ihr Projekt :ref:`Internationalisierung <doc_internationalizing_games>` unterstützt, können Sie den Inhalt Ihrer CSV- oder PO-Dateien in das obige Feld einfügen, um alle möglichen Zeichen, die während des Spiels gerendert werden können (mit Ausnahme von benutzerdefinierten oder nicht übersetzbaren Strings), schnell per Prerendering vorzuberechnen.
zh_tw: 如果您的專案支援國際化<doc_internationalizing_games>`，您可以將CSV 或PO 檔案的內容貼到上面的方塊中，以快速預算繪遊戲過程中可能算繪的所有可能的字元（不包括使用者提供的或不可翻譯的字元）字串）。

source: **By enabling character sets**
de: **Durch Aktivierung von Zeichensätzen**
zh_tw: **通過啟用字元集**

source: The second method requires less configuration and fewer updates if your game's text changes, and is more suited to text-heavy games or multiplayer games with chat. On the other hand, it may cause glyphs that never show up in the game to be prerendered, which is less efficient in terms of file size.
de: Die zweite Methode erfordert weniger Konfiguration und weniger Updates, wenn sich der Text Ihres Spiels ändert, und eignet sich besser für textlastige Spiele oder Multiplayer-Spiele mit Chat. Auf der anderen Seite kann es dazu führen, dass Glyphen, die nie im Spiel auftauchen, vorgerendert werden, was in Bezug auf die Dateigröße weniger effizient ist.
zh_tw: 如果您的遊戲文字發生變化，第二種方法需要較少的配置和較少的更新，並且更適合文字較多的遊戲或具有聊天功能的多人遊戲。另一方面，它可能會導致遊戲中從未出現的字形被預先算繪，這在檔案大小方面效率較低。

source: To use existing text as a baseline for prerendering, go to the **Glyphs from the Character Map** sub-tab of the Advanced Import Settings dialog, then *double-click* character sets to be enabled on the right:
de: Um vorhandenen Text als Basis für das Prerendering zu verwenden, wechseln Sie auf den Unter-Tab **Glyphen aus der Zeichentabelle** des Dialogfelds Erweiterte Importeinstellungen und *doppelklicken* Sie dann auf der rechten Seite auf die zu aktivierenden Zeichensätze:

source: Enabling prerendering in the Advanced Import Settings dialog, Glyphs from the Character Map tab
de: Aktivieren des Prerendering im Dialog Erweiterte Importeinstellungen, Glyphen auf dem Tab Zeichentabelle
zh_tw: 在「進階匯入設定」對話方塊、「字元對應表」標籤中的「字形」中啟用預先算繪

source: Enabling prerendering in the Advanced Import Settings dialog with the **Glyphs from the Character Map** tab
de: Aktivieren des Prerendering im Dialogfeld Erweiterte Importeinstellungen mit dem Tab **Glyphen aus der Zeichentabelle**
zh_tw: 使用「字元對映表中的字形」標籤在「進階匯入設定」對話方塊中啟用預算繪

source: To ensure full prerendering, the character sets you need to enable depend on which languages are supported in your game. For English, only **Basic Latin** needs to be enabled. Enabling **Latin-1 Supplement** as well allows fully covering many more languages, such as French, German and Spanish. For Russian, **Cyrillic** needs to be enabled, and so on.
de: Um ein vollständiges Prerendering zu gewährleisten, hängen die zu aktivierenden Zeichensätze davon ab, welche Sprachen in Ihrem Spiel unterstützt werden. Für Englisch muss nur **Basic Latin** aktiviert werden. Die Aktivierung von **Latin-1 Supplement** ermöglicht die vollständige Abdeckung vieler weiterer Sprachen, wie Französisch, Deutsch und Spanisch. Für Russisch muss **Kyrillisch** aktiviert werden, und so weiter.
zh_tw: 為了確保完全預先算繪，您需要啟用的字元集取決於您的遊戲支援的語言。對於英語，僅需要啟用**基本拉丁語**。啟用 **Latin-1 Supplement** 還可以完全涵蓋更多語言，例如法語、德語和西班牙語。對於俄語，需要啟用**西里爾**，等等。

source: Default project font properties
de: Default-Projekt-Propertys für Schriftarten
zh_tw: 存取區域變數或屬性：

source: In the **GUI > Theme** section of the advanced Project Settings, you can choose how the default font should be rendered:
de: Im Abschnitt **GUI > Theme** der erweiterten Projekteinstellungen können Sie wählen, wie die Schriftart gerendert werden soll:
zh_tw: 在高級“專案設定”的 **GUI > 主題**部分中，可以對預設字形的算繪方式進行選擇：

source: **Default Font Antialiasing:** Controls the :ref:`antialiasing <doc_using_fonts_antialiasing>` method used for the default project font.
de: **Default-Schriftart-Antialiasing:** Steuert die Methode :ref:`antialiasing <doc_using_fonts_antialiasing>`, die für die Default-Schriftart des Projekts verwendet wird.
zh_tw: **預設字形抗鋸齒：** 控制用於預設專案字形的 :ref:`抗鋸齒 <doc_using_fonts_antialiasing>` 方法。

source: **Default Font Hinting:** Controls the :ref:`hinting <doc_using_fonts_hinting>` method used for the default project font.
de: **Default-Schriftart-Hinting:** Steuert die :ref:`Hinting <doc_using_fonts_hinting>`-Methode, die für die Default-Schriftart des Projekts verwendet wird.
zh_tw: **預設字形提示：** 控制用於預設專案字形的:ref:`提示 <doc_using_fonts_hinting>` 方法。

source: **Default Font Subpixel Positioning:** Controls the :ref:`subpixel positioning <doc_using_fonts_subpixel_positioning>` method for the default project font.
de: **Subpixelpositionierung der Default-Schriftart:** Steuert die Methode :ref:`Subpixelpositionierung <doc_using_fonts_subpixel_positioning>` für die Default-Projektschriftart.
zh_tw: **預設字形子像素定位：** 控制預設專案字形的:ref:`子像素定位 <doc_using_fonts_subpixel_positioning>` 方法。

source: **Default Font Multichannel Signed Distance Field:** If ``true``, makes the default project font use :ref:`MSDF font rendering <doc_using_fonts_msdf>` instead of traditional rasterization.
de: **Default-Schriftart Multichannel Signed Distance Field:** Wenn ``true``, verwendet die Default-Schriftart des Projekts :ref:`MSDF-Font-Rendering <doc_using_fonts_msdf>` anstelle der traditionellen Rasterung.
zh_tw: **預設字形多通道有符號距離場：** 如果“true”，則使預設專案字形使用:ref:`MSDF 字形算繪 <doc_using_fonts_msdf>` 而不是傳統的光柵化。

source: **Default Font Generate Mipmaps:** If ``true``, enables :ref:`mipmap <doc_using_fonts_mipmaps>` generation and usage for the default project font.
de: **Default-Schriftart Mipmaps erzeugen:** Wenn ``true``, aktiviert :ref:`Mipmap <doc_using_fonts_mipmaps>` Erzeugung und Verwendung für die Default-Schriftart des Projekts.
zh_tw: **預設字型產生 Mipmap：** 如果為“true”，則啟用:ref:`mipmap <doc_using_fonts_mipmaps>` 產生和使用預設專案字型。

source: These project settings *only* affect the default project font (the one that is hardcoded in the engine binary).
de: Diese Projekteinstellungen wirken sich *nur* auf die Default-Schriftart des Projekts aus (diejenige, die in der Engine-Binärdatei fest einkodiert ist).
zh_tw: 這些專案設定*僅*影響預設專案字形（在引擎二進位檔案中硬編碼的字形）。

source: Custom fonts' properties are governed by their respective import options instead. You can use the **Import Defaults** section of the Project Settings dialog to override default import options for custom fonts.
de: Die Propertys der benutzerdefinierten Schriftarten werden stattdessen durch ihre jeweiligen Importoptionen bestimmt. Sie können den Abschnitt **Import Defaults** im Dialogfeld Projekteinstellungen verwenden, um die Standard-Importoptionen für benutzerdefinierte Schriftarten außer Kraft zu setzen.
zh_tw: 自訂字形的屬性由其各自的匯入選項控制。您可以使用「專案設定」對話方塊的「**匯入預設值**」部分來覆寫自訂字形的預設匯入選項。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Web Open Font Format 1 (``.woff``)
zh_tw: Web 開放字形格式 1（``.woff``）

source: Antialiasing
zh_tw: 抗鋸齒

source: Hinting
zh_tw: 微調

source: Mipmaps
zh_tw: Mipmap

source: Import dock
zh_tw: 匯入流程

source: macOS/iOS
zh_tw: macOS

source: Times
zh_tw: 時間戳

source: ``monospace``
zh_tw: 等寬字形

source: Apple Chancery
zh_tw: 套用更改。

source: Dancing Script
zh_tw: Main（主要）腳本

source: ``fantasy``
zh_tw: ``if x else``
