Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/index.po
Languages: de, zh_tw

source: User interface (UI)
de: Benutzeroberfläche (UI)
zh_tw: 使用者介面 (UI)

source: In this section of the tutorial we explain the basics of creating a graphical user interface (GUI) in Godot.
de: In diesem Abschnitt des Tutorials erklären wir die Grundlagen der Erstellung einer grafischen Benutzeroberfläche (GUI) in Godot.
zh_tw: 在本教學的這一部分中，我們將解釋在 Godot 中建立圖形使用者介面 (GUI) 的基礎知識。

source: UI building blocks
de: UI-Bausteine
zh_tw: UI 構件

source: Typical content controls include:
de: Typische Inhalts-Controls sind:
zh_tw: 典型的內容控制項有：

source: :ref:`Buttons <class_Button>`
zh_tw: :ref:`Quat <class_Quat>`

source: :ref:`Labels <class_Label>`
zh_tw: :ref:`bool <class_bool>`

source: :ref:`LineEdits <class_LineEdit>` and :ref:`TextEdits <class_TextEdit>`
de: :ref:`LineEdits <class_LineEdit>` und :ref:`TextEdits <class_TextEdit>`
zh_tw: :ref:`單行文字方塊 <class_LineEdit>` 和 :ref:`多行文字方塊 <class_TextEdit>`

source: Typical layout controls include:
de: Typische Layout-Controls umfassen:
zh_tw: 典型的佈局控制項有：

source: :ref:`BoxContainers <class_BoxContainer>`
zh_tw: :ref:`Stack <class_BoxContainer>` 配置。

source: :ref:`MarginContainers <class_MarginContainer>`
zh_tw: :ref:`Grid <class_GridContainer>` 配置。

source: :ref:`ScrollContainers <class_ScrollContainer>`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`TabContainers <class_TabContainer>`
zh_tw: :ref:`Plane <class_Plane>`

source: :ref:`Popups <class_Popup>`
zh_tw: :ref:`bool <class_bool>`

source: The following pages explain the basics of using such controls.
de: Auf den folgenden Seiten werden die Grundlagen der Verwendung solcher Controls erläutert.
zh_tw: 以下文章涵蓋了特定控制項節點的具體細節。

source: GUI skinning and themes
de: GUI Skinning und Themes
zh_tw: GUI 皮膚與主題

source: Godot features an in-depth skinning/theming system for control nodes. The pages in this section explain the benefits of that system and how to set it up in your projects.
de: Godot verfügt über ein umfassendes Skinning und Theme-System für Control-Nodes. Die Seiten in diesem Abschnitt erklären die Vorteile dieses Systems und wie Sie es in Ihren Projekten einrichten können.
zh_tw: Godot 的控制項節點具有完善的皮膚/主題系統。本節中的頁面將說明該系統的好處，以及如何在你的專案中啟用它。

source: Control node tutorials
zh_tw: 命令行教學

source: The following articles cover specific details of using particular control nodes.
de: Die folgenden Artikel befassen sich mit spezifischen Details zur Verwendung bestimmter Control-Nodes.
zh_tw: 以下文章涵蓋了特定控制項節點的具體細節。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態

source: Like everything else in Godot the user interface is built using nodes, specifically :ref:`Control <class_Control>` nodes. There are many different types of controls which are useful for creating specific types of GUIs. For simplicity we can separate them into two groups: content and layout.
de: Wie alles andere in Godot wird auch die Benutzeroberfläche mit Hilfe von Nodes aufgebaut, insbesondere mit :ref:`Control <class_Control>`-Nodes. Es gibt viele verschiedene Arten von Controls, die für die Erstellung bestimmter Arten von GUIs nützlich sind. Der Einfachheit halber können wir sie in zwei Gruppen unterteilen: Inhalt und Layout.
