Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/size_and_anchors.po
Languages: de, zh_tw

source: Size and anchors
de: Größe und Anker
zh_tw: 大小和錨點

source: If a game was always going to be run on the same device and at the same resolution, positioning controls would be a simple matter of setting the position and size of each one of them. Unfortunately, that is rarely the case.
de: Wenn ein Spiel immer auf demselben Gerät und mit derselben Auflösung ausgeführt werden würde, wäre es einfach, die Position und Größe jedes einzelnen Controls zu bestimmen. Dies ist leider selten der Fall.
zh_tw: 如果一個遊戲總是用同一解析度在同樣的裝置上運作, 擺放控制項將是一個簡單的事, 只要逐個設定它們的位置屬性和大小屬性即可. 不幸的是, 能像這樣處理的情況很少.

source: Only TVs nowadays have a standard resolution and aspect ratio. Everything else, from computer monitors to tablets, portable consoles and mobile phones have different resolutions and aspect ratios.
de: Nur Fernseher haben heutzutage eine Standardauflösung und ein Standard-Seitenverhältnis. Alles andere, von Computermonitoren bis hin zu Tablets, tragbaren Konsolen und Mobiltelefonen, hat unterschiedliche Auflösungen und Seitenverhältnisse.
zh_tw: 如今只有電視機有標準解析度和縱橫比. 而其他所有裝置, 從電腦顯示器到平板電腦, 便攜遊戲主機和手機等等, 都有不同的解析度和縱橫比.

source: There are several ways to handle this, but for now, let's just imagine that the screen resolution has changed and the controls need to be re-positioned. Some will need to follow the bottom of the screen, others the top of the screen, or maybe the right or left margins.
de: Es gibt verschiedene Möglichkeiten, um damit umzugehen, aber stellen wir uns vorerst vor, dass sich die Bildschirmauflösung geändert hat und die Controls neu positioniert werden müssen. Einige müssen dem unteren Bildschirmrand folgen, andere dem oberen Bildschirmrand oder möglicherweise dem rechten oder linken Rand.
zh_tw: 有幾種方法來處理這個問題, 但現在, 讓我們想像一下, 螢幕解析度已經改變, 控制項需要重新定位. 有的需要跟隨螢幕的底部, 有的需要跟隨螢幕的頂部, 也有的需要跟隨左右邊距.

source: This is done by editing the *margin* properties of controls. Each control has four margins: left, right, bottom, and top, which correspond to the respective edges of the control. By default, all of them represent a distance in pixels relative to the top-left corner of the parent control or (in case there is no parent control) the viewport.
de: Dies geschieht durch die Bearbeitung der *Seitenrand*-Propertys der Controls. Jedes Control hat vier Seitenränder: links, rechts, unten und oben, die den jeweiligen Kanten des Controls entsprechen. Standardmäßig stellen sie alle einen Abstand in Pixeln relativ zur linken oberen Ecke des Parent-Controls oder (falls es kein Parent-Control gibt) des Viewports dar.
zh_tw: 這是通過編輯控制項的 *margin* 屬性來實作的。每個控制項都有四個邊距：左、右、底、頂。預設情況下，它們都表示相對於父控制項的左上角或（在沒有父控制項的情況下）視口的像素距離。

source: So to make the control wider you can make the right margin larger and/or make the left margin smaller. This lets you set the exact placement and shape of the control.
de: Um das Control breiter zu machen, können Sie also den rechten Seitenrand größer und/oder den linken Seitenrand kleiner machen. So können Sie die genaue Platzierung und Form des Controls festlegen.
zh_tw: 因此，要使控制項更寬，您可以增加右邊距和/或減少左邊距。這使您可以設定控制項的確切位置和形狀。

source: The *anchor* properties adjust where the margin distances are relative *to*. Each margin has an individual anchor that can be adjusted from the beginning to the end of the parent. So the vertical (top, bottom) anchors adjust from 0 (top of parent) to 1.0 (bottom of parent) with 0.5 being the center, and the control margins will be placed relative to that point. The horizontal (left, right) anchors similarly adjust from left to right of the parent.
de: Die *Anker*-Propertys stellen ein, relativ zu welchem Punkt die Seitenränder gemessen werden. Jeder Seitenrand hat einen individuellen Anker, der vom Anfang bis zum Ende des Parent-Elements eingestellt werden kann. So lassen sich die vertikalen (oben, unten) Anker von 0 (oben am Parent) bis 1,0 (unten am Parent) einstellen, wobei 0,5 der Mittelpunkt ist, und die Control-Seitenränder relativ zu diesem Punkt platziert werden. Die horizontalen Anker (links, rechts) passen sich ebenfalls von links nach rechts dem Parent an.
zh_tw: *anchor* 屬性調整邊距距離相對於*的位置。每個邊距都有一個單獨的錨點，可以從父級的開頭到結尾進行調整。因此，垂直（頂部、底部）錨點從 0（父級頂部）調整到 1.0（父級底部），其中 0.5 為中心，控制邊距將相對於該點放置。水平（左、右）錨點類似地從父級的左到右調整。

source: Note that when you wish the edge of a control to be above or left of the anchor point, you must change the margin value to be negative.
de: Wenn Sie möchten, dass der Rand eines Controls über oder links vom Ankerpunkt liegt, müssen Sie den Seitenrand auf einen negativen Wert ändern.
zh_tw: 請注意，當您希望控制項的邊緣位於錨點的上方或左側時，必須將邊距值變更為負值。

source: For example: when horizontal anchors are changed to 1, the margin values become relative to the top-right corner of the parent control or viewport.
de: Beispiel: Wenn horizontale Anker auf 1 geändert werden, gelten die Seitenrand-Werte relativ zur oberen rechten Ecke des Parent-Controls oder des Viewports.
zh_tw: 當水平(左, 右)和/或 垂直(上, 下)錨點被改為1時, 邊距值就會變成相對於父控制項或視口的右下角.

source: Adjusting the two horizontal or the two vertical anchors to different values will make the control change size when the parent control does. Here, the control is set to anchor its bottom-right corner to the parent's bottom-right, while the top-left control margins are still anchored to the top-left of the parent, so when re-sizing the parent, the control will always cover it, leaving a 20 pixel margin:
de: Wenn Sie die beiden horizontalen oder die beiden vertikalen Anker auf unterschiedliche Werte einstellen, ändert das Control seine Größe, wenn das Parent-Control dies tut. Hier wird das Control so eingestellt, dass seine untere rechte Ecke an der unteren rechten Ecke des Parent-Controls verankert wird, während die oberen linken Seitenränder des Controls immer noch an der oberen linken Ecke des Parent-Controls verankert werden, so dass das Control bei einer Größenänderung des Parent-Controls dieses immer abdeckt und einen Seitenrand von 20 Pixeln übrig lässt:
zh_tw: 將兩個水平或兩個垂直錨點調整為不同的值將使控制項隨著父控制項的大小而改變。在這裡，控制項設定為將其右下角錨定到父級的右下角，而左上角的控制項邊距仍然錨定到父級的左上角，因此當重新調整父級的大小時，控制項將始終覆蓋它，留出20 像素的邊距：

source: Centering a control
de: Zentrieren eines Controls
zh_tw: 建立內容

source: To center a control in its parent, set its anchors to 0.5 and each margin to half of its relevant dimension. For example, the code below shows how a TextureRect can be centered in its parent:
de: Um ein Control in seinem Parent-Element zu zentrieren, setzen Sie seine Anker auf 0,5 und jeden Seitenrand auf die Hälfte seiner relevanten Dimension. Der folgende Code zeigt beispielsweise, wie ein TextureRect in seinem Parent-Element zentriert werden kann:
zh_tw: 要將控制項集中到其父控制項中, 其錨定值為0.5, 每個邊距為其相關尺寸的一半. 例如, 下面的程式碼顯示了如何將紋理矩形居中到它的父節點:

source: Setting each anchor to 0.5 moves the reference point for the margins to the center of its parent. From there, we set negative margins so that the control gets its natural size.
de: Wenn Sie jeden Anker auf 0,5 setzen, wird der Referenzpunkt für die Seitenränder in die Mitte des Parent-Elements verschoben. Von dort aus setzen wir negative Seitenränder, damit das Control seine natürliche Größe bekommt.
zh_tw: 將每個錨定值設定為0.5, 將邊緣的參考點移動到父錨點的中心. 在此基礎上, 我們設定了負邊距, 以便控制項獲得其自然大小.

source: Layout Presets
de: Layout-Vorgaben
zh_tw: 匯出 Preset

source: Instead of manually adjusting the margin and anchor values, you can use the toolbar's Layout menu, above the viewport. Besides centering, it gives you many options to align and resize control nodes.
de: Anstatt die Seitenrand- und Ankerwerte manuell anzupassen, können Sie das Layout-Menü der Toolbar über dem Viewport verwenden. Neben der Zentrierung bietet es viele Optionen zum Ausrichten und Ändern der Größe von Control-Nodes.
zh_tw: 除了手動調整邊距和錨點的值之外，你還可以使用視口上方工具列中的“佈局”功能表。其中有居中等諸多選項，可以用來對齊並調整節點的大小。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
