Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/android_studio.po
Languages: de, zh_tw

source: `Android Studio <https://developer.android.com/studio>`_ is a free IDE for Android development made by `Google <https://about.google/>`_ and `JetBrains <https://www.jetbrains.com/>`_. It's based on `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_ and has a feature-rich editor which supports Java and C/C++. It can be used to work on Godot's core engine as well as the Android platform codebase.
de: `Android Studio <https://developer.android.com/studio>`_ ist eine kostenlose IDE für die Android-Entwicklung, die von `Google <https://about.google/>`_ und `JetBrains <https://www.jetbrains.com/>`_ entwickelt wurde. Es basiert auf `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_ und hat einen funktionsreichen Editor, der Java und C/C++ unterstützt. Es kann sowohl für die Arbeit an der Godot-Kern-Engine als auch für die Codebasis der Android-Plattform verwendet werden.
zh_tw: `Android Studio <https://developer.android.com/studio>`_ 是用於 Android 開發的一個免費 `JetBrains <https://www.jetbrains.com/>`_ IDE。Android Studio 提供了支援 Java 與 C/C++ 的功能豐富的編輯器。使用 Android Studio 除了可以處理 Android 平台的程式碼外，還可以用來處理 Godot 核心引擎。

source: Importing the project
de: Projekt importieren
zh_tw: 匯入專案

source: From the Android Studio's welcome window select **Open**.
de: Wählen Sie im Begrüßungsfenster von Android Studio **Öffnen**.
zh_tw: 在 Android Studio 的歡迎視窗內選擇 **Open an existing Android Studio project** (開啟現有的 Android Studio 專案)。

source: Android Studio's welcome window.
de: Android Studio's Willkommensbildschirm.
zh_tw: Android Studio 的歡迎視窗。

source: Navigate to ``<Godot root directory>/platform/android/java`` and select the ``settings.gradle`` file.
de: Navigieren Sie zu ``<Godot-Stammverzeichnis>/platform/android/java`` und wählen Sie die Datei ``settings.gradle``.
zh_tw: 前往 ``<Godot 根目錄>/platform/android/java`` 並選擇 ``settings.gradle`` 檔案。

source: Android Studio will import and index the project.
de: Android Studio wird das Projekt importieren und indizieren.
zh_tw: Android Studio 會匯入並對專案進行索引。

source: Android Studio project layout
de: Android Studio Projektaufbau

source: The project is organized using `Android Studio's modules <https://developer.android.com/studio/projects#ApplicationModules>`_:
de: Das Projekt ist mit den `Modulen von Android Studio <https://developer.android.com/studio/projects#ApplicationModules>`_ organisiert:
zh_tw: 可以從 `Android Studio <https://developer.android.com/studio/>`__ 上下載並安裝 Android Studio。

source: ``lib`` module:
de: Modul ``lib``:
zh_tw: ``lib`` 模組：

source: Located under ``<Godot root directory>/platform/android/java/lib``, this is a **library module** that organizes
de: Dieses **Bibliotheksmodul**, das sich unter ``<Godot-Stammverzeichnis>/platform/android/java/lib`` befindet, organisiert
zh_tw: 前往 ``<Godot 根目錄>/platform/android/java`` 並選擇 ``settings.gradle`` 檔案。

source: the Godot java and native code and make it available as a reusable dependency / artifact.
de: den Godot-Java- und nativen Code und stellt ihn als wiederverwendbare Dependency/Artefakt zur Verfügung.
zh_tw: Godot java 和本機程式碼，並使其可作為可重複使用的依賴項/工件。

source: The artifact generated by this module is made available for other Android modules / projects to use as a dependency, via `MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>`_.
de: Das von diesem Modul erzeugte Artefakt wird über `MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>`_ für andere Android-Module/Projekte als Abhängigkeit zur Verfügung gestellt.
zh_tw: 透過“MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>”，此模組產生的工件可供其他 Android 模組/專案用作依賴項。

source: ``editor`` module:
de: Modul ``editor``:

source: Located under ``<Godot root directory>/platform/android/java/editor``, this is an **application module** that holds
de: Es befindet sich im Verzeichnis ``<Godot root directory>/platform/android/java/editor`` und ist ein **Anwendungsmodul**, das Folgendes enthält
zh_tw: 前往 ``<Godot 根目錄>/platform/android/java`` 並選擇 ``settings.gradle`` 檔案。

source: the source code for the Android port of the Godot Editor.
de: den Quellcode für die Android-Portierung des Godot-Editors.
zh_tw: 存放的是 Godot Editor 的 Android 移植版的原始程式碼。

source: This module has a dependency on the ``lib`` module.
de: Dieses Modul ist abhängig von dem Modul ``lib``.
zh_tw: 這個模組依賴於 ``lib`` 模組。

source: ``app`` module:
de: Modul ``app``:
zh_tw: ``app`` 模組：

source: Located under ``<Godot root directory>/platform/android/java/app``, this is an **application module** that holds
de: Es befindet sich unter ``<Godot-Stammverzeichnis>/platform/android/java/app`` und ist ein **Anwendungsmodul**, das Folgendes enthält
zh_tw: 前往 ``<Godot 根目錄>/platform/android/java`` 並選擇 ``settings.gradle`` 檔案。

source: the source code for the Android build templates.
de: den Quellcode für die Android-Build-Vorlagen.
zh_tw: 存放的是 Android 建構範本的原始程式碼。

source: Building & debugging the editor module
de: Bauen und Debuggen des Editormoduls
zh_tw: 內建主題編輯器。

source: To build the ``editor`` module:
de: Um das ``Editor``-Modul zu bauen:
zh_tw: 要建構 ``editor`` 模組：

source: Select the `Run/Debug Configurations drop down <https://developer.android.com/studio/run/rundebugconfig#running>`_ and select ``editor``.
de: Wählen Sie das `Dropdown-Menü Run/Debug Configurations <https://developer.android.com/studio/run/rundebugconfig#running>`_ und wählen Sie ``editor``.
zh_tw: 選擇「執行/偵錯設定」下拉列表 <https://developer.android.com/studio/run/rundebugconfig#running>`_ 並選擇「editor」。

source: Select **Run > Run 'editor'** from the top menu or `click the Run icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
de: Wählen Sie **Run > Run 'editor'** aus dem oberen Menü oder `klicken Sie auf das Run-Icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 依照這裡的 `指示 <https://developer.android.com/studio/intro/update#sdk-manager>`__ 執行一次 Android Studio 來完成設定 SDK。

source: To debug the ``editor`` module:
de: Um das ``Editor``-Modul zu debuggen:
zh_tw: 要除錯 ``editor`` 模組：

source: Open the **Build Variants** window using **View > Tools Windows > Build Variants** from the top menu.
de: Öffnen Sie das Fenster **Build Variants** mit **View > Tools Windows > Build Variants** aus dem oberen Menü.
zh_tw: 使用頂部選單中的 **View > Tools Windows > Build Variants** 開啟 **Build Variants** 視窗。

source: In the **Build Variants** window, make sure that in the **Active Build Variant** column, the ``:editor`` entry is set to **dev**.
de: Im Fenster **Build Variants** stellen Sie sicher, dass in der Spalte **Active Build Variant** der Eintrag ``:editor`` auf **dev** gesetzt ist.
zh_tw: 在 **Build Variants** 視窗中，確保在 **Active Build Variant** 列中，``:editor`` 條目設定為 **dev**。

source: Open the **Run/Debug Configurations** window by clicking on **Run > Edit Configurations...** on the top menu.
de: Öffnen Sie das Fenster **Run/Debug Configurations**, indem Sie im oberen Menü auf **Run > Edit Configurations...** klicken.
zh_tw: 點擊頂部選單上的 **執行 > 編輯配置...** 開啟 **運作/除錯配置** 視窗。

source: In the **Run/Debug Configurations** window, select the ``editor`` entry, and under **Debugger** make sure the **Debug Type** is set to ``Dual (Java + Native)``
de: Wählen Sie im Fenster **Run/Debug Configurations** den Eintrag ``editor`` und stellen Sie unter **Debugger** sicher, dass der **Debug-Type** auf ``Dual (Java + Native)`` gesetzt ist
zh_tw: 在“運作/除錯配置”視窗中，選擇“編輯器”條目，並在“除錯器”下確保“除錯型別”設定為“雙（Java + 本機）”

source: Select **Run > Debug 'editor'** from the top menu or `click the Debug icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
de: Wählen Sie **Run > Debug 'editor'** aus dem oberen Menü oder `klicken Sie auf das Debug-Icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 依照這裡的 `指示 <https://developer.android.com/studio/intro/update#sdk-manager>`__ 執行一次 Android Studio 來完成設定 SDK。

source: Building & debugging the app module
de: Bauen und Debuggen des App-Moduls
zh_tw: 應用模組的建構與除錯

source: The ``app`` module requires the presence of a Godot project in its ``assets`` directory (``<Godot root directory>/platform/android/java/app/assets``) to run. This is usually handled by the Godot Editor during the export process. While developing in Android Studio, it's necessary to manually add a Godot project under that directory to replicate the export process. Once that's done, you can follow the instructions below to run/debug the ``app`` module:
de: Das Modul ``app`` erfordert das Vorhandensein eines Godot-Projekts in seinem ``assets``-Verzeichnis (``<Godot-Stammverzeichnis>/platform/android/java/app/assets``), damit es läuft. Dies wird normalerweise vom Godot-Editor während des Exportvorgangs erledigt. Bei der Entwicklung in Android Studio ist es notwendig, manuell ein Godot-Projekt unter diesem Verzeichnis hinzuzufügen, um den Exportprozess zu replizieren. Sobald dies geschehen ist, können Sie die folgenden Anweisungen befolgen, um das Modul ``app`` zu starten/debuggen:
zh_tw: 「app」 模組需要在其「assets」 目錄（「<Godot 根目錄>/platform/android/java/app/assets」）中存在 Godot 專案才能運作。這通常由 Godot 編輯器在匯出過程中處理。在Android Studio中開發時，需要在該目錄下手動新增Godot專案來複製匯出過程。完成後，您可以按照以下說明運作/除錯“app”模組：

source: To build the ``app`` module:
de: Um das Modul ``app`` zu erstellen:
zh_tw: 要建置“app”模組：

source: Select the `Run/Debug Configurations drop down <https://developer.android.com/studio/run/rundebugconfig#running>`_ and select ``app``.
de: Wählen Sie die Dropdown-Liste `Run/Debug Configurations <https://developer.android.com/studio/run/rundebugconfig#running>`_ und wählen Sie ``app``.
zh_tw: 選擇「執行/偵錯設定」下拉列表 <https://developer.android.com/studio/run/rundebugconfig#running>`_ 並選擇「app」。

source: Select **Run > Run 'app'** from the top menu or `click the Run icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
de: Wählen Sie **Run > Run 'app'** aus dem oberen Menü oder `klicken Sie auf das Ausführen-Icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 從頂部選單中選擇 **執行 > 執行「應用程式」** 或「點選執行圖示 <https://developer.android.com/studio/run/rundebugconfig#running>」。

source: To debug the ``app`` module:
de: Um das ``app``-Modul zu debuggen:
zh_tw: 除錯“app”模組：

source: In the **Build Variants** window, make sure that in the **Active Build Variant** column, the ``:app`` entry is set to **dev**.
de: Stellen Sie sicher, dass im Fenster **Build Variants** in der Spalte **Active Build Variant** der Eintrag ``:app`` auf **dev** gesetzt ist.
zh_tw: 在 **Build Variants** 視窗中，請確保在 **Active Build Variant** 欄位中，``:app`` 條目設定為 **dev**。

source: In the **Run/Debug Configurations** window, select the ``app`` entry, and under **Debugger** make sure the **Debug Type** is set to ``Dual (Java + Native)``
de: Wählen Sie im Fenster **Run/Debug Configurations** den Eintrag ``app`` und stellen Sie unter **Debugger** sicher, dass der **Debug-Typ** auf ``Dual (Java + Native)`` gesetzt ist
zh_tw: 在“運作/除錯配置”視窗中，選擇“app”條目，並在“除錯器”下確保“除錯型別”設定為“雙（Java + 本機）”

source: Select **Run > Debug 'app'** from the top menu or `click the Debug icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
de: Wählen Sie **Run > Debug 'app'** aus dem oberen Menü oder `klicken Sie auf das Debug-Icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 從頂部選單中選擇 **執行 > 偵錯「應用程式」** 或點擊「偵錯」圖示 <https://developer.android.com/studio/run/rundebugconfig#running>`_。

source: If you run into any issues, ask for help in `Godot's Android dev channel <https://chat.godotengine.org/channel/android>`__.
de: Wenn Sie auf Probleme stoßen, bitten Sie um Hilfe im `Godot Android Dev Channel <https://chat.godotengine.org/channel/android>`__.
zh_tw: 若遇到任何問題，請在 `任何一個 Godot 的社群頻道 <https://godotengine.org/community>`__ 中尋求幫助。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
