Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/clion.po
Languages: de, zh_tw

source: `CLion <https://www.jetbrains.com/clion/>`_ is a commercial `JetBrains <https://www.jetbrains.com/>`_ IDE for C++.
de: `CLion <https://www.jetbrains.com/clion/>`_ ist eine kommerzielle `JetBrains <https://www.jetbrains.com/>`_-IDE für C++.
zh_tw: `CLion <https://www.jetbrains.com/clion/>`_ 是用於 C++ 的商業版 `JetBrains <https://www.jetbrains.com/>`_ IDE。

source: Importing the project
de: Projekt importieren
zh_tw: 匯入專案

source: CLion can import a project's `compilation database file <https://clang.llvm.org/docs/JSONCompilationDatabase.html>`_, commonly named ``compile_commands.json``. To generate the compilation database file, open the terminal, change to the Godot root directory, and run:
de: CLion kann die `Kompilierungsdatenbankdatei <https://clang.llvm.org/docs/JSONCompilationDatabase.html>`_ eines Projekts importieren, die üblicherweise ``compile_commands.json`` heißt. Um die Kompilierungsdatenbankdatei zu erzeugen, öffnen Sie das Terminal, wechseln Sie in das Godot-Stammverzeichnis und führen Sie aus:
zh_tw: CLion 可以匯入專案的編譯資料庫檔案<https://clang.llvm.org/docs/JSONCompilationDatabase.html>`_，通常名稱為「compile_commands.json」。若要產生編譯資料庫檔案，請開啟終端，切換到Godot根目錄，然後執行：

source: Then, open the Godot root directory with CLion. CLion will import the compilation database, index the codebase, and provide autocompletion and other advanced code navigation and refactoring functionality.
de: Öffnen Sie dann das Godot-Stammverzeichnis mit CLion. CLion importiert die Kompilierungsdatenbank, indiziert die Codebasis und bietet Autocompletion und andere fortschrittliche Code-Navigations- und Refactoring-Funktionen.
zh_tw: 然後，使用 CLion 開啟 Godot 根目錄。 CLion 將匯入編譯資料庫、索引程式碼庫，並提供自動完成和其他進階程式碼導覽和重構功能。

source: Compiling and debugging the project
de: Kompilieren und Debuggen des Projekts
zh_tw: 對專案進行除錯

source: CLion does not support compiling and debugging Godot via SCons out of the box. This can be achieved by creating a custom build target and run configuration in CLion. Before creating a custom build target, you must :ref:`compile Godot <toc-devel-compiling>` once on the command line, to generate the Godot executable. Open the terminal, change into the Godot root directory, and execute:
de: CLion unterstützt das Kompilieren und Debuggen von Godot über SCons nicht von Haus aus. Dies kann durch die Erstellung eines benutzerdefinierten Build-Targets und einer Run-Konfiguration in CLion erreicht werden. Bevor Sie ein benutzerdefiniertes Build-Target erstellen, müssen Sie Godot einmal auf der Kommandozeile :ref:`kompilieren <toc-devel-compiling>`, um die ausführbare Godot-Datei zu erzeugen. Öffnen Sie das Terminal, wechseln Sie in das Godot-Stammverzeichnis und führen Sie aus:
zh_tw: CLion 不支援開箱即用地透過 SCons 編譯和除錯 Godot。這可以透過在 CLion 中建立自訂建置目標和運作配置來實作。在建立自訂建置目標之前，您必須在命令列上編譯 Godot <toc-devel-compiling>` 一次，以產生 Godot 執行檔。開啟終端，切換到Godot根目錄，然後執行：

source: To add a custom build target that invokes SCons for compilation:
de: So fügen Sie ein benutzerdefiniertes Build-Target hinzu, das SCons zur Kompilierung aufruft:
zh_tw: 若要新增呼叫 SCons 進行編譯的自訂建置目標：

source: Open CLion and navigate to **Preferences > Build, Execution, Deployment > Custom Build Targets**
de: Öffnen Sie CLion und navigieren Sie zu **Preferences > Build, Execution, Deployment > Custom Build Targets**
zh_tw: 開啟 CLion 並導覽至 **首選項 > 建置、執行、部署 > 自訂建置目標**

source: Click **Add target** and give the target a name, e.g. ``Godot debug``.
de: Klicken Sie auf **Add target** und geben Sie dem Ziel einen Namen, z.B. ``Godot debug``.
zh_tw: 按一下“**新增目標**”並為目標命名，例如“Godot debug”。

source: Click **...** next to the **Build:** selectbox, then click the **+** button in the **External Tools** dialog to add a new external tool.
de: Klicken Sie auf **...** neben dem Auswahlfeld **Build:** und dann auf den Button **+** im Dialogfeld **External Tools**, um ein neues externes Tool hinzuzufügen.
zh_tw: 按一下 **Build:** 選擇方塊旁的 **...**，然後按一下 **External Tools** 對話方塊中的 **+** 按鈕以新增新的外部工具。

source: Give the tool a name, e.g. ``Build Godot debug``, set **Program** to ``scons``, set **Arguments** to the compilation settings you want (see :ref:`compiling Godot <toc-devel-compiling>`), and set the **Working directory** to ``$ProjectFileDir$``, which equals the Godot root directory. Click **OK** to create the tool.
de: Geben Sie dem Tool einen Namen, z.B. ``Build Godot debug``, setzen Sie **Program** auf ``scons``, setzen Sie **Arguments** auf die gewünschten Kompilierungseinstellungen (siehe :ref:`Godot kompilieren <toc-devel-compiling>`), und setzen Sie das **Working directory** auf ``$ProjectFileDir$``, was dem Godot-Stammverzeichnis entspricht. Klicken Sie auf **OK**, um das Tool zu erstellen.
zh_tw: 為工具命名，例如“Build Godot debug”，將 **Program** 設定為“scons”，將 **Arguments** 設定為您想要的編譯設定（請參閱:ref:`編譯 Godot <toc -devel -compiling>`)，並將**工作目錄** 設定為``$ProjectFileDir$``，它等於Godot 根目錄。按一下 **確定** 建立該工具。

source: CLion does not expand shell commands like ``scons -j$(nproc)``. Use concrete values instead, e.g. ``scons -j8``.
de: CLion expandiert keine Shell-Befehle wie ``scons -j$(nproc)``. Verwenden Sie stattdessen konkrete Werte, z.B. ``scons -j8``.
zh_tw: CLion 不會擴充諸如「scons -j$(nproc)」之類的 shell 指令。請使用具體值，例如“scons -j8”。

source: Back in the **External Tools** dialog, click the **+** again to add a second external tool for cleaning the Godot build via SCons. Give the tool a name, e.g. ``Clean Godot debug``, set **Program** to ``scons``, set **Arguments** to ``-c`` (which will clean the build), and set the **Working directory** to ``$ProjectFileDir$``. Click **OK** to create the tool.
de: Zurück im **External Tools**-Dialog, klicken Sie erneut auf **+**, um ein zweites externes Tool für die Bereinigung des Godot-Builds über SCons hinzuzufügen. Geben Sie dem Tool einen Namen, z.B. ``Clean Godot debug``, setzen Sie **Program** auf ``scons``, setzen Sie **Arguments** auf ``-c`` (was den Build bereinigt), und setzen Sie das **Working directory** auf ``$ProjectFileDir$``. Klicken Sie **OK**, um das Tool zu erstellen.
zh_tw: 返回 **外部工具** 對話框，再次按一下 **+** 以新增第二個外部工具，用於透過 SCons 清理 Godot 建置。為該工具命名，例如“Clean Godot debug”，將 **Program** 設為“scons”，將 **Arguments** 設為“-c”（這將清理建置），然後將**工作目錄* * 設定為``$ProjectFileDir$``。按一下 **確定** 建立該工具。

source: Close the **External Tools** dialog. In the **Custom Build Target** dialog for the custom ``Godot debug`` build target, select the **Build Godot debug** tool from the **Build** select box, and select the **Clean Godot debug** tool from the **Clean** select box. Click **OK** to create the custom build target.
de: Schließen Sie das Dialogfeld **External Tools**. Im Dialog **Custom Build Target** für das benutzerdefinierte ``Godot-Debug``-Build-Target, wählen Sie das **Build Godot debug**-Tool aus dem **Build**-Auswahlfeld, und wählen Sie das **Clean Godot Debug**-Tool aus dem **Clean**-Auswahlfeld. Klicken Sie auf **OK**, um das benutzerdefinierte Build-Target zu erstellen.
zh_tw: 關閉**外部工具**對話框。在自訂「Godot debug」建置目標的 **Custom Build Target** 對話方塊中，從 **Build** 選擇方塊中選擇 **Build Godot debug** 工具，然後選擇 **Clean Godot debug ** * *清潔** 選擇框中的工具。按一下 **確定** 建立自訂建置目標。

source: In the main IDE window, click **Add Configuration**.
de: Klicken Sie im IDE-Hauptfenster auf **Add Configuration**.
zh_tw: 在主 IDE 視窗中，按一下「**新增配置**」。

source: In the **Run/Debug Configuration** dialog, click **Add new...**, then select **Custom Build Application** to create a new custom run/debug configuration.
de: Klicken Sie im Dialogfeld **Run/Debug Configuration** auf **Add new...**, und wählen Sie dann **Custom Build Application**, um eine neue benutzerdefinierte Run/Debug-Konfiguration zu erstellen.
zh_tw: 在 **執行/偵錯配置** 對話方塊中，按一下 **新增...**，然後選擇 **自訂建置應用程式** 以建立新的自訂運作/偵錯配置。

source: Give the run/debug configuration a name, e.g. ``Godot debug``, select the ``Godot debug`` custom build target as the **Target**. Select the Godot executable in the ``bin/`` folder as the **Executable**, and set the **Program arguments** to ``--editor --path path-to-your-project/``, where ``path-to-your-project/`` should be a path pointing to an existing Godot project. If you omit the ``--path`` argument, you will only be able to debug the Godot Project Manager window. Click **OK** to create the run/debug configuration.
de: Geben Sie der Run/Debug-Konfiguration einen Namen, z.B. ``Godot debug``, wählen Sie das benutzerdefinierte Build-Target ``Godot debug`` als **Target**. Wählen Sie die ausführbare Godot-Datei im ``bin/``-Ordner als **Executable**, und setzen Sie **Program arguments** auf ``--editor --path path-to-your-project/``, wobei ``path-to-your-project/`` ein Pfad sein sollte, der auf ein existierendes Godot-Projekt zeigt. Wenn Sie das Argument ``--path`` weglassen, können Sie nur das Godot-Projektmanager-Fenster debuggen. Klicken Sie auf **OK**, um die Run/Debug-Konfiguration zu erstellen.
zh_tw: 為運作/偵錯配置命名，例如“Godot debug”，選擇“Godot debug”自訂建置目標作為**目標**。選擇“bin/”資料夾中的Godot可執行檔作為**可執行檔**，並將**程式參數**設為“--editor --path path-to-your-project/”，其中``path-to-your-project/``應該是指向現有Godot專案的路徑。如果省略「--path」參數，您將只能偵錯 Godot 專案管理器視窗。按一下 **確定** 建立運作/偵錯配置。

source: You can now build, run, debug, profile, and Valgrind check the Godot editor via the run configuration.
de: Sie können jetzt den Godot-Editor über die Run-Konfiguration bauen, ausführen, debuggen, profilen und mit Valgrind prüfen.
zh_tw: 現在您可以透過執行設定來建置、運作、偵錯、分析和檢查 Godot 編輯器。

source: When playing a scene, the Godot editor will spawn a separate process. You can debug this process in CLion by going to **Run > Attach to process...**, typing ``godot``, and selecting the Godot process with the highest **pid** (process ID), which will usually be the running project.
de: Wenn eine Szene abgespielt wird, erzeugt der Godot-Editor einen separaten Prozess. Sie können diesen Prozess in CLion debuggen, indem Sie **Run > Attach to process...** aufrufen, ``godot`` eingeben und den Godot-Prozess mit der höchsten **pid** (Prozess-ID) auswählen, was normalerweise das laufende Projekt ist.
zh_tw: 播放場景時，Godot 編輯器將產生一個單獨的程序。您可以在CLion 中偵錯此程序，方法是前往**Run > Attach to process...**，輸入``godot``，然後選擇具有最高**pid**（程序ID）的Godot 程序，這將通常是正在運作的專案。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
