Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/code_blocks.po
Languages: de

source: `Code::Blocks <https://codeblocks.org/>`_ is a free, open source, cross platform IDE.
de: `Code::Blocks <https://codeblocks.org/>`_ ist eine kostenlose, plattformübergreifende Open-Source-IDE.

source: Creating a new project
de: Erstellen eines neuen Projekts

source: From Code::Blocks' main screen, click **Create a new project** or select **File > New > Project...**.
de: Klicken Sie im Hauptfenster von Code::Blocks auf **Erstelle ein neues Projekt** oder wählen Sie **Datei > Neu > Projekt...**.

source: In the **New from template** window, from **Projects**, select **Empty project**, and click **Go**.
de: Wählen Sie im Fenster **Neu aus Vorlage** unter **Projekte** die Option **Leeres Projekt** und klicken Sie auf **Los**.

source: Click Next, to pass the welcome to the new empty project wizard.
de: Klicken Sie auf Weiter, um den Wizard für neue Projekte zu starten.

source: The project file should be created in the root of the cloned project folder. To achieve this, first, ensure that the **Project title** is the same as the folder name that Godot was cloned into. Unless you cloned the project into a folder with a different name, this will be ``godot``.
de: Die Projektdatei sollte im Stammverzeichnis des geklonten Projektordners erstellt werden. Vergewissern Sie sich dazu zunächst, dass der **Projekttitel** mit dem Namen des Ordners übereinstimmt, in den Godot geklont wurde. Sofern Sie das Projekt nicht in einen Ordner mit einem anderen Namen geklont haben, lautet dieser ``godot``.

source: Second, ensure that the **Folder to create project in** is the folder you ran the Git clone command from, not the ``godot`` project folder. Confirm that the **Resulting filename** field will create the project file in the root of the cloned project folder.
de: Stellen Sie zweitens sicher, dass der **Verzeichnis in dem das Projekt erstellt werden soll** der Ordner ist, in dem Sie den Git-Clone-Befehl ausgeführt haben, und nicht der Projektordner ``godot``. Bestätigen Sie, dass das Feld **Ausgabedatei-Namen wählen** die Projektdatei im Stammverzeichnis des geklonten Projektordners erstellt.

source: The compiler and configuration settings are managed through **SCons** and will be configured later. However, it's worth deselecting the **Create "Release" configuration** option; so only a single build target is created before clicking **Finish**.
de: Der Compiler und die Konfigurationseinstellungen werden über **SCons** verwaltet und später konfiguriert. Es lohnt sich jedoch, die Option **"Release"-Konfiguration erstellen** zu deaktivieren, damit nur ein einziges Build-Target erstellt wird, bevor Sie auf **Beenden** klicken.

source: Configuring the build
de: Den Build anpassen

source: The first step is to change the project properties. Right-click on the new project and select **Properties...**.
de: Der erste Schritt besteht darin, die Projekteigenschaften zu ändern. Klicken Sie mit der rechten Maustaste auf das neue Projekt und wählen Sie **Eigenschaften...**.

source: Check the **This is a custom Makefile** property. Click OK to save the changes.
de: Überprüfen Sie die **Dies ist ein benutzerdefiniertes Makefile** -Eigenschaft. Klicken Sie auf OK, um die Änderungen zu speichern.

source: The next step is to change the build options. Right-click on the new project and select **Build Options...**.
de: Der nächste Schritt besteht darin, die Erstellungsoptionen zu ändern. Klicken Sie mit der rechten Maustaste auf das neue Projekt und wählen Sie **Build-Optionen...**.

source: Select the **"Make" commands** tab and remove all the existing commands for all the build targets. For each build target enter the **SCons** command for creating the desired build in the **Build project/target** field. The minimum is ``scons``. For details on the **SCons** build options, see :ref:`doc_introduction_to_the_buildsystem`. It's also useful to add the ``scons --clean`` command in the **Clean project/target** field to the project's default commands.
de: Wählen Sie den Tab **"Make"-Befehle** und entfernen Sie alle vorhandenen Befehle für alle Build-Targets. Geben Sie für jedes Build-Target den **SCons**-Befehl zur Erstellung des gewünschten Builds in das Feld **Project/Ziel erstellen** ein. Das Minimum ist ``scons``. Für Details zu den **SCons** Build-Optionen, siehe :ref:`doc_introduction_to_the_buildsystem`. Es ist auch nützlich, den Befehl ``scons --clean`` im Feld **Project/Ziel bereinigen** zu den Standardbefehlen des Projekts hinzuzufügen.

source: If you're using Windows, all the commands need to be preceded with ``cmd /c`` to initialize the command interpreter.
de: Wenn Sie Windows benutzen, müssen Sie allen Befehlen ``cmd /c`` voranstellen, um den Befehlsinterpreter zu initialisieren.

source: Windows example:
de: Windows-Beispiel:

source: Code::Blocks should now be configured to build Godot; so either select **Build > Build**, click the gear button, or press :kbd:`Ctrl + F9`.
de: Code::Blocks sollten jetzt so konfiguriert werden, dass Godot erstellt wird. Wählen Sie entweder **Erstellen > Erstellen**, klicken Sie auf den Zahnrad-Button oder drücken Sie :kbd:`Strg + F9`.

source: Configuring the run
de: Konfigurieren des Starts

source: Once **SCons** has successfully built the desired target, reopen the project **Properties...** and select the **Build targets** tab. In the **Output filename** field, browse to the ``bin`` folder and select the compiled file.
de: Wenn **SCons** das gewünschte Target erfolgreich kompiliert hat, öffnen Sie erneut die Projekt-**Eigenschaften...** und wählen Sie den Tab **Ziele erstellen**. Im Feld **Ausgabe Dateiname** navigieren Sie zum Ordner ``bin`` und wählen die kompilierte Datei aus.

source: Deselect the **Auto-generate filename prefix** and **Auto-generate filename extension** options.
de: Deaktivieren Sie die Optionen **Automatisches Generieren des Dateinamen-Präfix** und **Automatisches Generieren der Dateinamenerweiterung**.

source: Code::Blocks should now be configured to run your compiled Godot executable; so either select **Build > Run**, click the green arrow button, or press :kbd:`Ctrl + F10`.
de: Code::Blocks sollte nun so konfiguriert sein, dass es Ihre kompilierte Godot-Datei ausführt; wählen Sie also entweder **Erstellen > Ausführen**, klicken Sie auf den grünen Pfeil, oder drücken Sie :kbd:`Strg + F10`.

source: There are two additional points worth noting. First, if required, the **Execution working dir** field can be used to test specific projects, by setting it to the folder containing the ``project.godot`` file. Second, the **Build targets** tab can be used to add and remove build targets for working with and creating different builds.
de: Es gibt zwei weitere Punkte, die erwähnenswert sind. Erstens kann das Feld **Arbeitsverzeichis der ausführbaren Datei** bei Bedarf verwendet werden, um bestimmte Projekte zu testen, indem es auf den Ordner gesetzt wird, der die Datei ``project.godot`` enthält. Zweitens kann der Tab **Buildziele** verwendet werden, um Build-Targets für die Arbeit mit und die Erstellung von verschiedenen Builds hinzuzufügen oder zu entfernen.

source: Adding files to the project
de: Dateien zum Projekt hinzufügen

source: To add all the Godot code files to the project, right-click on the new project and select **Add files recursively...**.
de: Um alle Godot-Code-Dateien zum Projekt hinzuzufügen, klicken Sie mit der rechten Maustaste auf das neue Projekt und wählen Sie **Dateien rekursiv hinzufügen...**.

source: It should automatically select the project folder; so simply click **Open**. By default, all code files are included, so simply click **OK**.
de: Der Projektordner sollte automatisch ausgewählt werden; klicken Sie also einfach auf **Öffnen**. Standardmäßig sind alle Codedateien enthalten, klicken Sie also einfach auf **OK**.

source: Code style configuration
de: Konfiguration des Codestils

source: Before editing any files, remember that all code needs to comply with the :ref:`doc_code_style_guidelines`. One important difference with Godot is the use of tabs for indents. Therefore, the key default editor setting that needs to be changed in Code::Blocks is to enable tabs for indents. This setting can be found by selecting **Settings > Editor**.
de: Bevor Sie irgendwelche Dateien bearbeiten, denken Sie daran, dass der gesamte Code den :ref:`doc_code_style_guidelines` entsprechen muss. Ein wichtiger Unterschied zu Godot ist die Verwendung von Tabulatoren für Einrückungen. Daher ist die wichtigste Default-Editor-Einstellung, die in Code::Blocks geändert werden muss, die Aktivierung von Tabulatoren für Einrückungen. Diese Einstellung finden Sie unter **Einstellungen > Editor**.

source: Under **General Settings**, on the **Editor Settings** tab, under **Tab Options** check **Use TAB character**.
de: Aktivieren Sie unter **General Settings** im Tab **Editor-Einstellungen** unter **Tab-Optionen** die Option **Benutze TAB-Zeichen**.

source: That's it. You're ready to start contributing to Godot using the Code::Blocks IDE. Remember to save the project file and the **Workspace**. If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
de: Das war's. Sie sind bereit, mit der Code::Blocks IDE zu Godot beizutragen. Denken Sie daran, die Projektdatei und den **Arbeitsbereich** zu speichern. Wenn Sie auf Probleme stoßen, bitten Sie in einem der `Godot-Community-Kanäle <https://godotengine.org/community>`__ um Hilfe.

source: Translation status
de: Übersetzungsstatus
