Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/rider.po
Languages: de, zh_tw

source: Rider
zh_tw: Rider 中：

source: `Rider <https://www.jetbrains.com/rider/>`_ is a commercial `JetBrains <https://www.jetbrains.com/>`_ IDE for C# and C++ that uses the same solution system as Visual Studio.
de: `Rider <https://www.jetbrains.com/rider/>`_ ist eine kommerzielle `JetBrains <https://www.jetbrains.com/>`_-IDE für C# und C++, die das gleiche Solution-System wie Visual Studio verwendet.
zh_tw: `CLion <https://www.jetbrains.com/clion/>`_ 是用於 C++ 的商業版 `JetBrains <https://www.jetbrains.com/>`_ IDE。

source: Importing the project
de: Projekt importieren
zh_tw: 匯入專案

source: If you already use Visual Studio as your main IDE, you can use the same solution file in Rider. Rider and Visual Studio use the same solution format, so you can switch between the two IDEs without rebuilding the solution file. Debug configurations need to be changed when going from one IDE to another.
de: Wenn Sie bereits Visual Studio als Haupt-IDE verwenden, können Sie dieselbe Solution-Datei in Rider verwenden. Rider und Visual Studio verwenden das gleiche Solution-Format, so dass Sie zwischen den beiden IDEs wechseln können, ohne die Solution-Datei neu erstellen zu müssen. Debug-Konfigurationen müssen geändert werden, wenn Sie von einer IDE zur anderen wechseln.
zh_tw: 如果您已使用 Visual Studio 作為主 IDE，則可以在 Rider 中使用相同的解決方案檔案。 Rider 和 Visual Studio 使用相同的解決方案格式，因此您可以在兩個 IDE 之間切換，而無需重建解決方案檔案。從一種 IDE 轉到另一種 IDE 時，需要變更偵錯配置。

source: Rider requires a solution file to work on a project. While Godot does not come with the solution file, it can be generated using SCons.
de: Rider benötigt eine Solution-Datei, um an einem Projekt zu arbeiten. Godot wird zwar nicht mit einer Solution-Datei geliefert, diese kann jedoch mit SCons erstellt werden.
zh_tw: 使用 Visual Studio 會需要一個解決方案檔案。雖然 Godot 沒有附帶解決方案檔，但可以通過 SCons 來產生。

source: Navigate to the Godot root folder and open a Command Prompt or PowerShell window.
de: Navigieren Sie zum Godot-Stammverzeichnis und öffnen Sie eine Eingabeaufforderung oder ein PowerShell-Fenster.
zh_tw: 前往 Godot 根目錄，並開啟命令提示字元或 PowerShell 視窗。

source: Copy, paste and run the next command to generate the solution.
de: Kopieren Sie den nächsten Befehl, fügen Sie ihn ein und führen Sie ihn aus, um die Solution zu erstellen.
zh_tw: 複製、貼上並執行下一個命令以產生解決方案。

source: The ``vsproj`` parameter signals that you want Visual Studio solution generated. The ``dev_build`` parameter makes sure the debug symbols are included, allowing to e.g. step through code using breakpoints.
de: Der Parameter ``vsproj`` gibt an, dass Sie eine Visual Studio-Solution erzeugen wollen. Der Parameter ``dev_build`` stellt sicher, dass die Debug-Symbole enthalten sind, was z.B. das Durchlaufen des Codes mit Hilfe von Haltepunkten ermöglicht.
zh_tw: ``vsproj`` 參數表示您希望產生 Visual Studio 解決方案。 ``dev_build`` 參數確保包含偵錯符號，允許使用斷點單步執行程式碼。

source: If you have Rider setup as your main IDE for .sln, you can now open the project by double-clicking on the ``godot.sln`` in the project root or by using the **Open** option inside of Rider.
de: Wenn Sie Rider als Ihre Haupt-IDE für .sln eingerichtet haben, können Sie das Projekt nun durch einen Doppelklick auf die Datei ``godot.sln`` im Projekt-Root oder mit der Option **Open** in Rider öffnen.
zh_tw: 接著可以按兩下專案根目錄中的 ``godot.sln`` 來開啟專案，或是可以通過 Visual Studio 中的 **開啟專案或解決方案** 來開啟。

source: Rider could fail to build the first time you open the project. If that is the case, you can close Rider and open the solution in Visual Studio, build it, close Visual Studio, and open the solution in Rider again. You are now able to build the project from Rider.
de: Es kann sein, dass Rider beim ersten Öffnen das Projekts nicht bauen kann. In diesem Fall können Sie Rider schließen und die Solution in Visual Studio öffnen, sie bauen, Visual Studio schließen und die Solution erneut in Rider öffnen. Jetzt können Sie das Projekt von Rider aus bauen.
zh_tw: 第一次開啟專案時，Rider 可能無法建置。如果是這種情況，您可以關閉 Rider 並在 Visual Studio 中開啟解決方案，建置它，關閉 Visual Studio，然後再次在 Rider 中開啟解決方案。現在您可以從 Rider 建立專案。

source: Compiling and debugging the project
de: Kompilieren und Debuggen des Projekts
zh_tw: 對專案進行除錯

source: Rider comes with a built-in debugger that can be used to debug the Godot project. You can launch the debugger by pressing the **Debug** icon at the top of the screen, this only works for the Project manager, if you want to debug the editor, you need to configure the debugger first.
de: Rider verfügt über einen integrierten Debugger, der zum Debuggen des Godot-Projekts verwendet werden kann. Sie können den Debugger starten, indem Sie auf das Icon **Debug** oben auf dem Bildschirm drücken. Dies funktioniert nur für den Projektmanager - wenn Sie den Editor debuggen möchten, müssen Sie den Debugger zuerst konfigurieren.
zh_tw: Rider 隨附一個內建偵錯器，可用於除錯 Godot 專案。您可以按下螢幕頂部的**除錯**圖示來啟動除錯器，這只適用於專案管理器，如果您想除錯編輯器，您需要先配置除錯器。

source: Click on the **Godot > Edit Configurations** option at the top of the screen.
de: Klicken Sie auf die Option **Godot > Edit Configurations** am oberen Rand des Bildschirms.
zh_tw: 點擊 TileSet 屬性，會在編輯器視窗的下方開啟「TileSet」面板：

source: Delete what is under **Program arguments** and paste the following line:
de: Löschen Sie die Angaben unter **Program arguments** und fügen Sie die folgende Zeile ein:
zh_tw: 刪除 **程式參數** 下的內容並貼上以下行：

source: This will tell the executable to debug the specified project without using the project manager. Use the root path to the project folder, not ``project.godot`` file path.
de: Damit wird das Programm angewiesen, das angegebene Projekt zu debuggen, ohne den Projektmanager zu benutzen. Verwenden Sie den Root-Pfad zum Projektordner, nicht den Dateipfad ``project.godot``.
zh_tw: 這將告訴可執行檔在不使用專案管理器的情況下偵錯指定的專案。使用專案資料夾的根路徑，而不是「project.godot」檔案路徑。

source: Finally click on apply and ok to save the changes.
de: Klicken Sie abschließend auf Apply und OK, um die Änderungen zu speichern.
zh_tw: 最後點擊應用並確定儲存變更。

source: You can now launch the debugger by pressing the **Debug** icon at the top of the screen and it will open the project to debug.
de: Sie können nun den Debugger starten, indem Sie auf das **Debug**-Icon am oberen Rand des Bildschirms drücken, um das zu debuggende Projekt zu öffnen.
zh_tw: 現在，您可以透過按下螢幕頂部的 **除錯** 圖示來啟動除錯器，它將打開專案進行除錯。

source: Alternatively you can use **Run > Attach to Process** to attach the debugger to a running Godot instance.
de: Alternativ dazu können Sie **Run > Attach to Process** verwenden, um den Debugger an eine laufende Godot-Instanz anzuhängen.
zh_tw: 或者，您可以使用 **Run > Attach to Process** 將偵錯器附加到正在運作的 Godot 實例。

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
