Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/xcode.po
Languages: de

source: `Xcode <https://developer.apple.com/xcode>`_ is a free macOS-only IDE. You can download it from the Mac App Store.
de: `Xcode <https://developer.apple.com/xcode>`_ ist eine kostenlose MacOS-spezifische IDE. Sie können sie aus dem Mac App Store herunterladen.

source: Importing the project
de: Projekt importieren

source: From Xcode's main screen create a new project using the **Other > External Build System** template.
de: Erstellen Sie auf dem Hauptbildschirm von Xcode ein neues Projekt unter Verwendung der Vorlage **Other > External Build System**.

source: Now choose a name for your project and set the path to scons executable in build tool (to find the path you can type ``where scons`` in a terminal).
de: Wählen Sie nun einen Namen für Ihr Projekt und setzen Sie den Pfad zur ausführbaren Datei scons im Build-Tool (um den Pfad zu finden, können Sie ``where scons`` in ein Terminal eingeben).

source: Open the main target from the **Targets** section and select the **Info** tab.
de: Öffnen Sie das Haupt-Target im Abschnitt **Ziele** und wählen Sie den Tab **Info**.

source: Fill out the form with the following settings:
de: Füllen Sie das Formular mit den folgenden Einstellungen aus:

source: Arguments
de: Argumente

source: See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
de: Siehe :ref:`doc_introduction_to_the_buildsystem` für eine komplette Liste aller Argumente.

source: Directory
de: Verzeichnis

source: A full path to the Godot root folder
de: Ein vollständiger Pfad zum Godot-Stammverzeichnis

source: Add a Command Line Tool target which will be used for indexing the project by choosing **File > New > Target...**.
de: Fügen Sie ein Kommandozeilen-Tool-Target hinzu, das für die Indexierung des Projekts verwendet wird, indem Sie **File > New > Target...** wählen.

source: Select **macOS > Application > Command Line Tool**.
de: Wählen Sie **macOS > Application > Command Line Tool**.

source: Name it something so you know not to compile with this target (e.g. ``GodotXcodeIndex``).
de: Benennen Sie es, damit Sie wissen, dass Sie nicht mit diesem Target kompilieren dürfen (z.B. ``GodotXcodeIndex``).

source: For this target open the **Build Settings** tab and look for **Header Search Paths**.
de: Öffnen Sie für dieses Target den Tab **Build Settings** und suchen nach **Header Search Paths**.

source: Set **Header Search Paths** to the absolute path to the Godot root folder. You need to include subdirectories as well. To achieve that, add two two asterisks (``**``) to the end of the path, e.g. ``/Users/me/repos/godot-source/**``.
de: Setzen Sie **Header Search Paths** auf den absoluten Pfad zum Godot-Stammverzeichnis. Sie müssen auch Unterverzeichnisse einschließen. Um dies zu erreichen, fügen Sie am Ende des Pfads zwei Sternchen (``**``) hinzu, z.B. ``/Users/me/repos/godot-source/**``.

source: Add the Godot source to the project by dragging and dropping it into the project file browser.
de: Fügen Sie die Godot-Quellcode zum Projekt hinzu, indem Sie sie in den Projektdateibrowser ziehen und dort ablegen.

source: Select **Create groups** for the **Added folders** option and check *only* your command line indexing target in the **Add to targets** section.
de: Wählen Sie **Create groups** für die Option **Added folders** und markieren Sie *nur* Ihr Kommandozeilen-Indizierungs-Target im Abschnitt **Add to targets**.

source: Xcode will now index the files. This may take a few minutes.
de: Xcode indiziert nun die Dateien. Dies kann einige Minuten dauern.

source: Once Xcode is done indexing, you should have jump-to-definition, autocompletion, and full syntax highlighting.
de: Sobald die Indizierung von Xcode abgeschlossen ist, sollten Sie über "Springen zur Definition", Autovervollständigung und vollständiges Syntax-Highlighting verfügen.

source: Debugging the project
de: Debuggen des Projekts

source: To enable debugging support you need to edit the external build target's build and run schemes.
de: Um die Debugging-Unterstützung zu aktivieren, müssen Sie die Build- und Run-Konfigurationen des externen Build-Targets bearbeiten.

source: Open the scheme editor of the external build target.
de: Öffnen Sie den Schema-Editor des externen Build-Targets.

source: Locate the **Build > Post Actions** section.
de: Suchen Sie den Abschnitt **Build > Post Actions**.

source: Add a new script run action
de: Fügen Sie eine neue Skriptausführungsaktion hinzu

source: Under **Provide build settings from** select your project. This allows to reference the project directory within the script.
de: Wählen Sie unter **Provide build settings from** Ihr Projekt aus. Dadurch kann auf das Projektverzeichnis im Skript verwiesen werden.

source: Create a script that will give the binary a name that Xcode can recognize, e.g.:
de: Erstellen Sie ein Skript, das der Binärdatei einen Namen gibt, der von Xcode erkannt werden kann, z.B.:

source: Build the external build target.
de: Erstellen Sie das externe Build-Target.

source: Open the scheme editor again and select **Run**.
de: Öffnen Sie den Schema-Editor erneut und wählen Sie **Ausführen**.

source: Set the **Executable** to the file you linked in your post-build action script.
de: Setzen Sie **Ausführbar** für die Datei fest, die Sie in Ihrem Post-Build-Aktionsskript verknüpft haben.

source: Check **Debug executable**.
de: Aktivieren Sie **Debug ausführbare Datei**.

source: You can add two arguments on the **Arguments** tab: the ``-e`` flag opens the editor instead of the Project Manager, and the ``--path`` argument tells the executable to open the specified project (must be provided as an *absolute* path to the project root, not the ``project.godot`` file).
de: Sie können zwei Argumente auf dem **Arguments**-Tab hinzufügen: das ``-e``-Flag öffnet den Editor anstelle des Projektmanagers, und das ``--path``-Argument weist die ausführbare Datei an, das angegebene Projekt zu öffnen (muss als *absoluter* Pfad zum Projekt-Root angegeben werden, nicht die Datei ``project.godot``).

source: To check that everything is working, put a breakpoint in ``platform/macos/godot_main_macos.mm`` and run the project.
de: Um zu überprüfen, ob alles funktioniert, setzen Sie einen Haltepunkt in ``platform/macos/godot_main_macos.mm`` und starten das Projekt.

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
de: Wenn Sie auf Probleme stoßen, bitten Sie um Hilfe in einem von `Godots Community-Kanälen <https://godotengine.org/community>`__.

source: Translation status
de: Übersetzungsstatus
