Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/interpolation.po
Languages: de, zh_tw

source: Interpolation
zh_tw: 插值

source: Interpolation is a very basic operation in graphics programming. It's good to become familiar with it in order to expand your horizons as a graphics developer.
de: Interpolation ist eine sehr grundlegende Operation in der Grafikprogrammierung. Es ist gut, sich damit vertraut zu machen um Ihren Horizont als Grafikentwickler zu erweitern.
zh_tw: 插值是圖形程式設計中一個非常基本的操作. 作為一名圖形開發人員, 熟悉它有助於擴充您的視野.

source: The basic idea is that you want to transition from A to B. A value ``t``, represents the states in-between.
de: Die Grundidee ist, dass Sie einen Übergang von A nach B gestalten möchten. Ein Wert ``t`` repräsentiert die dazwischen liegenden Zustände.
zh_tw: 基本思想是從 A 轉換到 B。``t`` 值是介於兩者之間的狀態。

source: For example, if ``t`` is 0, then the state is A. If ``t`` is 1, then the state is B. Anything in-between is an *interpolation*.
de: Wenn ``t`` zum Beispiel 0 ist, dann ist der Zustand A. Wenn ``t`` 1 ist, dann ist der Zustand B. Alles dazwischen ist eine *Interpolation*.
zh_tw: 舉個例子, 如果 ``t`` 值為0, 那麼狀態是A. 如果 ``t`` 值是1, 狀態是B. 任何介於兩者之間的都是 *插值*.

source: Between two real (floating-point) numbers, an interpolation can be described as:
de: Eine Interpolation zwischen zwei reellen (Float-) Zahlen kann wie folgt beschrieben werden:
zh_tw: 在兩個實數(浮點數)之間, 一個簡單的插值通常描述為:

source: And often simplified to:
de: Und wird oft vereinfacht zu:
zh_tw: 通常簡化為:

source: The name of this type of interpolation, which transforms a value into another at *constant speed* is *"linear"*. So, when you hear about *Linear Interpolation*, you know they are referring to this formula.
de: Die Bezeichnung für diese Art der Interpolation, bei der ein Wert mit *konstanter Geschwindigkeit* in einen anderen umgewandelt wird, lautet *"linear"*. Wenn Sie also von *Linearer Interpolation* hören, wissen Sie, dass diese Formel gemeint ist.
zh_tw: 這型別的插值名字, 將一個值以 *恒定速度* 轉換成另一個值 *"線性"*. 當你聽說線性插值時, 就知道他們是指這個簡單的公式.

source: There are other types of interpolations, which will not be covered here. A recommended read afterwards is the :ref:`Bezier <doc_beziers_and_curves>` page.
de: Es gibt andere Arten von Interpolationen, die hier nicht behandelt werden. Eine empfohlene Lektüre ist anschließend die Seite :ref:`Bezier <doc_beziers_and_curves>`.
zh_tw: 還有其他型別的插值, 這裡將不做討論. 建議之後閱讀 :ref:`Bezier <doc_beziers_and_curves>` 頁面.

source: Vector interpolation
de: Vektorinterpolation
zh_tw: 向量插值

source: Vector types (:ref:`Vector2 <class_Vector2>` and :ref:`Vector3 <class_Vector3>`) can also be interpolated, they come with handy functions to do it :ref:`Vector2.lerp() <class_Vector2_method_lerp>` and :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
de: Vektortypen (:ref:`Vector2 <class_Vector2>` und :ref:`Vector3 <class_Vector3>`) können ebenfalls interpoliert werden, sie verfügen über praktische Funktionen dafür :ref:`Vector2.lerp() <class_Vector2_method_lerp>` und :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
zh_tw: 向量型別 (:ref:`Vector2 <class_Vector2>` 和 :ref:`Vector3 <class_Vector3>`) 也可以插值, 它們提供了方便的函式來實作這一點 :ref:`Vector2.linear_interpolate() <class_Vector2_method_linear_interpolate>` 和 :ref:`Vector3.linear_interpolate() <class_Vector3_method_linear_interpolate>`.

source: For cubic interpolation, there are also :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` and :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, which do a :ref:`Bezier <doc_beziers_and_curves>` style interpolation.
de: Für kubische Interpolation gibt es auch :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` und :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, die eine :ref:`Bezier <doc_beziers_and_curves>`-Interpolation durchführen.
zh_tw: 對於三次插值，還有 :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` 和 :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>` ，它們執行 :ref:`Bezier <doc_beziers_and_curves>` 式插值。

source: Here is example pseudo-code for going from point A to B using interpolation:
de: Hier ist ein Beispiel für Pseudocode, der mit Hilfe von Interpolation von Punkt A nach B verläuft:
zh_tw: 下面是使用插值從A點到B點的簡單偽程式碼:

source: It will produce the following motion:
de: Es wird die folgende Bewegung produzieren:
zh_tw: 它將產生以下運動:

source: Transform interpolation
de: Transformations-Interpolation
zh_tw: 變換插值

source: It is also possible to interpolate whole transforms (make sure they have either uniform scale or, at least, the same non-uniform scale). For this, the function :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>` can be used.
de: Es ist auch möglich, ganze Transformationen zu interpolieren (vergewissern Sie sich, dass sie entweder einen einheitlichen Maßstab oder zumindest denselben ungleichmäßigen Maßstab haben). Hierfür kann die Funktion :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>` verwendet werden.
zh_tw: 也可以對整個變換進行插值（確保它們有均勻的縮放，或者至少有相同的非均勻縮放）。對此，可以使用函式 :ref:`Transform.interpolate_with() <class_Transform_method_interpolate_with>`。

source: Here is an example of transforming a monkey from Position1 to Position2:
de: Hier ist ein Beispiel für die Transformation eines Affen von Position1 nach Position2:
zh_tw: 下面是將猴子從位置1轉換為位置2的例子:

source: Using the following pseudocode:
de: Beim Benutzen des folgenden Pseudocodes:
zh_tw: 使用以下偽程式碼:

source: And again, it will produce the following motion:
de: Und wieder wird die folgende Bewegung erzeugt:
zh_tw: 又會產生下面的動作:

source: Smoothing motion
de: Gleichmäßige Bewegung
zh_tw: 平滑運動

source: Interpolation can be used to smooth movement, rotation, etc. Here is an example of a circle following the mouse using smoothed motion:
de: Interpolation kann verwendet werden, um Bewegung, Rotation, usw. zu glätten. Hier ist ein Beispiel für einen Kreis, der mit gleichmäßiger Bewegung der Maus folgt:
zh_tw: 插值可用於平滑運動, 旋轉等. 下面是使用平滑運動跟隨滑鼠的圓圈的例子:

source: Here is how it looks:
de: So sieht es aus:
zh_tw: 如下:

source: This useful for smoothing camera movement, allies following you (ensuring they stay within a certain range), and many other common game patterns.
de: Dies ist nützlich, um Kamerabewegung zu glätten, Verbündete zu verfolgen (um sicherzustellen, dass sie innerhalb eines bestimmten Bereichs bleiben) und viele andere gängige Game Design Patterns.
zh_tw: 這對平滑相機運動很有用, 隊友在跟隨你(確保他們保持在一定範圍內), 以及許多其他常見的遊戲模式.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
