Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: de, zh_cn, zh_tw

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video about 3D linear transformations: https://www.youtube.com/watch?v=rHLEWRxRGiM
de: Wenn Sie zusätzliche Erklärungen wünschen, sollten Sie sich das exzellente Video von 3Blue1Brown über lineare 3D-Transformationen ansehen: https://www.youtube.com/watch?v=rHLEWRxRGiM
zh_cn: 如果你想要更多的解释，你可以查看 3Blue1Brown 关于 3D 线性变换的精彩视频：\ http://www.bilibili.com/video/BV1ys411472E?p=6
zh_tw: 如果你想要更多的解釋，你可以查看 3Blue1Brown 關於 3D 線性變換的精彩影片：http://www.bilibili.com/video/BV1ys411472E?p=6

source: Representing rotation in 3D (advanced)
de: Darstellung der Rotation in 3D (fortgeschritten)
zh_cn: 表示 3D 中的旋转（高级）
zh_tw: 表示 3D 中的旋轉（高級）

source: The biggest difference between 2D and 3D transformation matrices is how you represent rotation by itself without the basis vectors.
de: Der größte Unterschied zwischen 2D- und 3D-Transformationsmatrizen besteht darin, wie Sie die Rotation selbst ohne die Basisvektoren darstellen.
zh_cn: 2D 和 3D 变换矩阵之间最大的区别在于你如何在没有基向量的情况下自行表示旋转。
zh_tw: 2D 和 3D 變換矩陣之間最大的區別在於您如何在沒有基向量的情況下自行表示旋轉。

source: With 2D, we have an easy way (atan2) to switch between a transformation matrix and an angle. In 3D, rotation is too complex to represent as one number. There is something called Euler angles, which can represent rotations as a set of 3 numbers, however, they are limited and not very useful, except for trivial cases.
de: In 2D gibt es eine einfache Möglichkeit (atan2), zwischen einer Transformationsmatrix und einem Winkel zu wechseln. In 3D ist die Drehung zu komplex, um sie als eine Zahl darzustellen. Es gibt etwas, das Euler-Winkel genannt wird und Drehungen als eine Menge von 3 Zahlen darstellen kann, aber sie sind begrenzt und nicht sehr nützlich, außer für triviale Fälle.
zh_tw: 對於2D, 我們有一個在變換矩陣和角度之間切換的簡單方法(Atan2). 在3D中, 我們不能簡單地將旋轉表示為一個數字. 有一種叫做歐拉角的東西, 它可以將旋轉表示為一組3個數位, 但它們是有限的, 除了微不足道的情況外, 它們並不是很有用.

source: In 3D we do not typically use angles, we either use a transformation basis (used pretty much everywhere in Godot), or we use quaternions. Godot can represent quaternions using the :ref:`class_Quaternion` struct. My suggestion to you is to completely ignore how they work under-the-hood, because they are very complicated and unintuitive.
de: In 3D verwenden wir normalerweise keine Winkel, sondern entweder eine Transformationsbasis (die in Godot so gut wie überall verwendet wird) oder Quaternionen. Godot kann Quaternionen mit der Struktur :ref:`class_Quaternion` darstellen. Ich schlage vor, dass Sie komplett ignorieren, wie sie im Detail funktionieren, da sie sehr kompliziert und unintuitiv sind.
zh_tw: 在 3D 中，我們通常不使用角度，我們要麼使用變換的基（在 Godot 中幾乎到處都使用），要麼使用四元數。Godot 可以使用 :ref:`class_Quat` 結構表示四元數。我給你的建議是完全忽略它們是如何在幕後工作的，因為它們非常複雜和不直觀。

source: However, if you really must know how it works, here are some great resources, which you can follow in order:
de: Wenn Sie jedoch wirklich wissen müssen, wie es funktioniert, finden Sie hier einige großartige Ressourcen, die Sie durchgehen können:
zh_cn: 然而, 如果你真的想知道它是如何工作的, 这里有一些很棒的参考资料, 你可以按顺序跟随它们:
zh_tw: 然而, 如果你真的想知道它是如何工作的, 這裡有一些很棒的參考資料, 你可以按順序跟隨它們:

source: Translation status
de: Übersetzungsstatus
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: https://www.youtube.com/watch?v=mvmuCPvRoWQ
zh_cn: http://www.bilibili.com/video/BV1fx41187tZ

source: https://www.youtube.com/watch?v=d4EgbgTm0Bg
zh_cn: http://www.bilibili.com/video/BV1SW411y7W1
