Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: de, zh_cn, zh_tw

source: Node2D provides a shearing property out of the box.
de: Node2D bietet von Haus aus eine Scher-Eigenschaft.
zh_tw: Node2D 提供了開箱即用的剪切屬性。

source: You may have noticed that a transform has more degrees of freedom than the combination of the above actions. The basis of a 2D transformation matrix has four total numbers in two :ref:`class_Vector2` values, while a rotation value and a Vector2 for scale only has 3 numbers. The high-level concept for the missing degree of freedom is called *shearing*.
de: Sie haben vielleicht bemerkt, dass eine Transformation mehr Freiheitsgrade hat als die Kombination der oben genannten Aktionen. Die Basis einer 2D-Transformationsmatrix hat insgesamt vier Zahlen in zwei :ref:`class_Vector2`-Werten, während ein Rotationswert und ein Vector2 für die Skalierung nur 3 Zahlen haben. Das übergeordnete Konzept für den fehlenden Freiheitsgrad wird *Scheren* genannt.
zh_cn: 你可能已经注意到，变换的自由度比上述操作的组合要多。2D 变换矩阵的基在两个 :ref:`class_Vector2` 值中总共有四个数，而旋转值和缩放的 Vector2 只有三个数字。缺失自由度的高级概念称为\ *剪切*\ （Shearing）。
zh_tw: 您可能已經注意到，變換的自由度比上述操作的組合要多。2D 變換矩陣的基在兩個 :ref:`class_Vector2` 值中總共有四個數，而旋轉值和縮放的 Vector2 只有三個數字。缺失自由度的高級概念稱為*剪切*（Shearing）。

source: Normally, you will always have the basis vectors perpendicular to each other. However, shearing can be useful in some situations, and understanding shearing helps you understand how transforms work.
de: Normalerweise stehen die Basisvektoren immer senkrecht aufeinander. Die Scherung kann jedoch in einigen Situationen nützlich sein, und das Verständnis der Scherung hilft Ihnen zu verstehen, wie Transformationen funktionieren.
zh_cn: 通常，你将始终拥有彼此垂直的基向量。但是，剪切在某些情况下可能很有用，了解剪切可以帮助你理解变换的工作原理。
zh_tw: 通常，您將始終擁有彼此垂直的基向量。但是，剪切在某些情況下可能很有用，瞭解剪切可以幫助您理解變換的工作原理。

source: To show you visually how it will look, let's overlay a grid onto the Godot logo:
de: Um Ihnen visuell zu zeigen, wie es aussehen wird, überlagern wir das Godot-Logo mit einem Raster:
zh_cn: 为了直观地向你展示它的外观, 让我们在Godot徽标上叠加一个网格:
zh_tw: 為了直觀地向您展示它的外觀, 讓我們在Godot徽標上疊加一個網格:

source: Each point on this grid is obtained by adding the basis vectors together. The bottom-right corner is X + Y, while the top-right corner is X - Y. If we change the basis vectors, the entire grid moves with it, as the grid is composed of the basis vectors. All lines on the grid that are currently parallel will remain parallel no matter what changes we make to the basis vectors.
de: Jeder Punkt auf diesem Raster ergibt sich aus der Addition der Basisvektoren. Die rechte untere Ecke ist X + Y, während die rechte obere Ecke X - Y ist. Wenn wir die Basisvektoren ändern, bewegt sich das gesamte Raster mit, da das Raster aus den Basisvektoren zusammengesetzt ist. Alle Linien des Rasters, die derzeit parallel sind, bleiben parallel, egal welche Änderungen wir an den Basisvektoren vornehmen.
zh_cn: 此网格上的每个点都是通过将基向量相加而获得的。右下角是 X + Y，而右上角是 X - Y。如果我们更改基向量，整个栅格也会随之移动，因为栅格是由基向量组成的。无论我们对基向量做什么更改，栅格上当前平行的所有直线都将保持平行。
zh_tw: 此網格上的每個點都是通過將基向量相加而獲得的。右下角是 X + Y，而右上角是 X - Y。如果我們更改基向量，整個柵格也會隨之移動，因為柵格是由基向量組成的。無論我們對基向量做什麼更改，柵格上目前平行的所有直線都將保持平行。

source: As an example, let's set Y to (1, 1):
de: Als Beispiel setzen wir Y auf (1, 1):
zh_cn: 例如, 让我们将Y设置为(1,1):
zh_tw: 例如, 讓我們將Y設定為(1,1):

source: You can't set the raw values of a Transform2D in the editor, so you *must* use code if you want to shear the object.
de: Sie können die Rohwerte eines Transform2D im Editor nicht einstellen, also *müssen* Sie Code verwenden, wenn Sie das Objekt scheren wollen.
zh_cn: 不能在编辑器中设置Transform2D的原始值, 所以想要剪切对象, 必须使用代码.
zh_tw: 不能在編輯器中設定Transform2D的原始值, 所以想要剪切物件, 必須使用程式碼.

source: Due to the vectors no longer being perpendicular, the object has been sheared. The bottom-center of the grid, which is (0, 1) relative to itself, is now located at a world position of (1, 1).
de: Da die Vektoren nicht mehr senkrecht zueinander stehen, ist das Objekt geschert worden. Der untere Mittelpunkt des Rasters, der relativ zu sich selbst (0, 1) ist, befindet sich jetzt an der Weltposition (1, 1).
zh_cn: 由于向量不再垂直, 因此对象已被剪切. 栅格的底部中心(相对于自身为(0,1))现在位于世界位置(1,1).
zh_tw: 由於向量不再垂直, 因此物件已被剪切. 柵格的底部中心(相對於自身為(0,1))現在位於世界位置(1,1).

source: The intra-object coordinates are called UV coordinates in textures, so let's borrow that terminology for here. To find the world position from a relative position, the formula is U * X + V * Y, where U and V are numbers and X and Y are the basis vectors.
de: Die Intra-Objekt-Koordinaten werden in Texturen als UV-Koordinaten bezeichnet, so dass wir diese Terminologie hier übernehmen wollen. Um die Weltposition von einer relativen Position aus zu bestimmen, lautet die Formel U * X + V * Y, wobei U und V Zahlen und X und Y die Basisvektoren sind.
zh_cn: 对象内部坐标在纹理中称为UV坐标, 因此我们借用此处的术语. 要从相对位置找到世界位置, 公式为U*X+V*Y, 其中U和V是数字,X和Y是基向量.
zh_tw: 物件內部座標在紋理中稱為UV座標, 因此我們借用此處的術語. 要從相對位置找到世界位置, 公式為U*X+V*Y, 其中U和V是數字,X和Y是基向量.

source: The bottom-right corner of the grid, which is always at the UV position of (1, 1), is at the world position of (2, 1), which is calculated from X*1 + Y*1, which is (1, 0) + (1, 1), or (1 + 1, 0 + 1), or (2, 1). This matches up with our observation of where the bottom-right corner of the image is.
de: Die untere rechte Ecke des Gitters, die sich immer an der UV-Position (1, 1) befindet, befindet sich an der Weltposition (2, 1), die sich aus X*1 + Y*1, also (1, 0) + (1, 1) oder (1 + 1, 0 + 1) oder (2, 1) ergibt. Dies stimmt mit unserer Beobachtung überein, wo sich die untere rechte Ecke des Bildes befindet.
zh_cn: 栅格的右下角始终位于UV位置(1,1), 位于世界位置(2,1), 该位置是从X*1+Y*1(即(1,0)+(1,1)或(1+1,0+1)或(2,1)计算得出的. 这与我们观察到的图像右下角的位置相吻合.
zh_tw: 柵格的右下角始終位於UV位置(1,1), 位於世界位置(2,1), 該位置是從X*1+Y*1(即(1,0)+(1,1)或(1+1,0+1)或(2,1)計算得出的. 這與我們觀察到的圖像右下角的位置相吻合.

source: Similarly, the top-right corner of the grid, which is always at the UV position of (1, -1), is at the world position of (0, -1), which is calculated from X*1 + Y*-1, which is (1, 0) - (1, 1), or (1 - 1, 0 - 1), or (0, -1). This matches up with our observation of where the top-right corner of the image is.
de: Ebenso befindet sich die rechte obere Ecke des Gitters, die sich immer an der UV-Position (1, -1) befindet, an der Weltposition (0, -1), die sich aus X*1 + Y*-1 errechnet, was (1, 0) - (1, 1) oder (1 - 1, 0 - 1) oder (0, -1) ist. Dies stimmt mit unserer Beobachtung überein, wo sich die rechte obere Ecke des Bildes befindet.
zh_cn: 同样, 栅格的右上角始终位于UV位置(1, -1), 位于世界位置(0, -1), 该位置是从X*1+Y*-1计算得出的,X*1+Y*-1是(1,0)-(1,1)或(1-1,0-1)或(0, -1). 这与我们观察到的图像右上角的位置相吻合.
zh_tw: 同樣, 柵格的右上角始終位於UV位置(1, -1), 位於世界位置(0, -1), 該位置是從X*1+Y*-1計算得出的,X*1+Y*-1是(1,0)-(1,1)或(1-1,0-1)或(0, -1). 這與我們觀察到的圖像右上角的位置相吻合.

source: Hopefully you now fully understand the how a transformation matrix affects the object, and the relationship between the basis vectors and how the object's "UV" or "intra-coordinates" have their world position changed.
de: Sie verstehen nun hoffentlich, wie sich eine Transformationsmatrix auf das Objekt auswirkt und welche Beziehung zwischen den Basisvektoren und der Änderung der Weltposition der "UV"- oder "Intra-Koordinaten" des Objekts besteht.
zh_cn: 希望你现在完全了解变换矩阵如何影响对象，以及基向量之间的关系以及对象的“UV”或“内部坐标”如何更改其世界位置。
zh_tw: 希望您現在完全瞭解變換矩陣如何影響物件，以及基向量之間的關係以及物件的“UV”或“內部座標”如何更改其世界位置。

source: In Godot, all transform math is done relative to the parent node. When we refer to "world position", that would be relative to the node's parent instead, if the node had a parent.
de: In Godot werden alle Transformationsberechnungen relativ zum übergeordneten Node durchgeführt. Wenn wir uns auf die "Weltposition" beziehen, wäre das relativ zum übergeordneten Node, wenn der Node einen übergeordneten Node hätte.
zh_cn: 在Godot中, 所有变换数学运算都是相对于父节点完成的. 当我们提到 "世界位置" 时, 如果节点有父节点, 那么它将相对于节点的父位置.
zh_tw: 在Godot中, 所有變換數學運算都是相對於父節點完成的. 當我們提到 "世界位置" 時, 如果節點有父節點, 那麼它將相對於節點的父位置.

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video about linear transformations: https://www.youtube.com/watch?v=kYB8IZa5AuE
de: Wenn Sie weitere Erklärungen wünschen, sollten Sie sich das exzellente Video von 3Blue1Brown über lineare Transformationen ansehen: https://www.youtube.com/watch?v=kYB8IZa5AuE
zh_cn: 如果你想要更多的解释，你可以查看 3Blue1Brown 关于线性变换的精彩视频：\ http://www.bilibili.com/video/BV1ys411472E?p=4
zh_tw: 如果你想要更多的解釋，你可以查看 3Blue1Brown 關於線性變換的精彩影片：http://www.bilibili.com/video/BV1ys411472E?p=4

source: Practical applications of transforms
de: Praktische Anwendungen von Transformationen
zh_cn: 变换的实际应用
zh_tw: 變換的實際應用

source: In actual projects, you will usually be working with transforms inside transforms by having multiple :ref:`class_Node2D` or :ref:`class_Node3D` nodes parented to each other.
de: In tatsächlichen Projekten werden Sie normalerweise mit Transformationen innerhalb von Transformationen arbeiten, indem Sie mehrere :ref:`class_Node2D` oder :ref:`class_Node3D`-Nodes haben, die einander übergeordnet sind.
zh_tw: 在實際專案中，您通常會通過將多個 :ref:`class_Node2D` 或 :ref:`class_Spatial` 節點設定為彼此的父級來處理變換中的變換。

source: However, it's useful to understand how to manually calculate the values we need. We will go over how you could use :ref:`class_Transform2D` or :ref:`class_Transform3D` to manually calculate transforms of nodes.
de: Es ist jedoch nützlich zu wissen, wie man die benötigten Werte manuell berechnen kann. Wir gehen darauf ein, wie Sie :ref:`class_Transform2D` oder :ref:`class_Transform3D` verwenden können, um Transformationen von Nodes manuell zu berechnen.
zh_tw: 但是, 有時手動計算我們需要的值非常有用. 我們將介紹如何使用 :ref:`CLASS_Transform2D` 或 :ref:`CLASS_Transform` 手動計算節點轉換.

source: Converting positions between transforms
de: Positionen zwischen Transformationen konvertieren
zh_cn: 在变换之间转换位置
zh_tw: 在變換之間轉換位置

source: There are many cases where you'd want to convert a position in and out of a transform. For example, if you have a position relative to the player and would like to find the world (parent-relative) position, or if you have a world position and want to know where it is relative to the player.
de: Es gibt viele Fälle, in denen man eine Position in und aus einer Transformation konvertieren möchte. Zum Beispiel, wenn man eine Position relativ zum Spieler hat und die Weltposition (relativ zum Parent) finden möchte, oder wenn man eine Weltposition hat und wissen möchte, wo sie relativ zum Spieler ist.
zh_cn: 在许多情况下，你可能需要将某个位置转换为变换前或者变换后的位置。例如，如果你有一个相对于玩家的位置并想要查找世界（相对于玩家来说是父级）位置，或者如果你有一个世界位置并想知道它相对于玩家的位置。
zh_tw: 在許多情況下，您可能需要將某個位置轉換為變換前或者變換後的位置。例如，如果您有一個相對於玩家的位置並想要搜尋世界（相對於玩家來說是父級）位置，或者如果您有一個世界位置並想知道它相對於玩家的位置。

source: We can find what a vector relative to the player would be defined in world space as using the ``*`` operator:
de: Wir können herausfinden, wie ein Vektor relativ zum Spieler im World-Space definiert wäre, indem wir den Operator ``*`` verwenden:
zh_tw: 通過“xform”方法，我們可以找到相對於玩家的向量如果定義在世界空間中的話應該是什麼：

source: And we can use the ``*`` operator in the opposite order to find a what world space position would be if it was defined relative to the player:
de: Und wir können den Operator ``*`` in umgekehrter Reihenfolge verwenden, um eine Position im World-Space zu finden, die relativ zum Spieler definiert wäre:
zh_tw: 我們可以使用 "xform_inv" 方法來搜尋世界空間位置(如果它是相對於玩家定義的):

source: If you know in advance that the transform is positioned at (0, 0), you can use the "basis_xform" or "basis_xform_inv" methods instead, which skip dealing with translation.
de: Wenn Sie im Voraus wissen, dass die Transformation auf (0, 0) positioniert ist, können Sie stattdessen die Methoden "basis_xform" oder "basis_xform_inv" verwenden, um die Translation überspringen.
zh_cn: 如果你事先知道变换位于 (0, 0) 处，则可以改用“basis_xform”或“basis_xform_inv”方法，这将跳过处理平移的过程。
zh_tw: 如果您事先知道變換位於 (0, 0) 處，則可以改用“basis_xform”或“basis_xform_inv”方法，這將跳過處理平移的過程。

source: Moving an object relative to itself
de: Verschieben eines Objekts relativ zu sich selbst
zh_cn: 相对于对象本身移动对象
zh_tw: 相對於物件本身移動物件

source: A common operation, especially in 3D games, is to move an object relative to itself. For example, in first-person shooter games, you would want the character to move forward (-Z axis) when you press :kbd:`W`.
de: Vor allem in 3D-Spielen ist es üblich, ein Objekt relativ zu sich selbst zu bewegen. In Ego-Shooter-Spielen möchte man zum Beispiel, dass sich die Figur nach vorne bewegt (-Z-Achse), wenn man :kbd:`W` drückt.
zh_cn: 一种常见的操作，尤其是在 3D 游戏中，是相对于自身移动对象。例如，在第一人称射击游戏中，当你按下 :kbd:`W` 键时，你希望角色向前移动（-Z 轴）。
zh_tw: 一種常見的操作，尤其是在 3D 遊戲中，是相對於自身移動對象。例如，在第一人稱射擊遊戲中，當您按下 :kbd:`W` 鍵時，您希望角色向前移動（-Z 軸）。

source: Since the basis vectors are the orientation relative to the parent, and the origin vector is the position relative to the parent, we can add multiples of the basis vectors to move an object relative to itself.
de: Da die Basisvektoren die Orientierung relativ zum übergeordneten Objekt und der Ursprungsvektor die Position relativ zum übergeordneten Objekt darstellen, können wir ein Vielfaches der Basisvektoren addieren, um ein Objekt relativ zu sich selbst zu bewegen.
zh_tw: 由於基向量是相對於父物件的方向，而原點向量是相對於父物件的位置，因此我們可以簡單地將基向量的倍數相加，以相對於物件本身移動物件。

source: This code moves an object 100 units to its own right:
de: Dieser Code verschiebt ein Objekt um 100 Einheiten nach rechts:
zh_cn: 此代码会让对象向它自己的右边移动 100 个单位：
zh_tw: 此程式碼會讓物件向它自己的右邊移動 100 個單位：

source: For moving in 3D, you would need to replace "x" with "basis.x".
de: Um sich in 3D zu bewegen, müssten Sie "x" durch "basis.x" ersetzen.
zh_cn: 要在 3D 中移动，需要将“x”替换为“basis.x”。
zh_tw: 要在 3D 中移動，需要將“x”替換為“basis.x”。

source: In actual projects, you can use ``translate_object_local`` in 3D or ``move_local_x`` and ``move_local_y`` in 2D to do this.
de: In tatsächlichen Projekten können Sie ``translate_object_local`` in 3D oder ``move_local_x`` und ``move_local_y`` in 2D verwenden, um dies zu tun.
zh_tw: 在實際工程中，您可以使用 3D 中的 `translate_object_local` 或者 2D 中的 `move_local_x` 和 `move_local_y` 來實作。

source: Applying transforms onto transforms
de: Anwenden von Transformationen auf Transformationen
zh_cn: 将变换应用于变换
zh_tw: 將變換應用於變換

source: One of the most important things to know about transforms is how you can use several of them together. A parent node's transform affects all of its children. Let's dissect an example.
de: Eines der wichtigsten Dinge, die Sie über Transformationen wissen sollten ist, wie Sie mehrere davon zusammen verwenden können. Die Transformation eines übergeordneten Nodes wirkt sich auf alle untergeordneten Nodes aus. Lassen Sie uns ein Beispiel analysieren.
zh_cn: 关于转换, 需要了解的最重要的事情之一是如何将几个转换一起使用. 父节点的变换会影响其所有子节点. 让我们来剖析一个例子.
zh_tw: 關於轉換, 需要瞭解的最重要的事情之一是如何將幾個轉換一起使用. 父節點的變換會影響其所有子節點. 讓我們來剖析一個例子.

source: In this image, the child node has a "2" after the component names to distinguish them from the parent node. It might look a bit overwhelming with so many numbers, but remember that each number is displayed twice (next to the arrows and also in the matrices), and that almost half of the numbers are zero.
de: In diesem Bild hat der Child-Node eine "2" hinter den Komponentennamen, um sie vom Parent-Node zu unterscheiden. Bei so vielen Zahlen mag es etwas überwältigend aussehen, aber bedenken Sie, dass jede Zahl zweimal angezeigt wird (neben den Pfeilen und auch in den Matrizen) und dass fast die Hälfte der Zahlen Null ist.
zh_cn: 在此图像中, 子节点的组件名称后面有一个 "2", 以将其与父节点区分开来. 这么多数字可能看起来有点令人不知所措, 但请记住, 每个数字都会显示两次(在箭头旁边和矩阵中), 而且几乎一半的数字都是零.
zh_tw: 在此圖像中, 子節點的元件名稱後面有一個 "2", 以將其與父節點區分開來. 這麼多數字可能看起來有點令人不知所措, 但請記住, 每個數位都會顯示兩次(在箭頭旁邊和矩陣中), 而且幾乎一半的數字都是零.

source: The only transformations going on here are that the parent node has been given a scale of (2, 1), the child has been given a scale of (0.5, 0.5), and both nodes have been given positions.
de: Die einzigen Transformationen, die hier stattfinden, sind, dass dem Parent-Node eine Skalierung von (2, 1), dem Child-Node ein Maßstab von (0.5, 0.5) und beiden Nodes eine Position zugewiesen wurde.
zh_cn: 这里进行的唯一转换是父节点的比例为(2,1), 子节点的比例为(0.5,0.5), 两个节点都指定了位置.
zh_tw: 這裡進行的唯一轉換是父節點的比例為(2,1), 子節點的比例為(0.5,0.5), 兩個節點都指定了位置.

source: All child transformations are affected by the parent transformations. The child has a scale of (0.5, 0.5), so you would expect it to be a 1:1 ratio square, and it is, but only relative to the parent. The child's X vector ends up being (1, 0) in world space, because it is scaled by the parent's basis vectors. Similarly, the child node's ``origin`` vector is set to (1, 1), but this actually moves it (2, 1) in world space, due to the parent node's basis vectors.
de: Alle Child-Transformationen werden von den Parent-Transformationen beeinflusst. Das Child hat eine Skalierung von (0.5, 0.5), so dass man erwarten würde, dass es ein Quadrat im Verhältnis 1:1 ist, und das ist es auch, aber nur relativ zum Parent. Der X-Vektor des Child liegt im World-Space bei (1, 0), weil er durch die Basisvektoren des Parent-Nodes skaliert wird. In ähnlicher Weise wird der ``Ursprungsvektor`` des Child-Nodes auf (1, 1) gesetzt, aber dadurch wird er im World-Space aufgrund der Basisvektoren des Parent Nodes auf (2, 1) verschoben.
zh_tw: 所有子變換都受父變換的影響。子物件的比例為 (0.5, 0.5)，因此您會認為它是 1:1 的比例正方形，確實如此，但僅相對於父物件。子物件的 X 向量最終在世界空間中為 (1, 0)，因為它是由父物件的基礎向量縮放的。類似地，子節點的 `origin` 向量被設定為(1,1)，但由於父節點的基向量，這實際上會在世界空間中移動 (2, 1)。

source: To calculate a child transform's world space transform manually, this is the code we would use:
de: Um die World-Space-Transformation der Child-Transformation manuell zu berechnen, würden wir den folgenden Code verwenden:
zh_cn: 要手动计算子变换的世界空间变换, 我们将使用以下代码:
zh_tw: 要手動計算子變換的世界空間變換, 我們將使用以下程式碼:

source: In actual projects, we can find the world transform of the child by applying one transform onto another using the ``*`` operator:
de: In tatsächlichen Projekten können wir die World-Space-Transformation des Child finden, indem wir eine Transformation auf eine andere mit dem Operator ``*`` anwenden:
zh_tw: 在實際工程中, 我們可以通過 `*` 運算子將一個變換應用到另一個變換中, 從而找到孩子的世界變換:

source: When multiplying matrices, order matters! Don't mix them up.
de: Beim Multiplizieren von Matrizen kommt es auf die Reihenfolge an! Verwechseln Sie sie nicht.
zh_cn: 当矩阵相乘时, 顺序很重要！别把它们弄混了.
zh_tw: 當矩陣相乘時, 順序很重要！別把它們弄混了.

source: Lastly, applying the identity transform will always do nothing.
de: Zuletzt bewirkt die Anwendung der Einheitstransformation niemals etwas.
zh_cn: 最后, 应用身份变换始终不起任何作用.
zh_tw: 最後, 應用身份變換始終不起任何作用.

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video about matrix composition: https://www.youtube.com/watch?v=XkY2DOUCWMU
de: Wenn Sie weitere Erklärungen wünschen, sollten Sie sich das exzellente Video von 3Blue1Brown über die Zusammensetzung von Matrizen ansehen: https://www.youtube.com/watch?v=XkY2DOUCWMU
zh_cn: 如果你想了解更多信息，可以查看 3Blue1Brown 关于矩阵组成的精彩视频：\ http://www.bilibili.com/video/BV1ys411472E?p=5
zh_tw: 如果您想瞭解更多資訊，可以查看 3Blue1Brown 關於矩陣組成的精彩影片：http://www.bilibili.com/video/BV1ys411472E?p=5

source: Inverting a transformation matrix
de: Invertieren einer Transformationsmatrix
zh_cn: 求逆变换矩阵
zh_tw: 求逆變換矩陣

source: The "affine_inverse" function returns a transform that "undoes" the previous transform. This can be useful in some situations. Let's take a look at a few examples.
de: Die Funktion "affine_inverse" gibt eine Transformation zurück, die eine vorherige Transformation "rückgängig macht". Dies kann in einigen Situationen nützlich sein. Schauen wir uns einige Beispiele an.
zh_tw: affine_inverse 函式返回一個 "撤銷" 前一個轉換的轉換. 這在某些情況下可能很有用, 但只提供幾個範例會更容易.

source: Multiplying an inverse transform by the normal transform undoes all transformations:
de: Das Multiplizieren einer inversen Transformation mit der normalen Transformation macht alle Transformationen rückgängig:
zh_cn: 将反变换乘以法线变换将撤消所有变换:
zh_tw: 將反變換乘以法線變換將撤銷所有變換:

source: Transforming a position by a transform and its inverse results in the same position:
de: Die Transformation einer Position durch eine Transformation und ihre Umkehrung ergibt dieselbe Position:
zh_tw: 通過轉換轉換位置及其反轉會導致相同的位置(與 "xform_inv" 相同):

source: How does it all work in 3D?
de: Wie funktioniert das alles in 3D?
zh_cn: 这一切是如何在 3D 模式下工作的？
zh_tw: 這一切是如何在 3D 模式下工作的？

source: One of the great things about transformation matrices is that they work very similarly between 2D and 3D transformations. All the code and formulas used above for 2D work the same in 3D, with 3 exceptions: the addition of a third axis, that each axis is of type :ref:`class_Vector3`, and also that Godot stores the :ref:`class_Basis` separately from the :ref:`class_Transform3D`, since the math can get complex and it makes sense to separate it.
de: Eine der großartigen Eigenschaften von Transformationsmatrizen ist, dass die 2D- und 3D-Transformationen sehr ähnlich funktionieren. Der gesamte Code und die Formeln, die oben für 2D verwendet wurden, funktionieren in 3D genauso, mit drei Ausnahmen: die Hinzufügung einer dritten Achse, dass jede Achse vom Typ :ref:`class_Vector3` ist, und auch, dass Godot die :ref:`class_Basis` getrennt von der :ref:`class_Transform3D` speichert, da die Mathematik komplex werden kann und es sinnvoll ist, sie zu trennen.
zh_tw: 變換矩陣的一個偉大之處在於, 它們在2D和3D變換之間的工作方式非常相似. 上面用於2D的所有程式碼和公式在3D中的工作方式都相同, 只有3個不同之處: 增加了第三個軸, 每個軸的型別為 :ref:`CLASS_Vector3`, 並且Godot將 :ref:`CLASS_Basis` 與 :ref:`CLASS_Transform` 分開儲存, 因為數學運算可能會很複雜, 因此將其分開是有意義的.

source: All of the concepts for how translation, rotation, scale, and shearing work in 3D are all the same compared to 2D. To scale, we take each component and multiply it; to rotate, we change where each basis vector is pointing; to translate, we manipulate the origin; and to shear, we change the basis vectors to be non-perpendicular.
de: Alle Konzepte für die Funktionsweise von Translation, Rotation, Skalierung und Scherung funktionieren in 3D genauso wie in 2D. Zum Skalieren nehmen wir jede Komponente und multiplizieren sie; zum Rotieren ändern wir, wohin jeder Basisvektor zeigt; zum Verschieben verändern wir den Ursprung; und zum Scheren ändern wir die Basisvektoren so, dass sie nicht senkrecht sind.
zh_cn: 与二维相比, 有关平移, 旋转, 缩放和剪切在三维中的工作方式的所有概念都是相同的. 要缩放, 我们取每个分量并将其相乘；要旋转, 我们更改每个基向量指向的位置；要平移, 我们操纵原点；要剪切, 我们将基向量更改为不垂直.
zh_tw: 與二維相比, 有關平移, 旋轉, 縮放和剪切在三維中的工作方式的所有概念都是相同的. 要縮放, 我們取每個分量並將其相乘；要旋轉, 我們更改每個基向量指向的位置；要平移, 我們操縱原點；要剪切, 我們將基向量更改為不垂直.

source: If you would like, it's a good idea to play around with transforms to get an understanding of how they work. Godot allows you to edit 3D transform matrices directly from the inspector. You can download this project which has colored lines and cubes to help visualize the :ref:`class_Basis` vectors and the origin in both 2D and 3D: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
de: Wenn Sie möchten, ist es eine gute Idee, mit Transformationen herumzuspielen, um ein Verständnis dafür zu bekommen, wie sie funktionieren. Mit Godot können Sie 3D-Transformationsmatrizen direkt vom Inspektor aus bearbeiten. Sie können das folgende Projekt mit farbigen Linien und Würfeln herunterladen, um die Vektoren der :ref:`class_Basis` und den Ursprung sowohl in 2D als auch in 3D zu visualisieren: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
zh_cn: 如果你愿意, 最好尝试一下转换, 以了解它们是如何工作的. Godot 允许你直接从检查器编辑 3D 变换矩阵. 你可以下载此项目, 其中包含彩色线条和立方体, 以帮助在 2D 和 3D 中可视化 :ref:`class_Basis` 向量和原点: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
zh_tw: 如果您願意, 最好嘗試一下轉換, 以瞭解它們是如何工作的. Godot 允許您直接從屬性面板編輯 3D 變換矩陣. 您可以下載此專案, 其中包含彩色線條和立方體, 以幫助在 2D 和 3D 中視覺化 :ref:`class_Basis` 向量和原點: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform

source: You cannot edit Node2D's transform matrix directly in Godot 4.0's inspector. This may be changed in a future release of Godot.
de: Sie können die Transformationsmatrix von Node2D nicht direkt im Inspektor von Godot 4.0 bearbeiten. Dies wird möglicherweise in einer zukünftigen Version von Godot geändert.
zh_tw: 不能在Godot 3.2的屬性面板中直接編輯Node2D的變換矩陣. 在Godot的未來版本中, 這一點可能會有所改變.
