Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: de, zh_cn, zh_tw

source: Matrices and transforms
de: Matrizen und Transformationen
zh_cn: 矩阵与变换
zh_tw: 矩陣與變換

source: Introduction
de: Einführung
zh_cn: 前言
zh_tw: 前言

source: Before reading this tutorial, we recommend that you thoroughly read and understand the :ref:`doc_vector_math` tutorial, as this tutorial requires a knowledge of vectors.
de: Bevor Sie dieses Tutorial lesen, empfehlen wir das :ref:`doc_vector_math`-Tutorial sorgfältig lesen und verstehen, da dieses Tutorial Kenntnisse über Vektoren voraussetzt.
zh_cn: 在阅读本教程之前，我们推荐你从头到尾阅读 :ref:`doc_vector_math` 教程，因为本教程需要向量的知识，故需要对其内容有较为全面的理解。
zh_tw: 在閱讀本教學之前，我們推薦你從頭到尾閱讀並且理解 :ref:`doc_vector_math` 教學，因為本教學需要一點向量的知識。

source: This tutorial is about *transformations* and how we represent them in Godot using matrices. It is not a full in-depth guide to matrices. Transformations are most of the time applied as translation, rotation, and scale, so we will focus on how to represent those with matrices.
de: In diesem Tutorial geht es um *Transformationen* und wie wir sie in Godot mithilfe von Matrizen darstellen. Es ist keine ausführliche Anleitung zu Matrizen. Transformationen werden meistens als Translation, Rotation und Skalierung angewendet, daher konzentrieren wir uns darauf, wie diese mit Matrizen dargestellt werden.
zh_cn: 本教程会介绍\ *变换*\ 以及如何在 Godot 中使用矩阵来表示变换，并不会深入完整地介绍矩阵与变换。变换在大多数情况下应用于平移、旋转、缩放，我们将会重点讲述如何使用矩阵来表示平移、旋转和缩放。
zh_tw: 這個教學介紹的是*變換*以及我們如何在 Godot 中使用矩陣表示它。這不是完整深入的矩陣指南。變換大多數時候被應用為平移、旋轉、縮放，所以我們將會關注如何用矩陣表示這些變換。

source: Most of this guide focuses on 2D, using :ref:`class_Transform2D` and :ref:`class_Vector2`, but the way things work in 3D is very similar.
de: Der größte Teil dieser Anleitung konzentriert sich auf 2D und verwendet :ref:`class_Transform2D` und :ref:`class_Vector2`, aber die Funktionsweise in 3D ist sehr ähnlich.
zh_cn: 虽然本教程主要侧重于 2D 的变换，用的是 :ref:`class_Transform2D` 和 :ref:`class_Vector2`\ ，但是对于 3D 中的变换，其工作方式也与 2D 的十分相似。
zh_tw: 雖然這個指南主要關注於 2D，使用 :ref:`class_Transform2D` 和 :ref:`class_Vector2`，但是 3D 中的工作方式也十分相似。

source: As mentioned in the previous tutorial, it is important to remember that in Godot, the Y axis points *down* in 2D. This is the opposite of how most schools teach linear algebra, with the Y axis pointing up.
de: Wie im vorherigen Tutorial erwähnt, ist es wichtig, sich daran zu erinnern, dass in Godot die Y-Achse in 2D *nach unten* zeigt. Dies ist das Gegenteil davon, wie die meisten Schulen lineare Algebra unterrichten, wo die Y-Achse nach oben zeigt.
zh_cn: 正如之前的教程中所提到的，在 Godot 中，要记住 2D 的 Y 轴的正方向是\ *向下*\ 的，而学校里教的线性代数的坐标系，其 Y 轴正方向是向上的，这两个 Y 轴的方向是相反的，这一点需要注意。
zh_tw: 正如之前的教學中提到的，要記住在 Godot 中，2D 的 Y 軸是*向下*的。這與學校裡教的線性代數正好相反，在那裡 Y 軸是向上的。

source: The convention is that the X axis is red, the Y axis is green, and the Z axis is blue. This tutorial is color-coded to match these conventions, but we will also represent the origin vector with a blue color.
de: Die Konvention ist, dass die X-Achse rot ist, die Y-Achse grün und die Z-Achse blau. Dieses Tutorial ist farbcodiert, um diesen Konventionen zu entsprechen. Wir werden jedoch auch den Ursprungsvektor mit einer blauen Farbe darstellen.
zh_cn: 我们习惯 X 轴用红色表示、Y 轴用绿色表示、Z 轴用蓝色表示，本教程中的颜色都遵循这个惯例，不过我们也在原点向量上使用蓝色表示。
zh_tw: 這裡的慣例是 X 軸用紅色、Y 軸用綠色、Z 軸用藍色。本教學中的顏色都遵循這個慣例，不過我們也在原點向量上使用藍色。

source: Matrix components and the Identity matrix
de: Matrixkomponenten und die Einheitsmatrix
zh_cn: 矩阵分量和单位矩阵
zh_tw: 矩陣分量和單位矩陣

source: The identity matrix represents a transform with no translation, no rotation, and no scale. Let's start by looking at the identity matrix and how its components relate to how it visually appears.
de: Die Einheitsmatrix repräsentiert eine Transformation ohne Translation, ohne Rotation und ohne Skalierung. Betrachten wir zunächst die Einheitsmatrix und ihre Beziehung zu ihrer visuellen Darstellung.
zh_cn: 单位矩阵代表一个没有平移、没有旋转、没有缩放的变换，现在就让我们看看单位矩阵以及其分量是如何与其视觉表现相联系的吧。
zh_tw: 單位矩陣代表一個沒有平移、沒有旋轉、沒有縮放的變換。讓我們開始看看單位矩陣以及它的分量如何與它的視覺表現相聯繫吧。

source: Matrices have rows and columns, and a transformation matrix has specific conventions on what each does.
de: Matrizen haben Zeilen und Spalten, und eine Transformationsmatrix hat spezifische Konventionen, wofür jede zuständig ist.
zh_cn: 矩阵有行和列，变换矩阵对行和列有特定的规定。
zh_tw: 矩陣有行和列，變換矩陣對它們有特定的約定。

source: In the image above, we can see that the red X vector is represented by the first column of the matrix, and the green Y vector is likewise represented by the second column. A change to the columns will change these vectors. We will see how they can be manipulated in the next few examples.
de: Im obigen Bild sehen wir, dass der rote X-Vektor durch die erste Spalte der Matrix dargestellt wird und der grüne Y-Vektor entsprechend durch die zweite Spalte dargestellt wird. Durch eine Änderung der Spalten werden diese Vektoren geändert. Wir werden in den nächsten Beispielen sehen, wie sie manipuliert werden können.
zh_cn: 在上图中，我们可以看到红色的 X 向量由矩阵的第一列数对表示，绿色的 Y 向量则由第二列数对表示，改变这几列数对就会改变这些数对所对应的向量。接下来，我们将会在几个例子中看到如何操作这些数对。
zh_tw: 在上圖中，我們可以看到紅色的 X 向量由矩陣的第一列表示，綠色的 Y 向量則由第二列表示。改變列就會改變這些向量。我們將在接下來的幾個例子中看到如何操作它們。

source: You should not worry about manipulating rows directly, as we usually work with columns. However, you can think of the rows of the matrix as showing which vectors contribute to moving in a given direction.
de: Sie sollten sich keine Gedanken über die direkte Bearbeitung von Zeilen machen, da wir normalerweise mit Spalten arbeiten. Sie können sich jedoch vorstellen, dass die Zeilen der Matrix angeben, welche Vektoren zur Bewegung in eine bestimmte Richtung beitragen.
zh_cn: 由于我们通常使用列来进行操作，因此不必担心直接操作行可能会带来的问题。不过，你也可以把矩阵的行看作是一组表示在给定的方向上移动的向量。
zh_tw: 您不必擔心直接操作行, 因為我們通常使用列. 然而, 你可以把矩陣的行看作是表示哪些向量有助於在給定的方向上移動.

source: When we refer to a value such as ``t.x.y``, that's the Y component of the X column vector. In other words, the bottom-left of the matrix. Similarly, ``t.x.x`` is top-left, ``t.y.x`` is top-right, and ``t.y.y`` is bottom-right, where ``t`` is the Transform2D.
de: Wenn wir uns auf einen Wert wie ``t.x.y`` beziehen, ist das die Y-Komponente des X-Spaltenvektors. Mit anderen Worten, die untere linke Seite der Matrix. In ähnlicher Weise steht ``t.x.x`` für oben links, ``t.y.x`` für oben rechts und ``t.y.y`` für unten rechts, wobei ``t`` das Transform2D ist.
zh_cn: 我们指定诸如 `t.x.y` 这样的值时，表示这是 X 列向量的 Y 分量，换言之，就是这个矩阵的左下角。类似地， `t.x.x` 就是左上角， `t.y.x` 就是右上角，那么 `t.y.y` 自然就是右下角。这里的 `t` 是一个 Transform2D。
zh_tw: 當我們指定一個值例如 `t.x.y` , 這是X列向量的Y分量. 換句話說, 是這個矩陣的左下角. 類似地, `t.x.x` 是左上角, `t.y.x` 是右上角, 然後 `t.y.y` 是右下角, 在這裡 `t` 是一個 Transform2D.

source: Scaling the transformation matrix
de: Skalierung der Transformationsmatrix
zh_cn: 缩放变换矩阵
zh_tw: 縮放變換矩陣

source: Applying a scale is one of the easiest operations to understand. Let's start by placing the Godot logo underneath our vectors so that we can visually see the effects on an object:
de: Das Anwenden einer Skalierung ist eine der am einfachsten zu verstehenden Operationen. Beginnen wir damit, das Godot-Logo unter unsere Vektoren zu legen, damit wir die Auswirkungen auf ein Objekt visuell sehen können:
zh_cn: 应用缩放变换是最容易理解的操作之一，既然如此，那就让我们开始动手尝试吧！把 Godot logo 放置于我们的向量之下，这样我们就可以直观地看出变换该对象上的应用效果：
zh_tw: 應用一個縮放是最容易理解的操作之一. 讓我們開始吧, 把Godot logo放置於我們的向量之下, 這樣我們可以直觀得看出應用於這些物件上的效果:

source: Now, to scale the matrix, all we need to do is multiply each component by the scale we want. Let's scale it up by 2. 1 times 2 becomes 2, and 0 times 2 becomes 0, so we end up with this:
de: Um die Matrix zu skalieren, müssen wir nur jede Komponente mit der gewünschten Skalierung multiplizieren. Skalieren wir sie mit 2. 1 mal 2 wird zu 2, und 0 mal 2 wird zu 0, so dass wir am Ende Folgendes erhalten:
zh_cn: 现在，要缩放矩阵，我们唯一需要做的就是将每个矩阵分量乘以我们想要缩放的比例。现在来将这个矩阵缩放两倍，1 × 2 = 2，0 × 2 = 0，于是我们便得到了这个结果：
zh_tw: 現在, 為了縮放矩陣, 我們唯一需要做的就是將每個矩陣分量乘以我們想要的縮放比例. 來將它縮放兩倍吧,1乘以2變成了2,0乘以2變成了0, 所以我們最後得到了這個:

source: To do this in code, we multiply each of the vectors:
de: Um dies im Code zu tun, multiplizieren wir jeden der Vektoren:
zh_cn: 要在代码中实现这点，我们可以让缩放倍数去乘上每个列向量：
zh_tw: 要在程式碼中做到這件事. 我們可以簡單地乘上每個向量:

source: If we wanted to return it to its original scale, we can multiply each component by 0.5. That's pretty much all there is to scaling a transformation matrix.
de: Wenn wir den ursprünglichen Maßstab wiederherstellen wollen, können wir jede Komponente mit 0.5 multiplizieren. Das ist so ziemlich alles, was es zum Skalieren einer Transformationsmatrix braucht.
zh_cn: 如果我们想要让该变换缩回到原来的尺度，那么我们可以让每个分向量乘以 0.5（即1/2）。以上便是缩放变换矩阵的所有基本介绍了。
zh_tw: 如果我們想要回到它原來的尺度, 我們可以對每個分量乘以0.5. 這幾乎就是縮放一個變換矩陣的全部了.

source: To calculate the object's scale from an existing transformation matrix, you can use ``length()`` on each of the column vectors.
de: Um die Skalierung des Objekts aus einer bestehenden Transformationsmatrix zu berechnen, können Sie ``length()`` auf jeden der Spaltenvektoren anwenden.
zh_cn: 要从已存在的变换矩阵中计算对象的缩放尺度，可以对该矩阵的每个列向量使用 `length()` 方法。
zh_tw: 要從一個已經存在的變換矩陣中計算物件的縮放尺度, 你可以對每個列向量使用 `length()` 方法.

source: In actual projects, you can use the ``scaled()`` method to perform scaling.
de: In echten Projekten können Sie die Methode ``scaled()`` verwenden, um eine Skalierung durchzuführen.
zh_cn: 在实际项目中，你可以使用 `scaled()` 方法去执行缩放变换操作。
zh_tw: 在實際的專案中, 你可以使用 `scaled()` 方法去執行縮放.

source: Rotating the transformation matrix
de: Rotation der Transformationsmatrix
zh_cn: 旋转变换矩阵
zh_tw: 建立內容

source: We'll start the same way as earlier, with the Godot logo underneath the identity matrix:
de: Wir beginnen auf die gleiche Weise wie zuvor, mit dem Godot-Logo unter der Einheitsmatrix:
zh_cn: 我们将以与前面相同的方式开始本节内容，先在单位矩阵下方叠加一个 Godot logo 吧：
zh_tw: 我們將以與前面相同的方式開始, 在標識矩陣下使用Godot徽標:

source: As an example, let's say we want to rotate our Godot logo clockwise by 90 degrees. Right now the X axis points right and the Y axis points down. If we rotate these in our head, we would logically see that the new X axis should point down and the new Y axis should point left.
de: Nehmen wir als Beispiel an, wir wollen unser Godot-Logo um 90 Grad im Uhrzeigersinn rotieren. Im Moment zeigt die X-Achse nach rechts und die Y-Achse nach unten. Wenn wir diese in unserem Kopf rotieren, würden wir logischerweise sehen, dass die neue X-Achse nach unten und die neue Y-Achse nach links zeigen sollte.
zh_cn: 举个例子，假设我们想让 Godot logo 顺时针旋转 90 度，而现在 X 轴正方形向右，Y 轴正方向向下。如果我们在脑海中模拟旋转这两个轴，那么我们脑海中就理应会想到：旋转后的 X 轴正方向应该向下，旋转后的 Y 轴正方向应该向左。
zh_tw: 舉個例子，假設我們想順時針旋轉 Godot 旗標 90 度。現在，X 軸指向右邊，Y 軸向下。如果我們在頭腦中旋轉這些，我們就會在邏輯上看到，新的 X 軸應該向下，新的 Y 軸應該指向左邊。

source: You can imagine that you grab both the Godot logo and its vectors, and then spin it around the center. Wherever you finish spinning, the orientation of the vectors determines what the matrix is.
de: Sie können sich vorstellen, dass Sie sowohl das Godot-Logo als auch seine Vektoren nehmen und es dann um den Mittelpunkt drehen. Je nachdem, wo man die Drehung beendet, bestimmt die Ausrichtung der Vektoren das Aussehen der Matrix.
zh_cn: 你可以这样子想：你用手抓住 Godot 的 logo 和其变换矩阵的列向量，然后绕着logo的中心点旋转这个logo以及这些向量。无论你在哪里完成该旋转，向量的方向都将会决定矩阵最终呈现的模样。
zh_tw: 你可以想像, 你抓住了godot的圖示和它的向量, 然後旋轉它的中心. 無論你在哪裡完成旋轉, 向量的方向決定了矩陣是什麼.

source: We need to represent "down" and "left" in normal coordinates, so means we'll set X to (0, 1) and Y to (-1, 0). These are also the values of ``Vector2.DOWN`` and ``Vector2.LEFT``. When we do this, we get the desired result of rotating the object:
de: Wir müssen "unten" und "links" in Normalen-Koordinaten darstellen, d.h. wir setzen X auf (0, 1) und Y auf (-1, 0). Dies sind auch die Werte von ``Vector2.DOWN`` und ``Vector2.LEFT``. Wenn wir dies tun, erhalten wir das gewünschte Ergebnis der Rotation des Objekts:
zh_cn: 我们需要在标准坐标系中表示“下方向”和“左方向”，故我们将 X 设为 (0, 1)，将 Y 设为 (-1, 0)。这些也正是 Vector2.DOWN 和 Vector2.LEFT 的值。这样做的话，我们就会得到旋转对象后所想看到的结果：
zh_tw: 我們需要在法線座標中表示“下”和“左”，因此我們將 X 設為 (0, 1)，將 Y 設為 (-1, 0)。這些也正是 Vector2.DOWN 和 Vector2.LEFT 的值，當我們這樣做時，就會得到旋轉物件想要的結果：

source: If you have trouble understanding the above, try this exercise: Cut a square of paper, draw X and Y vectors on top of it, place it on graph paper, then rotate it and note the endpoints.
de: Wenn Sie Schwierigkeiten haben, das oben Beschriebene zu verstehen, versuchen Sie diese Übung: Schneiden Sie ein Quadrat aus Papier aus, zeichnen Sie X- und Y-Vektoren darauf, legen Sie es auf Millimeterpapier, rotieren Sie es und notieren Sie die Endpunkte.
zh_cn: 如果你还是难以理解上面的内容，那就试着做下这个小实践：剪一个正方形的纸，在上面画 X 向量和 Y 向量，然后把它放在图表纸上，旋转这张正方形的纸，并记下其端点。
zh_tw: 如果你很難理解上面的內容, 那就試試這個練習: 剪一個正方形的紙, 在上面畫X和Y向量, 把它放在圖表紙上, 然後旋轉它並記下端點.

source: To perform rotation in code, we need to be able to calculate the values programmatically. This image shows the formulas needed to calculate the transformation matrix from a rotation angle. Don't worry if this part seems complicated, I promise it's the hardest thing you need to know.
de: Um eine Rotation im Code durchzuführen, müssen wir in der Lage sein, die Werte programmatisch zu berechnen. Dieses Bild zeigt die Formeln, die zur Berechnung der Transformationsmatrix aus einem Rotationswinkel erforderlich sind. Keine Sorge, wenn dieser Teil kompliziert erscheint: Ich verspreche, dass es das Schwierigste ist, was Sie wissen müssen.
zh_cn: 要在代码中执行旋转，我们需要能以编程的方式计算旋转后的变换值。下图展示了由旋转角度计算旋转变换矩阵所需的公式。如果看下图觉得很复杂，不用担心，这保准是你需要知道的那个最难理解矩阵旋转的地方。
zh_tw: 要在程式碼中執行旋轉, 我們需要能夠以程式設計方式計算值. 這幅圖像顯示了從旋轉角度計算變換矩陣所需的公式. 如果這部分看起來很複雜, 別擔心, 我保證這是你需要知道的最難的事情.

source: Godot represents all rotations with radians, not degrees. A full turn is `TAU` or `PI*2` radians, and a quarter turn of 90 degrees is `TAU/4` or `PI/2` radians. Working with `TAU` usually results in more readable code.
de: Godot stellt alle Drehungen im Bogenmaß und nicht in Grad dar. Eine volle Drehung ist `TAU` oder `PI*2` Bogenmaß, und eine Vierteldrehung von 90 Grad ist `TAU/4` oder `PI/2` Bogenmaß. Die Arbeit mit `TAU` führt in der Regel zu einem besser lesbaren Code.
zh_cn: Godot 用弧度（radians）表示所有的旋转，不用角度。完整转一圈是 `TAU` 或 `PI*2` 弧度，90 度（四分之一圈）是 `TAU/4` 或 `PI/2` 弧度。使用 `TAU` 通常会让代码更易读。
zh_tw: Godot 用弧度表示所有的旋轉，不用角度。完整轉一圈是 `TAU` 或 `PI*2` 弧度，90 度的四分之一圈是 `TAU/4` 或 `PI/2` 弧度。使用 `TAU` 通常會讓程式碼更易讀。

source: Fun fact: In addition to Y being *down* in Godot, rotation is represented clockwise. This means that all the math and trig functions behave the same as a Y-is-up CCW system, since these differences "cancel out". You can think of rotations in both systems being "from X to Y".
de: Interessante Fakt am Rande: In Godot ist Y nicht nur *unten*, sondern Rotation wird auch im Uhrzeigersinn dargestellt. Das bedeutet, dass sich alle mathematischen und trigonometrischen Funktionen genauso verhalten wie in einem System mit Y nach oben und gegen den Uhrzeigersinn, da sich diese Unterschiede "aufheben". Sie können sich Rotationen in beiden Systemen als "von X nach Y" vorstellen.
zh_cn: 有趣的事实：在 Godot 中，不仅 Y 是\ *朝下*\ 的，连旋转也成了顺时针的，也就是说，Godot 2D 所有的数学和三角函数行为都与 Y 轴朝上的 CCW 坐标系相同，因为这些差异“相互抵消”了。你可以认为在标准平面直角坐标系和 Godot 2D 的直角坐标系这两个坐标系中的旋转都是“从 X 到 Y”。
zh_tw: 有趣的事實：在 Godot 中，不僅 Y 是*朝下*的，旋轉也是順時針的。這意味著所有的數學和三角函式的行為都與 Y 朝上的 CCW 坐標系相同，因為這些差異“相互抵消”了。你可以認為在這兩個坐標系中的旋轉都是“從 X 到 Y”。

source: In order to perform a rotation of 0.5 radians (about 28.65 degrees), we plug in a value of 0.5 to the formula above and evaluate to find what the actual values should be:
de: Um eine Drehung von 0.5 Bogenmaß (ca. 28.65 Grad) durchzuführen, setzen wir einen Wert von 0.5 in die obige Formel ein und werten aus, was die tatsächlichen Werte sein sollten:
zh_cn: 为了执行 0.5 弧度的旋转（约 28.65 度），我们只需将 0.5 代入上面的公式中，然后计算出实际的数值：
zh_tw: 為了執行 0.5 弧度的旋轉（約 28.65 度），我們只需將 0.5 代入上面的公式中，然後計算出實際值應該是什麼：

source: Here's how that would be done in code (place the script on a Node2D):
de: So würde das im Code gemacht werden (hängen Sie das Skript an einen Node2D):
zh_cn: 这是在代码中完成的方法（将脚本放在 Node2D 上）：
zh_tw: 這是在程式碼中完成的方法（將腳本放在 Node2D 上）：

source: To calculate the object's rotation from an existing transformation matrix, you can use ``atan2(t.x.y, t.x.x)``, where t is the Transform2D.
de: Um die Rotation des Objekts aus einer bestehenden Transformationsmatrix zu berechnen, können Sie ``atan2(t.x.y, t.x.x)`` verwenden, wobei t das Transform2D ist.
zh_tw: 要從現有的變換矩陣中計算物件的旋轉，可以使用 `atan2(t.x.y, t.x.x)`，其中 t 是 Transform2D。

source: In actual projects, you can use the ``rotated()`` method to perform rotations.
de: In echten Projekten können Sie die Methode ``rotated()`` verwenden, um Rotationen durchzuführen.
zh_tw: 在實際專案中，可以使用 `rotated()` 方法進行旋轉。

source: Basis of the transformation matrix
de: Basis der Transformationsmatrix
zh_cn: 变换矩阵的基
zh_tw: 變換矩陣的基

source: So far we have only been working with the ``x`` and ``y``, vectors, which are in charge of representing rotation, scale, and/or shearing (advanced, covered at the end). The X and Y vectors are together called the *basis* of the transformation matrix. The terms "basis" and "basis vectors" are important to know.
de: Bisher haben wir nur mit den Vektoren ``x`` und ``y`` gearbeitet, die für die Darstellung von Rotation, Skalierung und/oder Scherung zuständig sind (fortgeschritten, wird am Ende behandelt). Die X- und Y-Vektoren werden zusammen als *Basis* der Transformationsmatrix bezeichnet. Die Begriffe "Basis" und "Basisvektoren" sind wichtig zu wissen.
zh_tw: 到目前為止，我們只使用 `x` 和 `y` 向量，它們負責表示旋轉、縮放和/或剪切（高級，會在文末提及）。X 和 Y 向量合稱變換矩陣的*基*（Basis）。“基”和“基向量”都是非常重要的術語。

source: You might have noticed that :ref:`class_Transform2D` actually has three :ref:`class_Vector2` values: ``x``, ``y``, and ``origin``. The ``origin`` value is not part of the basis, but it is part of the transform, and we need it to represent position. From now on we'll keep track of the origin vector in all examples. You can think of origin as another column, but it's often better to think of it as completely separate.
de: Sie haben vielleicht bemerkt, dass :ref:`class_Transform2D` eigentlich drei :ref:`class_Vector2` Werte hat: ``x``, ``y`` und ``origin``. Der ``origin``-Wert ist nicht Teil der Basis, aber er ist Teil der Transformation, und wir brauchen ihn, um die Position zu repräsentieren. Von nun an werden wir den Ursprungsvektor in allen Beispielen im Auge behalten. Man kann sich den Ursprung als eine weitere Spalte vorstellen, aber oft ist es besser, ihn als völlig eigenständig zu betrachten.
zh_tw: 你可能已經注意到 :ref:`class_Transform2D` 實際上有三個 :ref:`class_Vector2` 值：`x`、`y`、`origin`。其中 `origin` 值不是基的一部分，而是變換的一部分，我們需要用它來表示位置。從現在開始，我們將在所有例子中記錄原點向量。您可以將原點看作另一列，但把它認為是完全獨立的通常更好。

source: Note that in 3D, Godot has a separate :ref:`class_Basis` structure for holding the three :ref:`class_Vector3` values of the basis, since the code can get complex and it makes sense to separate it from :ref:`class_Transform3D` (which is composed of one :ref:`class_Basis` and one extra :ref:`class_Vector3` for the origin).
de: Beachten Sie, dass Godot in 3D eine separate :ref:`class_Basis`-Struktur für die drei :ref:`class_Vector3`-Werte der Basis hat, da der Code komplex werden kann und es sinnvoll ist, ihn von :ref:`class_Transform3D` zu trennen (das aus einer :ref:`class_Basis` und einem zusätzlichen :ref:`class_Vector3` für den Ursprung besteht).
zh_tw: 請注意在 3D 中，Godot 有一個單獨的 :ref:`class_Basis` 結構，裡面包含矩陣基的三個 :ref:`class_Vector3` 的值。因為程式碼可能變得複雜，因此將它們從 :ref:`class_Transform`（由一個 :ref:`class_Basis` 和一個額外的原點 :ref:`class_Vector3` 組成）中拆分出來是值得的。

source: Translating the transformation matrix
de: Verschieben der Transformationsmatrix
zh_cn: 变换矩阵的平移
zh_tw: 變換矩陣的平移

source: Changing the ``origin`` vector is called *translating* the transformation matrix. Translating is basically a technical term for "moving" the object, but it explicitly does not involve any rotation.
de: Das Ändern des ``Ursprungsvektors`` wird als *Translation* der Transformationsmatrix bezeichnet. Translation ist im Grunde ein technischer Begriff für das "Verschieben" des Objekts, aber es beinhaltet ausdrücklich keine Drehung.
zh_tw: 對 `origin` 向量的修改稱為對變換矩陣的*平移*。平移其實上是“移動”物件的一個技術術語，但它不會包含任何旋轉。

source: Let's work through an example to help understand this. We will start with the identity transform like last time, except we will keep track of the origin vector this time.
de: Lassen Sie uns ein Beispiel durcharbeiten, um dies zu verstehen. Wir werden wie beim letzten Mal mit der Einheitstransformation beginnen, außer dass wir diesmal den Ursprungsvektor beobachten.
zh_cn: 让我们通过一个例子来帮助理解这一点。我们将像上次一样从恒等变换开始，但这次我们将记录原点向量。
zh_tw: 讓我們通過一個例子來幫助理解這一點。我們將像上次一樣從恒等變換開始，但這次我們將記錄原點向量。

source: If we want to move the object to a position of (1, 2), we need to set its ``origin`` vector to (1, 2):
de: Wenn wir das Objekt an eine Position von (1, 2) verschieben wollen, müssen wir seinen ``Ursprungsvektor`` auf (1, 2) setzen:
zh_tw: 如果希望物件移動到 (1, 2) 的位置，只需將其 `origin` 向量設定為 (1, 2)：

source: There is also a ``translated()`` method, which performs a different operation to adding or changing ``origin`` directly. The ``translated()`` method will translate the object *relative to its own rotation*. For example, an object rotated 90 degrees clockwise will move to the right when ``translated()`` with ``Vector2.UP``.
de: Es gibt auch eine Methode ``translated()``, die eine andere Operation durchführt als das direkte Hinzufügen oder Ändern von ``origin``. Die Methode ``translated()`` übersetzt das Objekt *relativ zu seiner eigenen Drehung*. Zum Beispiel wird ein um 90 Grad im Uhrzeigersinn gedrehtes Objekt nach rechts verschoben, wenn ``translated()`` mit ``Vector2.UP`` durchgeführt wird.
zh_tw: 還有一個 `translated()` 方法，它執行的是與直接增加或更改 `origin` 不同的操作。這個 `translated()` 方法將讓該物件相對於它自己的旋轉進行平移。例如，順時針旋轉了 90 度的物件如果用 `Vector2.UP` 呼叫了 `translated()`，那麼它就會向右移動。

source: Godot's 2D uses coordinates based on pixels, so in actual projects you will want to translate by hundreds of units.
de: Das 2D-System von Godot verwendet Koordinaten auf der Basis von Pixeln, so dass Sie in tatsächlichen Projekten um Hunderte von Einheiten verschieben werden.
zh_cn: Godot 的 2D 使用基于像素的坐标，所以在实际项目中，你会想要转换成数百个单位。
zh_tw: Godot 的 2D 使用基於像素的座標，所以在實際專案中，你會想要轉換成數百個單位。

source: Putting it all together
de: Fügen wir alles zusammen
zh_cn: 融会贯通
zh_tw: 融會貫通

source: We're going to apply everything we mentioned so far onto one transform. To follow along, create a project with a Sprite2D node and use the Godot logo for the texture resource.
de: Jetzt werden wir alles, was wir bisher erwähnt haben, auf eine Transformation anwenden. Erstellen Sie dazu ein Projekt mit einem Sprite2D-Node und verwenden Sie das Godot-Logo als Texturressource.
zh_tw: 我們將把到目前為止提到的所有內容都應用到一個變換上。接下來，使用 Sprite 節點建立一個簡單的專案，並使用 Godot 徽標作為其紋理資源。

source: Let's set the translation to (350, 150), rotate by -0.5 rad, and scale by 3. I've posted a screenshot, and the code to reproduce it, but I encourage you to try and reproduce the screenshot without looking at the code!
de: Setzen wir die Translation auf (350, 150), rotieren wir um -0.5 Bogenmaß und skalieren wir um 3. Ich habe einen Screenshot und den Code zur Reproduktion gepostet, aber ich möchte Sie ermutigen, den Screenshot zu reproduzieren, ohne sich den Code anzusehen!
zh_cn: 让我们将平移设置为 (350, 150)，旋转设为 -0.5 rad，缩放设为 3。我把屏幕截图和重现代码都发出来了，但我鼓励你不看代码来尝试重现屏幕截图！
zh_tw: 讓我們將平移設定為 (350, 150)，旋轉設為 -0.5 rad，縮放設為 3。我把螢幕截圖和重現程式碼都發出來了，但我鼓勵您不看程式碼來嘗試重現螢幕截圖！

source: Shearing the transformation matrix (advanced)
de: Scheren der Transformationsmatrix (fortgeschritten)
zh_cn: 剪切变换矩阵（高级）
zh_tw: 剪切變換矩陣（高級）

source: If you are only looking for how to *use* transformation matrices, feel free to skip this section of the tutorial. This section explores an uncommonly used aspect of transformation matrices for the purpose of building an understanding of them.
de: Wenn Sie nur wissen wollen, wie man Transformationsmatrizen *verwendet*, können Sie diesen Abschnitt des Tutorials getrost überspringen. In diesem Abschnitt wird ein selten genutzter Aspekt von Transformationsmatrizen untersucht, um ein Verständnis für sie zu entwickeln.
zh_cn: 如果你只想了解如何\ *使用*\ 变换矩阵，请随意跳过本教程的这一节。本节探讨变换矩阵的一个不常用的方面，目的是为了你建立对它们的理解。
zh_tw: 如果您只想瞭解如何*使用*變換矩陣，請隨意跳過本教學的這一節。本節探討變換矩陣的一個不常用的方面，目的是為了你建立對它們的理解。
