Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/random_number_generation.po
Languages: de, zh_tw

source: Random number generation
de: Zufallszahlengenerierung
zh_tw: 亂數產生

source: Many games rely on randomness to implement core game mechanics. This page guides you through common types of randomness and how to implement them in Godot.
de: Viele Spiele basieren auf Zufälligkeit, um die zentrale Spielmechaniken zu implementieren. Diese Seite führt Sie durch gängige Arten von Zufälligkeiten und deren Implementierung in Godot.
zh_tw: 許多遊戲依靠隨機性來實作核心遊戲機制. 本頁將指導你瞭解常見的隨機性型別, 以及如何在Godot中實作它們.

source: After giving you a brief overview of useful functions that generate random numbers, you will learn how to get random elements from arrays, dictionaries, and how to use a noise generator in GDScript. Lastly, we'll take a look at cryptographically secure random number generation and how it differs from typical random number generation.
de: Nach einem kurzen Überblick über nützliche Funktionen zur Generierung von Zufallszahlen erfahren Sie, wie Sie Zufallselemente aus Arrays und Dictionarys erhalten und wie Sie einen Rauschgenerator in GDScript verwenden können. Zum Schluss werfen wir einen Blick auf die kryptografisch sichere Zufallszahlengenerierung und wie sie sich von der typischen Zufallszahlengenerierung unterscheidet.

source: Computers cannot generate "true" random numbers. Instead, they rely on `pseudorandom number generators <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ (PRNGs).
de: Computer können keine "echten" Zufallszahlen erzeugen. Stattdessen verlassen sie sich auf `Pseudozufallszahlengeneratoren <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ (PRNGs).
zh_tw: 電腦不能產生“真正的”亂數。相反，它們依賴`偽亂數產生器 <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__（PRNG）。

source: Godot internally uses the `PCG Family <https://www.pcg-random.org/>`__ of pseudorandom number generators.
de: Godot verwendet intern die `PCG-Familie <https://www.pcg-random.org/>`__ von Pseudozufallszahlengeneratoren.

source: Global scope versus RandomNumberGenerator class
de: Global-Scope vs. RandomNumberGenerator-Klasse
zh_tw: 全域作用域 vs RandomNumberGenerator 類

source: Godot exposes two ways to generate random numbers: via *global scope* methods or using the :ref:`class_RandomNumberGenerator` class.
de: Godot bietet zwei Möglichkeiten, Zufallszahlen zu generieren: über *Global Scope*-Methoden oder mit der Klasse :ref:`class_RandomNumberGenerator`.
zh_tw: Godot 提供了兩種生成亂數的方式：通過*全域作用域*方法或使用 :ref:`class_RandomNumberGenerator` 類。

source: Global scope methods are easier to set up, but they don't offer as much control.
de: Global-Scope-Methoden sind einfacher einzurichten, bieten jedoch nicht so viel Kontrolle.
zh_tw: 全域作用域方法更容易設定，但不能提供太多控制。

source: RandomNumberGenerator requires more code to use, but allows creating multiple instances, each with their own seed and state.
de: RandomNumberGenerator erfordert mehr Code, ermöglicht aber die Erstellung mehrerer Instanzen, jede mit eigenem Seed und Status.
zh_tw: RandomNumberGenerator 需要使用更多程式碼，但允許建立多個實例，每個實例都有自己的種子和狀態。

source: This tutorial uses global scope methods, except when the method only exists in the RandomNumberGenerator class.
de: In diesem Tutorial werden Global-Scope-Methoden verwendet, es sei denn, die Methode ist nur in der RandomNumberGenerator-Klasse vorhanden.
zh_tw: 本教學使用全域作用域方法, 只存在於RandomNumberGenerator類中的方法除外.

source: The randomize() method
de: Die randomize()-Methode
zh_tw: randomize() 方法

source: Since Godot 4.0, the random seed is automatically set to a random value when the project starts. This means you don't need to call ``randomize()`` in ``_ready()`` anymore to ensure that results are random across project runs. However, you can still use ``randomize()`` if you want to use a specific seed number, or generate it using a different method.
de: Seit Godot 4.0 wird der Zufallswert automatisch auf einen Zufallswert gesetzt, wenn das Projekt startet. Das bedeutet, dass Sie ``randomize()`` in ``_ready()`` nicht mehr aufrufen müssen, um sicherzustellen, dass die Ergebnisse über alle Projektläufe hinweg zufällig sind. Sie können jedoch immer noch ``randomize()`` verwenden, wenn Sie eine bestimmte Seed-Zahl verwenden oder diese mit einer anderen Methode erzeugen wollen.

source: In global scope, you can find a :ref:`randomize() <class_@GlobalScope_method_randomize>` method. **This method should be called only once when your project starts to initialize the random seed.** Calling it multiple times is unnecessary and may impact performance negatively.
de: Im globalen Scope finden Sie eine Methode :ref:`randomize() <class_@GlobalScope_method_randomize>`. **Diese Methode sollte nur einmal aufgerufen werden, wenn Ihr Projekt beginnt, um den Zufallsgenerator zu initialisieren.** Ein mehrfacher Aufruf ist unnötig und kann die Performance negativ beeinflussen.
zh_tw: 在全域作用域內, 你可以找到一個 :ref:`randomize() <class_@GDScript_method_randomize>` 方法. **這個方法只需要在你的專案開始初始化隨機種子的時候呼叫一次** , 多次呼叫是多餘的, 並且有可能影響性能.

source: Putting it in your main scene script's ``_ready()`` method is a good choice:
de: Es ist eine gute Wahl, sie in die ``_ready()`` Methode Ihres Hauptszenenskripts einzubauen:
zh_tw: 把它放在你的主場景腳本的 ``_ready()`` 方法中是個不錯的選擇：

source: You can also set a fixed random seed instead using :ref:`seed() <class_@GlobalScope_method_seed>`. Doing so will give you *deterministic* results across runs:
de: Sie können stattdessen auch einen festen willkürlichen Seed-Wert mit :ref:`seed() <class_@GlobalScope_method_seed>` setzen. Auf diese Weise erhalten Sie *deterministische* Ergebnisse über alle Läufe hinweg:
zh_tw: 您也可以使用 :ref:`seed() <class_@GDScript_method_seed>` 設定固定的隨機種子。這樣能在運作中獲得*確定性*的結果：

source: When using the RandomNumberGenerator class, you should call ``randomize()`` on the instance since it has its own seed:
de: Wenn Sie die Klasse RandomNumberGenerator verwenden, sollten Sie ``randomize()`` für die Instanz aufrufen, da diese ihren eigenen Startwert hat:
zh_tw: 當使用RandomNumberGenerator類時，應該在實例上呼叫 ``randomize()`` ，因為它有自己的種子:

source: Getting a random number
de: Ermitteln einer Zufallszahl
zh_tw: 設定主要場景

source: Let's look at some of the most commonly used functions and methods to generate random numbers in Godot.
de: Sehen wir uns einige der am häufigsten verwendeten Funktionen und Methoden zur Erzeugung von Zufallszahlen in Godot an.
zh_tw: 讓我們來看看Godot中最常用的一些生成亂數的函式和方法.

source: The function :ref:`randi() <class_@GlobalScope_method_randi>` returns a random number between 0 and 2^32-1. Since the maximum value is huge, you most likely want to use the modulo operator (``%``) to bound the result between 0 and the denominator:
de: Die Funktion :ref:`randi() <class_@GlobalScope_method_randi>` gibt eine Zufallszahl zwischen 0 und 2^32-1 zurück. Da der Maximalwert sehr groß ist, wollen Sie wahrscheinlich den Modulo-Operator (``%``) verwenden, um das Ergebnis zwischen 0 und den Nenner zu begrenzen:
zh_tw: 函式 :ref:`randi() <class_@GDScript_method_randi>` 返回 0 到 2^32-1 之間的亂數。由於最大值很大，您很可能希望使用模運算子 (``%``) 將結果限制在 0 和分母之間：

source: :ref:`randf() <class_@GlobalScope_method_randf>` returns a random floating-point number between 0 and 1. This is useful to implement a :ref:`doc_random_number_generation_weighted_random_probability` system, among other things.
de: :ref:`randf() <class_@GlobalScope_method_randf>` liefert eine zufällige Float-Zahl zwischen 0 und 1. Dies ist unter anderem nützlich, um ein :ref:`doc_random_number_generation_weighted_random_probability`-System zu implementieren.
zh_tw: :ref:`randf() <class_@GDScript_method_randf>` 返回一個0到1之間的隨機浮點數. 在實作 :ref:`doc_random_number_generation_weighted_random_probability` 系統等時非常有用.

source: :ref:`randfn() <class_RandomNumberGenerator_method_randfn>` returns a random floating-point number following a `normal distribution <https://en.wikipedia.org/wiki/Normal_distribution>`__. This means the returned value is more likely to be around the mean (0.0 by default), varying by the deviation (1.0 by default):
de: :ref:`randfn() <class_RandomNumberGenerator_method_randfn>` gibt eine zufällige Float-Zahl zurück, die einer `Normalverteilung <https://en.wikipedia.org/wiki/Normal_distribution>`__ folgt. Das bedeutet, dass der zurückgegebene Wert mit größerer Wahrscheinlichkeit um den Mittelwert (standardmäßig 0.0) liegt und um die Standardabweichung (standardmäßig 1.0) variiert:
zh_tw: :ref:`randfn() <class_RandomNumberGenerator_method_randfn>` 返回遵循 `正態分佈 <https://en.wikipedia.org/wiki/Normal_distribution>`__ 的隨機浮點數。這意味著返回值更有可能在平均值附近（預設為 0.0），隨偏差變化（預設為 1.0）:

source: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` takes two arguments ``from`` and ``to``, and returns a random floating-point number between ``from`` and ``to``:
de: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` nimmt zwei Argumente ``from`` und ``to``, und gibt eine zufällige Float-Zahl zwischen ``from`` und ``to`` zurück:
zh_tw: :ref:`rand_range() <class_@GDScript_method_rand_range>` 接受兩個參數 ``from`` 和 ``to`` ，並返回一個介於 ``from`` 和 ``to`` 之間的隨機浮點數:

source: :ref:`RandomNumberGenerator.randi_range() <class_RandomNumberGenerator_method_randi_range>` takes two arguments ``from`` and ``to``, and returns a random integer between ``from`` and ``to``:
de: :ref:`RandomNumberGenerator.randi_range() <class_RandomNumberGenerator_method_randi_range>` nimmt zwei Argumente ``from`` und ``to``, und gibt eine zufällige Integer-Zahl zwischen ``from`` und ``to`` zurück:
zh_tw: :ref:`RandomNumberGenerator.randi_range() <class_RandomNumberGenerator_method_randi_range>` 接受兩個參數 ``from`` 和 ``to`` ，並返回一個介於 ``from`` 和 ``to`` 之間的隨機整數：

source: Get a random array element
de: Auf ein zufälliges Array-Element zugreifen
zh_tw: 獲取一個亂陣列元素

source: We can use random integer generation to get a random element from an array:
de: Wir können zufällige Integer-Zahlen erzeugen, um ein zufälliges Element aus einem Array zu erhalten:
zh_tw: 我們可以使用隨機整數生成來從陣列中獲得一個隨機元素:

source: To prevent the same fruit from being picked more than once in a row, we can add more logic to this method:
de: Um zu verhindern, dass dieselbe Frucht mehrmals hintereinander ausgewählt wird, können wir dieser Methode mehr Logik hinzufügen:
zh_tw: 為了防止連續多次採摘相同的水果，我們可以給這個方法新增更多的邏輯:

source: This approach can be useful to make random number generation feel less repetitive. Still, it doesn't prevent results from "ping-ponging" between a limited set of values. To prevent this, use the :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>` pattern instead.
de: Dieser Ansatz kann nützlich sein, damit sich die Zufallszahlengenerierung weniger repetitiv anfühlt. Dennoch verhindert es nicht, dass Ergebnisse zwischen einem begrenzten Satz von Werten hin und her springen. Um dies zu verhindern, verwenden Sie stattdessen das :ref:`Shuffle-Bag <doc_random_number_generation_shuffle_bags>`-Pattern.
zh_tw: 這種方法可以讓亂數產生的感覺不那麼重複. 不過, 它仍然不能防止結果在有限的一組值之間 "乒乓反復". 為了防止這種情況, 請使用 :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>` 模式來代替.

source: Get a random dictionary value
de: Abrufen eines zufälligen Dictionary-Werts
zh_tw: 獲取一個隨機字典值

source: We can apply similar logic from arrays to dictionaries as well:
de: Wir können eine ähnliche Logik der Arrays auch auf Dictionarys anwenden:
zh_tw: 我們也可以將陣列的類似邏輯應用於字典:

source: Weighted random probability
de: Gewichtete zufällige Wahrscheinlichkeit
zh_tw: 加權隨機概率

source: The :ref:`randf() <class_@GlobalScope_method_randf>` method returns a floating-point number between 0.0 and 1.0. We can use this to create a "weighted" probability where different outcomes have different likelihoods:
de: Die Methode :ref:`randf() <class_@GlobalScope_method_randf>` gibt eine Float-Zahl zwischen 0.0 und 1.0 zurück. Damit können wir eine "gewichtete" Wahrscheinlichkeit erstellen, bei der verschiedene Ergebnisse unterschiedliche Wahrscheinlichkeiten haben:
zh_tw: :ref:`randf() <class_@GDScript_method_randf>` 方法返回一個介於 0.0 和 1.0 之間的浮點數。我們可以使用它來建立“加權”概率，其中不同的結果具有不同的可能性：

source: "Better" randomness using shuffle bags
de: "Bessere" Zufälligkeit durch Shuffle-Bags
zh_tw: 使用 shuffle bag 達到“更好”隨機性

source: Taking the same example as above, we would like to pick fruits at random. However, relying on random number generation every time a fruit is selected can lead to a less *uniform* distribution. If the player is lucky (or unlucky), they could get the same fruit three or more times in a row.
de: Nehmen wir das gleiche Beispiel wie oben: Wir möchten die Früchte nach dem Zufallsprinzip auswählen. Wenn man sich jedoch jedes Mal, wenn eine Frucht ausgewählt wird, auf die Generierung von Zufallszahlen verlässt, kann dies zu einer weniger *gleichmäßigen* Verteilung führen. Wenn der Spieler Glück (oder Pech) hat, könnte er drei oder mehr Mal hintereinander dieselbe Frucht erhalten.
zh_tw: 以上面同樣的例子為例, 我們希望隨機挑選水果. 然而, 每次選擇水果時依靠亂數產生會導致分佈不那麼 *均勻* . 如果玩家足夠幸運(或不幸), 他們可能會連續三次或更多次得到相同的水果.

source: You can accomplish this using the *shuffle bag* pattern. It works by removing an element from the array after choosing it. After multiple selections, the array ends up empty. When that happens, you reinitialize it to its default value::
de: Sie können dies mit dem *Shuffle-Bag*-Pattern erreichen. Dabei wird ein Element aus dem Array entfernt, nachdem es ausgewählt wurde. Nach mehrfacher Auswahl ist das Array irgendwann leer. Wenn das passiert, setzen Sie es auf seinen Ursprungswert zurück::
zh_tw: 你可以使用 *shuffle bag* 模式來實作。它的工作原理是在選擇陣列後從陣列中刪除一個元素。多次選擇之後，陣列會被清空。當這種情況發生時，就將陣列重新初始化為預設值： ::

source: When running the above code, there is a chance to get the same fruit twice in a row. Once we picked a fruit, it will no longer be a possible return value unless the array is now empty. When the array is empty, we reset it back to its default value, making it possible to have the same fruit again, but only once.
de: Bei der Ausführung des obigen Codes besteht die Möglichkeit, zweimal hintereinander die gleiche Frucht zu erhalten. Sobald wir eine Frucht gewählt haben, ist sie kein möglicher Rückgabewert mehr, es sei denn, das Array ist jetzt leer. Wenn das Array leer ist, setzen wir es auf seinen Ursprungswert zurück, so dass es möglich ist, dieselbe Frucht erneut zu erhalten, aber nur einmal.
zh_tw: 在運作上面的程式碼時, 仍有可能連續兩次得到同一個水果. 我們摘下一個水果時, 它將不再是一個可能的返回值, 但除非陣列現在是空的. 當陣列為空時, 此時我們將其重設回預設值, 這樣就導致了能再次獲得相同的水果, 但只有這一次.

source: Random noise
de: Zufälliges Rauschen
zh_tw: 隨機數函式

source: The random number generation shown above can show its limits when you need a value that *slowly* changes depending on the input. The input can be a position, time, or anything else.
de: Die oben gezeigte Zufallszahlengenerierung stößt an ihre Grenzen, wenn Sie einen Wert benötigen, der sich *langsam* in Abhängigkeit von der Eingabe ändert. Die Eingabe kann eine Position, eine Zeit oder etwas anderes sein.
zh_tw: 當你需要一個 *緩慢* 根據輸入而變化的值時, 上面顯示的亂數產生方式就顯示出了它們的局限性. 這裡的輸入可以是位置, 時間或其他任何東西.

source: To achieve this, you can use random *noise* functions. Noise functions are especially popular in procedural generation to generate realistic-looking terrain. Godot provides :ref:`class_fastnoiselite` for this, which supports 1D, 2D and 3D noise. Here's an example with 1D noise:
de: Um dies zu erreichen, können Sie zufällige *Rausch*-Funktionen verwenden. Rauschfunktionen sind besonders in der prozeduralen Generierung beliebt, um realistisch aussehendes Terrain zu erzeugen. Godot bietet hierfür :ref:`class_fastnoiselite`, die 1D, 2D und 3D Rauschen unterstützt. Hier ist ein Beispiel mit 1D-Rauschen:
zh_tw: 為此，您可以使用隨機*雜訊*函式。雜訊函式在程式式生成中特別受歡迎，可以生成逼真的地形。 Godot 為此提供了 :ref:`class_opensimplexnoise`，它支援 1D、2D、3D 和 4D 雜訊。這是一個 1D 雜訊的例子：

source: Cryptographically secure pseudorandom number generation
de: Kryptografisch sichere Pseudozufallszahlengenerierung

source: So far, the approaches mentioned above are **not** suitable for *cryptographically secure* pseudorandom number generation (CSPRNG). This is fine for games, but this is not sufficient for scenarios where encryption, authentication or signing is involved.
de: Bislang sind die oben genannten Ansätze **nicht** für die *kryptografisch sichere* Pseudozufallszahlengenerierung (CSPRNG) geeignet. Für Spiele ist das in Ordnung, aber für Szenarien, bei denen es um Verschlüsselung, Authentifizierung oder Signierung geht, ist das nicht ausreichend.

source: Godot offers a :ref:`class_Crypto` class for this. This class can perform asymmetric key encryption/decryption, signing/verification, while also generating cryptographically secure random bytes, RSA keys, HMAC digests, and self-signed :ref:`class_X509Certificate`\ s.
de: Godot bietet hierfür die Klasse :ref:`class_Crypto`. Diese Klasse unterstützt asymmetrische Ver- und entschlüsselung, Signieren und Verifizieren und außerdem die Erzeugung von kryptographisch sicheren Zufallsbytes, RSA-Schlüssel, HMAC-Digests und selbstsignierte :ref:`class_X509Certificate`\ s.

source: The downside of :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` is that it's much slower than standard pseudorandom number generation. Its API is also less convenient to use. As a result, :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` should be avoided for gameplay elements.
de: Der Nachteil von :abbr:`CSPRNG (Cryptographically Secure Pseudo-Random Number Generation)` ist, dass es viel langsamer ist als die Standard-Pseudozufallszahlengenerierung. Seine API ist auch weniger bequem zu benutzen. Aus diesem Grund sollte :abbr:`CSPRNG (Cryptographically Secure Pseudo-Random Number Generation)` für Spielelemente vermieden werden.

source: Example of using the Crypto class to generate 2 random integers between ``0`` and ``2^32 - 1`` (inclusive):
de: Beispiel für die Verwendung der Crypto-Klasse zur Erzeugung von 2 zufälligen Integer-Zaheln zwischen ``0`` und ``2^32 - 1`` (einschließlich):

source: See :ref:`class_PackedByteArray`'s documentation for other methods you can use to decode the generated bytes into various types of data, such as integers or floats.
de: Siehe die Dokumentation von :ref:`class_PackedByteArray` für andere Methoden, die Sie verwenden können, um die erzeugten Bytes in verschiedene Datentypen zu dekodieren, wie z.B. Integer oder Floats.

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
