Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/vector_math.po
Languages: de, zh_tw

source: One common use of cross products is to find the surface normal of a plane or surface in 3D space. If we have the triangle ``ABC`` we can use vector subtraction to find two edges ``AB`` and ``AC``. Using the cross product, ``AB × AC`` produces a vector perpendicular to both: the surface normal.
de: Eine häufige Anwendung von Kreuzprodukten ist die Ermittlung der Flächennormalen einer Ebene oder Fläche im 3D-Raum. Wenn wir das Dreieck ``ABC`` haben, können wir die Vektorsubtraktion verwenden, um zwei Kanten ``AB`` und ``AC`` zu finden. Mit dem Kreuzprodukt ``AB × AC`` erhält man einen Vektor, der senkrecht zu beiden Kanten steht: die Oberflächennormale.
zh_tw: 外積的一種常用方法是在 3D 空間中求平面或曲面的表面法向量。如果有三角形 ``ABC``，我們可以用向量減法找到兩條邊 ``AB`` 和 ``AC``。通過叉乘，``AB x AC`` 得到一個垂直於這兩個向量的向量：表面法向量。

source: Here is a function to calculate a triangle's normal:
de: Hier ist eine Funktion zur Bestimmung der Normalen eines Dreiecks:
zh_tw: 下面是一個計算三角形法線的函式:

source: Pointing to a target
de: Auf ein Ziel ausrichten
zh_tw: 指向目標

source: In the dot product section above, we saw how it could be used to find the angle between two vectors. However, in 3D, this is not enough information. We also need to know what axis to rotate around. We can find that by calculating the cross product of the current facing direction and the target direction. The resulting perpendicular vector is the axis of rotation.
de: Im obigen Abschnitt über das Skalarprodukt haben wir gesehen, wie damit der Winkel zwischen zwei Vektoren ermittelt werden kann. In 3D reichen diese Informationen jedoch nicht aus. Wir müssen auch wissen, um welche Achse wir uns drehen müssen. Wir können dies feststellen, indem wir das Kreuzprodukt der aktuellen Blickrichtung und der Zielrichtung berechnen. Der resultierende senkrechte Vektor ist die Rotationsachse.
zh_tw: 在上面的點積部分，我們看到如何用它來搜尋兩個向量之間的角度。然而在 3D 中，這些資訊還不夠。我們還需要知道在圍繞什麼軸旋轉。我們可以通過計算目前面對的方向和目標方向的外積來搜尋。由此得到的垂直向量就是旋轉軸。

source: More information
de: Weitere Informationen
zh_tw: 更多資訊

source: For more information on using vector math in Godot, see the following articles:
de: Für weitere Informationen über Vektormathematik in Godot siehe die folgenden Artikel:
zh_tw: 有關在Godot中使用向量數學的更多資訊, 請參閱以下文章:

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
