Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/vector_math.po
Languages: de, zh_tw

source: Vector math
de: Vektormathematik
zh_tw: 向量數學

source: Introduction
de: Einführung
zh_tw: 前言

source: This tutorial is a short and practical introduction to linear algebra as it applies to game development. Linear algebra is the study of vectors and their uses. Vectors have many applications in both 2D and 3D development and Godot uses them extensively. Developing a good understanding of vector math is essential to becoming a strong game developer.
de: Dieses Tutorial ist eine kurze und praktische Einführung in die lineare Algebra, so wie sie in der Spielentwicklung benötigt wird. Lineare Algebra ist die Lehre von Vektoren und deren Nutzung. Vektoren haben viele Anwendungen in der 2D- und 3D-Entwicklung und Godot nutzt diese umfangreich. Für einen guten Spielentwickler ist es unverzichtbar, ein gutes Verständnis über Vektormathematik zu entwickeln.
zh_tw: 本教學是一個簡短而實用的線性代數介紹，因為它適用於遊戲開發。線性代數是研究向量及其用途的學科。向量在 2D 和 3D 開發中都有許多應用，Godot 對它們的應用也非常廣泛。要成為一名優秀的遊戲開發者，對向量數學的理解是必不可少的。

source: This tutorial is **not** a formal textbook on linear algebra. We will only be looking at how it is applied to game development. For a broader look at the mathematics, see https://www.khanacademy.org/math/linear-algebra
de: Dieses Tutorial ist **kein** formelles Lehrbuch über lineare Algebra, wir werden hier nur auf deren Anwendung bei der Spieleentwicklung eingehen. Für einen umfassenden Blick auf diesen Bereich der Mathematik siehe https://www.khanacademy.org/math/linear-algebra
zh_tw: 本教學**不是**線性代數的正式教科書。我們將只關注它如何應用於遊戲開發。要更全面地瞭解數學，請參見 https://www.khanacademy.org/math/linear-algebra

source: Coordinate systems (2D)
de: Koordinatensysteme (2D)
zh_tw: 坐標系（2D）

source: In 2D space, coordinates are defined using a horizontal axis (``x``) and a vertical axis (``y``). A particular position in 2D space is written as a pair of values such as ``(4, 3)``.
de: Im 2D-Raum werden die Koordinaten mittels einer horizontalen (``x``) und vertikalen (``y``) Achse definiert. Eine bestimmte Position im 2D-Raum wird als Wertepaar geschrieben, z.B. ``(4, 3)``.
zh_tw: 在 2D 空間中，使用水平軸（``x``）和垂直軸（``y``）定義座標。2D 空間中的特定位置會被寫成一對值，如 ``(4, 3)``。

source: If you're new to computer graphics, it might seem odd that the positive ``y`` axis points **downwards** instead of upwards, as you probably learned in math class. However, this is common in most computer graphics applications.
de: Es mag ungewöhnlich erscheinen, dass die positive ``y`` Achse nach unten zeigt anstatt nach oben, wie man es im Mathematikunterricht einmal gelernt hat. Dies ist aber normal in den meisten Computergrafik-Programmen.
zh_tw: 如果您是電腦圖形學的新手，可能會覺得很奇怪，``y`` 軸的正方向**朝下**而不是向上（您在數學課上學到的就像那樣）。然而，這在大多數電腦圖形應用程式中是常見的。

source: Any position in the 2D plane can be identified by a pair of numbers in this way. However, we can also think of the position ``(4, 3)`` as an **offset** from the ``(0, 0)`` point, or **origin**. Draw an arrow pointing from the origin to the point:
de: Jede Position im 2D-System kann über ein Zahlenpaar angesprochen werden. Man kann somit die Position ``(4, 3)`` als **Versatz** vom Ursprung ``(0, 0)`` ansehen. Hier sehen wir einen Pfeil vom Ursprung zum Punkt:
zh_tw: 2D 平面上的任何位置都可以用一對數字來表示。然而，我們也可以將位置 ``(4, 3)`` 看作是從 ``(0, 0)`` 點或**原點**出發的**偏移**。畫一個箭頭從原點指向點：

source: This is a **vector**. A vector represents a lot of useful information. As well as telling us that the point is at ``(4, 3)``, we can also think of it as an angle ``θ`` (theta) and a length (or magnitude) ``m``. In this case, the arrow is a **position vector** - it denotes a position in space, relative to the origin.
de: Dies ist ein **Vektor**. Ein Vektor repräsentiert eine Menge nützlicher Informationen. Er sagt uns nicht nur, dass der Punkt bei ``(4, 3)`` liegt, sondern wir können ihn uns auch als einen Winkel ``θ`` (Theta) und eine Länge (oder Betrag) ``m`` vorstellen. In diesem Fall ist der Pfeil ein **Positionsvektor** - er bezeichnet eine Position im Raum, bezogen auf den Ursprung.
zh_tw: 這是一個**向量**。向量表示許多有用的資訊。除了告訴我們點在 ``(4, 3)`` 之外，我們還可以把它看成角度 ``θ`` 和長度（或幅度）``m``。在這種情況下，箭頭是一個**位置向量**——它表示空間中相對於原點的位置。

source: A very important point to consider about vectors is that they only represent **relative** direction and magnitude. There is no concept of a vector's position. The following two vectors are identical:
de: Ein sehr wichtiger Punkt bei Vektoren ist, dass sie nur die **relative** Richtung und Betrag darstellen. Es gibt kein Konzept für die Position eines Vektors. Die folgenden zwei Vektoren sind identisch:
zh_tw: 關於向量, 需要考慮的一個重要點是它們僅表示 **相對** 方向和大小. 沒有一個向量的位置的概念. 以下兩個向量相同:

source: Both vectors represent a point 4 units to the right and 3 units below some starting point. It does not matter where on the plane you draw the vector, it always represents a relative direction and magnitude.
de: Beide Vektoren stellen einen Punkt dar, der 4 Einheiten nach rechts und 3 Einheiten unter einem Ausgangspunkt liegt. Es spielt keine Rolle, wo auf der Ebene Sie den Vektor zeichnen, er stellt immer eine relative Richtung und Betrag dar.
zh_tw: 這兩個向量都表示向右4個單位, 在某個起始點以下3個單位. 不管您在平面上畫哪個向量, 它總是代表一個相對的方向和大小.

source: Vector operations
de: Vektoroperationen
zh_tw: 向量運算

source: You can use either method (x and y coordinates or angle and magnitude) to refer to a vector, but for convenience, programmers typically use the coordinate notation. For example, in Godot, the origin is the top-left corner of the screen, so to place a 2D node named ``Node2D`` 400 pixels to the right and 300 pixels down, use the following code:
de: Sie können jede der beiden Methoden (x- und y-Koordinaten oder Winkel und Betrag) verwenden, um sich auf einen Vektor zu beziehen, aber der Einfachheit halber verwenden Programmierer normalerweise die Koordinaten-Notation. Zum Beispiel ist in Godot der Ursprung die linke obere Ecke des Bildschirms. Um einen 2D-Node namens ``Node2D`` 400 Pixel nach rechts und 300 Pixel nach unten zu platzieren, verwenden Sie den folgenden Code:
zh_tw: 您可以使用任意一種方法,x和y座標或角度和大小, 來引用向量, 但是為了方便起見, 程式師通常使用座標標記法. 例如, 在Godot中, 原點是螢幕左上角, 因此要將一個名為 ``Node2D`` 的2D節點向右400像素, 向下300像素, 請使用以下程式碼:

source: Godot supports both :ref:`Vector2 <class_Vector2>` and :ref:`Vector3 <class_Vector3>` for 2D and 3D usage, respectively. The same mathematical rules discussed in this article apply to both types, and wherever we link to ``Vector2`` methods in the class reference, you can also check out their ``Vector3`` counterparts.
de: Godot unterstützt sowohl :ref:`Vector2 <class_Vector2>` als auch :ref:`Vector3 <class_Vector3>` für den 2D- bzw. 3D-Gebrauch. Die gleichen mathematischen Regeln, die in diesem Artikel besprochen werden, gelten für beide Typen, und wo immer wir in der Klassenreferenz auf ``Vektor2``-Methoden verweisen, können Sie auch deren ``Vektor3``-Gegenstücke nachlesen.
zh_tw: Godot支援 :ref:`Vector2 <class_Vector2>` 和 :ref:`Vector3 <class_Vector3>` 分別用於2D和3D. 本文討論的數學規則同樣適用於這兩種型別.

source: Member access
de: Zugriff auf die Komponenten
zh_tw: 成員存取

source: The individual components of the vector can be accessed directly by name.
de: Auf die einzelnen Komponenten des Vektors kann direkt über den Namen zugegriffen werden.
zh_tw: 向量的各個組成部分可以直接通過名稱存取.

source: Adding vectors
de: Vektoren addieren
zh_tw: 向量加法

source: When adding or subtracting two vectors, the corresponding components are added:
de: Beim Addieren oder Subtrahieren zweier Vektoren werden die entsprechenden Komponenten addiert:
zh_tw: 當兩個向量相加或相減時, 相應的分量相加:

source: We can also see this visually by adding the second vector at the end of the first:
de: Wir können dies auch visuell sehen, indem wir den zweiten Vektor an das Ende des ersten anhängen:
zh_tw: 我們也可以通過在第一個向量的末尾加上第二個向量來直觀地看到這一點:

source: Note that adding ``a + b`` gives the same result as ``b + a``.
de: Beachten Sie, dass ``a + b`` zum gleichen Ergebnis führt wie ``b + a``.
zh_tw: 注意，做 ``a + b`` 的加法和 ``b + a`` 得到的結果是一樣的。

source: Scalar multiplication
de: Skalarmultiplikation
zh_tw: 標量乘法

source: Vectors represent both direction and magnitude. A value representing only magnitude is called a **scalar**. Scalars use the :ref:`class_float` type in Godot.
de: Vektoren stellen sowohl die Richtung als auch den Betrag dar. Ein Wert, der nur den Betrag darstellt, wird **Skalar** genannt. Skalare verwenden in Godot den Typ :ref:`class_float`.
zh_tw: 向量表示方向和幅度。僅表示幅值的值稱為**標量**。

source: A vector can be multiplied by a **scalar**:
de: Ein Vektor kann mit einen **Skalar** multipliziert werden:
zh_tw: 向量可以乘以**標量**：

source: Multiplying a vector by a positive scalar does not change its direction, only its magnitude. Multiplying with a negative scalar results in a vector in the opposite direction. This is how you **scale** a vector.
de: Die Multiplikation eines Vektors mit einem positiven Skalar ändert nicht seine Richtung, sondern nur seinen Betrag. Die Multiplikation mit einem negativen Skalar ergibt einen Vektor in umgekehrter Richtung. Auf diese Weise **skaliert** man einen Vektor.
zh_tw: 向量乘以標量不會改變它的方向，只會改變它的幅值。這就是**縮放**向量的方法。

source: Practical applications
de: Praktische Anwendungen
zh_tw: 實際應用

source: Let's look at two common uses for vector addition and subtraction.
de: Sehen wir uns einmal zwei einfache Anwendungen zur Vektoraddition und -subtraktion an.
zh_tw: 讓我們看看向量加法和減法的兩種常見用法.

source: Movement
de: Bewegung
zh_tw: 移動

source: A vector can represent **any** quantity with a magnitude and direction. Typical examples are: position, velocity, acceleration, and force. In this image, the spaceship at step 1 has a position vector of ``(1, 3)`` and a velocity vector of ``(2, 1)``. The velocity vector represents how far the ship moves each step. We can find the position for step 2 by adding the velocity to the current position.
de: Ein Vektor kann **jede** Größe mit einem Betrag und einer Richtung darstellen. Typische Beispiele sind: Position, Geschwindigkeit, Beschleunigung und Kraft. In diesem Bild hat das Raumschiff bei Schritt 1 einen Positionsvektor von ``(1, 3)`` und einen Geschwindigkeitsvektor von ``(2, 1)``. Der Geschwindigkeitsvektor gibt an, wie weit sich das Raumschiff in jedem Schritt bewegt. Wir können die Position für Schritt 2 ermitteln, indem wir die Geschwindigkeit zur aktuellen Position addieren.
zh_tw: 向量可以表示具有大小和方向的**任何**量。典型的例子有：位置、速度、加速度、力。在這幅圖像中，在第 1 步的飛船的位置向量為 ``(1,3)``，速度向量為 ``(2,1)``。速度向量表示船舶每一步移動的距離。通過將速度加到目前位置，我們可以求出第 2 步的位置。

source: Velocity measures the **change** in position per unit of time. The new position is found by adding the velocity multiplied by the elapsed time (here assumed to be one unit, e.g. 1 s) to the previous position.
de: Die Geschwindigkeit misst die **Veränderung** der Position pro Zeiteinheit. Die neue Position wird durch Addition der Geschwindigkeit multipliziert mit der verstrichenen Zeit (hier als eine Einheit angenommen, z.B. 1 s) zur vorherigen Position ermittelt.
zh_tw: 速度測量單位時間內位置的**變化**。新的位置是通過在前一個位置上增加速度來找到的。

source: In a typical 2D game scenario, you would have a velocity in pixels per second, and multiply it by the ``delta`` parameter (time elapsed since the previous frame) from the :ref:`_process() <class_Node_private_method__process>` or :ref:`_physics_process() <class_Node_private_method__physics_process>` callbacks.
de: In einem typischen 2D-Spielszenario würde man eine Geschwindigkeit in Pixeln pro Sekunde angeben und diese mit dem Parameter ``delta`` (die seit dem letzten Frame verstrichene Zeit) aus den :ref:`_process() <class_Node_private_method__process>` oder :ref:`_physics_process() <class_Node_private_method__physics_process>`-Callbacks multiplizieren.

source: Pointing toward a target
de: Ausrichtung auf ein Ziel
zh_tw: 指向目標

source: In this scenario, you have a tank that wishes to point its turret at a robot. Subtracting the tank's position from the robot's position gives the vector pointing from the tank to the robot.
de: In diesem Szenario haben Sie einen Panzer, der seinen Turm auf einen Roboter richten möchte. Subtrahiert man die Position des Panzers von der Position des Roboters, erhält man den Vektor, der vom Panzer auf den Roboter zeigt.
zh_tw: 在這個場景中，您有一輛坦克，坦克希望讓炮塔指向機器人。把機器人的位置減去坦克的位置就得到了從坦克指向機器人的向量。

source: To find a vector pointing from ``A`` to ``B``, use ``B - A``.
de: Um einen Vektor zu finden, der von ``A`` nach ``B`` zeigt, benutzt man ``B - A``.
zh_tw: 要找到從 ``A`` 指向 ``B`` 的向量，請使用 ``B - A``。

source: Unit vectors
de: Einheitsvektoren
zh_tw: 單位向量

source: A vector with **magnitude** of ``1`` is called a **unit vector**. They are also sometimes referred to as **direction vectors** or **normals**. Unit vectors are helpful when you need to keep track of a direction.
de: Ein Vektor mit dem **Betrag** von ``1`` wird **Einheitsvektor** genannt. Sie werden manchmal auch als **Richtungsvektoren** oder **Normalen** bezeichnet. Einheitsvektoren sind hilfreich, wenn man eine Richtung festhalten muss.
zh_tw: **大小**為 ``1`` 的向量稱為**單位向量**，有時也被稱為**方向向量**或**法線**。當您需要記錄方向時就可以使用單位向量。

source: Normalization
de: Normierung
zh_tw: 正規化

source: **Normalizing** a vector means reducing its length to ``1`` while preserving its direction. This is done by dividing each of its components by its magnitude. Because this is such a common operation, Godot provides a dedicated :ref:`normalized() <class_Vector2_method_normalized>` method for this:
de: **Normieren** eines Vektors bedeutet, seine Länge auf ``1`` zu reduzieren und dabei seine Richtung beizubehalten. Dies geschieht, indem jede seiner Komponenten durch ihren Betrag dividiert wird. Weil dies eine so häufige Operation ist, bietet Godot eine eigene Methode :ref:`normalisiert() <class_Vector2_method_normalized>` dafür an:
zh_tw: **正規化** 一個向量意味著將其長度縮減到 ``1`` , 並保留其方向. 其方法是將每個分量除以其幅度. 由於這是一個很常見的操作, ``Vector2`` 和 ``Vector3`` 提供了正規化的方法:

source: Because normalization involves dividing by the vector's length, you cannot normalize a vector of length ``0``. Attempting to do so would normally result in an error. In GDScript though, trying to call the ``normalized()`` method on a vector of length 0 leaves the value untouched and avoids the error for you.
de: Da bei der Normierung durch die Länge des Vektors dividiert wird, können Sie einen Vektor der Länge ``0`` nicht normieren. Der Versuch, dies zu tun, würde normalerweise zu einem Fehler führen. In GDScript bleibt der Wert jedoch unverändert, wenn man die Methode ``normalized()`` für einen Vektor der Länge 0 aufruft, so dass der Fehler nicht auftritt.
zh_tw: 因為正規化需要除以向量的長度, 所以不能對長度為 ``0`` 的向量進行正規化. 試圖這樣做會導致錯誤.

source: Reflection
de: Reflexion
zh_tw: 反射

source: A common use of unit vectors is to indicate **normals**. Normal vectors are unit vectors aligned perpendicularly to a surface, defining its direction. They are commonly used for lighting, collisions, and other operations involving surfaces.
de: Eine häufige Verwendung von Einheitsvektoren ist die Angabe von **Normalen**. Normalenvektoren sind Einheitsvektoren, die senkrecht zu einer Oberfläche ausgerichtet sind und deren Richtung definieren. Sie werden häufig für Beleuchtung, Kollisionen und andere Operationen mit Oberflächen verwendet.
zh_tw: 單位向量的一種常見用法是表示**法線**。法向量是垂直於表面的單位向量，定義了表面的方向。它們通常用於照明、碰撞和涉及表面的其他操作。

source: For example, imagine we have a moving ball that we want to bounce off a wall or other object:
de: Stellen Sie sich zum Beispiel vor, Sie haben einen sich bewegenden Ball, den Sie an einer Wand oder einem anderen Objekt abprallen lassen wollen:
zh_tw: 例如, 假設我們有一個移動的球, 我們想從牆上或其他物體上彈回來:

source: The surface normal has a value of ``(0, -1)`` because this is a horizontal surface. When the ball collides, we take its remaining motion (the amount left over when it hits the surface) and reflect it using the normal. In Godot, there is a :ref:`bounce() <class_Vector2_method_bounce>` method to handle this. Here is a code example of the above diagram using a :ref:`CharacterBody2D <class_CharacterBody2D>`:
de: Die Oberflächennormale hat den Wert ``(0, -1)``, da es sich um eine horizontale Fläche handelt. Wenn der Ball aufprallt, nehmen wir seine verbleibende Bewegung (die Menge, die übrig bleibt, wenn er auf die Oberfläche trifft) und reflektieren sie mit Hilfe der Normalen. In Godot gibt es eine Methode :ref:`bounce() <class_Vector2_method_bounce>`, um dies zu behandeln. Hier ist ein Code-Beispiel für das obige Diagramm unter Verwendung eines :ref:`CharacterBody2D <class_CharacterBody2D>`:
zh_tw: 因為這是一個水平曲面，所以曲面法線的值為 ``(0, -1)`` . 當球碰撞時，我們取它的原運動方向(當它撞到表面時剩餘的量), 以法線為角平分線反射它。在Godot中， :ref:`Vector2 <class_Vector2>` 類有一個 ``bounce()`` 方法來處理這個問題。這是上圖的 GDScript 範例，使用 :ref:`KinematicBody2D <class_KinematicBody2D>`：

source: Dot product
de: Skalarprodukt
zh_tw: 點積

source: The **dot product** is one of the most important concepts in vector math, but is often misunderstood. Dot product is an operation on two vectors that returns a **scalar**. Unlike a vector, which contains both magnitude and direction, a scalar value has only magnitude.
de: Das **Skalarprodukt** ist eines der wichtigsten Konzepte in der Vektormathematik, wird allerdings oft falsch verstanden. Das Skalarprodukt ist eine Operation auf zwei Vektoren, die einen **Skalar** ergibt. Im Gegensatz zu einem Vektor, der sowohl den Betrag als auch die Richtung enthält, hat ein Skalarwert nur einen Betrag.
zh_tw: **點積**是向量數學中最重要的概念之一，但經常被誤解。點積是對兩個向量的操作，返回一個**標量**。與同時包含大小和方向的向量不同，標量值只有大小。

source: The formula for dot product takes two common forms:
de: Die Formel für das Skalarprodukt hat zwei übliche Formen:
zh_tw: 點積公式有兩種常見形式：

source: and
de: und
zh_tw: 與

source: The mathematical notation *||A||* represents the magnitude of vector ``A``, and *A*\ :sub:`x` means the ``x`` component of vector ``A``.
de: Die mathematische Notation *||A||* steht für den Betrag des Vektors ``A``, und *A*\ :sub:`x` bezeichnet die Komponente ``x`` des Vektors ``A``.
zh_tw: 數學符號 *||A||* 表示向量 ''A' 的大小，*A*\ ：sub：'x' 表示向量 ''A'' 的 'x' 分量。

source: However, in most cases it is easiest to use the built-in :ref:`dot() <class_Vector2_method_dot>` method. Note that the order of the two vectors does not matter:
de: In den meisten Fällen ist es jedoch am einfachsten, die built-in-Methode :ref:`dot() <class_Vector2_method_dot>` zu verwenden. Beachten Sie, dass die Reihenfolge der beiden Vektoren keine Rolle spielt:
zh_tw: 然而, 在大多數情況下, 使用內建方法是最容易的. 注意, 兩個向量的順序並不重要:

source: The dot product is most useful when used with unit vectors, making the first formula reduce to just ``cos(θ)``. This means we can use the dot product to tell us something about the angle between two vectors:
de: Das Skalarprodukt ist am nützlichsten, wenn es mit Einheitsvektoren verwendet wird, wodurch sich die erste Formel auf ``cos(θ)`` reduziert. Das bedeutet, dass wir das Skalarprodukt verwenden können, um uns etwas über den Winkel zwischen zwei Vektoren auszusagen:
zh_tw: 當與單位向量一起使用時，點積是最有用的，使得第一個公式減少到僅有 ``cosθ``。這意味著我們可以使用點積來告訴我們關於兩個向量之間的角度的一些資訊：

source: When using unit vectors, the result will always be between ``-1`` (180°) and ``1`` (0°).
de: Bei Verwendung von Einheitsvektoren liegt das Ergebnis immer zwischen ``-1`` (180°) und ``1`` (0°).
zh_tw: 當使用單位向量, 結果總是會在 ``-1`` (180°) 和 ``1`` (0°) 之間.

source: Facing
de: Blickrichtung
zh_tw: 面向問題

source: We can use this fact to detect whether an object is facing toward another object. In the diagram below, the player ``P`` is trying to avoid the zombies ``A`` and ``B``. Assuming a zombie's field of view is **180°**, can they see the player?
de: Wir können diese Tatsache nutzen, um festzustellen, ob ein Objekt einem anderen Objekt zugewandt ist. In der folgenden Abbildung versucht der Spieler ``P``, den Zombies ``A`` und ``B`` auszuweichen. Angenommen, das Sichtfeld eines Zombies ist **180°**, können sie den Spieler sehen?
zh_tw: 我們可以利用這個事實來偵測一個物體是否面向另一個物體. 在下圖中, 遊戲角色 ``P`` 試圖避開喪屍 ``A`` 和 ``B`` . 假設一個喪屍的視野是 **180°** , 他們能看到遊戲角色嗎?

source: The green arrows ``fA`` and ``fB`` are **unit vectors** representing the zombie's facing direction and the blue semicircle represents its field of view. For zombie ``A``, we find the direction vector ``AP`` pointing to the player using ``P - A`` and normalize it, however, Godot has a helper method to do this called :ref:`direction_to() <class_Vector2_method_direction_to>`. If the angle between this vector and the facing vector is less than 90°, then the zombie can see the player.
de: Die grünen Pfeile ``fA`` und ``fB`` sind **Einheitsvektoren**, und stellen die Blickrichtung des Zombies dar, und der blaue Halbkreis repräsentiert sein Sichtfeld. Für den Zombie ``A`` finden wir den Richtungsvektor ``AP``, der auf den Spieler zeigt, indem wir ``P - A`` verwenden und ihn normieren. Godot hat dafür eine Hilfsmethode namens :ref:`direction_to() <class_Vector2_method_direction_to>`. Wenn der Winkel zwischen diesem Vektor und dem gegenüberliegenden Vektor kleiner als 90° ist, kann der Zombie den Spieler sehen.
zh_tw: 綠色箭頭 ``fA`` 和 ``fB`` 是 **單位向量** , 代表僵屍的朝向, 藍色半圓代表其視野. 對於僵屍 ``A`` , 我們用 ``P - A`` 找到指向玩家的方向向量 ``AP`` , 並進行正規化處理, 不過,Godot有一個輔助方法可以做到這一點, 叫做 ``direction_to`` . 如果這個向量和面對的向量之間的角度小於90°, 那麼僵屍就可以看到玩家.

source: In code it would look like this:
de: Der entsprechende Code sieht so aus:
zh_tw: 在程式碼中是這樣的:

source: Cross product
de: Kreuzprodukt
zh_tw: 外積

source: Like the dot product, the **cross product** is an operation on two vectors. However, the result of the cross product is a vector with a direction that is perpendicular to both. Its magnitude depends on their relative angle. If two vectors are parallel, the result of their cross product will be a null vector.
de: Wie das Skalarprodukt ist das **Kreuzprodukt** eine Operation auf zwei Vektoren. Das Ergebnis des Kreuzprodukts ist jedoch ein Vektor mit einer Richtung, die senkrecht zu beiden ist. Ihr Betrag hängt von ihrem relativen Winkel ab. Wenn zwei Vektoren parallel sind, ist das Ergebnis ihres Kreuzprodukts ein Nullvektor.
zh_tw: 和點積一樣，**外積**也是對兩個向量的運算。但是，叉乘積的結果是一個方向與兩個向量垂直的向量。它的大小取決於相對角度，如果兩個向量是平行的，那麼外積的結果將是一個空向量。

source: The cross product is calculated like this:
de: Das Kreuzprodukt wird wie folgt berechnet:
zh_tw: 外積是這樣計算的：

source: With Godot, you can use the built-in :ref:`Vector3.cross() <class_Vector3_method_cross>` method:
de: Mit Godot können Sie die Built-in-Methode :ref:`Vector3.cross() <class_Vector3_method_cross>` verwenden:
zh_tw: 使用 Godot，您可以使用內建的方法：

source: The cross product is not mathematically defined in 2D. The :ref:`Vector2.cross() <class_Vector2_method_cross>` method is a commonly used analog of the 3D cross product for 2D vectors.
de: Das Kreuzprodukt ist in 2D nicht mathematisch definiert. Die Methode :ref:`Vector2.cross() <class_Vector2_method_cross>` ist ein häufig verwendetes Analogon des 3D-Kreuzprodukts für 2D-Vektoren.
zh_tw: 外積沒有在二維中以數學方式定義。 Vector2.cross() <class_Vector2_method_cross>` 方法是2D 向量 3D 外積的常用模擬。

source: In the cross product, order matters. ``a.cross(b)`` does not give the same result as ``b.cross(a)``. The resulting vectors point in **opposite** directions.
de: Im Kreuzprodukt ist die Reihenfolge wichtig. ``a.cross(b)`` liefert nicht das gleiche Ergebnis wie ``b.cross(a)``. Die resultierenden Vektoren zeigen in **entgegengesetzte** Richtungen.
zh_tw: 在外積中，順序很重要。``a.cross(b)`` 和 ``b.cross(a)`` 的結果不一樣，會得到指向相反的向量。

source: Calculating normals
de: Normalen berechnen
zh_tw: 法線計算
