Repository: caiguang/godot-docs
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/vectors_advanced.po
Languages: de, zh_tw

source: Advanced vector math
de: Fortgeschrittene Vektormathematik
zh_tw: 高等向量數學

source: Planes
de: Flächen
zh_tw: 平面

source: The dot product has another interesting property with unit vectors. Imagine that perpendicular to that vector (and through the origin) passes a plane. Planes divide the entire space into positive (over the plane) and negative (under the plane), and (contrary to popular belief) you can also use their math in 2D:
de: Das Skalarprodukt hat eine weitere interessante Eigenschaft bei Einheitsvektoren. Stellen Sie sich vor, dass senkrecht zu diesem Vektor (und durch den Ursprung) eine Ebene verläuft. Ebenen teilen den gesamten Raum in positiv (über der Ebene) und negativ (unter der Ebene). Entgegen der landläufigen Meinung können Sie ihre Mathematik auch in 2D verwenden:
zh_tw: 單位向量的點積還有一個有趣的性質。請想像垂直於這個向量（通過原點）經過一個平面。平面將整個空間劃分為正（在平面上）和負（在平面下），而（與普遍的看法相反）您也可以在 2D 中進行這樣的數學運算：

source: Unit vectors that are perpendicular to a surface (so, they describe the orientation of the surface) are called **unit normal vectors**. Though, usually they are just abbreviated as *normals*. Normals appear in planes, 3D geometry (to determine where each face or vertex is siding), etc. A **normal** *is* a **unit vector**, but it's called *normal* because of its usage. (Just like we call (0,0) the Origin!).
de: Einheitsvektoren, die senkrecht zu einer Oberfläche stehen (sie beschreiben also die Ausrichtung der Oberfläche), werden als **Einheitsnormalenvektoren** bezeichnet. Normalerweise werden sie jedoch nur als *Normalen* abgekürzt. Normalen erscheinen in Ebenen, 3D-Geometrie (um zu bestimmen, wo sich jede Fläche oder jeder Vertex befindet) usw. Eine **Normale** *ist*ein **Einheitsvektor**, wird aber aufgrund seiner Verwendung *Normale* genannt. (Genau wie wir (0,0) den Ursprung nennen!).
zh_tw: 垂直於表面的單位向量稱為**單位法向量**（因此，它們描述的是表面的朝向）。不過，通常會把它們縮寫為*法線*。平面、3D 幾何體等場合中都會用到法線（用來確定各個面或頂點的側邊）。**法線**是一種**單位向量**，因為用途才被稱為*法線*。（就像我們說座標 (0,0) 是“原點”一樣！）。

source: The plane passes by the origin and the surface of it is perpendicular to the unit vector (or *normal*). The side towards the vector points to is the positive half-space, while the other side is the negative half-space. In 3D this is exactly the same, except that the plane is an infinite surface (imagine an infinite, flat sheet of paper that you can orient and is pinned to the origin) instead of a line.
de: Die Ebene geht durch den Ursprung und ihre Oberfläche steht senkrecht auf dem Einheitsvektor (oder *Normalen*). Die Seite, auf die der Vektor zeigt, ist der positive Halbraum, während die andere Seite der negative Halbraum ist. In 3D ist dies genau dasselbe, nur dass die Ebene eine unendliche Fläche ist und keine Linie (stellen Sie sich ein unendliches, flaches Blatt Papier vor, das Sie ausrichten können und das an den Ursprung geheftet ist).
zh_tw: 它就像看起來那樣簡單. 平面經過原點, 它的表面垂直於單位向量(或 *法線* ). 指向向量的一邊是正半空間, 而另一邊是負半空間. 在3維空間中, 這完全相同, 除了平面是一個無限的表面(想像一張無限伸展的平坦紙張, 它固定在原點)而不是直線.

source: Distance to plane
de: Abstand zur Fläche
zh_tw: 到平面的距離

source: Now that it's clear what a plane is, let's go back to the dot product. The dot product between a **unit vector** and any **point in space** (yes, this time we do dot product between vector and position), returns the **distance from the point to the plane**:
de: Nachdem klar ist, was eine Ebene ist, kehren wir zum Skalarprodukt zurück. Das Skalarprodukt zwischen einem **Einheitsvektor** und einem beliebigen **Punkt im Raum** (ja, diesmal machen wir ein Skalarprodukt zwischen Vektor und Position) gibt den **Abstand vom Punkt zur Ebene** zurück:
zh_tw: 現在平面是什麼就很清楚了，讓我們再回到點積上。**單位向量**和任何**空間點**之間的點積（是的，這次我們在向量和位置之間進行點乘），將返回**從該點到平面的距離**：

source: But not just the absolute distance, if the point is in the negative half space the distance will be negative, too:
de: Aber nicht nur die absolute Entfernung: wenn sich der Punkt im negativen Halbraum befindet, ist auch die Entfernung negativ:
zh_tw: 但不僅僅是絕對距離, 如果點在負半空間中, 距離也是負的:

source: This allows us to tell which side of the plane a point is.
de: Dies erlaubt uns zu sagen, auf welcher Seite der Ebene ein Punkt sich befindet.
zh_tw: 這使我們能夠知道點在平面的哪一側.

source: Away from the origin
de: Wegbewegen vom Ursprung
zh_tw: 遠離原點

source: I know what you are thinking! So far this is nice, but *real* planes are everywhere in space, not only passing through the origin. You want real *plane* action and you want it *now*.
de: Ich weiß was Sie denken! Schön und gut, aber *echte* Ebenen sind überall im Raum und durchqueren nicht unbedingt den Ursprung. Sie wollen echte *Ebenen* und Sie möchten sie *jetzt*.
zh_tw: 我知道您在想什麼！到目前為止, 這還不錯, 但 *真正的* 平面在空間中無處不在, 而不僅僅是通過原點的平面. 您想要真正的 *平面* , 您 *現在* 就想行動起來.

source: Remember that planes not only split space in two, but they also have *polarity*. This means that it is possible to have perfectly overlapping planes, but their negative and positive half-spaces are swapped.
de: Bedenken Sie, dass Ebenen nicht nur den Raum teilen, sie haben auch eine *Polarität*. Das bedeutet, es können zwei perfekt überlappende Ebenen vorhanden sein, aber deren positive und negative Halb-Räume sind vertauscht.
zh_tw: 記住, 平面不僅把空間分成兩半, 而且它們還有 *極性* . 這意味著有可能有完全重疊的平面, 但是它們的負半空間和正半空間是相反的.

source: With this in mind, let's describe a full plane as a **normal** *N* and a **distance from the origin** scalar *D*. Thus, our plane is represented by N and D. For example:
de: Mit diesem Wissen können wir nun eine komplette Ebene als **normale** *N* und eine **Distanz vom Ursprung** als Skalar *D* bezeichnen. Somit wird unsere Ebene mittels N und D repräsentiert, zum Beispiel:
zh_tw: 記住這一點, 讓我們將整個平面描述為 **法線** *N* 和 **距原點的距離** 標量 *D* . 因此, 我們的平面將由N和D表示, 例如:

source: For 3D math, Godot provides a :ref:`Plane <class_Plane>` built-in type that handles this.
de: Für 3D-Mathematik bietet Godot einen Built-in-Typ :ref:`Plane <class_Plane>`, der dies handhabt.
zh_tw: 對於3維的情況,Godot提供了一個 :ref:`Plane <class_Plane>` 內建型別來處理這個問題.

source: Basically, N and D can represent any plane in space, be it for 2D or 3D (depending on the amount of dimensions of N) and the math is the same for both. It's the same as before, but D is the distance from the origin to the plane, travelling in N direction. As an example, imagine you want to reach a point in the plane, you will just do:
de: Grundsätzlich können N und D jede Ebene im Raum darstellen, sei es für 2D oder 3D (abhängig von der Anzahl der Dimensionen von N), und die Mathematik ist für beide gleich. Es ist das gleiche wie zuvor, aber D ist die Entfernung vom Ursprung zur Ebene in N-Richtung. Stellen Sie sich als Beispiel vor, Sie möchten einen Punkt in der Ebene erreichen. Sie tun einfach Folgendes:
zh_tw: 基本上,N和D可以表示空間中的任何平面, 無論是對於2D還是3D(取決於變數N的維數), 數學上對於兩者都是一樣的. 和以前差不多, 但D是原點沿N方向移動到平面的距離. 例如, 想像一下您想在到達平面上的一個點, 您會這樣做:

source: This will stretch (resize) the normal vector and make it touch the plane. This math might seem confusing, but it's actually much simpler than it seems. If we want to tell, again, the distance from the point to the plane, we do the same but adjusting for distance:
de: Dadurch wird der Normalenvektor gedehnt (seine Größe geändert) und er berührt die Ebene. Diese Mathematik mag verwirrend erscheinen, ist aber tatsächlich viel einfacher als es scheint. Wenn wir noch einmal die Entfernung vom Punkt zur Ebene angeben möchten, tun wir dasselbe, passen jedoch die Entfernung an:
zh_tw: 這將拉伸(調整大小)法線向量並使其接觸平面. 這個數學可能看起來很疑惑, 但實際上比看起來簡單得多. 如果我們想再說一遍, 從點到平面的距離, 我們也會這樣做, 但是要調整距離:

source: The same thing, using a built-in function:
de: Das Gleiche mit einer Built-in-Funktion:
zh_tw: 使用內建函式做同樣的事情:

source: This will, again, return either a positive or negative distance.
de: Dies wird wiederum entweder eine positive oder negative Distanz zurückliefern.
zh_tw: 這將再次返回一個正或負的距離.

source: Flipping the polarity of the plane can be done by negating both N and D. This will result in a plane in the same position, but with inverted negative and positive half spaces:
de: Das Umdrehen der Polarität der Ebene kann durch Negieren von N und D erfolgen. Dies führt zu einer Ebene an derselben Position, jedoch mit invertierten negativen und positiven Halbräumen:
zh_tw: 翻轉平面的極性可以通過同時對N和D取負來完成. 這將導致平面處於相同的位置, 但是具有反轉的負半空間和正半空間:

source: Godot also implements this operator in :ref:`Plane <class_Plane>`. So, using the format below will work as expected:
de: Godot implementiert diesen Operator auch in :ref:`Plane <class_Plane>`. Die Verwendung des folgenden Formats funktioniert also wie erwartet:
zh_tw: 當然,Godot也在 :ref:`Plane <class_Plane>` 中實作這個操作, 像這樣:

source: So, remember, the plane's main practical use is that we can calculate the distance to it. So, when is it useful to calculate the distance from a point to a plane? Let's see some examples.
de: Denken Sie also daran, dass der wichtigste praktische Nutzen der Ebene darin besteht, dass wir die Entfernung zu ihr berechnen können. Wann ist es also sinnvoll, die Entfernung zwischen einem Punkt und einer Ebene zu berechnen? Sehen wir uns einige Beispiele an.
zh_tw: 所以, 記住, 平面就是這樣, 它的主要用途就是計算到它的距離. 那麼, 為什麼計算一個點到一個平面的距離是有用的呢？非常有用！讓我們來看一些簡單範例.

source: Constructing a plane in 2D
de: Eine Ebene in 2D erstellen
zh_tw: 在二維空間中建構平面

source: Planes clearly don't come out of nowhere, so they must be built. Constructing them in 2D is easy, this can be done from either a normal (unit vector) and a point, or from two points in space.
de: Ebenen kommen natürlich nicht aus dem Nichts, also müssen sie gebaut werden. Das Konstruieren in 2D ist einfach. Dies kann entweder aus einer Normalen (Einheitsvektor) und einem Punkt oder aus zwei Punkten im Raum erfolgen.
zh_tw: 平面顯然不是從哪兒冒出來的, 所以必須建構. 在2D中建構它們很簡單, 這可以從法線(單位向量)和點, 或者用2維空間中的兩個點來完成.

source: In the case of a normal and a point, most of the work is done, as the normal is already computed, so calculate D from the dot product of the normal and the point.
de: Im Falle einer Normalen und eines Punktes ist die meiste Arbeit bereits getan, da die Normale bereits berechnet ist. Berechnen Sie also D aus dem Skalarprodukt der Normalen und des Punktes.
zh_tw: 針對法線和點的情況，大部分工作已經完成，因為當法線已經計算出來時，只需從法線和點的點積得到 D。

source: For two points in space, there are actually two planes that pass through them, sharing the same space but with normal pointing to the opposite directions. To compute the normal from the two points, the direction vector must be obtained first, and then it needs to be rotated 90° degrees to either side:
de: Für zwei Punkte im Raum gibt es tatsächlich zwei Ebenen, die durch sie hindurchgehen und denselben Raum teilen, aber mit Normalen, die in entgegengesetzte Richtungen zeigen. Um die Normale aus den beiden Punkten zu berechnen, muss zuerst der Richtungsvektor ermittelt und dann um 90 ° nach beiden Seiten gedreht werden:
zh_tw: 對於空間中的兩個點, 實際上會有兩個平面同時經過它們, 它們共用相同的空間, 但是法線方向相反. 為了從這兩個點計算面的法線, 必須首先獲得方向向量, 然後將向任何一邊旋轉90°:

source: The rest is the same as the previous example. Either point_a or point_b will work, as they are in the same plane:
de: Der Rest ist dasselbe wie im vorherigen Beispiel. Entweder point_a oder point_b funktionieren, da sie in der gleichen Ebene liegen:
zh_tw: 其餘的與前面的範例相同,point_a或point_b都可以工作, 因為它們在相同的平面中:

source: Doing the same in 3D is a little more complex and is explained further down.
de: Das Gleiche in 3D zu tun, ist etwas komplexer und wird weiter unten erklärt.
zh_tw: 在3D中做同樣的操作稍微複雜一些, 下面將進一步解釋.

source: Some examples of planes
de: Einige Beispiele von Ebenen
zh_tw: 平面的一些範例

source: Here is an example of what planes are useful for. Imagine you have a `convex <https://www.mathsisfun.com/definitions/convex.html>`__ polygon. For example, a rectangle, a trapezoid, a triangle, or just any polygon where no faces bend inwards.
de: Hier ist ein Beispiel dafür, wozu Ebenen nützlich sind. Stellen Sie sich vor, Sie haben ein `konvexes <https://www.mathsisfun.com/definitions/convex.html>`__ Polygon. Zum Beispiel ein Rechteck, ein Trapez, ein Dreieck oder einfach ein beliebiges Polygon, bei dem keine Fläche nach innen gebogen ist.
zh_tw: 這裡有一個簡單的範例, 說明平面的用途. 假設您有一個 `凸 <https://www.mathsisfun.com/definitions/convex.html>`__ 多邊形. 例如, 矩形, 梯形, 三角形或任何沒有向內彎曲的多邊形.

source: For every segment of the polygon, we compute the plane that passes by that segment. Once we have the list of planes, we can do neat things, for example checking if a point is inside the polygon.
de: Für jedes Segment des Polygons berechnen wir die Ebene, die an diesem Segment vorbeigeht. Sobald wir die Liste der Ebenen haben, können wir tolle Dinge tun, zum Beispiel prüfen, ob sich ein Punkt innerhalb des Polygons befindet.
zh_tw: 對多邊形的每個部分, 我們計算出經過該部分的平面. 一旦我們有了平面的列表, 我們就可以做些分類的事情, 例如檢查一個點是否在多邊形內部.

source: We go through all planes, if we can find a plane where the distance to the point is positive, then the point is outside the polygon. If we can't, then the point is inside.
de: Wir gehen alle Ebenen durch. Wenn wir eine Ebene finden, deren Abstand zum Punkt positiv ist, liegt der Punkt außerhalb des Polygons, andernfalls liegt der Punkt innerhalb.
zh_tw: 我們走訪所有平面, 如果我們能找到使得點到平面的距離為正的平面, 那麼點在多邊形之外. 如果我們不能, 那麼這一點就在多邊形內部.

source: Code should be something like this:
de: Der Code sollte ungefähr so aussehen:
zh_tw: 程式碼應該是這樣的:

source: Pretty cool, huh? But this gets much better! With a little more effort, similar logic will let us know when two convex polygons are overlapping too. This is called the Separating Axis Theorem (or SAT) and most physics engines use this to detect collision.
de: Ziemlich cool, oder? Aber es wird noch viel besser! Mit etwas mehr Aufwand verrät uns eine ähnliche Logik, wann sich zwei konvexe Polygone überlappen. Dies wird als Separating Axis Theorem (SAT) bezeichnet, und die meisten Physik-Engines verwenden dies, um Kollisionen zu erkennen.
zh_tw: 很酷, 是吧？但這可以變得更好！稍加努力, 類似的邏輯將讓我們知道兩個凸多邊形是否重疊. 這叫做分離軸定理(或SAT), 大多數物理引擎都用這個來偵測碰撞.

source: With a point, just checking if a plane returns a positive distance is enough to tell if the point is outside. With another polygon, we must find a plane where *all* *the* *other* *polygon* *points* return a positive distance to it. This check is performed with the planes of A against the points of B, and then with the planes of B against the points of A:
de: Bei einem Punkt reicht es aus, nur zu überprüfen, ob eine Ebene eine positive Entfernung zurückgibt, um festzustellen, ob der Punkt außerhalb liegt. Bei einem anderen Polygon müssen wir eine Ebene finden, in der *alle* *anderen* *Polygon-Punkte* einen positiven Abstand zurückgeben. Diese Prüfung wird mit den Ebenen von A gegen die Punkte von B und dann mit den Ebenen von B gegen die Punkte von A durchgeführt:
zh_tw: 對於一個點, 僅僅檢查一個平面是否返回正距離就足以判斷該點是否在外面. 對於一個多邊形, 我們必須找到一個平面, 使得另一個多邊形上的所有點到它的距離為正. 這種可以用A平面對B點進行檢查, 然後用B平面對A點進行檢查:

source: As you can see, planes are quite useful, and this is the tip of the iceberg. You might be wondering what happens with non convex polygons. This is usually just handled by splitting the concave polygon into smaller convex polygons, or using a technique such as BSP (which is not used much nowadays).
de: Wie Sie sehen können, sind Ebenen sehr nützlich, und dies ist erst die Spitze des Eisbergs. Sie fragen sich vielleicht, was mit nicht konvexen Polygonen passiert. Dies wird in der Regel einfach durch Aufteilung des konkaven Polygons in kleinere konvexe Polygone oder durch eine Technik wie BSP bewerkstelligt (die heutzutage nicht mehr so häufig verwendet wird).
zh_tw: 正如您所看到的, 平面是非常有用的, 然而這只是冰山一角. 您可能想知道非凸多邊形會發生什麼. 這通常只是通過將凹多邊形分割成較小的凸多邊形來處理, 或者使用諸如BSP(現在使用得不多)之類的技術.

source: Collision detection in 3D
de: Kollisionserkennung in 3D
zh_tw: 三維碰撞偵測

source: This is another bonus bit, a reward for being patient and keeping up with this long tutorial. Here is another piece of wisdom. This might not be something with a direct use case (Godot already does collision detection pretty well) but it's used by almost all physics engines and collision detection libraries :)
de: Jetzt kommt ein weiterer Bonus, eine Belohnung für die Geduld und das Durchhalten in diesem langen Tutorial. Hier ist ein weiterer kluger Ratschlag. Dies ist vielleicht nicht etwas für einen direkten Anwendungsfall (Godot macht Kollisionserkennung bereits ziemlich gut), aber es wird von fast allen Physik-Engines und Kollisionserkennungs-Bibliotheken verwendet :)
zh_tw: 這是另一個獎勵, 是對耐心並跟上這個漫長的教學的獎勵. 這是另一條錦囊妙計. 這可能不能直接拿來使用(Godot已經可以進行了相當棒的碰撞偵測了), 但是幾乎所有的物理引擎和碰撞偵測庫都使用它的原理:)

source: Remember that converting a convex shape in 2D to an array of 2D planes was useful for collision detection? You could detect if a point was inside any convex shape, or if two 2D convex shapes were overlapping.
de: Erinnern Sie sich, dass das Konvertieren einer konvexen Form in 2D in ein Array von 2D-Ebenen für die Kollisionserkennung hilfreich war? Sie konnten feststellen, ob sich ein Punkt innerhalb einer konvexen Form befand oder ob sich zwei konvexe 2D-Formen überlappten.
zh_tw: 還記得把2D中的凸形轉換成2D平面陣列對碰撞偵測有用嗎？您可以偵測一個點是否在任何凸形狀內, 或者兩個2D凸形狀是否重疊.

source: Well, this works in 3D too, if two 3D polyhedral shapes are colliding, you won't be able to find a separating plane. If a separating plane is found, then the shapes are definitely not colliding.
de: Nun, dies funktioniert auch in 3D. Wenn zwei vielflächige 3D-Formen kollidieren, können Sie keine Trennebene finden. Wenn eine Trennebene gefunden wird, kollidieren die Formen definitiv nicht.
zh_tw: 嗯, 這在3D中也適用, 如果兩個3D多面體形狀碰撞, 您將無法找到分離平面. 如果發現一個分離平面, 那麼形狀肯定不會發生碰撞.

source: To refresh a bit a separating plane means that all vertices of polygon A are in one side of the plane, and all vertices of polygon B are in the other side. This plane is always one of the face-planes of either polygon A or polygon B.
de: Zur Erinnerung: Trennebene bedeutet, dass sich alle Vertices des Polygons A auf einer Seite der Ebene und alle Vertices des Polygons B auf der anderen Seite befinden. Diese Ebene ist immer eine der Flächenebenen von Polygon A oder Polygon B.
zh_tw: 要得到分離平面意味著多邊形A的所有頂點都在平面的一側, 而多邊形B的所有頂點都在另一側. 該平面始終是多邊形A或多邊形B的面向平面之一.

source: In 3D though, there is a problem to this approach, because it is possible that, in some cases a separating plane can't be found. This is an example of such situation:
de: In 3D gibt es jedoch ein Problem bei diesem Ansatz, da es möglich ist, dass in einigen Fällen keine Trennebene gefunden werden kann. Dies ist ein Beispiel für eine solche Situation:
zh_tw: 然而在3D中, 這種方法存在一個問題, 因為在某些情況下可能找不到分離平面. 下面就是這種情況的一個範例:

source: To avoid it, some extra planes need to be tested as separators, these planes are the cross product between the edges of polygon A and the edges of polygon B
de: Um dies zu vermeiden, müssen einige zusätzliche Ebenen als Trennobjekte getestet werden. Diese Ebenen sind das Kreuzprodukt zwischen den Kanten des Polygons A und den Kanten des Polygons B
zh_tw: 為了避免這種情況，一些額外的平面需要作為分隔器被測試，這些平面是多邊形 A 的邊和多邊形 B 的邊的外積

source: So the final algorithm is something like:
de: Der endgültige Algorithmus sieht also ungefähr so aus:
zh_tw: 所以最後的演算法是這樣的:

source: More information
de: Weitere Informationen
zh_tw: 更多資訊

source: For more information on using vector math in Godot, see the following article:
de: Für weitere Informationen zur Benutzung von Vektormathematik in Godot, siehe folgenden Artikel:
zh_tw: 關於在Godot中使用向量數學的更多資訊, 請參見以下文章:

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video series "Essence of Linear Algebra": https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab
de: Wenn Sie weiterführende Erklärungen wünschen, sollten Sie sich die exzellente Videoserie "Essence of Linear Algebra" von 3Blue1Brown ansehen: https://www.youtube.com/watch?v=fNk_zzaMoSs&list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab
zh_tw: 如果你需要進一步的解釋，你可以看看 3Blue1Brown 的絕佳的系列影片《線性代數的本質》：http://www.bilibili.com/video/BV1ys411472E?p=2

source: Translation status
de: Übersetzungsstatus
zh_tw: 翻譯狀態
